{
  "company": "2060.io",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "0": 4
    }
  },
  "sample_docs": [
    "About Empowering users to control their data, while offering open solutions for institutions to build decentralised, trustable, and secure services. about the rationale behind our 2060 and the team behind it. Empowering users to control their data, while offering open solutions for institutions to build decentralised, trustable, and secure services. about the rationale behind our 2060 and the team behind it. Our Vision Our Vision We aspire to offer open-standards-based tools that will democratise the usage of Verifiable Credentials. We provide the building blocks that enable fully interoperable that enable fully peer-to-peer group communication channels ,with no vendor lock-in. Our goal is to empower end-users with data control and privacy , while advancing trust between entities. We aspire to offer open-standards-based tools that will democratise the usage of Verifiable Credentials. We provide the building blocks that enable fully interoperable that enable fully peer-to-peer group communication channels ,with no vendor lock-in. Our goal is to empower end-users with data control and privacy , while advancing trust between entities. Genesis Fabrice Rochette Co-Founder and CEO Visionary entrepreneur with solid technical background and proven capacity of innovation. Ariel Gentile Co-Founder and CTO All-terrain engineer motivated to use his knowledge to bring true benefits to the people. A warrior combating usage of the technology for the wrong reasons. Visionary entrepreneur with solid technical background and proven capacity of innovation. All-terrain engineer motivated to use his knowledge to bring true benefits to the people. A warrior combating usage of the technology for the wrong reasons. Contact Us Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Contact Newsletter Subscribe to our Newsletter Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data. Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data.",
    "Features Create anonymous, decentralised, sophisticated and interoperable chat connections between Users and Services. For Companies and Institutions Pro For end-users Users Build Our open-source SDK is based on established, proven standards and allows you to rapidly build chatbots or apps around your products and services, at no cost. Issue Deliver various types of credentials to end-users, including identity cards, banking cards, graduation certificates, and many other types of credentials. Verify Verify trusted credentials issued by your organisation or your partners, to secure the authentication of connections to your products and services. Chat Similar to your favourite messaging apps, chat with friends, family and chatbots, while having total control over who can contact you, and what to share with them. Access Add Verifiable Credentials connections from validated organisations, to access products and services. Control Manage how your personal information is shared when a request is made. Generate zero-knowledge proofs to only disclose necessary credential data. Create anonymous, decentralised, sophisticated and interoperable chat connections between Users and Services. For Companies and Institutions Pro Our open-source SDK is based on established, proven standards and allows you to rapidly build chatbots or apps around your products and services, at no cost. Deliver various types of credentials to end-users, including identity cards, banking cards, graduation certificates, and many other types of credentials. Verify trusted credentials issued by your organisation or your partners, to secure the authentication of connections to your products and services. Similar to your favourite messaging apps, chat with friends, family and chatbots, while having total control over who can contact you, and what to share with them. Add Verifiable Credentials connections from validated organisations, to access products and services. Manage how your personal information is shared when a request is made. Generate zero-knowledge proofs to only disclose necessary credential data. Hologram Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Unlike other messaging apps, Hologram is a self-custody app, which means user's data is only stored on device, and exclusively under user's control. Get a sneak peak of the above- mentioned features and more by downloading the Hologram app now. Play Store App Store Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Unlike other messaging apps, Hologram is a self-custody app, which means user's data is only stored on device, and exclusively under user's control. Get a sneak peak of the above- mentioned features and more by downloading the Hologram app now. Use Cases ID card issuance for GOVs Use our open source software to quickly enable issuance of Verifiable ID Cards to citizens. Eradicate identity fraud and theft in no time. ID card issuance for GOVs Make sure to scan this QR code with the Hologram App. Fast KYC for B2C companies Authenticate your users and verify their identity in no time by comparing Verifiable Credential data with user biometrics using our open source software. Fast KYC for B2C companies Make sure to scan this QR code with the Hologram App. Decentralized chatbots Build your own chatbots by embedding our open source software containers in your applications or services. Check this out with the AvatarID chatbot. Decentralized chatbots Make sure to scan this QR code with the Hologram App. Proof of Humanity Restrict access to your services to human only by just let them flash a QR Code and present an AvatarID Verifiable Credential. Proof of Humanity Make sure to scan this QR code with the Hologram App. ID card issuance for GOVs Use our open source software to quickly enable issuance of Verifiable ID Cards to citizens. Eradicate identity fraud and theft in no time. ID card issuance for GOVs Make sure to scan this QR code with the Hologram App. Fast KYC for B2C companies Authenticate your users and verify their identity in no time by comparing Verifiable Credential data with user biometrics using our open source software. Fast KYC for B2C companies Make sure to scan this QR code with the Hologram App. Build your own chatbots by embedding our open source software containers in your applications or services. Check this out with the AvatarID chatbot. Make sure to scan this QR code with the Hologram App. Restrict access to your services to human only by just let them flash a QR Code and present an AvatarID Verifiable Credential. Make sure to scan this QR code with the Hologram App. Contact Us Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Contact Newsletter Subscribe to our Newsletter Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data. Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data.",
    "Use Cases Promote verifiable credential adoption through enabling trusted interactions between entities and individuals. How chatbot-based customisable interactions can be utilised to provision services while maintaining integrity and control of data and resources. Promote verifiable credential adoption through enabling trusted interactions between entities and individuals. How chatbot-based customisable interactions can be utilised to provision services while maintaining integrity and control of data and resources. Verifiable ID card issuance for Governments Verifiable ID card issuance for Governments Use our open source software to quickly enable issuance of Verifiable ID Cards to citizens. Eradicate identity fraud and theft in no time by generalizing secure remote identity verification in your country. Make sure to scan this QR code with the Hologram App. Non-repudiable five minute KYC for B2C companies Non-repudiable five minute KYC for B2C companies Authenticate your users and verify their identity in no time by comparing Verifiable Credential data with user biometrics using our open source software. Make sure to scan this QR code with the Hologram App. Build intelligent decentralized chatbots Build intelligent decentralized chatbots Build your own chatbots by embedding our open source software containers in your applications or services. Check this out with the AvatarID chatbot! Make sure to scan this QR code with the Hologram App. Proof of Humanity Proof of Humanity Restrict access to your services to human only by just let them flash a QR Code and present an AvatarID Verifiable Credential. Make sure to scan this QR code with the Hologram App. Verifiable ID card issuance for Governments Verifiable ID card issuance for Governments Use our open source software to quickly enable issuance of Verifiable ID Cards to citizens. Eradicate identity fraud and theft in no time by generalizing secure remote identity verification in your country. Make sure to scan this QR code with the Hologram App. Non-repudiable five minute KYC for B2C companies Non-repudiable five minute KYC for B2C companies Authenticate your users and verify their identity in no time by comparing Verifiable Credential data with user biometrics using our open source software. Make sure to scan this QR code with the Hologram App. Build intelligent decentralized chatbots Build intelligent decentralized chatbots Build your own chatbots by embedding our open source software containers in your applications or services. Check this out with the AvatarID chatbot! Make sure to scan this QR code with the Hologram App. Restrict access to your services to human only by just let them flash a QR Code and present an AvatarID Verifiable Credential. Make sure to scan this QR code with the Hologram App. Contact Us Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Contact Newsletter Subscribe to our Newsletter Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data. Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data.",
    "Hologram App Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Create fully authenticated chat connections where both parties are clearly identified. Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Create fully authenticated chat connections where both parties are clearly identified. Hologram Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Unlike other messaging apps, Hologram is a self-custody app, which means user's data is only stored on device, and exclusively under user's control. Get a sneak peak of the above- mentioned features and more by downloading the Hologram app now. Play Store App Store Hologram is a Verifiable Credential Wallet and Messaging App with true privacy preserving features. Unlike other messaging apps, Hologram is a self-custody app, which means user's data is only stored on device, and exclusively under user's control. Get a sneak peak of the above- mentioned features and more by downloading the Hologram app now. Contact Us Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Contact Newsletter Subscribe to our Newsletter Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data. Whether you have a question, a suggestion, want to collaborate, or just want to say hello, we're all ears. You can use the form on our website or send us your inquisitions. Looking forward to hearing from you! Leave us your email address and we will reach out to you with the latest updates on how we plan to accelerate Verifiable Credentials & Authentic Data adoption Thank you for subscribing to our newsletter Please refresh the page and try again Check our to see how we handle your data."
  ]
}