{
  "company": "accurascan.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 6,
    "-1": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.1666666666666666,
    "framing_market": 0.8333333333333334,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 6
    }
  },
  "sample_docs": [
    "Banking & Finance Banking and financial institutions deal with an array of documents on an everyday basis. Accurascan streamlines the handling of these documents by fast scanning and digitization. Ways Accurascan helps the banking & finance industry Declutter the desk by digitizing financial documents that have machine-readable data Eliminate the possibility of any loss or damage to vital documents by easy digitization and storage on a secured cloud server Reduction in manual typing of customer details that ultimately saves time Easy integration with an online application or existing app or customization to extend the scanning capability of Accurascan to scan all type of documents by opting for our SDK Benefits of Accura Scan Compatible with both Android and iOS platforms Availability of SDK for both Android and iOS platforms Availability of Web API and SDK which can be installed on your server Eliminates manual data entry errors Provides digital storage, saves costs of document copying, filing and storage Easy search, track, sort, print and report generation capabilities Automates the process of ID document collection, submission & filing Improves staff output To get a trial version of our SDK, please visit our contact us page. You can also drop a mail at connect@accurascan.com and know how our SDK can help you to fulfill your business needs. Banking and financial institutions deal with an array of documents on an everyday basis. Accurascan streamlines the handling of these documents by fast scanning and digitization. Ways Accurascan helps the banking & finance industry Declutter the desk by digitizing financial documents that have machine-readable data Eliminate the possibility of any loss or damage to vital documents by easy digitization and storage on a secured cloud server Reduction in manual typing of customer details that ultimately saves time Easy integration with an online application or existing app or customization to extend the scanning capability of Accurascan to scan all type of documents by opting for our SDK Benefits of Accura Scan Compatible with both Android and iOS platforms Availability of SDK for both Android and iOS platforms Availability of Web API and SDK which can be installed on your server Eliminates manual data entry errors Provides digital storage, saves costs of document copying, filing and storage Easy search, track, sort, print and report generation capabilities Automates the process of ID document collection, submission & filing Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required. Developer Dashboard Email us at connect@accurascan.com Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required.",
    "Secure User Registration This process prevents fraud by ensuring it can only be completed by real human users. If you already have an account, you can use your 3D Face to access your account. Choose Your Username Your username is the unique identifier that enables you to access your account on new devices. This can be a phone number, email address, or anonymous identifier Please provide valid Username Just center your face in the oval, then lean in for your close up when the oval expands. auth Processing 3D Face Data & Verifying Liveness One Moment Please... processing.. Processing... Face Authentication Complete! Thank you for using ZoOm Face Authentication Failed to try again This process prevents fraud by ensuring it can only be completed by real human users. If you already have an account, you can use your 3D Face to access your account. Just center your face in the oval, then lean in for your close up when the oval expands. Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required. Developer Dashboard Email us at connect@accurascan.com Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required.",
    "Accura Technolabs considers the privacy and personal information of customers and visitors as highly important. Accura Technolabs treats your personal information with outmost confidentiality. Accura Technolabs's security levels regarding the use of personal data are sufficient to be able to prevent unauthorized access, changes or loss of personal information. Cookies Accura Scan's website uses cookies. Cookies are small text files that are stored on your hard disk when you visit a website. If you use social media sharebuttons on the Accura Scan website, cookies are used to remember your social media settings for future use. The Accura Scan website uses Google Analytics, which is a Google Inc. (Google) web analysis service. Google Analytics uses cookies to analyse the use of the Accura Scan website and for reports on website activities. Information generated by these cookies is transferred and stored by Google on a USA-based server. For more information, see: http://www.google.com/policies/privacy/partners/ Newsletters Accura Scan regularly sends newsletters and invitations to people in our network who are interested. Every newsletter contains a link that allows you to unsubscribe. The list of subscribers is never shared with third parties. Demo App Accura Technolabs provides, through the Google Play Store and iTunes Store, the Accura Scan demo app, We provide this app free of charge to demonstrate and improve the underlying Accura Scan Application. What personal information is processed and stored? Accura Technolabs thus does not collect personal information. We do not know nor want to know who the users of our demo app are and whose identity documents are scanned. The app however does need to process the personal information that is on the MRZ of the identity document, including privacy-sensitive information like name, date of birth, personal number and document number. In addition, the app scans via Optical Character Recognition technology (or alternatively via manual entry) the date of birth, date of expiry and document number since these are needed to get access to the information on the passport. The app processes this information locally on the smartphone, i.e., the app does not send personal information to a server for processing. The personal information that is processed is not stored on the smartphone. How is the personal information secured? Since all the processing of personal information is done on the phone, the confidentiality of this information depends on the security of the phone. The app uses encrypted network connections for the communication of usage information. Accura Technolabs considers the privacy and personal information of customers and visitors as highly important. Accura Technolabs treats your personal information with outmost confidentiality. Accura Technolabs's security levels regarding the use of personal data are sufficient to be able to prevent unauthorized access, changes or loss of personal information. Accura Scan's website uses cookies. Cookies are small text files that are stored on your hard disk when you visit a website. If you use social media sharebuttons on the Accura Scan website, cookies are used to remember your social media settings for future use. The Accura Scan website uses Google Analytics, which is a Google Inc. (Google) web analysis service. Google Analytics uses cookies to analyse the use of the Accura Scan website and for reports on website activities. Information generated by these cookies is transferred and stored by Google on a USA-based server. For more information, see: http://www.google.com/policies/privacy/partners/ Accura Scan regularly sends newsletters and invitations to people in our network who are interested. Every newsletter contains a link that allows you to unsubscribe. The list of subscribers is never shared with third parties. Accura Technolabs provides, through the Google Play Store and iTunes Store, the Accura Scan demo app, We provide this app free of charge to demonstrate and improve the underlying Accura Scan Application. What personal information is processed and stored? Accura Technolabs thus does not collect personal information. We do not know nor want to know who the users of our demo app are and whose identity documents are scanned. The app however does need to process the personal information that is on the MRZ of the identity document, including privacy-sensitive information like name, date of birth, personal number and document number. In addition, the app scans via Optical Character Recognition technology (or alternatively via manual entry) the date of birth, date of expiry and document number since these are needed to get access to the information on the passport. The app processes this information locally on the smartphone, i.e., the app does not send personal information to a server for processing. The personal information that is processed is not stored on the smartphone. How is the personal information secured? Since all the processing of personal information is done on the phone, the confidentiality of this information depends on the security of the phone. The app uses encrypted network connections for the communication of usage information.",
    "Airlines The airline industry is currently undergoing a turbulent phase because of rising security concerns. An ID card scanner app like Accurascan inexpensively mitigates the security risks to a considerable extent. Ways Accurascan helps the airline industry Streamline the entire check-in process by passport scanning in less than a second & minimize manual typing of passport data Bar any non-staffer with a forged ID card through quick scanning of each staffer's ID card at entry points Easy record keeping of documents in a digital format on your server Seamless integration with any security app by use of SDK Benefits of Accura Scan Compatible with both Android and iOS platforms Availability of SDK for both Android and iOS platforms Availability of Web API and SDK which can be installed on your server Eliminates manual data entry errors Provides digital storage, saves costs of document copying, filing and storage Easy search, track, sort, print and report generation capabilities Automates the process of ID document collection, submission & filing Improves staff output To get a trial version of our SDK, please visit our contact us page. You can also drop a mail at connect@accurascan.com and know how our SDK can help you to fulfill your business needs. The airline industry is currently undergoing a turbulent phase because of rising security concerns. An ID card scanner app like Accurascan inexpensively mitigates the security risks to a considerable extent. Ways Accurascan helps the airline industry Streamline the entire check-in process by passport scanning in less than a second & minimize manual typing of passport data Bar any non-staffer with a forged ID card through quick scanning of each staffer's ID card at entry points Easy record keeping of documents in a digital format on your server Seamless integration with any security app by use of SDK Benefits of Accura Scan Compatible with both Android and iOS platforms Availability of SDK for both Android and iOS platforms Availability of Web API and SDK which can be installed on your server Eliminates manual data entry errors Provides digital storage, saves costs of document copying, filing and storage Easy search, track, sort, print and report generation capabilities Automates the process of ID document collection, submission & filing Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required. Developer Dashboard Email us at connect@accurascan.com Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required.",
    "Blog A Closer Look At Accurascan & Its Industry Specific Role. Accura Scan Participating in the Upcoming Mobile World Congress at Barcelona 08 Feb 2019 How Accurascan Can Be Your Perfect Boarding Pass Scanning Solution ? 08 Nov 2018 Accurascan Geared Up To Participate In the Upcoming FTE Asia EXPO 2018 29 Oct 2018 Accura Web SDK Decreases Wait-Time Of Airline Passengers 24 Oct 2018 Enjoy An Improved Inventory With PDF-417 Barcode Scanning App 12 Oct 2018 Accura Web SDK Upgrades Middle Eastern Document Scanning 10 Oct 2018 How Can Accurascan App Strengthen The Immigration Process? 05 Oct 2018 Scanning UK Passports Now Easy With Accurascan 28 Sep 2018 Accurascan Participating In the Upcoming Apex Expo 13 Sep 2018 Mobile OCR Scanning-A Cost Effective Solution To Meet Business Challenges 12 Sep 2018 Accura SDK - Powered With Pan Card & Aadhaar Card - Indian ID Card 27 Aug 2018 Accurascan - How It Can Benefit Telecom Companies 20 Aug 2018 Accura SDK - Everything You Should Know 13 Aug 2018 Banking & Finance Sector Gets Better With Accurascan 07 Aug 2018 AccuraGo – A Next Gen Scanning Solution 18 Jun 2018 Reasons Why Accurascan's SDK Is Essential For Different Industries 12 Jun 2018 Why Document Scanner App AccuraGo is Ideal For Your Paper-Intensive Business 04 Jun 2018 How Accurascan Web SDK Can Enhance User Experience 29 May 2018 Digital Management Of Banking Operations With Accurascan 23 May 2018 Accurascan Assures Security of Hotels 11 May 2018 Digitizing Paper Intensive Processes In Banks Using OCR Scanner 30 Apr 2018 3 Easy Ways To Increase The Security Of Your Apartment Complex 24 Apr 2018 Making The Move From Paper To Digital With Accurascan 20 Apr 2018 How an ID card Scanner Helps in Boosting Nightclub Security? 16 Apr 2018 Mobile Technology of Accurascan is Ideal for Mobile Network Providers 11 Apr 2018 Accurascan Assures Safety and Accuracy in Banking Operations 09 Apr 2018 Top 5 Benefits Of Using Accurascan In Banking Sector 06 Apr 2018 Delight Your Prepaid Customers with a Seamless Registration Process 04 Apr 2018 How Accurascan Helps Car Rental Companies To Stay Agile? 02 Apr 2018 Scanning Solutions Offered By Accurascan For Airlines Industry 30 Mar 2018 Benefits of Accurascan for Tour Operators 28 Mar 2018 How Does Accura Scan Serve Immigration Department? 26 Mar 2018 The Relation of ID Scanning App and Hotel Industry 23 Mar 2018 How useful are Document Scanning Apps for Airlines Industry? 16 Mar 2018 How To Scan Your Passport Data With The Easy Accurascan Mobile App 13 Mar 2018 Digitization of information in Immigration Department using a Document Scanning App 26 Feb 2018 Switch to Smart ID Scanning App from An Expensive Traditional Scanner 31 Jan 2018 Accura Scan Unveils Innovative Scanning Technology at WTM London 24 Oct 2017 Automation in Travel Industry. Disruption or Transformation? 23 Oct 2017 Top 4 Parameters to a Right Document Scanning Solution 14 Oct 2017 Unravelling the Possibilities of Automation 13 Oct 2017 A Closer Look At Accurascan & Its Industry Specific Role. Accura Scan Participating in the Upcoming Mobile World Congress at Barcelona How Accurascan Can Be Your Perfect Boarding Pass Scanning Solution ? Accurascan Geared Up To Participate In the Upcoming FTE Asia EXPO 2018 Accura Web SDK Decreases Wait-Time Of Airline Passengers Enjoy An Improved Inventory With PDF-417 Barcode Scanning App Accura Web SDK Upgrades Middle Eastern Document Scanning How Can Accurascan App Strengthen The Immigration Process? Scanning UK Passports Now Easy With Accurascan Accurascan Participating In the Upcoming Apex Expo Mobile OCR Scanning-A Cost Effective Solution To Meet Business Challenges Accura SDK - Powered With Pan Card & Aadhaar Card - Indian ID Card Accurascan - How It Can Benefit Telecom Companies Accura SDK - Everything You Should Know Banking & Finance Sector Gets Better With Accurascan AccuraGo – A Next Gen Scanning Solution Reasons Why Accurascan's SDK Is Essential For Different Industries Why Document Scanner App AccuraGo is Ideal For Your Paper-Intensive Business How Accurascan Web SDK Can Enhance User Experience Digital Management Of Banking Operations With Accurascan Accurascan Assures Security of Hotels Digitizing Paper Intensive Processes In Banks Using OCR Scanner 3 Easy Ways To Increase The Security Of Your Apartment Complex Making The Move From Paper To Digital With Accurascan How an ID card Scanner Helps in Boosting Nightclub Security? Mobile Technology of Accurascan is Ideal for Mobile Network Providers Accurascan Assures Safety and Accuracy in Banking Operations Top 5 Benefits Of Using Accurascan In Banking Sector Delight Your Prepaid Customers with a Seamless Registration Process How Accurascan Helps Car Rental Companies To Stay Agile? Scanning Solutions Offered By Accurascan For Airlines Industry Benefits of Accurascan for Tour Operators How Does Accura Scan Serve Immigration Department? The Relation of ID Scanning App and Hotel Industry How useful are Document Scanning Apps for Airlines Industry? How To Scan Your Passport Data With The Easy Accurascan Mobile App Digitization of information in Immigration Department using a Document Scanning App Switch to Smart ID Scanning App from An Expensive Traditional Scanner Accura Scan Unveils Innovative Scanning Technology at WTM London Automation in Travel Industry. Disruption or Transformation? Top 4 Parameters to a Right Document Scanning Solution Unravelling the Possibilities of Automation Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required. Developer Dashboard Email us at connect@accurascan.com Download Free Accura Scan Demo App With Accura Scan you can scan ID Cards, Passports, Driver's Licenses, Visas and other Identity Documents in just a few seconds. Try Accura Scan SDK or WEB API For Free Use our Developer Dashboard to get a 30 days FREE TRIAL License & Web Api Secret Key. Access to Demo License Keys + Sample Project with SDK + Instructions Manual. No credit card required."
  ]
}