{
  "company": "aicure.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 6,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.8333333333333334,
    "framing_surveillance": 0.0,
    "framing_market": 0.1666666666666666,
    "num_docs": 7
  },
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 1
    }
  },
  "sample_docs": [
    "Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Featuring: Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to . Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Featuring: Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to . Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to .",
    "Raising the Bar: How AI-Powered Insights Keep Oncology Trials on Track In this webinar, \"Every Dose Matters — Ensuring the Right Dose, at the Right Time, In Oncology Trials,\" Amanda Paley, explores how patients and caregivers can best manage the unique challenges of oncology trials, including multi-drug dosing regimens, from home. The oncology drug pipeline has grown by 63% since 2013, but the average success rate of oncology drugs is only 3.4%. To address this discrepancy AiCure aims to improve patient support and trial retention, while also providing sponsors and sites with greater visibility into patient behavior, by offering: Remote Monitoring: Oncology sites can remotely monitor patients and use real-time communication tools to guide them through complex treatment protocols. Actionable Insights: AI-powered insights into trial and site performance empower sponsors to make proactive, data-driven decisions. Remote Assessments: Patients can leverage electronic patient-reported outcome (ePRO) assessments and measurements of relevant digital biomarkers (DBM). Watch Now! \"With oncology's data landscape growing in complexity, we need to arm our sponsors with the tools to drive informed decisions that will improve study outcomes.By partnering with AiCure and leveraging their unique AI-powered insights, our sponsors will gain a deeper understanding of patient behavior through high-quality data capture and develop comprehensive views of the impact of study drug administration and compliance on other data points.\" – Krystyna Kowalczyk, President and CEO of Oncobay Clinical AiCure and OncoBay are partnering to expand access to AI, empowering oncology sponsors with actionable insights to optimize drug development and help improve patients' quality of life. to . Raising the Bar: How AI-Powered Insights Keep Oncology Trials on Track In this webinar, \"Every Dose Matters — Ensuring the Right Dose, at the Right Time, In Oncology Trials,\" Amanda Paley, explores how patients and caregivers can best manage the unique challenges of oncology trials, including multi-drug dosing regimens, from home. The oncology drug pipeline has grown by 63% since 2013, but the average success rate of oncology drugs is only 3.4%. To address this discrepancy AiCure aims to improve patient support and trial retention, while also providing sponsors and sites with greater visibility into patient behavior, by offering: Remote Monitoring: Oncology sites can remotely monitor patients and use real-time communication tools to guide them through complex treatment protocols. Actionable Insights: AI-powered insights into trial and site performance empower sponsors to make proactive, data-driven decisions. Remote Assessments: Patients can leverage electronic patient-reported outcome (ePRO) assessments and measurements of relevant digital biomarkers (DBM). Watch Now! \"With oncology's data landscape growing in complexity, we need to arm our sponsors with the tools to drive informed decisions that will improve study outcomes.By partnering with AiCure and leveraging their unique AI-powered insights, our sponsors will gain a deeper understanding of patient behavior through high-quality data capture and develop comprehensive views of the impact of study drug administration and compliance on other data points.\" – Krystyna Kowalczyk, President and CEO of Oncobay Clinical AiCure and OncoBay are partnering to expand access to AI, empowering oncology sponsors with actionable insights to optimize drug development and help improve patients' quality of life. to . Raising the Bar: How AI-Powered Insights Keep Oncology Trials on Track In this webinar, \"Every Dose Matters — Ensuring the Right Dose, at the Right Time, In Oncology Trials,\" Amanda Paley, explores how patients and caregivers can best manage the unique challenges of oncology trials, including multi-drug dosing regimens, from home. The oncology drug pipeline has grown by 63% since 2013, but the average success rate of oncology drugs is only 3.4%. To address this discrepancy AiCure aims to improve patient support and trial retention, while also providing sponsors and sites with greater visibility into patient behavior, by offering: Remote Monitoring: Oncology sites can remotely monitor patients and use real-time communication tools to guide them through complex treatment protocols. Actionable Insights: AI-powered insights into trial and site performance empower sponsors to make proactive, data-driven decisions. Remote Assessments: Patients can leverage electronic patient-reported outcome (ePRO) assessments and measurements of relevant digital biomarkers (DBM). \"With oncology's data landscape growing in complexity, we need to arm our sponsors with the tools to drive informed decisions that will improve study outcomes.By partnering with AiCure and leveraging their unique AI-powered insights, our sponsors will gain a deeper understanding of patient behavior through high-quality data capture and develop comprehensive views of the impact of study drug administration and compliance on other data points.\" AiCure and OncoBay are partnering to expand access to AI, empowering oncology sponsors with actionable insights to optimize drug development and help improve patients' quality of life. to .",
    "Adherence Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit About Us About Markets News & Events News Events +1 800 570 0448 Oral Medication AiView® is an Automated Directly Observed Therapy (DOT) software solution that confirms medication ingestion for use with tablets and pills. AiView® is HIPAA and 21 CFR Part 11 compliant and does not collect protected health information. Using AiView The application guides the user through a short series of steps that take between 15 and 20 seconds to complete. Patient identity is confirmed; if a person other than the correct patient attempts to use the smartphone or tablet, an alert is raised and the clinical trial coordinator or healthcare provider is immediately informed. AiView confirms that the correct medication and dose are ingested, guiding the patient through a series of interactive steps to ensure protocol compliance. If the patient has trouble using the system, additional guidance activates on the device. Once complete, data are securely transmitted and stored onto the AiDashboard. Clinical trial coordinators or healthcare providers are alerted by the dashboard of any non-adherence events such as missed doses, incorrect ingestion, or wrong medication. Inhaler AiBreathe uses computer vision technology to confirm that a patient has correctly used their inhaler device. As with AiView, data are securely transmitted to the AiDashboard. AiBreathe has been developed for use in both adult and pediatric populations for the treatment of conditions such as asthma. Sublingual The technology utilizes AiView's unique and flexible attributes to recognize specific sublingual medications. AiView-SL also utilizes AiDentity Sure technology to ensure privacy and confidentiality. The technology is currently being applied to patients with opioid addictions who are being treated with Suboxone therapy. Real-time data monitoring The AiDashboard serves as a central repository for all patient medication adherence data. This includes an audit trail of video that has been de-identified by blurring the patient's image, in order to protect their privacy. Study coordinators or healthcare providers are notified in case of nonadherence. They can use the AiDashboard to manage medication administration events and communicate with the patient. This can be done by sending messages or requests or even calling the patient on their device. All interventions are logged. As data accumulate, predictive algorithms are constructed to anticipate future behavior. Identification and authentication AiCure is developing next-generation barcodes to be imprinted onto pills in order to quickly and cheaply identify and authenticate medication. This process will help to reduce the vast number of medication errors and remove counterfeit drugs from the marketplace.",
    "About Us About Markets Leadership Digital Health Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit +1 800 570 0448 Oral Medication AiView® is an Automated Directly Observed Therapy (DOT) software solution that confirms medication ingestion for use with tablets and pills. AiView® is HIPAA and 21 CFR Part 11 compliant and does not collect protected health information. Using AiView The application guides the user through a short series of steps that take between 15 and 20 seconds to complete. Patient identity is confirmed; if a person other than the correct patient attempts to use the smartphone or tablet, an alert is raised and the clinical trial coordinator or healthcare provider is immediately informed. AiView confirms that the correct medication and dose are ingested, guiding the patient through a series of interactive steps to ensure protocol compliance. If the patient has trouble using the system, additional guidance activates on the device. Once complete, data are securely transmitted and stored onto the AiDashboard. Clinical trial coordinators or healthcare providers are alerted by the dashboard of any non-adherence events such as missed doses, incorrect ingestion, or wrong medication. Inhaler AiBreathe uses computer vision technology to confirm that a patient has correctly used their inhaler device. As with AiView, data are securely transmitted to the AiDashboard. AiBreathe has been developed for use in both adult and pediatric populations for the treatment of conditions such as asthma. Sublingual The technology utilizes AiView's unique and flexible attributes to recognize specific sublingual medications. AiView-SL also utilizes AiDentity Sure technology to ensure privacy and confidentiality. The technology is currently being applied to patients with opioid addictions who are being treated with Suboxone therapy. Real-time data monitoring The AiDashboard serves as a central repository for all patient medication adherence data. This includes an audit trail of video that has been de-identified by blurring the patient's image, in order to protect their privacy. Study coordinators or healthcare providers are notified in case of nonadherence. They can use the AiDashboard to manage medication administration events and communicate with the patient. This can be done by sending messages or requests or even calling the patient on their device. All interventions are logged. As data accumulate, predictive algorithms are constructed to anticipate future behavior. Identification and authentication Ai Cure Technologies is developing next-generation barcodes to be imprinted onto pills in order to quickly and cheaply identify and authenticate medication. This process will help to reduce the vast number of medication errors and remove counterfeit drugs from the marketplace.",
    "About Us About Markets Leadership Digital Health Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit +1 800 570 0448 Welcome to the Ai Cure Technologies website. If you continue to browse and use this website you are agreeing to comply with and be bound by the following of use, which together with our govern Ai Cure's relationship with you in relation to this website. The term 'Ai Cure Technologies' or 'Ai Cure' or 'COMPANY' or 'us' or 'we' refers to the owner of the website whose registered office is 902 Broadway, 6th Floor, New York, NY 10010. The term 'you' refers to the user or viewer of our website. The use of this website is subject to the following of use: The content of the pages of this website is for your general information and use only. It is subject to change without notice. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. This sets out how Ai Cure uses and protects any information that you give Ai Cure when you use this website. Ai Cure is committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement. Ai Cure may change this policy from time to time by updating this page. You should check this page from time to time to ensure that you are happy with any changes. This policy is effective from 1st of November 2012. What we collect We may collect the following information: name and job title contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information What we do with the information we gather We require this information to understand your needs and provide you with a better service, and in particular for the following reasons: Internal record keeping. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. Security We are committed to ensuring that your information is secure. In order to prevent unauthorized access or disclosure we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: if you have previously provided your information to us and it is being used to send information to you, you may change your mind at any time by writing to us. We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect. The content of the pages of this website is for your general information and use only. It is subject to change without notice. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. name and job title contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information demographic information such as postcode and preferences other information relevant to customer surveys and/or other information other information relevant to customer surveys and/or other information What we do with the information we gather Internal record keeping. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. Links to other websites Controlling your personal information if you have previously provided your information to us and it is being used to send information to you, you may change your mind at any time by writing to us."
  ]
}