{
  "company": "aicure.com",
  "dominant_topics": [
    6,
    -1,
    0
  ],
  "topic_counts": {
    "6": 4,
    "-1": 1,
    "0": 1
  },
  "topic_descriptions": {
    "6": "stripe, payments, think, really, payment",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.7777777777777778,
    "framing_surveillance": 0.0,
    "framing_market": 0.2222222222222222,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1,
      "6": 4
    }
  },
  "sample_docs": [
    "Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Featuring: Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to . Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Featuring: Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to . Spotlight on CNS Summit 2020: AiCure Talks Digital Biomarker Development with Merck and Kent State University An Open- Science Framework to Digital Biomarker Development and Validation Bryan Hansen PhD, Associate Principal Scientist, Global Digital Analytics & Technologies at Merck John Gunstad PhD, Professor of Psychological Sciences and Associate Director of the Brain Health Research at Kent State University Isaac Galatzer-Levy PhD, Chief Scientific Officer at AiCure Anzar Abbas PhD, Director of Research & Development at AiCure Sensor-based digital measurements, known as digital biomarkers, have rapidly emerged as an essential tool for next-generation clinical research. Digital biomarkers hold promise of greater objectivity, sensitivity, and frequency of assessment all at lower cost and lower friction. Despite their promise, digital biomarker models and methodologies are often shrouded in mystery as proprietary machine learning models are not made accessible to scientists to assess or independently validate. This spotlight presentation will focus on opening the black box. The panelists will discuss the need and emergent approaches to evaluate, standardize, and validate digital biomarker methodologies. First, Isaac Galatzer-Levy PhD and Anzar Abbas PhD will discuss the launch of AiCure's open-source computer vision and vocal digital biomarker platform, OpenDBM, meant to encourage scientific scrutiny and collaboration. John Gunstad PhD , Professor of Psychological Sciences and Associate Director of the Brain Health Research Institute at Kent State University, will discuss the application of computer vision and vocal digital biomarkers in his funded research into prodromal symptoms of Alzheimer's Disease. Finally, Bryan Hansen PhD , Associate Principal Scientist, Global Digital Analytics & Technologies at Merck, will discuss his work to evaluate, validate, and recommend digital biomarker approaches to advance clinical trial research. OpenDBM is available to download, at no cost, on Github, along with instructional tutorials and walkthroughs on how it can be applied on any video or audio dataset. to .",
    "Adherence Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit About Us About Markets News & Events News Events +1 800 570 0448 Oral Medication AiView® is an Automated Directly Observed Therapy (DOT) software solution that confirms medication ingestion for use with tablets and pills. AiView® is HIPAA and 21 CFR Part 11 compliant and does not collect protected health information. Using AiView The application guides the user through a short series of steps that take between 15 and 20 seconds to complete. Patient identity is confirmed; if a person other than the correct patient attempts to use the smartphone or tablet, an alert is raised and the clinical trial coordinator or healthcare provider is immediately informed. AiView confirms that the correct medication and dose are ingested, guiding the patient through a series of interactive steps to ensure protocol compliance. If the patient has trouble using the system, additional guidance activates on the device. Once complete, data are securely transmitted and stored onto the AiDashboard. Clinical trial coordinators or healthcare providers are alerted by the dashboard of any non-adherence events such as missed doses, incorrect ingestion, or wrong medication. Inhaler AiBreathe uses computer vision technology to confirm that a patient has correctly used their inhaler device. As with AiView, data are securely transmitted to the AiDashboard. AiBreathe has been developed for use in both adult and pediatric populations for the treatment of conditions such as asthma. Sublingual The technology utilizes AiView's unique and flexible attributes to recognize specific sublingual medications. AiView-SL also utilizes AiDentity Sure technology to ensure privacy and confidentiality. The technology is currently being applied to patients with opioid addictions who are being treated with Suboxone therapy. Real-time data monitoring The AiDashboard serves as a central repository for all patient medication adherence data. This includes an audit trail of video that has been de-identified by blurring the patient's image, in order to protect their privacy. Study coordinators or healthcare providers are notified in case of nonadherence. They can use the AiDashboard to manage medication administration events and communicate with the patient. This can be done by sending messages or requests or even calling the patient on their device. All interventions are logged. As data accumulate, predictive algorithms are constructed to anticipate future behavior. Identification and authentication AiCure is developing next-generation barcodes to be imprinted onto pills in order to quickly and cheaply identify and authenticate medication. This process will help to reduce the vast number of medication errors and remove counterfeit drugs from the marketplace.",
    "About Us About Markets Leadership Digital Health Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit +1 800 570 0448 Oral Medication AiView® is an Automated Directly Observed Therapy (DOT) software solution that confirms medication ingestion for use with tablets and pills. AiView® is HIPAA and 21 CFR Part 11 compliant and does not collect protected health information. Using AiView The application guides the user through a short series of steps that take between 15 and 20 seconds to complete. Patient identity is confirmed; if a person other than the correct patient attempts to use the smartphone or tablet, an alert is raised and the clinical trial coordinator or healthcare provider is immediately informed. AiView confirms that the correct medication and dose are ingested, guiding the patient through a series of interactive steps to ensure protocol compliance. If the patient has trouble using the system, additional guidance activates on the device. Once complete, data are securely transmitted and stored onto the AiDashboard. Clinical trial coordinators or healthcare providers are alerted by the dashboard of any non-adherence events such as missed doses, incorrect ingestion, or wrong medication. Inhaler AiBreathe uses computer vision technology to confirm that a patient has correctly used their inhaler device. As with AiView, data are securely transmitted to the AiDashboard. AiBreathe has been developed for use in both adult and pediatric populations for the treatment of conditions such as asthma. Sublingual The technology utilizes AiView's unique and flexible attributes to recognize specific sublingual medications. AiView-SL also utilizes AiDentity Sure technology to ensure privacy and confidentiality. The technology is currently being applied to patients with opioid addictions who are being treated with Suboxone therapy. Real-time data monitoring The AiDashboard serves as a central repository for all patient medication adherence data. This includes an audit trail of video that has been de-identified by blurring the patient's image, in order to protect their privacy. Study coordinators or healthcare providers are notified in case of nonadherence. They can use the AiDashboard to manage medication administration events and communicate with the patient. This can be done by sending messages or requests or even calling the patient on their device. All interventions are logged. As data accumulate, predictive algorithms are constructed to anticipate future behavior. Identification and authentication Ai Cure Technologies is developing next-generation barcodes to be imprinted onto pills in order to quickly and cheaply identify and authenticate medication. This process will help to reduce the vast number of medication errors and remove counterfeit drugs from the marketplace.",
    "About Us About Markets Leadership Digital Health Solutions Oral Medication Inhaler Sublingual Data monitoring Anti-counterfeit +1 800 570 0448 Welcome to the Ai Cure Technologies website. If you continue to browse and use this website you are agreeing to comply with and be bound by the following of use, which together with our govern Ai Cure's relationship with you in relation to this website. The term 'Ai Cure Technologies' or 'Ai Cure' or 'COMPANY' or 'us' or 'we' refers to the owner of the website whose registered office is 902 Broadway, 6th Floor, New York, NY 10010. The term 'you' refers to the user or viewer of our website. The use of this website is subject to the following of use: The content of the pages of this website is for your general information and use only. It is subject to change without notice. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. This sets out how Ai Cure uses and protects any information that you give Ai Cure when you use this website. Ai Cure is committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement. Ai Cure may change this policy from time to time by updating this page. You should check this page from time to time to ensure that you are happy with any changes. This policy is effective from 1st of November 2012. What we collect We may collect the following information: name and job title contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information What we do with the information we gather We require this information to understand your needs and provide you with a better service, and in particular for the following reasons: Internal record keeping. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. Security We are committed to ensuring that your information is secure. In order to prevent unauthorized access or disclosure we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: if you have previously provided your information to us and it is being used to send information to you, you may change your mind at any time by writing to us. We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect. The content of the pages of this website is for your general information and use only. It is subject to change without notice. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. All trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Unauthorized use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. You may not create a link to this website from another website or document without Ai Cure's prior written consent. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. Your use of this website and any dispute arising out of such use of the website is subject to the laws of the United States of America. name and job title contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information contact information including email address demographic information such as postcode and preferences other information relevant to customer surveys and/or other information demographic information such as postcode and preferences other information relevant to customer surveys and/or other information other information relevant to customer surveys and/or other information What we do with the information we gather Internal record keeping. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. We may use the information to improve our products and services. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. We may periodically send promotional emails or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customize the website according to your interests. Links to other websites Controlling your personal information if you have previously provided your information to us and it is being used to send information to you, you may change your mind at any time by writing to us.",
    "H.Code H.Code Patient Connect Digital Phenotypes Site Services For Sites For Sites Clinical Site Dashboards Clinical Site Services Patient Connect Resources Resources Blog Fact Sheets Posters Publications Webinars Company Company Investors Press Data Privacy & Security Careers Partnerships Data Privacy & Security Everything participants need, in one platform Change the way you look at participant behavior H.Code, by AiCure, uses AI-powered computer vision, synchronous chat, and predictive analytics to observe and assist trial participants through their smartphone—revolutionizing access and participation, improving statistical power, and deepening our understanding of the relationship between patient behavior and trial outcomes. EXPLORE H.CODE eCOA - ePRO Capture participant responses and configure response visibility for sites and/or sponsors/CROs as needed. Adherence & Dosing Adherence is more than just pill counts. Anticipate and manage it proactively to prevent dropouts. Responsible AI From the start, AiCure has integrated diversity into its patient engagement AI platform to eliminate bias. What clinical teams are saying Clinical teams are using H.Code to enhance and streamline their clinical research processes. \"Having worked with AiCure, they are probably the most advanced in facial recognition and mapping software and the algorithms underlying that to detect subtle clinical changes.\" Matthew Leoni, MD MBA, VP, Global Clinical Development at Cerevel Therapeutics \"The thing I've been focusing on is really using AiCure for, rather than a passive data collection tool, is to drive action.\" Sarah Titus, Director of Clinical Operations & Development at Sage Therapeutics \"We did see drop-out rates fall considerably and cut down by more than half. That for us is a big win.\" Kyle Holen, MD, Head of Development Design Center at Abbvie The proven patient engagement AI 92% Participant retention +1.5M Participant doses captured 46 Countries 45 Languages +2,200 Clinical trial sites 84 Patents awarded 7 of Top 10 Global pharma customers +14 Years Successful client deployments rooted in R&D See what AI patient engagement can do for your study SCHEDULE A DEMO Make the trial experience better, for everyone H.Code is designed to be a bridge between your patients and your clinical team. Our unique approach combines cutting-edge patient engagement AI technology with extensive site expertise in one solution, making clinical trials more convenient and accessible for participants and more manageable and effective for clinical sites and study teams. OUR MISSION Built for every clinical trial H.Code supports a variety of studies for any kind of clinical trial—traditional site-based, decentralized, fully virtual, or hybrid models. Data collected using our clinical trial AI platform can be used to support safety and efficacy endpoints while providing a comprehensive view of how therapy impacts participants. INDICATION FACT SHEETS What we're talking about about patient engagement AI and how it's being deployed in clinical trials around the world. Validate Using Smartphones to Measure Symptoms of Schizophrenia Validate Watch Unleashing the Operational Value of Real-Time Dosing Data Watch Read From Predicting Adherence to Health Outcomes – The Power of Predictive Insights Read Read Mitigating Bias in AI: Holding Innovation to a Higher Standard Read Read From Digital Measures to Novel Composite Endpoints: Enabling Precision Psychiatry Read Watch Inspiration On-Demand: How AI is Giving Tech-Savvy Study Teams an Edge Watch Upcoming Events Want to talk in person? We would love to meet with you at any of the following events: DIA Global Annual Meeting June 15-19, 2025, in Washington, DC, Booth #1736 SCRS Global Site Solutions Summit September 29 - October 1, 2025, in Orlando, Florida CNS Summit November 2-5, 2025, in Everett, MA Digital Implementation Summit November 5, 2025, in Cambridge, MA Everything participants need, in one platform Change the way you look at participant behavior H.Code, by AiCure, uses AI-powered computer vision, synchronous chat, and predictive analytics to observe and assist trial participants through their smartphone—revolutionizing access and participation, improving statistical power, and deepening our understanding of the relationship between patient behavior and trial outcomes. Capture participant responses and configure response visibility for sites and/or sponsors/CROs as needed. Adherence is more than just pill counts. Anticipate and manage it proactively to prevent dropouts. From the start, AiCure has integrated diversity into its patient engagement AI platform to eliminate bias. What clinical teams are saying Clinical teams are using H.Code to enhance and streamline their clinical research processes. \"Having worked with AiCure, they are probably the most advanced in facial recognition and mapping software and the algorithms underlying that to detect subtle clinical changes.\" Matthew Leoni, MD MBA, VP, Global Clinical Development at Cerevel Therapeutics \"The thing I've been focusing on is really using AiCure for, rather than a passive data collection tool, is to drive action.\" Sarah Titus, Director of Clinical Operations & Development at Sage Therapeutics \"We did see drop-out rates fall considerably and cut down by more than half. That for us is a big win.\" Kyle Holen, MD, Head of Development Design Center at Abbvie The proven patient engagement AI 7 of Top 10 Successful client deployments rooted in R&D See what AI patient engagement can do for your study Make the trial experience better, for everyone H.Code is designed to be a bridge between your patients and your clinical team. Our unique approach combines cutting-edge patient engagement AI technology with extensive site expertise in one solution, making clinical trials more convenient and accessible for participants and more manageable and effective for clinical sites and study teams. Built for every clinical trial What we're talking about about patient engagement AI and how it's being deployed in clinical trials around the world. Using Smartphones to Measure Symptoms of Schizophrenia Unleashing the Operational Value of Real-Time Dosing Data From Predicting Adherence to Health Outcomes – The Power of Predictive Insights Mitigating Bias in AI: Holding Innovation to a Higher Standard From Digital Measures to Novel Composite Endpoints: Enabling Precision Psychiatry Inspiration On-Demand: How AI is Giving Tech-Savvy Study Teams an Edge Want to talk in person? We would love to meet with you at any of the following events: DIA Global Annual Meeting June 15-19, 2025, in Washington, DC, Booth #1736 SCRS Global Site Solutions Summit September 29 - October 1, 2025, in Orlando, Florida November 2-5, 2025, in Everett, MA November 5, 2025, in Cambridge, MA"
  ]
}