{
  "company": "ailabs.tw",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 5
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "0": 5
    }
  },
  "sample_docs": [
    "https://ailabs.tw/wp-content/uploads/2019/05/bass_gen_plot.jpg 1603 2536 yhyang https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png yhyang 2019-05-08 17:26:16 2019-05-15 17:17:04 AI Jazz Bass Player: Bass Accompaniment in A Jazz Piano Trio Setting https://ailabs.tw/wp-content/uploads/2018/04/crossing-article-ptt-ai.jpg 722 1170 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2018-04-07 20:24:45 2019-04-02 10:59:20 ptt.ai, open source blockchain for AI Data Justice https://ailabs.tw/wp-content/uploads/2018/03/6007756239_1994e9226b_z.jpg 426 640 Editor https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png Editor 2018-04-04 01:03:30 2018-04-09 10:21:35 AILabs builds intelligence behind Taipei Traffic Density Network https://ailabs.tw/wp-content/uploads/2018/04/smart_city_expo.jpg 640 960 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2018-04-01 01:45:11 2018-04-03 18:35:05 Humanity with Privacy and Integrity is Taiwan AI Mindset https://ailabs.tw/wp-content/uploads/2018/02/5819184201_6d69eb67f6_o-e1518587076259.jpg 424 640 rajon https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png rajon 2018-02-08 15:08:01 2018-05-11 15:03:23 AI music composition passed Turing test https://ailabs.tw/wp-content/uploads/2017/12/Chipolin_feature-e1514109719798.jpg 424 640 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2017-12-19 11:16:17 2017-12-28 15:58:19 Learn from Chi Bo Lin's view https://ailabs.tw/wp-content/uploads/2017/12/doppelganger.jpg 426 640 tony https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png tony 2017-12-13 16:29:38 2017-12-28 16:12:31 Doppelgänger app - Can someone unlock your iPhone? https://ailabs.tw/wp-content/uploads/2017/12/Jarvis_feature-e1514109691679.jpg 424 640 stefan https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png stefan 2017-12-13 02:02:31 2017-12-28 16:25:02 Meet JARVIS - The Engine Behind AILabs https://ailabs.tw/wp-content/uploads/2017/12/Faceid_feature-e1514109745826.jpg 424 640 tony https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png tony 2017-12-12 14:53:16 2017-12-28 16:28:26 Face Recognition - The essential part of \"Face ID\" https://ailabs.tw/wp-content/uploads/2017/12/Frontdesk_feature-e1514110116401.jpg 377 572 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2017-12-12 09:28:31 2017-12-28 16:29:59 AI frontdesk - improve office security and working conditions https://ailabs.tw/wp-content/uploads/2019/05/bass_gen_plot.jpg 1603 2536 yhyang https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png yhyang 2019-05-08 17:26:16 2019-05-15 17:17:04 AI Jazz Bass Player: Bass Accompaniment in A Jazz Piano Trio Setting https://ailabs.tw/wp-content/uploads/2018/04/crossing-article-ptt-ai.jpg 722 1170 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2018-04-07 20:24:45 2019-04-02 10:59:20 ptt.ai, open source blockchain for AI Data Justice https://ailabs.tw/wp-content/uploads/2018/03/6007756239_1994e9226b_z.jpg 426 640 Editor https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png Editor 2018-04-04 01:03:30 2018-04-09 10:21:35 AILabs builds intelligence behind Taipei Traffic Density Network https://ailabs.tw/wp-content/uploads/2018/04/smart_city_expo.jpg 640 960 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2018-04-01 01:45:11 2018-04-03 18:35:05 Humanity with Privacy and Integrity is Taiwan AI Mindset https://ailabs.tw/wp-content/uploads/2018/02/5819184201_6d69eb67f6_o-e1518587076259.jpg 424 640 rajon https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png rajon 2018-02-08 15:08:01 2018-05-11 15:03:23 AI music composition passed Turing test https://ailabs.tw/wp-content/uploads/2017/12/Chipolin_feature-e1514109719798.jpg 424 640 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2017-12-19 11:16:17 2017-12-28 15:58:19 Learn from Chi Bo Lin's view https://ailabs.tw/wp-content/uploads/2017/12/doppelganger.jpg 426 640 tony https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png tony 2017-12-13 16:29:38 2017-12-28 16:12:31 Doppelgänger app - Can someone unlock your iPhone? https://ailabs.tw/wp-content/uploads/2017/12/Jarvis_feature-e1514109691679.jpg 424 640 stefan https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png stefan 2017-12-13 02:02:31 2017-12-28 16:25:02 Meet JARVIS - The Engine Behind AILabs https://ailabs.tw/wp-content/uploads/2017/12/Faceid_feature-e1514109745826.jpg 424 640 tony https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png tony 2017-12-12 14:53:16 2017-12-28 16:28:26 Face Recognition - The essential part of \"Face ID\" https://ailabs.tw/wp-content/uploads/2017/12/Frontdesk_feature-e1514110116401.jpg 377 572 AILabs.tw https://ailabs.tw/wp-content/uploads/2018/12/AI-Labs-Logo-1-300x92.png AILabs.tw 2017-12-12 09:28:31 2017-12-28 16:29:59 AI frontdesk - improve office security and working conditions",
    "Career Taiwan AILabs is looking for top talents to develop world-class AI researches and products. Taiwan AILabs is looking for top talents to develop world-class AI researches and products. Taiwan AILabs is looking for top talents to develop world-class AI researches and products. We need people of all areas related: Computer aided diagnosis for medical images Genetic and genomics studies Drone control and autonomous vehicles Speech recognition and synthesis Image and face recognition Music transcription and composition/generation Intent understanding and dialog system Large scale service and cloud development Web frontend and backend development Mobile (Android/iOS) apps development System and embedded development We need people of all areas related: Computer aided diagnosis for medical images Genetic and genomics studies Drone control and autonomous vehicles Speech recognition and synthesis Image and face recognition Music transcription and composition/generation Intent understanding and dialog system Large scale service and cloud development Web frontend and backend development Mobile (Android/iOS) apps development System and embedded development Strong ability in problem solving. Capable to reach out for solutions and to collaborate with top AI projects around the world. Eager to experiment and solve day-to-day problems by proof of concept with strong quality in mind. Strong ability in applying data structures and algorithms, including analyzing performance. Fast learner in new areas. Strong ability in problem solving. Capable to reach out for solutions and to collaborate with top AI projects around the world. Eager to experiment and solve day-to-day problems by proof of concept with strong quality in mind. Strong ability in applying data structures and algorithms, including analyzing performance. Fast learner in new areas. Involved in open source development. AI related experiences such as, deep learning experience (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). Involved in open source development. AI related experiences such as, deep learning experience (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). We have open positions from junior to senior engineers both in platform and machine learning/natural language areas: We have open positions from junior to senior engineers both in platform and machine learning/natural language areas: OR send your resume to admission@ailabs.tw For 2019 Summer Internship: internadmission@ailabs.tw OR send your resume to admission@ailabs.tw For 2019 Summer Internship: internadmission@ailabs.tw",
    "AI Labs.tw We are building the team Join us to innovate AI products in Taiwan and for The World . A well-funded team in Taipei is looking for top talents to develop world-class AI researches and products. We need people of all areas, ranging from app, driver, system programming to AI related: Speech recognition and synthesis Image and face recognition Intent understanding and dialog system Large scale service and cloud development Mobile (Android/iOS) apps development System and embedded development Required skills Strong ability in problem solving. Capable to reach out for solutions and to collaborate with top AI projects around the world. Eager to experiment and solve day-to-day problems by proof of concept with strong quality in mind. Strong ability in applying data structures and algorithms learned in school, including analyzing performance. Fast learner in new areas. Good to have Involved in open source development AI related experiences such as, deep learning experince (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). If YOU are the one, please click the following button. Apply Now We are building the team Join us to innovate AI products in Taiwan and for The World . A well-funded team in Taipei is looking for top talents to develop world-class AI researches and products. We need people of all areas, ranging from app, driver, system programming to AI related: Speech recognition and synthesis Image and face recognition Intent understanding and dialog system Large scale service and cloud development Mobile (Android/iOS) apps development System and embedded development Required skills Strong ability in problem solving. Capable to reach out for solutions and to collaborate with top AI projects around the world. Eager to experiment and solve day-to-day problems by proof of concept with strong quality in mind. Strong ability in applying data structures and algorithms learned in school, including analyzing performance. Fast learner in new areas. Good to have Involved in open source development AI related experiences such as, deep learning experince (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). If YOU are the one, please click the following button. Speech recognition and synthesis Image and face recognition Intent understanding and dialog system Large scale service and cloud development Mobile (Android/iOS) apps development System and embedded development Strong ability in problem solving. Capable to reach out for solutions and to collaborate with top AI projects around the world. Eager to experiment and solve day-to-day problems by proof of concept with strong quality in mind. Strong ability in applying data structures and algorithms learned in school, including analyzing performance. Fast learner in new areas. Good to have Involved in open source development AI related experiences such as, deep learning experince (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). Involved in open source development AI related experiences such as, deep learning experince (CNN, RNN, LSTM… etc), speech process experience (recognition, NLP, … etc), image process experience (face recognition, etc). Copyright .",
    "Advancing AI in Taiwan, for the world Advancing AI in Taiwan, for the world Taiwan AI Labs (AILabs.tw) is a privately funded research organization based in Taipei. We expect artificial intelligence to have major and transformative impacts on the landscape of technology, and our goal is to leverage unique advantages in Taiwan to build AI solutions to solve the world's problems. AILabs.tw is headed by Ethan Tu, a former principal development manager at US-based tech giant Microsoft Corp. He is well-known as the founder of PTT, which has grown into one of Taiwan's most influential online forums since its launch in 1995. At AILabs.tw, our focus areas are Healthcare , Smart City and Human interaction and these areas include research ranging from natural language processing, computer vision to deep learning and other advanced approaches. Taiwan maintains the largest share of global IC wafer fab capacity in the world and the National Health Insurance reform in 1995 has aggregated comprehensive medical data for more than 20 years. As cloud and IoT innovations support insightful data collecting capability and digitized data drives AI research, AILabs.tw is at the forefront of data innovation. Taiwan has an abundance of local talent in AI. National Taiwan University is the first school from Asia shown in top 50 AI universities list (source: Netease Wuzhen AI Summit Top Influential AI School, 2016 report), and we believe that with highly educated talent and strong academic partnerships, we will achieve incredible results. Efforts to bolster the development of the Taiwan artificial intelligence sector are gaining momentum following the establishment of Taiwan AI Labs in Taipei City in 2017. Our mission is to integrate AI expertise and resources from academics, as well the public and private sectors around the world in order to foster AI innovation. Taiwan AI Labs was announced with Ministry of Science and Technology (MOST) on April 27th 2017. MOST Minister Chen Liang-gee said the lab will help strengthen AI expertise and innovation-based growth in line with major state investments in digital infrastructure. The government planed to allocate NT$5 billion (US$167 million) toward building AI infrastructures and promoting tech talent cultivation under the Cabinet's eight-year Forward-looking Infrastructure Program (FIP). Taiwan Digital Minister Audrey Tang, a noted computer programmer and digital entrepreneur hope that Taiwan AI Labs will help promote AI technology and integrate local academic institutions, nongovernmental organizations and small and medium enterprises through data exchange and open source projects. Tang said the government is committed to fostering the next generation of tech innovators. Besides talent cultivation initiatives under the FIP, plans are underway to incorporate digital learning programs into new curriculum guidelines for elementary and high schools across the country. Unveiled by the Executive Yuan, the FIP is aimed at stimulating growth and driving Taiwan's industrial transformation over the next 30 years. Budgeted at NT$880 billion (US$29.3 billion), it spans five main areas: digital infrastructure, railways, renewable energy, urban-rural development and water resources, and is forecast to add NT$975.9 billion to the real gross domestic product over eight years. At AILabs.tw, our focus areas are Healthcare , Smart City and Human interaction and these areas include research ranging from natural language processing, computer vision to deep learning and other advanced approaches. Taiwan has an abundance of local talent in AI. National Taiwan University is the first school from Asia shown in top 50 AI universities list (source: Netease Wuzhen AI Summit Top Influential AI School, 2016 report), and we believe that with highly educated talent and strong academic partnerships, we will achieve incredible results. Efforts to bolster the development of the Taiwan artificial intelligence sector are gaining momentum following the establishment of Taiwan AI Labs in Taipei City in 2017. Our mission is to integrate AI expertise and resources from academics, as well the public and private sectors around the world in order to foster AI innovation. Alphabetical order by first name 陳倩瑜 Chien-Yu Chen æŽå®æ¯… Hung-Yi Lee æŽç³å±± Lin-Shan Lee 孫 民 Min Sun 白明憲 Mingsian R. Bai 楊奕軒 Yi-Hsuan Yang 陳縕儂 Yun-Nung Chen 莊永裕 Yung-Yu Chuang 王鈺強 Yu-Chiang Wang",
    "Taiwan AI Labs & Foundation (Taiwan AI Labs) is a privately funded organization based in Taiwan with offices in Taipei and Kaohsiung. Taiwan AI Labs was established in 2017 and is the first open AI research institute in Asia. We focus on trustworthy and responsible AI research, leverage Taiwan AI talents and industry strengths to establish the responsible methodologies and standards for healthcare, finance and news media innovations in Taiwan. Human Interaction We explore pioneering user experiences tailored for the era of generative AI. Our endeavors span across various domains including audio and speech, art and music creation, information security, LLM, GPT, and beyond. View âž\" Healthcare We leverage Taiwan's comprehensive medical data and work with doctors and top scientists to solve complex human health problems. View âž\" Human Interaction We explore the most innovative human interaction interface user experiences in the era of generative AI. Our GPT services cater to diverse industries including finance, healthcare, multimedia entertainment, and education. We are deeply invested in applications such as speech, art and music generation, information security, and AI avatar. View âž\" Healthcare We leverage Taiwan's comprehensive medical data and work with doctors and top scientists to solve complex human health problems. View âž\" Taiwan AI Labs is the premier non-governmental organization specializing in artificial intelligence in Asia. Our mission encompasses the following objectives: Taiwan AI Labs is the premier non-governmental organization specializing in artificial intelligence in Asia. Our mission encompasses the following objectives: • Innovate AI in Taiwan and for The World. • Bring technology to meet nature and humanity. • Create impacts and improvements for human well-being. • Innovate AI in Taiwan and for The World. • Bring technology to meet nature and humanity. • Create impacts and improvements for human well-being. ── Ethan Tu, Founder of Taiwan AI Labs ── Ethan Tu, Founder of Taiwan AI Labs Board of Directors Sorted by the number of strokes in the Chinese surnames Consultants Sorted by the number of strokes in the Chinese surnames Executive Summary Prior studies have probed isolated bias dimensions but have not directly compared a PRC-aligned LLM with a non-PRC peer across topics and languages; we close this gap by creating a 1,200-item trilingual corpus and evaluating… https://www.ailabs.tw/wp-content/uploads/2023/12/index-kv-infodemic-1.jpg 667 1200 Winnie Chang http://ailabs.tw/wp-content/uploads/2025/05/ailabs_logo-2.png Winnie Chang 2025-05-26 17:17:38 2025-05-26 17:22:38 Analysis of LLM Bias (Chinese Propaganda & Anti-US Sentiment) in DeepSeek-R1 vs. ChatGPT o3-mini-high In recent years, Taiwan's universities have taken solid steps toward internationalization, aiming to enhance students' global perspectives and competitiveness through international exchanges and collaborations. With the rapid advancement of… https://www.ailabs.tw/wp-content/uploads/2025/02/左起:æ±è¯å¤§å­¸åœ–資處處長陳å‰éŠ˜ã€å°ç£äººå·¥æ™ºæ…§å¯¦é©—室內容執行長黃兆徽ã€å°ç£äººå·¥æ™ºæ…§å¯¦é©—室創辦人æœå¥•ç'¾ã€æ±è¯å¤§å­¸æ ¡é•·å¾è¼æ˜Žã€æ±è¯å¤§å­¸åœ–資處副處長簡æšå\"²-1.jpg 1242 2560 Winnie Chang http://ailabs.tw/wp-content/uploads/2025/05/ailabs_logo-2.png Winnie Chang 2025-02-10 11:06:53 2025-02-10 11:08:20 Taiwan's Universities Embrace AI to Enhance Internationalization and Campus Services The generative AI craze is sweeping the world and will become the core driving force for corporate transformation and innovation in 2025. On January 22, Taiwan AI Labs held the 2025 Taiwan AI TechDay, attracting more than 300 experts and leaders… https://www.ailabs.tw/wp-content/uploads/2025/02/DSC02122-1.jpg 1081 2560 Winnie Chang http://ailabs.tw/wp-content/uploads/2025/05/ailabs_logo-2.png Winnie Chang 2025-02-05 17:57:20 2025-02-07 15:53:30 From Generative AI to ReGenerative AI: How can enterprises balance innovation and sustainability?"
  ]
}