{
  "company": "aisles.app",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5,
    "framing_surveillance": 0.0,
    "framing_market": 0.5,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "0": 3
    }
  },
  "sample_docs": [
    "Effective Date: June 10, 2024 Aisles is committed to protecting your privacy. This outlines how we collect, use, and protect your information when you use our website, mobile application, and other products and services (collectively, the \"Services\"). By accessing or using our Services, you agree to the of this . Aisles does not keep or store any personal information that can be used to identify you directly. When you use our Services, we may collect certain information that helps us enhance and improve our offerings, but none of this information is retained in a form that can be traced back to you personally. We may collect information about your interactions with our Services, such as the pages you visit, the features you use, and the time and date of your visits. This data is used solely to understand how our Services are used and to improve them. We may collect information about the device you use to access our Services, including the hardware model, operating system and version, unique device identifiers, and mobile network information. This information helps us optimize our Services for different devices. How We Use Your Information All the information we collect is used to advance Aisles and enhance the user experience. By analyzing usage patterns and device information, we can better understand how our Services are used and make necessary improvements. We use the collected information to monitor and analyze trends, usage, and activities in connection with our Services to ensure the security and performance of our systems. We may use the information to communicate with you about updates, promotions, and other relevant information regarding our Services. However, we do not store any personal contact information; communications will be done through the Services themselves. Aisles does not share any personal information with third parties. Since we do not store personal data, there is no information to disclose. Any aggregated and anonymized data that we collect may be shared with our partners to help improve our Services, but this data cannot be used to identify you personally. We take customer privacy seriously and implement various security measures to protect the data we collect. However, please note that no security system is impenetrable, and we cannot guarantee the absolute security of our systems or your information. Changes to This Aisles may update this from time to time to reflect changes in our practices or relevant laws. We will notify you of any significant changes by updating the effective date at the top of this policy and providing notice through our Services. If you have any questions or concerns about this or our data practices, please contact us through our website or mobile application. By using our Services, you acknowledge that you have read and understood this . We are committed to maintaining your trust and ensuring the confidentiality and security of the information you provide to us.",
    "Aisles Effective Date: June 10, 2024 Welcome to Aisles. These (\" \") govern your use of our website, mobile application, and other products and services (collectively, the \"Services\"). By accessing or using our Services, you agree to comply with and be bound by these . Please read them carefully. If you do not agree with these , you may not use our Services. 1. Description of Services Aisles provides a suite of AI-powered solutions designed to enhance the shopping experience within retail environments. Our primary service is a GPS navigation system that guides users to the correct aisle and shelf for the products they seek. Additional services include: SAVES : Finds the best deals on items, including hidden coupons and store comparisons. TRUSTIS : A biometric AI security system allowing checkout using facial recognition, fingerprints, or voice. SAFTIES : Provides information on product contents, warnings, recalls, and effects of mixing products. TECH WHEEL : An AI-powered electric shopping cart that guides users through the store and allows checkout via the Aisles app. ALERT : Tracks students in school, communicates with parents during emergencies, and enhances security. WORKS : Assists with workers' compensation issues, including finding the correct departments and providing legal information. LEARN : An AI teaching system that creates customized lessons and interactive content for students who travel or miss school. HELPS : An AI personal assistant platform offering functionalities such as multi-modal interaction, advanced communication features, task and activity management, Shield Guard Protection, emergency protocols, advanced translation services, and app integration. You must be at least 18 years old to use our Services. By using our Services, you represent and warrant that you have the right, authority, and capacity to enter into these and to abide by all the set forth herein. If you are using the Services on behalf of a company, organization, or other legal entity, you represent and warrant that you are authorized to do so. To access certain features of our Services, you may be required to create an account. You agree to: Provide accurate, current, and complete information during the registration process. Maintain and promptly update your account information to keep it accurate, current, and complete. Maintain the security and confidentiality of your login credentials and restrict access to your account. Notify us immediately of any unauthorized use of your account or any other breach of security. You are responsible for all activities that occur under your account, whether or not you know about them. 4. Use of Services You agree to use our Services only for lawful purposes and in accordance with these . You agree not to: Use our Services in any way that violates any applicable federal, state, local, or international law or regulation. Engage in any conduct that restricts or inhibits anyone's use or enjoyment of our Services, or which, as determined by us, may harm Aisles or users of our Services. Use our Services in any manner that could disable, overburden, damage, or impair our site or interfere with any other party's use of our Services. Use any robot, spider, or other automatic devices, process, or means to access our Services for any purpose, including monitoring or copying any of the material on our site. Introduce any viruses, trojan horses, worms, logic bombs, or other material that is malicious or technologically harmful. Attempt to gain unauthorized access to, interfere with, damage, or disrupt any parts of our Services, the server on which our Services are stored, or any server, computer, or database connected to our Services. 5. Intellectual Property Rights Our Services and their entire contents, features, and functionality (including but not limited to all information, software, text, displays, images, video, and audio, and the design, selection, and arrangement thereof) are owned by Aisles, its licensors, or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of the material on our Services, except as follows: Personal Use : You may download and print a reasonable number of pages of the Services for your own personal, non-commercial use, provided that you do not remove any copyright or other proprietary notices. Educational Purposes : Teachers and students may use the material for educational purposes within a classroom or other educational settings, provided that proper attribution is given and the use is non-commercial. Consent : With our express written permission, which may be given at our sole discretion, you may perform any of the restricted actions. Such permission must be obtained in advance and will be subject to the specified by us. Linking and Sharing : You may link to our Services or share content on social media platforms in a manner that does not suggest any form of association, approval, or endorsement by us without express written consent. Such links should direct users to the original content on our Services without modification. Fair Use : Use of our material may be permitted under applicable fair use laws, such as for commentary, criticism, news reporting, teaching, scholarship, or research, provided that such use does not infringe on the copyright or other proprietary rights. Legal Obligations : If you are required by law to reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any material on our Services, you must comply with the relevant legal obligations while providing us with notice of such actions to the extent legally permissible. Third-Party Licenses : Material from our Services that is subject to a third-party license may be used in accordance with the specified by that license. You are responsible for complying with the of any such licenses. This policy aims to protect our intellectual property rights while allowing reasonable use of our materials within specified boundaries. Any unauthorized use of the material on our Services may violate copyright, trademark, and other laws and could result in criminal or civil penalties. The Services may contain message boards, chat rooms, personal web pages or profiles, forums, bulletin boards, and other interactive features (collectively, \"Interactive Services\") that allow users to post, submit, publish, display, or transmit to other users or other persons (hereinafter, \"post\") content or materials (collectively, \"User Contributions\") on or through the Services. All User Contributions must comply with the content standards set out in these . Any User Contribution you post to the site will be considered non-confidential and non-proprietary. By providing any User Contribution on the Services, you grant us and our affiliates and service providers, and each of their and our respective licensees, successors, and assigns the right to use, reproduce, modify, perform, display, distribute, and otherwise disclose to third parties any such material for any purpose. You represent and warrant that: You own or control all rights in and to the User Contributions and have the right to grant the license granted above to us and our affiliates and service providers, and each of their and our respective licensees, successors, and assigns. All of your User Contributions do and will comply with these . You understand and acknowledge that you are responsible for any User Contributions you submit or contribute, and you, not Aisles, have full responsibility for such content, including its legality, reliability, accuracy, and appropriateness. We are not responsible, or liable to any third party, for the content or accuracy of any User Contributions posted by you or any other user of the Services. You may use our Services only for lawful purposes and in accordance with these . You agree not to use our Services: In any way that violates any applicable federal, state, local, or international law or regulation. For the purpose of exploiting, harming, or attempting to exploit or harm minors in any way by exposing them to inappropriate content, asking for personally identifiable information, or otherwise. To send, knowingly receive, upload, download, use, or re-use any material which does not comply with these . To transmit, or procure the sending of, any advertising or promotional material, including any \"junk mail,\" \"chain letter,\" \"spam,\" or any other similar solicitation. To impersonate or attempt to impersonate Aisles, a Aisles employee, another user, or any other person or entity (including, without limitation, by using email addresses or screen names associated with any of the foregoing). To engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the Services, or which, as determined by us, may harm Aisles or users of the Services, or expose them to liability. To use the Services in any manner that could disable, overburden, damage, or impair the site or interfere with any other party's use of the Services, including their ability to engage in real-time activities through the Services. To use any robot, spider, or other automatic device, process, or means to access the Services for any purpose, including monitoring or copying any of the material on the Services. To introduce any viruses, trojan horses, worms, logic bombs, or other material that is malicious or technologically harmful. By using our Services, you acknowledge that you have read and understood these . We are committed to maintaining your trust and ensuring the confidentiality and security of the information you provide to us.",
    "Revolutionizing the Retail Industry Through AI-Powered Technology and Impressive Growth Who We Are Aisles is a retail tech startup, that seeks to transform the retail shopping experience through innovative AI-powered technology. Watch video Aisles is a retail tech startup, that seeks to transform the retail shopping experience through innovative AI-powered technology. What Sets Aisles Apart? AI-Powered Mapping and Guiding System Functionality: Aisles' application uses artificial intelligence to show customers the exact location of items within a store. Think of it as a GPS but for shopping inside a store. Read More Time-Saver Customers no longer have to aimlessly wander searching for products. Customer Satisfaction Easy navigation means happier customers. Efficiency Store employees can allocate their time to other tasks instead of guiding customers. Contactless Payment Aisles has developed a contactless payment system called Trusties, which allows customers to pay for their purchases using their smartphones. This streamlines the checkout process and reduces wait times. Tech Wheel self driving shopping carts! We are creating a new way to use shopping carts. Not just a smarter but more faster and works around you. From becoming your personal guide around the store to finding you the best deals! Enhanced Safety Features Aisles prioritizes customer safety by providing real-time alerts on product recalls and potential hazards, ensuring that customers are informed and protected during their shopping experience. Pre order now? Be the first to own it! 🚀 Pre-order your cutting-edge hardware now and secure your spot in the future of technology. Limited stock available don't miss out! 🔥 Send Message Us Get in Touch What Sets Aisles Apart? AI-Powered Mapping and Guiding System Functionality: Aisles' application uses artificial intelligence to show customers the exact location of items within a store. Think of it as a GPS but for shopping inside a store. Customers no longer have to aimlessly wander searching for products. Easy navigation means happier customers. Store employees can allocate their time to other tasks instead of guiding customers. Aisles has developed a contactless payment system called Trusties, which allows customers to pay for their purchases using their smartphones. This streamlines the checkout process and reduces wait times. Tech Wheel self driving shopping carts! We are creating a new way to use shopping carts. Not just a smarter but more faster and works around you. From becoming your personal guide around the store to finding you the best deals! Aisles prioritizes customer safety by providing real-time alerts on product recalls and potential hazards, ensuring that customers are informed and protected during their shopping experience. Pre order now? Be the first to own it! 🚀 Pre-order your cutting-edge hardware now and secure your spot in the future of technology. Limited stock available don't miss out! 🔥 Be the first to own it! 🚀 Pre-order your cutting-edge hardware now and secure your spot in the future of technology. Limited stock available don't miss out! 🔥 Send Message Us Get in Touch"
  ]
}