{
  "company": "ams-osram.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "Vision 2021 2021/10/05 - 2021/10/07 Messepiazza 1, 70629 Stuttgart, Deutschland Stuttgart, Germany 展位号: Hall 8: Booth 8E46 活动网站: Register Now Join ams OSRAM at the world's leading trade fair for machine vision. Join ams OSRAM at the Vision 2021 Get to know the latest ams OSRAM technologies at the world's leading trade fair for machine vision . We deliver miniaturized solutions that enable machines (robots) to operate safely and efficiently​. Date: October 5, 2021 Time: 12:00 - 12:30 CET > Register Now Title: Near Infrared 3D Sensing with Active Light Sources Abstract : 3D optical systems in combination with machine learning algorithms have significant growth potential in industrial mass markets. These systems increase productivity of a factory's production system through improved safety, flexibility and autonomy. In order to bridge the gap between the analog world and its digital representation smart and powerful sensing solution are essential. Whether for use cases in areas of human machine interaction, mobile robot navigation or object detection and picking, optimized 3D vision systems with IR enhanced sensors and VCSEL illumination are the basic building blocks which fuel advanced algorithms with high quality data. We will shine light on 3D time-of-flight , stereo vision and new approaches for structured light technology. Speaker: Peter Vandersteegen ​Don´t miss out the lecture at Industrial VISION Days, the world's largest lecture forum for machine vision! > Take a look at the full program Vision 2021 2021/10/05 - 2021/10/07 Messepiazza 1, 70629 Stuttgart, Deutschland Stuttgart, Germany 展位号: Hall 8: Booth 8E46 活动网站: Register Now Join ams OSRAM at the world's leading trade fair for machine vision. Join ams OSRAM at the Vision 2021 Get to know the latest ams OSRAM technologies at the world's leading trade fair for machine vision . We deliver miniaturized solutions that enable machines (robots) to operate safely and efficiently​. Date: October 5, 2021 Time: 12:00 - 12:30 CET > Register Now Title: Near Infrared 3D Sensing with Active Light Sources Abstract : 3D optical systems in combination with machine learning algorithms have significant growth potential in industrial mass markets. These systems increase productivity of a factory's production system through improved safety, flexibility and autonomy. In order to bridge the gap between the analog world and its digital representation smart and powerful sensing solution are essential. Whether for use cases in areas of human machine interaction, mobile robot navigation or object detection and picking, optimized 3D vision systems with IR enhanced sensors and VCSEL illumination are the basic building blocks which fuel advanced algorithms with high quality data. We will shine light on 3D time-of-flight , stereo vision and new approaches for structured light technology. Speaker: Peter Vandersteegen ​Don´t miss out the lecture at Industrial VISION Days, the world's largest lecture forum for machine vision! > Take a look at the full program Messepiazza 1, 70629 Stuttgart, Deutschland Stuttgart, Germany Hall 8: Booth 8E46 Join ams OSRAM at the world's leading trade fair for machine vision. Join ams OSRAM at the Vision 2021 Get to know the latest ams OSRAM technologies at the world's leading trade fair for machine vision . We deliver miniaturized solutions that enable machines (robots) to operate safely and efficiently​. Date: October 5, 2021 Time: 12:00 - 12:30 CET Title: Near Infrared 3D Sensing with Active Light Sources Abstract : 3D optical systems in combination with machine learning algorithms have significant growth potential in industrial mass markets. These systems increase productivity of a factory's production system through improved safety, flexibility and autonomy. In order to bridge the gap between the analog world and its digital representation smart and powerful sensing solution are essential. Whether for use cases in areas of human machine interaction, mobile robot navigation or object detection and picking, optimized 3D vision systems with IR enhanced sensors and VCSEL illumination are the basic building blocks which fuel advanced algorithms with high quality data. We will shine light on 3D time-of-flight , stereo vision and new approaches for structured light technology. Speaker: Peter Vandersteegen ​Don´t miss out the lecture at Industrial VISION Days, the world's largest lecture forum for machine vision! > Take a look at the full program",
    "Commitment to our Code of Conduct for ams OSRAM suppliers The Code of Conduct (CoC) for suppliers is the foundation of our cooperation with our suppliers when it comes to meeting social, ethical, human rights and environmental standards. This Code of Conduct incorporates our basic principles and international standards such as the UN Global Compact, the Code of Conduct of the Responsible Business Alliance (RBA) and the Conventions of the International Labor Organization (ILO).​ Fulfilling these standards is an essential part of our responsible procurement approach and outlines the expectations towards our suppliers and their employees. Among others we expect our suppliers: to comply with all laws and regulations and with the principles set out in our ams OSRAM Code of Conduct for Suppliers to make reasonable efforts to identify social, human rights, environmental and climate-related risks in its own supply chain and to ensure that its suppliers comply with requirements comparable to those stipulated in this code cooperate with ams OSRAM and provide relevant information and documents for the fulfillment of our obligations under applicable law cooperate with ams OSRAM in case of audits at supplier in order to verify the compliance with this Code of Conduct to undertake applicable steps to put an end to the possible violations of this Code of Conduct to participate in the trainings offered from ams OSRAM regarding the social, ethical, human rights and environmental requirements > Code of Conduct_EN (行为准则_英语版) > Code of Conduct_DE (行为准则_德语版) > Code of Conduct_CN (行为准则_中文版) Commitment to our Code of Conduct for ams OSRAM suppliers The Code of Conduct (CoC) for suppliers is the foundation of our cooperation with our suppliers when it comes to meeting social, ethical, human rights and environmental standards. This Code of Conduct incorporates our basic principles and international standards such as the UN Global Compact, the Code of Conduct of the Responsible Business Alliance (RBA) and the Conventions of the International Labor Organization (ILO).​ Fulfilling these standards is an essential part of our responsible procurement approach and outlines the expectations towards our suppliers and their employees. Among others we expect our suppliers: to comply with all laws and regulations and with the principles set out in our ams OSRAM Code of Conduct for Suppliers to make reasonable efforts to identify social, human rights, environmental and climate-related risks in its own supply chain and to ensure that its suppliers comply with requirements comparable to those stipulated in this code cooperate with ams OSRAM and provide relevant information and documents for the fulfillment of our obligations under applicable law cooperate with ams OSRAM in case of audits at supplier in order to verify the compliance with this Code of Conduct to undertake applicable steps to put an end to the possible violations of this Code of Conduct to participate in the trainings offered from ams OSRAM regarding the social, ethical, human rights and environmental requirements > Code of Conduct_EN (行为准则_英语版) > Code of Conduct_DE (行为准则_德语版) > Code of Conduct_CN (行为准则_中文版)",
    "与可靠合作伙伴的弹性供应链 我们的采购战略旨在基于与可靠合作伙伴的长期合作创建弹性供应链。这一战略的重要基石之一就是可持续性。我们明确定义道德准则,将社会标准和环境标准纳入与供应商的条例和业务流程,并要求供应商严格遵守。艾迈斯欧司朗针对工具和流程使用相应基础设施,检测违反这些要求的行为并予以规避。 × 对艾迈斯欧司朗供应商遵守《行为准则》的承诺 《行为准则》规定了对艾迈斯欧司朗所有供应商的基本要求,涉及其对利益相关者、受影响群体和环境的责任。 阅读有关我们《行为准则》的更多信息 Supplier management process Classification, qualification, selection The requirements toward our suppliers are embedded in the Supplier Management Process. As part of the supplier classification and qualification process, potential suppliers are first identified, and a subsequent selection process is used to decide whether the company should be included in ams OSRAM's global supplier network. In addition to business, product-specific and formal decision-making criteria, this process also considers sustainability-related requirements such as human rights due diligence and environmental protection in order to ensure the alignment with the ams OSRAM Code of Conduct. These requirements, which are reviewed on a yearly base, depend on the material sourced, the country in which it is sourced, and the volume purchased from the suppliers. The fulfillment of these requirements plays an important role during the selection process and provides the supplier with a higher classification in the initial phase e.g., preferred supplier. Some of the requirements are as follows: - Suppliers from countries where social risks are more acute ( acc. to RBA) must submit a self-assessment on relevant aspects of corporate responsibility - Suppliers of production materials must demonstrate in the selection process that they are certified in accordance with environmental management norm ISO 14001 and comply with the EU RoHS Directive (Restriction of Hazardous Substances in electrical and electronic equipment) and the EU REACH Regulation (Registration, Evaluation, Authorization and Restriction of Chemicals). - In the qualification phase for automotive suppliers from whom materials are to be purchased directly, the suppliers undergo a process audit as prescribed by VDA 6.3 (German Association of the Automotive Industry). The audit assesses the supplier's production and service processes. - Compliance with RMI Conflict Mineral approach - Applicable suppliers shall disclose information on the carbon footprint using specific questionnaire in Integrity Next platform. - Regardless of the materials or services they intend to provide for us, prior to being accepted as a supplier of ams OSRAM these companies are checked against international sanctions lists. Updated lists are automatically uploaded to the export monitoring systems and serve as a basis for also checking existing suppliers every time an order is submitted and before every payment run. - In the process of selecting suppliers for energy-intensive equipment, anticipated energy consumption and the associated CO2 emissions are already taken into consideration in the total cost of ownership calculation (TCO). Cost savings over the entire period of use, such as energy savings, are therefore factored into the decision to buy. If a potential supplier successfully makes it through this selection process, it is added to ams OSRAM's supplier network and, as such, continues to undergo regular monitoring. For more information, please visit our training and supplier requirements site. Monitoring and development The supplier monitoring process involves mechanisms for systematically reviewing compliance with supplier requirements. Supplier Ratings Apart from regular performance evaluations, the monitoring phase also includes regular sustainability ratings for strategic relevant suppliers. Depending on the results, actions are agreed with the supplier as part of the development process, which are to be implemented within a specified period. Rating results are an important indicator for the further collaboration with the suppliers and can lead to a higher classification of the supplier e.g., preferred supplier. Supplier Assessments Supplier assessments are also a core element of the supplier monitoring process. These assessment include on-site and desk assessments. The on-site assessments can be conducted from ams OSRAM, or a third party appointed by ams OSRAM. This includes also audits to verify the supplier compliance with the obligations under the Code of Conduct, so called corporate responsibility audits. During the monitoring process the conducted supplier self assessments will be reviewed and if necessary, measures will be defined. Qualification requirements It is a core part of the monitoring process to make sure that the qualification requirements are up to date and comply with the industry standards (several Certifications) as well as legal and customer requirements. Supplier Development Depending on the results of the supplier ratings, assessments and audits, ams OSRAM supports the suppliers to understand the requirements and implement the agreed action plans. This can be a part of the yearly business review with the supplier, can be involving respective ams OSRAM responsible person, or the suppliers are supported in form of self paced learning using the information in the training section. Risk management approach Ongoing reviews of the procurement process to identify possible risks are a core element of supplier management. The risk management approach in the supply chain includes the management of sourcing and Corporate Social Responsibility (CSR) risks. The handling of these risks is also embedded in the company-wide risk management system. Monitoring and development activities are focused on relevant suppliers. These suppliers can among others be strategic and or business relevant for ams OSRAM or may bear risks in one of the ESG dimensions in dependence of country of origin, sourced material, sector in which they operate. Sourcing risks Sourcing risks can either be related to the supplier (e.g. financial health, geopolitical situation, etc.) or arise from the individual sourcing situation associated with the criticality of the materials or services procured for ams OSRAM. This continuous risk assessment is performed regularly and applies for relevant suppliers, whereas the relevance of the supplier is defined along others on the strategic or business relevance of the supplier for ams OSRAM. In case of critical suppliers/materials, measures are taken to minimize the risks. CSR risks CSR Risks in the upstream supply chain are associated with the potential for a supplier's actions to cause harm to people, the environment or society. Risk analysis - Core part of this risk management approach is a regular multi-level risk analysis considering the country of origin of the supplier, sector, category or product related risks aiming to find the relevant suppliers to focus on for further monitoring and development activities . The relevance of the supplier is defined among others on the business relevance and/ or the risks it could bear towards society, human rights and environment. - Starting point for the risk analysis is the screening of our purchasing volume and suppliers with respect to environmental, social and governance risks. The assessment is based on a multitude of indexes, which are used to produce a geographical and a product-related risk classification. - The geographical risk classification reflects the supplier risks in areas of labor, health, safety, the environment and business ethics including the relevant management systems. The product-related risk classification gives an indication on human rights and environmental risks, always based on the labor conditions of the industry and production processes in the sourcing country. - The results of this first step are basis for further specific investigation of the potential high-risk suppliers identified. Once the available certificates, Self-Assessments (CRSA) and sustainability assessments have been analyzed, appropriate preventive and remedial actions may be taken. Preventive and remedial actions - Based on the results of the risk analysis high risk suppliers can be required to undergo a Corporate Responsibility audit – e.g. in accordance with the RBA standard. - Based on the Audit results corrective actions plan shall be implemented within a specific time frame. - If violations towards human rights environmental protection and all topics covered in the Code of Conduct are detected, the supplier shall agree to undertake applicable steps to put an end to the possible violations. Depending on the severity of the violations ams OSRAM may terminate the relationship with the supplier. - By signing the ams OSRAM CoC for suppliers, the supplier agrees to participate to self paced or instructor-led trainings offered by ams OSRAM. Classification, qualification, selection The requirements toward our suppliers are embedded in the Supplier Management Process. As part of the supplier classification and qualification process, potential suppliers are first identified, and a subsequent selection process is used to decide whether the company should be included in ams OSRAM's global supplier network. In addition to business, product-specific and formal decision-making criteria, this process also considers sustainability-related requirements such as human rights due diligence and environmental protection in order to ensure the alignment with the ams OSRAM Code of Conduct. These requirements, which are reviewed on a yearly base, depend on the material sourced, the country in which it is sourced, and the volume purchased from the suppliers. The fulfillment of these requirements plays an important role during the selection process and provides the supplier with a higher classification in the initial phase e.g., preferred supplier. Some of the requirements are as follows: - Suppliers from countries where social risks are more acute ( acc. to RBA) must submit a self-assessment on relevant aspects of corporate responsibility - Suppliers of production materials must demonstrate in the selection process that they are certified in accordance with environmental management norm ISO 14001 and comply with the EU RoHS Directive (Restriction of Hazardous Substances in electrical and electronic equipment) and the EU REACH Regulation (Registration, Evaluation, Authorization and Restriction of Chemicals). - In the qualification phase for automotive suppliers from whom materials are to be purchased directly, the suppliers undergo a process audit as prescribed by VDA 6.3 (German Association of the Automotive Industry). The audit assesses the supplier's production and service processes. - Compliance with RMI Conflict Mineral approach - Applicable suppliers shall disclose information on the carbon footprint using specific questionnaire in Integrity Next platform. - Regardless of the materials or services they intend to provide for us, prior to being accepted as a supplier of ams OSRAM these companies are checked against international sanctions lists. Updated lists are automatically uploaded to the export monitoring systems and serve as a basis for also checking existing suppliers every time an order is submitted and before every payment run. - In the process of selecting suppliers for energy-intensive equipment, anticipated energy consumption and the associated CO2 emissions are already taken into consideration in the total cost of ownership calculation (TCO). Cost savings over the entire period of use, such as energy savings, are therefore factored into the decision to buy. If a potential supplier successfully makes it through this selection process, it is added to ams OSRAM's supplier network and, as such, continues to undergo regular monitoring. For more information, please visit our training and supplier requirements site. Monitoring and development The supplier monitoring process involves mechanisms for systematically reviewing compliance with supplier requirements. Supplier Ratings Apart from regular performance evaluations, the monitoring phase also includes regular sustainability ratings for strategic relevant suppliers. Depending on the results, actions are agreed with the supplier as part of the development process, which are to be implemented within a specified period. Rating results are an important indicator for the further collaboration with the suppliers and can lead to a higher classification of the supplier e.g., preferred supplier. Supplier Assessments Supplier assessments are also a core element of the supplier monitoring process. These assessment include on-site and desk assessments. The on-site assessments can be conducted from ams OSRAM, or a third party appointed by ams OSRAM. This includes also audits to verify the supplier compliance with the obligations under the Code of Conduct, so called corporate responsibility audits. During the monitoring process the conducted supplier self assessments will be reviewed and if necessary, measures will be defined. Qualification requirements It is a core part of the monitoring process to make sure that the qualification requirements are up to date and comply with the industry standards (several Certifications) as well as legal and customer requirements. Supplier Development Depending on the results of the supplier ratings, assessments and audits, ams OSRAM supports the suppliers to understand the requirements and implement the agreed action plans. This can be a part of the yearly business review with the supplier, can be involving respective ams OSRAM responsible person, or the suppliers are supported in form of self paced learning using the information in the training section. The requirements toward our suppliers are embedded in the Supplier Management Process. As part of the supplier classification and qualification process, potential suppliers are first identified, and a subsequent selection process is used to decide whether the company should be included in ams OSRAM's global supplier network. In addition to business, product-specific and formal decision-making criteria, this process also considers sustainability-related requirements such as human rights due diligence and environmental protection in order to ensure the alignment with the ams OSRAM Code of Conduct. These requirements, which are reviewed on a yearly base, depend on the material sourced, the country in which it is sourced, and the volume purchased from the suppliers. The fulfillment of these requirements plays an important role during the selection process and provides the supplier with a higher classification in the initial phase e.g., preferred supplier. Some of the requirements are as follows: - Suppliers from countries where social risks are more acute ( acc. to RBA) must submit a self-assessment on relevant aspects of corporate responsibility - Suppliers of production materials must demonstrate in the selection process that they are certified in accordance with environmental management norm ISO 14001 and comply with the EU RoHS Directive (Restriction of Hazardous Substances in electrical and electronic equipment) and the EU REACH Regulation (Registration, Evaluation, Authorization and Restriction of Chemicals). - In the qualification phase for automotive suppliers from whom materials are to be purchased directly, the suppliers undergo a process audit as prescribed by VDA 6.3 (German Association of the Automotive Industry). The audit assesses the supplier's production and service processes. - Compliance with RMI Conflict Mineral approach - Applicable suppliers shall disclose information on the carbon footprint using specific questionnaire in Integrity Next platform. - Regardless of the materials or services they intend to provide for us, prior to being accepted as a supplier of ams OSRAM these companies are checked against international sanctions lists. Updated lists are automatically uploaded to the export monitoring systems and serve as a basis for also checking existing suppliers every time an order is submitted and before every payment run. - In the process of selecting suppliers for energy-intensive equipment, anticipated energy consumption and the associated CO2 emissions are already taken into consideration in the total cost of ownership calculation (TCO). Cost savings over the entire period of use, such as energy savings, are therefore factored into the decision to buy. If a potential supplier successfully makes it through this selection process, it is added to ams OSRAM's supplier network and, as such, continues to undergo regular monitoring. For more information, please visit our training and supplier requirements site. The supplier monitoring process involves mechanisms for systematically reviewing compliance with supplier requirements. Supplier Ratings Apart from regular performance evaluations, the monitoring phase also includes regular sustainability ratings for strategic relevant suppliers. Depending on the results, actions are agreed with the supplier as part of the development process, which are to be implemented within a specified period. Rating results are an important indicator for the further collaboration with the suppliers and can lead to a higher classification of the supplier e.g., preferred supplier. Supplier Assessments Supplier assessments are also a core element of the supplier monitoring process. These assessment include on-site and desk assessments. The on-site assessments can be conducted from ams OSRAM, or a third party appointed by ams OSRAM. This includes also audits to verify the supplier compliance with the obligations under the Code of Conduct, so called corporate responsibility audits. During the monitoring process the conducted supplier self assessments will be reviewed and if necessary, measures will be defined. Qualification requirements It is a core part of the monitoring process to make sure that the qualification requirements are up to date and comply with the industry standards (several Certifications) as well as legal and customer requirements. Supplier Development Depending on the results of the supplier ratings, assessments and audits, ams OSRAM supports the suppliers to understand the requirements and implement the agreed action plans. This can be a part of the yearly business review with the supplier, can be involving respective ams OSRAM responsible person, or the suppliers are supported in form of self paced learning using the information in the training section. Ongoing reviews of the procurement process to identify possible risks are a core element of supplier management. The risk management approach in the supply chain includes the management of sourcing and Corporate Social Responsibility (CSR) risks. The handling of these risks is also embedded in the company-wide risk management system. Monitoring and development activities are focused on relevant suppliers. These suppliers can among others be strategic and or business relevant for ams OSRAM or may bear risks in one of the ESG dimensions in dependence of country of origin, sourced material, sector in which they operate. Sourcing risks Sourcing risks can either be related to the supplier (e.g. financial health, geopolitical situation, etc.) or arise from the individual sourcing situation associated with the criticality of the materials or services procured for ams OSRAM. This continuous risk assessment is performed regularly and applies for relevant suppliers, whereas the relevance of the supplier is defined along others on the strategic or business relevance of the supplier for ams OSRAM. In case of critical suppliers/materials, measures are taken to minimize the risks. CSR risks CSR Risks in the upstream supply chain are associated with the potential for a supplier's actions to cause harm to people, the environment or society. Risk analysis - Core part of this risk management approach is a regular multi-level risk analysis considering the country of origin of the supplier, sector, category or product related risks aiming to find the relevant suppliers to focus on for further monitoring and development activities . The relevance of the supplier is defined among others on the business relevance and/ or the risks it could bear towards society, human rights and environment. - Starting point for the risk analysis is the screening of our purchasing volume and suppliers with respect to environmental, social and governance risks. The assessment is based on a multitude of indexes, which are used to produce a geographical and a product-related risk classification. - The geographical risk classification reflects the supplier risks in areas of labor, health, safety, the environment and business ethics including the relevant management systems. The product-related risk classification gives an indication on human rights and environmental risks, always based on the labor conditions of the industry and production processes in the sourcing country. - The results of this first step are basis for further specific investigation of the potential high-risk suppliers identified. Once the available certificates, Self-Assessments (CRSA) and sustainability assessments have been analyzed, appropriate preventive and remedial actions may be taken. Preventive and remedial actions - Based on the results of the risk analysis high risk suppliers can be required to undergo a Corporate Responsibility audit – e.g. in accordance with the RBA standard. - Based on the Audit results corrective actions plan shall be implemented within a specific time frame. - If violations towards human rights environmental protection and all topics covered in the Code of Conduct are detected, the supplier shall agree to undertake applicable steps to put an end to the possible violations. Depending on the severity of the violations ams OSRAM may terminate the relationship with the supplier. - By signing the ams OSRAM CoC for suppliers, the supplier agrees to participate to self paced or instructor-led trainings offered by ams OSRAM. Sourcing risks can either be related to the supplier (e.g. financial health, geopolitical situation, etc.) or arise from the individual sourcing situation associated with the criticality of the materials or services procured for ams OSRAM. This continuous risk assessment is performed regularly and applies for relevant suppliers, whereas the relevance of the supplier is defined along others on the strategic or business relevance of the supplier for ams OSRAM. In case of critical suppliers/materials, measures are taken to minimize the risks. CSR Risks in the upstream supply chain are associated with the potential for a supplier's actions to cause harm to people, the environment or society. Risk analysis - Core part of this risk management approach is a regular multi-level risk analysis considering the country of origin of the supplier, sector, category or product related risks aiming to find the relevant suppliers to focus on for further monitoring and development activities . The relevance of the supplier is defined among others on the business relevance and/ or the risks it could bear towards society, human rights and environment. - Starting point for the risk analysis is the screening of our purchasing volume and suppliers with respect to environmental, social and governance risks. The assessment is based on a multitude of indexes, which are used to produce a geographical and a product-related risk classification. - The geographical risk classification reflects the supplier risks in areas of labor, health, safety, the environment and business ethics including the relevant management systems. The product-related risk classification gives an indication on human rights and environmental risks, always based on the labor conditions of the industry and production processes in the sourcing country. - The results of this first step are basis for further specific investigation of the potential high-risk suppliers identified. Once the available certificates, Self-Assessments (CRSA) and sustainability assessments have been analyzed, appropriate preventive and remedial actions may be taken. Preventive and remedial actions - Based on the results of the risk analysis high risk suppliers can be required to undergo a Corporate Responsibility audit – e.g. in accordance with the RBA standard. - Based on the Audit results corrective actions plan shall be implemented within a specific time frame. - If violations towards human rights environmental protection and all topics covered in the Code of Conduct are detected, the supplier shall agree to undertake applicable steps to put an end to the possible violations. Depending on the severity of the violations ams OSRAM may terminate the relationship with the supplier. - By signing the ams OSRAM CoC for suppliers, the supplier agrees to participate to self paced or instructor-led trainings offered by ams OSRAM."
  ]
}