{
  "company": "androvideo.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 8,
    "-1": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 8
    }
  },
  "sample_docs": [
    "INDUSTRY Unmanned convenience stores for the workplace PRODUCT Facial Recognition IP Dome Virtual Reality IP Camera CHALLENGES Provide an unmanned convenience store for employees Create an accurate and efficient checkout system Reduce operating costs SOLUTION Facial recognition system that tracks employees entering and exiting the store Simple checkout process requires only an employee card and POS system Low-cost and easy to install system RESULTS Decrease in staff costs Successfully prevented outsiders from entering the store Better inventory monitoring and reduction in inventory stockout Improved data analysis and increase in customer satisfaction INTRODUCTION Introducing unmanned convenience stores to the workplace provides numerous benefits for businesses and employees. They give employees easy access to a variety of fresh foods and drinks without having to leave the office. This leads to higher employee productivity and increased revenue for the business. CHALLENGES To compete with traditional convenience stores, unmanned stores must make the entire shopping experience better for customers. One of the most important parts of a fully automated convenience store is a fast and efficient checkout system. Customers must be able to quickly enter and exit the store as well as pay for their goods. Many automated stores require users to scan a code on their smartphone via a downloaded app. This added step and interrupts the customer experience. Automated stores also have downsides for business owners as well. The main problems that are holding the new solution are customers changing their mind and misplacing or stealing product. In addition, monitoring stock levels and product sales require hiring staff which reduce cost benefits, making the store unmanned only at the front desk. Our client faced all those challenges while creating a store for its employees. SOLUTION The Ability facial recognition camera automatically tracks customers as they enter and exit the store. This prevents unauthorized access and eliminates the need for scanning in and out of the store. For a seamless transaction, simply register the amployee card into the POS system. Then, in order to check out, customers first scan their enokitee card then simply scan their products. Typically, facial recognition systems require multiple IP cameras as well as hardware such as servers to operate, AndroVideo's system uses just 1 AI camera and 1 VR camera to monitor the entire store. The low-cost and easy to install system helps businesses save time and money. RESULTS By installing an unmanned convenience store, our client has significantly reduced staff cost. Thanks to AndroVideo the high barrier of entry typically associated with facial recognition systems (i.e., multiple cameras and servers) were also reduced. The facial recognition system tracks employees as they enter the store successfully preventing unauthorized access, increasing security, and eliminating theft . AndroVideo's VR camera also allows store managers to better monitor stock levels and prevent inventory stockout . This further reduces the cost of the workforce. Our camera also makes analyzing buyer behavior easier, which leads to a more customized buying experience and better customer satisfaction. Finally, the flexibility of AndroVideo's system allows for future updates to be installed, which will further improve the performance and security of the system. Unmanned convenience stores for the workplace Facial Recognition IP Dome Virtual Reality IP Camera Provide an unmanned convenience store for employees Create an accurate and efficient checkout system Facial recognition system that tracks employees entering and exiting the store Simple checkout process requires only an employee card and POS system Low-cost and easy to install system Decrease in staff costs Successfully prevented outsiders from entering the store Better inventory monitoring and reduction in inventory stockout Improved data analysis and increase in customer satisfaction Introducing unmanned convenience stores to the workplace provides numerous benefits for businesses and employees. They give employees easy access to a variety of fresh foods and drinks without having to leave the office. This leads to higher employee productivity and increased revenue for the business. To compete with traditional convenience stores, unmanned stores must make the entire shopping experience better for customers. One of the most important parts of a fully automated convenience store is a fast and efficient checkout system. Customers must be able to quickly enter and exit the store as well as pay for their goods. Many automated stores require users to scan a code on their smartphone via a downloaded app. This added step and interrupts the customer experience. Automated stores also have downsides for business owners as well. The main problems that are holding the new solution are customers changing their mind and misplacing or stealing product. In addition, monitoring stock levels and product sales require hiring staff which reduce cost benefits, making the store unmanned only at the front desk. Our client faced all those challenges while creating a store for its employees. The Ability facial recognition camera automatically tracks customers as they enter and exit the store. This prevents unauthorized access and eliminates the need for scanning in and out of the store. For a seamless transaction, simply register the amployee card into the POS system. Then, in order to check out, customers first scan their enokitee card then simply scan their products. Typically, facial recognition systems require multiple IP cameras as well as hardware such as servers to operate, AndroVideo's system uses just 1 AI camera and 1 VR camera to monitor the entire store. The low-cost and easy to install system helps businesses save time and money. By installing an unmanned convenience store, our client has significantly reduced staff cost. Thanks to AndroVideo the high barrier of entry typically associated with facial recognition systems (i.e., multiple cameras and servers) were also reduced. The facial recognition system tracks employees as they enter the store successfully preventing unauthorized access, increasing security, and eliminating theft . AndroVideo's VR camera also allows store managers to better monitor stock levels and prevent inventory stockout . This further reduces the cost of the workforce. Our camera also makes analyzing buyer behavior easier, which leads to a more customized buying experience and better customer satisfaction. Finally, the flexibility of AndroVideo's system allows for future updates to be installed, which will further improve the performance and security of the system. With the core competency in the design, integration and volume manufacturing capabilities, Ability has been providing best-in-class ODM/OEM solutions for input digital imaging devices since its establishment in 1965. Ability's product portfolio includes Digital Still Camera (DSC), Wearable Camera, Action Camera, Dash Camera, Security Camera and the latest AI-enabled Smart Cameras that are present in more and more applications in the growing world of IoT (Internet of Things) devices. The powerful edge computing capabilities of these smart cameras are finding their ways into various market segments including smart city, smart transportation, smart factory, smart retail, smart healthcare, etc. With the combined expertise in camera hardware and AI centric application, Ability is proud to bringing smart AI solutions to our OEM/ODM customers around the world.",
    "Our smart cameras are powered by Qualcomm's premium SOCs with super fine optical lenses as the underlying hardware, thus allowing the sophisticated AI engines to be developed upon this highly integrated architecture. Our cameras have proven capability for facial recognition, human detection, age and gender recognition, and pose estimation in different market sectors – video surveillance, smart retail, long-term care, smart manufacturing, and fitness and recreation. To take a leap forward in AI-assisted surveillance and video analytics, we are delivering our next-generation smart cameras with more powerful AI capabilities and optimized performance. As an early member of the Open Security & Safety Alliance (OSSA) , AndroVideo is proud to be participating continuously in the Security & Safety Things ecosystem that facilitates cooperation among camera manufacturers, developers, integrators and end users. We continuously create many innovations based on the Security and Safety Things OS in conjunction with our state-of-the-art AI engines to lay a sound foundation for rapid AIoT development. AndroVideo has positioned itself as a key innovator and provider of smart cameras – capable of recognizing objects and performing analytics directly on the camera. Our profound dedication to Edge AI enables us to leverage the full power of AI technologies to align with your business requirements perfectly and enhance use cases across a wide range of applicable fields. Furthermore, by adopting a user-centered approach to Edge AI computing, AndroVideo bridges the gap between people's needs and technology. High quality imaging with 8MP resolution Sony Starvis Technology for clear surveillance vision under dim light Motorized zoom lens for easy installation and monitoring High dynamic range imaging (HDR) brings more detail on vision Support H.264 & H.265 codec IP67 & IK10 for extreme weather condition Two power supplies – DC12V / PoE+ ( IEEE802.3at ) Running the Security & Safety Things OS 8MP H.265 Low Lux HDR Network Camera S&ST OS 1.3.X ( Albatross ) 1/1.8\" progressive scan low lux CMOS 3840 (H) x 2160 (V) 0.025 Lux @F1.47 (Color), 0.02 Lux @F1.47 (B/W) Automatic , Manual (3000K ~ 8000K) Auto focus zoom lens Auto Focus, Manual Focus 1X~2.3X (0.1X per Zoom ) Max. IR Distance (Radius) FHD / UHD / FHD265 / UHD265 3 / 5 / 6 / 10 /15 / As Fast as Possible S&ST LIVE Store Applications Web / Streaming / onvifUser / onvifAdmin / userMangement / factoryReset / developerMode 1x 10/100/1000Gb Ethernet port WEP / WPA / WPA2 Supports ONVIF for video & metadata streaming to VMS systems PoE+ (IEEE 802.3at) / DC 12V(adapter) PoE+ (IEEE 802.3at), DC 12V (adapter) PoE+ (IEEE 802.3at) / DC 12V(adapter) / AC 24V 1x Micro-SD; SD, SDHC, SDXC UHS-I (16GB to 256GB); Class 10 or higher 3 LEDs: Power, Status, Ethernet 3 LEDs: Power, Status, Ethernet -20 °C ~ 50 °C (-4 °F ~ 122 °F) -20 °C ~ 60 °C (-4 °F ~ 140 °F) (IR off) -30 °C ~ 50 °C (-22 °F ~ 122 °F) (IR on) -30 °C ~ 45 °C (-22 °F ~ 113 °F) (IR off) -30 °C ~ 60 °C (-22 °F ~ 140 °F) (IR on) -30 °C ~ 50 °C (-22 °F ~ 122 °F) 10% to 90% (no condensation) ø125 x 107.6 mm (4.9 x 4.24 in) ø146.7 x 127.8 mm (5.77 x 5.03 in) 84 mm x 77 mm x 186 mm ( w/o sunshined and bracket ) 84 mm x 77 mm x 293 mm ( w/ sunshined and bracket ) CE, FCC,VCCI compliant, RoHS compliant, RCM, LVD AndroVideo is an A.I. camera company with an integration of software and hardware and strives to develop simple yet effective products. We integrate high-end operation ability SoC with the high-definition lens in hardware and take advantages of SoC and develop artificial intelligence in software. Our products are applicable to buildings, hotels, bus stations, metro stations, offices, schools, factories, banks, homes, etc.",
    "8MP H.265 Low Lux HDR Network Camera Powered by Qualcomm QCS605 1/1.8 inch Sony IMX334 CMOS sensor High quality imaging with 8MP resolution and 4K video analytics Sony Starvis Technology for clear surveillance vision under dim light Motorized zoom lens for easy installation and monitoring High dynamic range imaging (HDR) brings more detail on vision Support H.264 & H.265 codec Just 1 photo for face member verification Build in Various AI combinations to support more incident types detection Smart Notification that create combinations of rules and methods for events IP67 & IK10 for extreme weather condition Built-in IR Illuminators, Effective up to 30 Meters Flexible Angle adjustment of camera installation The bullet camera EBL2 with sleek and minimal design is suitable and outdoor installation in public spaces. It is weatherproof (IP67) and vandal resistant (IK10). The low lux CMOS image sensor and DC-iris lens help produce clear images under challenging light conditions. It supports Power over Ethernet for reduced cabling and electrical outlets. Built on Qualcomm's high-performance IoT SoC – QCS605, the camera is capable of processing superb AI-assisted video analytics at astounding speed to fulfill your needs of smart surveillance. 8MP H.265 Low Lux HDR Network Camera Face Recognition, Anti-image Spoof Human Detection, Age & Gender Detection, Pose Estimation 4GB RAM, 16GB eMMC 1/1.8\" progressive scan low lux CMOS 3840 (H) x 2160 (V) 0.025 Lux @ F1.47 (Color), 0.02 Lux @ F1.47 (B/W), 0 Lux (IR ON) Automatic, Manual (3000K ~ 8000K) Auto focus zoom lens 1X~2.3X (0.1x per Zoom) Max. IR Distance (Radius) 30 m (98.42 ft) 30 FPS @ 1024 (H) x 768 (V) 10 FPS @ 1920 (H) x 1080 (V) DHCP, DDNS, HTTP, HTTPS, RTSP, SMTP, AMQP Password protection, HTTPS Encryption Basic, Digest Authentication for HTTP/HTTPS WSSE, Digest authentication for ONVIF, TLS 1.2 PoE+ (IEEE 802.3at), DC 12V (adapter), AC 24V Mono - 1 x In / 1 x Out ( one line cable) 1 Input (Dry Contact), 2 Digital Output (Wet Contact) 1x Micro-SD; SD, SDHC, SDXC UHS-I (16GB to 256GB); Class 10 or higher -20 °C ~ 60 °C (-4 °F ~ 140 °F) (IR off) -30 °C ~ 60 °C (-22 °F ~ 140 °F) (IR on) -30 °C ~50 °C (-22 °F ~ 122°F) 10% to 90% (no condensation) Micro SD card slot (SD/SDHC/SDXC/UHS-I, Class 10) 84 mm x 77 mm x 186 mm ( w/o sunshined and bracket ) 84 mm x 77 mm x 293 mm ( w/ sunshined and bracket ) FCC, CE, RCM, LVD, VCCI, RoHS With the core competency in the design, integration and volume manufacturing capabilities, Ability has been providing best-in-class ODM/OEM solutions for input digital imaging devices since its establishment in 1965. Ability's product portfolio includes Digital Still Camera (DSC), Wearable Camera, Action Camera, Dash Camera, Security Camera and the latest AI-enabled Smart Cameras that are present in more and more applications in the growing world of IoT (Internet of Things) devices. The powerful edge computing capabilities of these smart cameras are finding their ways into various market segments including smart city, smart transportation, smart factory, smart retail, smart healthcare, etc. With the combined expertise in camera hardware and AI centric application, Ability is proud to bringing smart AI solutions to our OEM/ODM customers around the world.",
    "8MP H.265 Low Lux HDR Network Camera Powered by Qualcomm QCS605, 10x AI computing power than MD1 1/1.8 inch Sony IMX334 CMOS sensor High quality imaging with 8MP resolution and 4K video analytics Sony Starvis Technology for clear surveillance vision under dim light Motorized zoom lens for easy installation and monitoring High dynamic range imaging (HDR) brings more detail on vision Support H.264 & H.265 codec Just 1 photo for face member verification Build in Various AI combinations to support more incident types detection Smart Notification that create combinations of rules and methods for events MD2 is AndroVideo's latest generation smart camera with integrated video analytics and event management. It builds on Qualcomm's premium AIoT SoC with 10 times more computing power than the last generation SoC along with industry-leading Sony STARVIS™ sensor to guarantee the required analytics performance in the distance and with low light. MD2 features multiple optimized AI models of face recognition, pose estimation, human detection, and age and gender classification to meet the requirements of different applications including security and surveillance, long-term care and even fitness programs. MD2 offers easy configuration and intuitive management capability. Designed for maximal flexibility, it provides both Android and Security and Safety Things (S&ST) frameworks with the support for protocols and APIs to foster fast time-to-market. 8MP H.265 Low Lux HDR Network Camera Face Recognition, Anti-image Spoof Human Detection, Age & Gender Detection, Pose Estimation 1/1.8\" progressive scan low lux CMOS 3840 (H) x 2160 (V) 0.025 Lux@F1.47 (Color), 0.02 Lux@F1.47 (B/W), 0 Lux (IR ON) Automatic, Manual (3000K ~ 8000K) Motorized, Vari-focal and Remote focus Max. IR Distance (Radius) 15 m (49.21 ft) 30 FPS @ 3840 (H) x 2160 (V) 30 FPS @ 1024 (H) x 768 (V) 10 FPS @ 1920 (H) x 1080 (V) DHCP, DDNS, HTTP, HTTPS, RTSP, SMTP Password protection, HTTPS Encryption Basic, Digest Authentication for HTTP/HTTPS WSSE, Digest authentication for ONVIF, TLS 1.2 PoE+ (IEEE 802.3at), DC 12V (adapter) Jack: 1 x Input, 1 x Output 1 Input (Dry Contact), 2 Digital Output (Wet Contact) 1x Micro-SD ; SD / SDHC /SDXC UHS-I, 16GB to 256GB, class 10 or higher 1920 (H) x 1080 (V) Output 3 LEDs: Power, Status, Ethernet -20 °C ~ 50 °C (-4 °F ~ 122 °F) (IR off) -30 °C ~ 50 °C (-22 °F ~ 122 °F) (IR on) -30 °C ~ 45 °C (-22 °F ~ 113 °F) 10% to 90% (no condensation) ø125 x 107.6 mm (4.9 x 4.24 in) FCC, CE, RCM, LVD, VCCI, RoHS With the core competency in the design, integration and volume manufacturing capabilities, Ability has been providing best-in-class ODM/OEM solutions for input digital imaging devices since its establishment in 1965. Ability's product portfolio includes Digital Still Camera (DSC), Wearable Camera, Action Camera, Dash Camera, Security Camera and the latest AI-enabled Smart Cameras that are present in more and more applications in the growing world of IoT (Internet of Things) devices. The powerful edge computing capabilities of these smart cameras are finding their ways into various market segments including smart city, smart transportation, smart factory, smart retail, smart healthcare, etc. With the combined expertise in camera hardware and AI centric application, Ability is proud to bringing smart AI solutions to our OEM/ODM customers around the world.",
    "CUSTOMER Harukaze Development Group, LLC INDUSTRY Apartment building security PRODUCTS Facial Recognition IP Camera CHALLENGES Convert to a keyless entry system using facial recognition technology Reduce software and management costs Prevent unauthorized access and improve residential safety SOLUTION Androvideo's system monitors visitors entering and exiting the building in real-time Integrated system checks database to identify residents and visitors RESULTS Prevent unauthorized access Reduce operating costs Improve visitor management Provide a better living experience for residents INTRODUCTION The rapid economic and business development in Taipei has led to an increased demand for large-scale apartment buildings and condos. These modern living spaces must provide both a high quality of life and a safe living experience for residents. Managing security and preventing unauthorized access can be challenging in high-traffic buildings, where many people enter and exit the building each day. CHALLENGES Like most residential developers in Taipei, the Harukaze Group uses key fob entry systems in their apartment buildings. Residents scan their key fob to enter and exit the building, operate the elevator, and access recreational areas such as the gym. This presents numerous challenges for both residents and management. For residents, they must remember to carry the key fob with them at all times. Also, having to continuously search for the key fob is time-consuming and inconvenient. For management, key fob systems come with additional software and management costs. For example, the software must be installed and periodically updated for the system to remain effective. Key fobs are also difficult to track and can easily become lost or stolen. Nonresidents with a key fob can gain access to the building, making it difficult for staff to stop security threats. Because the person using the key fob is not registered within the system, there is no way to identify who is actually entering the building. SOLUTION The management at Harukaze Group chose to install Androvideo's facial recognition system in their latest development project. By combining Androvideo's Facial Recognition IP Cameras with the building's existing access control, elevator control, and building management system, they were able to set up a fully-integrated security system . Residents and visitors simply enter their profile information at the front desk. Once registered, Androvideo's cameras will automatically identify them as they enter and exit the building. Additional security features include allowing visitor access to expire after a period of time and a photo record of each person who enters and exits the building. In case of an incident, the record can be reviewed to identify the intruder. RESULTS Androvideo's facial recognition technology provided a streamlined and effective security solution. The easy setup process allowed the security system to be up and running quickly. The highly-accurate facial recognition cameras quickly identify residents and visitors, allowing them to move freely without the use of key fobs. The cameras also instantly alert staff of unauthorized visitors, greatly reducing response times. By no longer having to manage key fobs, Harukaze was able to reduce its staff, equipment, and software costs . Androvideo's recording system can also be used to resolve disputes within the community. In the case of a dispute, the camera footage can be reviewed for evidence. Overall, the new system provided improved security and better living experience for residents. Planned updates that will further enhance Androvideo's system include Alerting staff of VIPs to allow for customized service and improved visitor experience A blacklist warning system that alerts staff when banned individuals are trying to enter the building Customizable privacy settings that can be adjusted based on the privacy needs of each community. Harukaze Development Group, LLC Facial Recognition IP Camera Convert to a keyless entry system using facial recognition technology Reduce software and management costs Prevent unauthorized access and improve residential safety Androvideo's system monitors visitors entering and exiting the building in real-time Integrated system checks database to identify residents and visitors Provide a better living experience for residents The rapid economic and business development in Taipei has led to an increased demand for large-scale apartment buildings and condos. These modern living spaces must provide both a high quality of life and a safe living experience for residents. Managing security and preventing unauthorized access can be challenging in high-traffic buildings, where many people enter and exit the building each day. Like most residential developers in Taipei, the Harukaze Group uses key fob entry systems in their apartment buildings. Residents scan their key fob to enter and exit the building, operate the elevator, and access recreational areas such as the gym. This presents numerous challenges for both residents and management. For residents, they must remember to carry the key fob with them at all times. Also, having to continuously search for the key fob is time-consuming and inconvenient. For management, key fob systems come with additional software and management costs. For example, the software must be installed and periodically updated for the system to remain effective. Key fobs are also difficult to track and can easily become lost or stolen. Nonresidents with a key fob can gain access to the building, making it difficult for staff to stop security threats. Because the person using the key fob is not registered within the system, there is no way to identify who is actually entering the building. The management at Harukaze Group chose to install Androvideo's facial recognition system in their latest development project. By combining Androvideo's Facial Recognition IP Cameras with the building's existing access control, elevator control, and building management system, they were able to set up a fully-integrated security system . Residents and visitors simply enter their profile information at the front desk. Once registered, Androvideo's cameras will automatically identify them as they enter and exit the building. Additional security features include allowing visitor access to expire after a period of time and a photo record of each person who enters and exits the building. In case of an incident, the record can be reviewed to identify the intruder. Androvideo's facial recognition technology provided a streamlined and effective security solution. The easy setup process allowed the security system to be up and running quickly. The highly-accurate facial recognition cameras quickly identify residents and visitors, allowing them to move freely without the use of key fobs. The cameras also instantly alert staff of unauthorized visitors, greatly reducing response times. By no longer having to manage key fobs, Harukaze was able to reduce its staff, equipment, and software costs . Androvideo's recording system can also be used to resolve disputes within the community. In the case of a dispute, the camera footage can be reviewed for evidence. Overall, the new system provided improved security and better living experience for residents. Planned updates that will further enhance Androvideo's system include Alerting staff of VIPs to allow for customized service and improved visitor experience A blacklist warning system that alerts staff when banned individuals are trying to enter the building Customizable privacy settings that can be adjusted based on the privacy needs of each community. AndroVideo is an A.I. camera company with an integration of software and hardware and strives to develop simple yet effective products. We integrate high-end operation ability SoC with the high-definition lens in hardware and take advantages of SoC and develop artificial intelligence in software. Our products are applicable to buildings, hotels, bus stations, metro stations, offices, schools, factories, banks, homes, etc."
  ]
}