{
  "company": "apiarys.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 3
    }
  },
  "sample_docs": [
    "ACCESS CONTROL SYSTEM TO FIT ANY SIZE AND ANY BUDGET User Friendly - Hardware and Software are in English (also Spanish, French, German and 10 more languages) no special codes or marking used to confuse installers and users. Simplified - Basic Software already include Time & Attendance, Swipe-Pay, Graphic Mapping Display, E-Mail Alert System , Anti-Pass-Back, Remote Access, MS SQL Support, E-Mail Upgradeable Expandable - Start with the right system now and grow as you go. Unlimited Doors, Cameras, Alarm Zones, Sites and other capabilities such as Card Printer, Parking and more. ONE system fit ALL - the same software is used for single door system and thousands of doors global installation , grow as much as needed when needed without costly equipment and software replacements. Generic Approach - Hardware build to work with most existing equipment in the market, including competitors. ANY Electric Lock (up to 3A) and any Weigand Reader (24 BIT and UP) are supported. No need to be bound by proprietary equipment. Longevity - Microsoft based system up-to-date with latest versions of Windows, SQL and MS Servers. FREE upgrades to latest version whenever needed. Hardware backward supported for more than 10 years. Security - Client-Server based system can be protected with all traditional security measures existing in the market. Customer has control of their own security. All controllers are using proprietary protocol to ensure security. Latest Technology - Most Card Technologies available including Private-Key-Encrypted system providing unique encryption for every site. Fingerprint Readers using the latest Fake Finger Detection technology. Face Recognition Reader equipped for Day-Night environment with less than 3 sec. response time.",
    "Internet Security for Parents - a review of threats, technologies and tools to keep the kids protected. This 4 hours program include discussion on today's internet treats and applications followed by demonstration of Parental Control tools and other measures to observe your child activities on-line. Home Security - how to design simple and effective security system and measures for home. Making sense of what you need and not what the sales guy offered. Computer Safety and Identity Theft - 4 hours session cover tools and measures of Computer Crime and Identity Theft methods used by criminals. Preventive Measures and Monitoring Tools Personal Security - how to be safe outside of home, in town, out of town, during travel and abroad. This training has several versions: Children, Adults, Students, Senior Citizens, Corporate Employees. Weapon Safety - having a gun should not be so complicated. The sensible approach in to civilian carrying a weapon (not the NRA and not the Survivalist technics). How to handle, how to carry, what about the kids? and more. This training DO NOT include the use of a weapon and is recommended for who ever have or considering purchasing a gun. (NOT recognized by any state as requirement for licensing) Employees Security Awareness - this is an adaptive training program geared to educate employees in the simple security awareness needed at workplace. From computer security to IP and prevention of personal belongings theft. Each training is customized to the specific need of the company. Access Control for Locksmiths - simplified approach to Access Control specifically geared for Locksmiths with limited or no experience with Computers and Electricity. This 2 days training cover all you need for successful design and installation of small access control system. Access Control Boot-Camp - Concentrated 3 days program with Hands-On experience covering all you need to know to successfully design and install access control system including Biometric Technology. This course is recognized by ALOA for CE credits and is offered by ALOA in their training facility using our instructors. Access Control Certification - 2 days training with certification from KEYKING including a fully functional Demo System in a suitcase of 2 doors system. Similar to the Access Control Boot-Camp for trainees with some experience in Access Control. Integrated System Certification - 5 days training with certification from KEYKING including fully functional Demo System in a suitcase of 2 doors and 2 cameras system. This course cover all aspects of Access Control, Advances Features (Anti-Pass-Back, Multi-Factor ID and more), Multi-Site and Remote Access, CCTV Integration, Biometrics, Alarm Integration, Parking, Charge-By-Swipe and many more functions.",
    "Internet Security for Parents - a review of threats, technologies and tools to keep the kids protected. This 4 hours program include discussion on today's internet treats and applications followed by demonstration of Parental Control tools and other measures to observe your child activities on-line. Home Security - how to design simple and effective security system and measures for home. Making sense of what you need and not what the sales guy offered. Computer Safety and Identity Theft - 4 hours session cover tools and measures of Computer Crime and Identity Theft methods used by criminals. Preventive Measures and Monitoring Tools Personal Security - how to be safe outside of home, in town, out of town, during travel and abroad. This training has several versions: Children, Adults, Students, Senior Citizens, Corporate Employees. Weapon Safety - having a gun should not be so complicated. The sensible approach in to civilian carrying a weapon (not the NRA and not the Survivalist technics). How to handle, how to carry, what about the kids? and more. This training DO NOT include the use of a weapon and is recommended for who ever have or considering purchasing a gun. (NOT recognized by any state as requirement for licensing) Employees Security Awareness - this is an adaptive training program geared to educate employees in the simple security awareness needed at workplace. From computer security to IP and prevention of personal belongings theft. Each training is customized to the specific need of the company. Access Control for Locksmiths - simplified approach to Access Control specifically geared for Locksmiths with limited or no experience with Computers and Electricity. This 2 days training cover all you need for successful design and installation of small access control system. Access Control Boot-Camp - Concentrated 3 days program with Hands-On experience covering all you need to know to successfully design and install access control system including Biometric Technology. This course is recognized by ALOA for CE credits and is offered by ALOA in their training facility using our instructors. Access Control Certification - 2 days training with certification from KEYKING including a fully functional Demo System in a suitcase of 2 doors system. Similar to the Access Control Boot-Camp for trainees with some experience in Access Control. Integrated System Certification - 5 days training with certification from KEYKING including fully functional Demo System in a suitcase of 2 doors and 2 cameras system. This course cover all aspects of Access Control, Advances Features (Anti-Pass-Back, Multi-Factor ID and more), Multi-Site and Remote Access, CCTV Integration, Biometrics, Alarm Integration, Parking, Charge-By-Swipe and many more functions.",
    "APIARY - SECURITY TRAINING Internet Security for Parents - a review of threats, technologies and tools to keep the kids protected. This 4 hours program include discussion on todays internet treats and applications followed by demonstration of Parental Control tools and other measures to observe your child activities on-line. Home Security - how to design simple and effective security system and measures for home. Making sense of what you need and not what the sales guy offered. Computer Safety and Identity Theft - 4 hours session cover tools and measures of Computer Crime and Identity Theft methods used by criminals. Preventive Measures and Monitoring Tools Personal Security - how to be safe outside of home, in town, out of town, during travel and abroad. This training has several versions: Children, Adults, Students, Senior Citizens, Corporate Employees. Weapon Safety - having a gun should not be so complicated. The sensible approach in to civilian carrying a weapon (not the NRA and not the Survivalist technics). How to handle, how to carry, what about the kids? and more. This training DO NOT include the use of a weapon and is recommended for who ever have or considering purchasing a gun. (NOT recognized by any state as requirement for licensing) Employees Security Awareness - this is an adaptive training program geared to educate employees in the simple security awareness needed at workplace. From computer security to IP and prevention of personal belongings theft. Each training is customized to the specific need of the company. Access Control for Locksmiths - simplified approach to Access Control specifically geared for Locksmiths with limited or no experience with Computers and Electricity. This 2 days training cover all you need for successful design and installation of small access control system. Access Control Boot-Camp - Concentrated 3 days program with Hands-On experience covering all you need to know to successfully design and install access control system including Biometric Technology. This course is recognized by ALOA for CE credits and is offered by ALOA in their training facility using our instructors. Access Control Certification - 2 days training with certification from KEYKING including a fully functional Demo System in a suitcase of 2 doors system. Similar to the Access Control Boot-Camp for trainees with some experience in Access Control. Integrated System Certification - 5 days training with certification from KEYKING including fully functional Demo System in a suitcase of 2 doors and 2 cameras system. This course cover all aspects of Access Control, Advances Features (Anti-Pass-Back, Multi-Factor ID and more), Multi-Site and Remote Access, CCTV Integration, Biometrics, Alarm Integration, Parking, Charge-By-Swipe and many more functions.",
    "APIARY - SECURITY TRAINING ACCESS CONTROL SYSTEM TO FIT ANY SIZE AND ANY BUDGET User Friendly - Hardware and Software are in English (also Spanish, French, German and 10 more languages) no special codes or marking used to confuse installers and users. Simplified - Basic Software already include Time & Attendance, Swipe-Pay, Graphic Mapping Display, E-Mail Alert System , Anti-Pass-Back, Remote Access, MS SQL Support, E-Mail Upgradeable Expandable - Start with the right system now and grow as you go. Unlimited Doors, Cameras, Alarm Zones, Sites and other capabilities such as Card Printer, Parking and more. ONE system fit ALL - the same software is used for single door system and thousands of doors global installation , grow as much as needed when needed without costly equipment and software replacements. Generic Approach - Hardware build to work with most existing equipment in the market, including competitors. ANY Electric Lock (up to 3A) and any Weigand Reader (24 BIT and UP) are supported. No need to be bound by proprietary equipment. Longevity - Microsoft based system up-to-date with latest versions of Windows, SQL and MS Servers. FREE upgrades to latest version whenever needed. Hardware backward supported for more than 10 years. Security - Client-Server based system can be protected with all traditional security measures existing in the market. Customer has control of their own security. All controllers are using proprietary protocol to ensure security. Latest Technology - Most Card Technologies available including Private-Key-Encrypted system providing unique encryption for every site. Fingerprint Readers using the latest Fake Finger Detection technology. Face Recognition Reader equipped for Day-Night environment with less than 3 sec. response time."
  ]
}