{
  "company": "attaininsight.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5625,
    "framing_surveillance": 0.0625,
    "framing_market": 0.375,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "Attain Insight Solutions Inc. is an Ottawa-based organization that offers consulting services in Business Intelligence (BI), Enterprise Performance Management (EPM) and Data Warehousing for Government and private sector firms, who want to: increase their value to customers, stakeholders and partners obtain greater visibility into operations, finance and administration through the use of reporting, analysis, metrics, dashboards, business planning and forecasting, search, or geographical, information access solutions. Attain Insight focuses 100% of its business on BI, EPM and Data Warehousing with service options that include end-to-end management, augmentation, joint development and outsourcing. Most service providers do not have BI, EPM or Data Warehouse professionals on staff, offer only per diem rates, and provide little or no guarantee on services. Attain Insight specializes in fixed-price projects led by industry professionals with 15 or more years experience. BI/EPM and Data Warehouse vendor selection, evaluation and RFP preparation BI Migration/upgrade planning and implementation including Cognos PowerPlay and Cognos Impromptu Compliance services for global standards and best practice Business and technology roadmaps Design, development and implementation of robust or large scale BI/EPM and Data Warehouse solutions Migration/upgrade of complex Business Intelligence solutions BI/EPM and Data Warehouse solutions for IBM, SAP and Oracle applications Analysis solutions involving SAP/BW, MSAS, Essbase, IBM and Cognos Mixed planning, budgeting, forecasting and BI solutions Operational BI & EPM solutions with near real-time business or technical requirements Attain Insight Solutions Inc. 2-2026 Lanthier Dr., Suite 202, Ottawa, ON K4A-0N6 Canada Phone: +1 (613) 235-0200 Fax: +1 (888) 415-8001 2008 Selected by Cognos, an IBM Company, to provide advisory services to customers and partners",
    "Company Management Events Careers Solutions Access Control, Data Security and Audit Reporting Business Analytics Business Intelligence Performance Management Advanced Analytics Hosted Analytics Real Property Analytics Spatial Analytics, Location Intelligence (LI), Mapping IBM Solutions Showcase (Analytics, Security, Watson IoT, Financing) Products Attain Insight Security 4X for IBM Analytics IBM Cognos IBM Planning Analytics IBM i2 IBM SPSS IBM Watson Integeo: Map Intelligence (MI), Mapping, Integrated Esri & Spatial BI Motio: IBM Cognos Version Control, Administration, QoS Services Assessment Customized Training Data On-Demand / Web Service Metrics Data Warehouse and Data Quality Cognos Migration and Upgrade Strategy & Project Planning Subscriptions, Licensing & Support Renewals Technical Technology Partners TechData: BSP MetaManager Datawatch: Self-Service Data Preparation Integeo: Map Intelligence (MI), Mapping, Integrated Esri & Spatial BI Motio: IBM Cognos Version Control, Administration, QoS Pitney Bowes: CRM, Data Quality & Enrichment, Location Intelligence StrategyBlocks: Strategy Planning & Execution Becoming a Partner Training Course Delivery IBM Cognos Analytics IBM Planning Analytics IBM SPSS IBM WebSphere IBM Data Warehouse Security 4X Report Abuse | Powered By Google Sites",
    "+1 833 235 0200 info@attaininsight.com Linkedin Facebook-f Twitter Youtube Subscribe +1 833 235 0200 Innovative solutions that unlock the value of your data Attain Insight is a leader in delivering identity resolution, biometric search, analytics, data security and location intelligence solutions. Our products help clients make smarter, data-driven decisions while meeting compliance requirements. Find Out More Innovative solutions that unlock the value of your data Attain Insight is a leader in delivering identity resolution, biometric search, analytics, data security and location intelligence solutions. Our products help clients make smarter, data-driven decisions while meeting compliance requirements. Business Analytics Complement your team with our deep expertise and wide range of Business Analytics services Security & Compliance Get robust control and security over your directory services and applications to reduce risk and streamline business operations Location Intelligence Discover deeper insights into your data by adding geospatial analytics to your business intelligence Identity & Biometrics Uncover hidden relationships within your data and protect privacy through high-fidelity biometric anonymization Complement your team with our deep expertise and wide range of Business Analytics services Get robust control and security over your directory services and applications to reduce risk and streamline business operations Discover deeper insights into your data by adding geospatial analytics to your business intelligence Uncover hidden relationships within your data and protect privacy through high-fidelity biometric anonymization Attain Insight Intrinsic™ is a unique identity solution that transforms how organizations uncover and understand relationships between entities in their data. By seamlessly integrating biometric and non-biometric data, Intrinsic provides a comprehensive approach to revealing hidden connections, threats, and opportunities within or outside an organization. Intrinsic's platform of modular components also offers innovative high-fidelity technology that anonymizes user-identifying information including biometrics, preserving match accuracy while mitigating privacy concerns, regulatory risks, and associated costs. Find Out More Attain Insight Intrinsic™ is a unique identity solution that transforms how organizations uncover and understand relationships between entities in their data. By seamlessly integrating biometric and non-biometric data, Intrinsic provides a comprehensive approach to revealing hidden connections, threats, and opportunities within or outside an organization. Intrinsic's platform of modular components also offers innovative high-fidelity technology that anonymizes user-identifying information including biometrics, preserving match accuracy while mitigating privacy concerns, regulatory risks, and associated costs. Attain Insight Security 4X ® is an enterprise centralized security administration, access control and compliance management technology that allows you to manage complex security requirements and reduce your risk. Security 4X connects to all the major security authentication platforms including Apache LDAP, Google Identity Services, HCL Domino Directory, NetIQ eDirectory, Microsoft Active Directory and Okta. Security 4X streamlines operations by 90%, aids in planning and executing mass security changes, and provides a provable audit from day one. Find Out More Attain Insight Security 4X ® is an enterprise centralized security administration, access control and compliance management technology that allows you to manage complex security requirements and reduce your risk. Security 4X connects to all the major security authentication platforms including Apache LDAP, Google Identity Services, HCL Domino Directory, NetIQ eDirectory, Microsoft Active Directory and Okta. Security 4X streamlines operations by 90%, aids in planning and executing mass security changes, and provides a provable audit from day one. Attain Insight Map Intelligence TM is a location intelligence platform, plug and play with leading business analytic solutions, like IBM Cognos Analytics TM and SAP BusinessObjects and GIS platforms such as Esri ® ArcGIS to help uncover hidden insights in your data. Map Intelligence integrates both geospatial data and business intelligence data, with no programming required. Find Out More Attain Insight Map Intelligence TM is a location intelligence platform, plug and play with leading business analytic solutions, like IBM Cognos Analytics TM and SAP BusinessObjects and GIS platforms such as Esri ® ArcGIS to help uncover hidden insights in your data. Map Intelligence integrates both geospatial data and business intelligence data, with no programming required. What Attain Insight customers have to say \"You guys really know your stuff and have been there for us every step of the way.\" Alterna Savings Bank (Canadian Bank and Credit Union) \"Security 4X is an amazing product, it's saved us -- not once, but twice! From what could have been a very costly software audit - to the fastest data warehouse move! \" Integra Life Sciences (Global Medical Device Company) \"Attain Insight always delivers the right solution at the right time. We have no question about which IBM Cognos vendor we want to do business with. \" Public Safety Canada (Responsible for National Security and the Safety of Canadians) \"Security 4X has really accelerated the process of building security policies. It has also simplified a lot of local administration, allowing our 15 Cognos Admins to concentrate on critical priorities. \" Veolia Water (A French, Transnational Environmental Company) What Attain Insight customers have to say BLOG Bring Your Map Manager Maps into IBM Cognos Analytics 12+ Read More » Enhancing Border Security with Relationship Intelligence and Facial Recognition Read More » Strengthening License Compliance: Attain Insight Partners with Costif.ai Read More » Bring Your Map Manager Maps into IBM Cognos Analytics 12+ Read More » Bring Your Map Manager Maps into IBM Cognos Analytics 12+ Enhancing Border Security with Relationship Intelligence and Facial Recognition Read More » Enhancing Border Security with Relationship Intelligence and Facial Recognition Strengthening License Compliance: Attain Insight Partners with Costif.ai Read More » Strengthening License Compliance: Attain Insight Partners with Costif.ai Biometric Search, Analytics, Security, Location Intelligence. ATTAIN INSIGHT +1 833-235-0200 info@attaininsight.com Join Our EMAIL List Get updates on products, industry news, best practices, and events. EXPLORE Biometric Search, Analytics, Security, Location Intelligence. Join Our EMAIL List Get updates on products, industry news, best practices, and events. Attain Insight Linkedin Facebook Twitter Youtube Attain Insight"
  ]
}