{
  "company": "augentic.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 7,
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 4
    }
  },
  "sample_docs": [
    "Driven by technology Humans, unlike all other creatures, possess the modality of the future. This vision of the future is the cornerstone of building relationships based on trust. But there are two main elements on which these relationships rest – security and freedom. Surely, security only makes sense when it is at the service of human freedom. About us Our products & services Identity Solutions Only a perfect synchronization between government´s desire for the highest security solution and citizen´s expectation for user-friendliness of the government services can lead to an efficient government and society. My identity makes my life easier! Read more Digital Currency Central bank money being directly issued by the central banks, is a liquid and safe reference settlement asset. Currently in the world, the central banks deal with fiat currency in the form of banknotes and coins in one side and other deposits of the commercial banks made in their accounts they have in the central bank on the other side. Read more Biometric Technologies Biometrics is one of the main buzz words in today's environment. It is because of that there are so many different definitions around the globe use when it comes to biometrics – we from AUGENTIC define biometrics as support methods to genuinely identify people! Read more Latest News AUGENTIC Announces CFO Transition MUNICH, Germany – May 2025 – AUGENTIC, a global leader in Identity Management, Biometrics, and Border Control Solutions Read more AUGENTIC Appoints Igor Baraz as Chief Operating Officer AUGENTIC, a leading international provider of solutions for identity management and biometrics, is proud to announce Mr.Igor Baraz as new Chief Operating Officer (COO). Read more AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure Read more AUGENTIC Announces CFO Transition MUNICH, Germany – May 2025 – AUGENTIC, a global leader in Identity Management, Biometrics, and Border Control Solutions Read more AUGENTIC Appoints Igor Baraz as Chief Operating Officer AUGENTIC, a leading international provider of solutions for identity management and biometrics, is proud to announce Mr.Igor Baraz as new Chief Operating Officer (COO). Read more AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure Read more Be AUGENTIC Join our team SEND YOUR APPLICATION Humans, unlike all other creatures, possess the modality of the future. This vision of the future is the cornerstone of building relationships based on trust. But there are two main elements on which these relationships rest – security and freedom. Surely, security only makes sense when it is at the service of human freedom. Our products & services Only a perfect synchronization between government´s desire for the highest security solution and citizen´s expectation for user-friendliness of the government services can lead to an efficient government and society. My identity makes my life easier! Central bank money being directly issued by the central banks, is a liquid and safe reference settlement asset. Currently in the world, the central banks deal with fiat currency in the form of banknotes and coins in one side and other deposits of the commercial banks made in their accounts they have in the central bank on the other side. Biometrics is one of the main buzz words in today's environment. It is because of that there are so many different definitions around the globe use when it comes to biometrics – we from AUGENTIC define biometrics as support methods to genuinely identify people! AUGENTIC Announces CFO Transition MUNICH, Germany – May 2025 – AUGENTIC, a global leader in Identity Management, Biometrics, and Border Control Solutions AUGENTIC Appoints Igor Baraz as Chief Operating Officer AUGENTIC, a leading international provider of solutions for identity management and biometrics, is proud to announce Mr.Igor Baraz as new Chief Operating Officer (COO). AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure AUGENTIC Announces CFO Transition MUNICH, Germany – May 2025 – AUGENTIC, a global leader in Identity Management, Biometrics, and Border Control Solutions AUGENTIC Appoints Igor Baraz as Chief Operating Officer AUGENTIC, a leading international provider of solutions for identity management and biometrics, is proud to announce Mr.Igor Baraz as new Chief Operating Officer (COO). AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure AUGENTIC Signs Contract with Cameroon for Modernization of National ID System and Infrastructure",
    "Production Starts for Cameroon's New Generation of Biometric Passports Munich, Yaoundé July 1, 2021 – Today the Republic of Cameroon's General Delegation for National Security (GDSN) and AUGENTIC unveiled the country's new generation of biometric passports infrastructure. The modernized system, which was implemented in record time is setting ground for a reliable and state-of-the art passport system. Moving forward, the modernized passport system will provide significant benefits for both Cameroon's citizens and government. As part of the project's Build phase, a new national passport production center with more than 3,000 square meters is operating as of today in Yaoundé. AUGENTIC is also responsible for the construction of an 800 plus square meter building in Douala and a 600 plus square meter building in Garoua. In addition, enrollment infrastructure in all offices and diplomatic missions was upgraded and equipped by the latest technologies. In the new issuance process, Cameroonian citizens are able to pre-enroll for a new passport online through the PassCam Portal provided by AUGENTIC PassCam and INCM. The enrollment process will then be completed at the selected enrollment center with an in-person appointment, where biometric data including facial scans, fingerprints, and digital signatures will be collected. Within 48 hours after completing successfully the enrolment process, passport will be produced. The new application process has a queue-management system, providing citizens with reduced waiting times and an easy-to-use online portal. To facilitate the passport issuance process, a state-of-the-art IT infrastructure was set-up and an online cashless payment system for passport fees was implemented. The cashless system benefits both citizens and the government, as it creates transparency and financial inclusion. The new national passport production center is equipped to serve all the needs for Cameroon citizens in the next ten years with a guaranteed permanent stock of blank passports. The modernized biometric passports offer the highest level of security and provide Cameroonians with increased freedom to travel exceeding the requirements set by the International Civil Aviation Organization (ICAO). The passport launch is part of a 10-year Build, Operate, and Transfer (BOT) contract between Cameroon's GDSN and AUGENTIC, a recognized leader in digital identity solutions with Imprensa Nacional-Casa da Moeda (INCM), the State Printer of Portugal as partner. \"Today marks a significant step forward in the modernization of Cameroon's passport system,\" said AUGENTIC'S CEO Mr. Labinot Carreti. \"The project scope and depth was a challenge in and of itself especially due to global pandemic situation and supply chain difficulties. I am happy that thanks to the commitment of the dedicated teams and our strong partnership with INCM the start of operation phase was made possible today.\" Production Starts for Cameroon's New Generation of Biometric Passports Munich, Yaoundé July 1, 2021 – Today the Republic of Cameroon's General Delegation for National Security (GDSN) and AUGENTIC unveiled the country's new generation of biometric passports infrastructure. The modernized system, which was implemented in record time is setting ground for a reliable and state-of-the art passport system. Moving forward, the modernized passport system will provide significant benefits for both Cameroon's citizens and government. As part of the project's Build phase, a new national passport production center with more than 3,000 square meters is operating as of today in Yaoundé. AUGENTIC is also responsible for the construction of an 800 plus square meter building in Douala and a 600 plus square meter building in Garoua. In addition, enrollment infrastructure in all offices and diplomatic missions was upgraded and equipped by the latest technologies. In the new issuance process, Cameroonian citizens are able to pre-enroll for a new passport online through the PassCam Portal provided by AUGENTIC PassCam and INCM. The enrollment process will then be completed at the selected enrollment center with an in-person appointment, where biometric data including facial scans, fingerprints, and digital signatures will be collected. Within 48 hours after completing successfully the enrolment process, passport will be produced. The new application process has a queue-management system, providing citizens with reduced waiting times and an easy-to-use online portal. To facilitate the passport issuance process, a state-of-the-art IT infrastructure was set-up and an online cashless payment system for passport fees was implemented. The cashless system benefits both citizens and the government, as it creates transparency and financial inclusion. The new national passport production center is equipped to serve all the needs for Cameroon citizens in the next ten years with a guaranteed permanent stock of blank passports. The modernized biometric passports offer the highest level of security and provide Cameroonians with increased freedom to travel exceeding the requirements set by the International Civil Aviation Organization (ICAO). The passport launch is part of a 10-year Build, Operate, and Transfer (BOT) contract between Cameroon's GDSN and AUGENTIC, a recognized leader in digital identity solutions with Imprensa Nacional-Casa da Moeda (INCM), the State Printer of Portugal as partner. \"Today marks a significant step forward in the modernization of Cameroon's passport system,\" said AUGENTIC'S CEO Mr. Labinot Carreti. \"The project scope and depth was a challenge in and of itself especially due to global pandemic situation and supply chain difficulties. I am happy that thanks to the commitment of the dedicated teams and our strong partnership with INCM the start of operation phase was made possible today.\"",
    "AUGENTIC GmbH and Orell Füssli Ltd. Security Printing present a \"Smart Banknote CBDC\" Solution Central Banks feel a mounting pressure to explore and find a suitable solution for the Bank to issue Central Bank Digital Currency (CBDC). AUGENTIC GmbH and Orell Füssli Ltd. Security Printing are proud to present a \"Smart Banknote CBDC\" solution. This solution combines Orell Füssli's highly secure banknotes with AUGENTIC CBDC Platform including trustwise.io Distributed Ledger Technology (DLT). Future-proof CBDC solutions must be customizable for government use as well as address off-line availability, anonymity, and psychological factors during the migration from physical to digital cash. The \"Smart Banknote CBDC\" is a solution that covers all of these aspects. Smart Banknotes can be exchanged like traditional banknotes. Additionally, they can be converted into digital cash at any given time. This happens by using encrypted, anti-copied 2D barcodes for authentication purposes via smartphone. All processes are secured by DLT — private, permissioned — in combination with smart contracts. In all cases within the jurisdiction of the Central Bank, lower transaction costs and a higher degree of privacy is offered. Governments and economies profit from a Central Bank backed currency and thus reducing their credit risks. AUGENTIC GmbH and Orell Füssli Ltd. Security Printing present a \"Smart Banknote CBDC\" Solution Central Banks feel a mounting pressure to explore and find a suitable solution for the Bank to issue Central Bank Digital Currency (CBDC). AUGENTIC GmbH and Orell Füssli Ltd. Security Printing are proud to present a \"Smart Banknote CBDC\" solution. This solution combines Orell Füssli's highly secure banknotes with AUGENTIC CBDC Platform including trustwise.io Distributed Ledger Technology (DLT). Future-proof CBDC solutions must be customizable for government use as well as address off-line availability, anonymity, and psychological factors during the migration from physical to digital cash. The \"Smart Banknote CBDC\" is a solution that covers all of these aspects. Smart Banknotes can be exchanged like traditional banknotes. Additionally, they can be converted into digital cash at any given time. This happens by using encrypted, anti-copied 2D barcodes for authentication purposes via smartphone. All processes are secured by DLT — private, permissioned — in combination with smart contracts. In all cases within the jurisdiction of the Central Bank, lower transaction costs and a higher degree of privacy is offered. Governments and economies profit from a Central Bank backed currency and thus reducing their credit risks.",
    "AUGENTIC appoints Labinot Carreti as Chief Executive Officer Munich, 01.04.2020 AUGENTIC, a leading international provider of solutions for identity management, digital currencies and biometrics, is proud to announce Mr. Labinot Carreti as new Shareholder and CEO. Labinot Carreti has more than 15 years of experience in the government related industries. Most recently, as Senior Vice President Global Sales at Veridos GmbH (Joint Venture of Giesecke + Devrient and Bundesdruckerei) was in charge of a global sales team with exceptional performance. Before joining Giesecke + Devrient Group in 2012, Labinot Carreti was involved more than 10 years in consulting governments globally through initiatives of the European Union, the World Bank and the Council of Europe. \"In my past professional experience working with Labinot, together we managed to achieve outstanding results in the government business. Our success is visible and with our network around the globe we will establish ourselves as a respectable player in the identity industry. We are very happy to benefit from Labinot´s vision and passion for technology to make AUGENTIC the leader in the management of digitalization of Governments around the world\", says Dr. Hermann Sterzinger, Chairman of the Advisory Board at AUGENTIC. With his outstanding personality as a leader and motivator, Mr. Carreti, will put together a global organization and partnership network ensuring continuous and profitable growth for AUGENTIC. AUGENTIC appoints Labinot Carreti as Chief Executive Officer AUGENTIC, a leading international provider of solutions for identity management, digital currencies and biometrics, is proud to announce Mr. Labinot Carreti as new Shareholder and CEO. Labinot Carreti has more than 15 years of experience in the government related industries. Most recently, as Senior Vice President Global Sales at Veridos GmbH (Joint Venture of Giesecke + Devrient and Bundesdruckerei) was in charge of a global sales team with exceptional performance. Before joining Giesecke + Devrient Group in 2012, Labinot Carreti was involved more than 10 years in consulting governments globally through initiatives of the European Union, the World Bank and the Council of Europe. \"In my past professional experience working with Labinot, together we managed to achieve outstanding results in the government business. Our success is visible and with our network around the globe we will establish ourselves as a respectable player in the identity industry. We are very happy to benefit from Labinot´s vision and passion for technology to make AUGENTIC the leader in the management of digitalization of Governments around the world\", says Dr. Hermann Sterzinger, Chairman of the Advisory Board at AUGENTIC. With his outstanding personality as a leader and motivator, Mr. Carreti, will put together a global organization and partnership network ensuring continuous and profitable growth for AUGENTIC.",
    "AUGENTIC completes Digital Currency & Digital Payment solution portfolio Munich, 16.04.2020 AUGENTIC completes Digital Currency and Digital Payment solution portfolio through strategic partnership with DISTRIBUTED LAB AUGENTIC, a leading international provider of solutions for identity management, digital currencies and biometrics and DISTRIBUTED LAB, a leading provider of state-of-the-art digital assets solutions, announced today their partnership on consulting, security solutions and services for central banks. The first result of the cooperation is visible — an open eco system for Central Bank Digital Currency (CBDC). The integration of the first evaluations and proof of concept projects will be implemented with selected Central Banks in the coming months. The flexible CBDC solution is based on a digital identity platform from AUGENTIC and distributed ledger technology (DLT) solution from DISTRIBUTED LAB. \"AUGENTIC is positioning itself as a long-term specialized partner in transformation and digitalization management for governments and society. We are taking the role to handle the high complexity of digitalization projects together with our partners.\" Labinot Carreti, CEO of AUGENTIC, and continues: \"We look forward to start working together with the highly motivated team of DISTRIBUTED LAB. The jointly developed CBDC and digital payment solutions will bring great benefits to governments. In of the exclusive cooperation with DISTRIBUTED LAB we are able to react in a focused, adaptable, secure and technological way to the emerging challenges of transformation in the digital payment and ID industry.» Pavel Kravchenko, Founder of DISTRBUTED LAB, adds: \"Distributed Ledger Technology (DLT) is more than Blockchain. Our mission is to build the Financial Internet — when every accounting system in the world is able to transact with each other freely. We are proud to work with AUGENTIC and are convinced that this new relationship will successfully open doors of our combined technologies in the governmental sector\" Both partners are certain that this joint offering brings real additional value to customers and are looking forward being an integral part of the digital future of currency. AUGENTIC completes Digital Currency & Digital Payment solution portfolio AUGENTIC completes Digital Currency and Digital Payment solution portfolio through strategic partnership with DISTRIBUTED LAB AUGENTIC, a leading international provider of solutions for identity management, digital currencies and biometrics and DISTRIBUTED LAB, a leading provider of state-of-the-art digital assets solutions, announced today their partnership on consulting, security solutions and services for central banks. The first result of the cooperation is visible — an open eco system for Central Bank Digital Currency (CBDC). The integration of the first evaluations and proof of concept projects will be implemented with selected Central Banks in the coming months. The flexible CBDC solution is based on a digital identity platform from AUGENTIC and distributed ledger technology (DLT) solution from DISTRIBUTED LAB. \"AUGENTIC is positioning itself as a long-term specialized partner in transformation and digitalization management for governments and society. We are taking the role to handle the high complexity of digitalization projects together with our partners.\" Labinot Carreti, CEO of AUGENTIC, and continues: \"We look forward to start working together with the highly motivated team of DISTRIBUTED LAB. The jointly developed CBDC and digital payment solutions will bring great benefits to governments. In of the exclusive cooperation with DISTRIBUTED LAB we are able to react in a focused, adaptable, secure and technological way to the emerging challenges of transformation in the digital payment and ID industry.» Pavel Kravchenko, Founder of DISTRBUTED LAB, adds: \"Distributed Ledger Technology (DLT) is more than Blockchain. Our mission is to build the Financial Internet — when every accounting system in the world is able to transact with each other freely. We are proud to work with AUGENTIC and are convinced that this new relationship will successfully open doors of our combined technologies in the governmental sector\" Both partners are certain that this joint offering brings real additional value to customers and are looking forward being an integral part of the digital future of currency."
  ]
}