{
  "company": "bi2technologies.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 2,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 2
    }
  },
  "sample_docs": [
    "Public Safety Solution: IRIS ™ & SORIS ™ Community Service Solution: The CHILD Project ™ Senior Safety Net ™ Sea I.D. ™, Iscientia ™ Welcome to BI 2 Technologies BI 2 Technologies™ is a privately held Massachusetts corporation that develops, sells, designs, implements, integrates and supports biometric technologies. The Company is located in Plymouth, Massachusetts. BI 2 Technologies™ offers a suite of biometric identification and recognition technologies and services that are used by numerous law enforcement, social service and educational agencies across the nation. Currently, these systems are used to locate missing children and senior citizens, identify students, and provide access control. The systems are also used for multiple applications in law enforcement, ranging from inmate intake and booking to release tracking. These systems include the Children's Identification & Location Database (CHILD) Project™, Senior Safety Net™ and the Inmate Identification and Recognition System (IRIS)™. To about these systems, please click on the corresponding link above.",
    "Media CASE STUDIES NEWS FAQ VIDEOS Biometric Identification BI² Technologies™ - Biometric Intelligence and Identification Technologies - is a worldwide leader in the development and implementation of the innovative and affordable iris, fingerprint and facial biometric identification and recognition technologies and solutions. Contact Us for ACCESS™ A public background check service provided by Sheriffs. The system comes with no upfront costs to the office or the county. This system will enable Sheriffs to provide this much needed service to the citizens of their counties at a more convenient and safer location – the Sheriff's Office. Contact Us Why I.R.I.S.™? It is non-invasive biometric technology that identifies offenders with 12 times more accuracy that fingerprints, giving detention and correction officers real-time information on offenders in 8 seconds or less. Contact Us BI² Technologies™ - Biometric Intelligence and Identification Technologies - is a worldwide leader in the development and implementation of the innovative and affordable iris, fingerprint and facial biometric identification and recognition technologies and solutions. for ACCESS™ A public background check service provided by Sheriffs. The system comes with no upfront costs to the office or the county. This system will enable Sheriffs to provide this much needed service to the citizens of their counties at a more convenient and safer location – the Sheriff's Office. It is non-invasive biometric technology that identifies offenders with 12 times more accuracy that fingerprints, giving detention and correction officers real-time information on offenders in 8 seconds or less. Identifying offenders and inmates by the unique characteristics of their iris. 12 times more accurate than traditional fingerprints. Identifies suspects and inmates who try to hide their identity. The only national, web-based iris biometric network. The National Sheriffs' Association (NSA), through an innovative partnership with BI² Technologies, is implementing a new program to help Sheriffs across the nation generate funding to address the most critical problems in their counties. ACCESS™ as a background check system that comes with no upfront costs to the Sheriff's Office or county. This system will enable Sheriffs to provide this much-needed service to the citizens of their counties at a more convenient and safer location – the Sheriff's Office. A new public background check service that generates revenue for Sheriff's Offices. It comes as no cost to the office or the county. The Inmate Identification and Recognition System (I.R.I.S.™) positively identify inmates using the most mathematically unique biometric – the iris. The CHILD Project™ is a secure nationwide network and registry, which enables law enforcement and social service agencies throughout the country to positively identify children through iris biometric recognition technology. Senior Safety Net is similar to The Child Project. This secure nationwide network and registry enables law enforcement and social service agencies to identify enrolled seniors who may be lost due to Alzheimer's Disease or dementia. Our web-based IMATS™ system is a configurable multi-facility system, which would allow one central system to support inmate movement and other operations across multiple detention facilities for the agency. MORIS™ is a mobile system that brings arrest history results to law enforcement on patrol within seconds. Generate Revenue for Sheriff's with ACCESS™ Background Checks BI² Technologies will provide Sheriffs with all the tools needed to perform background checks for the residents of their communities at no cost to your Office or the County. Receive 25 – 30 % of the net revenue from every background check. Sheriff's Office and Correctional Facilities BI² Technologies developed a national database – using iris biometric technology to help detention and corrections officers positively identify offenders and ensuring no one gets released by mistake. Child and Senior Safety The Company's Child Project™ technology provides the public with a first-of-its-kind national repository of biometric identification data on missing children and adults. The targeted demographic in this group includes seniors, especially those who have Alzheimer's, as well as adolescent children in youth services such as foster care. Great Partnership and Powerful Technology \"Our partnership with BI² Technologies has been fantastic. Their innovative technology is such a valuable weapon in my office. Criminals often try to change their identities to avoid accurate identification and prosecution for crimes they have committed. This cutting-edge iris biometric technology is necessary to keep our community safe.\" \"I'm proud to be the first sheriff's office in Idaho to implement this innovative technology into our jail operations. This cutting-edge iris recognition software is another tool in our arsenal to help protect our citizens. I don't know how any jail can operate without it. For Business inquiries, please fill out our feedback form or give us call at our Toll-Free Number 1-800-479-1621 , our team help you within 24 hours. Why you should working with us? BI² Technologies is a forward-thinking company that is always looking at innovative ways to help Sheriffs and law enforcement to protect their community. We work with the National Sheriff's Association, Western States Sheriffs' Association and Southwest Border Sheriffs' Coalition to ensure the systems and technology we create are in the best interests of your office. 12+ years of experience in making your facility and community safer. BI² Technologies is committed to creating elite technology that will transform security for jails and prisons across the nation. CRANSTON, R.I. -- Rhode Island's Department of Corrections on Friday showed off its new cutting-edge iris scanning technology. The… The Richland County Sheriff's Office is now the first in the state to implement \"biometric iris technology\" to identify… CALDWELL — Joining more than 250 law enforcement agencies nationwide, the Canyon County Sheriff's Office has become the first… INDIANAPOLIS, Ind.-- For years, the Marion County Jail was plagued by the inadvertent releases and misidentification of offenders, a… JEFFERSON COUNTY, AL (WBRC) - Did you know your eye, specifically the iris, is one the of the best… OLMITO — As if on cue, an incoming call interrupted Omar Lucio midsentence as the sheriff of Cameron County… Criminals and illegal immigrants who get booked into jail along the southwest border will soon have one less way… Copyrights by BI² Technologies",
    "Biometric Intelligence and Identification Technologies' (BI2 Technologies) business is based on its knowledge of biometric identification and intelligence technologies and its presence and reputation in the markets where the demand for these technologies have significantly increased. Biometrics are technologies that capture, store and automatically confirm the identity of people by comparing patterns of physical or behavioral characteristics in real time against enrolled computer records of those patterns. Leading biometric technologies accomplish this task by scanning patterns of the, fingerprint, iris, Deoxyribonucleic Acid (DNA), face, hand, palm, signature, skin, dental, or voice. Biometrics are far superior to other common means of confirming identity, such as tokens (something one possesses) or passwords (something one knows). Tokens (drivers' licenses, for example) and passwords (Social Security numbers, for example) cannot ensure positive identification of a person. Tokens are routinely counterfeited and stolen. Passwords are routinely forgotten, left in plain sight, and stolen. Unlike tokens or passwords, biometric identifiers are inextricably linked to persons themselves and therefore cannot be forgotten, counterfeited, or stolen. Biometrics help protect privacy by erecting a barrier between personal data and unauthorized access. Technically, biometric capture devices create electronic digital templates that are encrypted and stored and then compared to encrypted templates derived from \"live\" images in order to confirm the identity of a person. The templates are generated from complex and proprietary algorithms and are then encrypted using strong cryptographic algorithms to secure and protect them. Thus, standing alone, biometric templates cannot be reconstructed, decrypted, reverse-engineered, or otherwise manipulated to reveal a person's identity. In short, biometrics can be thought of as a very secure key: Unless a biometric gate is unlocked by using the right key, no one can gain access to a person's identity. The demand for biometric technologies has increased significantly following the events of 9/11. The principals of BI2 Technologies have been nationally recognized experts in the application of biometric technologies, particularly iris recognition and finger print technologies, for the public sector since 1995. Iris recognition biometric technology positively determines the identity of an individual by capturing a high-resolution digital photograph of the individual's iris. The unique features contained in the iris are compared against a database and the identity of the individual determined. The technology is non-intrusive - the individual does not need to touch anything to use the system. Automatic voice prompting, auto focus, plus enrollment and recognition speed make the system easy to use. An individual is detected automatically upon approaching the imager (a digital camera). A glance at the aperture mirror from 10-18\" distance allows the camera to capture an iris image, which is digitally processed into an iris template. No PINs, passwords, or cards are required. Iris recognition technology is strictly \"opt in.\" Subjects agree to enroll and participate, reducing privacy concerns. The user must consciously elect to participate in iris recognition for authentication by presenting their eye to the camera. They also must be within a designated capture zone, which is approximately 10-18 inches away from the camera. The technology cannot work without the explicit cooperation of the end-user. All a person needs to do is look into a camera for a few seconds. A video image is taken of their iris, which is non-invasive and inherently safe. Unlike other biometric technologies, iris recognition is inherently safe – there is nothing to touch (so no diseases can be transmitted from one person to another) and there are no lasers, strong lights or any kind of harmful beams. Iris recognition was proven to have the highest biometric accuracy, with no false matches in over two million cross-comparisons, according to Biometric Product Testing Final Report (19 March 2001, Center for Mathematics and Scientific Computing, National Physics Laboratory, U.K.) Iris recognition technology is being used worldwide in transportation, military, law enforcement, banking, and information technology industries to positively and quickly verify an individual's true identity. Copyright .",
    "Identification in the blink of an eye BI² Technologies™ - Biometric Intelligence and Identification Technologies - is a worldwide leader in the development and implementation of innovative, integrated and affordable SaaS based Iris, Jail Management, Community-Based Treatment, and Background Check technologies and solutions. Contact Us Identification in the blink of an eye BI² Technologies™ - Biometric Intelligence and Identification Technologies - is a worldwide leader in the development and implementation of innovative, integrated and affordable SaaS based Iris, Jail Management, Community-Based Treatment, and Background Check technologies and solutions. Identifying offenders and inmates by the unique characteristics of their iris. 12 times more accurate than traditional fingerprints. Identifies suspects and inmates who try to hide their identity. The only national, web-based iris biometric network. BI² Technologies, has implemented a new program to help Sheriffs across the nation generate funding to address the most critical problems in their counties. ACCESS™ is a background check system that comes with no upfront costs to the Sheriff's Office or county. This system will enable Sheriffs to provide this much-needed service to the citizens of their counties at a more convenient and safer location – the Sheriff's Office. BI2 Technologies has partnered with SingleCare® to create Sheriff Rx. Sheriff Rx provides employees and their families at Sheriffs' Offices across the nation with access to affordable prescription medications, ensuring greater health and financial stability. Trinity Corrections Care can help provide benefits to inmates and their dependents at no cost to your department. BI2 Technologies is pioneering the future of security with visual AI that provides near-human-like perception to help eliminate monitoring fatigue, false alarms, and reactive security management. Scientia CJI™ Reports, is a data analytics system that helps Sheriffs more effectively target limited resources based actionable intelligence and insight from your existing data. The Inmate Identification and Recognition System (I.R.I.S.™) positively identify offenders in seconds using the most mathematically unique biometric – the iris. Our cloud-based IMATS™ (SaaS) based Inmate Management and Tracking System (IMATS™) is a configurable and customizable complete solution to manage large and small correctional and detention facilities. CITA™ (Community is the Answer) is a comprehensive, information technology-based platform and infrastructure, developed by B12 Technologies in cooperation with community-based service partners, law enforcement, public safety, and the judiciary, to identify and better assist those offenders who need services, not incarceration. MORIS™ is a SaaS based mobile system that provides offender data to authorized staff in seconds from virtually anywhere. Med-Verify Plus™ is an integrated technology solution, designed to help Sheriffs effectively and efficiently detect and mitigate COVID-19 and other communicable diseases in jails and other secure confinement facilities. It improves the safety and health of staff, individuals in custody, visitors, and the public. BI2 Technologies can ensure your medical personnel are able to positively identify inmates prior to issuing medications or providing medical care with Med Verify™, a portable \"med cart\" ready addition to BI2 Technologies' IRIS™ (Inmate Recognition Identification System). More Than A Vendor Relationship \"To have not just a vendor relationship but a partner, and to create those relationships with BI2 Technologies that you can count on has really been a game changer for us. Part of my goal when I select companies to do business with us is understanding the support, and to have that level of service and to solve problems, because problems are going to occur, and to have someone in the foxhole with you, we're all better for it.\" Sheriff Pat Labat, Fulton County Georgia Great Partnership and Powerful Technology \"Our partnership with BI² Technologies has been fantastic. Their innovative technology is such a valuable weapon in my office. Criminals often try to change their identities to avoid accurate identification and prosecution for crimes they have committed. This cutting-edge iris biometric technology is necessary to keep our community safe.\" Great Service. Great Partner. \"What we really found beneficial to us is the support system by BI2. All of their representatives, whether they are on site or we are talking to them on the phone, it is an immediate response. When they came to us and said, 'this is what we can do, this is what our vision is for the future, for all Sheriffs gathering this data', the deliverables were immediate. As the database has grown, we are having more clarity as to who the bad actors are coming through our jail. We are matching the information and thankfully, are contributing to the same database, and that helps the Sheriffs not just in my jurisdiction or my state but throughout the country.\" 28+ years of experience in making your facility and community safer. BI² Technologies is committed to creating elite technology that will transform security for jails and prisons across the nation. BI2 Technologies is proud to host our cloud-based SaaS solutions on the Nlets NOVA platform. Nlets is the premier provider of secure information services that enable a totally standardized and integrated system, which allows for the secure exchange of law enforcement, criminal justice, and public safety-related information nationwide. Copyrights by BI² Technologies"
  ]
}