{
  "company": "bi.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 20,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.7395833333333334,
    "framing_surveillance": 0.1770833333333333,
    "framing_market": 0.0833333333333333,
    "num_docs": 21
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 20
    }
  },
  "sample_docs": [
    "Technology Supporting Community-based Corrections Patrick Hyde Many factors--from evaporating state surpluses, fixed if not shrinking criminal corrections budgets, the public's reluctance to fund more prison and jail construction, staffing, to jail and prison overcrowding, are leading community corrections officials to seek alternatives for managing our nation's offender population. For many, there has been a shift to community-based corrections that demands offender accountability, maintains public safety, and conserves resources and energy for the most hardened offenders. As a result, many agencies are turning to technology to help supervise probationers, parolees, even inmates released to the community. This technology includes new generations of electronic monitoring, remote alcohol testing equipment, biometric technology such as voice verification systems, and on a limited basis due to cost and lack of field testing, global positioning systems. \"Judges, prosecutors, operators of correctional facilities, and the community benefit from having a full range of sanction alternatives, including community-based supervision programs,\" said Stanley Kephart, recently retired chief probation officer for the Tulare County Probation Department in Visalia, Calif. Tulare County has more than 6,000 probationers in the community at one time. Several hundred are supervised through an electronic monitoring program that was formerly run by the county but recently privatized. \"This allowed us to manage these offenders on a 'tethered' system of frequent contact and save our beds for hard criminals,\" he said. For criminal corrections agencies such as the Tulare County Probation Department, technology that monitors the whereabouts of offenders also helps manage their compliance to court sanctions. The electronic monitoring equipment involves transmitters worn by the offenders, field monitoring devices installed in the home that are connected via phone lines to central computers that track an offender's presence or absence in an area. Many ancillary devices are available to support this supervision, including drug or alcohol testing devices and portable monitoring devices that allow probation or parole officers--from their car--to check whether a person wearing the transmitter is in a class or on a job site. Many corrections officials say technology helps them to shift attention to the high-risk offenders and reduce work caseloads, in turn leading to improved public safety. Others point to the importance of equipment reliability. For example, voice verification systems such as BI Incorporated's VoiceID can maintain multiple location checks on offenders throughout a day. This system supervises offenders through a series of daily telephone calls-- random, scheduled, inbound and outbound--to approved locations, such as an offender's residence or work. Enrolling offenders takes just a few minutes, says BI Product Manager Joanne Davis. \"We knew corrections officers in the field are pressed for time and that enrolling a client with a 'voiceprint' and entering approved phone numbers in the system should take only minutes.\" For many agencies, the use of technology allows officials to move non-violent, lower risk offenders to the community where they can receive treatment for addictions. In Pierce County, Wash., the sheriff's department turned to electronic monitoring to help alleviate an overcrowding problem that plagued the 1,275-bed county jail throughout the '90s. Rather than be mandated by the courts to release inmates prematurely and unsupervised because of the overcrowding, officials turned to electronic monitoring for appropriate candidates. \"About 60 to 70 inmates are supervised electronically in the community while another 120 probationers are monitored,\" said Jack Christofferson, program manager for a Day Reporting Center in Pierce County. In addition, all inmates in the community and about 60 percent of the probationers are also using a remote alcohol-testing device, called Sobrietor. \"Offenders are identified through a voiceprint, they then submit deep lung tests remotely via phone lines, ensuring compliance with sobriety orders,\" he said. Pierce County officials say many offenders ordered to report to the DRC found day reporting more demanding and unpleasant than incarceration. An intensive community program that combines surveillance, accountability, and intensive programming can be more demanding than incarceration. \"It's no picnic,\" said Officer Crystal Collins, who manages Pierce County Sheriff Department's EM program. \"They know from the outset that being with their families in the community is a privilege that will be revoked quickly for violations.\" Self-Pay Component In Pierce County as well as in many other jurisdictions, offenders are required to pay for a portion of their electronic supervision. Proponents say this is \"beer and cigarette money\" for offenders that helps reduce pressure on stretched budgets, goes toward reduced caseloads, allows for additional services for offenders, provides symbolic restitution, alleviates taxpayer burden, and adds a sense of responsibility for the offender. In Tulare County, offenders are assessed a sliding fee daily rate of twice their hourly wage to fund the electronic monitoring services. An offender making $6/hour would be assessed $12 daily. In Pierce County, offenders are assessed a flat rate of $12 daily for electronic monitoring alone and $15 daily for both electronic monitoring and remote alcohol testing. In both cases, assistance is available for indigent clients. Public Safety Number One Issue For all jurisdictions using technology to monitor and manage offenders in the community, public safety is critical. Most measure and manage public safety by: Matching offender supervision levels to their risk Tailoring support programs to their needs Quick reinforcement of positive or negative behavior The U.S. Department of Justice estimates one in five state prisoners leaves prison with no post-release supervision, a less than desirable situation for maintaining ongoing public safety. Many community correction officials suggest by managing offenders re-entry to society, we can help them succeed in their transition back into the community, resulting in a slow down in prison population growth, less overall taxpayer burden, and lower recidivism. To help manage offenders re-entering our communities, many have turned to available technology. \"Public safety involves more than simply incarcerating an individual. That would be for someone who has exhausted all intermediate sanctions and treatment,\" said one official. \"Technology helps us to monitor an individual's compliance to programs and treatment while they are in the community taking advantage of these programs.\" Resources: U.S. Department of Justice www.usdoj.gov Tulare County Probation Department Telephone: (559) 733-6207 Pierce County Day Reporting Center Telephone: (253) 272-0200 BI Incorporated www.bi.com Telephone: (303) 218-1000 American Probation and Parole Association www.appa-net.org Telephone: (859) 244-8203",
    "TECHNOLOGY & TREATMENT SOLUTIONS BI TotalAccess ® - A Consolidated User Interface BI TotalAccess is a consolidated software interface that enables BI technologies to be monitored on one host system. Existing BI customers using both the ExacuTrack and GuardWare software platforms will soon be able to monitor all clients using TotalAccess. TotalAccess is an excellent solution for busy supervising officers, juggling large caseloads and seeking efficiency at every turn. TotalAccess is a single, consolidated user interface for BI products such as GPS tracking, radio-frequency monitoring, and alcohol compliance monitoring. Users simply login in at www.bi.com with a distinct user name and secure password to access all program information for their agency. From there, officers can conveniently: Enroll and delete clients from the system View and process alerts View, enter, and modify data including zones, schedules, and client photos View, run, schedule, create, and download reports Enter procedures for responding to violations and customize violation notifications Pair events to minimize alert notifications TotalAccess is a powerful platform TotalAccess is a very powerful supervision tool that enables officers to simply and conveniently perform their routine functions such as enrolling clients or processing alerts, while also offering many enhanced features: Intuitive system navigation and banner display of client, officer, and agency information One touch alert notification allowing officers to close or delay alerts straight from an active hyperlink in an email Group zones, which allow an agency to assign a set of zones to some or all of their caseload without having to build them for each client Ability to view inventory data across more than one agency and easily transfer units between agencies Access to multiple agency numbers via one web login Ability to search by agency, officer, client or any combination of these entities Improved caseload-at-a glance homepage User-friendly report interface allowing officers to quickly access and customize reports Icons indicating client status and alert priority Officers can also use a PDA to access the TotalAccess software to view their caseload, view and close alerts, and send text messages or voice messages to an active GPS tracking unit. The PDA can use any of the following software with Internet access: about BI TotalAccess today or demo the system. Call us at 800.701.5171 or email solutions@bi.com for more information. Technology & Treatment Solutions GPS Tracking BI ExacuTrack One BI ExacuTrack AT BI ExacuTrack Radio Frequency BI HomeGuard 200 BI HomeCell BI GroupGuard BI GroupGuard Plus BI Drive-BI BI 9000 Series Voice Verification BI VoiceID BI Self Report Custom Electronic Monitoring Programs Copyright . • Legal Notice • Service & Warranty",
    "TECHNOLOGY & TREATMENT SOLUTIONS BI Self Report SM - Simplified Supervision BI Self Report, powered by AnyTrax TM , is a low-cost, proven case management tool ideal for relieving officer workload associated with administrative or \"banked\" caseloads, lower risk supervision caseloads, and pretrial caseloads. How Self Report works Using BI Self Report, clients call an automated system to verify their identity through biometric \"voice print\" authentication. Then, they easily report status changes, compliance with conditions of release, basic changes in employment or home address, attendance at treatment programs and more. If a client forgets to check in, Self Report makes reminder calls which can enhance client compliance. Supervising officers can maintain periodic contact with a large number of clients with little effort – saving time and resources. No equipment is required except a telephone. To enroll on Self Report, a client provides a voiceprint by responding to a series of prompts. This baseline voiceprint is then matched to the caller's voiceprint each time he or she calls into the system. A voiceprint is unique to each person, may be verified in seconds and is easy to obtain with a brief call from any telephone. Managing violations can be customized Violation alerts and daily summary reports are forwarded to officers using the methods that are convenient and appropriate to their work patterns and caseloads. Officers review and resolve client reporting exceptions via a secure, password-protected Web site. Technology & Treatment Solutions GPS Tracking BI ExacuTrack One BI ExacuTrack AT BI ExacuTrack Radio Frequency BI HomeGuard 200 BI HomeCell BI GroupGuard BI GroupGuard Plus BI Drive-BI BI 9000 Series Voice Verification BI VoiceID BI Self Report Custom Electronic Monitoring Programs Copyright . • Legal Notice • Service & Warranty",
    "TECHNOLOGY & TREATMENT SOLUTIONS BI Sobrietor ® - Remote Alcohol Monitoring BI Sobrietor uses sophisticated voice and alcohol detection technology to verify offenders released to community supervision are abstaining from alcohol use. This low-cost alternative supports supervising officers to ensure sobriety. Sobrietor is a handheld device that detects the presence of alcohol through a deep lung breath sample. The results are transmitted remotely through a telephone connection. Test results are matched against a highly reliable biometric voiceprint. Random or scheduled tests To maintain security, tests can be set up to be administered at scheduled or random intervals throughout the day. Test times also can be set to match a person's schedule. Often, agencies use both radio-frequency monitoring and Sobrietor to ensure sobriety and compliance to curfews. Test results can be forwarded to officers via e-mail. Easy to use, multi-language Sobrietor has many features to make taking a breath test simple and accurate. Sobrietor can be used with English- and Spanish-speaking clients. Technology & Treatment Solutions GPS Tracking BI ExacuTrack One BI ExacuTrack AT BI ExacuTrack Radio Frequency BI HomeGuard 200 BI HomeCell BI GroupGuard BI GroupGuard Plus BI Drive-BI BI 9000 Series Voice Verification BI VoiceID BI Self Report Custom Electronic Monitoring Programs Copyright . • Legal Notice • Service & Warranty",
    "BI Profile ™ Automated Caseload Management The newest compliance tool for agencies managing administrative caseloads is BI PROFILE. Easy to understand and easy to use - for offender and officer alike - BI PROFILE automates offenders' routine, periodic status reporting, at little or no cost to your agency. BI PROFILE is designed exclusively for use in the corrections industry. Sophisticated interactive technology from BI Incorporated enables BI PROFILE to be reliable and user-friendly: Enrollment: Officers enroll offenders by FAX, mail, or computer. Supervision: Over the telephone, offenders check in as scheduled with BI PROFILE and report any changes in their status. Automated reporting saves both the client and agency time and expense. Reporting: BI PROFILE promptly transcribes and reports each offender's status to the supervising agency for their review and action. By telephone, computers ask for information from offenders and give information to offenders. Probation, parole, pretrial and other pre- and post-dispositional agencies find BI PROFILE is revolutionizing the way they keep offender data current and accurate. Through \"900\" calls, billed to enrolled offenders, BI PROFILE's services remain virtually cost-free to supervising agencies. Agencies wanting to provide BI PROFILE services for their offenders at agency expense may also have that option. Virtually cost-free to supervising agencies Round-the-clock availability for check-in Offender automatically notified of next scheduled call Voice mail from officer to offender Personal identification numbers (PIN) and password security Daily, weekly or monthly check-in schedules Free wallet cards for each offender with phone numbers, PIN and call schedule Data security and integrity"
  ]
}