{
  "company": "bi.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 9,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.6619718309859155,
    "framing_surveillance": 0.2253521126760563,
    "framing_market": 0.1126760563380281,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 9
    }
  },
  "sample_docs": [
    "Technology Supporting Community-based Corrections Patrick Hyde Many factors--from evaporating state surpluses, fixed if not shrinking criminal corrections budgets, the public's reluctance to fund more prison and jail construction, staffing, to jail and prison overcrowding, are leading community corrections officials to seek alternatives for managing our nation's offender population. For many, there has been a shift to community-based corrections that demands offender accountability, maintains public safety, and conserves resources and energy for the most hardened offenders. As a result, many agencies are turning to technology to help supervise probationers, parolees, even inmates released to the community. This technology includes new generations of electronic monitoring, remote alcohol testing equipment, biometric technology such as voice verification systems, and on a limited basis due to cost and lack of field testing, global positioning systems. \"Judges, prosecutors, operators of correctional facilities, and the community benefit from having a full range of sanction alternatives, including community-based supervision programs,\" said Stanley Kephart, recently retired chief probation officer for the Tulare County Probation Department in Visalia, Calif. Tulare County has more than 6,000 probationers in the community at one time. Several hundred are supervised through an electronic monitoring program that was formerly run by the county but recently privatized. \"This allowed us to manage these offenders on a 'tethered' system of frequent contact and save our beds for hard criminals,\" he said. For criminal corrections agencies such as the Tulare County Probation Department, technology that monitors the whereabouts of offenders also helps manage their compliance to court sanctions. The electronic monitoring equipment involves transmitters worn by the offenders, field monitoring devices installed in the home that are connected via phone lines to central computers that track an offender's presence or absence in an area. Many ancillary devices are available to support this supervision, including drug or alcohol testing devices and portable monitoring devices that allow probation or parole officers--from their car--to check whether a person wearing the transmitter is in a class or on a job site. Many corrections officials say technology helps them to shift attention to the high-risk offenders and reduce work caseloads, in turn leading to improved public safety. Others point to the importance of equipment reliability. For example, voice verification systems such as BI Incorporated's VoiceID can maintain multiple location checks on offenders throughout a day. This system supervises offenders through a series of daily telephone calls-- random, scheduled, inbound and outbound--to approved locations, such as an offender's residence or work. Enrolling offenders takes just a few minutes, says BI Product Manager Joanne Davis. \"We knew corrections officers in the field are pressed for time and that enrolling a client with a 'voiceprint' and entering approved phone numbers in the system should take only minutes.\" For many agencies, the use of technology allows officials to move non-violent, lower risk offenders to the community where they can receive treatment for addictions. In Pierce County, Wash., the sheriff's department turned to electronic monitoring to help alleviate an overcrowding problem that plagued the 1,275-bed county jail throughout the '90s. Rather than be mandated by the courts to release inmates prematurely and unsupervised because of the overcrowding, officials turned to electronic monitoring for appropriate candidates. \"About 60 to 70 inmates are supervised electronically in the community while another 120 probationers are monitored,\" said Jack Christofferson, program manager for a Day Reporting Center in Pierce County. In addition, all inmates in the community and about 60 percent of the probationers are also using a remote alcohol-testing device, called Sobrietor. \"Offenders are identified through a voiceprint, they then submit deep lung tests remotely via phone lines, ensuring compliance with sobriety orders,\" he said. Pierce County officials say many offenders ordered to report to the DRC found day reporting more demanding and unpleasant than incarceration. An intensive community program that combines surveillance, accountability, and intensive programming can be more demanding than incarceration. \"It's no picnic,\" said Officer Crystal Collins, who manages Pierce County Sheriff Department's EM program. \"They know from the outset that being with their families in the community is a privilege that will be revoked quickly for violations.\" Self-Pay Component In Pierce County as well as in many other jurisdictions, offenders are required to pay for a portion of their electronic supervision. Proponents say this is \"beer and cigarette money\" for offenders that helps reduce pressure on stretched budgets, goes toward reduced caseloads, allows for additional services for offenders, provides symbolic restitution, alleviates taxpayer burden, and adds a sense of responsibility for the offender. In Tulare County, offenders are assessed a sliding fee daily rate of twice their hourly wage to fund the electronic monitoring services. An offender making $6/hour would be assessed $12 daily. In Pierce County, offenders are assessed a flat rate of $12 daily for electronic monitoring alone and $15 daily for both electronic monitoring and remote alcohol testing. In both cases, assistance is available for indigent clients. Public Safety Number One Issue For all jurisdictions using technology to monitor and manage offenders in the community, public safety is critical. Most measure and manage public safety by: Matching offender supervision levels to their risk Tailoring support programs to their needs Quick reinforcement of positive or negative behavior The U.S. Department of Justice estimates one in five state prisoners leaves prison with no post-release supervision, a less than desirable situation for maintaining ongoing public safety. Many community correction officials suggest by managing offenders re-entry to society, we can help them succeed in their transition back into the community, resulting in a slow down in prison population growth, less overall taxpayer burden, and lower recidivism. To help manage offenders re-entering our communities, many have turned to available technology. \"Public safety involves more than simply incarcerating an individual. That would be for someone who has exhausted all intermediate sanctions and treatment,\" said one official. \"Technology helps us to monitor an individual's compliance to programs and treatment while they are in the community taking advantage of these programs.\" Resources: U.S. Department of Justice www.usdoj.gov Tulare County Probation Department Telephone: (559) 733-6207 Pierce County Day Reporting Center Telephone: (253) 272-0200 BI Incorporated www.bi.com Telephone: (303) 218-1000 American Probation and Parole Association www.appa-net.org Telephone: (859) 244-8203",
    "K2 ™ Host Monitoring System Scaling New Heights in Electronic Monitoring As the challenges confronting our correctional systems mount, communities across the country are increasingly seeking viable alternatives to conventional incarceration. And they're finding an effective one in electronically monitored house arrest. Electronic house arrest keeps offenders secure while costing far less than the traditional system of incarceration. What's more, it makes the supervision of non-violent offenders more efficient and effective than standard methods. Which means corrections departments can manage all offenders more carefully and cost-effectively. An advantage that leads to more productive agencies and a safer society. And one that BI Incorporated has been providing to communities for over a decade, with sophisticated electronic monitoring systems and services that have established BI as the worldwide leader in the market- place. With the K2 Home Escort System, BI takes this leadership position to even greater heights. Because the K2 not only gives you software based on the system that has enabled BI to effectively monitor over 150,000 offenders since 1992 in the world's largest house arrest monitoring center. It also allows you to maximize its performance through the flexible, expandable and upgradeable features a quality host system can provide. And only BI can offer. Proven electronic monitoring - Monitored by you The K2 Home Escort System lets you utilize BI's time-tested soft- ware to manage and monitor subjects from your site, without relying on the services of a third-party monitor. Because you own and operate the system, you control the information. Which means you can customize the database to accommodate specific conditions for individual subjects - defining records and schedules, adding comments and determining alert-handled procedures. By allowing unlimited schedule entries and variable schedule types, K2 gives you the flexibility to manage the system in a manner that best serves your needs. You don't have to be a computer expert to expertly manage and monitor offenders with the K2. Because the system was designed with Spacer Spacer Any size configuration, orientation and training time are minimized as your system grows. Advanced monitoring. From an advanced system. If you're seeking a system with sophisticated monitoring functions, look no further than the K2. It;'s designed to provide support for a variety of electronic and alcohol field monitors. And it delivers all the capabilities you need to streamline and simplify the process. Basic functions of the system include: defining default settings, securing data and screen access protection, entering the monitored subject's record and schedules, real- time monitoring and alert notification for appropriate officer response and action. However, it's K2's advanced functions that truly set it apart. Consider the advantages. With the K2, you can establish grace periods for each offender enrolled in the system. Which means when offenders are late returning home from pre-approved the novice, as well as the experienced computer user, in mind. The K2 is based on a standard DOS/Windows operating system, with easy-to-use screens and intuitive inter- faces. Which means PC users will find its environment familiar, and others will find it easy to learn. To make the process even simpler, K2 also features a comprehensive operator's guide to answer any additional questions. All of which add up to a system that's extremely easy to use. Meeting your growing needs As your monitoring needs grow, the K2 will, too. Its scalable system design provides an easy performance upgrade path for corrections departments of any size and budget. With K2, multiple monitoring workstations can be networked through a standard Novell network architecture to create a more productive and integrated computing environment. Because the software is designed to function the same way for any size configuration, orientation and training time are minimized as your system grows. Advanced monitoring - From an advanced system If you're seeking a system with sophisticated monitoring functions, look no further than the K2. It;'s designed to provide support for a variety of electronic and alcohol field monitors. And it delivers all the capabilities you need to streamline and simplify the process. Basic functions of the system include: defining default settings, securing data and screen access protection, entering the monitored subject's record and schedules, real- time monitoring and alert notification for appropriate officer response and action. However, it's K2's advanced functions that truly set it apart. Consider the advantages. With the K2, you can establish grace periods for each offender enrolled in the system. Which means when offenders are late returning home from pre-approved appointments, no unnecessary alert is displayed - thereby reducing the number of false alerts and allowing you to concentrate on higher priority tasks on the system. The K2 also offers an alert timer; to let you delay processing to a later time. Plus, it allows you to define alert- handling procedures for a specific offender; or by alert type for subjects, agencies or officers - enabling consistent alert processing at every level. It even features an electronic notes function, so you can add pertinent comments while processing alerts. And that's not all. The K2 provides three methods of automated notification - printer, fax or pager. So officers in the field can be notified of a critical alert. What's more, it enables remote access from off-site locations. Which means you don't need to be bear your system to operate it. More power to you - More securely than ever With the K2 system, you get the computing power of a multiprocessor computer for quick and easy data entry and retrieval. Plus a multifunction design, which enables greater individual productivity, while supporting more monitoring units than ever before. On top of all this performance, the K2 also provides top security and reliabilitiy. Advanced data backup features, including disk mirroring, assure redundancy. K2's fault-resistant design and uninterrupitble power supply enable continuous operation with minimum downtime. And the larger Systems are protected by internal environmental monitoring, so potential problems such as fan failure, overheating, or power loss are quickly detected. You have our support With the K2, BI offers greater value, performance and efficiency from the most advanced host electronic monitoring system available. Moreover, we assure the simple implementation of a turnkey solution -Delivered and installed by our own technicians And we back it all with the responsive service and 24-hour-a-day, seven-day-a-week support that have helped to establish BI's enviable posi- tion in the marketplace. The K2 Home Escort System from BI Incorporated. For more information, call 800-241-2911.",
    "Sobrietor ™ If the Problem is Alcohol, the Sanction is Sobrietor More than one million DUI arrests are made, and 3.7 million alcohol related crimes are committed each year. With BI's new alcohol monitoring technology, it is possible to sentence the individuals who commit these crimes to sobriety. With Sobrietor, an offender can be required to remain sober. Since monitoring is performed remotely, using a telephone connection, compliance with the alcohol restriction is verified each and every day. The Officer Control Unit makes offender enrollment simple and fast. The unit's visual display and keypad guide the officer step-by-step through enrollment, minimizing training. Plus, the Officer Control Unit allows the officer to use Sobrietor to verify voice enrollment and perform on-demand field sobriety tests. To make remote testing consistently reliable, voice prompts are incorporated into Sobrietor that provide the offender with clear, unambiguous instructions. For example, if the individual is speaking too softly, Sobrietor prompts the offender to \"speak louder.\" Voice prompts ensure that the offender is instructed through each step of the test. New variable security levels give the officer the ability to adjust the voice verification threshold for each offender. This feature reduces false alerts and minimizes attempts to fool the system. In addition, Sobrietor stores the last failed voice recognition, helping to identify uncooperative offenders. Sobrietor utilizes fuel cell technology, the same alcohol consumption monitoring system used in the most advanced Portable Breath Test devices. Because Sobrietor measures the exact Breath Alcohol Content (BrAC) from the breath test, the offender's precise intoxication level is reported to the officer. Sobrietor & Radio Frequency Monitoring A Powerful Combination Sobrietor may be used as a stand-alone sanction or in conjunction with Radio Frequency Monitoring. In stand-alone mode, Sobrietor tests the offender randomly throughout the test period, as specified by the officer. When used with Radio Frequency Monitoring equipment from BI, the offender may be tested immediately upon entering the house, and randomly thereafter. In either case, only one phone line and one power outlet are required. Monitoring of Sobrietor tests can be performed at a GuardCenter™, one of BI's monitoring service centers. Trained BI personnel perform testing procedures specified by the agency, and report all results. Agencies may also utilize an on-site host system allowing them to control compliance monitoring internally. BI works closely with every customer to determine which monitoring system best meets their needs. Sobrietor has the ability to help individuals break the relationship between alcohol and criminal behavior. By requiring mandatory sobriety, many crimes can actually be prevented. BI offers remote alcohol testing as an essential component of our continuum of graduated sanctions. Sobrietor is an effective method to monitor an offender's compliance and progress, and can be an important part of BI's integrated supervision and treatment products and services. BI is the corrections company that pioneered electronic monitoring and now provides the criminal justice field with the most comprehensive tools to supervise and treat offenders living in our communities. BI's programs help reduce recidivism and improve public safety. BI GuardServer™ Host Products BI K2™ Host System Computer BI 9000™ Series Field Equipment Up to 12 hours Up to 4 tests Calibration recommended every 6 months Fuel cell replacement recommended every 2 years USA - tone or pulse International versions available by request",
    "Over the past fifteen years, community-based corrections programs have been required to enhance their standard supervision programs to manage more difficult cases. Increased demand for the management of clients diverted or transitioning from jail or prison has resulted in more specialized programs and caseloads. BI has responded to the need for new ways of efficiently supervising community-based offenders by developing a continuum of compliance technologies. At BI, electronic monitoring (EM) means much more than simply radio frequency curfew monitoring. BI offers a continuum of reliable compliance technologies to meet the monitoring needs of agencies and Courts. BI's electronic monitoring products and services provide an effective complement to various types of community corrections programs including alternative sanction programs, treatment programs , intensive supervision programs, jail overcrowding programs , work release programs, day reporting programs, pre-trial release programs and others. Used within the confines of solid correctional policy and practice, EM can restrict undesirable behavior, punish, support treatment efforts, reduce public risk and be an extremely cost-effective alternative to more traditional sanctions. The following is a list of the reliable EM technology provided by BI: HomeGuard™ 200 9000™ Series Remote Alcohol Compliance Monitoring VoiceID™ Profile™ Profile Plus™ BI Incorporated is the corrections company that pioneered electronic monitoring and now provides the criminal justice field with the most comprehensive tools to supervise and treat offenders living in our communities. BI's programs help reduce recidivism and improve public safety. For more information on our programs and service offerings, please visit the Program Services section. US and International Patents Issued and Pending",
    "Re-Entry Services: Managing High-Risk Offenders in the Community James L. Anderson, Esq. Vice President, Re-Entry Services, BI Incorporated Over the last 25 years, the criminal justice system in general, and corrections in particular, have undergone enormous changes. First, U.S. correctional facility construction escalated to house a record number of inmates -- to an all-time high of two million prisoners. Second, sentencing policy shifted to more precisely defined periods of incarceration, resulting in less preparation and control of prisoners upon their eventual release. Indeed, as more inmates serve most if not all of their sentences, many have much shorter periods of community supervision once released. And third, the supervisory functions of parole agencies have been slashed, resulting in unmanageably high caseloads for officers with more emphasis on surveillance and less on rehabilitation. These factors have led to four times more prisoners being released now into our communities than occurred just two decades ago. In fact, the Department of Justice estimates 630,000 inmates from federal and state prisons will return to our communities this year alone. These prisoners will have served longer sentences than ever and have few positive connections to their past community life, including families, employers, and positive community connections. Studies also indicate a majority of these inmates are returning to a relatively small number of neighborhoods concentrated in large, urban cities. While prisoners have always returned from prison, the magnitude of the population returning is unprecedented, and their needs much greater than previous inmates released to our communities. Unfortunately, few plans have been made by policymakers to deal with prisoners after their release, says University of California Professor of Criminology Joan Petersilia, Ph.D., in a report for the National Institute of Justice. As a result, she says, crime rates will cause families, victims, and communities at large to shoulder the impact of their return. This \"perfect storm\" scenario in community corrections presents lawmakers and agencies that oversee corrections with serious challenges -- creating policies and programs that reduce the risk this returning prisoner population presents communities, and doing so as cost effectively as possible. An Overview of Re-Entry Simply defined, Re-Entry is the process of a person leaving prison and returning to society. If this process is managed successfully, both fiscal and social benefits are achieved. Socially, successful reintegration translates to better public safety as reduced recidivism will lead to less future crime and most important--fewer victims. Fiscally, successful Re-Entry means fewer offenders returning to prison, resulting in substantial savings for states already strapped for money. How did we get where we are today? From 1925 to 1973, the Bureau of Justice estimates the U.S. per capita prisoner rate was stable at about 110 prisoners per 100,000 residents. This was true until the mid-1970s. Since then, this yardstick has jumped to more than 475 prisoners per 100,000 citizens--a fourfold increase in a relatively short period. In general, incarceration rates skyrocketed due to an ideological shift in sentencing and a belief that crime rates were rising, pushing lawmakers toward tougher laws, in turn feeding the problem. States cut rehabilitative efforts and moved in several directions, including reducing a judge's discretionary sentencing, abolishing parole release, \"three-strike\" laws, \"truth-in-sentencing\" policies, and mandatory minimum sentences. These practices resulted in more prisoners spending longer time behind bars. In addition, many states went on a prison construction-building spree. In California alone, 21 prisons have been built since the mid-1980s and the portion of state funds dedicated to corrections grew from 2 percent to a staggering 8 percent. Tilting the Continuum of Supervision From the moment a criminal is arrested to the time they have fully served their sentence, a continuum of supervision is applied, moving from most intense (in a cell) to gradual, earned freedom (completing parole). The government has established itself as the steward of intense supervision with various levels of incarceration. But for years, a large problem of American corrections has been the inability of the prison and parole system to stem the tide of parolees who return to prison multiple times -- the revolving door system. In part, this is due to a bias on the continuum weighted heavily toward the intense supervision end of the spectrum, with little planning for Re-Entry. In fact, the American Corrections Association found that in 2000, two-thirds of all states provided no documentation or reporting instructions to inmates during release. Basic details such as personal identification, some cash, and appropriate release times are often overlooked, making the first few hours or days for many released inmates chaotic and vulnerable to relapse. Clearly, establishing a systematic process for release will ease anxiety on all parties and make the vital first few hours and days of freedom smoother for the offender and safer for the community Parole boards have been the traditional Re-Entry managers, but their effectiveness has been greatly limited over the years. Tougher, longer sentences have increased time prisoners spend incarcerated and reduced their time on parole. Instead of participating in the process to determine whether an offender earned the right to release and had a job or family support structure, parole boards now typically receive automatically released offenders who have served fixed sentences. And with more and more prisoners being released, parole officers are being asked to manage enormous caseloads. Offender-to-officer ratios double are what they were in 1980. Less manpower and resources are available to tackle the enhanced responsibility of more dangerous offenders released with more complex problems. The results are predicable. Most parolees fail and a full two-thirds are back in prison within three years -- in fact almost one-half return within a year. In addition, the Bureau of Justice says one-fifth of returning prisoners -- the most at-risk group for violence -- will actually get no parole supervision, as they will serve their entire sentence in prison. Research also shows that substance abuse (75%) and mental illness (16%) are common problems among prisoners being released, but less than one-third of this group receives treatment for their problems while incarcerated. Combined with low education levels, employment issues, housing and family issues, it is easy to see why many inmates fail upon their return to society. Re-Entry as an Opportunity Over 550,000 inmates were released from prisons last year. Another 630,000 are expected to be freed this year. And by 2010, over 1.2 million inmates will be returning home every year. It is mandatory that our criminal justice system successfully manage these prisoners returning to society. If we do not, we will forever be facing the same grim results only multiplied due to the explosion in overall releases expected over the next 10 years At BI Incorporated, we suggest that because 95% of all prisoners will reenter our communities, developing a successful transition from incarceration to freedom is possible and necessary. In fact, prison should be viewed as an opportunity to rehabilitate and potentially train a person for release, and community-based programs that ease the transition will support the prison program and result in reduced recidivism. In fact, because these prisoners are being released and will return to very specific neighborhoods, an opportunity for managing their Re-Entry is made possible as services may be clustered for efficiency. Almost every returning prisoner's Re-Entry to society is challenged in five areas: substance abuse, physical and mental health, negative peer pressure, employment and housing. For the most part, prisoners are left to manage these challenges solo or they must rely on the voluntary efforts of citizens in the community. While the intentions are good, the results are predictably bad. But every crisis can also be viewed as an opportunity to adapt and thrive. Because each individual presents unique needs and levels of risk, an effective program can only be constructed after a thorough assessment of the offenders' needs as they relate to criminogenic risk factors. At BI, we employ the LSI-R, a standardized, 54-item assessment instrument developed by Mental Health Services to identify the appropriate level of surveillance and support required for the individual. This risk/needs assessment tool is completed to categorize an offender's likelihood of recidivism and risk to the community in an objective, standardized manner. Today, BI assists 2,500 probation and parole agencies and other organizations to monitor and treat offenders living in the community. BI offers an integrated approach of monitoring and programming. BI's technical solutions include sophisticated electronic monitoring, voice verification systems, remote alcohol detection systems, and complete offender database management systems from more than 100 strategically located service centers. While monitoring helps drive compliance to sanctions, research shows that monitoring without treatment is not nearly as effective in reducing recidivism. As a result, BI developed a proprietary formula to deliver an integrated approach to Re-Entry. This formula, Monitoring + Treatment Programming + Immediate Responses (positive or negative) to behavior patterns = Reduced Recidivism (In short, M+P+R=RR) is reflected in the current behavior change model. Conditions of release are imposed to give the offender the opportunity to support his Re-Entry; they are also geared to prevent relapse into antisocial behavior. Drug courts offer a glimpse of tactics for successful Re-Entry -- from continuous contact with a judge, clearly defined contracts, graduated sanctions for non-compliance, and rewards for success. The government embraced drug courts since they were founded a decade ago and today funds 1,200 drug courts nationwide. What specifically is meant by M + P + R = RR? Simply, \"M\" means monitoring criminal offenders. Sometimes this may be very stringent supervision, as in the case of incarceration. Other forms of \"M\" include drug and alcohol testing, electronic monitoring, fee, fine and restitution collections, or simply reporting to a day treatment center based on a predetermined schedule. The monitoring component is designed to ensure that an offender complies with orders of release and stays on track to successful completion. Monitoring provides objective, orderly measurements of the offender's conditions of release and progress in changing criminal or antisocial behavior patterns. Monitoring sets community standards, holds offenders accountable and, as a result, manages offender risk. The second component of an integrated approach, \"P,\" indicates treatment programming. The goal of programming is to reduce offender risk by meeting their specific needs. Good programming addresses the cause of the criminal behavior and closely manages the offender's needs, thereby reducing the offender's risk to the community. Offender programs must be evaluated not in of days in a program (i.e., a 2-week, 4-week, or 6-week program), but upon reaching defined milestones and demonstrated progress. Considerable research has been conducted to assess the effectiveness of providing treatment programming to criminals as part of their sentence. Many studies indicate that there is little chance for them to change negative behavior without sustained and accountable treatment -- apparent in the fact that almost two-thirds of parolees return to prison in less than three years. Treatment must be specifically designed to break the \"denial\" factor by most offenders who believe they do not need treatment. A partial list of programming options includes: alcohol and drug abuse treatment, cognitive restructuring, basic education, job skills training and placement services, domestic violence treatment, victim awareness, anger management, sex offender treatment, and relapse prevention programs. Substance abuse is a major challenge for reentering prisoners and treatment a common component of their programming. In fact, because 80 percent of the state prison population report a history of drug or alcohol use, relapse upon release is common. UCLA Professor Mark Bleiman introduced a phrase that captures the concept that substance abusers must be treated evenhandedly -- coerced abstinence. With coerced abstinence, intensive supervision and treatment for people in the criminal justice system for drug abuse is mandated, supported by increased sanctions for failure to stay clean. BI's Re-Entry day reporting centers provide the coerced abstinence Bleiman proposed, resulting in ongoing treatment efforts matched with monitoring technologies such as electronic monitoring, remote alcohol detection and voice recognition devices. As an offender demonstrates progress, sanctions are lessened. Programs that continue beyond 90 days for most offenders will begin to improve their cognitive skills, helping to reduce the likelihood of relapse. The longer the program, the more pronounced the results. The third factor in the M + P + R = RR formula, \"R,\" refers to response to both negative and positive decisions and behavior. This element is critical to success of the programming. The offender must know that behavior is being monitored and more pro-social behavior is expected -- behavior that will help the offender to eventually become a contributing member of society. The response segment of this equation must be consistent and immediately applied after the exhibited behavior or the action taken is meaningless. Offenders must know upon starting a program what is expected of them, the consequences for non-compliance, and the rewards for consistent and conscientious compliance. Typically, expectations and sanctions are outlined in a written contract. Sanctions may include electronic monitoring, greater treatment levels, returns to jail or prison while rewards may include sentence reductions or coupons for food, movies, and bus transportation. The level of monitoring and programming will evolve based on the offender's progress toward pro-social behavior. As an offender demonstrates accountability, levels of monitoring and programming are modified to match this change. Typically, an offender will have more supervision and monitoring initially, with less programming, only to have this reversed as they move forward. An offender further into an integrated program would have less monitoring (as a reward) and more intensive treatment and counseling. At that point, the offender has moved from \"pre-contemplative\" to \"contemplative\" reasoning and has actually begun to \"look in the mirror\" at the person who is responsible for change. This so-called \"tethering\" approach allows offenders to gain back their freedom gradually, but only after they have demonstrated that they can handle the responsibility that goes with it. Accountability is key to successful and lasting behavior changes. The relationships offenders develop with corrections professionals upon Re-Entry, from judges and probation and parole officers to faith-based organizations and community service providers, will also be important for successful Re-Entry. Personal connections and pro-social modeling occurs as an offender's supervision and treatment progress. Offender counselors must believe that people can change; must be able to maintain professional relationships; and must be firm, fair and consistent. Theory in Practice: Southside Chicago DRC Taken in combination and managed closely, the \"M+P+R=RR\" approach may be applied to many levels of criminal offender in the community. Take the example of a unique program that BI has managed in collaboration with the Illinois Department of Corrections for more than four years. This program adopted \"M+P+R=RR\" for an extremely high-risk offender population. At the Chicago Southside Day Reporting Center at 57th and Wood Streets in the community of Englewood, the Illinois DOC is making inroads into future crime, helping criminal offenders learn to contribute versus take, and, along the way, saving taxpayers a lot of money. And it is doing this with some of the toughest criminals Illinois produces. Considered an experiment when it was begun, the Southside Chicago DRC was funded to provide intensive supervision and behavioral change programs to high-risk parolees. The targeted parolee population included: Offenders with two or more prison incarcerations Offenders who served a sentence of 10 years or more Offenders 25 years old or younger serving a sentence for a crime against another person. Offenders with two or more prison incarcerations Offenders who served a sentence of 10 years or more Offenders 25 years old or younger serving a sentence for a crime against another person. A highly structured community-based transition program was developed to help modify offender behavior patterns that could lead to crime, especially in the entrenched, negative culture of Englewood. By doing so, future victims are spared, taxpayers avoid the $20,000 plus a year it costs to house a prisoner in Illinois, and criminals learn to be responsible, contributing members of society. Accountability is demanded of program participants through curfews, random drug testing, Breathalyzer tests, and daily check-ins at the Re-Entry DRC. Services for this high-risk population includes: case management, substance abuse treatment, cognitive skills development, family services, basic education for GED, employment preparation, aftercare, and connections to some of the positive community outlets such as faith-based organizations. Data reviewed from the Southside Chicago program after three years shows excellent results. More than 1,500 parolees have participated in the BI Re-Entry program during its first three years (1998-2001). A comparison group (released during the same time period) of 900 parolees, who were not referred to the DRC for Re-Entry services, with like criminal histories, age, gender, race, and number of prison were also studied. Results indicate: After 3 years, only 35% of the parolees admitted to the BI program in year 1 (1998) had been reincarcerated as a result of new crime conviction, contrasted with a comparison group with no DRC programming, 52% of whom were readmitted during the same time period. After 2 years, 24 percent of the parolees admitted to the BI program in year 2 (1999) had been reincarcerated as a result of a new crime conviction, compared to 45% of the non-DRC parolee participants. After 1 year, 10 percent of parolees admitted to the BI program in year 3 (2000) had been reincarcerated due to a new crime conviction, compared to 35% of the non-DRC parolee participants. After 3 years, only 35% of the parolees admitted to the BI program in year 1 (1998) had been reincarcerated as a result of new crime conviction, contrasted with a comparison group with no DRC programming, 52% of whom were readmitted during the same time period. After 2 years, 24 percent of the parolees admitted to the BI program in year 2 (1999) had been reincarcerated as a result of a new crime conviction, compared to 45% of the non-DRC parolee participants. After 1 year, 10 percent of parolees admitted to the BI program in year 3 (2000) had been reincarcerated due to a new crime conviction, compared to 35% of the non-DRC parolee participants. The Illinois DOC, besides wanting to break the tremendous cycle of repeat offenses for this high-risk population, needed a cost-effective solution. The state had too many inmates, too few beds, limited funding for prison expansion, and more than 60 percent of the prisoners released were committing new crimes. Despite such an intensive level of programming and supervision, BI's Southside Day Reporting Center is helping to tackle the problem and saving taxpayers money. Taxpayer burden for a participant in the program is approximately $925 per month, or slightly more than $11,000 per year. Incarceration costs for the state approach $2,100 monthly, or about $20,000 annually. More importantly, by increasing this population's coping skills, enormous future costs are reduced. In light of scarce government funding, Re-Entry programs like the Southside Chicago DRC for high-risk parolees will be selected for maximum effectiveness and greatest return on investment. The National Governors Association recently reported that its members face a combined budget shortfall of at least $40 billion and possibly $50 billion in 2002 -- a full 10 percent of all state budgets. That is a staggering shortfall, considering states had large surpluses for most of the '90s. Many indicators, including these budget issues, say the prison-building boom is over for now, as states must cope with fast rising health care and educational expenses. Instead, states and the federal government will be forced to seek safe alternatives to incarceration. Looking Ahead As the current corrections literature documents, Re-Entry is a quickly evolving national topic. The federal government has begun to recognize the issue and has begun to release funding for alternative solutions from both the public and private sector. For example, the U.S. Department of Justice Office of Justice Programs has established two new grant programs that challenge states to rethink the Re-Entry process. The Re-Entry Court Initiative, based on the drug court model, was established in California, Florida, Colorado, Delaware, Iowa, Kentucky, New York, Ohio, and West Virginia. These Re-Entry courts offer a team-based approach that supports jail-based treatment, monitors accountability, provides rewards and penalties, and prepares an offender for community-based drug court programs. By using sanctions and rewards, positive behavior is encouraged, antisocial behavior punished. The DOJ also established eight pilot sites for a Re-Entry Partnership Initiative, with goals of managing risk through enhanced surveillance, risk and needs assessment, and planning prior to release. In January 2002, the DOJ announced a unique and exciting initiative specifically for serious offenders who will be returning to our communities. A broad-based coalition backs the new initiative, including the U.S. Departments of Labor, Health and Human Services, Education, and Housing and Urban Development. As part of the initiative, these departments will pool resources and fund grants for high-risk offender Re-Entry programs. The goal of this initiative is to fund one adult and one juvenile program in each state, with each site receiving between $500,000 to $2 million, depending on the scope of the program, number of offenders involved, community partnerships involved, and number of targeted populations involved. Programs the government seeks for this broadly supported initiative must incorporate three phases of programming -- in-prison preparation services, a community-based transition program, and ongoing community support elements. It is an intriguing grant program that will rely on comprehensive programming and supervision for a serious offender population, similar to the elements incorporated into BI's Southside Chicago Re-Entry program. Incarceration is a necessary segment of our criminal justice system. But in addition to helping to maintain public safety over a period of time, it should also provide a bridge to Re-Entry. From a period of time during incarceration moving through transitional phases in the community toward eventual freedom, identifying training and treatment to match an offender's risk and needs will help save money as measured in reduced crime, lower incarceration and prison construction fees, and reduced recidivism. As the recent DOJ grant initiative suggests, implementing a successful Re-Entry model will take commitment, work and collaboration between government agencies, key members of the community, and experienced community-based service providers."
  ]
}