{
  "company": "biometricvision.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 10,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 10
    }
  },
  "sample_docs": [
    "Identity crime, security threats and the societal impact of artificial intelligence, are global concerns. In 2018, we decided to create a proprietary software that utilised the strongest identity authentication method in existence: facial recognition. We had seen the destruction that identity theft could cause. But our world-wide experience in operational risk management led us to recognise the broad potential for the application of this technology elsewhere, beyond its competence in thwarting identity fraud. Things like fast-tracking and increasing the effectiveness of security systems; preventing intrusion into sensitive environments and protecting events. We could see its ability to improve functionality in human to computer engagement and the benefits this implied for technologically driven companies. And so, Biometric vision's facial recognition technology was born. Our leading facial recognition system is the most powerful tool at your disposal when it comes to maintaining the security of identities, of confidential information, of vulnerable spaces and of efficient, computer-led interactions. Let us partner with you to determine where biometric vision's state-of-the art software can help both safe-guard and optimise your company's business-critical processes. Identity crime, security threats and the societal impact of artificial intelligence, are global concerns. In 2018, we decided to create a proprietary software that utilised the strongest identity authentication method in existence: facial recognition. We had seen the destruction that identity theft could cause. But our world-wide experience in operational risk management led us to recognise the broad potential for the application of this technology elsewhere, beyond its competence in thwarting identity fraud. Things like fast-tracking and increasing the effectiveness of security systems; preventing intrusion into sensitive environments and protecting events. We could see its ability to improve functionality in human to computer engagement and the benefits this implied for technologically driven companies. And so, Biometric vision's facial recognition technology was born. Our leading facial recognition system is the most powerful tool at your disposal when it comes to maintaining the security of identities, of confidential information, of vulnerable spaces and of efficient, computer-led interactions. Let us partner with you to determine where biometric vision's state-of-the art software can help both safe-guard and optimise your company's business-critical processes. Ready to try our API? Get in touch or start now. Get in touch or start now.",
    "Seamless User Experience Designed to be implemented with ease. FaceSearch allows businesses, security organisations and government agencies the ability to quickly and accurately identify faces across large databases without the large integration costs. Designed to be implemented with ease. FaceSearch allows businesses, security organisations and government agencies the ability to quickly and accurately identify faces across large databases without the large integration costs. A cross-industry monitoring and surveillance tool FaceSearch has many applications to improve both security and customer experiences, from crime prevention, aiding forensic investigations, protecting schools/events from threats, finding missing persons all the way to smarter marketing. A cross-industry monitoring and surveillance tool FaceSearch has many applications to improve both security and customer experiences, from crime prevention, aiding forensic investigations, protecting schools/events from threats, finding missing persons all the way to smarter marketing. The Biometric Vision advantage The fastest match times Blistering speed with a face match time of 130ms. Extreme Scenarios Not all pictures are taken in perfect environments, so our algorithms are tested against a suite of different scenarios. Compact Algorithm uses less memory than our competitors for enrolment of a single image at 15mb. The Biometric Vision advantage Blistering speed with a face match time of 130ms. Not all pictures are taken in perfect environments, so our algorithms are tested against a suite of different scenarios. Algorithm uses less memory than our competitors for enrolment of a single image at 15mb. FaceSearch example scenarios Fraud Prevention Public Safety Attendance systems Ready to try our API? Get in touch or start now. Get in touch or start now.",
    "Next-gen facial recognition algorithms using a single API key Integrate with Biometric Vision's next generation AI-powered algorithm in minutes and increase the accuracy, speed and performance of your facial recognition apps. Near perfect accuracy 99.99% accuracy in the most challenging of conditions. A 0.006% error rate tested against 1 million ethically sourced face images. High-end security AES-256+ end-to-end encryption and a proprietary method for storing face templates as anonymous alphanumeric code (binary), i.e. non-reversible. Feature niche SaaS product We do one thing really well and that's facial recognition algorithms. Providing access to our 1:1 and 1:N algorithms. Next-gen facial recognition algorithms using a single API key Integrate with Biometric Vision's next generation AI-powered algorithm in minutes and increase the accuracy, speed and performance of your facial recognition apps. 99.99% accuracy in the most challenging of conditions. A 0.006% error rate tested against 1 million ethically sourced face images. AES-256+ end-to-end encryption and a proprietary method for storing face templates as anonymous alphanumeric code (binary), i.e. non-reversible. We do one thing really well and that's facial recognition algorithms. Providing access to our 1:1 and 1:N algorithms. Leverage the power and flexibility of our API APIs are made for leveraging the power of connectivity. Our cloud hosted API is suitable for any environment, on any platform, physical or virtual. Our API promotes innovation, opportunities to scale and make monetisation easier by reducing costs and time spent by building solutions with best-of-breed components. Leverage the power and flexibility of our API APIs are made for leveraging the power of connectivity. Our cloud hosted API is suitable for any environment, on any platform, physical or virtual. Our API promotes innovation, opportunities to scale and make monetisation easier by reducing costs and time spent by building solutions with best-of-breed components. Developer first technology TRY IT NOW FaceMatch API (1:1) Verify that two faces belong to the same person in seconds. The perfect solution if you want transform the accuracy of your facial identification programs. COMING SOON FaceSearch API (1:N) Scan your database to identity similar-looking people to a certain face at lightening speed. Verify that two faces belong to the same person in seconds. The perfect solution if you want transform the accuracy of your facial identification programs. Scan your database to identity similar-looking people to a certain face at lightening speed. Easily integrate FaceMatch API with Access control systems Your face is your key, that provides secure access that is fast, frictionless, and accurate. Identity programs Leverage face verification where trust in a digital identity is paramount, e.g. Government IDs. Payment systems Verify transactions that provides frictionless, efficient, and personal experiences. Easily integrate FaceMatch API with Your face is your key, that provides secure access that is fast, frictionless, and accurate. Leverage face verification where trust in a digital identity is paramount, e.g. Government IDs. Verify transactions that provides frictionless, efficient, and personal experiences. Developed with privacy at the core Preserving people's privacy is paramount in an ever increasing digital world. Privacy has been embedded into the core of our platform. We are compliant with the stringent International Standards of integrity, privacy and security. Developed with privacy at the core Preserving people's privacy is paramount in an ever increasing digital world. Privacy has been embedded into the core of our platform. We are compliant with the stringent International Standards of integrity, privacy and security. Ready to try our API? Get in touch or start now. Get in touch or start now.",
    "Integrate into your apps in minutes Easily connect to FaceMatch via a single API key and transform the speed, accuracy and security of your facial recognition applications or critical business processes. Integrate into your apps in minutes Easily connect to FaceMatch via a single API key and transform the speed, accuracy and security of your facial recognition applications or critical business processes. The Biometric Vision advantage Being a niche tech startup allows us to be nimble to meet your needs, whilst keeping costs down. We have proprietary developed mathematical algorithms based on a trained convolutional neural network, providing you with leading performance. Our customer onboarding experience is seamless, and integration simple but efficient. Near perfect accuarcy An error rate of 0.006% when tested against a 1 million ethically sourced face images covering both visa-style and \"in-the-wild\" images. High-end security AES 256+ end-to-end encryption making it impenetrable. Australian engineered Being an Australian tech startup allows us to adapt and change as the facial recognition industry develops, whilst meeting the changing International compliance landscape. The Biometric Vision advantage Being a niche tech startup allows us to be nimble to meet your needs, whilst keeping costs down. We have proprietary developed mathematical algorithms based on a trained convolutional neural network, providing you with leading performance. Our customer onboarding experience is seamless, and integration simple but efficient. An error rate of 0.006% when tested against a 1 million ethically sourced face images covering both visa-style and \"in-the-wild\" images. AES 256+ end-to-end encryption making it impenetrable. Being an Australian tech startup allows us to adapt and change as the facial recognition industry develops, whilst meeting the changing International compliance landscape. All stored in the cloud Face detection Detect and locate the presence of the largest face within a digital image. Privacy Meet data sovereignty requirements with 17 hosted locations worldwide. Face verification 1:1 Check the likelihood that two faces belong to the same person, i.e. verify. Anonymity Anonymising images into an alphanumeric string (binary) that cannot be reversed engineered. Compact Enrolment of an image uses less memory than our competitors at 15mb. AI-powered Our convolutional neural network deliver leading accuracy and performance. All stored in the cloud Detect and locate the presence of the largest face within a digital image. Meet data sovereignty requirements with 17 hosted locations worldwide. Check the likelihood that two faces belong to the same person, i.e. verify. Anonymising images into an alphanumeric string (binary) that cannot be reversed engineered. Enrolment of an image uses less memory than our competitors at 15mb. Our convolutional neural network deliver leading accuracy and performance. Easily integrate FaceMatch API with Access control systems Your face is your key, that provides secure access that is fast, frictionless, and accurate. Identity programs Leverage face verification where trust in a digital identity is paramount, e.g. Government IDs. Payment systems Verify transactions that provides frictionless, efficient, and personal experiences. Easily integrate FaceMatch API with Your face is your key, that provides secure access that is fast, frictionless, and accurate. Leverage face verification where trust in a digital identity is paramount, e.g. Government IDs. Verify transactions that provides frictionless, efficient, and personal experiences. Ready to try our API? Get in touch or start now. Get in touch or start now.",
    "If you need more information or help with anything you can reach out to Support or [email protected] . Getting Started Recognise and compare faces in minutes with this simple to use cloud based facial recognition API. This model has a match accuracy of 99.9% so it works under extreme conditions (Long distance, pixelation, blurred images and high/low contrast) This tutorial shows you how to compare between two images. Example This image below is a demo showing the results of two images matching as the same person: The 99.9% match accuracy means it will work under extreme conditions: Tutorial Here are the simple steps to get started: Step 1. Get your API Key You can quickly generate your API Key by signing up here . Step 2. Upload two images to the compare API Once you get API Key you will be able to use the compare functionality . Below is an example for using the API. POST API point https://biometricvisionapi.com/v1/compare Request Example curl -X POST 'https://biometricvisionapi.com/v1/compare' \\ -H 'X-Authentication-Token: a1eOzjOM2RFbd3kOKk6wqTDANlNKezx419HWIOHvs1IthXe63r4rNnaCwB4DWmkQ' \\ -H 'Content: application/json' \\ -H 'Accept: application/json' \\ -F 'image1=@/home/user/image1.jpg' \\ -F 'image2=@/home/user/image2.jpg' Response { \"confidence\": \"Match\", \"features\": { \"leftEye\": 100, \"rightEye\": 100, \"leftBrow\": 98.15, \"rightBrow\": 100, \"forehead\": 100, \"middleForehead\": 100, \"nose\": 100, \"philtrum\": 100, \"mouth\": 100, \"jaw\": 100, \"leftCheek\": 100, \"rightCheek\": 98.95 } } Step 3. Upload two images to the compare API Track and monitor the API stats via the dashboard If you need more information or help with anything you can reach out to Support or [email protected] . Recognise and compare faces in minutes with this simple to use cloud based facial recognition API. This model has a match accuracy of 99.9% so it works under extreme conditions (Long distance, pixelation, blurred images and high/low contrast) This tutorial shows you how to compare between two images. This image below is a demo showing the results of two images matching as the same person: The 99.9% match accuracy means it will work under extreme conditions: Here are the simple steps to get started: You can quickly generate your API Key by signing up here . Once you get API Key you will be able to use the compare functionality . Below is an example for using the API. POST API point Track and monitor the API stats via the dashboard Ready to try our API? Get in touch or start now. Get in touch or start now."
  ]
}