{
  "company": "birdee.solutions",
  "dominant_topics": [
    -1,
    2,
    1,
    6
  ],
  "topic_counts": {
    "-1": 3,
    "2": 2,
    "1": 2,
    "6": 2
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.2608695652173913,
    "framing_surveillance": 0.0,
    "framing_market": 0.7391304347826086,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "1": 2,
      "2": 2,
      "6": 2
    }
  },
  "sample_docs": [
    "Personalisation Know the name of all your customers and treat them the way they deserve it. Make them feel welcome and important which are the two most important factors determining good customer service. Customer focus Know the past orders and start preparing them instantly. People are habit creatures and will order the same things in more than 90% of all times. Rather than asking the same questions over and over again, spend some time to get to know your customers better. Take control Know what your customers order and make sure to stock the items your customers recurrently want. In high competitive environments you can't afford to run out of your profit generating products. Analysis Analyse the orders of your customers. Get the insights for up-selling, cross-selling, and discounting opportunities. Time Save time in the ordering and check-out process and be able to serve more customers in a shorter amount of time without loosing the intimacy of a good customer relationship. basic 30 week facial recognition +1500 AUD installation fee subscribe Silver 50 week facial recognition monthly customer insights report +1000 AUD installation fee subscribe Gold 70 week facial recognition live customer insights free installation subscribe Know the name of all your customers and treat them the way they deserve it. Make them feel welcome and important which are the two most important factors determining good customer service. Know the past orders and start preparing them instantly. People are habit creatures and will order the same things in more than 90% of all times. Rather than asking the same questions over and over again, spend some time to get to know your customers better. Know what your customers order and make sure to stock the items your customers recurrently want. In high competitive environments you can't afford to run out of your profit generating products. Analyse the orders of your customers. Get the insights for up-selling, cross-selling, and discounting opportunities. Save time in the ordering and check-out process and be able to serve more customers in a shorter amount of time without loosing the intimacy of a good customer relationship. +1500 AUD installation fee monthly customer insights report +1000 AUD installation fee",
    "Verified by Birdee Let your face be your ID and ticket for rapid entrance control at events. OUR SOLUTION Use a camera to recognise attendants and verify identity to validate the ticket Fast Process Streamlining the ticket verification process reduces wait time tremendously which increases customer satisfaction. Checking Identification Our camera system can recognise everyone that is registered and hence determine the identification of that person in the blink of an eye without the need of presenting an ID. Service The venue knows who is on-site and can send personalised text messages to selected attendants. Safety Always be in full control and know who is on-site. In case of an emergency situation this allows for rapid reporting to first respondents which helps to carry-out appropriate actions. Reporting Analyse success of Events and follow-up with people that attended. Recognise individuals across multiple events you run. Impact Positive impact on attendants and event organisers due to ease of use and fast registration process. Be the first to receive the latest news regarding advanced event registrations. Let your face be your ID and ticket for rapid entrance control at events. Use a camera to recognise attendants and verify identity to validate the ticket Be the first to receive the latest news regarding advanced event registrations.",
    "Birdee has taken a major leap in the last 3 months. We've gathered data, reached out to various customers and extended our research. Our product portfolio grew, and we have created a solution for Australia's offline retailers in the emergence of e-commerce companies such as Amazon. So, if you have been wondering where we were, we have been working hard behind the scenes to prepare ourselves for this particular moment. Online retailer Online retailers create extensive customer profiles which help them to provide each and every customer with personalised services and products. Moreover, there are no check-out lines and in many cases (digital goods) reception of goods and services is instant and the quality is always the same. Coupled with enhanced transparency and multiple feedback options, e-commerce developed into a real alternative to offline retailers. Bricks-and-mortar businesses Offline retailers have significant advantages over e-commerce businesses which are mainly based on personal treatment of customers. However, being friendly is not enough anymore and many businesses lost their advantages. Long lines at the check-out, generic approaches, inflexible solutions, and less transparency is not accepted anymore. The problem is that in many cases shop-floor staff doesn't know who their customer is and hence find it incredibly difficult to offer a service that is tailored to their specific needs. New technologies can help them to re-gain their competitive edge but three factors are ultimately determining the success. Total focus on the customer Technology must be easy to integrate The advantage of personal service must not be substituted Our solution for cafes We dug deeper into those aforementioned issues and focused on cafes and their consumers, the coffee drinkers. Research has shown that three main factors are vital to the success of a café. Consistent quality of Coffee Consistent quality of Service Fast serving times Unfortunately, cafes most of the time contravene these success factors by having lengthy ordering and check-out processes. Moreover, even regular customers have to repeat their orders; and lastly, many cafes have rigid \"buy ten get one for free\" loyalty programs no-one cares about. This is where Birdee fits in Today we proudly present a solution for your cafe frustrations which has been made possible by the help and input of many cafes and even more coffee drinkers. We are dedicated to continue with our customer focused approach and thus would want to hear more of your valuable feedback. You can simply comment on Birdee by contacting us and or by rating our solution at the end of this post. A camera films the customer and we detect various unique face features. Applied machine learning algorithms recognise faces reliably and link them to customers' accounts. This enables an automated order and check-out process. Staff can spend time with the customer rather than fighting with the eftpos machine or collecting change. Furthermore, the generated database provides the cafe with never-seen-before opportunities to personalise and streamline their services. To all the coffee drinkers out there Get the personal approach and service you deserve and stop wasting time lining up and explaining what you want over and over again. Have you ever forgotten your loyalty card? With Birdee the cafe knows how often you visited them and what you ordered. Based on that they can tailor their offerings to YOUR particular wants. Get Muffins, Cookies, Sandwiches for free rather than the tenth coffee. Receive the treatment YOU deserve. To all the cafes out there Use Birdee to create a seamless customer experience across different locations, and independent from single employees. Speed up the ordering process and spend quality time with your valuable customers. Get to know your customers and offer individual loyalty rewards. Increase your sales, customer satisfaction, and customer base. All you need is a single camera that we install for free and our App that seamlessly integrates with your POS system. Moving forward, I would like to say thank you to everyone who made Birdee happen! Without your valuable feedback we would not have been able to proceed with our business as much as we have. Please never stop criticising us and continue to be part of our story and development cycles. Michael PS: If you are interested in using Birdee for your café or if you simply want to , contact us anytime (contact@birdee.solutions) or leave us a comment. (No Ratings Yet) Loading... Leave a Reply Cancel reply Birdee has taken a major leap in the last 3 months. We've gathered data, reached out to various customers and extended our research. Our product portfolio grew, and we have created a solution for Australia's offline retailers in the emergence of e-commerce companies such as Amazon. So, if you have been wondering where we were, we have been working hard behind the scenes to prepare ourselves for this particular moment. Online retailer Online retailers create extensive customer profiles which help them to provide each and every customer with personalised services and products. Moreover, there are no check-out lines and in many cases (digital goods) reception of goods and services is instant and the quality is always the same. Coupled with enhanced transparency and multiple feedback options, e-commerce developed into a real alternative to offline retailers. Bricks-and-mortar businesses Offline retailers have significant advantages over e-commerce businesses which are mainly based on personal treatment of customers. However, being friendly is not enough anymore and many businesses lost their advantages. Long lines at the check-out, generic approaches, inflexible solutions, and less transparency is not accepted anymore. The problem is that in many cases shop-floor staff doesn't know who their customer is and hence find it incredibly difficult to offer a service that is tailored to their specific needs. New technologies can help them to re-gain their competitive edge but three factors are ultimately determining the success. Total focus on the customer Technology must be easy to integrate The advantage of personal service must not be substituted Our solution for cafes We dug deeper into those aforementioned issues and focused on cafes and their consumers, the coffee drinkers. Research has shown that three main factors are vital to the success of a café. Consistent quality of Coffee Consistent quality of Service Fast serving times Unfortunately, cafes most of the time contravene these success factors by having lengthy ordering and check-out processes. Moreover, even regular customers have to repeat their orders; and lastly, many cafes have rigid \"buy ten get one for free\" loyalty programs no-one cares about. This is where Birdee fits in Today we proudly present a solution for your cafe frustrations which has been made possible by the help and input of many cafes and even more coffee drinkers. We are dedicated to continue with our customer focused approach and thus would want to hear more of your valuable feedback. You can simply comment on Birdee by contacting us and or by rating our solution at the end of this post. A camera films the customer and we detect various unique face features. Applied machine learning algorithms recognise faces reliably and link them to customers' accounts. This enables an automated order and check-out process. Staff can spend time with the customer rather than fighting with the eftpos machine or collecting change. Furthermore, the generated database provides the cafe with never-seen-before opportunities to personalise and streamline their services. To all the coffee drinkers out there Get the personal approach and service you deserve and stop wasting time lining up and explaining what you want over and over again. Have you ever forgotten your loyalty card? With Birdee the cafe knows how often you visited them and what you ordered. Based on that they can tailor their offerings to YOUR particular wants. Get Muffins, Cookies, Sandwiches for free rather than the tenth coffee. Receive the treatment YOU deserve. To all the cafes out there Use Birdee to create a seamless customer experience across different locations, and independent from single employees. Speed up the ordering process and spend quality time with your valuable customers. Get to know your customers and offer individual loyalty rewards. Increase your sales, customer satisfaction, and customer base. All you need is a single camera that we install for free and our App that seamlessly integrates with your POS system. Moving forward, I would like to say thank you to everyone who made Birdee happen! Without your valuable feedback we would not have been able to proceed with our business as much as we have. Please never stop criticising us and continue to be part of our story and development cycles. Michael PS: If you are interested in using Birdee for your café or if you simply want to , contact us anytime (contact@birdee.solutions) or leave us a comment. (No Ratings Yet) Loading... Birdee has taken a major leap in the last 3 months. We've gathered data, reached out to various customers and extended our research. Our product portfolio grew, and we have created a solution for Australia's offline retailers in the emergence of e-commerce companies such as Amazon. So, if you have been wondering where we were, we have been working hard behind the scenes to prepare ourselves for this particular moment. Online retailers create extensive customer profiles which help them to provide each and every customer with personalised services and products. Moreover, there are no check-out lines and in many cases (digital goods) reception of goods and services is instant and the quality is always the same. Coupled with enhanced transparency and multiple feedback options, e-commerce developed into a real alternative to offline retailers. Offline retailers have significant advantages over e-commerce businesses which are mainly based on personal treatment of customers. However, being friendly is not enough anymore and many businesses lost their advantages. Long lines at the check-out, generic approaches, inflexible solutions, and less transparency is not accepted anymore. The problem is that in many cases shop-floor staff doesn't know who their customer is and hence find it incredibly difficult to offer a service that is tailored to their specific needs. New technologies can help them to re-gain their competitive edge but three factors are ultimately determining the success. Total focus on the customer Technology must be easy to integrate The advantage of personal service must not be substituted Our solution for cafes We dug deeper into those aforementioned issues and focused on cafes and their consumers, the coffee drinkers. Research has shown that three main factors are vital to the success of a café. Consistent quality of Coffee Consistent quality of Service Unfortunately, cafes most of the time contravene these success factors by having lengthy ordering and check-out processes. Moreover, even regular customers have to repeat their orders; and lastly, many cafes have rigid \"buy ten get one for free\" loyalty programs no-one cares about. This is where Birdee fits in Today we proudly present a solution for your cafe frustrations which has been made possible by the help and input of many cafes and even more coffee drinkers. We are dedicated to continue with our customer focused approach and thus would want to hear more of your valuable feedback. You can simply comment on Birdee by contacting us and or by rating our solution at the end of this post. A camera films the customer and we detect various unique face features. Applied machine learning algorithms recognise faces reliably and link them to customers' accounts. This enables an automated order and check-out process. Staff can spend time with the customer rather than fighting with the eftpos machine or collecting change. Furthermore, the generated database provides the cafe with never-seen-before opportunities to personalise and streamline their services. To all the coffee drinkers out there Get the personal approach and service you deserve and stop wasting time lining up and explaining what you want over and over again. Have you ever forgotten your loyalty card? With Birdee the cafe knows how often you visited them and what you ordered. Based on that they can tailor their offerings to YOUR particular wants. Get Muffins, Cookies, Sandwiches for free rather than the tenth coffee. Receive the treatment YOU deserve. To all the cafes out there Use Birdee to create a seamless customer experience across different locations, and independent from single employees. Speed up the ordering process and spend quality time with your valuable customers. Get to know your customers and offer individual loyalty rewards. Increase your sales, customer satisfaction, and customer base. All you need is a single camera that we install for free and our App that seamlessly integrates with your POS system. Moving forward, I would like to say thank you to everyone who made Birdee happen! Without your valuable feedback we would not have been able to proceed with our business as much as we have. Please never stop criticising us and continue to be part of our story and development cycles. PS: If you are interested in using Birdee for your café or if you simply want to , contact us anytime (contact@birdee.solutions) or leave us a comment. Leave a Reply Cancel reply",
    "Did you know that you can save $6000 a year with a proper loyalty program? How to unlock loyalty Enter your e-mail for free loyalty e-book. BIRDEE'S SOLUTION We help retailers to create outstanding experiences for each and every customer by providing them with vision technologies and customised data analysis to personalise their services. Delighted customers will turn into recurring customers, which leads to increased profits and flourishing businesses. A camera films the customer and we detect various unique face features. Applied machine learning algorithms recognise faces reliably and link them to customers' accounts. This enables an automated order and check-out process. Staff can spend time with the customer rather than fighting with the eftpos machine or collecting change. Furthermore, the generated database provides the retailer with never-seen-before opportunities to personalise and streamline their services. Explore more by clicking on the respective tablets. User for more information Retailers for more information Development of service Traditionally, service was deemed a non-value adding task. However, it has transcended that stage and became an important factor of differentiation. In fact, many businesses don't offer products anymore and simply provide customers with outstanding services. A world with almost instant access to information has developed and recent artificial intelligence programs now try to humanize, personalize, and automate the shopping process. The focus shifted towards the customer, and how we can maximise benefits from technologies and interactions with the digital world. Recent developments enabled digital companies to create sophisticated profiles and provide customers with tailored offerings. How do bricks-and-mortar businesses keep up with that? THREE VITAL FACTS FOR RETAILERS Total focus on the customer Technology must be easy to integrate Personal care must be preserved Be the first to receive the latest news regarding advanced loyalty systems. Did you know that you can save $6000 a year with a proper loyalty program? How to unlock loyalty Enter your e-mail for free loyalty e-book. We help retailers to create outstanding experiences for each and every customer by providing them with vision technologies and customised data analysis to personalise their services. Delighted customers will turn into recurring customers, which leads to increased profits and flourishing businesses. A camera films the customer and we detect various unique face features. Applied machine learning algorithms recognise faces reliably and link them to customers' accounts. This enables an automated order and check-out process. Staff can spend time with the customer rather than fighting with the eftpos machine or collecting change. Furthermore, the generated database provides the retailer with never-seen-before opportunities to personalise and streamline their services. Explore more by clicking on the respective tablets. for more information for more information Traditionally, service was deemed a non-value adding task. However, it has transcended that stage and became an important factor of differentiation. In fact, many businesses don't offer products anymore and simply provide customers with outstanding services. A world with almost instant access to information has developed and recent artificial intelligence programs now try to humanize, personalize, and automate the shopping process. The focus shifted towards the customer, and how we can maximise benefits from technologies and interactions with the digital world. Recent developments enabled digital companies to create sophisticated profiles and provide customers with tailored offerings. How do bricks-and-mortar businesses keep up with that? THREE VITAL FACTS FOR RETAILERS Be the first to receive the latest news regarding advanced loyalty systems.",
    "Retail Birdee helps traditional retailers to create a unique shopping experience for customers. Facial recognition software is the backbone of modern loyalty and personalisation systems. Find out more Events Birdee helps event organisers to know who is at the venue and enables them to send out personalised offerings to each attendee. Facial recognition software is the new verification method for tickets. Find out more Access Whether you want to know who is in the office or if you want to be in full control of the people that are at your gym, facial recognition is the ultimate way to manage access to facilities. Find out more Be the first to receive the latest Birdee news, events and product updates. Birdee helps traditional retailers to create a unique shopping experience for customers. Facial recognition software is the backbone of modern loyalty and personalisation systems. Birdee helps event organisers to know who is at the venue and enables them to send out personalised offerings to each attendee. Facial recognition software is the new verification method for tickets. Whether you want to know who is in the office or if you want to be in full control of the people that are at your gym, facial recognition is the ultimate way to manage access to facilities. Be the first to receive the latest Birdee news, events and product updates."
  ]
}