{
  "company": "certn.co",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "SOLUTIONS API Income Verification Tenant Screening Credit Adjudication Next Generation Applicant Screening Platform Historically, applicant screening processes have not leveraged available data or artificial intelligence (AI) to effectively predict behavioural outcomes. With Certn, you can evaluate several dimensions of character, over millions of data points, to successfully determine an individual's credibility, and their fit in your organization. Reduce risk of damage and default Create effective loyalty incentive programs Predict defaults and vacancies Increase approvals NOT defaults Derisk underbanked and thin filed applicants Create a new standard; compliant with FCRA, PIPEDA & Fair Housing Regulations Automate the application process Make real-time risk and marketing decisions Meet CLAIRE - Artificial Intilligence A firm handshake, solid eye contact, and a polished appearance are all considered surface-level indications of an individual's trustworthiness and reliability. However, we recognize that a deeper, multi-dimensional perspective is necessary in order to determine credibility, performance, and fit. With CLAIRE, Certn goes beyond superficial appearances to create the market's most comprehensive applicant profiles. Our profiles are used for tenant screening, pre-employment screening, credit adjudication, and more. It's easy to start right away! Get the Best Applicants, Reduce Risk of Bad Hires, Damage and Default, Automate On-boarding Click to apply for an account or talk to your account representative about how Certn can integrate our solutions with your website, and other software platforms. Go beyond the credit bureau and easily customize Certn to meet your needs. Securely collect applicant history, employment details and financial information to verify identity, income, and employment. Select the Most Valuable Applicants Gain access to your applicants' social and behavioural scores, get in depth insights into applicant credibility and avoid unsuccessful applicants . We guarantee the quality of the applicants we recommend. If we recommend an applicant and they don't work out, let us know and we'll refund the cost. [fa icon=\"phone\"] +1 844 82C-ERTN (2-3786) [fa icon=\"home\"] 838 Fort Street, Victoria, BC [fa icon=\"home\"] 548 King St W #202, Toronto, ON [fa icon=\"facebook-square\"] [fa icon=\"linkedin-square\"] [fa icon=\"twitter-square\"] SOLUTIONS API Income Verification Tenant Screening Credit Adjudication"
  ]
}