{
  "company": "churchix.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 24
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 24
  },
  "topic_timeline": {
    "20": {
      "0": 24
    }
  },
  "sample_docs": [
    "Identify Members Attending Your Events Use Face Recognition to Measure Attendance Get to Know your Members Sort and Assign Photos to each Event Facial Recognition Software by Churchix for Biometric Attendance Facial Recognition Software – Churchix Facial recognition software by Churchix identifies people in videos and photos. This biometric attendance system identifies members, suspects, employees, students and basically anyone you have interest in. All you need to do is enroll photos of your members into the software, then connect a live video USB and/or IP camera and Churchix facial recognition software will identify your members! You can also upload recorded videos or photos. Churchix facial recognition software is designed for Churches, Classrooms, T&A and basically for anyone who wants to save the pain of manually tracking attendance. First of its kind, Churchix face scanner provides you with accurate data on event attending members in your events and services. The software also allows you to sort and manage your videos and photos. What are Reference Photos in a Face Recognition Software? Facial recognition software requires reference photos, and Churchix is no different. Reference Photos are the photos of your members which you enroll into the data base of Churchix. Reference photos serve as an anchor and therefore should be of high quality. You can think of them as high quality passport photos. The enrollment and registration are done automatically and Churchix allows you to manually edit each member details. – Sharp image – Lighting is spread evenly on the face, without any hot spots – Size: Minimum of 50 pixels between the eyes – Visible frontal face pose with no more than +/- 15 degrees from frontal position – No facial expression What are Probe Photos in a Facial Recognition Software? Probe Photos are the photos coming from an event either as still images or video frames, and they are fed into Churchix face recognition software. The probe photos are matched against the reference photos. Naturally, probe photos have lower quality since they are sometimes taken in the field in dynamic conditions. If you manage to obtain high quality probe photos your accuracy results will be great! For more details on facial recognition software photos please refer to our photo guide. In order to achieve high accuracy, you need to locate the camera where it would capture fully frontal visible faces. Of course by zooming in you will lose range, but you will gain high quality images. Don't forget to make sure your lighting conditions are good. Also, do some testing and adjust the camera location / zoom until you find the best spot for high accuracy. Churchix can work with any camera type, however if you run Churchix under a surveillance mode, we recommend you use GigE cameras. GigE cameras transmit uncompressed video which keeps maximum face data, and handle motion bluriness very well. Facial recognition software requires decent face images in order to guarantee high accuracy and Churchix is no different. Who is it for? Churchix is designed for churches, classrooms, hotels, T&A and event attendance, and for tracking suspects and criminals. it can be used by event managers who want to track event attendance, or by anyone who wants to identify known guests from live or recorded video. If you are looking for another face recognition solution please visit Face-Six . 1. Enrol People into Churchix's DB faical recognition software by Churchix 1. Enrol People into Churchix's DB faical recognition software by Churchix 2. Upload Videos or Photos of Members Face Recognition Software 2. Upload Videos or Photos of Members Face Recognition Software 2. Upload Videos or Photos of Members 3. Churchix Identifies their Faces facial recognition software 3. Churchix Identifies their Faces Additional Face Recognition Applications Face recognition software can be used to meet many use cases, and event attendance is just one of them. Face recognition software can be found in various markets including the retail market, security market, classrooms, time and attendance for work, logical and physical access control and many more. A good example is our Face Recognition App which can be used to identify suspects or for T&A. Her'es a quick breakdown of the different uses cases in each market segment: + Age, Gender & Ethnicity Analysis + Repeated Clients Recognition + Known Suspects Recognition + Unknown Suspects Recognition + Classroom Attendance Registration + Time and Attendance at Work Logical Access Control Market (Financial) + Online Account Login Physical Access Control Market",
    "Video Tutorials – Churchix Face Recognition Software * Following are a couple of raw cut tutorials from our brilliant engineer 🙂 * More cool tutorials are coming soon! * Tutorial – Video Capabilities of Churchix * Tutorial – Photo Capabilities of Churchix Copy and paste this URL into your WordPress site to embed Copy and paste this code into your site to embed",
    "Identify Members Attending Your Events Use Face Recognition to Measure Attendance Get to Know your Members Sort and Assign Photos to each Event Video Tutorials – Churchix Face Recognition Software * Following are a couple of raw cut tutorials from our brilliant engineer 🙂 * More cool tutorials are coming soon! * Tutorial – Video Capabilities of Churchix * Tutorial – Photo Capabilities of Churchix",
    "Face Recognition Software Features Face Recognition Software Churchix face recognition software allows you to: Enrol members into your data base, either one by one or as a group of photos Manage and edit your data base in Churchix face recognition software Identify members from live video USB or IP cameras Identify members from recorded video files, and from still photos (single or batch) Accept or reject identifications, and manually update attendance when necessary Receive identification reports for a specific event, group of events and attendance of a specific member Receive demographic data of people attending your event (Gender, Age) Screenshots of Churchix Face Scanner Add a groups of members automatically You can also add additional members one by one Add and edit a single member Members list view Upload Event's Photos & Run Face Recognition Software based Process against your members list. (With just a single click Churchix matches all of the faces in your event's photos) Churchix lets you know who attended and who's absent Face Recognition based Event Attendance Tracking Like No Other. See the attendance to a specific event or to a group of events between dates. Face Scanner Software of Churchix allows you to see who attended a specific event or a … Continue reading Face Recognition Software Features Copy and paste this URL into your WordPress site to embed Copy and paste this code into your site to embed",
    "Identify Members Attending Your Events Use Face Recognition to Measure Attendance Get to Know your Members Sort and Assign Photos to each Event Churchix face recognition software allows you to: Enrol members into your data base, either one by one or as a group of photos Manage and edit your data base in Churchix face recognition software Identify members from live video USB or IP cameras Identify members from recorded video files, and from still photos (single or batch) Accept or reject identifications, and manually update attendance when necessary Receive identification reports for a specific event, group of events and attendance of a specific member Receive demographic data of people attending your event (Gender, Age) Screenshots of Churchix Face Scanner Add a groups of members automatically You can also add additional members one by one Add and edit a single member Upload Event's Photos & Run Face Recognition Software based Process against your members list. (With just a single click Churchix matches all of the faces in your event's photos) Churchix lets you know who attended and who's absent Face Recognition based Event Attendance Tracking Like No Other. See the attendance to a specific event or to a group of events between dates. Face Scanner Software of Churchix allows you to see who attended a specific event or a group of events. Facial Recognition Statistics allows you to see the average attendance of specific members in details"
  ]
}