{
  "company": "corporate.glory-global.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 40,
    "-1": 16
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.819672131147541,
    "framing_surveillance": 0.0163934426229508,
    "framing_market": 0.1639344262295081,
    "num_docs": 56
  },
  "topic_timeline": {
    "20": {
      "-1": 16,
      "0": 40
    }
  },
  "sample_docs": [
    "Long-Term Vision and Medium-Term Management Plan Long-Term Vision 2028 and 2023 Medium-Term Management Plan Long-Term Vision 2028 2023 Medium-Term Management Plan Past Medium-Term Management Plan Long-Term Vision 2028 Aim of Long-Term Vision 2028 It is expected that drastic changes will occur imminently in the business environment surrounding the Company and its group companies. These include emergence of new payment mechanisms and digital currencies realized by adoption of rapidly advancing technology, population increase centered in the emerging economies, and rapid acceleration of population aging in Japan. Taking these changes as an opportunity, we aim to deliver renewed value to the society in the \"Long-Term Vision 2028\". To achieve this goal, we will endeavor to create next-generation products and services through advancement of the core technologies built in the development of cash handling machines and promotion of open innovation. Long-Term Vision 2028 We enable a confident world Safe and secure transactions are critical to your business, and your customers. We deliver secure, efficient payment systems and instant, highly accurate identity verification and authentication solutions that enable confidence in transactions and other interactions between businesses and people. Our innovative technologies, our experienced professionals and our commitment to the success of our customers, partners and communities create a safe, confident path forward. We are Glory –we enable a confident world for a better tomorrow. Long-Term Performance Target (Fiscal 2027) Consolidated net sales: approx. 500 billion yen Business Domains Technologies and Functions 1. Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership 2. Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies Culture and Organization News Release (April 2, 2018) (112KB) Supplementary Explanation (April 2, 2018) (1,200KB) 2023 Medium-Term Management Plan About Concept Direction of Growth Strategy Basic Policy / Performance Targets Basic Policy / Key Initiatives Performance Target by Business Segment Overseas Business Strategy Domestic Business Strategy New business domain Capital and Financial Strategies / Investment Plan Shareholder Returns News Release (122KB) Presentation Material (1,203KB) Past Long-Term Vision and Medium-Term Management Plan 2020 Medium-Term Management Plan [FY2018-FY2020] Notice concerning GLORY's new Medium-Term Management Plan (May 10, 2018) (111KB) [Presentation Material] The 2017 Medium-Term Management Plan (May 10, 2018) (544KB) 2017 Medium-Term Management Plan [FY2015-FY2017] Notice concerning GLORY's new Medium-Term Management Plan (May 12, 2015) (151KB) [Presentation Material] The 2017 Medium-Term Management Plan (May 18, 2015) (1,001KB) Long-Term Vision 2018 [FY2012-FY2018] The Long-Term Vision 2018 (Revised) (May 10, 2013) (109KB) The Long-Term Vision 2018 (Original Plan) (February 27, 2012) (110KB) 2014 Medium-Term Management Plan [FY2012-FY2014] Notice of Revision to the Medium-Term Management Plan (November 5, 2012) (56KB) [Presentation Material] The 2014 Medium-Term Management Plan (Revised) (November 19, 2012) (321KB) Long-Range Vision and New Medium-Term Management Plan (Original Plan) (February 27, 2012) (99KB) [Presentation Material] The 2014 Medium-Term Management Plan (Original Plan) (March 7, 2012) (254KB) 2011 Medium-Term Management Plan [FY2009-FY2011] [Presentation Material] 2011 Medium-Term Management Plan (May 11, 2009) (231KB) Related Links Business Fields Annual Reports PDF Files require Adobe® Reader® software which is a free download from the Adobe site Adobe Reader Long-Term Vision 2028 and 2023 Medium-Term Management Plan 2023 Medium-Term Management Plan Past Medium-Term Management Plan Aim of Long-Term Vision 2028 It is expected that drastic changes will occur imminently in the business environment surrounding the Company and its group companies. These include emergence of new payment mechanisms and digital currencies realized by adoption of rapidly advancing technology, population increase centered in the emerging economies, and rapid acceleration of population aging in Japan. Taking these changes as an opportunity, we aim to deliver renewed value to the society in the \"Long-Term Vision 2028\". To achieve this goal, we will endeavor to create next-generation products and services through advancement of the core technologies built in the development of cash handling machines and promotion of open innovation. Safe and secure transactions are critical to your business, and your customers. We deliver secure, efficient payment systems and instant, highly accurate identity verification and authentication solutions that enable confidence in transactions and other interactions between businesses and people. Our innovative technologies, our experienced professionals and our commitment to the success of our customers, partners and communities create a safe, confident path forward. We are Glory –we enable a confident world for a better tomorrow. Long-Term Performance Target (Fiscal 2027) 1. Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership 2. Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies News Release (April 2, 2018) (112KB) Supplementary Explanation (April 2, 2018) (1,200KB) 2023 Medium-Term Management Plan Direction of Growth Strategy Basic Policy / Performance Targets Basic Policy / Key Initiatives Performance Target by Business Segment Capital and Financial Strategies / Investment Plan Past Long-Term Vision and Medium-Term Management Plan 2020 Medium-Term Management Plan [FY2018-FY2020] 2017 Medium-Term Management Plan [FY2015-FY2017] Long-Term Vision 2018 [FY2012-FY2018] 2014 Medium-Term Management Plan [FY2012-FY2014] 2011 Medium-Term Management Plan [FY2009-FY2011] Related contents About GLORY News Releases Corporate Governance Recommended contents virtual gallery GLORY by numbers New Zealand / English Long-Term Vision and Medium-Term Management Plan",
    "Policies concerning Disclosure of Information and Constructive Dialogues with Shareholders and Investors Basic Policy GLORY (the \"Company\") commits to \"communicating with stakeholders and striving for appropriate information disclosure\" in its Corporate Action Guidelines. Based on this stance, the Company is dedicated to increasing the transparency in its management through quick, accurate and fair means of providing the latest corporate information and to gaining a better understanding of its management policies and business activities through constructive dialogues, thereby building long-term relationships of trust with shareholders and investors. 1. Disclosure Policy Information disclosure a. Information disclosure standards The Company discloses its corporate information in accordance with the Companies Act, Financial Instruments and Exchange Act and other laws and regulations as well as with the timely disclosure rules of the Tokyo Stock Exchange (the \"timely disclosure rules\"), where the Company's stock is listed. Also, with respect to the information that is not covered by the timely disclosure rules, including non-financial information, the Company endeavors to voluntarily disclose such information taking into consideration the timeliness and fairness of information disclosure, to the extent that the Company believes such disclosure is useful for shareholders and investors to reach investment decisions. b. Methods of disclosure In disclosing the corporate information covered by the timely disclosure rules, the Company utilizes the Timely Disclosure Network (TDnet) service provided by the Tokyo Stock Exchange. Also, all corporate information disclosed through TDnet is posted on the Company's website immediately after TDnet disclosure. Furthermore, with respect to the information not covered by the timely disclosure rules, the Company endeavors to ensure that such information is disseminated with accuracy and fairness through suitable method. c. Procedures for disclosure The company has established a Disclosure Committee to facilitate timely and appropriate disclosure of corporate information. The Committee is chaired by the Chief Information Officer and comprises the managers of several departments to enable cross-sectoral discussions. The internal procedures for disclosures are as follows: upon occurrence of any \"corporate decision\", \"facts\" or \"earnings results\" (as defined in the timely disclosure rules) concerning the Company or its subsidiaries that could affect investment judgments by shareholders and investors, the Disclosure Committee holds a deliberation about whether to disclose the information and about the timeliness and appropriateness of such disclosure, after which the Company will make disclosure following a resolution of the Board of Directors. Any information that would require urgent disclosure may be disclosed with an approval of the Company president, provided that, upon disclosure, the president will notify the Board of Directors of the contents and the background of the disclosure. d. Management of insider information The Company enforces strict control over confidential information based on its internal rules concerning insider information to prevent external leaks of such information and insider trading. Handling of information on earnings forecast and future outlook Whenever the Company announces earnings forecasts, future prospects and other forward-looking information, such announcement will be made with cautionary statements to the effect that such information is based on the facts currently available to the company and certain assumptions which the Company regards as legitimate; it includes known or unknown risks and uncertainties; and a number of factors could cause actual results to differ materially from those described in such forward-looking statements. Quiet period For the purpose of preventing leaks of information on financial results, the Company observes a quiet period from the day following the end of each fiscal quarter until the announcement of financial results for such quarter. During the quiet period, the Company refrains from answering any questions or having interviews involving financial results in the applicable financial period. However, if there was an event covered by the timely disclosure rules during the quiet period, disclosure will be made as to such event in accordance with the rules. 2. Constructive Dialogues The Company endeavors to streamline and consolidate its framework, and implements activities, for constructive dialogues with shareholders and investors with the aim of ensuring continued growth of the Company and enhancing its corporate value on a medium and long-term basis, as follows; The officer in charge of investor relations (the \"IR officer\") supervises all activities involving the dialogues. Also, a specialized department (\"IR department\") is established to take charge of conducting dialogues and coordinating with various sections assisting the dialogues, such as corporate planning, accounting and finance, and legal affairs. All requests from shareholders and investors for meetings are complied with by the IR officer or other executives, or the head of IR department or IR staff, depending on the purposes of requested meetings. To increase opportunities for constructive dialogues, the Company proactively plans various events, such as, holding investor information meetings in which the company president and the IR officer will make presentations, arranging meetings with Japanese and foreign investors, and hosting showroom and factory tours after shareholders meetings. The IR officer shares opinions and requests received from shareholders and investors with other executives at the Board of Directors meetings and in other appropriate opportunities. For recent financial information and other IR materials, please contact us. Contact Us Related Links News Releases Financial Results / Materials for Investor Conferences GLORY (the \"Company\") commits to \"communicating with stakeholders and striving for appropriate information disclosure\" in its Corporate Action Guidelines. Based on this stance, the Company is dedicated to increasing the transparency in its management through quick, accurate and fair means of providing the latest corporate information and to gaining a better understanding of its management policies and business activities through constructive dialogues, thereby building long-term relationships of trust with shareholders and investors. Information disclosure a. Information disclosure standards The Company discloses its corporate information in accordance with the Companies Act, Financial Instruments and Exchange Act and other laws and regulations as well as with the timely disclosure rules of the Tokyo Stock Exchange (the \"timely disclosure rules\"), where the Company's stock is listed. Also, with respect to the information that is not covered by the timely disclosure rules, including non-financial information, the Company endeavors to voluntarily disclose such information taking into consideration the timeliness and fairness of information disclosure, to the extent that the Company believes such disclosure is useful for shareholders and investors to reach investment decisions. b. Methods of disclosure In disclosing the corporate information covered by the timely disclosure rules, the Company utilizes the Timely Disclosure Network (TDnet) service provided by the Tokyo Stock Exchange. Also, all corporate information disclosed through TDnet is posted on the Company's website immediately after TDnet disclosure. Furthermore, with respect to the information not covered by the timely disclosure rules, the Company endeavors to ensure that such information is disseminated with accuracy and fairness through suitable method. c. Procedures for disclosure The company has established a Disclosure Committee to facilitate timely and appropriate disclosure of corporate information. The Committee is chaired by the Chief Information Officer and comprises the managers of several departments to enable cross-sectoral discussions. The internal procedures for disclosures are as follows: upon occurrence of any \"corporate decision\", \"facts\" or \"earnings results\" (as defined in the timely disclosure rules) concerning the Company or its subsidiaries that could affect investment judgments by shareholders and investors, the Disclosure Committee holds a deliberation about whether to disclose the information and about the timeliness and appropriateness of such disclosure, after which the Company will make disclosure following a resolution of the Board of Directors. Any information that would require urgent disclosure may be disclosed with an approval of the Company president, provided that, upon disclosure, the president will notify the Board of Directors of the contents and the background of the disclosure. d. Management of insider information The Company enforces strict control over confidential information based on its internal rules concerning insider information to prevent external leaks of such information and insider trading. a. Information disclosure standards The Company discloses its corporate information in accordance with the Companies Act, Financial Instruments and Exchange Act and other laws and regulations as well as with the timely disclosure rules of the Tokyo Stock Exchange (the \"timely disclosure rules\"), where the Company's stock is listed. Also, with respect to the information that is not covered by the timely disclosure rules, including non-financial information, the Company endeavors to voluntarily disclose such information taking into consideration the timeliness and fairness of information disclosure, to the extent that the Company believes such disclosure is useful for shareholders and investors to reach investment decisions. b. Methods of disclosure In disclosing the corporate information covered by the timely disclosure rules, the Company utilizes the Timely Disclosure Network (TDnet) service provided by the Tokyo Stock Exchange. Also, all corporate information disclosed through TDnet is posted on the Company's website immediately after TDnet disclosure. Furthermore, with respect to the information not covered by the timely disclosure rules, the Company endeavors to ensure that such information is disseminated with accuracy and fairness through suitable method. c. Procedures for disclosure The company has established a Disclosure Committee to facilitate timely and appropriate disclosure of corporate information. The Committee is chaired by the Chief Information Officer and comprises the managers of several departments to enable cross-sectoral discussions. The internal procedures for disclosures are as follows: upon occurrence of any \"corporate decision\", \"facts\" or \"earnings results\" (as defined in the timely disclosure rules) concerning the Company or its subsidiaries that could affect investment judgments by shareholders and investors, the Disclosure Committee holds a deliberation about whether to disclose the information and about the timeliness and appropriateness of such disclosure, after which the Company will make disclosure following a resolution of the Board of Directors. Any information that would require urgent disclosure may be disclosed with an approval of the Company president, provided that, upon disclosure, the president will notify the Board of Directors of the contents and the background of the disclosure. d. Management of insider information The Company enforces strict control over confidential information based on its internal rules concerning insider information to prevent external leaks of such information and insider trading. Handling of information on earnings forecast and future outlook Whenever the Company announces earnings forecasts, future prospects and other forward-looking information, such announcement will be made with cautionary statements to the effect that such information is based on the facts currently available to the company and certain assumptions which the Company regards as legitimate; it includes known or unknown risks and uncertainties; and a number of factors could cause actual results to differ materially from those described in such forward-looking statements. Whenever the Company announces earnings forecasts, future prospects and other forward-looking information, such announcement will be made with cautionary statements to the effect that such information is based on the facts currently available to the company and certain assumptions which the Company regards as legitimate; it includes known or unknown risks and uncertainties; and a number of factors could cause actual results to differ materially from those described in such forward-looking statements. Quiet period For the purpose of preventing leaks of information on financial results, the Company observes a quiet period from the day following the end of each fiscal quarter until the announcement of financial results for such quarter. During the quiet period, the Company refrains from answering any questions or having interviews involving financial results in the applicable financial period. However, if there was an event covered by the timely disclosure rules during the quiet period, disclosure will be made as to such event in accordance with the rules. For the purpose of preventing leaks of information on financial results, the Company observes a quiet period from the day following the end of each fiscal quarter until the announcement of financial results for such quarter. During the quiet period, the Company refrains from answering any questions or having interviews involving financial results in the applicable financial period. However, if there was an event covered by the timely disclosure rules during the quiet period, disclosure will be made as to such event in accordance with the rules. The Company endeavors to streamline and consolidate its framework, and implements activities, for constructive dialogues with shareholders and investors with the aim of ensuring continued growth of the Company and enhancing its corporate value on a medium and long-term basis, as follows; The officer in charge of investor relations (the \"IR officer\") supervises all activities involving the dialogues. Also, a specialized department (\"IR department\") is established to take charge of conducting dialogues and coordinating with various sections assisting the dialogues, such as corporate planning, accounting and finance, and legal affairs. All requests from shareholders and investors for meetings are complied with by the IR officer or other executives, or the head of IR department or IR staff, depending on the purposes of requested meetings. To increase opportunities for constructive dialogues, the Company proactively plans various events, such as, holding investor information meetings in which the company president and the IR officer will make presentations, arranging meetings with Japanese and foreign investors, and hosting showroom and factory tours after shareholders meetings. The IR officer shares opinions and requests received from shareholders and investors with other executives at the Board of Directors meetings and in other appropriate opportunities. For recent financial information and other IR materials, please contact us. Financial Results / Materials for Investor Conferences Related contents About GLORY News Releases Corporate Governance Recommended contents virtual gallery GLORY by numbers New Zealand / English Policies concerning Disclosure of Information and Constructive Dialogues with Shareholders and Investors",
    "We established our group-wide risk management system in fiscal 2018, with the Risk Management Committee playing a central role in setting priority initiatives and strengthening countermeasures, as well as reporting information on its activities to the Board of Directors. Forward-looking statements in the text below are based on the Group's judgments at the date of submission of the latest Annual Securities Report and are not limited to business and other risks. Classification Category Content Business Environment Rapid development of cashless economy/Strong reliance on cash handling machines The Group is working to expand its new business domain, including such non-cash areas such as the DMP business. However, should the cashless economy develop drastically and globally in a short period of time (e.g., due to the issuance of digital currencies by central banks) before the Group's new business domain matures, the Group's performance could be adversely affected. [Countermeasures] Under its 2026 Medium-Term Management Plan, the Group will focus on the retail/financial and food and beverage (F&B) markets as its target markets. Here, the Group will drive customers' digital transformation (DX) with best-in-class products and software platforms to expand its new business domain. Overseas business conditions The Group is actively expanding its business in overseas markets. However, we face geopolitical risks, including the impact on business activities on changes in international conditions, such as the outbreak or intensification of war or conflict. In addition, unprecedented fluctuations in foreign exchange rates and interest rates, as well as infringements of intellectual property, could adversely affect the Group's performance. [Countermeasures] To advance its operations, the Group will formulate and implement medium- and long-term business and production strategies to reduce the impact of growing geopolitical risks around the world, take foreign exchange hedging measures to prepare for exchange rate fluctuations, and engage in intellectual property activities that are directly linked to future business creation and earnings. Laws and regulations of countries and regions where the Group operates The Group is subject to business permits and import and export regulations, as well as various laws and regulations, in the countries and regions where it operates. Should these laws and regulations be revised or repealed, or if new public regulations were to be established, or if any other special factors influencing the market environment were to arise, the Group's performance could be adversely affected. [Countermeasures] The Group will monitor changes to laws and regulations in each country where it does business, identify operations subject to such regulations, assess risks, implement countermeasures, and educate employees. Intensified competition Competition in the Group's business areas is intensifying. In this environment, other companies may release competitive new products and services or engage in aggressive sales activities, including significant price reductions, that might cause a shift in demand to lower-priced products. Any of these factors could adversely affect the Group's performance. [Countermeasures] The Group enables confidence by providing comprehensive solutions that drive customers' digital transformation (DX) with best-in-class products and software platforms combined. In this ways, we aim to be a partner company that creates the future together with our customers. Strategic investments The Group strategically allocates its management resources to expanding core businesses and creating new ones, with the aim of constantly improving corporate value over the medium to long term. As of March 31, 2024, goodwill and customer relationships amounted to ¥84,171 million and ¥26,838 million, respectively, and accounted for 18.0% and 5.7% of total consolidated assets, respectively. These intangible assets are subject to impairment assessment, and if the Group does not achieve expected outcomes due to changes in the business environment, it might incur impairment losses that could adversely affect its performance. In addition, if an investee company that has become an entity accounted for using equity method fails to fulfill its business plan, it might incur Share of loss of entities accounted for using equity method, which could affect the Group's performance. [Countermeasures] In accordance with the rules of the Strategic Investment Committee, the Group periodically evaluates conditions surrounding its investee companies' business operations and reports the results to the Board of Directors and other relevant bodies. In these ways, we ensure proper post-investment management and promote growth strategies in line with the scenario at the time of investment. Supply Chain Natural disasters and/or accidents may result in suspension or interruption of suppliers' production, while a breakdown in the supply–demand balance for semiconductors, raw materials, and other products may lead to delays in product deliveries. Any of these factors could impact the Group's production activities and adversely affect its performance. In addition, inflation and other factors that raise the prices of parts and raw materials might increase the Group's business costs and affect its performance. [Countermeasures] The Group endeavors to switch to parts and raw materials with higher availability and place advance orders based on medium-term sales forecasts for semiconductors and other electrical components for which a supply-demand imbalance is expected to occur. In these ways, we strive to ensure stable procurement of parts and materials. Securing human resources The Group conducts business activities on a global scale and employs people with a diverse range of nationalities, values, and expertise. Its medium- to long-term growth is highly dependent on these human resources. As such, the Group's performance could be adversely affected if it fails to attract and foster talented human resources, especially experts in digital transformation who are indispensable to expanding its new business domain, according to its medium- to long-term plans. [Countermeasures] The Group has designated development of human capital as the source of its competitive edge and the objective of its human resources strategy. To improve employee engagement, we work to foster human resources who promote growth of individuals and the Company, enhance employee satisfaction with a focus on health and productivity management, promote diversity, and respect human rights. In these ways, we strive to recruit and develop talented human resources, especially DX specialists. Business Operation Intellectual property rights The Group constantly conducts research on the products of other companies to prevent infringements by its products on the material intellectual property rights of third parties, as well as those by third parties' products on the Group's intellectual property rights. As an R&D-based enterprise, however, the Group might experience intellectual property disputes with other companies. If such disputes were to materialize, the Group's performance could be adversely affected. [Countermeasures] Our IP department and operations divisions work together to engage in IP landscaping, which shows the Group's market position in of intellectual property. By also monitoring the intellectual property rights of third parties, we seek to reduce the risk of intellectual property disputes. Information security The Group considers it essential to prevent leakages of personal and confidential corporate information. Based on this, the Group has taken various measures, such as formulating regulations, conducting thorough in-house training, and establishing an information security system. In the event of an information leakage, however, the Group might not only suffer a loss of credibility but also be liable for damages to customers and other parties. Because information systems are playing an increasingly important roles in the Group's business activities, moreover, the risk of business activity stoppage due to unauthorized access is also increasing. In July 2023, unauthorized access by a third party to a server managed by the Group was discovered. [Countermeasures] To minimize such occurrences, our newly established Group CISO spearheads efforts to control information security governance and works continuously to ensure rigorous employee training and continuously strengthen various measures, including monitoring of system operation status. Quality of products and services The products and services provided by the Group are required to operate in a reliable manner, such as in the case of cash handling at financial institutions and retail stores. To this end, the Group focuses on providing highly reliable products by verifying quality and safety at each stage, including product design, evaluation, component procurement, and manufacturing. In maintenance services, the Group works to prevent serious product quality and safety issues by conducting regular inspections. However, unexpected quality problems might occur during the development, production, and maintenance service processes, such as uncertainties associated with sophisticated product and service functions. Any of these factors could adversely affect the Group's performance. [Countermeasures] In the event of a quality problem or defect that may violate laws and regulations, the Group has established a system to ensure that information reaches the chief in charge of management promptly so that there is no delay in addressing the issue. Fundraising The Group raises funds for its business activities through internal funds, borrowings from financial institutions, and the issuance of bonds. However, interest rate hikes to counter inflation, mainly in the United States and Europe, as well as downgrades of our credit rating by rating agencies, might increase the cost of fundraising and adversely affect the Group's performance. [Countermeasures] The Group strives to reduce liquidity risk by updating its cash management plan in a timely manner and diversifying its financing sources, which include bank borrowings and bond issues. Environment Climate change The Group views climate change as an urgent issue and is working to reduce greenhouse gas (GHG) emissions from its business activities and develop environmentally friendly products. If the requirements and demands of various countries exceed expectations, however, transition risk might increase, leading to higher procurement costs due to investment in energy-saving/renewable energy facilities and the introduction of carbon taxes, emission trading schemes, and the like, as well as lost sales opportunities and decreased corporate value stemming from damage to the corporate brand, which could adversely affect the Group's performance. In addition, physical risks might increase due to abnormal weather conditions, such as typhoons and torrential rains, which have been on the rise due to climate change. Any of these factors could cause damage to the Group's own factories and employees or suspension of operations of parts suppliers, which could restrict the Group's business activities and adversely affect its performance. [Countermeasures] The Group has positioned reduction of GHG emissions as one of its most important sustainability issues. Since the start of 2026 Medium-Term Management Plan, we have expanded the coverage of our GHG reduction targets (Scope 1 and 2) to a global scale (including overseas consolidated subsidiaries) and subject them to Science Based Targets (SBT) standards. We are now working hard to achieve those targets. In addition, we have endorsed the recommendations of the Task Force on Climate-related Financial Disclosure (TCFD) and are promoting its efforts, and we will continue enhancing our disclosures in line with TCFD recommendations. Internal Control Internal Control To ensure the accuracy of financial reporting, the Group strives to strengthen its internal control system by documenting operational processes and conducting rigorous internal audits. Even if the Group's internal control system is effective, however, it might cease to function properly in the event of operational errors or fraud on the part of employees or others. Any of these events might require the Group to revise its financial information, which could adversely affect its performance and/or financial position. [Countermeasures] In response to the embezzlement at a domestic subsidiary uncovered in February 2022, the Group is strengthening its internal controls and the governance systems of all subsidiaries by strictly enforcing accounting- and finance-related rules and cash and deposit management, while taking other measures to prevent recurrence. We are also working to instill and ensure thorough compliance awareness. Related contents About GLORY News Releases Corporate Governance Recommended contents virtual gallery GLORY by numbers New Zealand / English",
    "Site Map Home News About GLORY GLORY at a Glance Message from the President Philosophy Corporate Governance Management Technologies Recognition/Identification Mechatronics Global Network History News Releases Video Library Business Fields Investor Relations Message from the President Management Policies Long-term Vision2028 Business Portfolio Risk Factors Policies concerning Disclosure of Information and Constructive Dialogues Financial Highlights Financial Information Financial Results / Materials for Investor Conferences Long-Term Vision / Medium-Term Management Plan Integrated Report Fact Book Overview of Our Business IR Calendar IR News Stock Information Shareholders' Meetings IR E-mail Service Sustainability Message from the President GLORY's Sustainability Approach Sustainability Management Our Approach to Sustainability and Related Policies Key Sustainability Issues Major Initiatives in the Value Chain Stakeholder Engagement Environment Environmental Vision and Environmental Policy Environmental Management Addressing Climate Change Eco Factories/Eco Offices Eco Products Preserving Biodiversity Medium-Term Environmental Plan Social Supply Chain Management Respecting Human Rights Human Resources Working Environment Social Initiatives GLORY Foundation for Elementary School Students Governance Corporate Governance Risk Management Compliance Responsibility to Shareholders and Investors Message from Outside Directors Business Portfolio Technologies/Quality/IP Technologies Quality Concept Intellectual Property ESG Survey Index ESG Data Guideline Comparison Table Editorial Policy/CSR Report Back Issues Activity Highlights Evaluation by Society Sustainability News Contact Us of Use Site Map About RSS Policies concerning Disclosure of Information and Constructive Dialogues Financial Results / Materials for Investor Conferences Long-Term Vision / Medium-Term Management Plan Overview of Our Business Our Approach to Sustainability and Related Policies Major Initiatives in the Value Chain Environmental Vision and Environmental Policy GLORY Foundation for Elementary School Students Responsibility to Shareholders and Investors Message from Outside Directors New Zealand / English",
    "Scroll It is expected that drastic changes will occur imminently in the business environment surrounding the Company and its group companies. These include emergence of new payment mechanisms and digital currencies realized by adoption of rapidly advancing technology, population increase centered in the emerging economies, and rapid acceleration of population aging in Japan. Taking these changes as an opportunity, we aim to deliver renewed value to the society in the \"Long-Term Vision 2028\". To achieve this goal, we will endeavor to create next-generation products and services through advancement of the core technologies built in the development of cash handling machines and promotion of open innovation. We enable a confident world Safe and secure transactions are critical to your business, and your customers. We deliver secure, efficient payment systems and instant, highly accurate identity verification and authentication solutions that enable confidence in transactions and other interactions between businesses and people. Our innovative technologies, our experienced professionals and our commitment to the success of our customers, partners and communities create a safe, confident path forward. Glory Group Vision 5 Megatrends: How Glory commits to embrace future opportunities 5 Megatrends: How Glory commits to embrace future opportunities Based on 5 identified megatrends, we recognize the demand for a new business domain that addresses emerging challenges and opportunities for the society of the future. Trusted, reliable and more efficient payment systems as well as instantaneous and highly accurate identity verification and authentication solutions will be increasingly required everywhere. We will create confidence across society through our innovative solutions and services and build trust throughout the world. We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. Reliable solutions 01 Provide various methods of payments Reliable solutions 02 Cash management rationalization and labor savings Reliable solutions 03 Currency circulation management Reliable solutions 04 Provide confidence and security in society Reliable solutions 05 Promote an automated society Reliable solutions delivered by Glory Glory addresses societal challenges through its wide range of solutions We offer a range of automation and labor-saving solutions, which further 'enables a confident world'. : Overseas market : Financial market : Retail and transportation market : Amusement market : Others Provide various methods of payments Cash management rationalization and labor savings Currency circulation management Provide confidence and security in society Promote an automated society Contact-free and self-service Next-generation store Store DX support Cash management Electronic settlement Solutions using robots Solutions using biometrics/image recognition Delivering our vision To provide high value-added products and services for our customers and wider society, we will further enhance our core recognition/identification and mechatronics technologies., We will also continue to acquire data analytics technologies that enable us to analyze and apply a wide range of information to serve as the core for new business domains. We will also look to promote open innovation in cooperation with partner companies 01 Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership 02 Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies These two technologies are our base for expansion in both the new and existing business domains presented in our 2026 Medium-Term Management Plan. 2026 Medium-Term Management Plan Glory leads in enabling confidence through its advanced technology that reaches far beyond delivering cash automation. We will continue to embrace the challenge of realizing a safe and secure society of the future. Corporate Philosophy Integrated Report 2023 Medium-Term Management Plan Sustainability Scroll It is expected that drastic changes will occur imminently in the business environment surrounding the Company and its group companies. These include emergence of new payment mechanisms and digital currencies realized by adoption of rapidly advancing technology, population increase centered in the emerging economies, and rapid acceleration of population aging in Japan. Taking these changes as an opportunity, we aim to deliver renewed value to the society in the \"Long-Term Vision 2028\". To achieve this goal, we will endeavor to create next-generation products and services through advancement of the core technologies built in the development of cash handling machines and promotion of open innovation. We enable a confident world Safe and secure transactions are critical to your business, and your customers. We deliver secure, efficient payment systems and instant, highly accurate identity verification and authentication solutions that enable confidence in transactions and other interactions between businesses and people. Our innovative technologies, our experienced professionals and our commitment to the success of our customers, partners and communities create a safe, confident path forward. It is expected that drastic changes will occur imminently in the business environment surrounding the Company and its group companies. These include emergence of new payment mechanisms and digital currencies realized by adoption of rapidly advancing technology, population increase centered in the emerging economies, and rapid acceleration of population aging in Japan. Taking these changes as an opportunity, we aim to deliver renewed value to the society in the \"Long-Term Vision 2028\". To achieve this goal, we will endeavor to create next-generation products and services through advancement of the core technologies built in the development of cash handling machines and promotion of open innovation. We enable a confident world Safe and secure transactions are critical to your business, and your customers. We deliver secure, efficient payment systems and instant, highly accurate identity verification and authentication solutions that enable confidence in transactions and other interactions between businesses and people. Our innovative technologies, our experienced professionals and our commitment to the success of our customers, partners and communities create a safe, confident path forward. Glory Group Vision 5 Megatrends: How Glory commits to embrace future opportunities 5 Megatrends: How Glory commits to embrace future opportunities Based on 5 identified megatrends, we recognize the demand for a new business domain that addresses emerging challenges and opportunities for the society of the future. Trusted, reliable and more efficient payment systems as well as instantaneous and highly accurate identity verification and authentication solutions will be increasingly required everywhere. We will create confidence across society through our innovative solutions and services and build trust throughout the world. 5 Megatrends: How Glory commits to embrace future opportunities 5 Megatrends: How Glory commits to embrace future opportunities Based on 5 identified megatrends, we recognize the demand for a new business domain that addresses emerging challenges and opportunities for the society of the future. Trusted, reliable and more efficient payment systems as well as instantaneous and highly accurate identity verification and authentication solutions will be increasingly required everywhere. We will create confidence across society through our innovative solutions and services and build trust throughout the world. We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. Reliable solutions 01 Provide various methods of payments Reliable solutions 02 Cash management rationalization and labor savings Reliable solutions 03 Currency circulation management Reliable solutions 04 Provide confidence and security in society Reliable solutions 05 Promote an automated society Reliable solutions delivered by Glory Glory addresses societal challenges through its wide range of solutions We offer a range of automation and labor-saving solutions, which further 'enables a confident world'. : Overseas market : Financial market : Retail and transportation market : Amusement market : Others Provide various methods of payments Cash management rationalization and labor savings Currency circulation management Provide confidence and security in society Promote an automated society Contact-free and self-service Next-generation store Store DX support Cash management Electronic settlement Solutions using robots Solutions using biometrics/image recognition We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. We aim to 'enable confidence' in an increasingly broad range of fields to those that we have already enabled so far. Reliable solutions 01 Provide various methods of payments Provide various methods of payments Reliable solutions 02 Cash management rationalization and labor savings Cash management rationalization and labor savings Reliable solutions 03 Currency circulation management Reliable solutions 04 Provide confidence and security in society Provide confidence and security in society Reliable solutions 05 Promote an automated society Promote an automated society Reliable solutions delivered by Glory Glory addresses societal challenges through its wide range of solutions We offer a range of automation and labor-saving solutions, which further 'enables a confident world'. : Retail and transportation market : Retail and transportation market Provide various methods of payments Cash management rationalization and labor savings Provide confidence and security in society Promote an automated society Solutions using biometrics/image recognition Delivering our vision To provide high value-added products and services for our customers and wider society, we will further enhance our core recognition/identification and mechatronics technologies., We will also continue to acquire data analytics technologies that enable us to analyze and apply a wide range of information to serve as the core for new business domains. We will also look to promote open innovation in cooperation with partner companies 01 Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership 02 Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies These two technologies are our base for expansion in both the new and existing business domains presented in our 2026 Medium-Term Management Plan. 2026 Medium-Term Management Plan To provide high value-added products and services for our customers and wider society, we will further enhance our core recognition/identification and mechatronics technologies., We will also continue to acquire data analytics technologies that enable us to analyze and apply a wide range of information to serve as the core for new business domains. We will also look to promote open innovation in cooperation with partner companies 01 Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership Extend software capabilities (data analytics) through internal growth, acquisitions, and strategic partnership 02 Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies Develop core competency in total system engineering to deliver unique customer value through combining Glory and 3rd party technologies These two technologies are our base for expansion in both the new and existing business domains presented in our 2026 Medium-Term Management Plan. Glory leads in enabling confidence through its advanced technology that reaches far beyond delivering cash automation. We will continue to embrace the challenge of realizing a safe and secure society of the future. Corporate Philosophy Integrated Report 2023 Medium-Term Management Plan Sustainability Glory leads in enabling confidence through its advanced technology that reaches far beyond delivering cash automation. We will continue to embrace the challenge of realizing a safe and secure society of the future. 2023 Medium-Term Management Plan"
  ]
}