{
  "company": "cortica.com",
  "dominant_topics": [
    0,
    -1,
    3
  ],
  "topic_counts": {
    "0": 14,
    "-1": 3,
    "3": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use",
    "3": "deck, attacked, zombie, turn, trap"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 14,
      "3": 1
    }
  },
  "sample_docs": [
    "The Future of AI is Autonomy Cortica has developed autonomous AI that simulates the natural processes of the mammal cortex. Its unsupervised approach to learning mimics the way the brain processes information: enabling machines to learn, collaborate and interact with the world without human input. The technology is backed by more than 200 patents and 10 years of cutting-edge research, and is revolutionizing visual intelligence for a smarter and safer world. The Future of AI is Autonomy Cortica has developed autonomous AI that simulates the natural processes of the mammal cortex. Its unsupervised approach to learning mimics the way the brain processes information: enabling machines to learn, collaborate and interact with the world without human input. The technology is backed by more than 200 patents and 10 years of cutting-edge research, and is revolutionizing visual intelligence for a smarter and safer world. AUTONOMOUS VEHICLES Cortica's AI enables a true, human-level understanding of the world around the vehicle beyond a simple data input description. Cortica's Autonomous AI enables the vehicle to identify the moving parts in its environment and make informed decisions- even predicting the changes likely to occur in its surroundings. Autonomous AI allows for safer, more efficient, and intelligent autonomous driving. Cortica's AI enables a true, human-level understanding of the world around the vehicle beyond a simple data input description. Cortica's Autonomous AI enables the vehicle to identify the moving parts in its environment and make informed decisions- even predicting the changes likely to occur in its surroundings. Autonomous AI allows for safer, more efficient, and intelligent autonomous driving. SMART AND SAFE CITIES Cortica provides ultra-scale intelligence to enable cameras and drones with visual perception, analyzing the massive amounts of data captured daily by millions of security and drone cameras. The autonomous AI is capable of instant facial recognition, analysis of behavioral anomalies and situational predictability making cities smarter, safer, and more efficient. Smart cameras and drones protect lives and improve infrastructure with flexible, unsupervised AI. SMART AND SAFE CITIES Cortica provides ultra-scale intelligence to enable cameras and drones with visual perception, analyzing the massive amounts of data captured daily by millions of security and drone cameras. The autonomous AI is capable of instant facial recognition, analysis of behavioral anomalies and situational predictability making cities smarter, safer, and more efficient. Smart cameras and drones protect lives and improve infrastructure with flexible, unsupervised AI. Press Highlights Cortica ranked one of 2017's top 3 coolest tech companies in Israel Cortica ranked as number 1 patent holder amongst AI companies Cortica's approach [to AI] is different from most of the competition. [Cortica is one of] 10 Startups gunning for the self-driving car market Cortica ranked one of 2017's top 3 coolest tech companies in Israel Cortica ranked as number 1 patent holder amongst AI companies Cortica's approach [to AI] is different from most of the competition. [Cortica is one of] 10 Startups gunning for the self-driving car market",
    "Cortica operates the cortica.com website, which provides the SERVICE. This page is used to inform website visitors regarding our policies with the collection, use, and disclosure of Personal Information if anyone decided to use our Service. If you choose to use our Service, then you agree to the collection and use of information in relation with this policy. The Personal Information that we collect are used for providing and improving the Service. We will not use or share your information with anyone except as described in this . The used in this have the same meanings as in our , which is accessible at cortica.com , unless otherwise defined in this . Information Collection and Use For a better experience while using our Service, we may require you to provide us with certain personally identifiable information, including but not limited to your name, phone number, and postal address. The information that we collect will be used to contact or identify you. We want to inform you that whenever you visit our Service, we collect information that your browser sends to us that is called Log Data. This Log Data may include information such as your computer's Internet Protocol (\"IP\") address, browser version, pages of our Service that you visit, the time and date of your visit, the time spent on those pages, and other statistics. Cookies are files with small amount of data that is commonly used an anonymous unique identifier. These are sent to your browser from the website that you visit and are stored on your computer's hard drive. Our website uses these \"cookies\" to collection information and to improve our Service. You have the option to either accept or refuse these cookies, and know when a cookie is being sent to your computer. If you choose to refuse our cookies, you may not be able to use some portions of our Service. We may employ third-party companies and individuals due to the following reasons: To facilitate our Service; To provide the Service on our behalf; To perform Service-related services; or To assist us in analyzing how our Service is used. We want to inform our Service users that these third parties have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose. We value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security. Links to Other Sites Our Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the of these websites. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services. Our Services do not address anyone under the age of 13. We do not knowingly collect personal identifiable information from children under 13. In the case we discover that a child under 13 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us so that we will be able to do necessary actions. Changes to This We may update our from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new on this page. These changes are effective immediately, after they are posted on this page. If you have any questions or suggestions about our , do not hesitate to contact us .",
    "Autonomous AI A new era of AI is necessary to enable the next revolution of intelligent machines. Cortica has created the future of artificial intelligence. By leveraging unsupervised learning, the same process that the human brain uses to incorporate data, Cortica gives machines the same limitless understanding of visual information that humans enjoy. Cortica's Autonomous AI learns on its own in real-time, interacts with the real world and collaborates with other machines. Based upon proprietary brain research, the AI platform is modeled on neuron activity and learning mechanisms occurring in the mammal brain. This technology has been developed for over 10 years and is backed by more than 200 patents. A new era of AI is necessary to enable the next revolution of intelligent machines. Cortica has created the future of artificial intelligence. By leveraging unsupervised learning, the same process that the human brain uses to incorporate data, Cortica gives machines the same limitless understanding of visual information that humans enjoy. Cortica's Autonomous AI learns on its own in real-time, interacts with the real world and collaborates with other machines. Based upon proprietary brain research, the AI platform is modeled on neuron activity and learning mechanisms occurring in the mammal brain. This technology has been developed for over 10 years and is backed by more than 200 patents. Unique Technology Cortica's autonomous AI takes a fundamentally different approach to intelligence. Cortica's autonomous AI takes a fundamentally different approach to intelligence. The Cortica Autonomous AI comprehends concepts and context and provides task generalization and predictive power. With its conceptual understanding it can interpret multiple concepts simultaneously, and make inferences based upon them. This next-level understanding exceeds the capabilities of traditional deep learning systems, which lack true understanding as they focus primarily on object classification. Cortica's Autonomous AI learns organically–like a newborn. It interacts with noisy, unstructured data to teach itself new concepts. The AI learns in real-time–reinforcing the intelligence as new concepts and situations arise. This covers edge cases and allows for minimal and efficient training, without any manual training or annotated and segmented data. The technology operates in a closed loop and is adaptive to conditions and constraints. This makes the platform limitless at scale. The flat, hierarchical architecture of Cortica's technology makes it fully transparent with explainable results. State-of-the-art deep learning technologies are a \"black box\" that make results difficult to predict and are therefore less reliable. The level of clarity and insight enabled by Cortica's Autonomous AI is necessary to make safe autonomous vehicles and smarter, more intuitive systems. Cortica's Autonomous AI is able to collaborate with other AI agents and modules. The technology is based on patented signature files that are lightweight and robust. Signatures process inputs from any natural signal for a complete understanding of concepts and context and can be easily shared between agents and amalgamated from varying input sources. The Pillars of Autonomous AI Cortica's autonomous AI takes a fundamentally different approach. The Pillars of Autonomous AI Cortica's autonomous AI takes a fundamentally different approach. SIGNATURES: GENERAL & SEARCHABLE REPRESENTATIONS Cortica's Autonomous AI technology translates visual information into a universal, text-based structural representation. This process makes complex information and enormous amounts of data easily searchable and better organized for deeper insights into big data. The unsupervised system proactively maps input signals to these high-dimensional, lossless concept signatures. Because the files are lightweight and robust the system has unmatched efficiency and scalability. UNSUPERVISED, ONLINE & REAL-TIME LEARNING Cortica's Autonomous AI is based on unsupervised self-learning methodologies. The system is able to both learn and operate in real-time the same way a person does – finding commonalities, clustering them, and seeking to make sense of the data without outside intervention. KNOWLEDGE AGGREGATION & REPRESENTATION Cortica's Autonomous AI can collect, discern and organize the represented information into true knowledge. With a conceptual understanding garnered from fully unsupervised learning methodologies the AI mimics human cognitive comprehension–learning and understanding at a human level. The Future of AI Autonomous AI is changing what's possible for machines. Cortica's Autonomous AI will usher in a new paradigm for machines that are self-learning and self-taught. The results of the 10 year research to create a machine that can think and reason like a human being make our cities more secure, our infrastructure better and our roads safer. The Future of AI Autonomous AI is changing what's possible for machines. Cortica's Autonomous AI will usher in a new paradigm for machines that are self-learning and self-taught. The results of the 10 year research to create a machine that can think and reason like a human being make our cities more secure, our infrastructure better and our roads safer. Smart and Safe Cities",
    "INTELLIGENT SOLUTIONS FOR MODERN CITIES Cortica is empowering cameras and UAVs with true visual understanding to create the city of tomorrow -- protecting lives and improving infrastructure with real-time, flexible, unsupervised AI. INTELLIGENT SOLUTIONS FOR MODERN CITIES Cortica is empowering cameras and UAVs with true visual understanding to create the city of tomorrow -- protecting lives and improving infrastructure with real-time, flexible, unsupervised AI. By 2019 security cameras will generate over 2,500 petabytes of data daily. -ihs markit By 2019 security cameras will generate over 2,500 petabytes of data daily. 01 Smart Camera The brains behind the eyes City-wide security systems produce millions of hours of footage that is impossible to monitor manually. This visual big data provides tremendous insights. Cortica's unsupervised AI combs through these hours of video in real-time to identify patterns, concepts and alert situations–driving improvements in safety, traffic management, and much more. The brains behind the eyes City-wide security systems produce millions of hours of footage that is impossible to monitor manually. This visual big data provides tremendous insights. Cortica's unsupervised AI combs through these hours of video in real-time to identify patterns, concepts and alert situations–driving improvements in safety, traffic management, and much more. Search intuitive search Intuitive search unlocks the true power of the platform. Searching by text or image puts crucial insights at the operator's' fingertips. Face Recognition face recognition Cortica provides industry leading facial detection and recognition with unmatched accuracy. The technology automatically organizes and groups faces to provide instant feedback. Behavior Analysis Situational and contextual behavior analysis understands actions and responses to appropriately alert operators during instances of necessary heightened awareness. Specific types of behavior can be analyzed and understood in real-time. AI Camera in practice Cortica's suite of intelligent camera technology products aid in incident prevention, emergency response, and overall efficiency improvements allowing cities to run smoothly. A sample of the many use cases include: Traffic Management Urban Safety Travel Security Public Transportation community centers Facility Monitoring Intuitive search unlocks the true power of the platform. Searching by text or image puts crucial insights at the operator's' fingertips. Cortica provides industry leading facial detection and recognition with unmatched accuracy. The technology automatically organizes and groups faces to provide instant feedback. Situational and contextual behavior analysis understands actions and responses to appropriately alert operators during instances of necessary heightened awareness. Specific types of behavior can be analyzed and understood in real-time. AI Camera in practice Cortica's suite of intelligent camera technology products aid in incident prevention, emergency response, and overall efficiency improvements allowing cities to run smoothly. A sample of the many use cases include: 90% OF DRONE AND SATELLITE FOOTAGE GOES UNANALYZED OF DRONE AND SATELLITE FOOTAGE GOES UNANALYZED 02 Aerial Solutions Smart drone and aerial solutions With less than 10% of the footage being watched so much key data is lost–data that can provide critical information about the health of our cities. Cortica's unsupervised AI analyzes and interprets this big data to make infrastructure maintenance more effective and efficient. Smart drone and aerial solutions With less than 10% of the footage being watched so much key data is lost–data that can provide critical information about the health of our cities. Cortica's unsupervised AI analyzes and interprets this big data to make infrastructure maintenance more effective and efficient. visual navigation Cortica's platform can run on device to provide visual navigation (without GPS), real-time analytics, in-drone analysis and visual intelligence. real-time analytics With in-drone and cloud-based technology, massive amounts of visual data can be processed quickly allowing anomalies and alerts to be identified and tracked in real-time for anlysis. image analysis Any searched object can be input into Cortica's platform. The system is capable of finding all similar appearances in real-time. visual navigation Cortica's platform can run on device to provide visual navigation (without GPS), real-time analytics, in-drone analysis and visual intelligence. real-time analytics With in-drone and cloud-based technology, massive amounts of visual data can be processed quickly allowing anomalies and alerts to be identified and tracked in real-time for anlysis. image analysis Any searched object can be input into Cortica's platform. The system is capable of finding all similar appearances in real-time. inspection AUTOMATED MAINTENANCE Improve efficiency and reduce risk with AI that is capable of automatic infrastructure inspection of roads, pipelines, turbines, agriculture, buildings and much more. Monitoring and Alerts CRISIS AVOIDANCE Emergency detection alerts appropriate operators when situations are identified - including floor and fire visual detection within aerials. public safety Public Safety Automatic monitoring for anomalies including unauthorized vehicles, structures, individuals in restricted areas, suspicious behaviors, and much more. Aerial Intelligence in practice Cortica's smart aerial solutions are driving innovation and efficiency on a massive scale across industries. infrastructure Monitoring, inventory analysis, and maintenance inspection agriculture Crop and area health assessment transportation Transportation systems review, maintenance, and traffic analysis security Site monitoring, alerts, and proactive action telecommunications Maintenance of towers and new infrastructure Cortica's platform can run on device to provide visual navigation (without GPS), real-time analytics, in-drone analysis and visual intelligence. With in-drone and cloud-based technology, massive amounts of visual data can be processed quickly allowing anomalies and alerts to be identified and tracked in real-time for anlysis. Any searched object can be input into Cortica's platform. The system is capable of finding all similar appearances in real-time. Cortica's platform can run on device to provide visual navigation (without GPS), real-time analytics, in-drone analysis and visual intelligence. With in-drone and cloud-based technology, massive amounts of visual data can be processed quickly allowing anomalies and alerts to be identified and tracked in real-time for anlysis. Any searched object can be input into Cortica's platform. The system is capable of finding all similar appearances in real-time. Improve efficiency and reduce risk with AI that is capable of automatic infrastructure inspection of roads, pipelines, turbines, agriculture, buildings and much more. Emergency detection alerts appropriate operators when situations are identified - including floor and fire visual detection within aerials. Automatic monitoring for anomalies including unauthorized vehicles, structures, individuals in restricted areas, suspicious behaviors, and much more. Aerial Intelligence in practice Cortica's smart aerial solutions are driving innovation and efficiency on a massive scale across industries.",
    "Cortica Video Cortica Automotive Cortica Screening Cortica Photos Click to download About Cortica Cortica is an Israeli company founded in 2007 with leading AI technology for autonomous platforms. The company's Autonomous AI is based upon proprietary brain research and utilizes unsupervised-learning technology backed by more than 200 patents. The Cortica AI understands the visual world on a human level–thereby significantly exceeding the capabilities of the industry. This Autonomous AI is embedded in next-generation, ultra-scale platforms where understanding images is a critical task. Cortica provides the intelligence that enables autonomous vehicles, smart cities, autonomous drones, and more. With headquarters in Tel Aviv and offices in NYC, Cortica's employees include leading AI researchers and veterans of elite Israeli military intelligence units. BIO: IGAL RAICHELGAUZ, CEO Igal is the Co-Founder and CEO of Cortica, the leader of AI technology for autonomous platforms. Before founding Cortica, Igal was the CTO of speech recognition company LCB, and prior to that held several technical positions at Intel. Igal started his career in an elite IDF intelligence unit, and following this was the CEO and co-founder of Figment, the first advanced messaging platform based on SMS. Igal started his Ph.D. research at the Technion in the field of cortical neural networks, but his PhD was never completed; instead, Cortica was founded. Igal has received multiple technical and innovation awards and holds over 50 patents. Cortica in the News Could AI Based Surveillance Predict Crime Before It Happens Digital Trends This AI learns just like you, and its about to revolutionize cars and security Circa News [Video] Cortica, Numenta Hold Top Patents In Artificial Intelligence CB Insights Cortica is developing AI for the autonomous car Globes Cortica Will Apply 'Unsupervised Learning' AI Tech to Help Self-Driving Cars Get Smarter The Drive Cortica teaches autonomous vehicles with unsupervised learning TechCrunch 10 Israeli start-ups that are gunning for the self-driving car market CNBC Israeli AI company Cortica denies rumors it is being bought by Tesla to work on its Autopilot driver-assistance feature Business Insider Brain research offers fast track for AI tech Automotive World Recent Press Releases Cortica Wins \"Emerging Tech Fastpitch\" at 2018 New York International Auto Show Apr 05, 2018, 17:00 ET Prime Ministers Narendra Modi and Benjamin Netanyahu Welcome New Age of Collaboration for Israel and India Jan 29, 2018, 09:00 ET Next Generation AI Enables Machines to Think and Learn Like People Jan 03, 2018, 09:00 ET Cortica is an Israeli company founded in 2007 with leading AI technology for autonomous platforms. The company's Autonomous AI is based upon proprietary brain research and utilizes unsupervised-learning technology backed by more than 200 patents. The Cortica AI understands the visual world on a human level–thereby significantly exceeding the capabilities of the industry. This Autonomous AI is embedded in next-generation, ultra-scale platforms where understanding images is a critical task. Cortica provides the intelligence that enables autonomous vehicles, smart cities, autonomous drones, and more. With headquarters in Tel Aviv and offices in NYC, Cortica's employees include leading AI researchers and veterans of elite Israeli military intelligence units. BIO: IGAL RAICHELGAUZ, CEO Igal is the Co-Founder and CEO of Cortica, the leader of AI technology for autonomous platforms. Before founding Cortica, Igal was the CTO of speech recognition company LCB, and prior to that held several technical positions at Intel. Igal started his career in an elite IDF intelligence unit, and following this was the CEO and co-founder of Figment, the first advanced messaging platform based on SMS. Igal started his Ph.D. research at the Technion in the field of cortical neural networks, but his PhD was never completed; instead, Cortica was founded. Igal has received multiple technical and innovation awards and holds over 50 patents. Cortica in the News Could AI Based Surveillance Predict Crime Before It Happens Digital Trends This AI learns just like you, and its about to revolutionize cars and security Circa News [Video] Cortica, Numenta Hold Top Patents In Artificial Intelligence CB Insights Cortica is developing AI for the autonomous car Globes Cortica Will Apply 'Unsupervised Learning' AI Tech to Help Self-Driving Cars Get Smarter The Drive Cortica teaches autonomous vehicles with unsupervised learning TechCrunch 10 Israeli start-ups that are gunning for the self-driving car market CNBC Israeli AI company Cortica denies rumors it is being bought by Tesla to work on its Autopilot driver-assistance feature Business Insider Brain research offers fast track for AI tech Automotive World Cortica Wins \"Emerging Tech Fastpitch\" at 2018 New York International Auto Show Apr 05, 2018, 17:00 ET Apr 05, 2018, 17:00 ET Prime Ministers Narendra Modi and Benjamin Netanyahu Welcome New Age of Collaboration for Israel and India Jan 29, 2018, 09:00 ET Jan 29, 2018, 09:00 ET Next Generation AI Enables Machines to Think and Learn Like People Jan 03, 2018, 09:00 ET Jan 03, 2018, 09:00 ET Disclaimer Cortica grants you a non-exclusive, revocable license to use, copy, modify, distribute and publish the photos on this page to use on social media platforms and your website for the sole purpose of discussing Cortica and the company's products and technology. By downloading these photos, you agree to use the photos only as permitted by this license. Cortica grants you a non-exclusive, revocable license to use, copy, modify, distribute and publish the photos on this page to use on social media platforms and your website for the sole purpose of discussing Cortica and the company's products and technology. By downloading these photos, you agree to use the photos only as permitted by this license."
  ]
}