{
  "company": "credas.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.4864864864864865,
    "framing_surveillance": 0.0,
    "framing_market": 0.5135135135135135,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "Capture, Identify & Verify Our easy-to-configure compliance platform makes onboarding engaging and efficient for you and your customers. From ID verification to company reports and data capture forms, we offer an end-to-end solution that streamlines your compliance checks. Onboarding Branded User Portals Smart Data Capture Forms Advanced eSignatures ID Verification Biometric Facial Recognition International ID Documents Digital Proof of Address Compliance Checks AML Checks Know Your Business Source of Funds Vetting Right to Rent Right to Work PEPS & Sanctions Capture, Identify & Verify Our easy-to-configure compliance platform makes onboarding engaging and efficient for you and your customers. From ID verification to company reports and data capture forms, we offer an end-to-end solution that streamlines your compliance checks. Onboarding Branded User Portals Smart Data Capture Forms Advanced eSignatures ID Verification Biometric Facial Recognition International ID Documents Digital Proof of Address Compliance Checks AML Checks Know Your Business Source of Funds Vetting Right to Rent Right to Work PEPS & Sanctions Capture, Identify & Verify Our easy-to-configure compliance platform makes onboarding engaging and efficient for you and your customers. From ID verification to company reports and data capture forms, we offer an end-to-end solution that streamlines your compliance checks. Branded Portal & Comms Source of Funds / Wealth CREDAS' IDENTITY VERIFICATION SERVICE IS TRUSTED BY CREDAS' IDENTITY VERIFICATION SERVICE IS TRUSTED BY CREDAS' IDENTITY VERIFICATION SERVICE IS TRUSTED BY WHO USES OUR DIGITAL IDENTITY VERIFICATION SOFTWARE? Credas' IDV and AML technology is widely used across 40 different sectors. Find Out Why Estate Agents Streamlined AML and ID checks for Estate Agents and auctioneers Conveyancers Easy AML checks for conveyancers and property lawyers Recruitment Streamlined onboarding and compliance for contractors and new starters Accountants Trusted AML compliance for accountants and tax advisors Corporate Services Instant ID/AML checks for formation agents, registered offices and notaries Become a partner Join our partner programme and enrich your offering with our range of searches WHO USES OUR DIGITAL IDENTITY VERIFICATION SOFTWARE? Credas' IDV and AML technology is widely used across 40 different sectors. Streamlined AML and ID checks for Estate Agents and auctioneers Easy AML checks for conveyancers and property lawyers Streamlined onboarding and compliance for contractors and new starters Trusted AML compliance for accountants and tax advisors Instant ID/AML checks for formation agents, registered offices and notaries Join our partner programme and enrich your offering with our range of searches WHY CREDAS? The Latin translation of Credas is: to believe; to trust in; to give credence. Here's a few reasons why you can believe and trust in us. Trust Framework Certified Credas are certified against the UK Government Digital Identity and Attributes Trust Framework We power the property sector 60% of UK housing transactions involve Credas whether directly or through our partners. We're tried and tested Over 350,000 people per month use our services to verify their ID and financial information. We have the #1 IDV in the UK With over 250,000 5-star reviews we have the highest rated IDV app in the UK and regularly feature in the top ten UK business apps. Our outcomes are sector leading Credas delivers positive results in 97% of ID verifications thanks our combination of passive liveness, NFC and data integration. We're trusted by household names Supplier to many of the UK's most recognised brands such as Connells Group, Deloitte, NHS, EY and Indeed. The Latin translation of Credas is: to believe; to trust in; to give credence. Here's a few reasons why you can believe and trust in us. Credas are certified against the UK Government Digital Identity and Attributes Trust Framework We power the property sector 60% of UK housing transactions involve Credas whether directly or through our partners. We're tried and tested Over 350,000 people per month use our services to verify their ID and financial information. We have the #1 IDV in the UK With over 250,000 5-star reviews we have the highest rated IDV app in the UK and regularly feature in the top ten UK business apps. Our outcomes are sector leading Credas delivers positive results in 97% of ID verifications thanks our combination of passive liveness, NFC and data integration. We're trusted by household names Supplier to many of the UK's most recognised brands such as Connells Group, Deloitte, NHS, EY and Indeed. RECEIVED AN SMS OR EMAIL ASKING YOU TO VERIFY WITH CREDAS? If you have been asked by one of our customers to verify your identity using Credas, please download the Credas app or visit https://myconnect.credas.com and input the registration code our customer sent to you via SMS or Email in order to complete the process. Want to about Credas and why you've been asked to verify your ID? Here's our FAQs Download the iOS app Download the Android app RECEIVED AN SMS OR EMAIL ASKING YOU TO VERIFY WITH CREDAS? If you have been asked by one of our customers to verify your identity using Credas, please download the Credas app or visit https://myconnect.credas.com and input the registration code our customer sent to you via SMS or Email in order to complete the process. Want to about Credas and why you've been asked to verify your ID? Here's our FAQs OUR LATEST NEWS & RESOURCES 7 October 2025 Credas & SmartSearch SmartSearch has agreed to acquire Credas Technologies Ltd from Dye and Durham. This strategic acquisition, subject to regulatory approval, strengthens […] Read More 2 October 2025 Why Accountants should register as an ACSP ahead of the Companies House deadline The Countdown to Director ID Verification: Why Accountants should act now The clock is ticking. From 18th November, all company […] Read More 24 September 2025 Inside the launch of the Credas Compliance Wallet Credas launches their Credas Compliance Wallet in the Ivy, London on September 17. Catch up with the launch here. Read More SEE ALL NEWS & RESOURCES OUR LATEST NEWS & RESOURCES 7 October 2025 Credas & SmartSearch SmartSearch has agreed to acquire Credas Technologies Ltd from Dye and Durham. This strategic acquisition, subject to regulatory approval, strengthens […] Read More SmartSearch has agreed to acquire Credas Technologies Ltd from Dye and Durham. This strategic acquisition, subject to regulatory approval, strengthens […] 2 October 2025 Why Accountants should register as an ACSP ahead of the Companies House deadline The Countdown to Director ID Verification: Why Accountants should act now The clock is ticking. From 18th November, all company […] Read More Why Accountants should register as an ACSP ahead of the Companies House deadline The Countdown to Director ID Verification: Why Accountants should act now The clock is ticking. From 18th November, all company […] 24 September 2025 Inside the launch of the Credas Compliance Wallet Credas launches their Credas Compliance Wallet in the Ivy, London on September 17. Catch up with the launch here. Read More Inside the launch of the Credas Compliance Wallet Credas launches their Credas Compliance Wallet in the Ivy, London on September 17. Catch up with the launch here."
  ]
}