{
  "company": "cybercoretech.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 7,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5238095238095238,
    "framing_surveillance": 0.0,
    "framing_market": 0.4761904761904761,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 2
    }
  },
  "sample_docs": [
    "CyberCore Technologies offers onsite installation of your desktops, servers and networking equipment. Our standard services include unpacking, physical inspection, set-up, assembly, connection, and functional tests of the operating system. System moves, adds, changes, software installation, and de-installation are available. Remote, non-standard and home installations are scheduled for completion by senior installation technicians. Deployment of installation technicians is organized on a location-by-location, client-by-client basis to maximize efficiencies and streamline processes to support agreed upon service level agreements and pricing. The account team works with the installation group to ensure client satisfaction at the end user level. As defined by client requirements, we deliver new products to the end user as a complete system with all components as defined by each customer's customized IT environment. CyberCore Technologies is committed to fulfilling the installation requirements set forth and scheduling of installations is negotiated as part of the service level agreements defined in the client engagement agreement.",
    "An experienced project manager assumes responsibility for the pace and logistics of your special service events, including the coordination of multiple resources. Our focus on defining, measuring and streamlining the process delivers maximum efficiencies with an unequaled emphasis on quality. CyberCore staff participates in monthly, mandatory training in products, emerging technology, quality, and process improvement. Through routine attendance at technical training and taking advantage of manufacturer new technologies' certification opportunities, CyberCore account support personnel acquire information relating to best practices, strategies, tools, and technologies to increase productivity and help our clients increase the value of their businesses.",
    "IT Product Line Card Mailing and Remit Addresses Securing Information Technology Solutions Over the past year we have expanded our business, from serving commercial and government clients into fulfilling IT needs in the intelligence community. To reflect our initiatives, we have launched an improved site. Not only the look is improved, the site will provide more news and the ability to effectively communicate with our clients and employees. Who we are As the #1 Computer Reseller and an Industry Leading Service Provider based in Baltimore, Maryland, CyberCore Technologies delivers innovative solutions while exceeding client expectations. P roviding Information Technology solutions to all groups of our Nations Defense, Intelligence and Homeland Security, our national client base relies on CyberCore Technologies highly skilled employees to deliver quality work, completed on time, within budget, and continually exceeding the highest level of client expectations. Experience CyberCore Technologies is an industry proven provider of solutions in supply chain management, systems engineering, data storage, and security. Technology and industry best expertise are combined to provide a full spectrum of state-of-the-art solutions from design and development to implementation and maintenance, assisting each client in achieving their goals. Our business is focused on eight specialized practice areas: Supply Chain Management Systems Integration Systems Engineering Enterprise Storage Enterprise Security Information Assurance Mission-Critical Outsourcing Systems Consulting Strengths Information Technology Services - CyberCore Technologies delivers a full spectrum of information technology services and solutions that support challenges commonly faced by both Federal and Fortune 500 organizations. CyberCore Technologies employees use their advanced technological training, certifications, and experience to implement each solution. CyberCore Technologies is authorized to support almost all Federal Intelligence agencies. Federal Government Contracting and Procurement - CyberCore Technologies has in-depth knowledge of all Federal rules and regulations pertaining to contracting and procurement within the Federal government. Being named as a team member on several Federal-contracting vehicles allows CyberCore Technologies to provide solutions within many different agencies. CyberCore Technologies current GSA schedule contract number is GS-35F-0566N. Management Team - CyberCore Technologies is lead by a team with over 40 years experience, serving as directors, vice presidents, and presidents of Fortune 500 organizations. Employees at CyberCore Technologies are encouraged to work in continuity with the management team to ensure a well-focused, successful organization. Interested in joining our team? Securing Information Technology Solutions As the #1 Computer Reseller and an Industry Leading Service Provider based in Baltimore, Maryland, CyberCore Technologies delivers innovative solutions while exceeding client expectations. P roviding Information Technology solutions to all groups of our Nations Defense, Intelligence and Homeland Security, our national client base relies on CyberCore Technologies highly skilled employees to deliver quality work, completed on time, within budget, and continually exceeding the highest level of client expectations. CyberCore Technologies is an industry proven provider of solutions in supply chain management, systems engineering, data storage, and security. Technology and industry best expertise are combined to provide a full spectrum of state-of-the-art solutions from design and development to implementation and maintenance, assisting each client in achieving their goals. Our business is focused on eight specialized practice areas: Supply Chain Management Systems Integration Systems Engineering Enterprise Storage Enterprise Security Information Assurance Mission-Critical Outsourcing Systems Consulting Strengths Information Technology Services - CyberCore Technologies delivers a full spectrum of information technology services and solutions that support challenges commonly faced by both Federal and Fortune 500 organizations. CyberCore Technologies employees use their advanced technological training, certifications, and experience to implement each solution. CyberCore Technologies is authorized to support almost all Federal Intelligence agencies. Federal Government Contracting and Procurement - CyberCore Technologies has in-depth knowledge of all Federal rules and regulations pertaining to contracting and procurement within the Federal government. Being named as a team member on several Federal-contracting vehicles allows CyberCore Technologies to provide solutions within many different agencies. CyberCore Technologies current GSA schedule contract number is GS-35F-0566N. Management Team - CyberCore Technologies is lead by a team with over 40 years experience, serving as directors, vice presidents, and presidents of Fortune 500 organizations. Employees at CyberCore Technologies are encouraged to work in continuity with the management team to ensure a well-focused, successful organization. Interested in joining our team? Supply Chain Management Systems Integration Systems Engineering Enterprise Storage Enterprise Security Information Assurance Mission-Critical Outsourcing Systems Consulting Strengths Information Technology Services - CyberCore Technologies delivers a full spectrum of information technology services and solutions that support challenges commonly faced by both Federal and Fortune 500 organizations. CyberCore Technologies employees use their advanced technological training, certifications, and experience to implement each solution. CyberCore Technologies is authorized to support almost all Federal Intelligence agencies. Federal Government Contracting and Procurement - CyberCore Technologies has in-depth knowledge of all Federal rules and regulations pertaining to contracting and procurement within the Federal government. Being named as a team member on several Federal-contracting vehicles allows CyberCore Technologies to provide solutions within many different agencies. CyberCore Technologies current GSA schedule contract number is GS-35F-0566N. Management Team - CyberCore Technologies is lead by a team with over 40 years experience, serving as directors, vice presidents, and presidents of Fortune 500 organizations. Employees at CyberCore Technologies are encouraged to work in continuity with the management team to ensure a well-focused, successful organization. Interested in joining our team? Information Technology Services - CyberCore Technologies delivers a full spectrum of information technology services and solutions that support challenges commonly faced by both Federal and Fortune 500 organizations. CyberCore Technologies employees use their advanced technological training, certifications, and experience to implement each solution. CyberCore Technologies is authorized to support almost all Federal Intelligence agencies. Federal Government Contracting and Procurement - CyberCore Technologies has in-depth knowledge of all Federal rules and regulations pertaining to contracting and procurement within the Federal government. Being named as a team member on several Federal-contracting vehicles allows CyberCore Technologies to provide solutions within many different agencies. CyberCore Technologies current GSA schedule contract number is GS-35F-0566N. Management Team - CyberCore Technologies is lead by a team with over 40 years experience, serving as directors, vice presidents, and presidents of Fortune 500 organizations. Employees at CyberCore Technologies are encouraged to work in continuity with the management team to ensure a well-focused, successful organization. Interested in joining our team?",
    "As part of our end-to-end solution, we provide both Data and Voice network cabling. If you're thinking about new construction, renovations, or just upgrading, our cabling professionals will install your system in compliance with ANSI/TIA/EIA 568-A and IEC/ISO 11801 or meet rigorous industry quality standards.",
    "IT Product Line Card Mailing and Remit Addresses The measure of success of your system's infrastructure is not the level of technology deployed, but rather the quality of the people responsible for its design, management and ongoing support. This is especially true among companies who have chosen to implement a direct-procurement model. While these companies are willing to absorb the increased cost of internalizing the supply chain, most continue to capture savings through outsourcing their systems management. Technology and industry best expertise are combined to provide a full spectrum of state-of-the-art solutions from design and development to implementation and maintenance, assisting each client in achieving their goals. Our business is focused on: We have the experience required to configure, image, and install the entire range of network computing assets. Whether we establish a traditional or more progressive partnership, you can rely on CyberCore Technologie's unequaled distribution capabilities to deliver the products you need--when you need them. On any given day, more than 75,000 different computer components and COTS computing products are available for immediate shipment from one of our ten regional North American warehouses to your desktop. To help ensure your order is accurately filled and arrives on time, we use state-of-the-art technology to track each order from inception to fulfillment. Our electronic bar-coding and scanning capabilities allow precise inventory, order tracking, and management. CyberCore Technologies processes over 95% of our orders through EDI to expedite order transmission and fulfillment, while reducing turnaround time and cost. At the core of our distribution capabilities is our unique multi-point regional distribution network. Because CyberCore Technologies' vast distribution volume is geographically dispersed, we retain the flexibility and reliability needed to provide you with the customized, personalized service that your operation demands. We can custom package your orders to reduce the administrative confusion often associated with random receipt of new system components. Plus, our use of multiple carriers ensures that you receive the most reliable and cost-effective transportation available. At CyberCore Technologies, we consider the most important aspect of our distribution operation to be an uncompromising commitment to excellence. We continually review industry data to ensure that the products we sell and support meet the highest performance criteria. We strive for balanced performance measuring factors such as inventory turns against order fill rates. Each customer benefits from our staff's commitment, sense of ownership, and knowledge of client's special requirements and preferences. As well as the confidence gained from the configuration and distribution centers' ISO 9000 certification. CyberCore Technologies provides a comprehensive systems integration offering of custom-built, configured computing solutions delivered directly to your site. We can configure hardware and image computing assets with a simple software installation or complex integration of customized hardware and software. As a qualified reseller of the top hardware solutions for your network to desktop computing requirements, we can image these assets with your standard or custom software configuration. Managing an image library or installing specialized software and/or hardware; CyberCore Technologies makes sure your systems arrive with the precise required features installed. Tracking your components with a system bar code, our ISO-certified configuration facilities will also affix your asset tracking tags and upload files to update your asset management system. One of the most time-consuming elements of setup is the network configuration. CyberCore Technologies will configure the network settings allowing received systems to plug directly into your network. Compared with traditional distribution methods, CyberCore Technologies' systems integration offerings improve reliability while shaving days of the delivery cycle, and improving your IT productivity by freeing your technical resources. By having the hardware components and software images installed and tested at our centers, your system resources have uniformity, one of the keys to reducing future support costs. CyberCore Technologies offers expertise and project management in the specific areas of information and telecommunications systems engineering. Our staff delivers a standard of excellence in design, analysis, testing, systems engineering, project management, and construction. These professionals have a proven record of providing successful solutions to unique and challenging engineering problems. CyberCore Technologies can complete a project from conception to operation or can provide engineering support during any phase of a project or program. As authorized reseller for Hewlett-Packard/Compaq, IBM, and SUN, CyberCore Technologies' experienced technology professionals provide the unique ability to contrast and compare solutions from trusted manufacturers. Hewlett-Packard holds the world record in storage through their achievement of a sustained 3.6 terabyte per hour tape backup of an Oracle9i Database. This exceeds previous industry performance metrics by nearly 40 per cent. Innovators in clustered solutions that offer speed, capacity, and proven reliability, their products are ideal for enterprise-wide deployment and mission-critical applications. These solutions are extensible, resilient, and controllable storage solutions. Hewlett-Packard products offer maximum scalability, industry-leading performance, a fully integrated suite of centralized management tools, and unmatched data protection and disaster tolerant features. The IBM TotalStorage Enterprise Storage Server set new standards in performance, automation and integration as well as capabilities that support continuous availability to data with support for extremely fast data transfer rates. IBM Business Continuity and Recovery Services is one of three companies awarded a government-wide contract for the General Services Administration Federal Computer Acquisition Center computing and communications recovery services. As implemented by Sun and Sybase, the iForce Enterprise Data Warehouse Reference Architecture requires up to 75 percent less storage, delivers up to 1000 times the query speed, requires up to 80 percent less installation time, tests to over 35 terabytes of raw input data, and exhibits binary compatibility of SPARC architecture and Solaris OE. You can trust CyberCore Technologies to effectively evaluate your requirements and match the most appropriate hardware for your organization. Prioritization of features, functionality, and pricing, in addition to awareness of your corporate standards and expertise are factored to deliver the best storage solution. In today's environment, security of information becomes very important to the enterprise because it is vitally important to the individuals that interact with your company. In our highly connected world, validation of your information security plan or architecture requires performance of certain tests that could, without sufficient caution, cause unwanted downtime or loss of service. Simply downloading tools from the Internet or port scanning an IP address is not a sufficient method for security systems. Those methods can cause additional downtime or loss of confidentiality and/or integrity. CyberCore Technologies Network Security Analysis includes creating a model and analysis of your LAN environment, a threat analysis and proposed project plan. In addition we will review your security policies, operating procedures, remote entry access points, and make recommendations for appropriate improvements. Security must be challenged to be defined, contact CyberCore Technologies for a comprehensive analysis. Supplying specialists in information assurance, CyberCore Technologies assesses of vulnerabilities in your critical infrastructure and identifies potential cyber security threats. Our team will take the lead in evaluating these vulnerabilities and assist your team in forming pro-active policies and strategies for effective response. In reporting on potential threats and vulnerabilities our team will make recommendations for prevention at the technical and human levels. In addition CyberCore Technologies' industry-wide knowledge can assist you in establishing hardware and software solutions for the detection, response, and management aspects of security. When deciding which processes and functions to outsource, companies should first categorize each function as strategic or non-strategic, and define if the function is a core or non-core competency. While thinking about outsourcing your non-strategic or non-core processes, CyberCore Technologies can help you explore outsourcing strategic operations as part of your operational strategy. CyberCore Technologies offers you an integrated approach and technologies that would otherwise require your company to make a significant investment in capital, oversight, and management. By engaging CyberCore Technologies, you may free your capital and management for other growth opportunities and that often makes business sense. CyberCore Technologies focuses on partnering with clients to realize actual business benefits through a combination of people, processes, and technology. We are committed to providing a range of highly professional integration and systems management services designed to meet your business objectives. Designing and developing web-based solutions Performance assessment and improvement planning Network management and system administration CyberCore Technologies has a proven record of successfully delivering the benefits of information technology – assisting organizations utilize their information assets to enhance their responsiveness and competitiveness. We've established a standard of excellence that you may rely upon. CyberCore Technologies has established a reputation for superior expertise in security and infrastructure design, implementation, and support delivered with uncompromising professionalism. We focus on providing robust solutions built on open standards that seamlessly integrate with existing platforms and are scalable for future growth. CyberCore Technologies will identify opportunities to effectively improve your network performance, reduce down time, and positively impact the overall efficiency of your processes. When deciding which processes and functions to outsource, companies should first categorize each function as strategic or non-strategic, and define if the function is a core or non-core competency. While thinking about outsourcing your non-strategic or non-core processes, CyberCore Technologies can help you explore outsourcing strategic operations as part of your operational strategy. CyberCore Technologies offers you an integrated approach and technologies that would otherwise require your company to make a significant investment in capital, oversight, and management. By engaging CyberCore Technologies, you may free your capital and management for other growth opportunities and that often makes business sense. We specialize in providing customized infrastructure solutions that are reliable, secure, and agile through delivering: Results-oriented uses of technology Custom tailored business solutions especially for your company and organization End-to-end IT management through our full-service capability and perspective. Process excellence using proven Six Sigma methodologies Contact CyberCore Technologies to learn how our expertise can benefit your organization."
  ]
}