{
  "company": "cyberextruder.com",
  "dominant_topics": [
    1,
    -1
  ],
  "topic_counts": {
    "1": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.8125,
    "framing_market": 0.1875,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "1": 2
    }
  },
  "sample_docs": [
    "We deliver Unparalleled Speed, Pinpoint Accuracy and Full Scalability to your Facial Recognition Application. See Products Watch Video Request a demo Read use cases What we uncover about a face as it transforms from 2D to 3D allows us to solve problems no one has yet considered. See Products Replay Video Read use cases We deliver Unparalleled Speed, Pinpoint Accuracy and Full Scalability to your Facial Recognition Application. What we uncover about a face as it transforms from 2D to 3D allows us to solve problems no one has yet considered.",
    "or Register News from Second Life His and Hers Paintballing Unboxing: Fun iPhone Camera Lenses From Hong Kong How to Acquire Some #NOM It's Good to be King Bro-vice: How to Save a Marriage Left 4 Dead Valentines Day Cards Audio of Christian Bale Losing It Percival 2009 Survival Guide Dennys Free Grand Slam Visit Avatar Island in Second Life For Second Life residents that are tired of the same old look there is finally a new and unique solution to the dilemma. CyberExtruder's new Avatar Island provides an easy and quick way to create a truly personalized Avatar. Using nothing more than a passport-style photo, Second Life residents can generate a highly realistic face in just a few seconds. For more information on our automated system or to sign of for a FREE Second Life account, browse to the Avatar Island Portal . Our patent for 2D to 3D conversion issued Newark, NJ, Nov. 24 – CyberExtruder.com, Inc., a software company specializing in the field of computer vision, has been granted patents from both the United States Patent and Trademark Office (USPTO) and the World Intellectual Property Organization (WIPO). The patents, entitled \"Apparatus and Method for generating a three-dimensional representation from a two-dimensional image,\" protect the company's process for automatically creating a 3D model of a person's head from just a single 2D image. CyberExtruder's relationship with Dr. Paul Ekman goes back more than two years. In that time, we have had the privilege of working with Paul on the development of his latest release of the Micro Expression Training Tool (METT). METTOnline is a cutting edge Web 2.0 training application that teaches subscribers how to recognize those fleeting expressions that cross our faces and reveal concealed signs of anger, contempt, fear, happiness, disgust, surprise and sadness. Many of you know me as Captain Borgnine, one of the owners of Avatar Island in Second Life. Its my job to oversee the comings and goings of the technology we use and to try and make sure that everyone who wants to use it, can use it. I also have to ensure that our partners get what they need and have as few roadblocks as possible in the way of getting their own avatar making installations in place. This next generation computer vision product is the result of years of data collection and research. This first version of AutoMesh produces an accurate 3D model of a subject's head in a fully automated sub-second process and can correct for pose the is out +/- 30 degrees as viewed in the input image. AutoMesh is able to construct more robust models approximately 40 times faster than CyberExtruder's previous version. The MultiView software suite allows users to input a front view, front and one side view, or front and both side views of a subject and generate a highly detailed 3D model of the subject's head. From there, MultiView give the user the power to generate any number of views of the subject--even animated GIF's that move through whole ranges of motion. 3D virtual worlds seem to be poping up everywhere lately. Linden Lab's Second Life has been in the news a great deal, but it's not the only one. You can get your own OpenSim server, log on to ActiveWorlds or There.com and chat with your friends, or head over to Kaneva to chill out - it doesn't matter where you go, you'll still need an avatar! Try AvMaker for free! Whether you're a platform builder, an inworld developer or a resident of a virtual world, CyberExtruder makes avatar creation quick (like automatic!) and easy and now you can try it out for free. Download CyberExtruder's AvMaker software and see for yourself exactly how easy it can be! All you need is a reasonably good picture-- the AvMaker software does the rest. To begin, load your picture. Next, press the 'Make Avatar' button. CyberExtruder's AvMaker software will automatically create a 3D head model of the person in the picture--there are no points to move around and no need to locate the eyes--the software does it all! Copyright .",
    "Unbiased security and personal privacy for everyone. Industry leading performance delivering fast, accurate and highly scalable face finding and matching solutions for real‑world deployments Request a demo Solutions What can Aureus Insight do for you? CyberExtruder always has a solution for you. Our Aureus Insight platform is flexible, extendable and cost effective across the board. WATCHLIST Identification of unknown persons of interest BIOMETRIC ACCESS CONTROL Verification of known person's identity FORENSIC ANALYSIS Search recorded video for suspects and associates INTEGRATION Add facial analysis tools to your own software platform Use cases Who uses Aureus Insight? Hospitality Casinos Hotels Restaurants Instant alerts to management announcing the arrival of valuable clients and those no longer welcomed ▸ Retail loss prevention Retail stores 24 hour convenience stores Logistic hubs Mitigate the loss before it walks out the door ▸ Law enforcement & safe city Police departments Immigration and border control Intelligence agencies Preserve law and order and ensure the safety and security of citizens ▸ Fintech and Banking Banks Mobile verification Financial institutions Strengthen customer relationships through instant and painless verification for customer's financial transactions ▸ INSTALLED AND TRUSTED BY What our partners say about us The CyberExtruder Team is extremely knowledgeable in the latest advances in Facial Recognition technology and always able to see beyond what is currently being done toward what could be done. They are responsive to requests, accountable, flexible and great partners to have on a highly technical project. Mark Walch President and CEO at Sciometrics LLC CyberExtruder provides us with a high performance and easy to integrate application for the facial recognition needs of our clients. Dhimant Desai Global Director Identity & Physical Security solutions, Unisys The Aureus platform was easy to integrate and the team at CyberExtruder was really responsive to our development timeline. Justin Schorn Founder, Aimetis Its accuracy and matching speeds surpassed other systems we tested. Frank Jacovino Dir. Product Development, IPVideo Most importantly, the team at CyberExtruder is open for exploration and consistently working on getting what's already great better. Sunny Tan Dir. Program & Operations, IT&T Korea We required a facial recognition capability that would provide our customers with high levels of accuracy and speed of performance. Carl Gohringer Founder, Allevate Limited Company We are CyberExtruder As a facial recognition company, CyberExtruder continues to evolve with a focus on our mission to maintain a leadership position in the biometrics industry. Company Aureus Insight Version 6.0 outperforms all other NIST tested algorithms ▸ Company DHS S&T hosting demonstration of high-throughput biometric systems ▸ Company CyberExtruder Announces Aureus 3D-AI Enterprise at ISC West 2019 ▸ Company CyberExtruder & Hanwha Techwin Combine Expertise ▸ Unbiased security and personal privacy for everyone. Industry leading performance delivering fast, accurate and highly scalable face finding and matching solutions for real‑world deployments Request a demo Unbiased security and personal privacy for everyone. Industry leading performance delivering fast, accurate and highly scalable face finding and matching solutions for real‑world deployments Solutions What can Aureus Insight do for you? CyberExtruder always has a solution for you. Our Aureus Insight platform is flexible, extendable and cost effective across the board. WATCHLIST Identification of unknown persons of interest BIOMETRIC ACCESS CONTROL Verification of known person's identity FORENSIC ANALYSIS Search recorded video for suspects and associates INTEGRATION Add facial analysis tools to your own software platform Use cases Who uses Aureus Insight? Hospitality Casinos Hotels Restaurants Instant alerts to management announcing the arrival of valuable clients and those no longer welcomed ▸ Retail loss prevention Retail stores 24 hour convenience stores Logistic hubs Mitigate the loss before it walks out the door ▸ Law enforcement & safe city Police departments Immigration and border control Intelligence agencies Preserve law and order and ensure the safety and security of citizens ▸ Fintech and Banking Banks Mobile verification Financial institutions Strengthen customer relationships through instant and painless verification for customer's financial transactions ▸ INSTALLED AND TRUSTED BY What can Aureus Insight do for you? CyberExtruder always has a solution for you. Our Aureus Insight platform is flexible, extendable and cost effective across the board. WATCHLIST Identification of unknown persons of interest Identification of unknown persons of interest BIOMETRIC ACCESS CONTROL Verification of known person's identity Verification of known person's identity FORENSIC ANALYSIS Search recorded video for suspects and associates Search recorded video for suspects and associates INTEGRATION Add facial analysis tools to your own software platform Add facial analysis tools to your own software platform Who uses Aureus Insight? Hospitality Casinos Hotels Restaurants Instant alerts to management announcing the arrival of valuable clients and those no longer welcomed ▸ Instant alerts to management announcing the arrival of valuable clients and those no longer welcomed Retail loss prevention Retail stores 24 hour convenience stores Logistic hubs Mitigate the loss before it walks out the door ▸ Retail stores 24 hour convenience stores Logistic hubs Mitigate the loss before it walks out the door Law enforcement & safe city Police departments Immigration and border control Intelligence agencies Preserve law and order and ensure the safety and security of citizens ▸ Police departments Immigration and border control Intelligence agencies Preserve law and order and ensure the safety and security of citizens Fintech and Banking Banks Mobile verification Financial institutions Strengthen customer relationships through instant and painless verification for customer's financial transactions ▸ Banks Mobile verification Financial institutions Strengthen customer relationships through instant and painless verification for customer's financial transactions What our partners say about us The CyberExtruder Team is extremely knowledgeable in the latest advances in Facial Recognition technology and always able to see beyond what is currently being done toward what could be done. They are responsive to requests, accountable, flexible and great partners to have on a highly technical project. Mark Walch President and CEO at Sciometrics LLC CyberExtruder provides us with a high performance and easy to integrate application for the facial recognition needs of our clients. Dhimant Desai Global Director Identity & Physical Security solutions, Unisys The Aureus platform was easy to integrate and the team at CyberExtruder was really responsive to our development timeline. Justin Schorn Founder, Aimetis Its accuracy and matching speeds surpassed other systems we tested. Frank Jacovino Dir. Product Development, IPVideo Most importantly, the team at CyberExtruder is open for exploration and consistently working on getting what's already great better. Sunny Tan Dir. Program & Operations, IT&T Korea We required a facial recognition capability that would provide our customers with high levels of accuracy and speed of performance. Carl Gohringer Founder, Allevate Limited The CyberExtruder Team is extremely knowledgeable in the latest advances in Facial Recognition technology and always able to see beyond what is currently being done toward what could be done. They are responsive to requests, accountable, flexible and great partners to have on a highly technical project. The CyberExtruder Team is extremely knowledgeable in the latest advances in Facial Recognition technology and always able to see beyond what is currently being done toward what could be done. They are responsive to requests, accountable, flexible and great partners to have on a highly technical project. CyberExtruder provides us with a high performance and easy to integrate application for the facial recognition needs of our clients. CyberExtruder provides us with a high performance and easy to integrate application for the facial recognition needs of our clients. The Aureus platform was easy to integrate and the team at CyberExtruder was really responsive to our development timeline. The Aureus platform was easy to integrate and the team at CyberExtruder was really responsive to our development timeline. Its accuracy and matching speeds surpassed other systems we tested. Its accuracy and matching speeds surpassed other systems we tested. Most importantly, the team at CyberExtruder is open for exploration and consistently working on getting what's already great better. Most importantly, the team at CyberExtruder is open for exploration and consistently working on getting what's already great better. We required a facial recognition capability that would provide our customers with high levels of accuracy and speed of performance. We required a facial recognition capability that would provide our customers with high levels of accuracy and speed of performance. Company We are CyberExtruder As a facial recognition company, CyberExtruder continues to evolve with a focus on our mission to maintain a leadership position in the biometrics industry. Company Aureus Insight Version 6.0 outperforms all other NIST tested algorithms ▸ Company DHS S&T hosting demonstration of high-throughput biometric systems ▸ Company CyberExtruder Announces Aureus 3D-AI Enterprise at ISC West 2019 ▸ Company CyberExtruder & Hanwha Techwin Combine Expertise ▸ As a facial recognition company, CyberExtruder continues to evolve with a focus on our mission to maintain a leadership position in the biometrics industry. Company Aureus Insight Version 6.0 outperforms all other NIST tested algorithms ▸ Aureus Insight Version 6.0 outperforms all other NIST tested algorithms Company DHS S&T hosting demonstration of high-throughput biometric systems ▸ DHS S&T hosting demonstration of high-throughput biometric systems Company CyberExtruder Announces Aureus 3D-AI Enterprise at ISC West 2019 ▸ CyberExtruder Announces Aureus 3D-AI Enterprise at ISC West 2019 Company CyberExtruder & Hanwha Techwin Combine Expertise ▸ CyberExtruder & Hanwha Techwin Combine Expertise"
  ]
}