{
  "company": "dataworksplus.com",
  "dominant_topics": [
    1,
    3,
    -1,
    18
  ],
  "topic_counts": {
    "1": 45,
    "3": 3,
    "-1": 2,
    "18": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "3": "vantage, development, document, ai, prioxis",
    "18": "evidence, digital evidence, data, case, attorneys"
  },
  "framing_scores": {
    "framing_ethical": 0.0730337078651685,
    "framing_surveillance": 0.6235955056179775,
    "framing_market": 0.3033707865168539,
    "num_docs": 51
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "1": 45,
      "3": 3,
      "18": 1
    }
  },
  "sample_docs": [
    "Simple fingerprint identification that shows the photo or record for identity verification. Easy to use for booking, patrol, movement, release, courts or anywhere that secure positive ID is needed! How does it work? Automated scan of single fingers on a high-resolution scanner Immediate visual and automated quality check, minutiae extraction, template creation, and image with template storage into central database. Searches by one fingerprint until database is large enough to warrant using two Conducts a one to many search at an approximate rate of 2000 per second per processor Displays photo and data when a match is found User selected threshold settings allows single or multiple search respondent IDs See the associated mugshot automatically when a fingerprint match is made Can be on the same or separate PC based workstation as your Digital PhotoManager Single or two finger automated ID Auto Scanner Start, scanner captures fingerprint as soon as it is placed on the platen Used at intake and release to significantly increase the productivity of your identification process. May be used to match against ten print databases Back to PhotoManager PhotoManager Modules & Options Where to Get Grant Money Request a Quote 1168 North Pleasantburg Drive, Greenville, SC 29607 Tel (864) 672-2780 . Fax (864) 672-2787 . e-mail sales@dataworksplus.com [ About Us ] [ Products ] [ Partners ] [ Seminars ] [ Support ] [ Press Room ] [ Jobs ] [ Contact Us ]",
    "Technology for Law Enforcement Professionals DataWorks Plus is dedicated to providing you with digital law enforcement solutions that streamline your work processes and save your agency money. DataWorks Plus has developed leading-edge applications to bring you state-of-the-art equipment and solutions to your law-enforcement photographic needs. Our products will help you capture, store and secure crime scene photos , streamline inmate booking , manage your electronic ten-print fingerprint records , and automate vehicle identification (TAG-NABIT) . Your agency can securely store images on your network so your entire staff can retrieve them on-demand via our integrated web applications.All of this can be accomplished while completely preserving the integrity of the original photographs, images, and records for identification and trial. We invite you to take a closer look at our web enabled suite of products and request a quote today!",
    "iMUG Digital PhotoManager FACE Plus SAF-ID Web Retrieve Digital CrimeScene Image Authentication Digital Interview NIST Manager Plus SAF-ID Mugshot, Booking & Identification iMUG Follow today's leader in law enforcement imaging. DataWorks Plus is the first to offer a National Mugshot Image Sharing System. Introducing iMUG, today's most advanced system for sharing mugshot images across the country. Search and retrieve from a database of millions of mugshot photos from law enforcement agencies nationwide. Digital PhotoManager Utilize the power of Microsoft SQL server & Internet Explorer when managing your your mugshot photographs. FACE Plus Facial recognition solution for mugshot imaging. SAF-ID Single Automated Fingerprint Identification system Web Retrieve Single Image Mugshot Web Client This easy to use viewer allows you to access mug shots from any computer on the network using your existing TFP system and Internet Explorer. C rime Scene Management Digital CrimeScene Now you can capture, store and protect your crime scene photography with digital security. Image Authentication Camera/Scanner based image authentication for the highest level of image security. Digital Interview Record all of your suspect or witness audio straight to digital format. Fingerprint Management & Archive NIST Manager Plus Archive and manage your valuable electronic ten print fingerprint and palm print image files. SAF-ID Single Automated Fingerprint Identification system Property & Evidence PIPES Property and Evidence tracking and management system.",
    "September 2005: San Diego County Sheriff's Department Awards DataWorks Plus Contract for Digital Mugshot Management System September 2005: Austin, TX Awards Contract for Digital Management System April 1, 2005: Miami-Dade Police Department Awards DataWorks Plus Contract for Photo Imaging & Facial Recognition System April 1, 2005: Shelby County Tennessee Awards DataWorks Plus Contract for Inmate Booking Photo & Armband System February 4, 2005: Greer PD Awards DataWorks Plus the contract for Digital PhotoManager & LiveScan Plus September 29, 2004: DataWorks Plus' Digital PhotoManager Software is shown on NBC's Law & Order April 28, 2004: DataWorks Plus Provides NYPD With a Statewide Domestic Violence System SAN DIEGO COUNTY SHERIFF'S DEPARTMENT AWARDS CONTRACT FOR DIGITAL MUGSHOT MANAGEMENT SYSTEM San Diego, CA - Dataworks Plus will supply San Diego County Sheriff's Department a Digital Mugshot Management and Lineup System. The system will capture and retrieve images locally as well as collect images and data for the Sheriff's Jail Information Management System (JIMS), Juvenile and Adult Probation, Cal-Photo, Cal-ID, Courts - Book and Release, Licensing, Cite and Release, and Registrants. Digital PhotoManager™ will capture Front/Side Facial Views, Scars, Marks, and Tattoos of Arrestees. The installation of the Digital PhotoManager mugshot management and lineup system will begin early in 2006. AUSTIN, TX AWARDS CONTRACT FOR DIGITAL MANAGEMENT SYSTEM Austin, TX - The City of Austin, Texas awarded DataWorks Plus a contract for a digital management system for the Police Department Forensics Lab. Digital CrimeScene™ will be installed on 10 input stations agency wide, including at multiple substations. The City of Austin will use the system for secure management all of their crime scene records and images. Once installed, the City of Austin will have Digital CrimeScene™ integrated with their Noritsu Printers. This integration will allow users to print images and image groups directly to the Noritsu Printers on the network. MIAMI-DADE POLICE DEPARTMENT AWARDS DATAWORKS PLUS CONTRACT FOR PHOTO IMAGING AND FACIAL RECOGNITION SYSTEM Miami, FL - Miami-Dade Police Department (MDPD) has awarded a contract to Dataworks Plus for a combined Juvenile/Adult Mugshot Photo Imaging and Facial Recognition System that will be operational 7 days a week, 24 hours a day, 365 days a year. The system's architecture includes both client/server for photo capture and web enabled technology for regional law enforcement retrieval purposes. The system will be used by the Miami-Dade Police Department, Miami-Dade Corrections and Rehabilitations Department (MDCRD), the Miami-Dade Juvenile Assessment Center (JAC), and other local agencies for investigative and identification purposes. The system will capture Front/Side Facial Views, Scars, Marks, and Tattoos of Arrestees to be used with automated facial recognition and physical/demographic data to identify individuals and create photographic lineups. The system will enhance the Departments' abilities to share data and photos with other agencies in the region, state, and nation. The MDPD, the JAC, and MDCRD expect the Photo Imaging System and all its components to function as an essential, effective, and integral part of each agencies' existing information systems' hardware and software architecture, which will also include electronic fingerprint identification, criminal justice information, and other essential criminal justice system integration. SHELBY COUNTY AWARDS DATAWORKS PLUS CONTRACT FOR INMATE BOOKING PHOTO & ARMBAND SYSTEM Shelby, TN - Shelby County Government's Sheriff's Department (the \"County\") has awarded Dataworks Plus a contract to implement an Inmate Booking Photo and Armband System. The system capture Arrestee Mugshot Front/Side Facial Photos as well as Scars Marks and Tattoo photos. The system will provide investigators and other Law Enforcement personnel within Shelby County Sheriff Department, Memphis Police Department, and other local agencies the ability to search and display photos using physical and demographic descriptors to find specific photos. The system will be as an investigative tool to identify suspects and create photo lineups, wanted photos, Amber Alert photos, and media release photos. DATAWORKS PLUS EXPANDS IN LOCAL MARKET GREER PD AWARDS DATAWORKS PLUS CONTRACT FOR DIGITAL PHOTOMANAGER & LIVESCAN PLUS Greer, SC - Greer Police Department has issued DataWorks Plus a contract to install Digital PhotoManager and LiveScan Plus. LiveScan Plus is a fully integrated booking module that will capture fingerprints, mugshots and data from one integrated booking station. Greer PD has chosen to add on-line storage of ten-print records as well as the use of the on-screen print comparison feature. Greer is one of the first to use the recently enhanced LiveScan Plus system. The new system has an innovative design that significantly simplifies and shortens criminal bookings and background check procedures with the ability to digitally capture both slap and roll fingerprints. LiveScan Plus has superior image quality enhancement features specifically designed to minimize FBI fingerprint submission rejections resulting from difficult to fingerprint individuals, improperly captured images and works regardless of stains on fingers from ink, dyes, grease or dirt. Single finger and rolled impression Images produced by LiveScan Plus are consistently high quality 500 DPI images. DATAWORKS PLUS' DIGITAL PHOTOMANAGER SOFTWARE SHOWN ON NBC'S LAW & ORDER Digital PhotoManager was seen used on NBC's Law & Order's Episode E5304, \"The Brotherhood.\" DataWorks Plus received several calls the following days from customers who recognized Digital PhotoManager being used. The characters Joe Fontana (Dennis Farina) and Detective Ed Green (Jesse L. Martin) were looking for known accomplices of a suspect. They used Digital PhotoManager to locate the information and images of one of the accomplices. for more information on Law & Order's Brotherhood episode. DATAWORKS PLUS' PROVIDES NYPD WITH A STATEWIDE DOMESTIC VIOLENCE SYSTEM New York, NY - The purpose of this system is to download Domestic Violence Photos from a Kodak Digital camera at desk workstations of all commands that have a domestic violence unit (each precinct and police service area, approximately 86 sites). These photos, along with case information, will be transmitted from the desk workstation to a main Photo Imaging Server at NYPD-MISD. These images and data records will be available to investigators and other users through a Photo Imaging WebRetrieve application via the NYPD network. Additionally, the Domestic Violence Photos and Data will be available, in arrest cases, for transmittal to the Mayor's Office-DoITT for dissemination to the appropriate District Attorney's Office. The Domestic Violence Digital application will be added to the Precinct/Police Service Area desk workstation. This application will allow the operator to create a Domestic Violence record. The operator can key data, establish a link to Omni-Form and DIR Database, or acquire data from other sources to be determined. The operator will view photos on the Kodak Digital Camera through a USB port and the Kodak Easy Dock station. The operator will have the ability to select all or any number of photos from the camera to be added to the record. Additionally, other TWAIN compliant input devices like Photo Scanners can be attached to the Precinct workstations to input photos or other digital evidence in the future. The application will save the records to the local hard drive and continually try to forward the record to the server. This methodology will insure that a user can add records and photos regardless of whether the network or server is available. Once the record is transferred to the server successfully, the record will be removed from the local hard drive and the disk space will be recovered. A Photo Imaging WebRetrieve Application/Website is currently in place on the NYPD WAN. Hundreds of Users are currently trained and using this application. We propose that the same application interface be used for Domestic Violence. The user would be given the choice to select from a number of databases within a single website including Arrestee, Missing Persons, Gun Permits, and Domestic Violence to search and display records with photos. This option will also eliminate the need for additional user management and activity tracking setup. Each database has its own database design, customized screens, and report formats. Access will be limited to authorized users with valid passwords and different user groups will be developed with various functions (I.E.: adding new cases, viewing cases, updating cases, etc.).",
    "iMUG Digital PhotoManager LiveScan Plus FACE Plus SAF-ID Web Retrieve FACES Composite Digital CrimeScene Digital Interview NIST Manager Plus SAF-ID LiveScan Plus DataWorks Plus' Face Plus uses the very latest in facial recognition technology that is used as a module of Digital PhotoManager. Images can be checked at intake, release, movement, or at mobile data terminals for inmate verification. Images can also be checked against your Watch List database to identify wanted individuals. Images can be uploaded in order to perform one-to-many facial recognition searches. All matches to the facial recognition search will be displayed by photo, allowing the user to view each record with the additional photos and data for further verification. When inmates are screened at booking you can verify if they have a previous record. If so, you can automatically import their existing data into the new booking. Some unique benefits of this system are that it can search against any size database and the system searches for facial features and ignores things like hair color, glasses, and background. How does it work? Automated quality check and face template creation occurs when you capture a mugshot The template and facial image are stored for immediate and future ID searches Conducts a one to many search of entire database Displays photos and data when matches are found Why FACE Plus? User selected threshold settings allows single or multiple search respondent IDs Check image at capture, release, or movement to verify individual's identity Use on the same or separate PC based workstation as Digital PhotoManager Optional future surveillance addition that allows for moving video capture Display ID, record, specific data or previous images Face print template generated from mugshot Auto facial finding and cropping feature One-to-one verification: Takes less than 1 second One-to-many ID Search: 1 million per minute per processor / 16,000 per second per processor Watch List comparison Once a facial recognition database has been created it can be enhanced with the optional surveillance option. This option allows the agency to use facial recognition against moving video capture. Digital PhotoManager Modules & Options FACES Composite Request a Quote Where to Get Grant Money DataWorks Plus' Face Plus uses the very latest in facial recognition technology that is used as a module of Digital PhotoManager. Images can be checked at intake, release, movement, or at mobile data terminals for inmate verification. Images can also be checked against your Watch List database to identify wanted individuals. Images can be uploaded in order to perform one-to-many facial recognition searches. All matches to the facial recognition search will be displayed by photo, allowing the user to view each record with the additional photos and data for further verification. When inmates are screened at booking you can verify if they have a previous record. If so, you can automatically import their existing data into the new booking. Some unique benefits of this system are that it can search against any size database and the system searches for facial features and ignores things like hair color, glasses, and background. How does it work? Automated quality check and face template creation occurs when you capture a mugshot The template and facial image are stored for immediate and future ID searches Conducts a one to many search of entire database Displays photos and data when matches are found User selected threshold settings allows single or multiple search respondent IDs Check image at capture, release, or movement to verify individual's identity Use on the same or separate PC based workstation as Digital PhotoManager Optional future surveillance addition that allows for moving video capture Display ID, record, specific data or previous images Face print template generated from mugshot Auto facial finding and cropping feature One-to-one verification: Takes less than 1 second One-to-many ID Search: 1 million per minute per processor / 16,000 per second per processor Once a facial recognition database has been created it can be enhanced with the optional surveillance option. This option allows the agency to use facial recognition against moving video capture. Digital PhotoManager Modules & Options FACES Composite Request a Quote Where to Get Grant Money"
  ]
}