{
  "company": "dpmsys.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 20,
    "-1": 10
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.5609756097560976,
    "framing_surveillance": 0.2195121951219512,
    "framing_market": 0.2195121951219512,
    "num_docs": 30
  },
  "topic_timeline": {
    "20": {
      "-1": 10,
      "0": 20
    }
  },
  "sample_docs": [
    "Industries & Solutions Banking Government Services Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Training Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Products iBuilder Border Security Hardware Biometric Solutions Secure Audit Vault Mobile I.D. and Verification TRS Time Recording System Biometric Terminals Audit Trail Document Integration e-Visa Mobile I.D. and Verification TRS Time Recording System Steve is a business Intelligence expert and has over 10 years experience working with clients to help build information points that focus on decision making to improve sales, marketing spend and product lifecycles Peter is a thought leader in the ongoing development of national border security solutions and has managed many implementations of these systems around the globe. Powerful and Flexible Data Capture Iain is an expert in document integration and forms management. Electronic data capture, replacing paper forms, reduces business costs and wasted time. The streamlining of processes through the correct use of I.C.T. drives vital revenue. Colin uses his expertise in Biometrics to help governments tightly bind a traveller to his or her identity, by using physiological characteristics. Unlike other identification methods, such as identification cards or passwords, biometrics are less easily lost, stolen, or guessed. Tel: +1 246 427 8901 Email: info@dpmsys.com",
    "Industries & Solutions Banking Government Services Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Training Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Products iBuilder Border Security Hardware Biometric Solutions Secure Audit Vault Mobile I.D. and Verification TRS Time Recording System Biometric Terminals Audit Trail Document Integration e-Visa Mobile I.D. and Verification TRS Time Recording System DPM Systems (Barbados) Ltd is committed to protecting your privacy and developing technology that gives you the most powerful and safe online experience. This Statement of Privacy applies to the Dpmsys.com Web site and governs data collection and usage. By using the Dpmsys.com website, you consent to the data practices described in this statement. Collection of your Personal Information DPM Systems (Barbados) Ltd collects personally identifiable information, such as your e-mail address, name, home or work address or telephone number. DPM Systems (Barbados) Ltd also collects anonymous demographic information, which is not unique to you, such as your ZIP code, age, gender, preferences, interests and favorites. There is also information about your computer hardware and software that may also be automatically collected by DPM Systems (Barbados) Ltd. This information can include: your IP address, browser type, domain names, access times and referring Web site addresses. This information is used by DPM Systems (Barbados) Ltd for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Dpmsys.com Web site. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Dpmsys.com public message boards, this information may be collected and used by others. Note: DPM Systems (Barbados) Ltd does not read any of your private online communications. DPM Systems (Barbados) Ltd encourages you to review the privacy statements of Web sites you choose to link to from Dpmsys.com so that you can understand how those Web sites collect, use and share your information. DPM Systems (Barbados) Ltd is not responsible for the privacy statements or other content on Web sites outside of the Dpmsys.com and DPM Systems (Barbados) Ltd family of Web sites. Use of your Personal Information DPM Systems (Barbados) Ltd collects and uses your personal information to operate the Dpmsys.com Web site and deliver the services you have requested. DPM Systems (Barbados) Ltd also uses your personally identifiable information to inform you of other products or services available from DPM Systems (Barbados) Ltd and its affiliates. DPM Systems (Barbados) Ltd may also contact you via surveys to conduct research about your opinion of current services or of potential new services that may be offered. DPM Systems (Barbados) Ltd does not sell, rent or lease its customer lists to third parties. DPM Systems (Barbados) Ltd may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is not transferred to the third party. In addition, DPM Systems (Barbados) Ltd may share data with trusted partners to help us perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to DPM Systems (Barbados) Ltd, and they are required to maintain the confidentiality of your information. DPM Systems (Barbados) Ltd does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. DPM Systems (Barbados) Ltd keeps track of the Web sites and pages our customers visit within DPM Systems (Barbados) Ltd, in order to determine what DPM Systems (Barbados) Ltd services are the most popular. This data is used to deliver customized content and advertising within DPM Systems (Barbados) Ltd to customers whose behavior indicates that they are interested in a particular subject area. DPM Systems (Barbados) Ltd Web sites will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on DPM Systems (Barbados) Ltd or the site; (b) protect and defend the rights or property of DPM Systems (Barbados) Ltd; and, (c) act under exigent circumstances to protect the personal safety of users of DPM Systems (Barbados) Ltd, or the public. The Dpmsys.com Web site uses \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a Web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize Dpmsys.com pages, or register with Dpmsys.com site or services, a cookie helps DPM Systems (Barbados) Ltd to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same DPM Systems (Barbados) Ltd Web site, the information you previously provided can be retrieved, so you can easily use the DPM Systems (Barbados) Ltd features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the DPM Systems (Barbados) Ltd services or Web sites you visit. Security of your Personal Information DPM Systems (Barbados) Ltd secures your personal information from unauthorized access, use or disclosure. DPM Systems (Barbados) Ltd secures the personally identifiable information you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When personal information (such as a credit card number) is transmitted to other Web sites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. Changes to this Statement DPM Systems (Barbados) Ltd will occasionally update this Statement of Privacy to reflect company and customer feedback. DPM Systems (Barbados) Ltd encourages you to periodically review this Statement to be informed of how DPM Systems (Barbados) Ltd is protecting your information. DPM Systems (Barbados) Ltd welcomes your comments regarding this Statement of Privacy. If you believe that DPM Systems (Barbados) Ltd has not adhered to this Statement, please contact DPM Systems (Barbados) Ltd at info@dpmsys.com. We will use commercially reasonable efforts to promptly determine and remedy the problem. Tel: +1 246 427 8901 Email: info@dpmsys.com",
    "Industries & Solutions Banking Government Services Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Training Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Products iBuilder Border Security Hardware Biometric Solutions Secure Audit Vault Mobile I.D. and Verification TRS Time Recording System Biometric Terminals Audit Trail Document Integration e-Visa Mobile I.D. and Verification TRS Time Recording System Replacing paper with electronic forms reduces business costs and wasted time.... Not only is a paperless organisation more eco-friendly, but it also benefits in increased organisational efficiency, increased business visibility and enables you to abide to compliance, legal and regulatory requirements. Today's businesses have to be efficient in every department to stay competitive and the streamlining of processes through the correct use of I.C.T. drives vital revenue. Some of the many benefits are: Cost – cost of paper, cost of office storage space, cost of staff dealing with paper Staff – reduces the number of employees dealing with paperwork and manual tasks Visibility – audit trails – electronic forms enable you to have visibility over your processes. everything is stored in the database. Compliance, legal and regulatory requirements – government regulations, legal requirements, lost documents, data security Efficiency – Improves organisational efficiency, minimizes risks, enforces organisational policies. Powerful and Flexible Data Capture.... Implementation of a data capture system underpinned by the DPM Systems forms module ensures instant benefits for both external customers – users who will be entering data into the forms – and internal customers – those users who will receive and process the captured data. Data entry is no longer paper based, so users gain familiar features like copy and paste and the ability to undo and correct mistakes, with a reduction in costs associated with form printing and handling being a natural by-product of the move away from paper. The quality of the data captured is improved through validation built into each form created, and a full audit trail is created for each and every entry made to a form. Giving You Ultimate Control.... The DPM Systems forms module offers highly customisable form creation facilities which can be used to provide forms that cater for a wide range of data capture requirements. Forms can be created using pre-defined templates as a basis, or from scratch for ultimate control over layout and functionality. Easy Integration.... Alongside the forms module's data capturing capability comes the ability to interface with external systems for data processing and exchange of information. Standardised API methods are used to provide two way (export and import) data transfer between the forms module and an external system allowing the forms module to be easily integrated into existing business processes. Flexible Deployment.... Data entry forms created with the DPM Systems forms module can reside on either a PC machine running a Microsoft Windows operating system or on IBM i platforms (formerly AS/400, iSeries, System i), giving a choice of deployment options. Mobile I.D. and Verification TRS Time Recording System Tel: +1 246 427 8901 Email: info@dpmsys.com",
    "Industries & Solutions Banking Government Services Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Training Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Products iBuilder Border Security Hardware Biometric Solutions Secure Audit Vault Mobile I.D. and Verification TRS Time Recording System Biometric Terminals Audit Trail Document Integration e-Visa Mobile I.D. and Verification TRS Time Recording System Reliable Identity Verification.... National Border Security and Immigration technology is currently responding to the demands of reducing the threat of terrorist attacks, drug trafficking and other crime, illegal immigrants and illegal workers, whilst ensuring that the movement of bona fide travellers across international borders is smooth and fast. The collection of biometric information from travellers is a key area of development in the industry, to provide fast and reliable identity verification. This technology now forms an integral element of DPM's solution. Using biometrics as identifiers for border security purposes is appealing because they can help tightly bind a traveler to his or her identity by using physiological characteristics. Unlike other identification methods, such as identification cards or passwords, biometrics are less easily lost, stolen, or guessed. Integrate Biometric data with Multiple Applications.... The DPM Biometrics Module is used for the capture, storage and validation of biometric information for travellers entering and leaving, if applicable, the country. The Biometrics Database can be used as a central repository for all biometric uses within the country, providing the capability for future integration with many applications that have a requirement for the use of biometric information. Applications include but are not limited to: Fast-Track Booths for Clearance of Travellers Policing and Forensic Investigation Access control for staff Avoiding Future Duplication.... In addition to adding extra security in areas such as stolen / falsified travel documents, anti-terrorism and criminality, implementation of the Biometrics Module, with its integration capability, will provide long-term benefits and cost/time savings by avoiding future duplication of biometric verification systems across many government departments. Mobile I.D. and Verification TRS Time Recording System Tel: +1 246 427 8901 Email: info@dpmsys.com",
    "Industries & Solutions Banking Government Services Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Training Business Application Innovation Business Analytics Business Strategy IT Mobility Services Technical Support Application Management Software Outsourcing Data Integrity Network Security Financial Crime Products iBuilder Border Security Hardware Biometric Solutions Secure Audit Vault Mobile I.D. and Verification TRS Time Recording System Biometric Terminals Audit Trail Document Integration e-Visa Mobile I.D. and Verification TRS Time Recording System e-IT (User-Friendly IT Services).... Get your IT projects and service under control! Organize and effectively manage projects! The e-IT will facilitate the comprehensive support of all projects undertaken by your department. This includes such tasks as managing cases, tasks, resources, hours worked and suppliers. The functionality of the support of service requests and the knowledge database will enable you to improve communication, raise the quality of IT services and eliminate errors, thus effectively increasing satisfaction with the business. Management and Support of IT Projects.... You more than likely run a number of important IT projects within your department in parallel. Forget about your problems! Sort out and collect information in one place, which concerns not only the same projects, but also resources, documents and tasks. Do not waste time on constantly answering the same questions and give employees and suppliers access to information on the status of projects, documents, schedules and completed tasks. Task and Resource Management.... Do you know precisely who is carrying out projects and what tasks are allotted to them? The e-IT will help you to gain control of your projects and the huge workload of tasks to be done by both your staff and suppliers. Allocate tasks to people involved in projects, manage statuses and completion times. This will enable you to gain an accurate picture of when a project is to be completed and plan resources accordingly. Logging Hours Worked on a Project.... Gain access to accurate knowledge on hours worked on a given project! The logging of hours worked and integration with your ERP system will enable you to obtain the precise costs of implementing projects, which will help you to manage the IT department more effectively. This information will allow you to perform a reliable assessment of your employees and you will only charge clients for the actual time spent working for them! Management of Communication within a Project.... Eliminate errors caused by uncoordinated communication within a project. Using project notice boards you can securely exchange information on a particular project, manage documents (including their versions), such as commissioning changes, records of receipt, contracts, reports, etc. and communication with suppliers and employees. And all this brought together in one place! What is more, you can give access to a dashboard on a specific screen, so that staff receive up-to-date data on projects, in which they are involved as well as lots of other important information. Support and Management of Service Requests (Helpdesk).... Improve the effectiveness of the management of service requests! Provide all employees with a simple way of reporting service errors and tracking their repair status. This will stop you receiving unnecessary requests and increase satisfaction with the business. 4e-IT will enable you to efficiently manage incidents, problems, SLA agreements and also allocate resources and monitor your service department. Solving problems has never been so easy and efficient! Knowledge Database.... Build up a knowledge database and do not waste your team's time on repairing the same errors and solving the same problems every time! Using the comprehensive knowledge database on projects, problems and their solutions you can seamlessly allocate new people to a project. You will never lose data if someone leaves a project, and you yourself will have accurate knowledge of and control over the entire history of its completion. Notice Board.... Do you spend a lot of time looking through your email and document attachments? That is all in the past! From now on you can publish and share information between selected users within the framework of themed notice boards. Thanks to information being made available within the context of a single project, you will have rapid access to histories, attachments, documents and comments by project participants. Tel: +1 246 427 8901 Email: info@dpmsys.com"
  ]
}