{
  "company": "en.cudo.co.kr",
  "dominant_topics": [
    14,
    7,
    0
  ],
  "topic_counts": {
    "14": 12,
    "7": 1,
    "0": 1
  },
  "topic_descriptions": {
    "14": "authored, minivision, minivision technology, panasonic, singapore",
    "7": "ramco, payroll, aviation, en, ramco systems",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.125,
    "framing_market": 0.875,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "7": 1,
      "14": 12
    }
  },
  "sample_docs": [
    "My account Sign out 24th Anniversary of CUDO Communication Co., Ltd. Leading the Future of Security Technology We create a safe Korea where people can live together 24th Anniversary of CUDO Communication Co., Ltd. Leading the Future of Security Technology We create a safe Korea where people can live together HAPPINESS & FUTURE CREATOR Since its establishment in 2000, CUDO Communication has steadily grown into a specialized company in information and communication systems (SI) and AI security solutions. Based on rich experience, expertise, global network, and proven technological capabilities in Korea, we are creating changes for \"Happiness & Future Creator.\" Since its establishment in 2000, CUDO Communication has steadily grown into a specialized company in information and communication systems (SI) and AI security solutions. Based on rich experience, expertise, global network, and proven technological capabilities in Korea, we are creating changes for \"Happiness & Future Creator.\" HAPPINESS & FUTURE CREATOR Since its establishment in 2000, CUDO Communication has steadily grown into a specialized company in information and communication systems (SI) and AI security solutions. Based on rich experience, expertise, global network, and proven technological capabilities in Korea, we are creating changes for \"Happiness & Future Creator.\" Since its establishment in 2000, CUDO Communication has steadily grown into a specialized company in information and communication systems (SI) and AI security solutions. Based on rich experience, expertise, global network, and proven technological capabilities in Korea, we are creating changes for \"Happiness & Future Creator.\" BUSINESS CUDO Communication's Business Areas Find More Global Global Solutions Solutions DX DX Strategy Strategy Security Security Information Security Information Security LED LED CUDO Communication's Business Areas Locations CUDO Communication Headquarters in Gwacheon icon Address. DX Tower 12F, 9 Gwacheon-daero 7na-gil, Gwacheon-si, Gyeonggi-do, South Korea Tel. +82 2-521-3887 CUDO Communication CCTV Factory icon Address. Ace Cheongye Tower A-401, 53 Seonggokaero, Uiwang-si, Gyeonggi-do, South Korea Tel. +82 70-4047-8446 CUDO Communication Headquarters in Gwacheon Address. DX Tower 12F, 9 Gwacheon-daero 7na-gil, Gwacheon-si, Gyeonggi-do, South Korea CUDO Communication CCTV Factory Address. Ace Cheongye Tower A-401, 53 Seonggokaero, Uiwang-si, Gyeonggi-do, South Korea Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Information Security LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Vision and CI Our Journey 2020's 2010's 2000's Awards, Certifications, Patents Value Culture Inquiries Product Materials Technical Documents Hash Information Information Security Business Division LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Our Journey 2020's 2010's 2000's Information Security Business Division Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication .",
    "My account Sign out CUDO Communication creates a better future through change and innovation ← 2019-2010 → 2020's 2010's 2000's CUDO Communication creates a better future through change and innovation 2019 Designated as Excellent Product by Public Procurement Service \"Deep Learning-based Multi-Purpose Object Recognition Intelligent CCTV System\" Constructed Multi-Cinema Wall System at Seoul National University Hospital Patent Registration: \"Real-time IPTV Channel Switching System\" Designated as Excellent Product by Public Procurement Service \"Deep Learning-based Multi-Purpose Object Recognition Intelligent CCTV System\" Constructed Multi-Cinema Wall System at Seoul National University Hospital Patent Registration: \"Real-time IPTV Channel Switching System\" 2018 Certified as Family-Friendly Company Received DEEP Certification from Duksung Women's University Certified as Family-Friendly Company Received DEEP Certification from Duksung Women's University 2017 Constructed CCTV Security Management System for PyeongChang Olympics Established Distribution Agreement with Forscout Received TTA Verified Certificate Won Top Prize at WSCW Smart Public Service Marketing Collaboration for Intelligent Video Analysis with Hanwha Techwin Constructed CCTV Security Management System for PyeongChang Olympics Established Distribution Agreement with Forscout Received TTA Verified Certificate Won Top Prize at WSCW Smart Public Service Marketing Collaboration for Intelligent Video Analysis with Hanwha Techwin 2016 Received Presidential Commendation for Outstanding Small and Medium Enterprise Selected as Youth-Friendly Small and Medium Enterprise Received Presidential Commendation for Outstanding Small and Medium Enterprise Selected as Youth-Friendly Small and Medium Enterprise 2015 Selected for G-PASS for Overseas Procurement Market Entry Established Value Added Reseller Contract with Samsung SDS Constructed Video Surveillance Dispatch System for Han River Bridges Selected for G-PASS for Overseas Procurement Market Entry Established Value Added Reseller Contract with Samsung SDS Constructed Video Surveillance Dispatch System for Han River Bridges 2014 Supplied Intelligent CCTV for Gimpo City Integrated Control Constructed Intelligent CCTV for Jinju and Ulsan Prosecutors' Offices Supplied Intelligent CCTV for Gimpo City Integrated Control Constructed Intelligent CCTV for Jinju and Ulsan Prosecutors' Offices 2013 Designated Excellent Product by Public Procurement Service - 'Intelligent CCTV' Registered Q Mark and K Mark Constructed CCTV System for Sungnyemun Gate Designated Excellent Product by Public Procurement Service - 'Intelligent CCTV' Registered Q Mark and K Mark Constructed CCTV System for Sungnyemun Gate 2012 Registered GS Certification / TL9000 Certification Received Broadcasting Communication Commission Commendation for IPTV Activation Contribution Registered GS Certification / TL9000 Certification Received Broadcasting Communication Commission Commendation for IPTV Activation Contribution 2011 Constructed Comprehensive Security Systems for: Four Major Palaces and Jongmyo Shrine (Cultural Heritage Administration) Constructed Comprehensive Security Systems for: Blue House Presidential Security Office CCTV System Constructed Comprehensive Security Systems for: Four Major Palaces and Jongmyo Shrine (Cultural Heritage Administration) Constructed Comprehensive Security Systems for: Blue House Presidential Security Office CCTV System 2010 Constructed Comprehensive Security System for Royal Tombs Awarded G20 Summit Intelligent System Implementation Project Patent Registration: \"Universal Memory Device and Broadcasting Data Processing Method\" Performed Scalable Data-based Edutainment Core Technology Development Project Established Distribution Contract with Altech IT Solutions (Germany) for Email Archiving (EMA) Constructed Comprehensive Security System for Royal Tombs Awarded G20 Summit Intelligent System Implementation Project Patent Registration: \"Universal Memory Device and Broadcasting Data Processing Method\" Performed Scalable Data-based Edutainment Core Technology Development Project Established Distribution Contract with Altech IT Solutions (Germany) for Email Archiving (EMA) ← 2020's 2000's → Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Information Security LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Vision and CI Our Journey 2020's 2010's 2000's Awards, Certifications, Patents Value Culture Inquiries Product Materials Technical Documents Hash Information Information Security Business Division LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Our Journey 2020's 2010's 2000's Information Security Business Division Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication .",
    "My account Sign out Award ∙ Certification ∙ Patent CUDO Communication's Patent Awards Certifications Patents Award ∙ Certification ∙ Patent No Title Author Time uploaded Views Likes 16 [Patent Certificate – 2023] LED Display Device Capable of Power Saving Control and Method for Operating the Same (Patent No. 10-2605017) 관리자 31 Mar 2025 Views 2 0 15 [Patent Certificate – 2023] Display Panel System Capable of Video Output Control Using Security Authentication and Method for Controlling Video Output of the System (Patent No. 10-2616967) 관리자 31 Mar 2025 Views 1 0 14 [Patent Certificate – 2021] Uninterruptible Parallel Power Supply Display Panel and Method for Driving the Same (Patent No. 10-2202914) 관리자 31 Mar 2025 Views 1 0 13 [Patent Certificate – 2021] Multi-LED Unit Installation Device (Patent No. 10-2207491) 관리자 31 Mar 2025 Views 1 0 12 [Patent Certificate – 2021] Height-Adjustable LED Display Device (Patent No. 10-2209285) 관리자 31 Mar 2025 Views 1 0 11 [Patent Certificate – 2021] LED Display Panel and Method for Driving the Same (Patent No. 10-2320636) 관리자 31 Mar 2025 Views 2 0 10 [Patent Certificate – 2020] Slim-Type LED Display Panel and Method for Manufacturing the Same (Patent No. 10-2194503) 관리자 31 Mar 2025 Views 1 0 9 [Patent Certificate – 2020] CCTV Video Analysis Device Based on DCNN for Object Image Recognition and Method for Operating the Same (Patent No. 10-2194499) 관리자 31 Mar 2025 Views 1 0 8 [Trademark Registration – 2020] United States Trademark Registration 관리자 31 Mar 2025 Views 1 0 7 [Trademark Registration – 2020] China Trademark Registration (No. 40205886) 관리자 31 Mar 2025 Views 1 0 New post [Patent Certificate – 2023] LED Display Device Capable of Power Saving Control and Method for Operating the Same (Patent No. 10-2605017) [Patent Certificate – 2023] Display Panel System Capable of Video Output Control Using Security Authentication and Method for Controlling Video Output of the System (Patent No. 10-2616967) [Patent Certificate – 2021] Uninterruptible Parallel Power Supply Display Panel and Method for Driving the Same (Patent No. 10-2202914) [Patent Certificate – 2021] Multi-LED Unit Installation Device (Patent No. 10-2207491) [Patent Certificate – 2021] Height-Adjustable LED Display Device (Patent No. 10-2209285) [Patent Certificate – 2021] LED Display Panel and Method for Driving the Same (Patent No. 10-2320636) [Patent Certificate – 2020] Slim-Type LED Display Panel and Method for Manufacturing the Same (Patent No. 10-2194503) [Patent Certificate – 2020] CCTV Video Analysis Device Based on DCNN for Object Image Recognition and Method for Operating the Same (Patent No. 10-2194499) [Trademark Registration – 2020] United States Trademark Registration [Trademark Registration – 2020] China Trademark Registration (No. 40205886) Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Information Security LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Vision and CI Our Journey 2020's 2010's 2000's Awards, Certifications, Patents Value Culture Inquiries Product Materials Technical Documents Hash Information Information Security Business Division LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Our Journey 2020's 2010's 2000's Information Security Business Division Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication .",
    "My account Sign out 쿠도커뮤니케이션(주)는 변화와 혁신으로 더 나은 미래를 만들어갑니다. 걸어온 길 더 나은 미래를 만들어갑니다. Vision and CI Our Journey CUDO Communication creates a better future through change and innovation Our Journey CUDO Communication creates a better future through change and innovation 2024 Moved to new headquarters in Gwacheon Moved to new headquarters in Gwacheon 2023 Established projects for: GS Homeshopping, Maeil Economic TV Studio, and SM Pop-up Store CEO Kim Yong-sik appointed as a special committee member for the 2nd National Tax Administration Reform Committee Received Minister of Strategy and Finance's Exemplary Taxpayer Award Established projects for: GS Homeshopping, Maeil Economic TV Studio, and SM Pop-up Store CEO Kim Yong-sik appointed as a special committee member for the 2nd National Tax Administration Reform Committee Received Minister of Strategy and Finance's Exemplary Taxpayer Award 2022 Established distributor partnership with SMTechnology for subscription-based product (DocStory) Received Presidential Industrial Medal Achieved KRW 100 billion in sales (approximately USD 770 million) Participated in the success of the second Nuri rocket launch Received Guro-gu District Mayor's Commendation as an Outstanding Donor Established distributor partnership with SMTechnology for subscription-based product (DocStory) Received Presidential Industrial Medal Achieved KRW 100 billion in sales (approximately USD 770 million) Participated in the success of the second Nuri rocket launch Received Guro-gu District Mayor's Commendation as an Outstanding Donor 2021 Secured largest single project: Port CCTV High-Performance Construction Project (KRW 23.5 billion) Patent Registrations: \"LED Billboard and Its Operation Method\" K Shopping Homeshopping: Constructed Korea's largest curved LED media wall studio Donated KRW 5 million to Osan City for COVID-19 recovery Donated KRW 3 million to Guro-gu for \"Warm Winter\" initiative Donated KRW 5 million to Jeonju City for \"Mother's Table\" project Patent Registrations: \"Height-Adjustable LED Display Device\" Patent Registrations: \"Multi LED Unit Installation Device\" Patent Registrations: \"Non-Stop Parallel Power Billboard and Its Operation Method\" Secured largest single project: Port CCTV High-Performance Construction Project (KRW 23.5 billion) Patent Registrations: \"LED Billboard and Its Operation Method\" K Shopping Homeshopping: Constructed Korea's largest curved LED media wall studio Donated KRW 5 million to Osan City for COVID-19 recovery Donated KRW 3 million to Guro-gu for \"Warm Winter\" initiative Donated KRW 5 million to Jeonju City for \"Mother's Table\" project Patent Registrations: \"Height-Adjustable LED Display Device\" Patent Registrations: \"Multi LED Unit Installation Device\" Patent Registrations: \"Non-Stop Parallel Power Billboard and Its Operation Method\" 2020 Patent Registrations: \"Slim LED Billboard and Its Manufacturing Method\" Patent Registrations: \"Object Image Recognition DCNN-based CCTV Video Analysis Device and Its Operation Method\" Selected as IBK Best Partner (Excellent Export Company) Trademark Registration in USA, China, and Japan Established intelligent smart screening control systems in: Yangju City Established intelligent smart screening control systems in: Hwaseong City (9,000 devices) Established intelligent smart screening control systems in: Bucheon City (7,700 devices) Patent Registrations: \"Slim LED Billboard and Its Manufacturing Method\" Patent Registrations: \"Object Image Recognition DCNN-based CCTV Video Analysis Device and Its Operation Method\" Selected as IBK Best Partner (Excellent Export Company) Trademark Registration in USA, China, and Japan Established intelligent smart screening control systems in: Yangju City Established intelligent smart screening control systems in: Hwaseong City (9,000 devices) Established intelligent smart screening control systems in: Bucheon City (7,700 devices) 2019 Designated as Excellent Product by Public Procurement Service \"Deep Learning-based Multi-Purpose Object Recognition Intelligent CCTV System\" Constructed Multi-Cinema Wall System at Seoul National University Hospital Patent Registration: \"Real-time IPTV Channel Switching System\" Designated as Excellent Product by Public Procurement Service \"Deep Learning-based Multi-Purpose Object Recognition Intelligent CCTV System\" Constructed Multi-Cinema Wall System at Seoul National University Hospital Patent Registration: \"Real-time IPTV Channel Switching System\" 2018 Certified as Family-Friendly Company Received DEEP Certification from Duksung Women's University Certified as Family-Friendly Company Received DEEP Certification from Duksung Women's University 2017 Constructed CCTV Security Management System for PyeongChang Olympics Established Distribution Agreement with Forscout Received TTA Verified Certificate Won Top Prize at WSCW Smart Public Service Marketing Collaboration for Intelligent Video Analysis with Hanwha Techwin Constructed CCTV Security Management System for PyeongChang Olympics Established Distribution Agreement with Forscout Received TTA Verified Certificate Won Top Prize at WSCW Smart Public Service Marketing Collaboration for Intelligent Video Analysis with Hanwha Techwin 2016 Received Presidential Commendation for Outstanding Small and Medium Enterprise Selected as Youth-Friendly Small and Medium Enterprise Received Presidential Commendation for Outstanding Small and Medium Enterprise Selected as Youth-Friendly Small and Medium Enterprise 2015 Selected for G-PASS for Overseas Procurement Market Entry Established Value Added Reseller Contract with Samsung SDS Constructed Video Surveillance Dispatch System for Han River Bridges Selected for G-PASS for Overseas Procurement Market Entry Established Value Added Reseller Contract with Samsung SDS Constructed Video Surveillance Dispatch System for Han River Bridges 2014 Supplied Intelligent CCTV for Gimpo City Integrated Control Constructed Intelligent CCTV for Jinju and Ulsan Prosecutors' Offices Supplied Intelligent CCTV for Gimpo City Integrated Control Constructed Intelligent CCTV for Jinju and Ulsan Prosecutors' Offices 2013 Designated Excellent Product by Public Procurement Service - 'Intelligent CCTV' Registered Q Mark and K Mark Constructed CCTV System for Sungnyemun Gate Designated Excellent Product by Public Procurement Service - 'Intelligent CCTV' Registered Q Mark and K Mark Constructed CCTV System for Sungnyemun Gate 2012 Registered GS Certification / TL9000 Certification Received Broadcasting Communication Commission Commendation for IPTV Activation Contribution Registered GS Certification / TL9000 Certification Received Broadcasting Communication Commission Commendation for IPTV Activation Contribution 2011 Constructed Comprehensive Security Systems for: Four Major Palaces and Jongmyo Shrine (Cultural Heritage Administration) Constructed Comprehensive Security Systems for: Blue House Presidential Security Office CCTV System Constructed Comprehensive Security Systems for: Four Major Palaces and Jongmyo Shrine (Cultural Heritage Administration) Constructed Comprehensive Security Systems for: Blue House Presidential Security Office CCTV System 2010 Constructed Comprehensive Security System for Royal Tombs Awarded G20 Summit Intelligent System Implementation Project Patent Registration: \"Universal Memory Device and Broadcasting Data Processing Method\" Performed Scalable Data-based Edutainment Core Technology Development Project Established Distribution Contract with Altech IT Solutions (Germany) for Email Archiving (EMA) Constructed Comprehensive Security System for Royal Tombs Awarded G20 Summit Intelligent System Implementation Project Patent Registration: \"Universal Memory Device and Broadcasting Data Processing Method\" Performed Scalable Data-based Edutainment Core Technology Development Project Established Distribution Contract with Altech IT Solutions (Germany) for Email Archiving (EMA) 2009 Performed Digital Broadcasting Development Project Performed Digital Broadcasting Development Project 2008 Received Million Dollar Export Tower at Trade Day Won Best Venture Company Award from Maeil Economic Newspaper Established Distribution Contract for Software AG WebMethod Solution Received Million Dollar Export Tower at Trade Day Won Best Venture Company Award from Maeil Economic Newspaper Established Distribution Contract for Software AG WebMethod Solution 2006 Constructed Satellite DMB Inaugural and Full Backup System Received 5 Million Dollar Export Tower at Trade Day Constructed Satellite DMB Inaugural and Full Backup System Received 5 Million Dollar Export Tower at Trade Day 2005 Received 3 Million Dollar Export Tower at Trade Day Received 3 Million Dollar Export Tower at Trade Day 2003 Constructed Satellite DMB Uplink System Constructed Satellite DMB Uplink System 2002 Established Corporate Research Institute Established Corporate Research Institute 2001 Received Million Dollar Export Tower at Trade Day Received Million Dollar Export Tower at Trade Day 2000 CUDO Communication Co., Ltd. Established CUDO Communication Co., Ltd. Established Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Information Security LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Vision and CI Our Journey 2020's 2010's 2000's Awards, Certifications, Patents Value Culture Inquiries Product Materials Technical Documents Hash Information Information Security Business Division LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Our Journey 2020's 2010's 2000's Information Security Business Division Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication .",
    "My account Sign out CUDO Communication Co., Ltd. Business Area Global Solution DX Security Information Security LED Strategic CUDO Communication Co., Ltd. Global Business Department Global Comprehensive Service Agency and Consulting Refrigerated Containers (Reefer container) Daikin Refrigeration Machines Refrigerated Containers (Reefer container) Daikin Refrigeration Machines Non-Ferrous Metals Aluminum Rolling, Plates, ADC12, Large Aluminum Cases Non-Ferrous Metals Aluminum Rolling, Plates, ADC12, Large Aluminum Cases TPH Mini Printers TPH Mini Printers CIS Image Sensors CIS Image Sensors Other Business Video Analysis Software, Satellite Antennas Other Business Video Analysis Software, Satellite Antennas Global Comprehensive Service Agency and Consulting Refrigerated Containers (Reefer container) Refrigerated Containers (Reefer container) Daikin Refrigeration Machines Aluminum Rolling, Plates, ADC12, Large Aluminum Cases Non-Ferrous Metals Aluminum Rolling, Plates, ADC12, Large Aluminum Cases Video Analysis Software, Satellite Antennas Other Business Video Analysis Software, Satellite Antennas Solution Business Department EAI/ESB, B2Bi, APIM solutions for interfaces, enterprise process/asset solutions, Big Data, etc. Consulting and technical support for enterprise solutions MongoDB A NoSQL database that stores data using document formats similar to JSON MongoDB A NoSQL database that stores data using document formats similar to JSON StreamSets Cloud-based platform for building, executing, and monitoring data pipelines StreamSets Cloud-based platform for building, executing, and monitoring data pipelines ARIS Capitalize and improve company business processes. Configured with ARIS PPM solution for Business Process Mining ARIS Capitalize and improve company business processes. Configured with ARIS PPM solution for Business Process Mining Snowflake Cloud-based data platform performing various data tasks such as Data Warehouse, Data Lake, Data Analyst Snowflake Cloud-based data platform performing various data tasks such as Data Warehouse, Data Lake, Data Analyst webMethods EAI/ESB, B2BI, API Management solutions. Solution supply, projects, technical support webMethods EAI/ESB, B2BI, API Management solutions. Solution supply, projects, technical support EAI/ESB, B2Bi, APIM solutions for interfaces, enterprise process/asset solutions, Big Data, etc. Consulting and technical support for enterprise solutions A NoSQL database that stores data using document formats similar to JSON MongoDB A NoSQL database that stores data using document formats similar to JSON Cloud-based platform for building, executing, and monitoring data pipelines StreamSets Cloud-based platform for building, executing, and monitoring data pipelines Capitalize and improve company business processes. Configured with ARIS PPM solution for Business Process Mining ARIS Capitalize and improve company business processes. Configured with ARIS PPM solution for Business Process Mining Cloud-based data platform performing various data tasks such as Data Warehouse, Data Lake, Data Analyst Snowflake Cloud-based data platform performing various data tasks such as Data Warehouse, Data Lake, Data Analyst EAI/ESB, B2BI, API Management solutions. Solution supply, projects, technical support webMethods EAI/ESB, B2BI, API Management solutions. Solution supply, projects, technical support DX Business Department Improving business processes and innovating customer experiences using innovative digital technologies System Integration IT Services Telecommunications-centered system integration IT services, IT infrastructure construction, maintenance, and optimal business process solutions System Integration IT Services Telecommunications-centered system integration IT services, IT infrastructure construction, maintenance, and optimal business process solutions Big Data Collecting, storing, processing, and analyzing data using Adobe, MongoDB, etc. to provide efficient corporate decision-making and business strategies Big Data Collecting, storing, processing, and analyzing data using Adobe, MongoDB, etc. to provide efficient corporate decision-making and business strategies Media Providing diverse user experiences with latest media experiences and on-demand media services using technologies like FCC, Sling Media Providing diverse user experiences with latest media experiences and on-demand media services using technologies like FCC, Sling R&D Develop innovative products and services through technological research and development Strengthen technological competitiveness Continuously improve long-term growth and competitiveness R&D Develop innovative products and services through technological research and development Strengthen technological competitiveness Continuously improve long-term growth and competitiveness Improving business processes and innovating customer experiences using innovative digital technologies System Integration IT Services Telecommunications-centered system integration IT services, IT infrastructure construction, maintenance, and optimal business process solutions System Integration IT Services Telecommunications-centered system integration IT services, IT infrastructure construction, maintenance, and optimal business process solutions Collecting, storing, processing, and analyzing data using Adobe, MongoDB, etc. to provide efficient corporate decision-making and business strategies Big Data Collecting, storing, processing, and analyzing data using Adobe, MongoDB, etc. to provide efficient corporate decision-making and business strategies Providing diverse user experiences with latest media experiences and on-demand media services using technologies like FCC, Sling Media Providing diverse user experiences with latest media experiences and on-demand media services using technologies like FCC, Sling Develop innovative products and services through technological research and development Strengthen technological competitiveness Continuously improve long-term growth and competitiveness R&D Develop innovative products and services through technological research and development Strengthen technological competitiveness Continuously improve long-term growth and competitiveness Security Business Department 지Intelligent CCTV and AI intelligent monitoring technologies Provide one-stop preventive and response solutions for: living crime prevention, disaster safety, national defense, ports, cultural properties, forestry, road traffic, maintenance Intelligent Monitoring System Providing efficient monitoring environment through domestically first-developed intelligent monitoring system Intelligent Monitoring System Providing efficient monitoring environment through domestically first-developed intelligent monitoring system Intelligent CCTV System Domestic top-level intelligent CCTV technology Intelligent CCTV System Domestic top-level intelligent CCTV technology Defense Business Provide defense-specialized system integration (SI) services, including boundary systems and smart military base construction Defense Business Provide defense-specialized system integration (SI) services, including boundary systems and smart military base construction Intelligent Transportation System Providing top-grade CCTV-based intelligent transportation system for four consecutive years Intelligent Transportation System Providing top-grade CCTV-based intelligent transportation system for four consecutive years 지Intelligent CCTV and AI intelligent monitoring technologies Provide one-stop preventive and response solutions for: living crime prevention, disaster safety, national defense, ports, cultural properties, forestry, road traffic, maintenance Providing efficient monitoring environment through domestically first-developed intelligent monitoring system Intelligent Monitoring System Providing efficient monitoring environment through domestically first-developed intelligent monitoring system Domestic top-level intelligent CCTV technology Intelligent CCTV System Domestic top-level intelligent CCTV technology Provide defense-specialized system integration (SI) services, including boundary systems and smart military base construction Defense Business Provide defense-specialized system integration (SI) services, including boundary systems and smart military base construction Providing top-grade CCTV-based intelligent transportation system for four consecutive years Intelligent Transportation System Providing top-grade CCTV-based intelligent transportation system for four consecutive years Information Security Business Department Provide total security solutions through authorized distribution of top domestic and international security solutions and AWS cloud security consulting Endpoint Integrated Security Vaccine, Network Access Control (NAC), asset management and access control solutions Endpoint Integrated Security Vaccine, Network Access Control (NAC), asset management and access control solutions Cloud Security Services Cloud design, construction security diagnosis consulting & ISMS/ISMS-P consulting Cloud Security Services Cloud design, construction security diagnosis consulting & ISMS/ISMS-P consulting Network Integration Network analysis and design, solution supply, construction, and customization Network Integration Network analysis and design, solution supply, construction, and customization AWS CPPO Cloud infrastructure & security solution integrated services including AWS Marketplace products, consulting, and technical support AWS CPPO Cloud infrastructure & security solution integrated services including AWS Marketplace products, consulting, and technical support Integrated Security Consulting Network security and vulnerability analysis reporting & network security construction services Integrated Security Consulting Network security and vulnerability analysis reporting & network security construction services Information Security Business Department Provide total security solutions through authorized distribution of top domestic and international security solutions and AWS cloud security consulting Vaccine, Network Access Control (NAC), asset management and access control solutions Endpoint Integrated Security Vaccine, Network Access Control (NAC), asset management and access control solutions Cloud design, construction security diagnosis consulting & ISMS/ISMS-P consulting Cloud Security Services Cloud design, construction security diagnosis consulting & ISMS/ISMS-P consulting Network analysis and design, solution supply, construction, and customization Network Integration Network analysis and design, solution supply, construction, and customization Cloud infrastructure & security solution integrated services including AWS Marketplace products, consulting, and technical support AWS CPPO Cloud infrastructure & security solution integrated services including AWS Marketplace products, consulting, and technical support Network security and vulnerability analysis reporting & network security construction services Integrated Security Consulting Network security and vulnerability analysis reporting & network security construction services LED Business Department LED Products and System Solutions for government offices, broadcasting stations and enterprises Studio Broadcasting LED media products and systems Studio Broadcasting LED media products and systems Situation Room LED situation board products and systems Situation Room LED situation board products and systems Outdoor Advertising LED electronic display products and systems Outdoor Advertising LED electronic display products and systems LED Products and System Solutions for government offices, broadcasting stations and enterprises Broadcasting LED media products and systems Studio Broadcasting LED media products and systems LED situation board products and systems Situation Room LED situation board products and systems LED electronic display products and systems Outdoor Advertising LED electronic display products and systems Strategic Business Department Provide consulting for item discovery, partner development, domestic distribution, and overseas expansion, with the primary function of importing and distributing strategic materials for domestic steel companies from verified overseas suppliers, and incubating new businesses Raw Material Distribution Business Import and distribute strategic materials from overseas suppliers Raw Material Distribution Business Import and distribute strategic materials from overseas suppliers Consulting Business Item discovery, partner development, domestic distribution, and overseas expansion Consulting Business Item discovery, partner development, domestic distribution, and overseas expansion Other Businesses Other Businesses Provide consulting for item discovery, partner development, domestic distribution, and overseas expansion, with the primary function of importing and distributing strategic materials for domestic steel companies from verified overseas suppliers, and incubating new businesses Raw Material Distribution Business Import and distribute strategic materials from overseas suppliers Raw Material Distribution Business Import and distribute strategic materials from overseas suppliers Item discovery, partner development, domestic distribution, and overseas expansion Consulting Business Item discovery, partner development, domestic distribution, and overseas expansion Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Information Security LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Corporate Information Business Areas Newsroom Value Culture Customer Center Family Site Vision and CI Our Journey 2020's 2010's 2000's Awards, Certifications, Patents Value Culture Inquiries Product Materials Technical Documents Hash Information Information Security Business Division LED Business Division icon icon icon Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication . Our Journey 2020's 2010's 2000's Information Security Business Division Address: 9 Gwacheon-daero 7 na-gil, Gwacheon-si, Gyeonggi-do, Korea (DX Tower 12F, 13840) Tel: +82 02-521-3887 Fax: +82 2-775-3883 © Copyright 2024 CUDO Communication ."
  ]
}