{
  "company": "en.hisign.com.cn",
  "dominant_topics": [
    -1,
    1
  ],
  "topic_counts": {
    "-1": 7,
    "1": 6
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 13
  },
  "topic_timeline": {
    "20": {
      "-1": 7,
      "1": 6
    }
  },
  "sample_docs": [
    "Hisign fingerprint recognition algorithms is at top of competition More» Hisign fingerprint recognition algorithms is at top of competition Hisign's live face detection was successfully certified by a security performance testing institute of the Ministry of Public Security More» Hisign's live face detection was successfully certified by a security performance testing institute of the Ministry of Public Security Hisign was selected as one of the More» Hisign was selected as one of the Hisign helps to quickly solve the cash theft case More» Hisign helps to quickly solve the cash theft case Hisign Public Welfare More» Hisign's DNA technology More» Hisign DNA technology More» Hisign's Strong Development and Business Practices Deliver High-Value Performance for Customers More» Hisign's Strong Development and Business Practices Deliver High-Value Performance for Customers Hisign's gears and system being deployed for anti-crime operation More» Hisign's gears and system being deployed for anti-crime operation Theme: Identity Ecosystems for Service Delivery More» Theme: Identity Ecosystems for Service Delivery",
    "Products About Us Contact Us News Business Brief Cutting-edge Technologies: Multiple Biometric Identification of fingerprint, palm print, iris and face. Video and Image Investigation We provide: Criminal AFIS (Automated Fingerprint/palm print Identification System) Biometric identification engine software for large scale projects with requirement of personal identity verification Biometric matching SDKs Devices for biometric enrollment, identification and/or verification Video and Image Investigation system for criminology We support partner/integrator company with core biometric technologies for projects with biometrical identity requirements. Multiple Biometric Identification of fingerprint, palm print, iris and face. Video and Image Investigation Criminal AFIS (Automated Fingerprint/palm print Identification System) Biometric identification engine software for large scale projects with requirement of personal identity verification Devices for biometric enrollment, identification and/or verification Video and Image Investigation system for criminology We support partner/integrator company with core biometric technologies for projects with biometrical identity requirements. More » Hot Products HBIE AFIS Portable Multi-biometric Application System Finger/palm Print Acquisition Device Face Recognition Controller for Fast Entry/Exit More » Hot Products Portable Multi-biometric Application System Portable Multi-biometric Application System Finger/palm Print Acquisition Device Finger/palm Print Acquisition Device Face Recognition Controller for Fast Entry/Exit Face Recognition Controller for Fast Entry/Exit",
    "Hisign to Exhibit at ID4Africa 2019 Hisign to Exhibit at ID4Africa 2019 Beijing Hisign Technology Co., Ltd. will exhibit in booth B27 at ID4Africa 2019 , June 18th-20 th , Johannesburg, South Africa. In Booth B27 , Beijing Hisign Technology Co., Ltd. will showcase multiple biometrics capture, face recognition surveillance, access controller and mobile biometric verification. These exhibits represent important and typical part of various applications with biometric identity verification for security, social services and administrations, etc. Typical applications scenarios will be shown by means of video display. There have been many successful application experiences of the advanced technology of Hisign: The fingerprint algorithm is exclusively used in China e-ID systems, such as Citizen ID card, passport and travel pass. Multiple factor verification of pensioners with fingerprint, face and voice is applied in Indonesian Pension Fund digitization. Multiple factor verification of mortgagers with fingerprint, face and voice is applied in a Mexican national bank. Automated fingerprint identification system for Sri Lanka immigration system. During the exhibition, Hisign provides catalogs for anyone who is interested in our wide array of products, including ones that are not on display, as well as flash drives containing complementary videos and documents. We are looking forward to cooperating with integrators and manufacturers as a biometirc technology provider to provide feasible solutions for the ID4Africa movement. Founded in 1998, Beijing Hisign Technology Co., Ltd. is widely regarded as the most comprehensive enterprise in multi-biometrics industry, with state-of-art identification technology of fingerprint, palm print, face, iris and DNA. Its products are widely used in public security and civil identity such as criminal investigation, forensics, access control, immigration, finance, social service, election and education.",
    "Application for Social Insurance Management Application for Social Insurance Management The social insurance is the right deserved by every citizen, yet its managerial vulnerability is used for illegal profits from time to time. The cases of pension collection after beneficiary's demise occur every year and the loss of social insurance fund amounts to hundreds of millions RMB in each province due to late or concealed death report of the retired, according to the responsible officers of the provinces. To prevent such situation and strengthen the management of social insurance fund, the Face Recognition & Verification System is gradually applied in all provinces and cities. The Face Recognition & Verification System applied to Inner Mongolia social insurance is a dynamic recognition technology with better operation flexibility. Unlike fingerprint recognition technology, it doesn't require for much cooperation of the pensioners, who are requested to take a photo shot at the social insurance center for one time only for features extraction by computer video image and filing in database. The pensions can be claimed when the pensioners' faces are matched with the database locally or remotely. The innovative use of the advanced Face Recognition & Verification System in Inner Mongolia effectively resolved the problem of false pension claim which has long perplexed the authorities of various regions. Management of Retirement Pension Payment Biometrics can be applied in the retirement pension payment management by the government to combat pension fraud while provide the retired with efficient service. Retirement pension fraud is not uncommon in every country. This normally happens by concealing the death information so that the family member(s) of the dead could receive pension long after the death. A database of the retired people shall be set up for the management of the retirement pension payment. There two options for the biometric information storage of the retired people, one of which is to store the biometric data in the retirement record list in the management system, and an ABIE for this system is setup altogether; and the other option is to keep a reference link in the record or every retired person in the pension management system to the corresponding record of the person in the national ID Database. The latter is a cost effective solution and fully reflect the powerful and versatile usage of the national ID ABIE. • Verification of Retired People Each Year or within Specified Time Interval In order to prevent pension fraud, the retired people shall be checked once every year or within every specified time interval and the database for pension payment management be updated accordingly. If the management system is setup with an ABIE for its own application, then the biometrics collected from a retired person shall be matched with the record of his/her retirement reference number in the database for verification. For the second option mentioned above, the ID card of the retired person shall be verified and the record in the pension management database corresponding the ID number shall be updated according to the verification result. Finger/palm print acquisition device Handheld Biometric Verification Devices",
    "Fingerprint ID Card Triple-proof Tablet Fingerprint ID Card Triple-proof Tablet It is a durable, reliable smart tablet that integrates biometrics. The tablet has fingerprint ID card recognition, face recognition, RFID , NFC, ID card recognition, QR code, and original notebook electromagnetic screen functions, and is widely used in medical, public security, education, justice and other mobile scenarios that require identity verification . Powerful fingerprint identity authentication: Our fingerprint algorithm is combined with a capacitive sensor, the fingerprint imaging is clear, and the collection and comparison of various types of fingerprints are good. Accurate facial recognition algorithm: binocular cameras can be integrated to achieve liveness recognition. Electromagnetic screen technology: optional 2 048 pressure-sensitive electromagnetic screen to achieve paperless application Ultra-long standby time: 8000 mAh battery capacity, can last for 10 hours Open operating system : Android 10 system, customizable applications Super waterproof: IP65 waterproof grade Product T echnical P arameters MTK6765 64 -bit 8 -core 12nm process Arm Cortex-A53 operating system, maximum frequency 2.3GHz 4G (standard), optional 6G / 8G 64G (standard), optional 1 28G Supports up to 128GB SD /TF card expansion Rear 13MP , auto focus Cold and warm light dual flash Android 10.0 , Android 11 10.1 inches 800*1280 (1920*1200 optional) Resolution HD IPS 10 -point touch, G+G touch screen Support 4096 pressure-sensitive original handwriting signature English, French, German, Italian, Japanese, Korean, Russian, Spanish, Polish, Czech, Simplified Chinese and other languages support BeiDou, Galileo, GLONASS GPS Support 256*360pixel 500DPI fingerprint collection device interface complies with \" GA/T1011-2012 General Technical Requirements for Resident Identity Card Fingerprint Collectors\", and can provide the test report commissioned by China Security Technology Certification Center. The fingerprint algorithm complies with \"Resident Identity Card Fingerprint Collection and Comparison Technical Specifications GA1012-2012 \" , and has a fingerprint algorithm test report issued by the Security and Police Electronic Products Quality Inspection Center of the Ministry of Public Security. At the same time, it is necessary to provide the \"Resident Identity Card Fingerprint Registration Algorithm Software Use License Contract\" signed with the First Research Institute of the Ministry of Public Security. Read second-generation ID card The latest ID card micro module ( optional) Support NXP 547 ( optional) Yes, supports Bluetooth 5.0 Support 125K 915M various frequency bands RFID ( optional) 3.8V/8000mAh rechargeable polymer battery Wifi time About 10H Input: AC100-240V.50-60HZ , Output DC 5V 2A"
  ]
}