{
  "company": "en.maxvision.com.cn",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 10,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 10
    }
  },
  "sample_docs": [
    "Solution Smart Port Smart Airport Intelligent Traffic Smart Seaport Smart Campus Product Center View all Products Biometrics Security Entrance&exit Security Vehicle Security Fire Safety lris Capture Device Fingerprint Capture Device (Four-finger) Facial Recognition Terminal - 208BD Document Reader-A Algorithms Personnel Identification License Plate Recognition Vehicle Recognition Behavior Analysis Safe Operation Analysis News Center More Events Maxvision Secures Core Robot Assets of Aldebaran 2025-07-10 Maxvision Showcased at the 6th WCO Global AEO Conference 2024-05-10 Maxvision's Showcase at TSE 2024 2024-05-05 Maxvision Ventures into Fresh Promotion Territories in North and Latin America 2024-04-18 Fingerprint Capture Device (Four-finger) Facial Recognition Terminal - 208BD Maxvision Secures Core Robot Assets of Aldebaran Maxvision Showcased at the 6th WCO Global AEO Conference Maxvision's Showcase at TSE 2024 Maxvision Ventures into Fresh Promotion Territories in North and Latin America Copyright © Since 1997 Maxvision Technology Corp. Yue Gong Wang an Bei No. 44030402001363 Yue ICP Bei No. 09136412-2",
    "400+ More than 400 for hardware and software ≥10% R&D Investment of over 10%of Turnover ≥50% Over 500 R&D Staffs which is more than 50% of the total Staff About Maxvision Maxvision Technology Corp. is a listed enterprise on the Main Board of Shenzhen Stock Exchange (stock code \" 002990\" ), with its headquarters in Shenzhen City, Guangdong Province, China. It is also a national high- tech company engaged in the research of artificial intelligence, big data, Internet of Things, and other new- generation information technologies, which provides users with intelligent products and\" Al+Industry\" solutions in line with future trends, and serves the overall construction of a smart society. The company has a team of hundreds of people working on hardware and software development and artificial intelligence algorithm research, with R& D staff accounting for over 50% of the company's total headcount. The software and hardware products formed for sale amount to more than 400 kinds. The company's annual investmentin research and development accounts for more than 10% of its operating revenue. Technical Strength Face Recognition Algorithm TOP 2 2nd in China TOP 7 7th in the World In April 2023, the National Institute of Standards and Technology (NIST) announced results of the latest test offace recognition algorithms NIST- FRVT TOP 2 2nd in China TOP 4 4th in the World The 6th Acoustic Scene Recognition and Event Detection (DCASE2020) Challenge Development Path 2022 2021 2020 2019 2018 2016 2015 2014 2013 2012 2010 2008 2005 2004 2002 1999 1997 2023 Contact us Provide you with professional problem-solving, service consulting and other one-to-one services Tel +86 0755-83849888 Service Hotline +86 4001-800-969 Fax +86 0755-83849210 E-mail sales@maxvision.com.cn Area address HQ Add 42F, 43F and 45F, Block A, Xinhao e Du, Caitian Road No.7018, Futian District, Shenzhen,Guangdong, China +86 0755-83849888 Wuhan R&D Center Huagong Technology Industry Building, No. 876, Luoyu Road, Hongshan District, Wuhan, China +86 027-87288298 Product Center No. 4 Factory House, No. 2 Anyue Road, Chashan Town, Dongguan City More than 400 for hardware and software R&D Investment of over 10%of Turnover Over 500 R&D Staffs which is more than 50% of the total Staff Maxvision Technology Corp. is a listed enterprise on the Main Board of Shenzhen Stock Exchange (stock code \" 002990\" ), with its headquarters in Shenzhen City, Guangdong Province, China. It is also a national high- tech company engaged in the research of artificial intelligence, big data, Internet of Things, and other new- generation information technologies, which provides users with intelligent products and\" Al+Industry\" solutions in line with future trends, and serves the overall construction of a smart society. The company has a team of hundreds of people working on hardware and software development and artificial intelligence algorithm research, with R& D staff accounting for over 50% of the company's total headcount. The software and hardware products formed for sale amount to more than 400 kinds. The company's annual investmentin research and development accounts for more than 10% of its operating revenue. 7th in the World In April 2023, the National Institute of Standards and Technology (NIST) announced results of the latest test offace recognition algorithms NIST- FRVT 4th in the World The 6th Acoustic Scene Recognition and Event Detection (DCASE2020) Challenge Provide you with professional problem-solving, service consulting and other one-to-one services 42F, 43F and 45F, Block A, Xinhao e Du, Caitian Road No.7018, Futian District, Shenzhen,Guangdong, China Huagong Technology Industry Building, No. 876, Luoyu Road, Hongshan District, Wuhan, China No. 4 Factory House, No. 2 Anyue Road, Chashan Town, Dongguan City Copyright © Since 1997 Maxvision Technology Corp. Yue Gong Wang an Bei No. 44030402001363 Yue ICP Bei No. 09136412-2",
    "Solution Overview In response to the high personnel mobility, complex identity profiles, and elevated security demands within seaport operational zones, Maxvision delivers an access management solution built on pre-registration, automated verification, and traceable movement. By integrating advanced identity authentication with real-time behavior analytics, the system enables precise access control, proactive risk detection, and enhanced operational efficiency. Key Features • Multi-factor Authentication: Supports multimodal identity verification to ensure reliable and accurate personnel identification. • Fast and Streamlined Access: Combines advance appointment with on-site intelligent checks to reduce waiting times and accelerate entry. • Intelligent Behavior Monitoring: Continuously analyzes personnel movements to detect anomalies and issue early warnings. • Access Rights Management: Enables flexible permission settings to prevent unauthorized entry into sensitive zones. • Automated Operations: Digitizes the access process to reduce manual intervention and enhance operational efficiency Related products In response to the high personnel mobility, complex identity profiles, and elevated security demands within seaport operational zones, Maxvision delivers an access management solution built on pre-registration, automated verification, and traceable movement. By integrating advanced identity authentication with real-time behavior analytics, the system enables precise access control, proactive risk detection, and enhanced operational efficiency. Copyright © Since 1997 Maxvision Technology Corp. Yue Gong Wang an Bei No. 44030402001363 Yue ICP Bei No. 09136412-2",
    "Smart Seaport Intelligent Traffic Smart Traffic Safety Solution Smart Traffic Flow Solution Smart Traffic Service Solution Smart Port Immigration Passenger Inspection Solution Immigration Vehicle Inspection Solution Customs Passenger Inspection Solution Customs Vehicle Inspection Solution Customs Cargo Inspection Solution Police Checkpoint Inspection Solution Smart Airport Airport Security Checking System Smart Seaport Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Smart Campus Personnel Access Control Solution Vehicle Access Control Solution Integrated Campus Security Solution Overview Maxvision Smart Seaport Solution delivers a unified digital management framework designed around four operational pillars: personnel, vehicles, cargo, and port infrastructure. The solution addresses core seaport challenges by integrating identity authentication, traffic coordination, cargo supervision, bonded cargo monitoring, and perimeter security into a cohesive system. This enables ports to break down data silos, enhance operational flow, and strengthen overall risk control. Features Secure Personnel Access Pre-registration and access control ensure only authorized staff enter work zones. Efficient Vehicle Movement Real-time guidance and tracking optimize on-site vehicle flow. In-transit Cargo Monitoring Real-time oversight of route, status, and anomalies. Integrated Seaport Security Zone fencing, drone patrols, and visual command strengthen closed-loop safety. Centralized Operations Management Unified system oversight reduces manual inspection and coordination costs. Solution Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Smart Traffic Safety Solution Smart Traffic Flow Solution Smart Traffic Service Solution Immigration Passenger Inspection Solution Immigration Vehicle Inspection Solution Customs Passenger Inspection Solution Customs Vehicle Inspection Solution Customs Cargo Inspection Solution Police Checkpoint Inspection Solution Airport Security Checking System Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Personnel Access Control Solution Vehicle Access Control Solution Integrated Campus Security Solution Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Copyright © Since 1997 Maxvision Technology Corp. Yue Gong Wang an Bei No. 44030402001363 Yue ICP Bei No. 09136412-2",
    "Smart Airport Intelligent Traffic Smart Traffic Safety Solution Smart Traffic Flow Solution Smart Traffic Service Solution Smart Port Immigration Passenger Inspection Solution Immigration Vehicle Inspection Solution Customs Passenger Inspection Solution Customs Vehicle Inspection Solution Customs Cargo Inspection Solution Police Checkpoint Inspection Solution Smart Airport Airport Security Checking System Smart Seaport Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Smart Campus Personnel Access Control Solution Vehicle Access Control Solution Integrated Campus Security Solution Airport Security Checking System Smart Traffic Safety Solution Smart Traffic Flow Solution Smart Traffic Service Solution Immigration Passenger Inspection Solution Immigration Vehicle Inspection Solution Customs Passenger Inspection Solution Customs Vehicle Inspection Solution Customs Cargo Inspection Solution Police Checkpoint Inspection Solution Airport Security Checking System Personnel Access Control Solution Vehicle Access Control Solution Electronic Cargo Tracking Solution Seaport Security Management Solution Personnel Access Control Solution Vehicle Access Control Solution Integrated Campus Security Solution Airport Security Checking System Copyright © Since 1997 Maxvision Technology Corp. Yue Gong Wang an Bei No. 44030402001363 Yue ICP Bei No. 09136412-2"
  ]
}