{
  "company": "en.minivision.cn",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 47,
    "-1": 13
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5923076923076923,
    "framing_surveillance": 0.2769230769230769,
    "framing_market": 0.1307692307692307,
    "num_docs": 60
  },
  "topic_timeline": {
    "20": {
      "-1": 13,
      "0": 47
    }
  },
  "sample_docs": [
    "The application solution is being upgraded Six categories of algorithms Six categories of algorithms Face and Body Analysis Vehicle And Object Analysis *The above data are all from Minivision standard experiments. Head and shoulder detection and tracking RGB and infrared life detection Verification of whether it is a real person or a dummy is carried out using silent live body technology, which is recognized as very difficult in the industry. It uses both single RGB and binocular cameras to detect whether it is a real person or not, and can effectively block attack materials, including 3D simulated head models, paper-printed photos and displays. The algorithm is certified by UnionPay Live Enhanced. Using an ordinary camera, faces can be reconstructed quickly and with high accuracy. Its 3D reconstruction technology can restore the 3D attributes of the face from a single or multiple images and can be used in metaverse scenarios such as virtual character creation and virtual clothing. Head and shoulder detection and tracking In a dense crowd scene, head and shoulder tracking can efficiently count the flow of people. It can also respond in a timely manner to some anomalous gatherings, stagnation and other events. On edge devices such as Hesse and ARM, its response is near real-time. The pedestrian detection algorithm is responsible for detecting the location of pedestrians in images, including scenes such as neighborhoods, shopping centers and schools. It is significantly superior in rainy and foggy days, at night and in other poor weather conditions, with a combined detection accuracy of 99.8%. Crowd Density Counting is used to estimate the number of people on screen in crowded scenarios, such as railway stations, airports, tourist attractions and other key surveillance areas, to count the current density of crowds and sudden increases in crowd size. Pedestrian re-identification is an algorithm that uses computer vision to determine the presence of a specific pedestrian in an image or video sequence. First, an image of a pedestrian is selected and fed into the algorithm. Then, the image of that pedestrian is retrieved under the cross device to compensate for the visual limitation of the fixed camera, so that the trajectory of activity can be effectively tracked across cameras. This algorithm can be combined with pedestrian detection/tracking technology and is therefore widely used in intelligent video surveillance, intelligent security and other areas. Pedestrian attribute recognition has a wide range of applications in pedestrian search, user profile analysis and intelligent surveillance. Based on big data and deep learning techniques, the algorithm can detect multiple targets in complex scenes and recognize 130 fine-grained categories among 15 pedestrian attributes, including gender, age, head accessories, hairstyle, hair color, upper and lower clothing, and emotion. Pedestrian Skeletal Key points are used to locate the head, neck, left and right shoulders, left and right elbow joints, left and right wrist joints, left and right hip joints, left and right knee joints, and left and right ankle joints of the human body to provide data that can be used for interactive games and to detect abnormal movements such as falls. The algorithm can run on the Hesse series of AI chips or on low-end ARMs. Failure to wear helmet detection Failure to wear reflective clothing detection Inspection of chef's clothing Supervising the donning and doffing of protective clothing For a specified area, events are detected when a pedestrian enters the area for more than a specified amount of time. If certain thresholds are exceeded, an alarm is triggered. For a specific area, events are detected when pedestrians loiter or linger in the area for more than a certain amount of time. If certain thresholds are exceeded, an alarm is triggered. The algorithm of head and shoulder detection is used to count pedestrians entering a detection area. If the count threshold is exceeded, an alarm is triggered. The algorithm of pedestrian detection and tracking is used to detect pedestrians entering the detection area for falls and to alert pedestrians exceeding certain thresholds for falls. Pedestrian tracking and smoking detection algorithms are used to detect the smoking of pedestrians entering the detection area, and pedestrians exceeding the threshold are warned of their smoking behavior. Pedestrian tracking and phone call detection algorithms are used to detect phone calls from pedestrians entering the detection area, and phone call behavior alerts are provided for pedestrians exceeding the threshold. This algorithm is used to distinguish whether people are wearing helmets, hats or ordinary hats in construction sites, factories and other scenes, providing a powerful monitoring and warning function for safety production. It can achieve very high accuracy even in complex lighting scenes. Failure to wear helmet detection The application uses a pedestrian detection algorithm to provide early warning of non-helmet wearing behavior. Failure to wear reflective clothing detection The algorithm detects whether site personnel are wearing reflective clothing and alerts them if they are not. Head-and-shoulders or pedestrian detection algorithms detect when people are off duty. The number of people and time in the area is calculated and a warning is issued if it is less than the required number of people and time. The algorithms of pedestrian tracking and unmasked detection are used to provide early warning of non-mask wearing behavior. Inspection of chef's clothing The algorithms of pedestrian tracking and chef's clothing detection are used to determine if all the overalls and hats are in compliance, and to raise an alarm if they are not. The algorithms of pedestrian tracking and phone play detection detect phone play for pedestrians entering the detection area and alerts pedestrians who exceed a threshold for phone play behavior. The fight detection algorithm provides early warning of fighting behavior. The running detection algorithm provides early warning of running behavior. Supervising the donning and doffing of protective clothing The AI Fine Behaviour Recognition algorithm is used to automatically monitor, intelligently record and alert on protective clothing removal behaviours in hospitals, airports, quarantine stations and other locations. Each key action of the inspected personnel in the process of removing protective clothing is detected for action standardisation, action duration monitoring and step accuracy detection. Objects thrown from tall buildings Electric vehicles entering buildings and lifts Reservoir water level scale Quality control / Defect detection in industry Objects thrown from tall buildings The algorithm for detecting objects thrown from tall buildings is used to capture overhead throwing violations in real time by clipping video from massive video data at the time before and after the overhead throw, which is used by the property management department for evidence collection and traceability. The algorithm can be run in Huawei's SDC smart cameras without the need to configure additional analysis equipment, and has good anti-interference capability for day and night, with a comprehensive capture rate of 95% *. Electric vehicles entering buildings and lifts The algorithm is used to detect electric vehicles entering lifts and buildings, and to prevent illegal indoor charging of electric vehicles, thus preventing fires caused by indoor charging of electric vehicles. The algorithm can effectively distinguish more than 80 types of vehicles, including electric vehicles, bicycles, children's toy cars, scooters, prams, etc., with a combined recall rate of 95% for electric vehicles. The smoke detection algorithm detects smoke in the area and alerts on events that exceed a threshold time. Flame detection uses real-time RGB and IR surveillance cameras to accurately detect open flames and smoke in the monitored area, while effectively controlling the frequent occurrence of false alarms. Fire occupancy detection records the time a vehicle spends in a specific area to determine if there is an illegal line occupying the road so that the occupying vehicle can be captured and alerted. Rubbish detection is used to detect litter such as pieces of paper, drinks bottles, plastic bags and other common litter. Trash overflow detection detects when nearby bins are overflowing. The mouse detection algorithm in infrared scenes detects the presence of mice in the area and alerts on events that exceed a threshold time. Note that this must be in a night infrared scene. The non-motorized/motorized inspection algorithm detects motorized and non-motorized vehicles entering the detection area and alerts motorized and non-motorized vehicles that exceed the threshold time. The algorithm achieves a accuracy of 90% by detecting illegal occupancy in public areas such as cities and streets, including food stalls, private vendors, carts and ground stalls. Note that this data is under the standard experiments of Minivision Tech. The non-motorized/motorized vehicle inspection is used to monitor illegally parked vehicles or vehicles moving illegally on the road, but can also be used for other tasks such as number plate recognition. Even at night, the infrared devices maintain good detection accuracy for illegally parked motorized vehicles. Engineering vehicle detection is used to detect dump trucks, cement tankers, excavators and other construction vehicles on construction sites or in restricted urban areas to prevent them from entering prohibited work zones or areas. Dump trucks should have their wheels cleaned as required before leaving the site. The algorithm in the cleaning process to determine whether the site in accordance with the requirements of the vehicle spray cleaning. River Float Detection primarily detects floating weeds, aquatic plants and debris in lakes, rivers, ditches and other scenarios with 98% accuracy. Reservoir water level scale It detects the hydrological scale through the surveillance camera and applies deep learning algorithms to the scale. It is applicable to scenes such as rivers, ditches, lakes, etc., as well as a wide range of hydrological scales without specific limitations. Quality control / Defect detection in industry Quality control and defect detection are used to detect abnormal defects such as scratches and dents on the surface of parts and whether parts are installed. Adversarial Generative Networks, Portrait Segmentation and Portrait Detection algorithms are used to create an AI creation from uploaded images that can transform real-world photos into cartoon styles with beautifully natural results. It can be used for motion graphics and AI photo albums. This algorithm reproduces the full expression of the character in the video on the photo of the character uploaded by the user, so that an impromptu short video production can be achieved from a video and a photo. Due to its extremely low computational cost, it can be used on platforms such as CPU and GPU to facilitate user call. This algorithm uses an adversarial neural network to add fine detail to a sketch and create a realistic landscape photo, with one-click support for switching between the four seasonal styles and applying novel filters to the image. Dog walking on leash By extracting features from faces and nose prints, the similarity of two dog faces is calculated to determine if they are the same dog. Through creating an exclusive ID for each dog that can record the dog's basic information, eco-dynamics, consumption information, service information and medical information, owners can be helped to better manage their dog's daily affairs. Dog walking on leash The deep learning algorithm predicts the current category of the dog's status based on the leash, distance between human and dog, and behavioral actions. These categories include leash compliance, leash too long and unsigned leash. The algorithm issues an alert when a dog is off leash. OCR can be used to recognize specialized documents such as ID cards, marriage certificates, invoices and other documents. It has an accuracy rate of 97% for text recognition in general scenarios. License plate recognition can be used with a variety of number plates including yellow, green, blue and white. It has good stability in complex day and night environments such as roads, residential areas and access gates, and has a recognition accuracy of up to 97%. Detection of rubbish dumps Detection of rubbish dumps Statistics of pedestrian flow Statistics of pedestrian flow Muck truck covering deficiency detection Muck truck covering deficiency detection Detection of illegal slogan propaganda Detection of illegal slogan propaganda Detection of illegal small ads Detection of illegal small ads Detection of illegal outdoor advertising signs Detection of illegal outdoor advertising signs Detection of road water accumulation Detection of road water accumulation Detection of water pollution discoloration Detection of water pollution discoloration Detection of vehicles carrying mud on the road Detection of vehicles carrying mud on the road Illegally parked motorized vehicle Illegally parked motorized vehicle Illegally parked non-motorized vehicle Illegally parked non-motorized vehicle Electric vehicles entering corridor Electric vehicles entering corridor Electric vehicles entering lifts Electric vehicles entering lifts Detection of rubbish dumps Detection of rubbish dumps Dog walking off leash Dog walking off leash high altitude dropped object detection high altitude dropped object detection Illegally parked motorized vehicle Illegally parked motorized vehicle Illegally parked non-motorized vehicle Illegally parked non-motorized vehicle Detection of rubbish dumps Detection of rubbish dumps Not wearing chefs' clothing Not wearing chefs' clothing Not wearing cook hat Not wearing cook hat Gantry Crane Dangerous Area Break-in Gantry Crane Dangerous Area Break-in Detection of belt area crossings Detection of belt area crossings Stepping on a coal heap in violation of regulations Stepping on a coal heap in violation of regulations Hanging equipment in violation of regulations Hanging equipment in violation of regulations Moving a belt conveyor in violation of regulations Moving a belt conveyor in violation of regulations Scraper machine dangerous area entry Scraper machine dangerous area entry Illegally opening a tunnel digging machine Illegally opening a tunnel digging machine Illegal crossing belt detection Illegal crossing belt detection Step on a belt in violation of regulations Step on a belt in violation of regulations Residual detection of coal piles Residual detection of coal piles Failure to wear reflective clothing Failure to wear reflective clothing Safety clothing testing algorithm Safety clothing testing algorithm Failure to wear reflective clothing Failure to wear reflective clothing Detection of rubbish dumps Detection of rubbish dumps 16 algorithms for multi-target stable trajectory 16 algorithms for multi-target stable trajectory Online monitoring 13 kinds of events Online monitoring 13 kinds of events Real-time service area monitoring Real-time service area monitoring Real-time road condition monitoring Real-time road condition monitoring Illegally parked motorized vehicle Illegally parked motorized vehicle Illegally parked non-motorized vehicle Illegally parked non-motorized vehicle Detection of rubbish dumps Detection of rubbish dumps Motor vehicles going in reverse Motor vehicles going in reverse Non-motor vehicles going in reverse Non-motor vehicles going in reverse Residual detection of coal piles Residual detection of coal piles",
    "The application solution is being upgraded Extensive real-world case studies 01 Extensive real-world case studies The system has been deployed in the country's largest smart community project, covering over 1,000 communities and nearly 3 million residents. Extensive real-world case studies Extensive real-world case studies The system has been deployed in the country's largest smart community project, covering over 1,000 communities and nearly 3 million residents. High algorithm accuracy 02 High algorithm accuracy A wide variety of community core algorithms are developed by Minivision, and the community projects deployed can provide data feedback to continually optimize algorithm accuracy. A wide variety of community core algorithms are developed by Minivision, and the community projects deployed can provide data feedback to continually optimize algorithm accuracy. Widespread device integration 03 Widespread device integration We have successfully integrated different types and brands of sensors in community scenarios such as fire, environment and security. We have successfully integrated different types and brands of sensors in community scenarios such as fire, environment and security. High utilisation of old equipment 04 High utilisation of old equipment For older communities in need of smart upgrades, access to installed surveillance equipment can be provided. We support multiple common protocols for platform access, increasing the efficiency of overall property management. High utilisation of old equipment High utilisation of old equipment For older communities in need of smart upgrades, access to installed surveillance equipment can be provided. We support multiple common protocols for platform access, increasing the efficiency of overall property management. 3D customized presentation 05 3D customized presentation Satisfy customer demand for intuitive and cool presentations that integrate 3D maps (models), real-time VR and large-screen field data. Satisfy customer demand for intuitive and cool presentations that integrate 3D maps (models), real-time VR and large-screen field data. Non-contact entrance 06 Non-contact entrance During the epidemic, personnel wearing masks can be directly identified with a response time of seconds, allowing contactless entry and improving access comfort. During the epidemic, personnel wearing masks can be directly identified with a response time of seconds, allowing contactless entry and improving access comfort. Excellent end-to-end services 07 Excellent end-to-end services Maintenance processes such as equipment access, troubleshooting, repair and routing checks are carried out by specialist personnel to ensure stable operation of the overall equipment. In the event of a fault, timely repair response and proactive service are supported. Maintenance processes such as equipment access, troubleshooting, repair and routing checks are carried out by specialist personnel to ensure stable operation of the overall equipment. In the event of a fault, timely repair response and proactive service are supported. Intelligent access control management Intelligent access control management Closed loop of security control Closed loop of security control Reduced risk of epidemics Reduced risk of epidemics Timely fire control management Timely fire control management Avoid duplication of construction Avoid duplication of construction",
    "The application solution is being upgraded Xingqing Series intelligent panel machine Xingdou Series High-Throw Camera Xingdou Series High-Throw Camera One channel can safely protect 7 floors, restore the scene of a throwing object in real time, trigger warning alarms within 1 second, and high-altitude throwing objects have nowhere to hide. Article 1254 of the Civil Code stipulates \"No throwing objects from buildings†If the property service company and other building managers fail to take the necessary safety measures, they will be liable in tort for failing to fulfil their safety obligations in accordance with the law. Throwing objects from a height will be defined as a criminal offence from 1 March 2021. If the circumstances are serious, the offender will be sentenced to fixed-term imprisonment of up to one year, criminal detention or public surveillance, and fined concurrently or independently. Supports custom settings for detection areas and floors. Supports custom settings for detection areas and floors. Supports querying alarm records by time period, location and camera position. Supports querying alarm records by time period, location and camera position. Supports real-time push of alarm information and alarm count statistics. Supports real-time push of alarm information and alarm count statistics. Supports overlaying trajectory maps for event video viewing and downloading. Supports overlaying trajectory maps for event video viewing and downloading. Record the throwing process and track the event The angle of upward photography can be adjusted by a designated person without intruding on the privacy of the occupants. Full floor coverage can effectively record the process of uncivilized behavior, such as throwing debris from great heights, which is useful for retrospective analysis. Record the throwing process and track the event The angle of upward photography can be adjusted by a designated person without intruding on the privacy of the occupants. Full floor coverage can effectively record the process of uncivilized behavior, such as throwing debris from great heights, which is useful for retrospective analysis. Deter throwers and reduce the number of accidents It can also, to some extent, intimidate throwers with high-altitude surveillance equipment and reduce the incidence of civil unrest or major casualties. Deter throwers and reduce the number of accidents It can also, to some extent, intimidate throwers with high-altitude surveillance equipment and reduce the incidence of civil unrest or major casualties. Multi-item adaptation, real-time accuracy Can detect a wide range of objects with over 95% accuracy; can effectively eliminate interference and reduce false alarms with over 90% accuracy. Multi-item adaptation, real-time accuracy Can detect a wide range of objects with over 95% accuracy; can effectively eliminate interference and reduce false alarms with over 90% accuracy. Multiple deployment methods, flexible selection Supports multiple deployment methods, including standalone deployment, access platform deployment, and NVR closed-loop deployment, to meet different user needs in different scenarios. Multiple deployment methods, flexible selection Supports multiple deployment methods, including standalone deployment, access platform deployment, and NVR closed-loop deployment, to meet different user needs in different scenarios. Application Case 2 案例概况 At 22:15 pm on June 22, 2021, a resident of a residential area in Nanjing threw an unlit cigarette butt downstairs from a window. Fortunately, there were no blankets or clothes to dry downstairs, which did not cause a fire. When the Xiaoshi High Altitude Parabolic System recognized the incident, the on duty property management personnel promptly received the alarm message and rushed to the resident's home to provide warning and education to the parties involved. At 22:15 pm on June 22, 2021, a resident of a residential area in Nanjing threw an unlit cigarette butt downstairs from a window. Fortunately, there were no blankets or clothes to dry downstairs, which did not cause a fire. When the Xiaoshi High Altitude Parabolic System recognized the incident, the on duty property management personnel promptly received the alarm message and rushed to the resident's home to provide warning and education to the parties involved. Application Case 1 案例概况 At 13:52 on June 28, 2021, a resident of a residential area in Jiangsu dropped a food box from a window and almost hit a passing resident, causing a neighborhood dispute. The Xiaoshi High Altitude Parabolic System accurately captured this incident. Property management personnel rushed to the scene as soon as possible to deal with it. With strong evidence, the parties were unable to deny it. Property management personnel criticized and educated the person who threw the food, Passerby residents also fully affirmed the construction of the high-altitude parabolic system in the community. At 13:52 on June 28, 2021, a resident of a residential area in Jiangsu dropped a food box from a window and almost hit a passing resident, causing a neighborhood dispute. The Xiaoshi High Altitude Parabolic System accurately captured this incident. Property management personnel rushed to the scene as soon as possible to deal with it. With strong evidence, the parties were unable to deny it. Property management personnel criticized and educated the person who threw the food, Passerby residents also fully affirmed the construction of the high-altitude parabolic system in the community.",
    "The application solution is being upgraded Minivision Tech is a leading enterprise in Chinese artificial intelligence. Founded in 2015, it is a full-scenario ecosystem service provider in the smart vision industry. In the VizWiz Grand Challenge workshop at CVPR 2023, Minivision Tech placed first in the Detecting Salient Objects in Images track and third in the Answering Visual Questions track. Additionally, our company was ranked first in Rank A and third in Rank B in the CVPR 2023 1st Foundation Models Challenge. Moreover, we also won both the MOT17 and HT21 championships in the MOT International Multi-Target Tracking Competition and were ranked 2nd globally in the FRVT Open in the NIST International Face Recognition Competition. We have received the national level Specialized Special Innovation small Giant status, as well as the Jiangsu Provincial Computer Vision Engineering Research Center and Jiangsu Provincial Science and Technology Prize first prize, among other honors. Furthermore, the company's product system has passed FIT certification and CMMI 5 certification. Additionally, we were selected as the first batch of members of the Trusted Face Application Guard Program. We are involved in the development of several national standards related to the application of artificial intelligence technology, intelligent community assessment and others. Finally, a technical team consisting of an academic team and industry experts, jointly established with related scientific research institutes, has established the Artificial Intelligence Research Institute and Innovative Application Base. We continued to carry out cutting-edge research on AI technology and pre-research on digital human, 3D vision and other cutting-edge technologies. Minivision Tech's products and solutions have served several government agencies and successfully implemented benchmark projects such as large-scale smart communities across the country. We have partnered with renowned industry leaders such as the three major telecom operators and Huawei, and have continued to expand our market share. We have also set up offices in places such as Chongqing, Liaoning, Xinjiang, Shanxi, Zhejiang, Shanghai, Jiangxi,Shaanxi and Anhui. 0 year Old Minivision 0 + Smart city vision hub landing projects Strengthening intellectual property rights and stabilising the cornerstone of scientific innovation. 0 Intellectual property rights 0 Patents and trademarks Champion of the 2023 CVPR Large Model Competition for significant target detection track; Winner of both the MOT17 and HT21 titles in the 2022 International Racer Challenge; Seventh place overall and second place in the open source scene in the 2020 NIST International Face Recognition Challenge (FRVT); Excellence in international competitions such as BOT and FDDB 2020; First place in the BOT International Intelligent Retail Algorithm Competition 2018; Second place in the 2018 Huawei International Developer Competition; First place in the Alibaba Tianchi AI Medical Competition in 2017; First place in the THUMOS Video Behaviour Detection Competition 2015; Computer vision technology is internationally recognized Champion of the 2023 CVPR Large Model Competition for significant target detection track; Winner of both the MOT17 and HT21 titles in the 2022 International Racer Challenge; Seventh place overall and second place in the open source scene in the 2020 NIST International Face Recognition Challenge (FRVT); Excellence in international competitions such as BOT and FDDB 2020; First place in the BOT International Intelligent Retail Algorithm Competition 2018; Second place in the 2018 Huawei International Developer Competition; First place in the Alibaba Tianchi AI Medical Competition in 2017; First place in the THUMOS Video Behaviour Detection Competition 2015; Computer vision technology is internationally recognized Total number of applied and authorized patents and software copyrights exceeds 300, with over 30 certifications from national, regional, and organizational authorities; Participated in the formulation of more than 20 standards, including national standards for smart communities, various industry standards/local standards/group standards; Core algorithms and products have been certified by the National Public Security Testing Organization; The facial recognition algorithm meets the offline payment security requirements of the National Bank Card Testing Centre (BCTC). Multiple independent intellectual property rights Total number of applied and authorized patents and software copyrights exceeds 300, with over 30 certifications from national, regional, and organizational authorities; Participated in the formulation of more than 20 standards, including national standards for smart communities, various industry standards/local standards/group standards; Core algorithms and products have been certified by the National Public Security Testing Organization; The facial recognition algorithm meets the offline payment security requirements of the National Bank Card Testing Centre (BCTC). Multiple independent intellectual property rights Published over 40 papers at computer vision conferences including CVPR, ICCV, ECCV and NIPS; Published over 30 papers in computer vision journals including IEEE T-PAMI and IJCAI; Cited over 5,000 times by Google Scholar; The first domestic company to apply Silent Live technology to identity authentication in the Internet industry and obtain certification from the Third Research Institute of the Ministry of Public Security; Established a strategic collaboration with Shanghai Jiaotong University to jointly research cutting-edge artificial intelligence technology; Received a letter of appreciation from Jeff Dean, a member of the US National Academy of Engineering and a senior computer scientist at Google. Rich academic achievements Published over 40 papers at computer vision conferences including CVPR, ICCV, ECCV and NIPS; Published over 30 papers in computer vision journals including IEEE T-PAMI and IJCAI; Cited over 5,000 times by Google Scholar; The first domestic company to apply Silent Live technology to identity authentication in the Internet industry and obtain certification from the Third Research Institute of the Ministry of Public Security; Established a strategic collaboration with Shanghai Jiaotong University to jointly research cutting-edge artificial intelligence technology; Received a letter of appreciation from Jeff Dean, a member of the US National Academy of Engineering and a senior computer scientist at Google. Minivision Tech has won more than 40 honors and qualifications, including the \"Small Giant\" enterprise at state-level with specialization, National High-tech Enterprise, First Prize of Jiangsu Science and Technology Award, the Jiangsu Computer Vision Engineering Research Center, CMMI5 Certification, Nanjing Cultivate Unicorn Enterprise, and Special Environment Adaptation Test Certification. National level specialized, refined, and innovative small giant enterprise The first CVPR 2023 Model Challenge won first place on the A-list and third place on the B-list CVPR 2023 VIZWIZ Grand Challenge won first place in the significance target detection track in the big model competition First Prize in Science and Technology of Jiangsu Province Jiangsu Provincial Computer Vision Engineering Research Center Minivision Mining Intelligent Visual Three Violation Management Platform, Awarded as an \"Excellent Practice Case\" for Industrial Digital Services on Saidi Network Won the double championships of MOT 17 and MOT HT-21 in the 2022 multi-objective tracking MOT international competition The 2020 NIST International Face Recognition Competition FRVT Open Scenarios Ranked Second in the World and Seventh in Global Comprehensive Ranking Specialized environment adaptation testing certification BCTC in vivo detection has obtained \"enhanced level\" technical certification Nanjing cultivates unicorn enterprises 2022 Jiangsu Province Key Fields First Edition Software Product Application Promotion Guidance Catalog 2022 HUAWEI Ascend AI Innovation Competition National Finals - Application Track Silver Award 2022 Fortune's Most Influential IoT Innovation List 2022 Universe Industry Atlas 2022 Private Technology Enterprises in Jiangsu Province Outstanding Contributing Units to the 2021 'Trusted Face Application Guardian Program' 2021 Intelligent Standards Committee Standard Contribution Award Member units of the Smart City Standards Working Group of the National Information Technology Standardization Technical Committee Outstanding Innovation Award in China's AI Big Data Market The fifth batch of intellectual property demonstration enterprises in Nanjing 2021 Jiangsu Province Specialized, Refined, Special, and New Small Giant Enterprise (Innovative) Jiangsu Provincial Software Enterprise Technology Center Nanjing Excellent Invention Patent Award Nanjing Innovative Leading Enterprise Catalogue of New Technologies and Products for Key Promotion and Application in the Province (24th Batch) 2019 Jiangsu Province R&D Enterprise (Cultivated) Forbes 2018 Unlisted Company Potential Enterprise 2018 Jiangsu Province's Most Promising Technology Talent Entrepreneurship Enterprise 2018 Sullivan China New Economy Award",
    "The application solution is being upgraded 2024-01-24 Minivision Technology has passed the testing and verification of the first batch of national standards for facial recognition systems by the National Speech and Image Recognition Product Inspection and Testing Center! Minivision Technology has passed the testing and verification of the first batch of national standards for facial recognition systems by the National Speech and Image Recognition Product Inspection and Testing Center! 2023-10-16 Minivision Mining Intelligent Visual Three Violation Management Platform, Awarded as an \"Excellent Practice Case\" for Industrial Digital Services on Ccidnet Minivision Mining Intelligent Visual Three Violation Management Platform, Awarded as an \"Excellent Practice Case\" for Industrial Digital Services on Ccidnet 2023-09-07 Smart \"Benefiting\" Mines | Minivision Technology Appears at the Service Trade Fair, Leading the Digital and Intelligent Transformation of Mines with a \"Three Step Approach\" Smart \"Benefiting\" Mines | Minivision Technology Appears at the Service Trade Fair, Leading the Digital and Intelligent Transformation of Mines with a \"Three Step Approach\" 2023-09-04 Minivision Technology Main participation in the compilation of 5 standards including \"General Capability Requirements for Artificial Intelligence Development Platforms\" Minivision Technology Main participation in the compilation of 5 standards including \"General Capability Requirements for Artificial Intelligence Development Platforms\" 2023-08-23 2023 China Computing Power Conference | \"Ning\" Gathering Consensus! Minivision Technology Joins Hands with Ningxia Telecom and Digital Ningxia to Build the Western Digital Valley 2023 China Computing Power Conference | \"Ning\" Gathering Consensus! Minivision Technology Joins Hands with Ningxia Telecom and Digital Ningxia to Build the Western Digital Valley 2023-08-22 Minivision Technology Digital Intelligence Community DCS | Create a people-oriented AI community, making AI services ubiquitous Minivision Technology Digital Intelligence Community DCS | Create a people-oriented AI community, making AI services ubiquitous 2023-08-15 Minivision intelligent visual hub platform | Create an AI digital base,improve the refinement, intelligence and scientific level of urban management Minivision intelligent visual hub platform | Create an AI digital base,improve the refinement, intelligence and scientific level of urban management 2023-08-01 Jiangxi Ganjiang New Area Inspection Team Visits Minivision Technology to Investigate the Construction of Smart Communities Jiangxi Ganjiang New Area Inspection Team Visits Minivision Technology to Investigate the Construction of Smart Communities 2023-07-28 Minivision Technology's products are listed in the \"2023 High Quality Digital Transformation Products and Services Panorama\" by CAICT Minivision Technology's products are listed in the \"2023 High Quality Digital Transformation Products and Services Panorama\" by CAICT"
  ]
}