{
  "company": "en.pnpsecure.com",
  "dominant_topics": [
    0,
    1
  ],
  "topic_counts": {
    "0": 12,
    "1": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.7888888888888889,
    "framing_surveillance": 0.1222222222222222,
    "framing_market": 0.0888888888888888,
    "num_docs": 13
  },
  "topic_timeline": {
    "20": {
      "0": 12,
      "1": 1
    }
  },
  "sample_docs": [
    "My account Sign out SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Going Beyond Database Security & Expanding into the Integrated Security Solution Business Area Going Beyond Database Security Businee Area developed with verified technological prowess Expanding into the Integrated Security Solution Business Area that will change the paradigm of current IAM solutins Ever-growing PNPSECURE, the No. 1 Company Starting with network security products, PNPSECURE has continued to grow with well-grounded technology in cloud and biometric authentication security as well. Now, we are taking a leap forward as the next-generation global IT company. Total Clients 6,000+ Market Share NO.1 Total Sales $300M *From 2012 To 2022 Year of Establishment 2003 Ever-growing PNPSECURE, the No. 1 Company Starting with network security products, PNPSECURE has continued to grow with well-grounded technology in cloud and biometric authentication security as well. Now, we are taking a leap forward as the next-generation global IT company. *From 2012 To 2022 Business Areas Unified-IAM + Integrated Security Solutions Establishes a strong and efficient security system with an integrated access and account management solution Cloud Security + Cloud Security Provides PNPSECURE's acclaimed line of products DBSAFER's features in cloud environments DBSAFER + Access and Account Management Blocks internal and external security threats to the company via DB & system access and control and account management features INFOSAFER + Personal Information Access History Management Aids users to adhere to regulations regarding personal information that are becoming more strict DATACRYPTO + Encryption Supports kernel, agent, and API methods with real-time encryption technology that complies with new regulations FaceLocker + Face Recognition Provides a strong zero trust security model based on biometrics, in accordance with digital working environments Establishes a strong and efficient security system with an integrated access and account management solution Provides PNPSECURE's acclaimed line of products DBSAFER's features in cloud environments Blocks internal and external security threats to the company via DB & system access and control and account management features Aids users to adhere to regulations regarding personal information that are becoming more strict Supports kernel, agent, and API methods with real-time encryption technology that complies with new regulations Provides a strong zero trust security model based on biometrics, in accordance with digital working environments Going Beyond Database Security & Expanding into the Integrated Security Solution Business Area Going Beyond Database Security Businee Area developed with verified technological prowess Expanding into the Integrated Security Solution Business Area that will change the paradigm of current IAM Inquiry Ask us anything about implementing our products and technology Sales Inquiry Tech Inquiry Ask us anything about implementing our products and technology Recruit We support your growth in PNPSECURE Apply Recruitment We support your growth in PNPSECURE Business Areas Unified-IAM Integrated Security Solutions ____ Establishes a strong and efficient security system with an integrated access and account management solution + Cloud Security Cloud Security ____ Provides PNPSECURE's acclaimed line of products DBSAFER's features in cloud environments + DBSAFER Access and Account Management ____ Blocks internal and external security threats to the company via DB & system access management, as well as account management features + INFOSAFER Personal Information Access History Management ____ Aids users to adhere to regulations regarding personal information that are becoming more strict + DATACRYPTO Encryption ____ Supports kernel, agent, and API methods with real-time encryption technology that complies with new regulations + FaceLocker Face Recognition ____ Provides a strong zero trust security model based on biometrics, in accordance with digital working environments + Establishes a strong and efficient security system with an integrated access and Provides PNPSECURE's acclaimed line of products DBSAFER's features in cloud environments Blocks internal and external security threats to the company via DB & system access management, as well as account management features Aids users to adhere to regulations regarding personal information that are becoming more strict Supports kernel, agent, and API methods with real-time encryption technology that complies with new regulations Provides a strong zero trust security model based on biometrics, in accordance with digital working environments Ever-growing PNPSECURE, the No. 1 Company Starting with network security products, PNPSECURE has continued to grow with well-grounded technology in cloud and biometric authentication security as well. Now, we are taking a leap forward as the next-generation global IT company. 6,000+ Total Clients NO.1 Market Share $300M Total Sales *From 2012 To 2022 2003 Year of Establishment Ever-growing PNPSECURE, the No. 1 Company Starting with network security products, PNPSECURE has continued to grow with well-grounded technology in cloud and biometric authentication security as well. Now, we are taking a leap forward as the next-generation global IT company. *From 2012 To 2022 Inquiry Ask us anything about the sales of our products and their technology Sales Inquiry Tech Inquiry Recruit We support your growth in PNPSECURE Apply Recruitment Ask us anything about the sales of our products and their technology Sales Inquiry Tech Inquiry We support your growth in PNPSECURE PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright ⓒ 2023 pnpsecure . Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright ⓒ 2023 pnpsecure . PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright ⓒ 2023 pnpsecure . | COMPANY About Us SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright ⓒ 2023 pnpsecure . |",
    "My account Sign out SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry PNPSECURE Products for Your Business ___ What kind of product are you looking for? Access Management Account Management Privacy Encryption Real-Time Face Recognition What kind of product are you looking for? PNPSECURE Products for Your Business _____ What kind of product are you looking for? Access Management Account Management Privacy Encryption Real-Time Face Recognition What kind of product are you looking for? Access Management The best database access management in Korea DBSAFER DB + System access managemnt via user authentication DBSAFER AM + Detailed access management for each file/process DBSAFER OS + Access block for all routes Can block access into all routes including approaches that bypass consoles Surveillance log collection and monitoring Uses log collection and analysis features that track and audit user behaviors to prevent information leakage Supports cloud environment Can be operated freely in both on-premise and cloud environments Access block for all routes Can block access into all routes including approaches that bypass consoles Surveillance log collection and monitoring Uses log collection and analysis features that track and audit user behaviors to prevent information leakage Can be operated freely in both on-premise and cloud environments Account Management Integrated account management DBSAFER IM + Integrated account management for DBMS/OS/networks Integrates and manages heterogeneous accounts scattered throughout various servers from the center Integrated account management for DBMS/OS/networks Integrates and manages heterogeneous accounts scattered throughout various servers from the center Privacy Management of personal information access history INFOSAFER + Fully complies with the new, strengthened criteria set by the personal information protection regulations Adheres to all regulations including access routes, the range of history collection, and storage method Fully complies with the new, strengthened criteria set by the personal information protection regulations Adheres to all regulations including access routes, the range of history collection, and storage method Encryption Encryption of personal information and unstructured data DATACRYPTO + Optimized encryption method and simple operation Offers various encryption methods optimized and tailored to the client's environment and easy-to-use permission management environment Optimized encryption method and simple operation Offers various encryption methods optimized and tailored to the client's environment and easy-to-use permission management environment Real-Time Face Recogniton Safe user authentication and security FaceLocker + Supports adherence to passwordless policy Authenticates users via real-time face recognition and prevents intentional/unintentional data leaks through exposed screens Supports adherence to passwordless policy Authenticates users via real-time face recognition and prevents intentional/unintentional data leaks through exposed screens Access Management The best database access management in Korea + DBSAFER DB System access management via user authentication + DBSAFER AM Detailed access management for each file/process + DBSAFER OS Access block for all routes Can block access into all routes i ncluding approaches that bypass consoles Surveillance log collection and monitoring Uses log collection and analysis features that track and audit user behaviors to prevent information leakage Supports cloud environment Can be operated freely in both on-premise and cloud environments Can block access into all routes i ncluding approaches that bypass consoles Uses log collection and analysis features that track and audit user behaviors to prevent information leakage Can be operated freely in both on-premise and cloud environments Account Management Integrated account management + DBSAFER IM Integrated account management for DBMS/OS/networks Integrates and manages heterogeneous accounts scattered throughout various servers from the center Integrates and manages heterogeneous accounts scattered throughout various servers from the center Privacy Management of personal information access history + INFOSAFER Fully complies with the new, strengthened criteria set by the personal information protection regulations Adheres to all regulations including access routes, the range of history collection, and storage method Adheres to all regulations including access routes, the range of history collection, and storage method Encryption Encryption of personal information and + unstructured data DATACRYPTO Optimized encryption method and simple operatio n Offers various encryption methods optimized and tailored to the client's environment, and easy-to-use permission management environment Offers various encryption methods optimized and tailored to the client's environment, and easy-to-use permission management environment Real-Time Face Recognition Safe user authentication and security + FaceLocker Supports adherence to passwordless policy Authenticates users via real-time face recognition and prevents intentional/unintentional data leaks through exposed screens Authenticates users via real-time face recognition and prevents intentional/unintentional data leaks through exposed screens PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . | COMPANY About Us SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . |",
    "My account Sign out SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry INFRASTRUCTURE SERVER/NETWORK SYSTEM ACCE SS CONTROL ____ DBSAFER AM performs security activities such as managing access and permissions of users and auditing their task history. It can also be linked with DBSAFER DB to enhance management against all server access attempts. NO.1 #1 in Korean market share for DBMS/System integrated access management 100% Perfectly complies with Korean regulations DBSAFER AM performs security activities such as managing access and permissions of users and auditing their task history. It can also be linked with DBSAFER DB to enhance management against all server access attempts. #1 in Korean market share for Perfectly complies with Korean regulations Recommends integrated access management to enhance corporate security Merge the system access management solution and the DB access management solution for more powerful security features and optimized work environment Larger protection coverage __ By merging a system access management solution and a DB access management solution, they can monitor and control each other's areas beyond their own. Quick response to issues through better visibility __ DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. Simplified internal security management __ DBSAFER AM prevents internal security threats by integrating the policy management process and the location of audit log collection to minimize the repetition in the administrators' tasks so that they can apply security policies consistently. Elevated user convenience __ DBSAFER AM guarantees high work convenience and resource availability by establishing a system through which users can connect by authenticating once and allowing the users to freely select a connection point in the DB list. Recommends integrated access management to enhance corporate security Merge the system access management solution and the DB access management solution for more powerful security features and optimized work environment By merging a system access management solution and a DB access management solution, they can monitor and control each other's areas beyond their own. DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. DBSAFER AM prevents internal security threats by integrating the policy management process and the location of audit log collection to minimize the repetition in the administrators' tasks so that they can apply security policies consistently. DBSAFER AM guarantees high work convenience and resource availability by establishing a system through which users can connect by authenticating once and allowing the users to freely select a connection point in the DB list. Key Features Manages access and permissions for each account DBSAFER AM supports access management for all OS in operation such as AIX, HP-UX, Linux, Solaris, and Windows. Additionally, it allows the user to monitor and manage Windows Unix/Linux terminals and file transfer services. Monitors all connectible routes DBSAFER AM is the only access management solution in Korea that uses Server Agent to monitor all routes leading to the database, including gateway bypassers and routes that directly connects to consoles in the data center. Supports diverse user access environments Both the C/S (PC NAT) method where the program or environment which made the connection is maintained and the method of a user accessing via the web are supported. Additionally, the automatic login feature upholds both user convenience and security levels. Monitors and logs remote access in real-time For tasks carried out by connecting to Windows Terminal Service (RDP), the product allows administrators to monitor user screens in real-time and re-enact cases using screenshots. It also provides meta-search for collected audit logs. Manages script files DBSAFER AM can analyze the content of script files executed by users and apply security measures such as blocking the execution if the script contains blacklisted commands. Supports 2-factor authentication Security against system accesses can be enhanced using 2-factor authentication with external means such as smart cards call authentication, and OTP. Many of our clients are using this service. Supports Windows, Linux (GUI), and macOS DBSAFER DB provides identical features using PC Assist, and it is the only one in the industry that supports macOS. DBSAFER AM supports access management for all OS in operation such as AIX, HP-UX, Linux, Solaris, and Windows. Additionally, it allows the user to monitor and manage Windows Unix/Linux terminals and file transfer services. DBSAFER AM is the only access management solution in Korea that uses Server Agent to monitor all routes leading to the database, including gateway bypassers and routes that directly connects to consoles in the data center. Both the C/S (PC NAT) method where the program or environment which made the connection is maintained and the method of a user accessing via the web are supported. Additionally, the automatic login feature upholds both user convenience and security levels. For tasks carried out by connecting to Windows Terminal Service (RDP), the product allows administrators to monitor user screens in real-time and re-enact cases using screenshots. It also provides meta-search for collected audit logs. DBSAFER AM can analyze the content of script files executed by users and apply security measures such as blocking the execution if the script contains blacklisted commands. Security against system accesses can be enhanced using 2-factor authentication with external means such as smart cards call authentication, and OTP. Many of our clients are using this service. DBSAFER DB provides identical features using PC Assist, and it is the only one in the industry that supports macOS. INFRASTRUCTURE SERVER/NETWORK SYSTEM ACCESS CONTROL ____ DBSAFER AM performs security activities such as managing access and permissions of users and auditing their task history. It can also be linked with DBSAFER DB to enhance management against all server access attempts. NO.1 #1 in Korean market share for DBMS/System integrated access management 100% Perfectly complies with Korean regulations DBSAFER AM performs security activities such as managing access and permissions of users and auditing their task history. It can also be linked with DBSAFER DB to enhance management against all server access attempts. #1 in Korean market share for DBMS/System integrated access management Perfectly complies with Korean regulations Configuration Overview Gateway(Proxy) Configuration DBSAFER AM is based on a gateway (proxy) configuration that controls all inflow/outflow network data. It supports both the method of using PC Assist and the method of using the web. DBSAFER DB maximizes security by using Server Agent to control indirect accesses that do not pass through gateways. DBSAFER AM is based on a gateway (proxy) configuration that controls all inflow/outflow network data. It supports both the method of using PC Assist and the method of using the web. DBSAFER DB maximizes security by using Server Agent to control indirect accesses that do not pass through gateways. Supported Environments Cloud Amazon Web Service Cloud Z GCP Koscom Cloud NCP Microsoft Azure Gabia Cloud Kakao Cloud KT Cloud NHN Cloud Terminal SSH Mainframe TN3270 Telnet VNC(Windows) (S)FTP AS/400 TN5250 Windows Terminal rlogin/rsh Related Products Database Access Management DBSAFER DB File/Process Access Management DBSAFER OS Integrated Account Management DBSAFER IM Encryption of Unstructured Data DATACRYPTO Encryption of Unstructured Data Recommends integrated access management to enhance corporate security Merge the system access management solution and the DB access management solution for more powerful security features and optimized work environment Larger protection coverage ____ By merging a system access management solution and a DB access management solution, they can monitor and control each other's areas beyond their own. Simplified internal security management ____ DBSAFER AM prevents internal security threats by integrating the policy management process and the location of audit log collection to minimize the repetition in the administrators' tasks so that they can apply security policies consistently. Quick response to issues through better visibility ____ DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. Elevated user convenience ____ DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. Merge the system access management solution and the DB access management solution for more powerful security features and optimized work environment By merging a system access management solution and a DB access management solution, they can monitor and control each other's areas beyond their own. Simplified internal security management DBSAFER AM prevents internal security threats by integrating the policy management process and the location of audit log collection to minimize the repetition in the administrators' tasks so that they can apply security policies consistently. Quick response to issues through better visibility DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. DBSAFER AM allows administrators to swiftly check activities, abnormalities, and risks of all users in DB and systems via a single UI and respond at once. Key Features Manages access and permissions for each account DBSAFER AM supports access management for all OS in operation such as AIX, HP-UX, Linux, Solaris, and Windows. Additionally, it allows the user to monitor and manage Windows Unix/Linux terminals and file transfer services. Monitors all connectible routes DBSAFER AM is the only access management solution in Korea that uses Server Agent to monitor all routes leading to the database, including gateway bypassers and routes that directly connects to consoles in the data center. Supports diverse user access environments Both the C/S (PC NAT) method where the program or environment which made the connection is maintained and the method of a user accessing via the web are supported. Additionally, the automatic login feature upholds both user convenience and security levels. Monitors and logs remote access in real-time For tasks carried out by connecting to Windows Terminal Service (RDP), the product allows administrators to monitor user screens in real-time and re-enact cases using screenshots. It also provides meta-search for collected audit logs. Manages script files DBSAFER AM can analyze the content of script files executed by users and apply security measures such as blocking the execution if the script contains blacklisted commands. Supports 2-factor authentication Security against system accesses can be enhanced using 2-factor authentication with external means such as smart cards call authentication, and OTP. Many of our clients are using this service. Supports Windows, Linux (GUI), and macOS DBSAFER DB provides identical features using PC Assist, and it is the only one in the industry that supports macOS. DBSAFER AM supports access management for all OS in operation such as AIX, HP-UX, Linux, Solaris, and Windows. Additionally, it allows the user to monitor and manage Windows Unix/Linux terminals and file transfer services. DBSAFER AM is the only access management solution in Korea that uses Server Agent to monitor all routes leading to the database, including gateway bypassers and routes that directly connects to consoles in the data center. Both the C/S (PC NAT) method where the program or environment which made the connection is maintained and the method of a user accessing via the web are supported. Additionally, the automatic login feature upholds both user convenience and security levels. For tasks carried out by connecting to Windows Terminal Service (RDP), the product allows administrators to monitor user screens in real-time and re-enact cases using screenshots. It also provides meta-search for collected audit logs. DBSAFER AM can analyze the content of script files executed by users and apply security measures such as blocking the execution if the script contains blacklisted commands. Security against system accesses can be enhanced using 2-factor authentication with external means such as smart cards call authentication, and OTP. Many of our clients are using this service. DBSAFER DB provides identical features using PC Assist, and it is the only one in the industry that supports macOS. Configuration Overview Gateway(Proxy) Configuration DBSAFER AM is based on a gateway (proxy) configuration that controls all inflow/outflow network data. It supports both the method of using PC Assist and the method of using the web. DBSAFER DB maximizes security by using Server Agent to control indirect accesses that do not pass through gateways. DBSAFER AM is based on a gateway (proxy) configuration that controls all inflow/outflow network data. It supports both the method of using PC Assist and the method of using the web. DBSAFER DB maximizes security by using Server Agent to control indirect accesses that do not pass through gateways. Supported Environments Cloud Amazon Web Service Microsoft Azure Cloud Z Gabia Cloud GCP Kakao Cloud Koscom Cloud KT Cloud NCP NHN Cloud Terminal SSH (S)FTP Mainframe TN3270 AS/400 TN5250 Telnet Windows Terminal VNC(Windows) rlogin/rsh Related Products Database Access Management DBSAFER DB View more File/Process Access Management DBSAFER OS View more Integrated Account Management DBSAFER IM View more Encryption Of Unstructured Data DATACRYPTO View more ALL PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . | COMPANY About Us SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . |",
    "My account Sign out SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Secure Your Business with PNPSECURE Kicking off with the development of the first database access management solution in Korea, PNPSECURE is leading the next-generation digital security market with access management, account management, access history management, encryption, and face recognition. Secure Your Business with PNPSECURE Kicking off with the development of the first database access management solution in Korea, PNPSECURE is leading the next-generation digital security market with access management, account management, access history management, encryption, and face recognition OUR MISSION C reate a security solution that every security officer in the world wants to use _____ In the face of rapidly changing IT environments and all the threats of digital security incidents, we have founded PNPSECURE to create a security solution that every security officer in the world wants to use. Since starting business in 2003 as the first DB access management service company in Korea, we have always considered our role in developing the best digital security solutions and realizing the public interest through them. Finally we have confirmed that our role is to create standards for digital security based on expertise and technology. Over 20 years of experience and technology, PNPSECURE has expanded its business area, keeping pace with evovlving security trends, and is now becoming one of top global IT security companies beyond Korea. PNPSECURE will keep focusing on developing and providing products that perfectly meet clients' needs. We believe all companies can build a secure infrastructure environment which is comfortable and convenient to manage, with us. C reate a security solution that every security officer in the world wants to use CORE VALUES 3E E XPERT Maintaining advanced product completeness with continuous R&D E NERGIZE Challenging passionately, actively and continuously E NCOURAGE Growing up together by motivating each other Maintaining advanced product completeness with continuous R&D Challenging passionately, actively and continuously Growing up together by motivating each other OUR MISSION Create a security solution that every security officer in the world wants to use ___ In the face of rapidly changing IT environments and all the threats of digital security incidents, we have founded PNPSECURE to create a security solution that every security officer in the world wants to use. Since starting business in 2003 as the first DB access management service company in Korea, we have always considered our role in developing the best digital security solutions and realizing the public interest through them. Finally we have confirmed that our role is to create standards for digital security based on expertise and technology . Over 20 years of experience and technology, PNPSECURE has expanded its business area, keeping pace with evovlving security trends, and is now becoming one of top global IT security companies beyond Korea. PNPSECURE will keep focusing on developing and providing products that perfectly meet clients' needs. We believe all companies can build a secure infrastructure environment which is comfortable and convenient to manage, with us. CORE VALUES 3E E XPERT Maintaining advanced product completeness with continuous R&D E NERGIZE Challenging passionately, actively and continuously E NCOURAGE Growing up together by motivating each other Sec ured by PNPSECURE More than 6,000 Korean clients have chosen PNPSECURE. PNPSECURE is responsible for the digital security of Korean companies and public institutions. Sec ured by PNPSECURE More than 6,000 Korean clients have chosen PNPSECURE. PNPSECURE is responsible for the digital security of Korean companies and public institutions. Secured by PNPSECURE More than 6,000 Korean clients have chosen PNPSECURE. PNPSECURE is responsible for the digital security of Korean companies and public institutions. More than 6,000 Korean clients have chosen PNPSECURE. PNPSECURE is responsible for the digital security of Korean companies and public institutions. Achieved by PNPSECURE PNPSECURE 3.0 Since 2022 First step into the global market to become an integrated solution company in and outside of Korea First step into the global market to become an integrated solution company in and outside of Korea 2022 · 3 patents registered · Verified as an Inno-Biz · Verified as a startup company (Innovative growth type) · Verified as a hidden champion PNPSECURE 2.0 2014 - 2021 Secured competitiveness and expanded the field of business by enhancing internal R&D capabilities Secured competitiveness and expanded the field of business by enhancing internal R&D capabilities 2021 · FaceLocker V3.0 released · Prime Minister's Citation for Software Industry Development Merits 2020 · The 7th Korea's Software Product Quality Excellence Award 2019 · 4 patents registered 2018 · Crypto module DATACRYPTO V3.0 verified by the National Intelligence Service · Mayor's Citation for Seoul Information Security System Achievement Award · Minister's Citation for ICT Innovation/Welfare Field · Minister's Citation for Science Technology Promotion Merits · 2 patents registered 2017 · 1 patents registered 2016 · Minister of Science, ICT an Future Planning's Citation for 2016 Software Industry Development Merits · DATACRYPTO V1.0, INFOSAFER V1.1, QueryBox V2.0, QueryBos-s V2.0 2015 · moved into Play Museum in Bundang-gu · 2 patents registered 2014 · Joined as an affiliate of NHN Entertainment · 3 patents registered PNPSECURE 1.0 2003 - 2013 Pioneered the first DB access management market in Korea Pioneered the first DB access management market in Korea 2013 · Received the Minister of Trade, Industry and Energy's Citation for Model Medium-sized Enterprise 2012 · Received the Jang Young-shil award · 3 patents registered 2011 · Received the Minister of Knowledge Economy's Award 2 times · Received the Invention Promotion Association President's Award · NODESAFER V3.0 registered · 5 patetnts registered including overseas patent 2009 · DBSAFER V3.0, DBSAFER DMS V2.0, WASSAFER V4.0, NODESAFER V2.0 registeration · A total of 4 registered patents and technology certifications 2008 · 1 patents registered 2007 · DBSAFER V2.0, Decied V2.0 · 1 patents registered · Verified as Inno-Biz, Startup company 2006 · Obtained National Intelligence Service's National Information Security System Security Aptness Verification 2005 · Verified as a new gateway-type DB security software 2004 · Selected as New Excellent Information Communication Technology by the Ministry of Information and Communication 2003 · Established PNPSECURE Corporation · DBSAFER V1.0 released PNPSTATION In October 2022, PNPSECURE moved to a new office in Magok, equipped with pleasant working areas and comfortable parking spaces. Visit Us 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong, PNPSTATION) Underground parking lot (B1-B3) available 5-minute walk from Line 9/AREX Magongnaru Station Exit 1 6645,6648 (Magongnaru Station Exit 1) 6647 (Magok M Valley Complex 4) 6642 (LOTTE R&D Center) In October 2022, PNPSECURE moved to a new office in Magok, equipped with pleasant working areas and comfortable parking spaces. 182, Magokseo-ro, Gangseo-gu, Seoul, Underground parking lot (B1-B3) available 5-minute walk from Line 9/AREX Magongnaru Station Exit 1 6645,6648 (Magongnaru Station Exit 1) 6647 (Magok M Valley Complex 4) 6642 (LOTTE R&D Center) PNPSECURE 3.0 Since 2022 First step into the global market to become an integrated solution company in and outside of Korea 2022 · 3 patents registered · Verified as an Inno-Biz · Verified as a startup company (Innovative growth type) · Verified as a hidden champion First step into the global market to become an integrated solution company in and outside of Korea PNPSECURE 2.0 2014 - 2021 Secured competitiveness and expanded the field of business by enhancing internal R&D capabilities 2021 · FaceLocker V3.0 released · Prime Minister's Citation for Software Industry Development Merits 2020 · The 7th Korea Software Product Quality Excellence Award 2019 · 4 patents registered 2018 · Crypto mocule DATACRYPTO V3.0 verified by the National Intelligence Service · Mayor's Citation for Seoul Information Security System Achievement Award · Minister's Citation for ICT Innovation/Welfare Field · Minister's Citation for Science Technology Promotion Merits · 2 patents registered 2017 · 1 patents registered 2016 · Minister of Science, ICT and Future Planning's Citation for 2016 Software Industry Development Merits · DATACRYPTO V1.0, INFOSAFER V1.1, QueryBox V2.0, QueryBox-s V2.0 2015 · Moved into Play Museum in Bundang-gu · 2 patents registered 2014 · Joined as an affiliate of NHN Entertainment · 3 patents registered Secured competitiveness and expanded the field of business by enhancing internal R&D capabilities PNPSECURE 1.0 2003 - 2013 Pioneered the first DB access management market in Korea 2013 · Received the Minister of Trade, Industry and Energy's Citation for Model Medium-sized Enterprise 2012 · Received the Jang Young-shil award · 3 patents registered 2011 · Received the Minister of Knowledge Economy's Award 2 times · Received the Invention Promotion Association President's Award · NODESAFER V3.0 registered · 5 patetnts registered including overseas patent 2009 · DBSAFER V3.0, DBSAFER DMS V2.0, WASSAFER V4.0, NODESAFER V2.0 released · A total of 4 registered patents and technology certifications 2008 · 1 patents registered 2007 · DBSAFER V2.0, Decide V2.0 released · 1 patents registered · Verified as Inno-Biz, Startup company 2006 · Obtained National Intelligence Service's National Information Security System Security Aptness Verification Aptness Verification 2005 · Verified as a new gateway-type DB security software 2004 · Selected as New Excellent Information Communication Technology by the Ministry of Information and Communication 2003 · Established PNPSECURE Corporation · DBSAFER V1.0 released DB access management market in Korea PNPSTATION In October 2022, PNPSECURE moved to a new office in Magok, equipped with pleasant working areas and comfortable parking spaces. Visit Us 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong, PNPSTATION) Underground parking lot (B1-B3) available 5-minute walk from Line 9/AREX Magongnaru Station Exit 1 6645,6648(Magongnaru Station Exit 1) 6647(Magok M Valley Complex 4) 6642(LOTTE R&D Center) In October 2022, PNPSECURE moved to a new office in Magok, equipped with pleasant working areas and comfortable parking spaces. 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong, PNPSTATION) Underground parking lot (B1-B3) available 5-minute walk from Line 9/AREX Magongnaru Station Exit 1 6645,6648(Magongnaru Station Exit 1) 6647(Magok M Valley Complex 4) Company Info. Name PNPSECURE CEO Cheon-Oh, Park Establishment Dec, 2003 Memebers 210 (April, 2025) Businee Software Contact 1670-9295 Products DBSAFER DB/AM/IM/OS, INFOSAFER, DATACRYPTO, FaceLocker Address 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong, PNPSTATION) DBSAFER DB/AM/IM/OS, INFOSAFER, DATACRYPTO, FaceLocker 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong, PNPSTATION) PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . | COMPANY About Us SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . |",
    "My account Sign out SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Secure Your Business with PNPSECURE Secure Your Business with PNPSECURE Blog ë\"보기 Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. You can check the attachment for a full view.. More shots with final designs coming soon. You can check the attachment for a full view.. More shots with final designs coming soon. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. we have a lot of fun during this phase. We are working on an exciting project for a company in the investment business. Stay tuned! we have a lot of fun during this phase. We are working on an exciting project for a company in the investment business. Stay tuned! Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. You can check the attachment for a full view.. More shots with final designs coming soon. You can check the attachment for a full view.. More shots with final designs coming soon. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. More Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. You can check the attachment for a full view.. More shots with final designs coming soon. You can check the attachment for a full view.. More shots with final designs coming soon. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. we have a lot of fun during this phase. We are working on an exciting project for a company in the investment business. Stay tuned! we have a lot of fun during this phase. We are working on an exciting project for a company in the investment business. Stay tuned! Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... Hey! Recently we were working on a project for .. We design and build digital products people enjoy using... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... A new project is an opportunity to create something unique. We are a Creative Digital Agency based in Buenos Aires, Argentina. We take pride in designing and building... We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs We look forward to working with you on your next project As an interdisciplinary agile team, our production process is flexible, collaborative, and adapts to each client's needs Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. Style Tiles are always a good option to show work in progress! We are working on the UX/UI design for a large hotel owners and hospitality management company. You can check the attachment for a full view.. More shots with final designs coming soon. You can check the attachment for a full view.. More shots with final designs coming soon. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. This is a proposal to add value to a crowdfunding listing page we streamline the process without having to make multiple mockups. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. Clients easily understand them Style tiles serve as a flexible starting point that helps us easily communicate the essence of a visual brand for the web. PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . Tel. 1670-9295 |E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . PNPSECURE | 107-86-44093 CEO Cheon-Oh, Park Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . | COMPANY About Us SOLUTIONS Unified-IAM Cloud Zero Trust PRODUCTS DBSAFER DB DBSAFER AM DBSAFER OS DBSAFER IM DATACRYPTO RECRUIT Employee Welfare Recruitment How to Apply SUPPORT Sales Inquiry Tech Inquiry Tel. 1670-9295 E-mail sales@pnpsecure.com 182, Magokseo-ro, Gangseo-gu, Seoul, Republic of Korea (Magok-dong) Copyright â\"' 2023 pnpsecure . |"
  ]
}