{
  "company": "en.sjtu.edu.cn",
  "dominant_topics": [
    1,
    -1
  ],
  "topic_counts": {
    "1": 4,
    "-1": 1
  },
  "topic_descriptions": {
    "1": "module, students, year, level, grade"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "1": 4
    }
  },
  "sample_docs": [
    "Faculty Academic Calendar Library Campus Bus Schedules Campus Maps Directions Giving Museums Journals Scholarships Sports Facility International Student Council ã€Shine】China-Russia Aerospace Joint Institute established in Shanghai Oct 27 2017 ã€Shine】Exhibition shows life of famous military general Nov 2 2017 ã€Shine】The invisible ink that can be made visible, then invisible, and visible again Nov 3 2017 ã€Shanghai Daily】Jiao Tong University Held Commencement Ceremony Mar 27 2017 Building Closer Relations with Leading Chinese University Dec 15 2016 ã€Shanghai Daily】Scholars Ponder Meaning of Tokyo Trial Nov 22 2016 ã€China Daily】Program to Boost Development of Automotive Sector Launched Nov 18 2016 ã€Foreign Affairs】Gov. Rick Snyder Visits SJTU Nov 15 2016 ã€Pakistan Observer】China Holds Tokyo Trials and World Peace Forum Nov 15 2016 ã€CCTV News】Interview: Trials to Defend Civilization Nov 13 2016 ã€CCTV News】China's Efforts to Save Energy, Cut Emissions Nov 7 2016 ã€CCTV News】'World Cities Day' Highlights 'Inclusive Cities, Shared Development' Oct 31 2016 ã€Shanghai Daily】Fund Launched for Rural Teacher Training Jul 12 2016 ã€Shanghai Daily】A Lecture in the Garden Jul 7 2016 ã€Xinhua Net】New Chinese Study Helps Explain Dangerous Ice Buildup on Planes Jun 28 2016 ã€CCTV News】Chinese Scientists Enjoy Major Discovery in Physics Jun 23 2016 ã€China Daily】Chinese Physicists Make Quantum Leap Jun 23 2016 ã€ICS】SH Scientists Succeed in Detecting Majorana Particles Jun 22 2016 ã€Shanghai Daily】Chinese Companies Court Foreign Students at Job Fair May 21 2016 ã€CCTV News】Shanghai's Old Town Needs Better Conservation May 20 2016 ã€ICS】SJTU Builds Rowing Course on Campus Apr 14 2016 ã€China Daily】Secretary Explains University's Path Apr 5 2016 ã€China Daily】Photo Software to 'Rebuild' Ancient Shanghai Mar 21 2016 ã€Nature】China Opens Translational Medicine Centre in Shanghai Oct 29 2014 ã€Nature】Developing Excellence: Chinese University Reform in Three Steps Oct 15 2014 ã€Science】Chinese Team is Catching Up in Hunt for Dark Matter Aug 26 2014 ã€Education Technology】Chinese Universities Join MOOC Market Jun 18 2014 ã€Shanghai Daily】College Students Prefer IPhones Over Other Handsets Jun 18 2014 ã€Shanghai Daily】Students Encouraged to Give Old Bikes to Charity Jun 18 2014 ã€China Daily】'White Hats' Help Websites by Plugging Security Holes May 29 2014 ã€China Daily】Living in a Haze Mar 19 2014 ã€China Daily】Shanghai-Michigan Venture Wins Award Mar 17 2014 ã€China Daily】Shanghai Machinery Company Spending Big on Innovation Dec 30 2013 ã€Shanghai Daily】David Cameron Defends China Trade Mission Dec 3 2013 ã€Shanghai Daily】Students Are No Fans of Dormitory Heat Measures Aug 7 2013 ã€Shanghai Daily】Students Show Off Products They Developed Aug 8 2013 ã€Shanghai Daily】New, Efficient Heat Pump Invented in City Jul 23 2013 ã€Shanghai Daily】Shanghai Universities Ink Deal on Online Courses Jul 10 2013 ã€China Daily】Beidou's 2nd Trial Held in Yangtze Delta Jun 22 2013 ã€China Daily】More Research Papers Published by Chinese May 30 2013 ã€Shanghai Daily】French President says more Youth Contacts will Boost Ties Apr 27 2013 ã€Xinhuanet】Cancer cells could be weighed in future Apr 19 2013 ã€China Daily】Asia Seeks the Way Ahead Apr 5 2013 ã€Shanghai Daily】Cyber expert slams \"spy\" report Mar 28 2013 ã€China Daily】Scholars suggest ways to tell China's story Mar 26 2013 ã€PV Magazine】JinkoSolar to partner with SJTU at the '2013 Solar Decathlon China' Mar 21 2013 ã€Shanghai Daily】Top Universities Drop English Exams Mar 17 2013 ã€Xinhuanet】China to publish Tokyo Trials book collection Mar 15 2013 ã€Shanghai Daily】Hospital trials Nov 24 2012 ã€Shanghai Daily】Cashiers chucked as canteens adopt check-out chips Nov 24 2012 ã€Shanghai Daily】Laureate hired Nov 14 2012 ã€Shanghai Daily】Local university unveils its 'baby elephant' robot Nov 8 2012 ã€Shanghai Daily】Cancer drugs may become cheaper after breakthrough Nov 6 2012 ã€Shanghai Daily】Intelligent machine Oct 31 2012 ã€Shanghai Daily】New tech to help police find missing people Oct 26 2012 ã€Shanghai Daily】A retrospective of China's space ambition Oct 24 2012 ã€Xinhuanet】China to publish books on Tokyo Trials Oct 24 2012 ã€Shanghai Daily】Shanghai doctors reveal face-change leap Sep 20 2012 ã€Shanghai Daily】Local scientists find a way to boost malaria drug production Jul 4 2012 ã€Voice of Scholar】Shanghai needs patience and efforts to achieve its ambition Jun 29 2012 ã€Shanghai Daily】Rich course offerings in summertime Jun 27 2012 ã€Shanghai Daily】Inspiring 'Crippled Horse' makes no lame excuses May 11 2012 ã€Voice of Scholar】Prof. John Ross: China faces new international trends May 10 2012 ã€Xinhuanet】Chinese scientist elected as NAS foreign associate May 2 2012 ã€Shanghai Daily】French link-up Apr 9 2012 ã€Xinhuanet】China to establish Tokyo Trials research center Apr 1 2012 ã€Shanghai Daily】Shanghai scientists are closer to finding elusive particle Mar 29 2012 ã€Shanghai Daily】Big stem cell breakthrough Mar 17 2012 ã€Xinhuanet】China's rich reluctant to take over family firms: report Mar 17 2012 ã€Shanghai Daily】Progress cited in search for elusive particle Mar 9 2012 ã€The Lancet】Shen Xiaoming: linking evidence to advocacy for health in China Mar 3 2012 ã€Shanghai Daily】Museum holds seminar on Qian Xuesen Feb 24 2012 ã€Voice of Scholar】Daniel A. Bell: Memo From Davos: Elites Within Elites Jan 29 2012 ã€Voice of Scholar】Daniel A. Bell: What China Can Teach Europe Jan 7 2012 ã€Voice of Scholar】Liu Kang: Action and shared values key to winning global voice Jan 5 2012 ã€Voice of Scholar】Prof. Liu Kang Guest on People in the Know of CRI: How to Build up China's Soft Power Jan 3 2012 ã€ScienceNet】Chen Saijuan Elected Foreign Member of French National Academy of Medicine Dec 23 2011 ã€Xinhuanet】Chinese President Calls on Nation to Learn from Scientist Qian Xuesen Dec 11 2011 Key Programs and Model Curricula FAQs In Chinese Language Study",
    "Faculty Academic Calendar Library Campus Bus Schedules Campus Maps Directions Giving Museums Journals Scholarships Sports Facility International Student Council Seven years is not a long period of time, but not short, either. I have spent almost seven years in SJTU. And those years will definitely be unforgettable and memorable. Thanks to SJTU, my Alma Mater, I have learnt a lot, experienced a lot and as a result grown up a lot. SJTU for me is such a marvelous place where nothing is impossibe and where you can make your dream come true. In my undergraduate years, I had the opportunities of participating in a lot of volunteer activities, such as Shanghai International Marathon Competition, 14 th FINA World Championships - Shanghai 2011, Top China and Top Brazil Program and World Expo 2010. These experiences cultivated my team spirit as well as leadership. And later, they became my great treasure in tackling student affairs in SEIEE.Since my junior year, I have started to devote myself to student affairs. I quite enjoy working as a student mentor, guiding and helping other students as well as my school and university. Through this way, I grew up a lot with others and realized my self-value. All in all, I just wanna say 'THANK YOU, SJTU'. 2007.9-2011.8 B. E., School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University 2011.9-2014.3 M. E., School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University 2013 Advanced Individual in Enrolling Undergraduates, SJTU 2012 Model of Instructor, SJTU 2012 one of the ten news figures of \"Moving SJTU\" 2011-2012 Excellent Communist, SJTU 2011-2012 Excellent Communist Youth League Member, SJTU 2010 Outstanding Volunteer, Shanghai World Expo 2010 2012.4-, Instructor of SEIEE Student Union 2011.9-, Ideology and Politics Teacher for the undergraduates, SEIEE The list above cannot cover all the jobs and achievements of Chao Ruiqi. He is an active and positive guy, full of passion and enthusiam, willing to help others and serve others. Therefore, he has participated in numorous activities and made quite a lot of achievements. Actually, the first time I met with him and got to know about him was not because of this graduate report, but due to a volunteer activity, China Satellite Navigation Conference 2011. Via this activity, I sensed his great team spirit as well as leadership. He was here and there, good at cooperation and coordination. As a student instructor, he could be called a mentor guiding and helping students with heart and soul. When working as the instructor of SEIEE Student Union, he instructed the Union successfully holding \"Hello World\", Welcome Party for the freshman. The video specifically made for this party received extensive attention, including CCTV and JSTV. He was also in charge of writing news reports about the activities held by the Union and those reports also enjoyed wide attention by print media as well as online media. As a result, he received lots of awards, such as 2013 Advanced Individual in Enrolling Undergraduates, SJTU, 2012 Model of Instructor, SJTU, 2012 one of the ten news figures of \"Moving SJTU\", 2011-2012 Excellent Communist, SJTU, 2011-2012 Excellent Communist Youth League Member, SJTU, 2010 Outstanding Volunteer, Shanghai World Expo 2010. Those achievements are a sound proof of his devotion and commitment. Non-Degree Program Master Program PhD Program Faculty Overview Master Program PhD Program Faculty Overview",
    "Academicians Academic Calendar Library Campus Bus Schedules Campus Maps Directions Giving Museums Journals Scholarships Sports Facility International Student Council Amazing University Life, Amazing ACM Class Experience My school life at SJTU is amazing, and all the amazing things unfolded when I joined ACM Honored Class. Here, I met the best Computer Science students in China, got exposed to many different fields ranging from the foundational mathematics to relevant Computer Science fields, and most importantly, I gained experience and confidence to proceed further in the future. Various projects constituted a major part of my coursework at ACM Class. During the four years, I worked very hard on some very challenging projects and led several project teams. I had the chance to collaborate with many clever brains and thus our team managed to make a robot that can play chess, a database management system with novel features, and a swarm intelligence-based CPU simulator. I also had the honor of serving as a teaching assistant for the undergraduate-level Workshop of Computer Organization and Architectures. One of the key ingredients of ACM Class is to let students get involved in cutting-edge research as early as possible. In sophomore year, I started research work at the APEX Data and Knowledge Management Lab. Last year, I worked as a research intern at the Advanced Digital Sciences Center (ADSC) in Singapore. I did some really interesting work on machine learning and computer vision. In addition to the amazing academic experience, I have been actively involved in various extracurricular activities. I have been serving as class president since freshman year. As a class president, I organized seminars, competitions, excursions, led sports teams and helped my classmates whenever they were in trouble. I also volunteered in 2010 Shanghai World Expo, during which I offered help to tourists from all over the world. B.Eng., ACM Honored Class, Computer Science, Shanghai Jiao Tong University National Scholarship of China, 2010-2011 (awarded to top 2% students) Tencent Scholarship, 2009-2010 (2 out of 900 students) Achieved an overall GPA of 3.75/4.0, ranking 3rd among 26 elite students in ACM Honored Class President of 08 ACM Honored Class He is a truly talented student and also he is a rather diligent thinking thing. He enjoys thinking alone and meanwhile he values working with teammates. He is active on campus and at the same time his life off campus is also very colorful. He enjoys reading research papers in various fields of computer science. And apart from just reading, he thinks hard about the topics therein, and tries to come up with new ideas. Thus, he managed to achieve several important academic scholarships and managed to accomplish major parts of several projects by himself: in Nachos OS project of his Operating Systems course, for example, which is a project originated from UC Berkeley and a multi-threaded kernel running on a simulated MIPS processor, he designed and implemented process scheduling, virtual memory, and a basic file system. Most importantly, he managed to publish his paper: Towards an order-preserving approximation of LASSO programs under double-blind review, co-authored with his advisors Zhang Zhenjie, Bernard Ghanem, and Yang Yin at ADSC. He likes talking to other people about interesting research problems, and sharing his ideas with them. He believes it more productive to work with a team than doing everything alone and he finds lots of fun when working with his teammates. In Fatworm course project, he worked with his teammates on query optimization, concurrency control and integration of different modules. In Computer Go project, an Artifcial Intelligence course project, he, together with his teammates, implemented a computer go agent based on the state-of-art Monte-Carlo tree search method and his team's AI beat all the other teams' agents and won the final championship. On campus, he is very active. He worked as class president since freshman year and as president he was involved in various activities. For example, he organized seminars, competitions, excursions, and led sports teams. Off campus, he has all kinds of hobbies, including playing tennis, swimming, reading books, and traveling. In his word, his life is colorful both on and off campus. Reported by Li Jing Key Programs and Model Curricula FAQs In Chinese Language Study",
    "Academicians Academic Calendar Library Campus Bus Schedules Campus Maps Directions Giving Museums Journals Scholarships Sports Facility International Student Council I repeatedly told myself to be far-sighted for the future, to be a man who purses a worthy dream. For me, being a first-rate news reporter has always been my guiding dream and fighting motivation. News as an industry is irreplaceable, powerful, and inferential to human society, and I want to be a part of it, a weighty part. On the way of pursing this ambition, I failed and tried, then failed and then tried again. I struggled from junior college to university, and spent three years only to make myself qualified for one of the most outstanding graduate schools that I dreamed of: SJTU. M.A. in Journalism, School of Media and Design, Shanghai Jiao Tong University Outstanding graduate of Shanghai Jiao Tong University He won SJTU Academic Excellence Scholarship (B-class) three times. He achieved the Second Prize of 2010 Subject Research of Shanghai Municipal People's Congress In 2011, he got the First Prize of Decision-making Consultation Project of Shanghai Municipal Government. Zhu Weidong, graduated from China Institute of Industrial Relations, took the National Entrance Examination for Postgraduate three times and was eventually admitted by SJTU School of Media and De 2010 with the highest score in the discipline of Journalism. In the two-and-a-half-year time at SJTU, he continued to move forward towards his dream. Apart from learning necessary skills and improving related abilities, he grabbed every chance to get himself a deeper understanding and a more practical view of this industry. In his undergraduate period, he had served as an intern at CCTV2 for as long as 9 months. After he entered SJTU, he has successfully completed internships at Institute of Journalism of Jiefang Daily Group in 2011 and China Business Network of Shanghai Media Group in 2012. The experiences offer him opportunities to work with world renowned brands such as Rossini watch and Samsung, as well as to report, edit and analyze news materials in famous columns. Thanks to his perseverance in dream and diligence at work, now, he is enrolled in the reporter position of Zhejiang Radio and Television Group in advance.His professional skills and communicative ability have witnessed a great improvement and the idea of being a news reporter was even firmer in his mind. To prepare himself for the huge psychological and physical pressure of this profession, he keeps doing intensified exercises and that's probably part of the reason why he's more capable of handling pressure and obstacles than others. Running and riding are his favorite sports. You can see him at school gym at least three times a week. It is really amazing that he once rode from Beijing to the north end of China: spending 35 days, passing nearly 3000 kilometers. He has to admit there were a lot of pains and detours on his way of pursuing dream, however, he persevered and conquered. He wants to share with you all that the key to success is being calm, perseverant, and unafraid of making mistakes. As is said by a famous writer Hu Shi, all efforts are not made for nothing. Reported by Zhu Xiaotong Key Programs and Model Curricula FAQs In Chinese Language Study",
    "Faculty Academic Calendar Library Campus Bus Schedules Campus Maps Directions Giving Museums Journals Scholarships Sports Facility International Student Council I repeatedly told myself to be far-sighted for the future, to be a man who purses a worthy dream. For me, being a first-rate news reporter has always been my guiding dream and fighting motivation. News as an industry is irreplaceable, powerful, and inferential to human society, and I want to be a part of it, a weighty part. On the way of pursing this ambition, I failed and tried, then failed and then tried again. I struggled from junior college to university, and spent three years only to make myself qualified for one of the most outstanding graduate schools that I dreamed of: SJTU. M.A. in Journalism, School of Media and Design, Shanghai Jiao Tong University Outstanding graduate of Shanghai Jiao Tong University He won SJTU Academic Excellence Scholarship (B-class) three times. He achieved the Second Prize of 2010 Subject Research of Shanghai Municipal People's Congress In 2011, he got the First Prize of Decision-making Consultation Project of Shanghai Municipal Government. Zhu Weidong, graduated from China Institute of Industrial Relations, took the National Entrance Examination for Postgraduate three times and was eventually admitted by SJTU School of Media and De 2010 with the highest score in the discipline of Journalism. In the two-and-a-half-year time at SJTU, he continued to move forward towards his dream. Apart from learning necessary skills and improving related abilities, he grabbed every chance to get himself a deeper understanding and a more practical view of this industry. In his undergraduate period, he had served as an intern at CCTV2 for as long as 9 months. After he entered SJTU, he has successfully completed internships at Institute of Journalism of Jiefang Daily Group in 2011 and China Business Network of Shanghai Media Group in 2012. The experiences offer him opportunities to work with world renowned brands such as Rossini watch and Samsung, as well as to report, edit and analyze news materials in famous columns. Thanks to his perseverance in dream and diligence at work, now, he is enrolled in the reporter position of Zhejiang Radio and Television Group in advance.His professional skills and communicative ability have witnessed a great improvement and the idea of being a news reporter was even firmer in his mind. To prepare himself for the huge psychological and physical pressure of this profession, he keeps doing intensified exercises and that's probably part of the reason why he's more capable of handling pressure and obstacles than others. Running and riding are his favorite sports. You can see him at school gym at least three times a week. It is really amazing that he once rode from Beijing to the north end of China: spending 35 days, passing nearly 3000 kilometers. He has to admit there were a lot of pains and detours on his way of pursuing dream, however, he persevered and conquered. He wants to share with you all that the key to success is being calm, perseverant, and unafraid of making mistakes. As is said by a famous writer Hu Shi, all efforts are not made for nothing. Reported by Zhu Xiaotong Non-Degree Program Master Program PhD Program Faculty Overview Master Program PhD Program Faculty Overview"
  ]
}