{
  "company": "english.taiwanmobile.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 11
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.9803921568627452,
    "framing_surveillance": 0.0,
    "framing_market": 0.0196078431372549,
    "num_docs": 11
  },
  "topic_timeline": {
    "20": {
      "0": 11
    }
  },
  "sample_docs": [
    "Company Profile Management Team Milestone Awards & Recognitions Affiliated Companies Press Release CSR Report CSR Corporate Governance Operational Status Financials Debt Information Shareholder Information Board of Directors Announcement Investor Events Contact Us FAQ Postpaid Service Prepaid Service International Call Mobile Internet Mobile Broadband Value Added Service For Home For Business Contact Us Service Locations FAQ Network & Coverage Network Registration Dial Instruction Avaliable Services Phone Reservation Bridge Alliance Useful Numbers Welcome to Bridge Alliance, the leading and largest mobile alliance in Asia Pacific. Spanning across eleven major territories with a current partnership of eleven mobile operators, Bridge Alliance serves over 295 million customers offering frequent travellers a suite of value added services that redefines their roaming experience across the members networks. Taiwan Mobile is a member of Bridge Alliance, together, we bring you a suite of compelling services and benefits that allow you to stay connected seamlessly across the region. For more information about Bridge Alliance, visit www.bridgealliance.com No more bill shock! With our one-flat data roaming rate, you can save up to 90% when roaming across 12 territories within Asia Pacific. Start saving today with Bridge DataRoam, a smarter choice to stay connected anytime, anywhere. BRIDGE SAVINGS CALCULATOR Simplify your global mobility needs! Take control of your regional mobile needs with Bridge BizConnect. Increase your efficiency and productivity with Bridge BillAnalyser. Stay ahead in this competitive business world with Bridge DataRoam. Be delighted with our privileges! With Bridge Privileges, travelling is now made more pleasurable. Join us as a member today! Roam with peace of mind! With Bridge Assist, you can now get assistance on your roaming needs wherever you are. Call: +65 6424 6288 SMS: +65 8284 9988 Email: bridgeassist@bridgemobile.com",
    "Independence Statement Taiwan Mobile's independent director must meet all 10 criteria below: Criterion 1 Not an employee of the Company or its affiliated companies Criterion 2 Not a director or supervisor of the Company's affiliated companies (unless the person is an independent director of the Company, the Company's parent company or any subsidiary of the Company as established in accordance with the regulations of the country) Criterion 3 Not a shareholder whose total holdings, including those of his/her spouse and minor children, or shares held under others' names reach or exceed 1 percent of the total outstanding shares of the Company or rank among the top 10 individual shareholders Criterion 4 Not a spouse or relative within second degree by affinity, or within three degrees by consanguinity to any person specified in criteria 1 to 3 Criterion 5 Neither a director, supervisor, or employee of an entity that directly and/or indirectly holds more than 5% of the Company's shares, nor one of the Company's top five shareholders Criterion 6 Not a director, supervisor, manager, or shareholder owning more than 5% of the outstanding shares of any company that has financial or business relations with the Company Criterion 7 Not an owner, partner, director, supervisor, manager, or spouse of any of the aforementioned, of any sole proprietorship, partnership, company, or institution that provides commercial, legal, financial or accounting services or consultations to the Company or its affiliates. However, members of the Remuneration and Nomination Committee are not covered by this restriction per Article 7 of the Regulations Governing the Appointment and Exercise of Powers by the Remuneration Committee of a Company Whose Stock is Listed on the Stock Exchange or Traded Over the Counter Criterion 8 Not a spouse or relative within second degree by affinity to other directors Criterion 9 Not in contravention of Article 30 of the Company Act Criterion 10 Not an institutional shareholder or its representative pursuant to Article 27 of the Company Act Our target share of independent directors on the board is at least 40%, which is much higher than the Securities Exchange Act's requirement of no less than three1 in number and no less than one-fifth of the total number of directors. Note 1:The audit committee, composed entirely of independent directors, shall not have seats fewer than three. The company had 9 board members in 2018 of which 4 are independent directors. Although there are only 8 board members currently since Jamie Lin, independent director, resigned on Feb. 11, 2019. The company plans to by-election an independent director at 2019 annual shareholders' meeting to achieve 40% of target share of independent directors on the board. Board of Directors Please Swipe Left or Right View All. Title Name* Chairman Daniel M. Tsai Director Richard M. Tsai Independent Director Jack J.T. Huang Independent Director Hsueh-Jen Sung Independent Director Char-Dir Chung Independent Director Hsi-Peng Lu Director Howard Lin Director Chris Tsai Director Jamie Lin Over five years of experience in business, finance, legal and/or other areas related to the Company's business Independence criteria (Notes) No. of public companies in which he or she also serves as an independent director No. of TWSE/TPEx listed companies in which he or she also serves as a non-executive/ independent directors 1 2 3 4 5 6 7 8 9 10 0 1 0 1 3 4 0 0 0 0 2 2 0 1 0 1 0 1 denotes executive director, the others are non-exe *Note : Jamie Lin served as independent director in 2018, and reigned on Feb. 11, 2019. Jamie Lin becomes executive director since he took over James Jeng on April 1, 2019. Election of Directors The election of directors is based on the candidate nomination system which is regulated in Article 192-1 of Company Act and the Company's Articles of Incorporation. The shareholders shall elect the directors from among the nominees listed on the roster of director candidates. Taiwan Mobile's independent director must meet all 10 criteria below: Our target share of independent directors on the board is at least 40%, which is much higher than the Securities Exchange Act's requirement of no less than three1 in number and no less than one-fifth of the total number of directors. Note 1:The audit committee, composed entirely of independent directors, shall not have seats fewer than three. The company had 9 board members in 2018 of which 4 are independent directors. Although there are only 8 board members currently since Jamie Lin, independent director, resigned on Feb. 11, 2019. The company plans to by-election an independent director at 2019 annual shareholders' meeting to achieve 40% of target share of independent directors on the board. Over five years of experience in business, finance, legal and/or other areas related to the Company's business Independence criteria (Notes) No. of public companies in which he or she also serves as an independent director No. of TWSE/TPEx listed companies in which he or she also serves as a non-executive/ independent directors 1 2 3 4 5 6 7 8 9 10 0 1 0 1 3 4 0 0 0 0 2 2 0 1 0 1 0 1 The election of directors is based on the candidate nomination system which is regulated in Article 192-1 of Company Act and the Company's Articles of Incorporation. The shareholders shall elect the directors from among the nominees listed on the roster of director candidates.",
    "Board of Directors The Board of Directors consists of nine members, all of whom have a great breadth of experience. Four of the nine directors are independent directors, which more than fulfills current regulation requirements for public companies. To strengthen management efficiency and effectiveness, the board established the \"Audit Committee\" and \"Remuneration and Nomination Committee\", composed entirely of independent directors. The four independent directors possess professional qualifications in the areas of legal, finance, telecom, information Technology, and the necessary knowledge and skill for performing the duties. The Chairman has ample experience with the company's operations and the business acumen to lead the company and make decisions for the best interests of the shareholders. \"The Rules for Election of the Directors\" was enacted to regulate the election of the directors through adopting the candidate nomination system. \"The Rules and Procedures on Evaluating Board of Directors' Performance\" was enacted to conduct evaluations of the board's performance. The Remuneration and Nomination Committee would evaluate the board's performance and submit a report with proposed improvements to the board. We believe the operations of an effective board are fundamental to the company's sustainability. The main responsibility of the board is to supervise the company's compliance with relevant laws and regulations, the timely disclosure of material information and ensure integrity in all of the company's operations. In addition, it is essential for the board to maintain a good communication channel and positive interaction with the management team, provide a guideline for the company's operations and make resolutions on material strategies to ensure the company's development and shareholders' interests. Related Links: Rules for Election of the Directors Competency of the Directors Please Swipe Left or Right View All. Board members Daniel M. Tsai Richard M. Tsai Jack J.T. Huang Hsueh Jen Sung Char-Dir Chung Hsi-Peng Lu Howard Lin Chris Tsai Jamie Lin Working Experience in Communication Industry(Years) The tenure of directors/independent directors(Years) Finance Law Business Technology Investment and M&A FinTech InformationTechnology Risk Management CEO/Senior management Consumer Discretionary (E-commerce/ Marketing) 20 20 20 20 16 16 5 5 30 2 2 0 6 6 0 0 4 1 Note 1 Jamie Lin is of Hakka descent. The Hakka are a sub-ethnic group in Asia. Note 2 Jamie Lin, TWM's independent director, was elected on June 12, 2018 and resigned on February 11, 2019. (The company plans to by-elect an independent director at the 2019 annual shareholders' meeting.) He took over James Cheng serves as executive director on April. 1, 2019. Note 3 Fu Chi Investment Co., Ltd. appointed Chris Tsai as its representative took over San-Cheng Chang on May 1, 2019. Daniel M. Tsai Chairman, Representative of Fu Chi Investment Co., Ltd. LL.M., Georgetown University Director, Fubon Financial Holding Co., Ltd. Chairman, Taiwan Fixed Network Co., Ltd. Richard M. Tsai Director, Representative of Fu Chi Investment Co., Ltd. MBA, Stern School of New York University Chairman, Fubon Financial Holding Co., Ltd. Jack J.T. Huang Independent Director S.J.D., Harvard University Partner, JONES DAY, Jones Day Taipei Hsueh Jen Sung Independent Director Master of Commerce, National Chengchi University MBA, Harvard Business School Chairman, Vaucluse Capital Management Limited Char-Dir Chung Independent Director Ph.D. in E.E, University of Southern California Distinguished Professor, Department of Electrical Engineering and Graduate Institute of Communication Engineering, National Taiwan University Hsi-Peng Lu Independent Director Ph.D in Industrial Engineering, University of Wisconsin-Madison Distinguished Professor of the School of Management, National Taiwan University of Science and Technology Howard Lin Director, Representative of TCC Investment Co., Ltd. Ph.D., Department of Chemical Engineering, National Taiwan University CIO of Fubon Financial Holding Co., Ltd. Chris Tsai Director, Representative of Fu Chi Investment Co., Ltd. The Wharton School of the University of Pennsylvania BS in Economics President of Fubon Sports & Entertainment Co., Ltd. Jamie Lin Director, Representative of TCC Investment Co., Ltd. MBA,NYU Stern School of Business President, Taiwan Mobile Co., Ltd. The Board of Directors consists of nine members, all of whom have a great breadth of experience. Four of the nine directors are independent directors, which more than fulfills current regulation requirements for public companies. To strengthen management efficiency and effectiveness, the board established the \"Audit Committee\" and \"Remuneration and Nomination Committee\", composed entirely of independent directors. The four independent directors possess professional qualifications in the areas of legal, finance, telecom, information Technology, and the necessary knowledge and skill for performing the duties. The Chairman has ample experience with the company's operations and the business acumen to lead the company and make decisions for the best interests of the shareholders. \"The Rules for Election of the Directors\" was enacted to regulate the election of the directors through adopting the candidate nomination system. \"The Rules and Procedures on Evaluating Board of Directors' Performance\" was enacted to conduct evaluations of the board's performance. The Remuneration and Nomination Committee would evaluate the board's performance and submit a report with proposed improvements to the board. We believe the operations of an effective board are fundamental to the company's sustainability. The main responsibility of the board is to supervise the company's compliance with relevant laws and regulations, the timely disclosure of material information and ensure integrity in all of the company's operations. In addition, it is essential for the board to maintain a good communication channel and positive interaction with the management team, provide a guideline for the company's operations and make resolutions on material strategies to ensure the company's development and shareholders' interests. Related Links: Rules for Election of the Directors Working Experience in Communication Industry(Years) The tenure of directors/independent directors(Years) Finance Law Business Technology Investment and M&A FinTech InformationTechnology Risk Management CEO/Senior management Consumer Discretionary (E-commerce/ Marketing) 20 20 20 20 16 16 5 5 30 2 2 0 6 6 0 0 4 1 Daniel M. Tsai Chairman, Representative of Fu Chi Investment Co., Ltd. LL.M., Georgetown University Director, Fubon Financial Holding Co., Ltd. Chairman, Taiwan Fixed Network Co., Ltd. Richard M. Tsai Director, Representative of Fu Chi Investment Co., Ltd. MBA, Stern School of New York University Chairman, Fubon Financial Holding Co., Ltd. Jack J.T. Huang Independent Director S.J.D., Harvard University Partner, JONES DAY, Jones Day Taipei Hsueh Jen Sung Independent Director Master of Commerce, National Chengchi University MBA, Harvard Business School Chairman, Vaucluse Capital Management Limited Char-Dir Chung Independent Director Ph.D. in E.E, University of Southern California Distinguished Professor, Department of Electrical Engineering and Graduate Institute of Communication Engineering, National Taiwan University Hsi-Peng Lu Independent Director Ph.D in Industrial Engineering, University of Wisconsin-Madison Distinguished Professor of the School of Management, National Taiwan University of Science and Technology Howard Lin Director, Representative of TCC Investment Co., Ltd. Ph.D., Department of Chemical Engineering, National Taiwan University CIO of Fubon Financial Holding Co., Ltd. Chris Tsai Director, Representative of Fu Chi Investment Co., Ltd. The Wharton School of the University of Pennsylvania BS in Economics President of Fubon Sports & Entertainment Co., Ltd. Jamie Lin Director, Representative of TCC Investment Co., Ltd. MBA,NYU Stern School of Business President, Taiwan Mobile Co., Ltd. Daniel M. Tsai Chairman, Representative of Fu Chi Investment Co., Ltd. LL.M., Georgetown University Director, Fubon Financial Holding Co., Ltd. Chairman, Taiwan Fixed Network Co., Ltd. Director, Fubon Financial Holding Co., Ltd. Chairman, Taiwan Fixed Network Co., Ltd. Richard M. Tsai Director, Representative of Fu Chi Investment Co., Ltd. MBA, Stern School of New York University Chairman, Fubon Financial Holding Co., Ltd. MBA, Stern School of New York University Chairman, Fubon Financial Holding Co., Ltd. Jack J.T. Huang Independent Director S.J.D., Harvard University Partner, JONES DAY, Jones Day Taipei Partner, JONES DAY, Jones Day Taipei Hsueh Jen Sung Independent Director Master of Commerce, National Chengchi University MBA, Harvard Business School Chairman, Vaucluse Capital Management Limited Master of Commerce, National Chengchi University MBA, Harvard Business School Chairman, Vaucluse Capital Management Limited Char-Dir Chung Independent Director Ph.D. in E.E, University of Southern California Distinguished Professor, Department of Electrical Engineering and Graduate Institute of Communication Engineering, National Taiwan University Ph.D. in E.E, University of Southern California Distinguished Professor, Department of Electrical Engineering and Graduate Institute of Communication Engineering, National Taiwan University Hsi-Peng Lu Independent Director Ph.D in Industrial Engineering, University of Wisconsin-Madison Distinguished Professor of the School of Management, National Taiwan University of Science and Technology Ph.D in Industrial Engineering, University of Wisconsin-Madison Distinguished Professor of the School of Management, National Taiwan University of Science and Technology Howard Lin Director, Representative of TCC Investment Co., Ltd. Ph.D., Department of Chemical Engineering, National Taiwan University CIO of Fubon Financial Holding Co., Ltd. Ph.D., Department of Chemical Engineering, National Taiwan University CIO of Fubon Financial Holding Co., Ltd. Chris Tsai Director, Representative of Fu Chi Investment Co., Ltd. The Wharton School of the University of Pennsylvania BS in Economics President of Fubon Sports & Entertainment Co., Ltd. The Wharton School of the University of Pennsylvania BS in Economics President of Fubon Sports & Entertainment Co., Ltd. Jamie Lin Director, Representative of TCC Investment Co., Ltd. MBA,NYU Stern School of Business President, Taiwan Mobile Co., Ltd. MBA,NYU Stern School of Business President, Taiwan Mobile Co., Ltd.",
    "Execution Principles Timely disclosure of material information Checks and balances between the board and management Setting the target share of independent directors on the board at a minimum of 40% Audit Committee was established to ensure fair and independent financial oversight Remuneration and Nomination Committee was established to strengthen corporate governance practices, promote a sound compensation system for directors and managers, and to select candidates for directorships Adoption of a high cash dividend payout policy Shareholders' rights are guaranteed with the right to vote on all proposals at the annual general shareholders' meeting or through an electronic voting system Strict compliance with the Code of Ethics and Ethical Corporate Management Best Practice Principles and establishment of an internal audit mechanism The Company's corporate governance structure is composed of two committees: an Audit Committee and a Remuneration and Nomination Committee. Audit Committee The Audit Committee was set up in June 2008 to replace board supervisors, pursuant to provisions in the Securities and Exchange Act. The committee's operation is bound by the \"Audit Committee Charter†and its main responsibility is to assist the board in overseeing the following: Integrity of the Company's financial statements Independent auditors' appointment (termination) and integrity/performance Internal risk controls Company's compliance with legal and regulatory requirements Company's existing and potential risks Remuneration and Nomination Committee The Remuneration and Nomination Committee, composed entirely of independent board directors, is bound by the \"Remuneration and Nomination Committee Charter.†The committee is responsible for evaluation of the following matters: Establish a policy, system, standard and structure for directors and managers' compensation and review them periodically. Decide compensation for directors and managers and carry out periodic evaluations Finding, reviewing, and nominating candidates for directors Metric for President (CEO) compensation President's performance and remuneration is reviewed by the Remuneration and Nomination Committee, and approved by the board meeting. Performance-based compensation of President's annual salary is determined by a comprehensive evaluation of measurable metrics. The metrics include financial performances such as EPSã€EBITDAã€ROAã€ROEã€total shareholder return, and the non-measurable external perception metrics such as customer satisfaction, DJSI evaluation results and a set of CSR indicators. The time vesting period for variable President compensation is one year. Taiwan Mobile implements appropriate disclosures to ensure shareholders have up-to-date information as a basis for their investment decisions. Taiwan Mobile provides key operation & financial information, BOD resolutions and CEO messages in a fairly distributed and timely manner. Articles of Incorporation Rules of Procedure for Board of Directors Meetings The Rules and Procedures of Shareholders Meeting Rules and Procedures of Lending and Making Endorsements Rules and Procedures for Acquisition or Disposal of Assets Procedures for Handling Material Inside Information Rules for Election of the Directors Code of Ethics Ethical Corporate Management Best Practice Principles Operation Rules of Ethical Corporate Management Best Practice Principles Corporate Governance Best Practice Principles Corporate Social Responsibility Best Practice Principles Rules and Procedures on Evaluating Board of Directors' Performance Tax Policy Timely disclosure of material information Checks and balances between the board and management Setting the target share of independent directors on the board at a minimum of 40% Audit Committee was established to ensure fair and independent financial oversight Remuneration and Nomination Committee was established to strengthen corporate governance practices, promote a sound compensation system for directors and managers, and to select candidates for directorships Adoption of a high cash dividend payout policy Shareholders' rights are guaranteed with the right to vote on all proposals at the annual general shareholders' meeting or through an electronic voting system Strict compliance with the Code of Ethics and Ethical Corporate Management Best Practice Principles and establishment of an internal audit mechanism The Company's corporate governance structure is composed of two committees: an Audit Committee and a Remuneration and Nomination Committee. Audit Committee The Audit Committee was set up in June 2008 to replace board supervisors, pursuant to provisions in the Securities and Exchange Act. The committee's operation is bound by the \"Audit Committee Charter†and its main responsibility is to assist the board in overseeing the following: Integrity of the Company's financial statements Independent auditors' appointment (termination) and integrity/performance Internal risk controls Company's compliance with legal and regulatory requirements Company's existing and potential risks Integrity of the Company's financial statements Independent auditors' appointment (termination) and integrity/performance Company's compliance with legal and regulatory requirements Company's existing and potential risks Remuneration and Nomination Committee The Remuneration and Nomination Committee, composed entirely of independent board directors, is bound by the \"Remuneration and Nomination Committee Charter.†The committee is responsible for evaluation of the following matters: Establish a policy, system, standard and structure for directors and managers' compensation and review them periodically. Decide compensation for directors and managers and carry out periodic evaluations Finding, reviewing, and nominating candidates for directors Establish a policy, system, standard and structure for directors and managers' compensation and review them periodically. Decide compensation for directors and managers and carry out periodic evaluations Finding, reviewing, and nominating candidates for directors Metric for President (CEO) compensation President's performance and remuneration is reviewed by the Remuneration and Nomination Committee, and approved by the board meeting. Performance-based compensation of President's annual salary is determined by a comprehensive evaluation of measurable metrics. The metrics include financial performances such as EPSã€EBITDAã€ROAã€ROEã€total shareholder return, and the non-measurable external perception metrics such as customer satisfaction, DJSI evaluation results and a set of CSR indicators. The time vesting period for variable President compensation is one year. Taiwan Mobile implements appropriate disclosures to ensure shareholders have up-to-date information as a basis for their investment decisions. Taiwan Mobile provides key operation & financial information, BOD resolutions and CEO messages in a fairly distributed and timely manner. Rules of Procedure for Board of Directors Meetings The Rules and Procedures of Shareholders Meeting Rules and Procedures of Lending and Making Endorsements Rules and Procedures for Acquisition or Disposal of Assets Procedures for Handling Material Inside Information Rules for Election of the Directors Ethical Corporate Management Best Practice Principles Operation Rules of Ethical Corporate Management Best Practice Principles Corporate Governance Best Practice Principles Corporate Social Responsibility Best Practice Principles Rules and Procedures on Evaluating Board of Directors' Performance",
    "Postpaid Service Prepaid Service International Call International Roaming more \"TWM Broadband\" brand, a leading telecommunications, media and entertainment brand, was launched in late 2007, targeting home customers. TWM Broadband hopes to excel in providing home customers with the best experience, product offerings and services, and become the top choice for triple play for every family. more Leveraging Taiwan Mobile and Taiwan Fixed Network/TTN's years of experience, market leadership and resources, TWM Solution offers enterprise customers integrated information and communication technologies (ICT) solutions. In order to enhance reliability and ensure customer satisfaction more top news May 20,2025 Corporate - Taiwan Mobile Named a \"Most Honored Company†in Extel's (formerly Institutional Investor) 2025 Asia Executive Team Rankings, Sweeping All Seven No.1 Awards in the Telecom Sector Internationally renowned financial media outlet Extel (formerly Institutional Investor) has announced its 2025 Asia Executive Team rankings. Taiwan Mobile was once again named a \"Most Honored Company†for the third and fourth consecutive years in the Overall Asia (ex-Japan) and Rest of Asia (ex-Japan and China) rankings respectively. We also achieved the highest score among the five Taiwanese comp Dec 11,2024 Taiwan Mobile Achieves 21% EBITDA Growth Post-Merger, Clinches Double Awards at 2024 MAPECT Taiwan M&A Awards; Chairman Tsai Emphasizes Value Creation to Reshape Telecom Industry Landscape Nov 19,2024 Taiwan Mobile President Jamie Lin Honored with IDC's \"CEO of the Year\" Award top news Mar 13,2025 Business - Taiwan Mobile and BMW Group Launch Taiwan's First 5G \"One Number for Car†Service Taiwan Mobile today (March 13) announced a collaboration with the BMW Group to introduce Taiwan's first 5G \"One Number for Car†service, becoming the first telecom operator in Taiwan to extend mobile number connectivity into smart vehicles. Powered by personal eSIM technology, the service enables users to make calls and use mobile data in supported BMW models using their existing mobile number—eve Mar 06,2025 Taiwan Mobile Becomes Perplexity's Exclusive Telecom Partner in Taiwan, Ushering in a New Era of AI-Powered Search Sep 13,2024 Taiwan Mobile invests in Systex Corporation to Accelerate Telco+Tech International Expansion and Expand ICT Services Landscape in Greater Southeast Asia top news May 29,2025 ESG - Asia's First \"AI with Purpose Global Summit\" Gathers Nearly a Thousand Experts Taiwan's Perspective Leads a New AI Paradigm, Focusing on Regional Integration and AI Global Governance The \"2025 AI with Purpose Global Summit Taipei 2025,\" jointly organized by Taiwan Mobile, the Global Enabling Sustainability Initiative (GeSI), and the Taiwan Electrical and Electronic Manufacturers' Association (TEEMA), successfully concluded today (June 29th). The two-day summit attracted nearly a thousand industry experts, participating both in person and online. Centered on three main themes May 29,2025 Taiwan Mobile's \"AI Ocean \" Wins International Biodiversity Sustainability Award Recognized Among 24 Global Projects, Demonstrating Sustainable Tech Leadership for Second Consecutive Year May 28,2025 \"AI with Purpose Global Summit Taipei 2025†Debuts in Taiwan top news Jun 04,2025 Financial - Taiwan Mobile Honored with Three Major Accolades at the 2025 Twimbit Telecom Awards The rise of AI technologies is driving enterprise transformation and redefining the telecommunications landscape. At the 2025 Twimbit Telecom Awards, hosted by leading research and advisory firm Twimbit, Taiwan Mobile stood out among top telecom operators across the Asia-Pacific region, receiving three prestigious honors: CEO of the Year, Telco of the Year (Advanced Markets), and Telco to Ace Gami Feb 06,2025 Taiwan Mobile Achieves Fifth Consecutive CDP 'A' Rating Jul 05,2024 Taiwan Mobile shines again in Institutional Investor's 2024 Asia Executive Team Survey Overall Asia (ex-Japan) - #1 for Best CEO, Best CFO, Best ESG in telecom sector and a Most Honored Company for 2 years in a row Postpaid Service Prepaid Service International Call International Roaming more \"TWM Broadband\" brand, a leading telecommunications, media and entertainment brand, was launched in late 2007, targeting home customers. TWM Broadband hopes to excel in providing home customers with the best experience, product offerings and services, and become the top choice for triple play for every family. more Leveraging Taiwan Mobile and Taiwan Fixed Network/TTN's years of experience, market leadership and resources, TWM Solution offers enterprise customers integrated information and communication technologies (ICT) solutions. In order to enhance reliability and ensure customer satisfaction more \"TWM Broadband\" brand, a leading telecommunications, media and entertainment brand, was launched in late 2007, targeting home customers. TWM Broadband hopes to excel in providing home customers with the best experience, product offerings and services, and become the top choice for triple play for every family. Leveraging Taiwan Mobile and Taiwan Fixed Network/TTN's years of experience, market leadership and resources, TWM Solution offers enterprise customers integrated information and communication technologies (ICT) solutions. In order to enhance reliability and ensure customer satisfaction top news May 20,2025 Corporate - Taiwan Mobile Named a \"Most Honored Company†in Extel's (formerly Institutional Investor) 2025 Asia Executive Team Rankings, Sweeping All Seven No.1 Awards in the Telecom Sector Internationally renowned financial media outlet Extel (formerly Institutional Investor) has announced its 2025 Asia Executive Team rankings. Taiwan Mobile was once again named a \"Most Honored Company†for the third and fourth consecutive years in the Overall Asia (ex-Japan) and Rest of Asia (ex-Japan and China) rankings respectively. We also achieved the highest score among the five Taiwanese comp Dec 11,2024 Taiwan Mobile Achieves 21% EBITDA Growth Post-Merger, Clinches Double Awards at 2024 MAPECT Taiwan M&A Awards; Chairman Tsai Emphasizes Value Creation to Reshape Telecom Industry Landscape Nov 19,2024 Taiwan Mobile President Jamie Lin Honored with IDC's \"CEO of the Year\" Award top news Mar 13,2025 Business - Taiwan Mobile and BMW Group Launch Taiwan's First 5G \"One Number for Car†Service Taiwan Mobile today (March 13) announced a collaboration with the BMW Group to introduce Taiwan's first 5G \"One Number for Car†service, becoming the first telecom operator in Taiwan to extend mobile number connectivity into smart vehicles. Powered by personal eSIM technology, the service enables users to make calls and use mobile data in supported BMW models using their existing mobile number—eve Mar 06,2025 Taiwan Mobile Becomes Perplexity's Exclusive Telecom Partner in Taiwan, Ushering in a New Era of AI-Powered Search Sep 13,2024 Taiwan Mobile invests in Systex Corporation to Accelerate Telco+Tech International Expansion and Expand ICT Services Landscape in Greater Southeast Asia top news May 29,2025 ESG - Asia's First \"AI with Purpose Global Summit\" Gathers Nearly a Thousand Experts Taiwan's Perspective Leads a New AI Paradigm, Focusing on Regional Integration and AI Global Governance The \"2025 AI with Purpose Global Summit Taipei 2025,\" jointly organized by Taiwan Mobile, the Global Enabling Sustainability Initiative (GeSI), and the Taiwan Electrical and Electronic Manufacturers' Association (TEEMA), successfully concluded today (June 29th). The two-day summit attracted nearly a thousand industry experts, participating both in person and online. Centered on three main themes May 29,2025 Taiwan Mobile's \"AI Ocean \" Wins International Biodiversity Sustainability Award Recognized Among 24 Global Projects, Demonstrating Sustainable Tech Leadership for Second Consecutive Year May 28,2025 \"AI with Purpose Global Summit Taipei 2025†Debuts in Taiwan top news Jun 04,2025 Financial - Taiwan Mobile Honored with Three Major Accolades at the 2025 Twimbit Telecom Awards The rise of AI technologies is driving enterprise transformation and redefining the telecommunications landscape. At the 2025 Twimbit Telecom Awards, hosted by leading research and advisory firm Twimbit, Taiwan Mobile stood out among top telecom operators across the Asia-Pacific region, receiving three prestigious honors: CEO of the Year, Telco of the Year (Advanced Markets), and Telco to Ace Gami Feb 06,2025 Taiwan Mobile Achieves Fifth Consecutive CDP 'A' Rating Jul 05,2024 Taiwan Mobile shines again in Institutional Investor's 2024 Asia Executive Team Survey Overall Asia (ex-Japan) - #1 for Best CEO, Best CFO, Best ESG in telecom sector and a Most Honored Company for 2 years in a row Dec 11,2024 Taiwan Mobile Achieves 21% EBITDA Growth Post-Merger, Clinches Double Awards at 2024 MAPECT Taiwan M&A Awards; Chairman Tsai Emphasizes Value Creation to Reshape Telecom Industry Landscape Nov 19,2024 Taiwan Mobile President Jamie Lin Honored with IDC's \"CEO of the Year\" Award Mar 06,2025 Taiwan Mobile Becomes Perplexity's Exclusive Telecom Partner in Taiwan, Ushering in a New Era of AI-Powered Search Sep 13,2024 Taiwan Mobile invests in Systex Corporation to Accelerate Telco+Tech International Expansion and Expand ICT Services Landscape in Greater Southeast Asia May 29,2025 Taiwan Mobile's \"AI Ocean \" Wins International Biodiversity Sustainability Award Recognized Among 24 Global Projects, Demonstrating Sustainable Tech Leadership for Second Consecutive Year May 28,2025 \"AI with Purpose Global Summit Taipei 2025†Debuts in Taiwan Feb 06,2025 Taiwan Mobile Achieves Fifth Consecutive CDP 'A' Rating Jul 05,2024 Taiwan Mobile shines again in Institutional Investor's 2024 Asia Executive Team Survey Overall Asia (ex-Japan) - #1 for Best CEO, Best CFO, Best ESG in telecom sector and a Most Honored Company for 2 years in a row Investor Relations What's New Webcast Announcement The 2Q25 results webcast was held at 03:00 p.m. on Friday, August 8, 2025. We went through the 2Q financial highlights and company strategy. Results Conference Call Material Information Monthly Results Quarterly Financials Annual Reports Shareholder Information Investor Relations What's New Webcast Announcement The 2Q25 results webcast was held at 03:00 p.m. on Friday, August 8, 2025. We went through the 2Q financial highlights and company strategy. Results Conference Call Material Information Monthly Results Quarterly Financials Annual Reports Shareholder Information ESG Taiwan Mobile have invested six categories of capital in our \"T.I.M.E.\" (Telecom, Internet, Media & Entertainment, and E-commerce) diversification strategy blueprint and established our new Super 5G strategy and 6C operating core corresponding to the 17 UN SDGs to achieve the ESG goals. more 2024 Solar for Good more 2023 ESG Report English version 中文版 Taiwan Mobile have invested six categories of capital in our \"T.I.M.E.\" (Telecom, Internet, Media & Entertainment, and E-commerce) diversification strategy blueprint and established our new Super 5G strategy and 6C operating core corresponding to the 17 UN SDGs to achieve the ESG goals. 12F, No. 88, Yanchang Road, Xinyi Dist., Taipei City 110, Taiwan, R.O.C. 24 Hour Service Hotline : mobile dial 188 (toll-free) directly or +886-2-66062999 12F, No. 88, Yanchang Road, Xinyi Dist., Taipei City 110, Taiwan, R.O.C. 24 Hour Service Hotline : mobile dial 188 (toll-free) directly or +886-2-66062999"
  ]
}