{
  "company": "english.siat.cas.cn",
  "dominant_topics": [
    0,
    -1,
    1
  ],
  "topic_counts": {
    "0": 17,
    "-1": 8,
    "1": 6
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use",
    "1": "module, students, year, level, grade"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 17,
      "1": 6
    }
  },
  "sample_docs": [
    "Home > Affiliated Institutes > Institute of Advanced Integration Technology > Research Center > Laboratory for Intelligent Design and Machine Vision > Introduction Research Laboratory for Intelligent Design and Machine Vision (IDMV) was founded in Feb. 2008. The lab concentrates some edge problems in computer vision and computer graphics domains, especially the 3D vision and 3D modeling techniques and their applications in industries. Professor Charlie C. L. Wang has been appointed as the director and professor SONG Zhan has been appointed as the executive director of the lab since 2012. IDMV has 7 full-time staff members, including one researcher, four engineers, two post-doctor and nine Ph.D. and M.Phil. Students. IDMV has gained several remarkable research achievements since its foundation. Some related research articles have been published in area top journals, such as the IEEE Trans. on PAMI, IEEE Trans. on IE, IEEE Trans. on IP, and CAD, etc. More than 40 patents of invention have been issued or applied in the past four years. The laboratory has received several grants from the NSFC, NSFC-Guangdong, and the CAD Knowledge and Creativities Project etc. IDMV has also founded close corporations with some leading companies in China, such as Huawei and Skyworth, etc. Some of our research works were also reported by the media and news such as CCTV.",
    "Home > Affiliated Institutes > Institute of Advanced Integration Technology > Research Center > Laboratory for Intelligent Design and Machine Vision Research Laboratory for Intelligent Design and Machine Vision (IDMV) was founded in Feb. 2008. The lab concentrates some edge problems in computer vision and computer graphics domains, especially the 3D vision and 3D modeling techniques and their applications in industries. Professor Charlie C. L. Wang has been appointed as the director and professor SONG Zhan has been appointed as the executive director of the lab since 2012. IDMV has 7 full-time staff members, including one researcher, four engineers, two post-doctor and nine Ph.D. and M.Phil. Students. IDMV has gained several remarkable research achievements since its foundation. Some related research articles have been published in area top journals, such as the IEEE Trans. on PAMI, IEEE Trans. on IE, IEEE Trans. on IP, and CAD, etc. More than 40 patents of invention have been issued or applied in the past four years. The laboratory has received several grants from the NSFC, NSFC-Guangdong, and the CAD Knowledge and Creativities Project etc. IDMV has also founded close corporations with some leading companies in China, such as Huawei and Skyworth, etc. Some of our research works were also reported by the media and news such as CCTV. Research Laboratory for Intelligent Design and Machine Vision (IDMV) was founded in Feb. 2008. The lab concentrates some edge problems in computer vision and computer graphics domains, especially the 3D vision and 3D modeling techniques and their applications in industries. Professor Charlie C. L. Wang has been appointed as the director and professor SONG Zhan has been appointed as the executive director of the lab since 2012. IDMV has 7 full-time staff members, including one researcher, four engineers, two post-doctor and nine Ph.D. and M.Phil. Students. IDMV has gained several remarkable research achievements since its foundation. Some related research articles have been published in area top journals, such as the IEEE Trans. on PAMI, IEEE Trans. on IE, IEEE Trans. on IP, and CAD, etc. More than 40 patents of invention have been issued or applied in the past four years. The laboratory has received several grants from the NSFC, NSFC-Guangdong, and the CAD Knowledge and Creativities Project etc. IDMV has also founded close corporations with some leading companies in China, such as Huawei and Skyworth, etc. Some of our research works were also reported by the media and news such as CCTV. Charlie C. L.WANG Title: Director Email: cwang@mae.cuhk.edu.hk Areas of Interest: Geometric Computing, Computer-Aided Design, Advanced Manufacturing Title: Director Email: cwang@mae.cuhk.edu.hk Areas of Interest: Geometric Computing, Computer-Aided Design, Advanced Manufacturing SONG Zhan Title: Executive Director Email: zhan.song@siat.ac.cn Areas of Interest: Computer Vision, 3D Reconstruction, Pattern Recognition, Computer Graphics Title: Executive Director Email: zhan.song@siat.ac.cn Areas of Interest: Computer Vision, 3D Reconstruction, Pattern Recognition, Computer Graphics",
    "Home > Affiliated Institutes > Institute of Advanced Integration Technology > Research Center > Laboratory for Intelligent Design and Machine Vision > Researchers Charlie C. L.WANG Title: Director Email: cwang@mae.cuhk.edu.hk Areas of Interest: Geometric Computing, Computer-Aided Design, Adv... Title: Director Email: cwang@mae.cuhk.edu.hk Areas of Interest: Geometric Computing, Computer-Aided Design, Adv... SONG Zhan Title: Executive Director Email: zhan.song@siat.ac.cn Areas of Interest: Computer Vision, 3D Reconstruction, Pattern Rec... Title: Executive Director Email: zhan.song@siat.ac.cn Areas of Interest: Computer Vision, 3D Reconstruction, Pattern Rec...",
    "Home > Research > Institute of Advanced Integration Technology > Research Center > Laboratory for Human Machine Control Established in 2006, the laboratory is majorly involved with key technologies of human-machine-interface including image processing and computer vision, multimodal human-computer interaction, robotics and application of machine vision in virtual reality alike. Lab director, Dr. Jun Cheng, presided over 30 research projects including national science foundation projects, published over 120 high quality papers in international journals and conference proceedings; besides, he owns 2 US patent, 17 national patents, 14 new utility patents and 40 undergoing national patent applications. Great efforts have been made in application oriented research works and close connection with companies has been established. Three research laboratories are cofounded to commercialize the technologies, namely, virtual sports united lab, internet robotics united lab and service robotics united lab. Two companies, Shenzhen Taishan network Co. ltd and Shenzhen Zhongkeruicheng Co. ltd., both in which SIAT holds technology shares, are established and products are commercialized. Established in 2006, the laboratory is majorly involved with key technologies of human-machine-interface including image processing and computer vision, multimodal human-computer interaction, robotics and application of machine vision in virtual reality alike. Lab director, Dr. Jun Cheng, presided over 30 research projects including national science foundation projects, published over 120 high quality papers in international journals and conference proceedings; besides, he owns 2 US patent, 17 national patents, 14 new utility patents and 40 undergoing national patent applications. Great efforts have been made in application oriented research works and close connection with companies has been established. Three research laboratories are cofounded to commercialize the technologies, namely, virtual sports united lab, internet robotics united lab and service robotics united lab. Two companies, Shenzhen Taishan network Co. ltd and Shenzhen Zhongkeruicheng Co. ltd., both in which SIAT holds technology shares, are established and products are commercialized. CHENG Jun Title: Professor Email: jun.cheng@siat.ac.cn Areas of Interest: Human Computer,Human Computer Interface,Robotics Title: Professor Email: jun.cheng@siat.ac.cn Areas of Interest: Human Computer,Human Computer Interface,Robotics HU Xiping Title: researcher Email: xp.hu@siat.ac.cn Areas of Interest: Crowd Computing Title: researcher Email: xp.hu@siat.ac.cn Areas of Interest: Crowd Computing WANG Lei Title: researcher Email: lei.wang1@siat.ac.cn Areas of Interest: image processing Title: researcher Email: lei.wang1@siat.ac.cn Areas of Interest: image processing",
    "Home > Research > Institute of Advanced Integration Technology > Research Center > Laboratory for Human Machine Control > Researchers Laboratory for Human Machine Control Date:24-07-2017 | ã€ Print 】 ã€ close 】 Director of Laboratory for Human Machine Control Shenzhen Institutes of Advanced Technology, CAS PhD, The Chinese University of Hong Kong, Hong Kong, China M.Eng, University of Science and Technology of China, Heifei, China B.Eng, University of Science and Technology of China,Heifei, China Professor, Director of Lab for Human Machine Control, Shenzhen Institutes of Advanced Technology, CAS, Shenzhen,China. Associate Professor, Director of Lab for Semiconductor Equipment, Shenzhen Institutes of Advanced Technology, CAS, Shenzhen, China. Associate Professor, Shenzhen Institutes of Advanced Technology, Shenzhen, China. Computer Vision, Human Computer Interface and Robotics 1. Dapeng Tao, Jun Cheng, Xinbo Gao, Xuelong Li, Cheng Deng, Robust Sparse Coding for Mobile Image Labeling on the Cloud,IEEE Transactions on Circuits and Systems for Video Technology,27(1):62-72,2017 2. Yanan Guo, Lei Li, Weifeng Liu, Jun Cheng, Dapeng Tao, Multiview Cauchy Estimator Feature Embedding for Depth and Inertial Sensor-Based Human Action Recognition, IEEE Transactions on System, Man and Cybernetics: Systems, 47(4): 617-627, 2017 3. Xiaopeng Ji, Jun Cheng*, Dapeng Tao, Xinyu Wu, Wei Feng, The Spatial Laplacian and Temporal Energy Pyramid Representation for Human Action Recognition Using Depth Sequences, Knowledge-Based Systems, 122:64-74, 2017 4. Dapeng Tao, Jun Cheng, Mingli Song, Xu Lin, Manifold Ranking-Based Matrix Factorization for Saliency Detection, IEEE Transactions on Neural Networks and Learning Systems, 27(6): 1122-1134, 2016 5. Yanan Guo, Dapeng Tao, Jun Cheng, Alan Dougherty, Yaotang Li, Kun Yue, Bob Zhang, Tensor Manifold Discriminant Projections for Acceleration-Based Human Activity Recognition, IEEE Transactions on Multimedia, 18(10): 1977-1987, 2016 6. Xipeng Yang, Jun Cheng, Wei Feng, Hong Liang, Zhengyao Bai, Dapeng Tao, Cauchy estimator discriminant analysis for face recognition, Neurocomputing, 199: 144-153, 2016 7. Yi Ding, Jiangtao Xi, Yanguang Yu, Fuqin Deng, Jun Cheng*, Recovering the absolute phase maps of three selected spatial-frequency fringes with multi-color channels, Neurocomputing, 2016 8. Jun Cheng, Qun Wang, Rui Song, Xinyu Wu, Fingertip-based interactive projector–camera system, Signal Processing, 110: 54-66, 2015 9. Dapeng Tao, Jun Cheng, Xu Lin, Jiang Yu, Local structure preserving discriminative projections for RGB-D sensor-based scene classification, Information Sciences, 320: 383-394, 2015 10. Jun Cheng, Wei Bian, Dacheng Tao, Locally Regularized Sliced Inverse Regression based 3D Hand Gesture Recognition on a Dance Robot, Information Sciences 221: 274-283, 2013 11. Jun Cheng, Shiguang Zheng, Xinyu Wu, Structured Light-based Shape Measurement System, Signal Processing, 93(6): 1435–1444, 2013 12. Jun Jiang, Jun Cheng, Dacheng Tao, Colour Biological Features Based Solder Paste Defects Detection and Classification on Printed Circuit Boards, IEEE Trans. on Components, Packaging and Manufacturing Technology, 2(9): 1536–1544, 2012 13. Jun Cheng, Can Xie, Wei Bian, Dacheng Tao, Feature Fusion for 3D Hand Gesture Recognition by Learning a Shared Hidden Space, Pattern Recognition Letters, 33(4): 476-484, 2012 14. Jun Cheng, Maoying Qiao, Wei Bian and Dacheng Tao, 3D Human Posture Segmentation by Constrained Spectral Clustering, Signal Processing, 91(9): 2204-2212 , 2011 15. Jun Jiang, Jun Cheng, Ying Zhou, and Guang Chen, Clustering-driven residue filter for profile measurement system, The Journal of the Optical Society of America A, 28(2): 214-221,2011 1. Remote control system for electronic device and remote control method thereof, 8648811, US patent,2014 2. Imaging Systemfor Three-Dimensional ReconstructionofSurface Profiles, 7676114, US patent,2010 3.Anintelligentdialog system andamethodforrealization, 200906965-9, Singapore patent,2010 4. A wearable device, 201310603649.8, Chinapatent, 2016 5. A method, system and computing device for virtual touch screen, 201310218824.1,Chinapatent, 2016 6. A method and detecting device for Stamping member surface defect, 201310169235.9,Chinapatent, 2016 7. A method and systemfor human-computer interaction, 201010544636.4, Chinapatent, 2015 8. An intelligent helmet network system based on cloud computing and its video information processing method, 201210302782.5, Chinapatent, 2015 9.An apparatus for providing a real-time scene map, 201210294651.7, China patent, 2014 10. Flatness detection device and method, 201210319325.7,China patent,2014 11. Coaxial adjustment method, 201110365859.9,China patent,2014 12. A method and system forgesture recognition, 201010292510.2, China patent, 2013 13.An embedded bean classification system based on image recognition,200910251723.8, China patent, 2013 14. Anidentification method and device for marking in human body, 201010527394.8,China patent, 2012 15.A method and system for falling surveillance and alarm, 201010285585.8,China patent, 2012 16.An intelligent audio identification system and identification method, 200710075008.4,China patent, 2011 17.An intelligent chat system and its implementation method, 200710074112.1,China patent, 2011 18. A method, device and human-computer interaction system for extracting target in image, 200910105175.8,China patent,2011 19. A virtual sports system based on computer vision and its realization, 200710123839.4,China patent, 2010 20. A remote control system and method for electronic equipment, 200810216671.6, China patent, 2010 1. Intelligent Internet robot and application platform, Guangdong Province Science and Technology Progress,Third Award, Rank 1,2006 2. Intelligent Internet robot and application platform, Shenzhen Science and Technology Progress,SecondAward, Rank 1, 2015 3. Internet robots, Wu Wenjun Artificial Intelligence Science and Technology Progress Award Second Award, Chinese Association for Artificial Intelligence, Rank 1, 2014 4. Special allowance of the State Council, 2016 5. Simultaneous messaging robot, Excellent Product Award, Rank 1, 2010 6. Virtual Sports Based on Computer Vision, Excellent Product Award, Rank 1, 2008"
  ]
}