{
  "company": "english.easen-electron.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 61
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 61
    }
  },
  "sample_docs": [
    "Time & Attendance/Access Control Intelligent Face RecognitionReal-Time Video Analysis System Intelligent Face RecognitionReal-time Video Analysis System searches for a particular person in large-scale (thousands to millions) databases (fugitive mugshot DB, missing persons mugshot DB, residents mugshot DB) adopting Easen's cutting-edge face recognition technology. Without collaboration from the persons under surveillance, the system automatically recognizes and alarms when passing a surveillance point. This system solved large-scale human resource waste and time consumption issues, and supplies useful mechanisms for pre-incident alarming and post-incident investigation of security systems. l Auto-detecting and capturing faces in video stream, and displaying continuous moving tracks l Real-time comparison between auto-captured face and data registered in watch list, alarming and instructing the operator to do necessary actions the moment an objective person has been found l Equipment management, User management, Log management l Black/White List Surveillance Alarm l Face Image: 80*80pixel l Face Recognition Rate: >97% l Face Detection Rate: >99.95% l 4-channel 1080p HD IP Camera l Fast yet accurate identification in 1s l Surveillance in important locations like airports, seaports, banks l Surveillance of particular persons in gathering places like conferences,exhibitions and so on l Surveillance of people who did various illegal acts in train stations, bus-stops in transportation field l Surveillance of unwelcomed persons like habitual offenders in markets and shopping malls l Identifying VIPs or major customers in shops and hotels 〠200% 150% 100% 】 ã€ Back 】 Address:No.99 Building, Tanjiawan Daxue Road, Hi-tech Zone, Zhuhai City, Guangdong Province",
    "Face Recognition Performance in LFW benchmark 2018-01-18 Face Recognition Performance in LFW benchmark 2017-05-27 Face Recognition Performance in LFW benchmark 2016-09-18 Zhuhai Yisheng In Public Security Expo 2015-11-02 Yisheng To Participate In The Shenzhen International Biometric Exhibition 2015-08-16 Zhuhai Yisheng In Guangzhou Building Decoration Exhibition 2015-07-12 Yisheng Face Lock Will Shine Intelligent Lock Expo 2015-04-28 Yisheng And You Meet Beijing Security Expo 2014-10-16 Launching SmartFace – BioAT3202 2014-07-12 The 1st Place In ICIR2013 2013-04-29 10 1/1 Page Up page 1 Next page Address:No.99 Building, Tanjiawan Daxue Road, Hi-tech Zone, Zhuhai City, Guangdong Province",
    "The 1st Place In ICIR2013 Our iris recognition algorithm occupied the 1st place in the first ICB Competition on Iris Recognition(ICIR 201... more The 1st Place In ICIR2013 Our iris recognition algorithm occupied the 1st place in the first ICB Competition on Iris Recognition(ICIR 201... more 2016-03-02 What Is Biometrics, Face Recognition, Iris Recognition 2016-01-14 The Application Of Face Recognition In The Security Of City Public Security 2015-11-02 Zhuhai Yisheng In Public Security Expo 2015-08-16 Yisheng To Participate In The Shenzhen International Biometric Exhibition 2015-07-12 Zhuhai Yisheng In Guangzhou Building Decoration Exhibition The company specializes in technical research and development of biometric products and solutions and its self-developed iris and face recognition algorithms have participated in FRVT2013 and ICIR2013, biometric competitions sponsored by international organizations. Address:No.99 Building, Tanjiawan Daxue Road, Hi-tech Zone, Zhuhai City, Guangdong Province",
    "What Is Biometrics, Face Recognition, Iris Recognition Biometrics is a science and technology of measuring and analyzing biological data. In information technology, biometrics refers to technologies that measure and analyze human body characteristics(physiological or behavioral characteristic), such as DNA, fingerprints, vein, eye retinas and irises, voice patterns, facial patterns, hand measurements, gait and signature for authentication or any other purpose. This method of authentication offers several advantages over traditional methods involving ID cards (tokens) or PIN numbers (passwords) for various reasons: 1.A person to be identified is required to be physically present at the point-of-identification. 2.Identification based on biometric techniques obviates the need to remember a password or carry a token therefore there is no danger to forget a password or lose a token. 3.Since it is almost impossible to replicate biometric identifiers such as face, iris pattern and finger vein, biometrics-based authentication provides much more powerful security. With the increased integration of computers and Internet into our everyday lives, it is necessary to protect sensitive and personal data. By replacing PINs (or using biometrics in addition to PINs), biometric techniques can potentially prevent unauthorized access to ATMs, cellular phones, laptops, computer networks, and site. Unlike biometric identifiers, PINs or passwords may be forgotten, and credentials like passports and driver's licenses may be forged, stolen, or lost. As a result, biometric systems are being deployed to enhance security and reduce financial fraud. Various biometric identifiers are being used for real-time recognition, being the most popular face, iris and fingerprint. . In biometrics-based authentication, there is no need to remember passwords or carry keys or tokens which gives much more convenience compared to the traditional authentication methods. In addition, through a variety of sub technologies such as age, gender, and mood estimation, it ensures the various solutions for convenience, entertainment, etc. such as advertisement receiver analysis, makeup, and online shopping. Our company invested our best technical resources in developing industry-leading technologies such as face recognition , iris recognition , finger vein recognition and facial attributes extraction. 〠200% 150% 100% 】 ã€ Back 】 Address:No.99 Building, Tanjiawan Daxue Road, Hi-tech Zone, Zhuhai City, Guangdong Province",
    "Zhuhai Yisheng Electronics Co., Ltd. is a science & technology-oriented company where R & D, production and sales of biometric technology and intelligent security products are integrated. The company is located in the cutting-edge industrial area of Zhuhai, a beautiful coast city of South China. Based on its own R & D ability and the advanced electronics industrial technology of Pearl River Delta, the company offers to customers reliable, simple yet convenient biometric products and solutions depending on management ideology of \"Science & Technology, Creation, Quality†and world-leading biometric technology, strict yet efficient production line and reliable product quality. The company specializes in technical research and development of biometric products and solutions and its self-developed iris and face recognition algorithms have participated in FRVT2013 and ICIR2013, biometric competitions sponsored by international organizations, and won championship and excellent results respectively. Depending on self-owned biometric technologies, it has introduced three product series, which is face recognition intelligent door lock, face recognition time & attendance device and iris recognition time & attendance device as well as provides with intelligent face recognition real-time video analysissystem, intelligentface recognition video playback analysis system, AB entrance guard system and face recognition visitors management system. Our products and solutions can be widely used in many areas like intelligent furniture(intelligent door lock, intelligent safe), time & attendance / access control system, public security, information security, finance, public welfare, education and so on. The company completely implemented ISO9001(2008)-international quality management system and the products have passed RoHS, CE-EMC, CE-LVD, FCC, PSE certificates. The company sincerely looks forward to working in partnership with you, upholding the management ideology that superiorproducts and services will be served for \"Safe City, Smart Living†Zhuhai Yisheng Electronics Co., Ltd. is a science & technology-oriented company where R & D, production and sales of biometric technology and intelligent security products are integrated. The company is located in the cutting-edge industrial area of Zhuhai, a beautiful coast city of South China. Based on its own R & D ability and the advanced electronics industrial technology of Pearl River Delta, the company offers to customers reliable, simple yet convenient biometric products and solutions depending on management ideology of \"Science & Technology, Creation, Quality†and world-leading biometric technology, strict yet efficient production line and reliable product quality. The company specializes in technical research and development of biometric products and solutions and its self-developed iris and face recognition algorithms have participated in FRVT2013 and ICIR2013, biometric competitions sponsored by international organizations, and won championship and excellent results respectively. Depending on self-owned biometric technologies, it has introduced three product series, which is face recognition intelligent door lock, face recognition time & attendance device and iris recognition time & attendance device as well as provides with intelligent face recognition real-time video analysissystem, intelligentface recognition video playback analysis system, AB entrance guard system and face recognition visitors management system. Our products and solutions can be widely used in many areas like intelligent furniture(intelligent door lock, intelligent safe), time & attendance / access control system, public security, information security, finance, public welfare, education and so on. The company completely implemented ISO9001(2008)-international quality management system and the products have passed RoHS, CE-EMC, CE-LVD, FCC, PSE certificates. The company sincerely looks forward to working in partnership with you, upholding the management ideology that superiorproducts and services will be served for \"Safe City, Smart Living†Address:No.99 Building, Tanjiawan Daxue Road, Hi-tech Zone, Zhuhai City, Guangdong Province"
  ]
}