{
  "company": "english.taiwanmobile.com",
  "dominant_topics": [
    9,
    5
  ],
  "topic_counts": {
    "9": 1,
    "5": 1
  },
  "topic_descriptions": {
    "9": "gsm, gprs, wireless, cdma, rf",
    "5": "aml, smartsearch, money, laundering, money laundering"
  },
  "framing_scores": {
    "framing_ethical": 0.8888888888888888,
    "framing_surveillance": 0.0,
    "framing_market": 0.1111111111111111,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "5": 1,
      "9": 1
    }
  },
  "sample_docs": [
    "Company Profile Management Team Milestone Awards & Recognitions Affiliated Companies Press Release CSR Report CSR Corporate Governance Operational Status Financials Debt Information Shareholder Information Board of Directors Announcement Investor Events Contact Us FAQ Postpaid Service Prepaid Service International Call Mobile Internet Mobile Broadband Value Added Service For Home For Business Contact Us Service Locations FAQ Network & Coverage Network Registration Dial Instruction Avaliable Services Phone Reservation Bridge Alliance Useful Numbers Welcome to Bridge Alliance, the leading and largest mobile alliance in Asia Pacific. Spanning across eleven major territories with a current partnership of eleven mobile operators, Bridge Alliance serves over 295 million customers offering frequent travellers a suite of value added services that redefines their roaming experience across the members networks. Taiwan Mobile is a member of Bridge Alliance, together, we bring you a suite of compelling services and benefits that allow you to stay connected seamlessly across the region. For more information about Bridge Alliance, visit www.bridgealliance.com No more bill shock! With our one-flat data roaming rate, you can save up to 90% when roaming across 12 territories within Asia Pacific. Start saving today with Bridge DataRoam, a smarter choice to stay connected anytime, anywhere. BRIDGE SAVINGS CALCULATOR Simplify your global mobility needs! Take control of your regional mobile needs with Bridge BizConnect. Increase your efficiency and productivity with Bridge BillAnalyser. Stay ahead in this competitive business world with Bridge DataRoam. Be delighted with our privileges! With Bridge Privileges, travelling is now made more pleasurable. Join us as a member today! Roam with peace of mind! With Bridge Assist, you can now get assistance on your roaming needs wherever you are. Call: +65 6424 6288 SMS: +65 8284 9988 Email: bridgeassist@bridgemobile.com",
    "Corporate Governance Practice Please Swipe Left or Right View All. Item Current practice Shareholding structure and shareholders' interests Handling of shareholders' suggestions and disputes The spokesperson or Secretarial Division handles all non-legal issues; the legal division handles all legal issues. Identification of major shareholders and investors with controlling interest The Secretarial Division submits a monthly report listing the shareholdings of directors, managers and major shareholders (over 10% shareholding) to the authorities. Risk control mechanisms and firewalls between the Company and its subsidiaries The Company's internal control system has established \"Rules and Procedures on Conducting Transactions between Group Companies and Related Parties\" and \"Rules and Procedures on Monitoring Subsidiaries\" as risk control mechanisms. Board of directors and its responsibilities Independent directors The Company's board includes five independent directors. Board performance evaluation The Company passed the Rules and Procedures on Evaluating the Performance of the Board and Functional Committees to enhance efficiency, under which the Remuneration and Nomination Committee conducts an analysis and submits a report on proposed improvements to the board after an annual performance evaluation and uses it as a reference for remuneration and re- appointment. The performance evaluation was completed through self-assessments by board members (Assessment Report) , which covered evaluations of the performance of the board, board members and functional committees. Both the board and committees performed well, with an average rating of over 4.97, with 5 being the highest score. The Company appointed the Taiwan Corporate Governance Association (TCGA) to conduct its board evaluation in January 2024. The evaluation, covering the period from April 1, 2023 to March 31, 2024, focused on eight aspects: composition, guidelines, authorization, supervision, communication, internal controls and risks, self-discipline and support systems. The report was issued on May 27, 2024, and presented to the Board of Directors by the Remuneration and Nomination Committee on August 5, 2024. The results of the evaluation and proposed are as follows: A. Comments: (a)The company values the professional and diverse capabilities of the Board of Directors. The selection of board members is based on the company's development strategy, seeking suitable candidates from various fields. The Board consists of nine members, with more than half being independent directors (including one female director). The five independent directors are proactive and responsible, actively participating in various special discussions (such as strategy development, new technological knowledge, mergers and acquisitions, investment management, etc.) in addition to regular meetings. With a forward-looking and international perspective, they remind the management team and fully assist the Board in fulfilling its guiding and supervisory functions. (b)The leadership style of Chairman is open and receptive to suggestions, fostering a team environment where board members feel free to speak their minds fully. In important decisions and issues (such as the group's investment strategy), the opinions of independent directors are fully respected. This clearly demonstrates the proactive and open culture of the board's deliberations, which is commendable. (c)Each year, the board of directors sets the Balanced Scorecard (BSC) goals for the general manager, which serve as the performance targets for the entire company. The assessment indicators include both financial and non-financial metrics, with approximately 30% linked to ESG (Environmental, Social, and Governance) performance. The achievement of ESG goals is tied to compensation, helping to realize the company's sustainability objectives. (d)The company has a comprehensive supervision mechanism for its reinvested businesses, which includes thorough pre-investment evaluations and post-investment management. The audit unit regularly compiles and reports the internal audit results of significant reinvested companies to the board of directors. Additionally, managers of key subsidiaries regularly report to the board, ensuring a complete management mechanism and proactive risk control implementation. (e)From the perspective of the 5Cs (Compliance, Culture, Communication, Collaboration, Competency), observing the functions and operations of the company's board of directors reveals that all board members possess professional competencies, adhere to legal regulations, maintain comprehensive internal and external communication mechanisms, collaborate fully with the management team and have fostered a culture of effective board operation. B. Suggestions: (a)The company has established multiple committees (including the Audit Committee, Remuneration and Nomination Committee, ESG Steering Committee, Cyber Security and Data Privacy Protection Committee, and Risk Management Committee). There may be similarities and overlaps in the functions and responsibilities of these committees, and their degree of subordination to the board varies. It is recommended that the company periodically review the organizational regulations of each committee (including the feasibility of consolidation) according to operational development needs to enhance the effectiveness of their operations. (b)To help stakeholders better understand the structure and operations of the functional committees under the board of directors and other management-level committees, it is recommended that the company uniformly and clearly disclose relevant information, such as the organizational structure, division of responsibilities, and reporting methods of each committee, on various communication platforms (e.g., website, annual report, and sustainability report, etc.). Periodic review of CPA's independence The Audit Committee is authorized to evaluate the independence of the CPAs according to the \"Bulletin of Norm of Professional Ethics for Certified Public Accountant of the Republic of China\" and \"Corporate Governance Best Practice Principles for TWSE/GTSM Listed Companies\" on a quarterly basis based on the following criteria: The CPAs neither serve as a director/supervisor /manager nor hold a position with major influence in the Company or its subsidiaries. Neither are they related parties nor do they have direct or indirect interests that conflict with the Company's. The Company has not engaged the services of the same CPA for seven consecutive years. The CPAs should provide the Company with a Declaration of Independence on a periodic basis. All CPAs engaged by the Company have fulfilled the aforementioned criteria. Communication channels with shareholders The spokesperson and the mailboxes of spokesperson and the Audit Committee serve as the main communication channels between the Company and shareholders. Information disclosure Disclosure of information on financial status, operations and corporate governance Disclosure of financial-related and corporate governance information is posted periodically on the Company's website. Other ways of disclosing information Aside from having a spokesperson, the Company has a dedicated department, the Investor Relations Division, to handle information disclosure. It also has an English website and a team working on gathering and releasing relevant Company information. Functional committees An Audit Committee and a Remuneration and Nomination Committee were set up under the board of directors. Their operations are detailed in the Company's annual report. Assesment Report The Company passed the Rules and Procedures on Evaluating the Performance of the Board and Functional Committees to enhance efficiency, under which the Remuneration and Nomination Committee conducts an analysis and submits a report on proposed improvements to the board after an annual performance evaluation and uses it as a reference for remuneration and re- appointment. The performance evaluation was completed through self-assessments by board members (Assessment Report) , which covered evaluations of the performance of the board, board members and functional committees. Both the board and committees performed well, with an average rating of over 4.97, with 5 being the highest score. The Company appointed the Taiwan Corporate Governance Association (TCGA) to conduct its board evaluation in January 2024. The evaluation, covering the period from April 1, 2023 to March 31, 2024, focused on eight aspects: composition, guidelines, authorization, supervision, communication, internal controls and risks, self-discipline and support systems. The report was issued on May 27, 2024, and presented to the Board of Directors by the Remuneration and Nomination Committee on August 5, 2024. The results of the evaluation and proposed are as follows: (a)The company values the professional and diverse capabilities of the Board of Directors. The selection of board members is based on the company's development strategy, seeking suitable candidates from various fields. The Board consists of nine members, with more than half being independent directors (including one female director). The five independent directors are proactive and responsible, actively participating in various special discussions (such as strategy development, new technological knowledge, mergers and acquisitions, investment management, etc.) in addition to regular meetings. With a forward-looking and international perspective, they remind the management team and fully assist the Board in fulfilling its guiding and supervisory functions. (b)The leadership style of Chairman is open and receptive to suggestions, fostering a team environment where board members feel free to speak their minds fully. In important decisions and issues (such as the group's investment strategy), the opinions of independent directors are fully respected. This clearly demonstrates the proactive and open culture of the board's deliberations, which is commendable. (c)Each year, the board of directors sets the Balanced Scorecard (BSC) goals for the general manager, which serve as the performance targets for the entire company. The assessment indicators include both financial and non-financial metrics, with approximately 30% linked to ESG (Environmental, Social, and Governance) performance. The achievement of ESG goals is tied to compensation, helping to realize the company's sustainability objectives. (d)The company has a comprehensive supervision mechanism for its reinvested businesses, which includes thorough pre-investment evaluations and post-investment management. The audit unit regularly compiles and reports the internal audit results of significant reinvested companies to the board of directors. Additionally, managers of key subsidiaries regularly report to the board, ensuring a complete management mechanism and proactive risk control implementation. (e)From the perspective of the 5Cs (Compliance, Culture, Communication, Collaboration, Competency), observing the functions and operations of the company's board of directors reveals that all board members possess professional competencies, adhere to legal regulations, maintain comprehensive internal and external communication mechanisms, collaborate fully with the management team and have fostered a culture of effective board operation. (a)The company has established multiple committees (including the Audit Committee, Remuneration and Nomination Committee, ESG Steering Committee, Cyber Security and Data Privacy Protection Committee, and Risk Management Committee). There may be similarities and overlaps in the functions and responsibilities of these committees, and their degree of subordination to the board varies. It is recommended that the company periodically review the organizational regulations of each committee (including the feasibility of consolidation) according to operational development needs to enhance the effectiveness of their operations. (b)To help stakeholders better understand the structure and operations of the functional committees under the board of directors and other management-level committees, it is recommended that the company uniformly and clearly disclose relevant information, such as the organizational structure, division of responsibilities, and reporting methods of each committee, on various communication platforms (e.g., website, annual report, and sustainability report, etc.). The Audit Committee is authorized to evaluate the independence of the CPAs according to the \"Bulletin of Norm of Professional Ethics for Certified Public Accountant of the Republic of China\" and \"Corporate Governance Best Practice Principles for TWSE/GTSM Listed Companies\" on a quarterly basis based on the following criteria: The CPAs neither serve as a director/supervisor /manager nor hold a position with major influence in the Company or its subsidiaries. Neither are they related parties nor do they have direct or indirect interests that conflict with the Company's. The Company has not engaged the services of the same CPA for seven consecutive years. The CPAs should provide the Company with a Declaration of Independence on a periodic basis. All CPAs engaged by the Company have fulfilled the aforementioned criteria. 12F, No. 88, Yanchang Road, Xinyi Dist., Taipei City 110, Taiwan, R.O.C. 24 Hour Service Hotline : mobile dial 188 (toll-free) directly or +886-2-66062999 12F, No. 88, Yanchang Road, Xinyi Dist., Taipei City 110, Taiwan, R.O.C. 24 Hour Service Hotline : mobile dial 188 (toll-free) directly or +886-2-66062999"
  ]
}