{
  "company": "eocortex.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 63,
    "-1": 13
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 13,
      "0": 63
    }
  },
  "sample_docs": [
    "Privacy & cookies policy Please, review the Privacy & Cookies Policy of Satellite LLC (Eocortex) Please, review the Privacy & Cookies Policy of Satellite LLC (Eocortex) Privacy & Cookies Policy Satellite LLC (Eocortex) and its subsidiaries are committed to protecting your online privacy. We have designed our web sites and mobile, pc desktop and embedded applications in a way that will enable you to visit and access most of the available information and material without having to submit any personal data unless you choose to. However, in order to take part in some of the functions and activities and to get access to some of Eocortex' services, it will be necessary for you to provide personal data on certain areas of the web sites. By accessing or using a Eocortex web site, you agree to the of the Eocortex . If you do not agree to these , please do not access or use this site. Eocortex reserves the right to change the from time to time at its sole discretion. Your use of this site will be subject to the most current version of the online at the time of such use. What personal information we collect from the people that visit website When ordering or registering on our site, as appropriate, you may be asked to enter your name, email address, phone number, company, country, project description or other details to help you with your experience. When we collect information We collect information from you when you fill out a form or enter information on our site. How we use your information We may use the information we collect from you when you register, make a purchase, for our newsletter, respond to a survey or marketing communication, surf the website, or use certain other site features in the following ways: To personalize your experience and to allow us to deliver the type of content and product offerings in which you are most interested. To allow us to better service you in responding to your customer service requests. To send periodic emails regarding your order or other products and services. How we protect your information We only provide articles and information. We never ask for credit card numbers. We do not need an SSL because we don't process any payments through the website. Cookies Cookies are small files that a site or its service provider transfers to your computer's hard drive through your Web browser (if you allow) that enables the site's or service provider's systems to recognize your browser and capture and remember certain information. For instance, we use cookies to help us remember and process the items in your shopping cart. They are also used to help us understand your preferences based on previous or current site activity, which enables us to provide you with improved services. We also use cookies to help us compile aggregate data about site traffic and site interaction so that we can offer better site experiences and tools in the future. We use cookies to: Understand and save user's preferences for future visits. Keep track of advertisements. Compile aggregate data about site traffic and site interactions in order to offer better site experiences and tools in the future. We may also use trusted third-party services that track this information on our behalf. You can choose to have your computer warn you each time a cookie is being sent, or you can choose to turn off all cookies. You do this through your browser settings. Since browser is a little different, look at your browser's Help Menu to learn the correct way to modify your cookies. If you turn cookies off, some of the features that make your site experience more efficient may not function properly. It won't affect the user's experience that make your site experience more efficient and may not function properly. Third-party disclosure We do not sell, trade, or otherwise transfer to outside parties your Personally Identifiable Information unless we provide users with advance notice. This does not include website hosting partners and other parties who assist us in operating our website, conducting our business, or serving our users, so long as those parties agree to keep this information confidential. We may also release information when it's release is appropriate to comply with the law, enforce our site policies, or protect ours or others' rights, property or safety. However, non-personally identifiable visitor information may be provided to other parties for marketing, advertising, or other uses. Links to other sites Sometimes you will find links to third party sites on our web sites. Please note that this online does not automatically apply to these third-party sites. Children We believe it is important to provide added protection for children online. We encourage parents and guardians to spend time online with their children to observe, participate in and/or monitor and guide their online activity. eocortex.com does not knowingly collect any personally identifiable information from children under the age of 13. If a parent or guardian believes that eocortex.com has in its database the personally-identifiable information of a child under the age of 13, please contact us and we will use our best efforts to promptly remove such information from our records. We do not specifically market to children under the age of 13 years old. Email We collect your email address in order to: Send information, respond to inquiries, and/or other requests or questions. Process orders and to send information and updates pertaining to orders. Send you additional information related to your product and/or service. Market to our mailing list or continue to send emails to our clients after the original transaction has occurred. We agree to the following: Not use false or misleading subjects or email addresses. Identify the message as an advertisement in some reasonable way. Include the physical address of our business or site headquarters. Monitor third-party email marketing services for compliance, if one is used. Honor opt-out/unsubscribe requests quickly. Allow users to unsubscribe by using the link at the bottom of each email If at any time you would like to unsubscribe from receiving future emails, you can email us at follow the instructions at the bottom of each email and we will promptly remove you from all correspondence. Contacting Us If there are any questions regarding this , you may contact us using the information below. Satellite LLC eocortex.com info@eocortex.com Sh. Kosmonavtov st. 111/27, Perm, Perm kray, 614066, Russian Federation Last Edited on 2017-12-18 Privacy & Cookies Policy Satellite LLC (Eocortex) and its subsidiaries are committed to protecting your online privacy. We have designed our web sites and mobile, pc desktop and embedded applications in a way that will enable you to visit and access most of the available information and material without having to submit any personal data unless you choose to. However, in order to take part in some of the functions and activities and to get access to some of Eocortex' services, it will be necessary for you to provide personal data on certain areas of the web sites. By accessing or using a Eocortex web site, you agree to the of the Eocortex . If you do not agree to these , please do not access or use this site. Eocortex reserves the right to change the from time to time at its sole discretion. Your use of this site will be subject to the most current version of the online at the time of such use. What personal information we collect from the people that visit website When ordering or registering on our site, as appropriate, you may be asked to enter your name, email address, phone number, company, country, project description or other details to help you with your experience. When we collect information We collect information from you when you fill out a form or enter information on our site. How we use your information We may use the information we collect from you when you register, make a purchase, for our newsletter, respond to a survey or marketing communication, surf the website, or use certain other site features in the following ways: To personalize your experience and to allow us to deliver the type of content and product offerings in which you are most interested. To allow us to better service you in responding to your customer service requests. To send periodic emails regarding your order or other products and services. How we protect your information We only provide articles and information. We never ask for credit card numbers. We do not need an SSL because we don't process any payments through the website. Cookies are small files that a site or its service provider transfers to your computer's hard drive through your Web browser (if you allow) that enables the site's or service provider's systems to recognize your browser and capture and remember certain information. For instance, we use cookies to help us remember and process the items in your shopping cart. They are also used to help us understand your preferences based on previous or current site activity, which enables us to provide you with improved services. We also use cookies to help us compile aggregate data about site traffic and site interaction so that we can offer better site experiences and tools in the future. We use cookies to: Understand and save user's preferences for future visits. Keep track of advertisements. Compile aggregate data about site traffic and site interactions in order to offer better site experiences and tools in the future. We may also use trusted third-party services that track this information on our behalf. You can choose to have your computer warn you each time a cookie is being sent, or you can choose to turn off all cookies. You do this through your browser settings. Since browser is a little different, look at your browser's Help Menu to learn the correct way to modify your cookies. If you turn cookies off, some of the features that make your site experience more efficient may not function properly. It won't affect the user's experience that make your site experience more efficient and may not function properly. We do not sell, trade, or otherwise transfer to outside parties your Personally Identifiable Information unless we provide users with advance notice. This does not include website hosting partners and other parties who assist us in operating our website, conducting our business, or serving our users, so long as those parties agree to keep this information confidential. We may also release information when it's release is appropriate to comply with the law, enforce our site policies, or protect ours or others' rights, property or safety. However, non-personally identifiable visitor information may be provided to other parties for marketing, advertising, or other uses. Links to other sites Sometimes you will find links to third party sites on our web sites. Please note that this online does not automatically apply to these third-party sites. We believe it is important to provide added protection for children online. We encourage parents and guardians to spend time online with their children to observe, participate in and/or monitor and guide their online activity. eocortex.com does not knowingly collect any personally identifiable information from children under the age of 13. If a parent or guardian believes that eocortex.com has in its database the personally-identifiable information of a child under the age of 13, please contact us and we will use our best efforts to promptly remove such information from our records. We do not specifically market to children under the age of 13 years old. We collect your email address in order to: Send information, respond to inquiries, and/or other requests or questions. Process orders and to send information and updates pertaining to orders. Send you additional information related to your product and/or service. Market to our mailing list or continue to send emails to our clients after the original transaction has occurred. We agree to the following: Not use false or misleading subjects or email addresses. Identify the message as an advertisement in some reasonable way. Include the physical address of our business or site headquarters. Monitor third-party email marketing services for compliance, if one is used. Honor opt-out/unsubscribe requests quickly. Allow users to unsubscribe by using the link at the bottom of each email If at any time you would like to unsubscribe from receiving future emails, you can email us at follow the instructions at the bottom of each email and we will promptly remove you from all correspondence. If there are any questions regarding this , you may contact us using the information below. Satellite LLC eocortex.com info@eocortex.com Sh. Kosmonavtov st. 111/27, Perm, Perm kray, 614066, Russian Federation Last Edited on 2017-12-18",
    "Software for IP Cameras Download a Demo Version Product Technical Specification Video Analytics Interface Implementation Calculator Where to Buy Technical Support Service FAQ Documentation Software Installation Packages Supported Cameras Change log About Us News Publications Contacts Become a Partner Promo Materials Typical tasks Successful Projects Tel: 253 618 579 | 965 740 661 Tel.: 934 254 960 | 934 269 111 XKT - Projectos e Instalacoes Tecnicas Lda Tel.: +351 21 446 78 30 Cablecom - Violetcable Lda Av. do Mar nº 87 Verdizela 2855-650 Tel.: +351 212 973 688 Datelka Intеrnational S. A. Av. Infante D. Henrique, 328 - 1º G 1800-223 Tel.: +351 218 311 160",
    "Software for IP Cameras Download a Demo Version Product Technical Specification Video Analytics Interface Implementation Calculator Where to Buy Technical Support Service FAQ Documentation Software Installation Packages Supported Cameras Change log About Us News Publications Contacts Become a Partner Promo Materials Typical tasks Successful Projects Tel: 27 (0) 31 539 4921",
    "Software for IP Cameras Download a Demo Version Product Technical Specification Video Analytics Interface Implementation Calculator Where to Buy Technical Support Service FAQ Documentation Software Installation Packages Supported Cameras Change log About Us News Publications Contacts Become a Partner Promo Materials Typical tasks Successful Projects Tel. +7 495 661 18 12 Tel.: +7 495 739 22 83 Tel.: +7 495 735 39 61 Tel.: +7 495 380 20 64 Tel.: +7 495 708 42 13 Tel.: +7 499 400 15 16, Tel: +7 495 502 27 29 Tel.: +7 495 640 55 30 Tel.: +7 495 787 34 24 Tel.: +7 499 611 56 01 Tel.: +7 495 649 63 94 Tel.: +7 495 604 48 34 Tel.: +7 495 646 85 80 Tel.: +7 495 685 93 17 Tel.: +7 495 669 74 20 Tel.: +7 495 940 70 89 Tel.: +7 499 638 41 86 Tel.: +7 495 213 88 36 Tel.: +7 495 506 26 37 Tel.: 8 800 775 09 54 Tel.: +7 495 788 38 00 Tel.: +7 925 500 2208 Tel.: +7 800 550 50 60 Tel.: +7495 229 39 24 Full list of distributors is presented on Macroscop Russian website",
    "Software for IP Cameras Download a Demo Version Product Technical Specification Video Analytics Interface Implementation Calculator Where to Buy Technical Support Service FAQ Documentation Software Installation Packages Supported Cameras Change log About Us News Publications Contacts Become a Partner Promo Materials Typical tasks Successful Projects Tel: +421 917 257 908"
  ]
}