{
  "company": "etunnel.net",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "ETUNNEL Biometric Security A companion that safely protects the present and future of me and my family Our Business Introducing our services Secure the Future with ETUNNEL ETUNNEL connects the future securely through biometric authentication-based security Biometric ID, Reinvented. We provide accurate and tamper-proof identity verification with the Finger Vein-based 'ETUNNEL-ST-100V'. see more From AI Engine to SafeICert Experience ETUNNEL's unique integrated security solution based on P2N2, CQKMS, and CQFramework. TECHNOLOGY SOLUTION SERVICES Youtube Introducing our videos Introducing ETUNNEL's integrated biometric authentication solution, AI Engine P2N2. Click the 'Watch More' button for more details. ⏸ ETUNNEL News Introducing our news ETUNNEL Inc. Presents Finger Vein-Based PC Logon Solution Former Maryland Secretary Jimmy Rhee Visits ETUNNEL's Booth at CES 2025 ETUNNEL Participates in CES 2025…HP CEO Enrique Lores' Visit Draws Attention Why HP CEO Enrique Lores Visited a Korean Venture Company's Booth at CES 2025 ETUNNEL article published in the famous Financial Times in U.S ETUNNEL wins contract to supply biometric smart cards for UN organizations The YTN Innovation Korea episode featuring the biometric security company \"ETUNNEL Inc.\" aired Unveiling ETUNNEL Inc.'s Breakthrough in Biometric Security Technology ETUNNEL Selected as ID Security Partner for International Telecommunication Union ETUNNEL Inc. Presents Finger Vein-Based PC Logon Solution Former Maryland Secretary Jimmy Rhee Visits ETUNNEL's Booth at CES 2025 ETUNNEL Participates in CES 2025…HP CEO Enrique Lores' Visit Draws Attention Why HP CEO Enrique Lores Visited a Korean Venture Company's Booth at CES 2025 ETUNNEL article published in the famous Financial Times in U.S ETUNNEL wins contract to supply biometric smart cards for UN organizations The YTN Innovation Korea episode featuring the biometric security company \"ETUNNEL Inc.\" aired Unveiling ETUNNEL Inc.'s Breakthrough in Biometric Security Technology ETUNNEL Selected as ID Security Partner for International Telecommunication Union"
  ]
}