{
  "company": "examity.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Management Team: Executive Leadership Shailu Tipparaju CTO Shailu Tipparaju, ensures the technology strategy and operations properly serve the core business objective to build a best-in-class test integrity solution with an intuitive user experience. With a proven expertise in building ed-tech solutions, Shailu provides leadership for the company within technology, solution development and all strategic areas. Prior to Examity, Shailu was the co-founder and CTO of EdAssist, an ed-tech solution that facilitates education and training processes. The company was acquired by Bright Horizons Family Solutions in 2011. Earlier in his career, he was the director of enterprise education solutions at Xerox where he had the unique distinction of being recognized as the top performing employee worldwide. Randy Grosberg Vice President, Sales Randy Grosberg joined Examity® as its vice president sales. He oversees all new client acquisition activities across multiple channels worldwide. Randy is an accomplished senior leader with an exceptional track record in business development, customer service and operations. For more than 10 years, he has focused exclusively on ed-tech working closely with Universities and Fortune 500 companies. Prior to Examity®, Mr. Grosberg was a top performer at Brainshark, College Coach and Tuition Advisory Services. He also co-founded CSN, an innovative student loan company. Earlier in his career, he was a Vice President at Fleet Bank where he was responsible for the telephone sales and small business divisions. John Katzman Advisor John Katzman currently serves as an advisor to Examity. He is the founder and CEO of The Noodle Companies, an education startup whose eponymous search engine helps students and parents find educational resources and schools. Prior to Noodle, Katzman founded 2U (originally 2tor), and served as its CEO and Chairman until 2012. 2U works with research universities to create high-quality online degree programs. Mr. Katzman also founded The Princeton Review, and served as its CEO and Chairman until 2007. Mr. Katzman is the co-author of five books and many articles. He serves on the Boards of Directors for several non-profits, including the National Association of Independent Schools, the Alliance for Public Charter Schools, and the Woodrow Wilson Foundation. He has helped launch several start-ups, mostly in the area of education technology, and has invested in many others. Linn Foster Freedman Advisor Linn Freedman practices in data privacy and security law, and complex litigation for Nixon Peabody. She is leader of the firm's Privacy & Data Protection group and chair of the firm's HIPAA Compliance team. Prior to joining the firm, Linn was an assistant attorney general and deputy chief of the Civil Division of the Attorney General's Office for the State of Rhode Island. In this role, she was responsible for the supervision of the regulatory activities of the department and four regulatory units: Public Utilities, Insurance Advocacy, Charitable Trusts and the Health Care Advocate, including the health care conversions team. She currently serves as General Counsel to the Rhode Island Quality Institute. Matt Barlas Account Manager Matt joined the Examity® team with approximately 10 years experience in customer service and client account management in the mutual fund and retirement planning fields. As an Account Manager, he employs proven skills in client implementation, relationship building and quality assurance to lead enterprise-wide operations and growth efforts. His role ensures that every client, professor and student interaction is seamless. He establishes trust and strong, long-term client relationships and client program development, while staying sensitive to customers' needs. Prior to joining Examity®, Matt was employed at Mass Financial Services, Sun Life Insurance, and The Hartford Retirement Group. He is a graduate of Ithaca College and Suffolk University Law School. Matt Keough Account Manager An Account Manager at Examity®, Matthew Keough is a former journalist who reported on Boston's vast and diverse institutional culture for the better part of a decade. Mr. Keough delivered education-based headlines to both local and national audiences during his time as a reporter for Herald Media, a writer at Fox 25 and as an associate producer at Fox News Channel in New York City. At Examity, Matt is able to utilize his unique background and insight to ensure clients receive a comprehensive service that addresses the myriad of nuances in the vast and ever-growing world of online education and instruction. Keough is a graduate of Emerson College, class of 2004. Nina O'Brien Operations Manager Nina O'Brien is a marketing professional with vast experience in international marketing, sales and social media. Since graduating from Simmons College, Ms. O'Brien has proven herself a leader by helping a variety of national and international companies promote and develop their businesses. Prior to joining the Examity® team, Ms. O'Brien worked in a range of industries including television, education, healthcare and technology. As the Marketing and Operations Manager, Ms. O'Brien is focused on using technology to bring the convenience back to online education and to ensure all operational aspects of the company are well-designed and accessible. ABOUT | OUR TEAM | INSTITUTIONS | STUDENTS | FAQ | CONTACT Copyright 2014 Examity®. .",
    "Examity® Website GENERAL OF USE AND CONDITIONS Welcome to the Examity® website. These of Use and Conditions (\" \") govern your use of the Examity® (\"our\") website (\"Site\"). Please read the in full before using our Site. By accepting these , or by using this Site, you agree to be legally bound by these of Use, our and Notice of Privacy Practices. If you do not agree to these , please do not use our Site. We reserve the right to modify these at any time without prior notice, and your use of the Site bind you to the use of the changes made. We do occasionally update these so please refer to them in the future. Use of Site Our Site, images, data, text, audios, videos, photographs, custom graphics, logos, button icons, descriptions and all other material provided and the collection and compilation and assembly thereof are the exclusive property of Secure Proctor or its affiliates, and are protected by U.S. and international copyright laws. The contents of our Site may be used for informational purposes only. Any other use of such contents, including the reproduction, modification, distribution, transmission, republication, display or performance of the contents without our prior written consent is expressly forbidden. Any other trademarks or service marks appearing anywhere on our Site are the property of their respective owners. To the extent any product name or logo does not appear with a trademark (™) does not constitute a waiver of any and all intellectual property rights that Examity® or its businesses has established in any of its products, features, or service names or logos. You may not use, reproduce, modify, transmit, display, publish, sell, create derivative works, or distribute by any means, method, or process whatsoever, now known or hereafter developed, any content of this Site for commercial profit or gain. Nothing in these or on the Site shall be construed as conferring any intellectual property or other proprietary rights to You. You agree to observe copyright and other applicable laws and may not use the content in any manner that infringes or violates the rights of any person or entity. We hold all rights to the content on this Site. As a condition of your use of the Site, you may not use the Site, or any contents or services, for any purpose that is unlawful in any applicable jurisdiction where our Site are being used, or prohibited by these , conditions, and notices, and you agree to abide by the set forth in the \"User Conduct\" section. You may not use the Site contents or services in any manner that could damage, disable, overburden, or impair any of our equipment or interfere with any other party's use and enjoyment of the Site, or any contents or services. You may not attempt to gain access to any portion of the Site, or any of its contents or services, other than those for which you are authorized. While every effort is made to ensure that all content provided on the Site does not contain computer viruses and/or harmful materials, you should take reasonable and appropriate precautions to scan for computer viruses or otherwise protect your computer and you should ensure that you have a complete and current backup of the applicable items on your computer. We disclaim any liability for the need for services or replacing equipment or data resulting from your use of the Site. While every effort is made to ensure smooth and continuous operation, we do not warrant the Site will operate error free. Site Uptime We take all reasonable steps to ensure that our Site is available 24 hours every day, 365 days per year. However, websites do sometimes encounter downtime due to server and other technical issues. Therefore, we will not be liable if this Site is unavailable at any time. Our Site may be temporarily unavailable due to issues such as system failure, maintenance or repair, or for reasons beyond our control. Where possible, we will try to give our users advance warning of maintenance issues, but shall not be obliged to do so. User Conduct Any material you send or post to our Site shall be considered non-proprietary and non-confidential. We do not collect or store any personally identifiable information about you while using our Site but please do not send any such information to us. See also our and Notice of Privacy Practices. When using our Site, you shall not post or send to or from the Site: (a) content for which you have not obtained all necessary consents; (b) content that is discriminatory, obscene, pornographic, defamatory, liable to incite racial hatred, in breach of confidentiality or privacy, which may cause annoyance or inconvenience to others, which encourages or constitutes conduct that would be deemed a criminal offense, give rise to a civil liability, or otherwise is contrary to the law in any applicable jurisdiction where our Site is being used; or (c) content which is harmful in nature including, and without limitation, computer viruses, Trojan horses, corrupted data, or other potentially harmful software or data. We will fully cooperate with any law enforcement authorities or court order requiring us to disclose the identity or other details or any person posting materials to our Site in breach of the this Section. Links to and from Third Party Websites Any links furnished on our Site may allow you to leave our Site. These third party websites are not under our control and we disclaim any responsibility for the contents of such linked sites or any link(s) contained in any such linked site(s) or any changes or updates to any of these sites. We further disclaim any responsibility for any form of transmission received from any linked third party website or advertising. If we provide these links to you, it is done simply as a convenience to you and inclusion of any link herein shall in no way be construed as an endorsement by us of the site(s). If you would like to link to our Site, you may only do so on the basis that you link to, but do not replicate, any page of our Site, and subject to the following conditions: (a) you do not in any way imply that we are endorsing any services or products unless this has been specifically agreed with us; (b) you do not misrepresent your relationship with us or present any false information about us; (c) you do not link from a website that is not owned by you; and (d) your website does not contain content that is offensive, controversial, infringes any intellectual property rights or other rights of any other person or does not comply in any way with applicable law. If you choose to link our Site in breach of this Section, you shall fully indemnify, defend and hold us harmless from and against any claims, losses or damages arising as a result of your actions. Disclaimers All information on our Site is of a general nature and is furnished for your knowledge and understanding and as an entertainment resource only. The documents and any related graphics published on this server could include technical inaccuracies or typographical errors. Changes are periodically added to the information contained on our Site. We may make improvements and/or changes to any of the products depicted or described herein at any time. We expressly disclaim any responsibility or liability for any adverse consequences or damages resulting from your use of the Site or reliance on the information from either. THE SITE IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS. WE MAKE NO WARRANTIES, EXPRESS OR IMPLIED, REPRESENTATIONS OR ENDORSEMENTS WHATSOEVER WITH REGARD TO ANY PRODUCTS, INFORMATION OR SERVICE PROVIDED THROUGH THIS SITE, INCLUDING, TITLE, NON-INFRINGEMENT, OR ANY OTHER WARRANTY, CONDITION, GUARANTY, OR REPRESENTATION, WHETHER ORAL OR IN WRITING, OR IN ELECTRONIC FORM. ADDITIONALLY, WE MAKE NO REPRESENTATION OR WARRANTY, EXPRESS OR IMPLIED, WITH RESPECT TO THE CONTENT OF THE SITE, OR LINKS TO OTHER SITES, INCLUDING BUT NOT LIMITED TO ACCURATENESS, COMPLETENESS, CORRECTNESS, TIMELINESS OR RELIABILITY. WE MAKE NO REPRESENTATION OR WARRANTY REGARDING THE MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE WITH RESPECT TO ANY CONTENT OR SERVICES WHATSOEVER THAT MAY BE ACCESSED THROUGH THIS SITE, OR THE RESULTS TO BE OBTAINED FROM USING THE SITE. WE MAKE NO REPRESENTATION OR WARRANTY THAT THE SITE OR CONTENT IS FREE FROM DEFECTS OR VIRUSES. YOUR USE OF EXTERNAL LINKS AND THIRD-PARTY WEBSITES IS AT YOUR OWN RISK AND SUBJECT TO THE OF USE FOR SUCH LINKS AND SITES. WHILE EVERY EFFORT IS MADE TO ENSURE THE TIMELINESS AND ACCURACY OF THE SITE CONTENT AND SERVICES, WE MAKE NO WARRANTIES EITHER EXPRESS OR IMPLIED, AND ASSUME NO LIABILITY OR RESPONSIBILITY FOR THE COMPLETENESS, USE, ACCURACY, RELIABILITY, CORRECTNESS, TIMELINESS OR USEFULNESS, OF ANY OF THE RESULTS OBTAINED FROM ITS USE. Limitation of Liability YOUR USE OF OUR SITE IS ENTIRELY AT YOUR OWN RISK. WE WILL NOT BE RESPONSIBLE TO YOU OR TO ANY THIRD PARTIES FOR ANY DIRECT OR INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL, OR PUNITIVE DAMAGES OR LOSSES OR INJURY YOU MAY INCUR IN CONNECTION WITH YOUR USE OR INABILITY TO USE THE SITE OR THE PRODUCTS, OR YOUR RELIANCE ON OR USE OF THE SITE, THE INFORMATION, OR SERVICES PROVIDED, OR THAT RESULT FROM MISTAKES, OMISSIONS, INTERRUPTIONS, DELETIONS OR ANY FAILURE OF PERFORMANCE, OR ANY OF THE DATA OR OTHER MATERIALS TRANSMITTED THROUGH OR RESIDING ON OUR SITE, REGARDLESS OF THE TYPE OF CLAIM OR THE NATURE OF THE CAUSE OF ACTION, EVEN IF WE HAVE ADVISED OF THE POSSIBILITY OF SUCH DAMAGE OR LOSS. Indemnification You agree to defend, indemnify, and hold us, our officers, directors, employees, volunteers, agents, licensors, and suppliers, harmless from and against any claims, actions or demands, liabilities and settlements including without limitation, reasonable legal and accounting fees, resulting from or alleged to result from, your use of and access to the site or your violation of these or your violation of any third party right, including without limitation any trademark, copyright or other proprietary or privacy right. Assignment These , and any rights and licenses granted hereunder, may not be transferred or assigned by you. Applicable Law We make no representations that the content or the Site are appropriate or may be used or downloaded outside the United States. Access to the Site and/or the content may not be legal in certain countries outside the United States. If you access the Site from outside the United States, you do so at your own risk and are responsible for compliance with the laws of the jurisdiction from which you access the Site. Our Site is created and controlled in The Commonwealth of Massachusetts, United States of America. The Site, and its contents, and any disputes arising therefrom shall be construed and interpreted under the laws of The Commonwealth of Massachusetts and applicable United States federal laws. Use of our Site constitutes agreement of the user to the jurisdiction of the state and federal courts located therein. Our Site is subject to the United States export control laws and regulations, and may be subject to export or import regulations in other countries. You agree to strictly comply with all such laws and regulations and acknowledge that you have the responsibility to obtain authorization to export, re-export, or import of any data on our Site, as may be required. General These , together with the and Notice of Privacy Practices, and any legal notices published by us on the Site, shall constitute the entire agreement between us concerning use of the Site. If any provision of these is deemed invalid by a court of competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of these , which shall remain in full force and effect. No waiver of any term shall be deemed a further or continuing waiver of such term or any other term, and our failure to assert any right or provision under these shall not constitute a waiver of such right or provision. YOU AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SITE MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES. OTHERWISE, SUCH CAUSE OF ACTION IS PERMANENTLY BARRED. Agreed-to client specified supersede general . Our Contact Information Examity® 20 Pickering Street Needham, MA 02492 Info@examity.com 855-Examity (855-392-6489) ABOUT | OUR TEAM | INSTITUTIONS | STUDENTS | FAQ | CONTACT Copyright 2014 Examity®. ."
  ]
}