{
  "company": "face.idrive.com",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "1": 1
    }
  },
  "sample_docs": [
    "Features of the IDrive ® Face platform Build safe and smart applications and integrate Face Recognition that can detect, analyze, and compare faces - via IDrive Face cloud APIs. IDrive Face APIs are used by the IDrive mobile apps for face recognition Face Detection Instantly identify one or multiple faces in your pictures. Face Verification Verify identity of faces by performing one-to-one face matching. Face Comparison Compare face with multiple matches and evaluate similarity. Emotion Detection Recognize the emotions displayed by human faces. Gender and Age Detection Categorize facial attributes into gender and age groups. Getting started! Developer guide and a few example codes Read API documentation Start building! Try any plan for free for 14 days Why IDrive ® Face? IDrive Face APIs enable developers and businesses to build face recognition apps and integrate face recognition into their software products. Accurate Complex algorithms that detect and analyze faces with high-accuracy. Compatible Seamless integration with CURL, Python, Java, PHP, Ruby, etc. End-to-end Encryption 256-bit AES encrypted transactions and SSL endpoints for data transfers. Data Privacy Stores only the feature vectors of the faces, and not the images. Latest Technology Latest biometric technology for faster face recognition. Scalable Upgrade your plan with the increase in application traffic. IDrive ® Face vs. Amazon Rekognition Why IDrive ® Face? IDrive ® Face Amazon Rekognition Pricing Analyze images at $0.0001 per transaction (Analyzing 1 million images with IDrive Face Business will cost you $224.5) Analyze images at $0.001 per transaction (Analyzing 1 million images will cost you $1000) Free trial Analyze unlimited images and store unlimited face metadata Analyze up to 5,000 images and store up to 1,000 face metadata per month Performance Response time as good as Amazon Rekognition Unlimited storage Store unlimited face metadata for free You are charged for the face metadata you store Face grouping Group similar faces with Face Grouping APIs Does not offer face grouping APIs now Features of the IDrive ® Face platform Build safe and smart applications and integrate Face Recognition that can detect, analyze, and compare faces - via IDrive Face cloud APIs. IDrive Face APIs are used by the IDrive mobile apps for face recognition Face Detection Instantly identify one or multiple faces in your pictures. Face Verification Verify identity of faces by performing one-to-one face matching. Face Comparison Compare face with multiple matches and evaluate similarity. Emotion Detection Recognize the emotions displayed by human faces. Gender and Age Detection Categorize facial attributes into gender and age groups. Getting started! Developer guide and a few example codes Read API documentation Start building! Try any plan for free for 14 days Why IDrive ® Face? IDrive Face APIs enable developers and businesses to build face recognition apps and integrate face recognition into their software products. Accurate Complex algorithms that detect and analyze faces with high-accuracy. Compatible Seamless integration with CURL, Python, Java, PHP, Ruby, etc. End-to-end Encryption 256-bit AES encrypted transactions and SSL endpoints for data transfers. Data Privacy Stores only the feature vectors of the faces, and not the images. Latest Technology Latest biometric technology for faster face recognition. Scalable Upgrade your plan with the increase in application traffic. IDrive ® Face vs. Amazon Rekognition Why IDrive ® Face? IDrive ® Face Amazon Rekognition Pricing Analyze images at $0.0001 per transaction (Analyzing 1 million images with IDrive Face Business will cost you $224.5) Analyze images at $0.001 per transaction (Analyzing 1 million images will cost you $1000) Free trial Analyze unlimited images and store unlimited face metadata Analyze up to 5,000 images and store up to 1,000 face metadata per month Performance Response time as good as Amazon Rekognition Unlimited storage Store unlimited face metadata for free You are charged for the face metadata you store Face grouping Group similar faces with Face Grouping APIs Does not offer face grouping APIs now Features of the IDrive ® Face platform Build safe and smart applications and integrate Face Recognition that can detect, analyze, and compare faces - via IDrive Face cloud APIs. IDrive Face APIs are used by the IDrive mobile apps for face recognition Face Detection Instantly identify one or multiple faces in your pictures. Face Verification Verify identity of faces by performing one-to-one face matching. Face Comparison Compare face with multiple matches and evaluate similarity. Emotion Detection Recognize the emotions displayed by human faces. Gender and Age Detection Categorize facial attributes into gender and age groups. Features of the IDrive ® Face platform Build safe and smart applications and integrate Face Recognition that can detect, analyze, and compare faces - via IDrive Face cloud APIs. IDrive Face APIs are used by the IDrive mobile apps for face recognition Instantly identify one or multiple faces in your pictures. Verify identity of faces by performing one-to-one face matching. Compare face with multiple matches and evaluate similarity. Recognize the emotions displayed by human faces. Gender and Age Detection Categorize facial attributes into gender and age groups. Getting started! Developer guide and a few example codes Read API documentation Start building! Try any plan for free for 14 days Why IDrive ® Face? IDrive Face APIs enable developers and businesses to build face recognition apps and integrate face recognition into their software products. Accurate Complex algorithms that detect and analyze faces with high-accuracy. Compatible Seamless integration with CURL, Python, Java, PHP, Ruby, etc. End-to-end Encryption 256-bit AES encrypted transactions and SSL endpoints for data transfers. Data Privacy Stores only the feature vectors of the faces, and not the images. Latest Technology Latest biometric technology for faster face recognition. Scalable Upgrade your plan with the increase in application traffic. Why IDrive ® Face? IDrive Face APIs enable developers and businesses to build face recognition apps and integrate face recognition into their software products. Complex algorithms that detect and analyze faces with high-accuracy. Seamless integration with CURL, Python, Java, PHP, Ruby, etc. 256-bit AES encrypted transactions and SSL endpoints for data transfers. Stores only the feature vectors of the faces, and not the images. Latest biometric technology for faster face recognition. Upgrade your plan with the increase in application traffic. IDrive ® Face vs. Amazon Rekognition Why IDrive ® Face? IDrive ® Face Amazon Rekognition Pricing Analyze images at $0.0001 per transaction (Analyzing 1 million images with IDrive Face Business will cost you $224.5) Analyze images at $0.001 per transaction (Analyzing 1 million images will cost you $1000) Free trial Analyze unlimited images and store unlimited face metadata Analyze up to 5,000 images and store up to 1,000 face metadata per month Performance Response time as good as Amazon Rekognition Unlimited storage Store unlimited face metadata for free You are charged for the face metadata you store Face grouping Group similar faces with Face Grouping APIs Does not offer face grouping APIs now IDrive ® Face vs. Amazon Rekognition Why IDrive ® Face? Response time as good as Amazon Rekognition Store unlimited face metadata for free You are charged for the face metadata you store Group similar faces with Face Grouping APIs Does not offer face grouping APIs"
  ]
}