{
  "company": "farfaces.net",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 11,
    "0": 9
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5538461538461539,
    "framing_surveillance": 0.0923076923076923,
    "framing_market": 0.3538461538461538,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "-1": 11,
      "0": 9
    }
  },
  "sample_docs": [
    "× Parenting Parents and caretakers can use our app to help identify lost children or children who ran away. Venues like sports arenas, theme parks and fairs can create a local database of kids by adding them during the ticket sale process. (manual and smart ticket stations) In case a child gets lost, any security personnel using our app can identify the missing child and see the parent's contact information. The local database gets destroyed every night after the venue is closed for privacy control. Parents will also be able to add their missing children to the global database and all app users will get notified that there is a missing child in their area. The global database of missing children will be administered by one of the dedicated international organizations. Why Are We Driven to Find a Solution? Almost every family has been affected by their children accidentally wandering off. In the United States, an average of 2,000 children are temporarily lost each day. Globally that number is about 9,000 a day, but it does not include countries where the numbers are not officially reported. The true number is far higher. Typically, kids will wander off in public places such as malls, beaches, amusement parks, fairs, airports, events and more. Statistically, it is much more difficult to find the parents rather than lost children. With our app, any staff member would be able to see the details of the parents or guardians (phone number etc.) in a second. The database is hosted on local servers and can be scheduled to be deleted every day after business hours. Parents can add information about their missing child into the app database and app users could see an alert pop up on their screen. This will increase the success rate of finding a missing child. Stats We Want to Help Curve: 250,000 children are reported missing in the European Union every year, the equivalent of around 1 child every 2 minutes (European Commission). Missing children include several categories of child disappearances: parental abductions, runaways, missing unaccompanied migrant minors and criminal abductions. 2-5% of missing child cases reported involve third party criminal abductions (Missing Children Europe Annual Report 2014). Runaways make up 50% of missing children cases reported through hot-lines (Missing Children Europe Annual Report 2014). 1 in 6 runaways are assumed to sleep rough, 1 in 8 resort to stealing to survive and 1 in 12 children are at serious risk of some form of abuse (The Children's Society). It is estimated that around 140,000 cases of missing children are reported annually in the UK, the equivalent of around 380 per day (missingchildreneurope.eu). Missing Children Europe opens an average of 4 new cases a day. international-missing-children-s-day-one-child-reported-missing-in-europe-every Contact us for more info! Parenting Parents and caretakers can use our app to help identify lost children or children who ran away. Venues like sports arenas, theme parks and fairs can create a local database of kids by adding them during the ticket sale process. (manual and smart ticket stations) In case a child gets lost, any security personnel using our app can identify the missing child and see the parent's contact information. The local database gets destroyed every night after the venue is closed for privacy control. Parents will also be able to add their missing children to the global database and all app users will get notified that there is a missing child in their area. The global database of missing children will be administered by one of the dedicated international organizations. Why Are We Driven to Find a Solution? Almost every family has been affected by their children accidentally wandering off. In the United States, an average of 2,000 children are temporarily lost each day. Globally that number is about 9,000 a day, but it does not include countries where the numbers are not officially reported. The true number is far higher. Typically, kids will wander off in public places such as malls, beaches, amusement parks, fairs, airports, events and more. Statistically, it is much more difficult to find the parents rather than lost children. With our app, any staff member would be able to see the details of the parents or guardians (phone number etc.) in a second. The database is hosted on local servers and can be scheduled to be deleted every day after business hours. Parents can add information about their missing child into the app database and app users could see an alert pop up on their screen. This will increase the success rate of finding a missing child. Stats We Want to Help Curve: 250,000 children are reported missing in the European Union every year, the equivalent of around 1 child every 2 minutes (European Commission). Missing children include several categories of child disappearances: parental abductions, runaways, missing unaccompanied migrant minors and criminal abductions. 2-5% of missing child cases reported involve third party criminal abductions (Missing Children Europe Annual Report 2014). Runaways make up 50% of missing children cases reported through hot-lines (Missing Children Europe Annual Report 2014). 1 in 6 runaways are assumed to sleep rough, 1 in 8 resort to stealing to survive and 1 in 12 children are at serious risk of some form of abuse (The Children's Society). It is estimated that around 140,000 cases of missing children are reported annually in the UK, the equivalent of around 380 per day (missingchildreneurope.eu). Missing Children Europe opens an average of 4 new cases a day. international-missing-children-s-day-one-child-reported-missing-in-europe-every Contact us for more info! Parents and caretakers can use our app to help identify lost children or children who ran away. Venues like sports arenas, theme parks and fairs can create a local database of kids by adding them during the ticket sale process. (manual and smart ticket stations) In case a child gets lost, any security personnel using our app can identify the missing child and see the parent's contact information. The local database gets destroyed every night after the venue is closed for privacy control. Parents will also be able to add their missing children to the global database and all app users will get notified that there is a missing child in their area. The global database of missing children will be administered by one of the dedicated international organizations. Why Are We Driven to Find a Solution? Almost every family has been affected by their children accidentally wandering off. In the United States, an average of 2,000 children are temporarily lost each day. Globally that number is about 9,000 a day, but it does not include countries where the numbers are not officially reported. The true number is far higher. Typically, kids will wander off in public places such as malls, beaches, amusement parks, fairs, airports, events and more. Statistically, it is much more difficult to find the parents rather than lost children. With our app, any staff member would be able to see the details of the parents or guardians (phone number etc.) in a second. The database is hosted on local servers and can be scheduled to be deleted every day after business hours. Parents can add information about their missing child into the app database and app users could see an alert pop up on their screen. This will increase the success rate of finding a missing child. Stats We Want to Help Curve: 250,000 children are reported missing in the European Union every year, the equivalent of around 1 child every 2 minutes (European Commission). 250,000 children are reported missing in the European Union every year, the equivalent of around 1 child every 2 minutes (European Commission). Missing children include several categories of child disappearances: parental abductions, runaways, missing unaccompanied migrant minors and criminal abductions. Missing children include several categories of child disappearances: parental abductions, runaways, missing unaccompanied migrant minors and criminal abductions. 2-5% of missing child cases reported involve third party criminal abductions (Missing Children Europe Annual Report 2014). 2-5% of missing child cases reported involve third party criminal abductions (Missing Children Europe Annual Report 2014). Runaways make up 50% of missing children cases reported through hot-lines (Missing Children Europe Annual Report 2014). Runaways make up 50% of missing children cases reported through hot-lines (Missing Children Europe Annual Report 2014). 1 in 6 runaways are assumed to sleep rough, 1 in 8 resort to stealing to survive and 1 in 12 children are at serious risk of some form of abuse (The Children's Society). 1 in 6 runaways are assumed to sleep rough, 1 in 8 resort to stealing to survive and 1 in 12 children are at serious risk of some form of abuse (The Children's Society). It is estimated that around 140,000 cases of missing children are reported annually in the UK, the equivalent of around 380 per day (missingchildreneurope.eu). It is estimated that around 140,000 cases of missing children are reported annually in the UK, the equivalent of around 380 per day (missingchildreneurope.eu). Missing Children Europe opens an average of 4 new cases a day. international-missing-children-s-day-one-child-reported-missing-in-europe-every Missing Children Europe opens an average of 4 new cases a day. international-missing-children-s-day-one-child-reported-missing-in-europe-every Contact us for more info!",
    "Story & vision (Breakthrough Information Technology Center) Bitcenter is the company responsible for bringing this technology to life with its amazing team of professionals. FarFaces is the brand taking it to market. We believe that the unique Long Distance aspect of our technology significantly expands the areas of facial recognition use for various applications: Health, Social Services, Events (Professional & Sporting), Entertainment, Professional Security and more. More about us November 15, 2021 ISJ about FarFaces BitCenter UK has developed real-time facial recognition technology, FarFaces for mobile devices that allow detection and recognition of faces with an impressive recognition distance and speed at a distance of up to 15 metres. The best part? The FarFaces App could work on any mobile device (Android and iOS). February 26, 2020 EN about FarFaces Confex International 2020 at London Excel EN's favourite is a mobile phone facial recognition app called Far Faces by BITCENTER UK LTD. The app is ideal for fast-track entry, data capture and security at events. June 17, 2021 DASA about FarFaces It was an absolutely intriguing demonstration last week. As we mentioned on the day, we have never seen a capability with the level of functionality that you have developed. November 10, 2021 BIOMETRIC UPDATE BitCenter UK has developed a facial recognition mobile app, FarFaces, that it says provides the capabilities of a biometric CCTV system on a smartphone. March 24, 2021 MAD about FarFaces The face matching app that allows you to instantly recognize a person's face and give you information, as well as links to their public profiles instantly. All this can be done over a long distance of up to 15 meters. July 15, 2021 The WAM about FarFaces This app is developed by some of the world's smartest programmers and developers from BitCenter (Breakthrough Information Technology Center) an IT company based in the UK. September 11, 2021 AppAdvice about FarFaces One of the best mobile facial recognition at a distance at the moment-no pictures are stored and recognition happens on a spot! November 25, 2021 MAD about FarFaces TheWebAppMarket announces FarFaces as App of the Week. We congratulate the team and hard work behind this one of a kind app. Story & vision (Breakthrough Information Technology Center) Bitcenter is the company responsible for bringing this technology to life with its amazing team of professionals. FarFaces is the brand taking it to market. We believe that the unique Long Distance aspect of our technology significantly expands the areas of facial recognition use for various applications: Health, Social Services, Events (Professional & Sporting), Entertainment, Professional Security and more. More about us November 15, 2021 ISJ about FarFaces BitCenter UK has developed real-time facial recognition technology, FarFaces for mobile devices that allow detection and recognition of faces with an impressive recognition distance and speed at a distance of up to 15 metres. The best part? The FarFaces App could work on any mobile device (Android and iOS). February 26, 2020 EN about FarFaces Confex International 2020 at London Excel EN's favourite is a mobile phone facial recognition app called Far Faces by BITCENTER UK LTD. The app is ideal for fast-track entry, data capture and security at events. June 17, 2021 DASA about FarFaces It was an absolutely intriguing demonstration last week. As we mentioned on the day, we have never seen a capability with the level of functionality that you have developed. November 10, 2021 BIOMETRIC UPDATE BitCenter UK has developed a facial recognition mobile app, FarFaces, that it says provides the capabilities of a biometric CCTV system on a smartphone. March 24, 2021 MAD about FarFaces The face matching app that allows you to instantly recognize a person's face and give you information, as well as links to their public profiles instantly. All this can be done over a long distance of up to 15 meters. July 15, 2021 The WAM about FarFaces This app is developed by some of the world's smartest programmers and developers from BitCenter (Breakthrough Information Technology Center) an IT company based in the UK. September 11, 2021 AppAdvice about FarFaces One of the best mobile facial recognition at a distance at the moment-no pictures are stored and recognition happens on a spot! November 25, 2021 MAD about FarFaces TheWebAppMarket announces FarFaces as App of the Week. We congratulate the team and hard work behind this one of a kind app. (Breakthrough Information Technology Center) Bitcenter is the company responsible for bringing this technology to life with its amazing team of professionals. FarFaces is the brand taking it to market. We believe that the unique Long Distance aspect of our technology significantly expands the areas of facial recognition use for various applications: Health, Social Services, Events (Professional & Sporting), Entertainment, Professional Security and more. The WAM about FarFaces",
    "× Industrial Our facial recognition solutions can be used on construction sites, warehouses, factory floors, etc. to identify employees wearing protective gear (PPE) including helmets, light reflective jackets and safety eye wear and more. Our technology can be used on mobile devices and be integrated for industrial deployment. Features Our system operates in real time and detects, identifies and tracks several hundred employees at once. Our solution allows you to turn your consumer mobile device into a safety tracking system that recognizes people up to 15 meters/ 49 feet away. Replacing mobile devices with top-grade cameras and more capable hardware, turns our technology into an industrial grade solution. The software architecture design scalable to seamlessly operate on video-feed from two or more cameras suitably positioned to cover up for one another. With more capable optical devices (high-quality cameras, with optical zoom) you can extend the recognition range as far away as one can get a good quality face image of the object. The design of our software architecture is scalable to seamlessly operate on multiple video-feed sources, from two or more cameras suitably positioned to cover up for one another. Facial recognition typically requires daylight conditions to work optimally, but our solution can be combined with NIR images (Near Infrared Images) to be effective at night. We give you the ability to identify people who are not wearing PPE from your live video feed, and communicate and log that information in a different application. This gives you the ability to have more meaningful safety discussion that proves actual action taken by the employee. Our conclusive goal is to assist you to mitigate accidents in the workplace and therefore safe lives and minimize downtime on the worksite. Contact us for more info! Industrial Our facial recognition solutions can be used on construction sites, warehouses, factory floors, etc. to identify employees wearing protective gear (PPE) including helmets, light reflective jackets and safety eye wear and more. Our technology can be used on mobile devices and be integrated for industrial deployment. Features Our system operates in real time and detects, identifies and tracks several hundred employees at once. Our solution allows you to turn your consumer mobile device into a safety tracking system that recognizes people up to 15 meters/ 49 feet away. Replacing mobile devices with top-grade cameras and more capable hardware, turns our technology into an industrial grade solution. The software architecture design scalable to seamlessly operate on video-feed from two or more cameras suitably positioned to cover up for one another. With more capable optical devices (high-quality cameras, with optical zoom) you can extend the recognition range as far away as one can get a good quality face image of the object. The design of our software architecture is scalable to seamlessly operate on multiple video-feed sources, from two or more cameras suitably positioned to cover up for one another. Facial recognition typically requires daylight conditions to work optimally, but our solution can be combined with NIR images (Near Infrared Images) to be effective at night. We give you the ability to identify people who are not wearing PPE from your live video feed, and communicate and log that information in a different application. This gives you the ability to have more meaningful safety discussion that proves actual action taken by the employee. Our conclusive goal is to assist you to mitigate accidents in the workplace and therefore safe lives and minimize downtime on the worksite. Contact us for more info! Our facial recognition solutions can be used on construction sites, warehouses, factory floors, etc. to identify employees wearing protective gear (PPE) including helmets, light reflective jackets and safety eye wear and more. Our technology can be used on mobile devices and be integrated for industrial deployment. Our system operates in real time and detects, identifies and tracks several hundred employees at once. Our system operates in real time and detects, identifies and tracks several hundred employees at once. Our solution allows you to turn your consumer mobile device into a safety tracking system that recognizes people up to 15 meters/ 49 feet away. Our solution allows you to turn your consumer mobile device into a safety tracking system that recognizes people up to 15 meters/ 49 feet away. Replacing mobile devices with top-grade cameras and more capable hardware, turns our technology into an industrial grade solution. Replacing mobile devices with top-grade cameras and more capable hardware, turns our technology into an industrial grade solution. The software architecture design scalable to seamlessly operate on video-feed from two or more cameras suitably positioned to cover up for one another. The software architecture design scalable to seamlessly operate on video-feed from two or more cameras suitably positioned to cover up for one another. With more capable optical devices (high-quality cameras, with optical zoom) you can extend the recognition range as far away as one can get a good quality face image of the object. With more capable optical devices (high-quality cameras, with optical zoom) you can extend the recognition range as far away as one can get a good quality face image of the object. The design of our software architecture is scalable to seamlessly operate on multiple video-feed sources, from two or more cameras suitably positioned to cover up for one another. The design of our software architecture is scalable to seamlessly operate on multiple video-feed sources, from two or more cameras suitably positioned to cover up for one another. Facial recognition typically requires daylight conditions to work optimally, but our solution can be combined with NIR images (Near Infrared Images) to be effective at night. Facial recognition typically requires daylight conditions to work optimally, but our solution can be combined with NIR images (Near Infrared Images) to be effective at night. We give you the ability to identify people who are not wearing PPE from your live video feed, and communicate and log that information in a different application. This gives you the ability to have more meaningful safety discussion that proves actual action taken by the employee. Our conclusive goal is to assist you to mitigate accidents in the workplace and therefore safe lives and minimize downtime on the worksite. Contact us for more info!",
    "× Security Professional Security Services can utilize our solution and access information needed to identify personnel and other individuals in the palm of their hand, without having to invest in more equipment. Features: Detection, recognition and tracking at a distance of 15m/49ft Access control with different permission levels: No need for guest lists and wrist bands Entrance check in and check out control Ability to continuously monitor approved/unapproved individuals in the crowd (later stage) Ability to broadcast video from UAV to mobile phone with the facial recognition application The database is created by admin staff and is distributed to all devices (mobile phones, tablets or smart glasses) Every security personnel, if granted permission, can amend the database (for example add a new visitor) and this information will be transferred to all approved devices at the venue The data is stored locally and never on our servers The application installs on mobile phones, tablets or on smart glasses (later version) with a monthly or annual subscription/license. No extra equipment costs Security Professional Security Services can utilize our solution and access information needed to identify personnel and other individuals in the palm of their hand, without having to invest in more equipment. Features: Detection, recognition and tracking at a distance of 15m/49ft Access control with different permission levels: No need for guest lists and wrist bands Entrance check in and check out control Ability to continuously monitor approved/unapproved individuals in the crowd (later stage) Ability to broadcast video from UAV to mobile phone with the facial recognition application The database is created by admin staff and is distributed to all devices (mobile phones, tablets or smart glasses) Every security personnel, if granted permission, can amend the database (for example add a new visitor) and this information will be transferred to all approved devices at the venue The data is stored locally and never on our servers The application installs on mobile phones, tablets or on smart glasses (later version) with a monthly or annual subscription/license. No extra equipment costs Professional Security Services can utilize our solution and access information needed to identify personnel and other individuals in the palm of their hand, without having to invest in more equipment. Detection, recognition and tracking at a distance of 15m/49ft Access control with different permission levels: No need for guest lists and wrist bands Entrance check in and check out control Ability to continuously monitor approved/unapproved individuals in the crowd (later stage) Ability to broadcast video from UAV to mobile phone with the facial recognition application The database is created by admin staff and is distributed to all devices (mobile phones, tablets or smart glasses) Every security personnel, if granted permission, can amend the database (for example add a new visitor) and this information will be transferred to all approved devices at the venue The data is stored locally and never on our servers The application installs on mobile phones, tablets or on smart glasses (later version) with a monthly or annual subscription/license. No extra equipment costs Detection, recognition and tracking at a distance of 15m/49ft Detection, recognition and tracking at a distance of 15m/49ft Access control with different permission levels: No need for guest lists and wrist bands Access control with different permission levels: No need for guest lists and wrist bands Entrance check in and check out control Entrance check in and check out control Ability to continuously monitor approved/unapproved individuals in the crowd (later stage) Ability to continuously monitor approved/unapproved individuals in the crowd (later stage) Ability to broadcast video from UAV to mobile phone with the facial recognition application Ability to broadcast video from UAV to mobile phone with the facial recognition application The database is created by admin staff and is distributed to all devices (mobile phones, tablets or smart glasses) The database is created by admin staff and is distributed to all devices (mobile phones, tablets or smart glasses) Every security personnel, if granted permission, can amend the database (for example add a new visitor) and this information will be transferred to all approved devices at the venue Every security personnel, if granted permission, can amend the database (for example add a new visitor) and this information will be transferred to all approved devices at the venue The data is stored locally and never on our servers The data is stored locally and never on our servers The application installs on mobile phones, tablets or on smart glasses (later version) with a monthly or annual subscription/license. No extra equipment costs The application installs on mobile phones, tablets or on smart glasses (later version) with a monthly or annual subscription/license. No extra equipment costs",
    "× VIP & Retail Our solution allows you to create a truly personalized experience for your clients and visitors. An experience that makes them feel special and offers a sense of pleasant surprise and delight! Application Hotels: The concierge can identify registered guests from far away and will know their room number and preferences before they start the conversation. This gives a personal touch and speeds up the process. Retail: You can build a profile of your customers to provide suggestions and advice as well as to better predict inventory planning. Bars, Cafes & Restaurants: Know what your regular customer wants and have it ready before they place the order. Offer regular customers new suggestions of drinks and food based on their preferences. All venues: Allow automatic check-in by turning any mobile device into a remote check-in booth. Features The power is in the palm of your hands! Turn any mobile device into a state of the art facial recognition device without having to invest in expensive hardware. Gives you the power to recognize people from up to 15 meters/49 feet away. Always know who your client or customer is! Create easy controlled access points without a need for wristbands or special tickets. Easily recognize known shoplifters or restricted individuals at your venue. No more guessing! Imagine walking up to your favourite coffee shop and before you have a chance to order your favourite coffee, the barista welcomes you by your name and asks if you would like your espresso short or long. That is true customer service and customer retention! With FarFaces, your clients will benefit from a personalized experience and you will benefit from their loyalty! Contact us for more info! VIP & Retail Our solution allows you to create a truly personalized experience for your clients and visitors. An experience that makes them feel special and offers a sense of pleasant surprise and delight! Application Hotels: The concierge can identify registered guests from far away and will know their room number and preferences before they start the conversation. This gives a personal touch and speeds up the process. Retail: You can build a profile of your customers to provide suggestions and advice as well as to better predict inventory planning. Bars, Cafes & Restaurants: Know what your regular customer wants and have it ready before they place the order. Offer regular customers new suggestions of drinks and food based on their preferences. All venues: Allow automatic check-in by turning any mobile device into a remote check-in booth. Features The power is in the palm of your hands! Turn any mobile device into a state of the art facial recognition device without having to invest in expensive hardware. Gives you the power to recognize people from up to 15 meters/49 feet away. Always know who your client or customer is! Create easy controlled access points without a need for wristbands or special tickets. Easily recognize known shoplifters or restricted individuals at your venue. No more guessing! Imagine walking up to your favourite coffee shop and before you have a chance to order your favourite coffee, the barista welcomes you by your name and asks if you would like your espresso short or long. That is true customer service and customer retention! With FarFaces, your clients will benefit from a personalized experience and you will benefit from their loyalty! Contact us for more info! Our solution allows you to create a truly personalized experience for your clients and visitors. An experience that makes them feel special and offers a sense of pleasant surprise and delight! Hotels: The concierge can identify registered guests from far away and will know their room number and preferences before they start the conversation. This gives a personal touch and speeds up the process. Hotels: The concierge can identify registered guests from far away and will know their room number and preferences before they start the conversation. This gives a personal touch and speeds up the process. Retail: You can build a profile of your customers to provide suggestions and advice as well as to better predict inventory planning. Retail: You can build a profile of your customers to provide suggestions and advice as well as to better predict inventory planning. Bars, Cafes & Restaurants: Know what your regular customer wants and have it ready before they place the order. Offer regular customers new suggestions of drinks and food based on their preferences. Bars, Cafes & Restaurants: Know what your regular customer wants and have it ready before they place the order. Offer regular customers new suggestions of drinks and food based on their preferences. All venues: Allow automatic check-in by turning any mobile device into a remote check-in booth. All venues: Allow automatic check-in by turning any mobile device into a remote check-in booth. The power is in the palm of your hands! Turn any mobile device into a state of the art facial recognition device without having to invest in expensive hardware. The power is in the palm of your hands! Turn any mobile device into a state of the art facial recognition device without having to invest in expensive hardware. Gives you the power to recognize people from up to 15 meters/49 feet away. Gives you the power to recognize people from up to 15 meters/49 feet away. Always know who your client or customer is! Create easy controlled access points without a need for wristbands or special tickets. Always know who your client or customer is! Create easy controlled access points without a need for wristbands or special tickets. Easily recognize known shoplifters or restricted individuals at your venue. No more guessing! Easily recognize known shoplifters or restricted individuals at your venue. No more guessing! Imagine walking up to your favourite coffee shop and before you have a chance to order your favourite coffee, the barista welcomes you by your name and asks if you would like your espresso short or long. That is true customer service and customer retention! With FarFaces, your clients will benefit from a personalized experience and you will benefit from their loyalty! Contact us for more info!"
  ]
}