{
  "company": "fincore.com",
  "dominant_topics": [
    0,
    -1,
    11
  ],
  "topic_counts": {
    "0": 4,
    "-1": 4,
    "11": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "11": "authentication, password, lastpass, factor, hanko"
  },
  "framing_scores": {
    "framing_ethical": 0.5280898876404494,
    "framing_surveillance": 0.1235955056179775,
    "framing_market": 0.348314606741573,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 4,
      "11": 1
    }
  },
  "sample_docs": [
    "Banking and Investment Management Solutions Enterprise Data Management Solutions Public Service Delivery Solutions Fincore works closely with its clients to establish the real issue and offers advice, recommendations and technology to resolve it. Backed up by yearsof expertise, Fincore specialises in transforming its clients' requirements into a flexibly designed solution, making use of the years of experience in the market plus the development and implementation of sophisticated software solutions. Technology and expertise designed to give clients a leading edge. By undertaking continuous dialogue with its clients, and backed by dedicated investment in R&D, Fincore is constantly evolving its software solutions designed to provide cost-effective responses to the unique business challenges clients face. Fincore develops software solutions in the context of the full trade and commercial cycle. These include connectivity to external parties and systems and compliance - all designed to give clients a leading edge in their market. Fincore meets its clients' needs with a full range of solutions ... Banking and Investement Management Solutions Finsoft Financial System's coverage of this area is centered on three subjects Primary and secondary trading tools Financial Instrument Databases and Data Quality Management Risk Management In each area the products incorporate knowledge and experience gained first hand on the trading floors of some of the major investment banks in the City of London. This experience has provided us with a unique and profound understanding of all aspects of the business trading processes, and we have utilized this understanding in the design and implementation of our products. The result is superior performance and simplification of processes leading to higher efficiency and lower costs Our clients can therefore benefit not only from superior products, but from a total business relationship, based on solid understanding of the clients' business processes, and which therefore aims at helping them run their businesses in the most optimal fashion ... Enterprise Data Management Solutions Data at the core of key business processes is a resource critical to the survival and health of most organisations today. Protecting the integrity, security and quality of this type of data has become an important item on the agenda for many C-level senior executives. The challenge many organisations face is to protect the integrity, security and quality of core business data about key parts of their business such as customers, products, markets, channels, prices and schedules while at the same time allowing their business processes to meet the challenges of outsourcing, streamlining, flatter and more flexible organisations and greater customer involvement. Fincore provides an integrated EDM solution platform which can protect the integrity, security and quality of the complete range of core business data of a wide range of enterpises including banking, financial services, media, publishing and retail. Wether it is customers, products, markets, channels, prices or other key parts of a business the Fincore EDM solution platform allows core business data to be co-ordinated and controlled throughout an entire enterprise or even across several enterprises in real time. Fincore provides a range of off the shelf solution modules dealing with common types of data. ... The Collaborative Business Portal (CBP) is Finsoft's award winning system for business collaboration and real-time workflow management. The system has won the BAE Systems' Chairman's Award for Innovation 2003 for its innovative and user friendly contribution to increasing productivity. In projects at BAE Systems plc and EADS Astrium Ltd the system has enabled significant productivity increases (up to 70%), dramatic cycle time reductions (typically 30%) and helped create transparency and predictability in otherwise opaque processes. CBP is a completely generic collaboration and workflow management tool, which is applicable to any collaboration process, which need to improve its productivity and management transparency. It is readily adaptable to the needs of very diverse sectors, such as:Public administration Engineering design and manufacturing Construction Software development Insurance & Banking CBP is available both as a traditional licensed software installation and as a hosted ... Public and Professional Service Delivery Solutions Many public services from allocation of social housing or other social services and benefits all the way to business oriented services such planning permission or the granting and monitoring of operating licenses for certain types of business all require non routine case based working involving several professionals and often even several departments or even organisations. This is very different from standardised routine service processes like those provided by bank teller staff, check-in desks or common sales and customer service help desks. One of the main challenges for case based public services is that each case has some unique aspects and requires the professional skills and judgment of the case worker and other professionals involved. Another key challenge is the fact that case based work frequently requires several agencies or organisations to deliver a joined up and co-ordinated service under tight time and budget contraints to achieve the required outcomes. At the same time service users and the public expect both fair treatment and transparency of decisions especially where they have a major impact on an individual life, on businesses or the community as a whole. Fincore's Public and Professional Service solution addresses all these challenges and provides a secure, flexible and intuitive platform for case work based services within public and government organisations as well as organisations in the voluntary and and professional services sector facing similar ...",
    "BIOMETRICS Use the power of biometrics to protect players and your business. Empower your business with cutting-edge Facial Recognition and Biometrics solutions to enhance security, efficiency, and customer insight, all customised to your needs by our expert team. Facial Recognition Protect your business, strengthen gambling safety and gain valuable player insights with our powerful facial recognition software. Our truly omnichannel solution combines facial recognition with rules based actions, real-time data and reporting to provide actionable insights for your business. Two Factor Authentication Promote secure and responsible gambling with Fincore's secure 2FA (two-factor authentication) powered by facial recognition technology and artificial intelligence. Ensure only authorised users, can make payments or place bets. ID Scanner Speed up your ID verification process. Our AI powered system compares images from an identification document, such as a driver's license, with a picture of a real person and verifies the identity. Contact Us BIOMETRICS Use the power of biometrics to protect players and your business. BIOMETRICS Use the power of biometrics to protect players and your business. Empower your business with cutting-edge Facial Recognition and Biometrics solutions to enhance security, efficiency, and customer insight, all customised to your needs by our expert team. Facial Recognition Protect your business, strengthen gambling safety and gain valuable player insights with our powerful facial recognition software. Our truly omnichannel solution combines facial recognition with rules based actions, real-time data and reporting to provide actionable insights for your business. Two Factor Authentication Promote secure and responsible gambling with Fincore's secure 2FA (two-factor authentication) powered by facial recognition technology and artificial intelligence. Ensure only authorised users, can make payments or place bets. ID Scanner Speed up your ID verification process. Our AI powered system compares images from an identification document, such as a driver's license, with a picture of a real person and verifies the identity. Contact Us Empower your business with cutting-edge Facial Recognition and Biometrics solutions to enhance security, efficiency, and customer insight, all customised to your needs by our expert team. Protect your business, strengthen gambling safety and gain valuable player insights with our powerful facial recognition software. Our truly omnichannel solution combines facial recognition with rules based actions, real-time data and reporting to provide actionable insights for your business. Promote secure and responsible gambling with Fincore's secure 2FA (two-factor authentication) powered by facial recognition technology and artificial intelligence. Ensure only authorised users, can make payments or place bets. Speed up your ID verification process. Our AI powered system compares images from an identification document, such as a driver's license, with a picture of a real person and verifies the identity.",
    "TRI SPORTSBOOK PROFESSIONAL SERVICES Solve your biggest challenges with our Expert Professional Services for Sports-betting, Gaming, and Lottery Operators. Support Services Our bespoke Support Services can provide expert support tailored to your specific needs. From resolving technical issues to providing guidance on regulatory compliance, we've got you covered, allowing you to focus on what matters most – delivering an exceptional experience to your customers. Customisation Services Stand out from the competition and create a truly unique experience with our Software Customisation services. We understand that every operator has distinct branding and business objectives. Our talented team of developers will work closely with you to customise the software to align with your vision. From user interface enhancements to tailor-made features and functionalities. Integration Services Seamless integration is the key to optimising your business processes and achieving efficiency. Our Integration Services team specialise in integrating your existing systems with cutting-edge technologies, ensuring smooth and hassle-free data flow across platforms. Whether you need to connect gaming platforms, payment gateways, or CRM systems, our experts will customise and implement solutions tailored to your unique requirements. Hosting & Security Reliable and secure hosting is essential for the uninterrupted operation of your gaming platform. Our Hosting Solutions provide state-of-the-art infrastructure designed to handle the demands of your business. With our robust servers and advanced security measures, you can rest assured that your data is safe and your platform is always available to your users. TRI SPORTSBOOK PROFESSIONAL SERVICES Solve your biggest challenges with our Expert Professional Services for Sports-betting, Gaming, and Lottery Operators. TRI SPORTSBOOK PROFESSIONAL SERVICES Solve your biggest challenges with our Expert Professional Services for Sports-betting, Gaming, and Lottery Operators. Solve your biggest challenges with our Expert Professional Services for Sports-betting, Gaming, and Lottery Operators. Support Services Our bespoke Support Services can provide expert support tailored to your specific needs. From resolving technical issues to providing guidance on regulatory compliance, we've got you covered, allowing you to focus on what matters most – delivering an exceptional experience to your customers. Support Services Our bespoke Support Services can provide expert support tailored to your specific needs. From resolving technical issues to providing guidance on regulatory compliance, we've got you covered, allowing you to focus on what matters most – delivering an exceptional experience to your customers. Our bespoke Support Services can provide expert support tailored to your specific needs. From resolving technical issues to providing guidance on regulatory compliance, we've got you covered, allowing you to focus on what matters most – delivering an exceptional experience to your customers. Customisation Services Stand out from the competition and create a truly unique experience with our Software Customisation services. We understand that every operator has distinct branding and business objectives. Our talented team of developers will work closely with you to customise the software to align with your vision. From user interface enhancements to tailor-made features and functionalities. Integration Services Seamless integration is the key to optimising your business processes and achieving efficiency. Our Integration Services team specialise in integrating your existing systems with cutting-edge technologies, ensuring smooth and hassle-free data flow across platforms. Whether you need to connect gaming platforms, payment gateways, or CRM systems, our experts will customise and implement solutions tailored to your unique requirements. Customisation Services Stand out from the competition and create a truly unique experience with our Software Customisation services. We understand that every operator has distinct branding and business objectives. Our talented team of developers will work closely with you to customise the software to align with your vision. From user interface enhancements to tailor-made features and functionalities. Customisation Services Stand out from the competition and create a truly unique experience with our Software Customisation services. We understand that every operator has distinct branding and business objectives. Our talented team of developers will work closely with you to customise the software to align with your vision. From user interface enhancements to tailor-made features and functionalities. Stand out from the competition and create a truly unique experience with our Software Customisation services. We understand that every operator has distinct branding and business objectives. Our talented team of developers will work closely with you to customise the software to align with your vision. From user interface enhancements to tailor-made features and functionalities. Integration Services Seamless integration is the key to optimising your business processes and achieving efficiency. Our Integration Services team specialise in integrating your existing systems with cutting-edge technologies, ensuring smooth and hassle-free data flow across platforms. Whether you need to connect gaming platforms, payment gateways, or CRM systems, our experts will customise and implement solutions tailored to your unique requirements. Seamless integration is the key to optimising your business processes and achieving efficiency. Our Integration Services team specialise in integrating your existing systems with cutting-edge technologies, ensuring smooth and hassle-free data flow across platforms. Whether you need to connect gaming platforms, payment gateways, or CRM systems, our experts will customise and implement solutions tailored to your unique requirements. Hosting & Security Reliable and secure hosting is essential for the uninterrupted operation of your gaming platform. Our Hosting Solutions provide state-of-the-art infrastructure designed to handle the demands of your business. With our robust servers and advanced security measures, you can rest assured that your data is safe and your platform is always available to your users. Hosting & Security Reliable and secure hosting is essential for the uninterrupted operation of your gaming platform. Our Hosting Solutions provide state-of-the-art infrastructure designed to handle the demands of your business. With our robust servers and advanced security measures, you can rest assured that your data is safe and your platform is always available to your users. Reliable and secure hosting is essential for the uninterrupted operation of your gaming platform. Our Hosting Solutions provide state-of-the-art infrastructure designed to handle the demands of your business. With our robust servers and advanced security measures, you can rest assured that your data is safe and your platform is always available to your users.",
    "TRI HUB The cutting edge platform where Player Account Management, Payments, and Bonus converge, providing you with a unified real-time view of each player. PAM PAY BON Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximizing player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise shines. TRI HUB A comprehensive, end-to-end view of each player. Enabling you to track and analyse all player events with real-time data, empowering you to take swift and decisive action. Boost efficiency by automating the majority of tasks through rule setting, allowing you to prioritise exceptional cases. Stay fully compliant with our comprehensive suite of compliance, regulatory, and responsible gambling tools. Integrate TRI HUB into your preferred platforms, including CRM, Sportsbook, Gaming Server, and more, for a seamless and cohesive operational environment. PAM BON PAY Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximising player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise adds most value. TRI PAY Bring all player payments into one place, optimising their experience and protecting your business. Integrate directly with your chosen payment providers and take payments multiple ways, in multiple channels. Choose your own KPI dashboard with automated monitoring and reporting in real time. Protect your business by configuring risk rules and setting thresholds. Use automated triggers to focus on issues and respond to them rapidly. Delight players with speedy pay-outs. Our configurable payment approval rules mean you can pay out quickly with confidence. Anchor Pay TRI BON Drive player engagement & loyalty with our configurable bonus engine. Set up promos & offers effortlessly. Personalise experiences, reward loyalty, exchange loyalty points for bonuses & trigger communications using real-time data & your CRM. Stay in control with real-time budget controls & reporting. Lift up your player experience now! ​ Anchor BON BON2 TRI HUB The cutting edge platform where Player Account Management, Payments, and Bonus converge, providing you with a unified real-time view of each player. PAM PAY BON Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximizing player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise shines. TRI HUB A comprehensive, end-to-end view of each player. Enabling you to track and analyse all player events with real-time data, empowering you to take swift and decisive action. Boost efficiency by automating the majority of tasks through rule setting, allowing you to prioritise exceptional cases. Stay fully compliant with our comprehensive suite of compliance, regulatory, and responsible gambling tools. Integrate TRI HUB into your preferred platforms, including CRM, Sportsbook, Gaming Server, and more, for a seamless and cohesive operational environment. PAM BON PAY Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximising player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise adds most value. TRI HUB The cutting edge platform where Player Account Management, Payments, and Bonus converge, providing you with a unified real-time view of each player. The cutting edge platform where Player Account Management, Payments, and Bonus converge, providing you with a unified real-time view of each player. PAM PAY BON Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximizing player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise shines. Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximizing player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise shines. TRI HUB A comprehensive, end-to-end view of each player. Enabling you to track and analyse all player events with real-time data, empowering you to take swift and decisive action. Boost efficiency by automating the majority of tasks through rule setting, allowing you to prioritise exceptional cases. Stay fully compliant with our comprehensive suite of compliance, regulatory, and responsible gambling tools. Integrate TRI HUB into your preferred platforms, including CRM, Sportsbook, Gaming Server, and more, for a seamless and cohesive operational environment. A comprehensive, end-to-end view of each player. Enabling you to track and analyse all player events with real-time data, empowering you to take swift and decisive action. Boost efficiency by automating the majority of tasks through rule setting, allowing you to prioritise exceptional cases. Stay fully compliant with our comprehensive suite of compliance, regulatory, and responsible gambling tools. Integrate TRI HUB into your preferred platforms, including CRM, Sportsbook, Gaming Server, and more, for a seamless and cohesive operational environment. PAM BON PAY Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximising player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise adds most value. Unlock the full potential of your customers with a comprehensive suite of tools designed to create a seamless customer experience, while maximising player engagement and satisfaction. With rule setting and automation at it's core, TRI HUB efficiently handles routine interactions, freeing your team to concentrate on exceptional cases where their expertise adds most value. TRI PAY Bring all player payments into one place, optimising their experience and protecting your business. Integrate directly with your chosen payment providers and take payments multiple ways, in multiple channels. Choose your own KPI dashboard with automated monitoring and reporting in real time. Protect your business by configuring risk rules and setting thresholds. Use automated triggers to focus on issues and respond to them rapidly. Delight players with speedy pay-outs. Our configurable payment approval rules mean you can pay out quickly with confidence. Anchor Pay TRI PAY Bring all player payments into one place, optimising their experience and protecting your business. Integrate directly with your chosen payment providers and take payments multiple ways, in multiple channels. Choose your own KPI dashboard with automated monitoring and reporting in real time. Protect your business by configuring risk rules and setting thresholds. Use automated triggers to focus on issues and respond to them rapidly. Delight players with speedy pay-outs. Our configurable payment approval rules mean you can pay out quickly with confidence. Bring all player payments into one place, optimising their experience and protecting your business. Integrate directly with your chosen payment providers and take payments multiple ways, in multiple channels. Choose your own KPI dashboard with automated monitoring and reporting in real time. Protect your business by configuring risk rules and setting thresholds. Use automated triggers to focus on issues and respond to them rapidly. Delight players with speedy pay-outs. Our configurable payment approval rules mean you can pay out quickly with confidence. TRI BON Drive player engagement & loyalty with our configurable bonus engine. Set up promos & offers effortlessly. Personalise experiences, reward loyalty, exchange loyalty points for bonuses & trigger communications using real-time data & your CRM. Stay in control with real-time budget controls & reporting. Lift up your player experience now! ​ Anchor BON BON2 TRI BON Drive player engagement & loyalty with our configurable bonus engine. Set up promos & offers effortlessly. Personalise experiences, reward loyalty, exchange loyalty points for bonuses & trigger communications using real-time data & your CRM. Stay in control with real-time budget controls & reporting. Lift up your player experience now! ​ Drive player engagement & loyalty with our configurable bonus engine. Set up promos & offers effortlessly. Personalise experiences, reward loyalty, exchange loyalty points for bonuses & trigger communications using real-time data & your CRM. Stay in control with real-time budget controls & reporting. Lift up your player experience now!",
    "The Fincore Responsible Gambling tools keeping operators one step ahead of regulations. by John Chyriwsky | Jun 5, 2024 In iGaming, regulatory compliance is paramount. With increasing demands for real-time monitoring and proactive measures to ensure responsible gambling, staying ahead of regulations is not just a necessity—it's a competitive edge. At Fincore, we are excited to announce a significant update to our TRI software that empowers operators to stay one step ahead. The Trend Towards Real-Time Monitoring The need for real-time monitoring and proactive RG limits is underscored by recent changes to regulations. For example, the Dutch Gaming Authority (KSA) has announced a new responsible gaming policy, mandating 24/7 real-time monitoring and the introduction of financial deposit limits. According to the new KSA policy, online gambling providers must detect, analyse, and intervene within one hour if there are signs of excessive gambling or potential addiction. These measures aim to ensure timely intervention and prevent gambling-related harm. The KSA's Policy and Its Implications The KSA's revised policy highlights several critical changes: Mandatory Real-Time Monitoring : Providers are required to monitor gambling behavior continuously and intervene promptly if necessary. Financial Deposit Limits : Monthly deposit limits have been set, particularly stringent for young adults aged 18 to 24, who are allowed a maximum deposit of €300. Older players have a limit of €700. And whilst the KSA might be one of the first to introduce such regulations, the trend is clear and more regulators will follow their lead. The great news is that Fincore;s TRI software is already able to align with such regulations. Proactive Responsible Gambling Limits with Real-Time Monitoring Our latest TRI software update introduces advanced features designed to support operators in implementing proactive responsible gambling (RG) limits. Here's how TRI can help you stay ahead: Limit Categories TRI allows you to define automated limit thresholds across various categories including deposit, spend, loss, and withdrawal and session. These limits can be set as defaults for all players or tailored for specific groups, such as players under 25. This flexibility ensures that you can apply the most appropriate measures for different player segments. Ranked Exceptions We understand that there are always exceptions to any rule. That's why TRI's limit categories are ranked to ensure safe players aren't unfairly penalized. For instance, a verified high earner under 25 will not be restricted by the same limits as other players in the same age group, ensuring a balanced approach to responsible gambling. Real-Time Insights The core strength of TRI is its real-time event-based data monitoring. This allows operators to gain immediate insights into player behaviour, enabling the rapid application of category limits to address signs of problem gambling. Our software tailors these limits based on a host of player indicators such as age, location, and other player meta data like RG risk, KYC status, in addition to financial and time-based KPIs, providing a nuanced approach to player management. Fincore: Your Partner in Compliance and Responsible Gambling At Fincore, we are committed to providing cutting-edge solutions that empower our clients to lead the industry in responsible gambling practices. Our TRI software update is designed to help you navigate the complexities of regulatory compliance with ease, providing you with the tools to implement proactive RG limits and real-time monitoring effectively. Together, we can make iGaming safer and more responsible for everyone. Fincore Appoints Dominic Le Garsmeur as Chief Product Officer by John Chyriwsky | Jun 5, 2024 | News Fincore, the provider of cutting-edge software for online sports betting, casino and lottery has today announced that it has appointed Dominic Le Garsmeur Chief Product Officer. Dominic has more than 17 years' experience within iGaming, starting his career at... Fincore Appoints Dominic Le Garsmeur as Chief Product Officer by John Chyriwsky | Jun 5, 2024 | News Fincore, the provider of cutting-edge software for online sports betting, casino and lottery has today announced that it has appointed Dominic Le Garsmeur Chief Product Officer. Dominic has more than 17 years' experience within iGaming, starting his career at... Fincore launches TRI. The new modular software universe for Operators. by John Chyriwsky | May 9, 2024 | News Modern and modular tech solution provides a cost-effective route to operator platform ownership. 9 May 2024 – Fincore is pleased to announce the launch of its flagship TRI Software, a powerful, modular solution that allows operators to ultimately own... Fincore launches TRI. The new modular software universe for Operators. by John Chyriwsky | May 9, 2024 | News Modern and modular tech solution provides a cost-effective route to operator platform ownership. 9 May 2024 – Fincore is pleased to announce the launch of its flagship TRI Software, a powerful, modular solution that allows operators to ultimately own... Fincore and SB22 enter \"industry first\" biometrics partnership by John Chyriwsky | Jan 9, 2024 | News Gaming Software specialist integrates its powerful facial recognition solution into self-service sports betting platform to help solve challenges around anonymity in retail. 21 November 2023 – Fincore, a leading provider of technology and software solutions to the... Fincore and SB22 enter \"industry first\" biometrics partnership by John Chyriwsky | Jan 9, 2024 | News Gaming Software specialist integrates its powerful facial recognition solution into self-service sports betting platform to help solve challenges around anonymity in retail. 21 November 2023 – Fincore, a leading provider of technology and software solutions to the..."
  ]
}