{
  "company": "fully-verified.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.25,
    "framing_surveillance": 0.0,
    "framing_market": 0.75,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "0": 4
    }
  },
  "sample_docs": [
    "Interested? Get in touch. Let's solve your KYC and identity fraud problems Interested? Get in touch. Let's solve your KYC and identity fraud problems Please contact us using the form above. We will do our best to get back to you within less than 24 hours. Fully Verified OÜ (14455170), Tallinn, Estonia Harju maakond, Tallinn, Kesklinna linnaosa, Kiriku tn 6, 10130 Copyright Blog Please contact us using the form above. We will do our best to get back to you within less than 24 hours. Fully Verified OÜ (14455170), Tallinn, Estonia Harju maakond, Tallinn, Kesklinna linnaosa, Kiriku tn 6, 10130 Copyright",
    "Want to carry out identity verifications on video on your own? If you already have the necessary personnel and want to do it all yourself, we're here to help! Want to carry out identity verifications on video on your own? If you already have the necessary personnel and want to do it all yourself, we're here to help! We provide you the software you handle and control the operations. Whether you need to verify just a few or thousands of people every day, our software can handle it. Simple No need to deal with challenging and expensive software development. You receive a ready-to-use package which covers everything required to deliver video identity verifications. All you call center operatives need is a web browser, a video camera, and Internet access. Verifications are carried out through our easy to use interface – no need to deal with complicated code. It is so easy to use that virtually no training is required. Focus on your business not on developing new software. We provide the software – you control the verification processes and people. That means you can do everything the way you like it and you have full control over how verifications are delivered. Security You control your own data – no one else has access to it. All video verifications are saved for you to review at any point. Cross platform You customers can get verified using their laptops or smartphones We provide you the software you handle and control the operations. Whether you need to verify just a few or thousands of people every day, our software can handle it. No need to deal with challenging and expensive software development. You receive a ready-to-use package which covers everything required to deliver video identity verifications. All you call center operatives need is a web browser, a video camera, and Internet access. Verifications are carried out through our easy to use interface – no need to deal with complicated code. It is so easy to use that virtually no training is required. Focus on your business not on developing new software. We provide the software – you control the verification processes and people. That means you can do everything the way you like it and you have full control over how verifications are delivered. You control your own data – no one else has access to it. All video verifications are saved for you to review at any point. You customers can get verified using their laptops or smartphones",
    "Banking-Grade Identity Verifications, Online, on Video. ... backed by human verification specialists. Speed up customer onboarding, Eliminate identity fraud, Solve your KYC / AML compliance issues. Watch video Contact us Banking-Grade Identity Verifications, Online, on Video. ... backed by human verification specialists. Speed up customer onboarding, Eliminate identity fraud, Solve your KYC / AML compliance issues. Our video identity verification process is simple All your company has to do is connect to our API. We will handle everything else! Users fill in a registration form on your website with their personal details like they usually would Details are passed on to us via API We verify the details using a video identification process (mobile or desktop) with real-human verification specialist Verification outcome is passed on to your site. If successful, customer can make a purchase / perform desired action. Your Business Users fill in a registration form on your website with their personal details like they usually would Verification outcome is passed on to your site. If successful, customer can make a purchase / perform desired action. Our Service Details are passed on to us via API We verify the details using a video identification process (mobile or desktop) with real-human verification specialist Our video identity verification process is simple All your company has to do is connect to our API. We will handle everything else! Users fill in a registration form on your website with their personal details like they usually would Details are passed on to us via API We verify the details using a video identification process (mobile or desktop) with real-human verification specialist Verification outcome is passed on to your site. If successful, customer can make a purchase / perform desired action. Users fill in a registration form on your website with their personal details like they usually would Verification outcome is passed on to your site. If successful, customer can make a purchase / perform desired action. Details are passed on to us via API We verify the details using a video identification process (mobile or desktop) with real-human verification specialist 'Automated, and software-only' solutions will not protect you Cyber-criminals will use genuine (but stolen) identity details and therefore not detectable by software. People can also buy fake documents online for as little as $30 and use them to register on your site for fraudulent purposes. The same stolen information will also easily slip through ctraditional manual verifications of scanned documents! Simply because you won't know who actually sent the documents. \"The agency [FBI] used to learn about a new, large-scale data breach every two or three weeks. Now, it is close to every two to three days.\" – James Trainor Acting Assistant Director of the FBI Cyber Division 'Automated, and software-only' solutions will not protect you Cyber-criminals will use genuine (but stolen) identity details and therefore not detectable by software. People can also buy fake documents online for as little as $30 and use them to register on your site for fraudulent purposes. The same stolen information will also easily slip through ctraditional manual verifications of scanned documents! Simply because you won't know who actually sent the documents. \"The agency [FBI] used to learn about a new, large-scale data breach every two or three weeks. Now, it is close to every two to three days.\" – James Trainor Acting Assistant Director of the FBI Cyber Division How it works: Anytime... ... anywhere Your customers can get verified using their computers, tablets, or smartphones. All they need is a camera and an Internet connection. LIVE VIDEO ONBOARDING with verification specialist Through a video call our specialists verify your customers' documents and details. In the background we check documents' authenticity and perform face recognition checks to help our specialists make a better decision. Everything is recorded on video and saved We keep videos and logs of every verification process. It helps with any potential future problems and scares the bad guys away for good! …and it typically only takes 5-7 minutes per verification Eliminate identity fraud. Solve KYC / AML compliance issues. Secure, flexible, and fast onboarding process. Compliance with strict KYC and AML requirements. Significantly reduced (or even completely eliminated) chargebacks. Stress-free customer verification process – without hiring and training more staff. Full flexibility to meet demands of your business when it comes to e-KYC. Your customers can get verified using their computers, tablets, or smartphones. All they need is a camera and an Internet connection. LIVE VIDEO ONBOARDING with verification specialist Through a video call our specialists verify your customers' documents and details. In the background we check documents' authenticity and perform face recognition checks to help our specialists make a better decision. Everything is recorded on video and saved We keep videos and logs of every verification process. It helps with any potential future problems and scares the bad guys away for good! …and it typically only takes 5-7 minutes per verification Eliminate identity fraud. Solve KYC / AML compliance issues. Secure, flexible, and fast onboarding process. Compliance with strict KYC and AML requirements. Significantly reduced (or even completely eliminated) chargebacks. Stress-free customer verification process – without hiring and training more staff. Full flexibility to meet demands of your business when it comes to e-KYC. Say goodbye to… Wasted time performing ineffective and inefficient verifications yourself (as well as recruiting, training, and managing staff to perform them for you). Fraud resulting from outdated verification procedures such as manually checking uploaded documents. Worrying about complying with changing KYC and AML requirements. Loss of revenue due to delays between customer signup and how long it takes to get them verified (we do it in 5-7 minutes) Wasted time performing ineffective and inefficient verifications yourself (as well as recruiting, training, and managing staff to perform them for you). Fraud resulting from outdated verification procedures such as manually checking uploaded documents. Worrying about complying with changing KYC and AML requirements. Loss of revenue due to delays between customer signup and how long it takes to get them verified (we do it in 5-7 minutes) Interested? Get in touch. Let's solve your KYC and identity fraud problems Copyright Interested? Get in touch. Let's solve your KYC and identity fraud problems Copyright",
    "About us Fully-Verified was created as answer to its founders collectively losing over $150 000 to various types of fraud in their eCommerce businesses. Fully-Verified was created as answer to its founders collectively losing over $150 000 to various types of fraud in their eCommerce businesses. Our story We wanted to make sure this doesn't happen to anyone else. We knew that current identity verification solutions are simply not good enough. It's especially visible when you suffer the consequences of not verifying someone's identity correctly. Such as: loss of revenue, reputation damage, and huge penalties if you're a bigger institution. That's why we decided to create a solution which is bullet-proof and which satisfies all regulatory requirements. A service which solves your KYC compliance issues, which eliminates fraud, and which speeds up customer onboarding. So that you don't have to go through all the headaches we've already been through. We wanted to make sure this doesn't happen to anyone else. We knew that current identity verification solutions are simply not good enough. It's especially visible when you suffer the consequences of not verifying someone's identity correctly. Such as: loss of revenue, reputation damage, and huge penalties if you're a bigger institution. That's why we decided to create a solution which is bullet-proof and which satisfies all regulatory requirements. A service which solves your KYC compliance issues, which eliminates fraud, and which speeds up customer onboarding. So that you don't have to go through all the headaches we've already been through. Our founding team: Lucas Kwiatkowski Founder Victim of online fraud. Online marketer and entrepreneur for over 5 years, crypto-currencies enthusiast. Previously: Business Development Manager at TF Automation, BSc, MScgraduate in Business and Marketing (University of Bradford and University of Birmingham) Max Kusmierek Co-Founder CEO at WellServed.co E-commerce consultant, entrepreneur First successful exit DJBox.pl (2013) Rafal Wrzeszcz Technical Advisor Currently: Platform Engineer at Siemens Germany Previously: Senior Developer / System Engineer at HRS Innovation Hub, Senior Developer at Cross Engage GMBH, Rocket Internet SE, Quandoo GMBH, Red Sky Wojciech Kozicki Product Manager Translating technology into business and vice versa. Wojciech brings over 15 years of experience in of project and product management across multiple industries. Krzysztof Ebert Software architect Krzysztof has over 12 years of experience in software development in various environments. He has worked for startups, software houses, as well as big telco corporations. Lucas Kwiatkowski Founder Victim of online fraud. Online marketer and entrepreneur for over 5 years, crypto-currencies enthusiast. Previously: Business Development Manager at TF Automation, BSc, MScgraduate in Business and Marketing (University of Bradford and University of Birmingham) Victim of online fraud. Online marketer and entrepreneur for over 5 years, crypto-currencies enthusiast. Previously: Business Development Manager at TF Automation, BSc, MScgraduate in Business and Marketing (University of Bradford and University of Birmingham) Max Kusmierek Co-Founder CEO at WellServed.co E-commerce consultant, entrepreneur First successful exit DJBox.pl (2013) CEO at WellServed.co E-commerce consultant, entrepreneur First successful exit DJBox.pl (2013) Rafal Wrzeszcz Technical Advisor Currently: Platform Engineer at Siemens Germany Previously: Senior Developer / System Engineer at HRS Innovation Hub, Senior Developer at Cross Engage GMBH, Rocket Internet SE, Quandoo GMBH, Red Sky Currently: Platform Engineer at Siemens Germany Previously: Senior Developer / System Engineer at HRS Innovation Hub, Senior Developer at Cross Engage GMBH, Rocket Internet SE, Quandoo GMBH, Red Sky Wojciech Kozicki Product Manager Translating technology into business and vice versa. Wojciech brings over 15 years of experience in of project and product management across multiple industries. Translating technology into business and vice versa. Wojciech brings over 15 years of experience in of project and product management across multiple industries. Krzysztof Ebert Software architect Krzysztof has over 12 years of experience in software development in various environments. He has worked for startups, software houses, as well as big telco corporations. Krzysztof has over 12 years of experience in software development in various environments. He has worked for startups, software houses, as well as big telco corporations."
  ]
}