{
  "company": "getgroup.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 6
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.1111111111111111,
    "framing_surveillance": 0.2222222222222222,
    "framing_market": 0.6666666666666666,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "0": 6
    }
  },
  "sample_docs": [
    "Business Sectors Identity Management Digital Transformation Safe and Smart Cities Commercial Card Printing News & Events Events News Upcoming Events Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX GITEX Technology Week marks GET Group's most extensive event participation;… October 16, 2023 - October 20, 2023 Dubai, UAE Identity Week Asia IDENTITY WEEK is the most important identity event in Asia.… November 07, 2023 - November 08, 2023 Singapore, Singapore TRUSTECH One of the world's most specialized events, TRUSTECH by Secure… November 28, 2023 - November 30, 2023 Paris, France News GET Group's press releases, corporate news and other official communications. to go to the main News page. GET Group Achieves Great Success at Identity Week Europe 2023 GET Group, a leading provider of Identity management solutions, proudly… June 14, 2023 Amsterdam, Netherlands GET Group Holdings Excels at Secure Document Summit 2023 in Beijing, China GET Group Holdings, a global leader in secure Identifications, biometric… June 05, 2023 Beijing, China GET Group Celebrates Successful Participation at ID4AFRICA and Awarded as MOSIP Integrators GET Group, a leading provider of innovative technologies and secure… June 05, 2023 Cairo, Egypt Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX Technology Week marks GET Group's most extensive event participation;… IDENTITY WEEK is the most important identity event in Asia.… One of the world's most specialized events, TRUSTECH by Secure… GET Group's press releases, corporate news and other official communications. to go to the main News page. About History Team Resources Careers Quality Commitment CSR History GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. Founder Hassan Jamal Founder of GET Group Holdings Ltd GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Board of Directors Maysoon Jamal CEO of GET Group Holdings Ltd Hany Mohamed Elwakil Board Member Francois De Montaudouin Board Advisor Haytham Nassour Smart Solutions Business Unit Consultant Bahjat Nasser Board Member Top Management Resources Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. Media Downloads Careers Working at GET Group opens up a broad range of possibilities for candidates from various disciplines and specializations, including management, information technology, sales, software development, and others. Join our energetic team and take your career on a different path. to go to the main Careers page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. About History Team Resources Careers Quality Commitment This page does not exist or the link is incorrect. to go back to the homepage.",
    "Business Sectors Identity Management Digital Transformation Safe and Smart Cities Commercial Card Printing News & Events Events News Upcoming Events Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX GITEX Technology Week marks GET Group's most extensive event participation;… October 16, 2023 - October 20, 2023 Dubai, UAE Identity Week Asia IDENTITY WEEK is the most important identity event in Asia.… November 07, 2023 - November 08, 2023 Singapore, Singapore TRUSTECH One of the world's most specialized events, TRUSTECH by Secure… November 28, 2023 - November 30, 2023 Paris, France News GET Group's press releases, corporate news and other official communications. to go to the main News page. GET Group Achieves Great Success at Identity Week Europe 2023 GET Group, a leading provider of Identity management solutions, proudly… June 14, 2023 Amsterdam, Netherlands GET Group Celebrates Successful Participation at ID4AFRICA and Awarded as MOSIP Integrators GET Group, a leading provider of innovative technologies and secure… June 05, 2023 Cairo, Egypt GET Group Holdings Excels at Secure Document Summit 2023 in Beijing, China GET Group Holdings, a global leader in secure Identifications, biometric… June 05, 2023 Beijing, China Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX Technology Week marks GET Group's most extensive event participation;… IDENTITY WEEK is the most important identity event in Asia.… One of the world's most specialized events, TRUSTECH by Secure… GET Group's press releases, corporate news and other official communications. to go to the main News page. About History Team Resources Careers Quality Commitment CSR History GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. Founder Hassan Jamal Founder of GET Group Holdings Ltd GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Board of Directors Maysoon Jamal CEO of GET Group Holdings Ltd Hany Mohamed Elwakil Board Member Francois De Montaudouin Board Advisor Haytham Nassour Smart Solutions Business Unit Consultant Bahjat Nasser Board Member Top Management Resources Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. Media Downloads Careers Working at GET Group opens up a broad range of possibilities for candidates from various disciplines and specializations, including management, information technology, sales, software development, and others. Join our energetic team and take your career on a different path. to go to the main Careers page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. About History Team Resources Careers Quality Commitment This page does not exist or the link is incorrect. to go back to the homepage.",
    "Business Sectors Identity Management Digital Transformation Safe and Smart Cities Commercial Card Printing News & Events Events News Upcoming Events Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX GITEX Technology Week marks GET Group's most extensive event participation;… October 16, 2023 - October 20, 2023 Dubai, UAE Identity Week Asia IDENTITY WEEK is the most important identity event in Asia.… November 07, 2023 - November 08, 2023 Singapore, Singapore TRUSTECH One of the world's most specialized events, TRUSTECH by Secure… November 28, 2023 - November 30, 2023 Paris, France News GET Group's press releases, corporate news and other official communications. to go to the main News page. GET Group Achieves Great Success at Identity Week Europe 2023 GET Group, a leading provider of Identity management solutions, proudly… June 14, 2023 Amsterdam, Netherlands GET Group Holdings Excels at Secure Document Summit 2023 in Beijing, China GET Group Holdings, a global leader in secure Identifications, biometric… June 05, 2023 Beijing, China GET Group Celebrates Successful Participation at ID4AFRICA and Awarded as MOSIP Integrators GET Group, a leading provider of innovative technologies and secure… June 05, 2023 Cairo, Egypt Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX Technology Week marks GET Group's most extensive event participation;… IDENTITY WEEK is the most important identity event in Asia.… One of the world's most specialized events, TRUSTECH by Secure… GET Group's press releases, corporate news and other official communications. to go to the main News page. About History Team Resources Careers Quality Commitment CSR History GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. Founder Hassan Jamal Founder of GET Group Holdings Ltd GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Board of Directors Maysoon Jamal CEO of GET Group Holdings Ltd Hany Mohamed Elwakil Board Member Francois De Montaudouin Board Advisor Haytham Nassour Smart Solutions Business Unit Consultant Bahjat Nasser Board Member Top Management Resources Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. Media Downloads Careers Working at GET Group opens up a broad range of possibilities for candidates from various disciplines and specializations, including management, information technology, sales, software development, and others. Join our energetic team and take your career on a different path. to go to the main Careers page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. About History Team Resources Careers Quality Commitment In 1986, the late Hasan Fehmi Jamal founded GET Group in Oman as Al-Madina Development & Supply. تأسست الشركة تحت اسم \"شركة المدينة للتطوير والتجهيزات\" على يدي الراحل حسن فهمي جمال في سلطنة عمان سنة 1986. One of the early projects that GET Group handled was developing a document imaging and archiving application for the Royal Oman Police (ROP Hospital) patient record systems in 1991. Other projects followed from then on, such as programs for the issuance of the Omani National ID, the Omani Driving License and various other ID projects. At that time, GET Group provided a manual laminator incorporating special photo die-cut devices, which was eventually replaced by digital video printers that capture photos using photo and video cameras integrated into the workstation. كان أحد أول المشروعات في مسيرة مجموعة جي إي تي هو تطوير نظام لتصوير وأرشفة الملفات الطبية للمرضى بمستشفى شرطة عمان السُلطانية سنة 1991. تبع ذلك عددًا كبيرًا من المشروعات في شتى المجالات، مثل برامج إصدار بطاقات الهوية العمانية، ورخصة القيادة العمانية، وغيرها. قامت مجموعة جي إي تي حينها بتطوير نظام لتغليف البطاقات يدويًا، يضم تقنيات لقص الصور وإدماجها بالبطاقات التعريفية،… By 1993, with the help of its technology partner Toppan, GET Group had developed the first digital plastic card printer solution in the Middle East – the CP2000 Toppan ID card printer, which was a larger size printer using dye-sublimation technology with secure registered holographic lamination. This eventually led to the development of the desktop version – the CP1000 Toppan ID card printer, which helped GET Group secure the contract for the UAE's Dubai Police driving license (the Gold License), Abu Dhabi Police driving license, oil sector access cards, weapon cards and Ministry of Health cards. وبعد توقيع شراكة مع الشركة اليابانية الرائدة توبان Toppan، قامت مجموعة جي إي تي بتطوير وطرح أول طابعة رقمية للبطاقات البلاستيكية في الشرق الأوسط، واسمها CP2000 Toppan ID Card Printer، والتي كانت كبيرة الحجم بعض الشيء، وتعتمد تقنية Dye Sublimation في الطباعة على أغلفة أمنية رقيقة تحمل تصميمات هولوغرافية مسجّلة. أعقب ذلك تطوير النسخة… By 1997, GET Group had moved from the dye-sublimation print process to the more sophisticated pigment ink technology with the MP300 G, which was utilized for passport-issuing projects of the USA, Canada, New Zealand and other countries. Similarly, with ID card printers GET Group migrated from CP1000's dye-sublimation to CP300's pigment ink technology, securing in the process the contract for Qatar's National ID card. انتقلت مجموعة جي إي تي في هذه السنة إلى تطوير تقنياتها للطباعة، وقررت الابتعاد عن الأسلوب التقليدي Dye Sublimation التقنية الأحدث والأكثر تطورًا باستخدام الأحبار البيجمنتية الصلبة، والتي تم استخدامها في النسخة المعدلة من الطابعة MP300 G التي تم استخدامها لإصدار جوازات سفر الولايات المتحدة الأمريكية وكندا ونيوزيلندا وعددًا من الدول الأخرى، وقامت جي إي تي بدمج تقنية الطباعة ذاتها في نسخة مطورة من طابعة CP1000 للبطاقات، واستخدمت الطابعة الجديدة CP300 لإصدار بطاقة الهوية في دولة قطر. In 1998, GET Group pioneered the concept of SmartForms, a 2D barcode-enabled form that facilitates the collection and submission of data for 100% accurate results. It allowed companies and typing centers to make online transactions and payments to the UAE's Ministry of Labor. SmartForms was the first of a number of solutions developed by GET Group for progressive government organizations and departments to automate and speed up 'Government-to-Citizen' transactions. في سنة 1998 قامت جي إي تي بتطوير منظومة المستندات الذكية SmartForms، وهي استمارة ثنائية الأبعاد بها باركود وتستخدم لجمع البيانات وحفظها بدقة، مما أتاح للشركات ومكاتب الطباعة وإنجاز المعاملات تنفيذ المعاملات الإلكترونية لوزارة العمل الإماراتية ودفع رسومها؛ وأصبح النظام الجديد أول الحلول البرمجية الذكية التي طورتها المجموعة للاستخدام من قبل الحكومات بهدف أتمتة وتسريع إنجاز المعاملات والإجراءات الرسمية. By the year 2000, GET Group had developed a 600dpi digital MRP passport printer – the E2000, which was implemented in Canada, Malawi, Malaysia, Mauritius, South Korea and Tanzania. Two years later in 2002, GET Group developed the CP400 ID Card Printer, which led to the US Department of Defense (DOD) contract award, with 2,000 printers installed worldwide, issuing more than 10 million Common Access Cards (CAC). مع حلول عام 2000، طورت جي إي تي طابعة لجوازات السفر المقروءة آليًا لطباعة الصور والبيانات بدقة 600 نقطة لكل بوصة، وحملت الاسم التجاري E2000، وتم استخدامها في برامج إصدار جوازات السفر في كندا ومالاوي وماليزيا وموريشيوس وكوريا الجنوبية وتنزانيا. في سنة 2002، طورت المجموعة طابعة CP400 للبطاقات، التي تم اعتمادها رسميًا لدى وزارة الدفاع الأمريكية، وتم نشر 2000 طابعة في مقار الوزارة في كل أنحاء العالم، حيث استخدمت اصدار بطاقات الدخول الخاصة Common Access Cards. In 2001, GET Group introduced the concept of electronic payment in the UAE by implementing the innovative e-Dirham solution, which is still used to pay for various government services using smart cards. This was the Group's first milestone in the field of smart solutions. The national electronic payment platform, eDirham, eliminated the overheads of cash management and ensured effective protection against fraud. The combination of e-Dirham and SmartForms gave rise to another innovation by GET Group, that of the e-Stamp. في سنة 2001 طورت جي إي تي أنظمة الدفع الإلكتروني في دولة الإمارات العربية المتحدة، وذلك من خلال منظومة الدرهم الإلكتروني، الذي ما زالت قيد الاستخدام حتى اليوم لدفع رسوم المعاملات الحكومية في الإمارات عبر بطاقات ذكية خاصة. كان هذا المشروع هو من النجاحات الهائلة المبكرة للمجموعة، حيث سهل الدرهم الإلكتروني عددًا كبيرًا من الإجراءات وساهم في خفض التكاليف المترتبة على حفظ الأموال في صورتها النقدية واستخدامها في المعاملات، كما… The year 2003 saw GET Group make a major move into the latest ePassport technology, having enhanced its E2000 printer with RFID encoding to print and personalize ePassports in compliance with ICAO Document 9303 (6th edition) for Electro-Machine-Readable Travel Documents (eMRTD) – Passports & IDs. شهد عام 2003 تحقيق جي إي تي لقفزة كبيرة في تقنيات إصدار جوازات السفر الإلكترونية، حيث أضفت تحسينات على طابعة E2000 بدمجها لوحدة تشفير شرئح RFID بالطابعة لتشفير وطباعة جوازات السفر بالتوافق مع مواصفات منظمة ICAO المنصوص عليها بمستند 9303 لمواصفات جوازات السفر وبطاقات الهوية الإلكترونية والمقروءة آليًا. In the same year, building on its Intelligent Character Recognition (ICR), which recognizes hand-written or machine-printed marks/characters on forms, GET Group developed the Census Management System. Achieving 100% accuracy in timely data processing of huge numbers of collected census sheets, the solution was successfully implemented at Egypt's Central Agency for Public Mobilization and Statistics (CAPMAS) - the… A year later in 2004, GET Group started work on upgrading South Korea's E2000 printers with RFID encoders for the issuance of the first ePassports on the E2000 printer. In 2007, a second version of the E2000 printer was developed which was later renamed the eP600 printer. بدأت جي إي تي سنة 2004 في العمل على تطوير طابعات E2000 لجوازات السفر والتي كانت قيد الاستخدام لدى حكومة كوريا الجنوبية، وأضافت إليها وحدات لتشفير شرائح RFID، واستخدمت لإصدار أول جوازات سفر إلكترونية. وفي سنة 2007 أضافت المجموعة المزيد من التعديلات، وأطلقت طابعة جوازات السفر eP600. In the same year, GET Group extended its e-payment offerings by developing the comprehensive Electronic Bill Presentment and Payment solution (EBPP). Starting as a limited pilot for paying landline bills in Syria, the solution later expanded into a nationwide e-Payment platform continuously providing electronic payment for different bills and services for both the public and private… In 2005, GET Group developed a comprehensive Card Management System (CMS) to manage the issuance, post-issuance and administration requirements for different types of cards. GET Group's CMS has capably complemented the Group's e-Payment and e-Community solutions. في سنة 2005 طورت جي إي تي نظامًا شاملًا لإدارة عمليات الإصدار والدعم فني اللازمة لبرامج إصدار الأنواع المختلفة للبطاقاتCMS . يتكامل نظام CMS مع أنظمة مجموعة جي إي تي للدفع الإلكتروني والبطاقة التعريفية الموحدة.",
    "Business Sectors Identity Management Digital Transformation Safe and Smart Cities Commercial Card Printing News & Events Events News Upcoming Events Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX GITEX Technology Week marks GET Group's most extensive event participation;… October 16, 2023 - October 20, 2023 Dubai, UAE Identity Week Asia IDENTITY WEEK is the most important identity event in Asia.… November 07, 2023 - November 08, 2023 Singapore, Singapore TRUSTECH One of the world's most specialized events, TRUSTECH by Secure… November 28, 2023 - November 30, 2023 Paris, France News GET Group's press releases, corporate news and other official communications. to go to the main News page. GET Group Achieves Great Success at Identity Week Europe 2023 GET Group, a leading provider of Identity management solutions, proudly… June 14, 2023 Amsterdam, Netherlands GET Group Holdings Excels at Secure Document Summit 2023 in Beijing, China GET Group Holdings, a global leader in secure Identifications, biometric… June 05, 2023 Beijing, China GET Group Celebrates Successful Participation at ID4AFRICA and Awarded as MOSIP Integrators GET Group, a leading provider of innovative technologies and secure… June 05, 2023 Cairo, Egypt Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX Technology Week marks GET Group's most extensive event participation;… IDENTITY WEEK is the most important identity event in Asia.… One of the world's most specialized events, TRUSTECH by Secure… GET Group's press releases, corporate news and other official communications. to go to the main News page. About History Team Resources Careers Quality Commitment CSR History GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. Founder Hassan Jamal Founder of GET Group Holdings Ltd GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Board of Directors Maysoon Jamal CEO of GET Group Holdings Ltd Hany Mohamed Elwakil Board Member Francois De Montaudouin Board Advisor Haytham Nassour Smart Solutions Business Unit Consultant Bahjat Nasser Board Member Top Management Resources Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. Media Downloads Careers Working at GET Group opens up a broad range of possibilities for candidates from various disciplines and specializations, including management, information technology, sales, software development, and others. Join our energetic team and take your career on a different path. to go to the main Careers page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. About History Team Resources Careers Quality Commitment Business Sectors Identity Management Digital Transformation Safe and Smart Cities Commercial Card Printing News & Events Events News Upcoming Events Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX GITEX Technology Week marks GET Group's most extensive event participation;… October 16, 2023 - October 20, 2023 Dubai, UAE Identity Week Asia IDENTITY WEEK is the most important identity event in Asia.… November 07, 2023 - November 08, 2023 Singapore, Singapore TRUSTECH One of the world's most specialized events, TRUSTECH by Secure… November 28, 2023 - November 30, 2023 Paris, France News GET Group's press releases, corporate news and other official communications. to go to the main News page. GET Group Achieves Great Success at Identity Week Europe 2023 GET Group, a leading provider of Identity management solutions, proudly… June 14, 2023 Amsterdam, Netherlands GET Group Holdings Excels at Secure Document Summit 2023 in Beijing, China GET Group Holdings, a global leader in secure Identifications, biometric… June 05, 2023 Beijing, China GET Group Celebrates Successful Participation at ID4AFRICA and Awarded as MOSIP Integrators GET Group, a leading provider of innovative technologies and secure… June 05, 2023 Cairo, Egypt Find out about exhibitions, trade shows, conferences and conventions GET Group is participating in. to go to the main Events page, or browse our Photo Gallery. GITEX Technology Week marks GET Group's most extensive event participation;… IDENTITY WEEK is the most important identity event in Asia.… One of the world's most specialized events, TRUSTECH by Secure… GET Group's press releases, corporate news and other official communications. to go to the main News page. About History Team Resources Careers Quality Commitment CSR History GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. Founder Hassan Jamal Founder of GET Group Holdings Ltd GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Board of Directors Maysoon Jamal CEO of GET Group Holdings Ltd Hany Mohamed Elwakil Board Member Francois De Montaudouin Board Advisor Haytham Nassour Smart Solutions Business Unit Consultant Bahjat Nasser Board Member Top Management Resources Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. Media Downloads Careers Working at GET Group opens up a broad range of possibilities for candidates from various disciplines and specializations, including management, information technology, sales, software development, and others. Join our energetic team and take your career on a different path. to go to the main Careers page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. GET Group's history spans more than 35 years of milestones, awards, partnerships and many achievements. Since its foundation in 1986, the Group has established and maintained a prestigious reputation in the fields of security printing, smart solutions, and, more recently, robotics and automation. Today, GET Group employs more than 1,000 professionals in five continents, with country representation offices in major economic and technological hubs around the world. to go to the main History page. GET Group was founded in 1986 by the late Hassan Jamal, an exceptionally talented entrepreneur whose innovative ideas to solve critical identification verification problems revolutionized the security document printing industry and brought new solutions to the IT industry. Access the Media page to watch GET Group's event participation, award ceremonies, highlights and solution overviews. Access the Downloads page to download GET Group's latest marketing brochures, flyers, whitepapers and case studies. to go to the main Resources page. There are currently no open vacancies. Please visit this page again to stay up-to-date with career opportunities at GET Group. About History Team Resources Careers Quality Commitment If you have any queries with reference to your personal data or want to file a complaint, please feel free to contact our Data Protection Officers by filling the following form.",
    "Premises and Community Management Identity Management With over 40 years of experience working alongside governments worldwide, GET Group has developed a wide-ranging collection of identity management solutions that span the entire process of document issuance. This includes enrollment, post-sales support, and all stages in between. Their offerings encompass cutting-edge personalization printers, digital identity systems, secure document management systems, and exclusive printing technologies. GET Group's wealth of experience and comprehensive portfolio cater to the specific requirements of governments seeking secure and reliable identity management solutions. More Details Digital Transformation The system offers fully customizable and secure solutions in the most efficient way. It also empowers enterprises with the complete set of service-centric tools to effectively measure, manage, and optimize performance. More Details Law Enforcement Through decades of collaboration with the public and private sectors, GET Group has developed a keen understanding of the various security threats that face governments, as well as the technical, operational, and budgetary challenges that complicate the pursuit of reliable security systems that help protect citizens, assets, infrastructure, and borders. GET Group has thus developed its Smart Cities solutions, addressing an expanded range of security and management issues in urban and rural environments, and empowering governments with scalable, customizable, and easily integrated solutions that assist in the critical functions of law enforcement, surveillance, access control, traffic management and asset control. More Details Premises and Community Management The protection of people and assets is a critical concern for all organizations. GET Group combines the latest in security technologies to provide the right solution tailored to the security, safety, and privacy needs of each customer. For a complete protection, GET Group offers a comprehensive end-to-end solution for people and vehicle access control. More Details With over 40 years of experience working alongside governments worldwide, GET Group has developed a wide-ranging collection of identity management solutions that span the entire process of document issuance. This includes enrollment, post-sales support, and all stages in between. Their offerings encompass cutting-edge personalization printers, digital identity systems, secure document management systems, and exclusive printing technologies. GET Group's wealth of experience and comprehensive portfolio cater to the specific requirements of governments seeking secure and reliable identity management solutions. The system offers fully customizable and secure solutions in the most efficient way. It also empowers enterprises with the complete set of service-centric tools to effectively measure, manage, and optimize performance. Through decades of collaboration with the public and private sectors, GET Group has developed a keen understanding of the various security threats that face governments, as well as the technical, operational, and budgetary challenges that complicate the pursuit of reliable security systems that help protect citizens, assets, infrastructure, and borders. GET Group has thus developed its Smart Cities solutions, addressing an expanded range of security and management issues in urban and rural environments, and empowering governments with scalable, customizable, and easily integrated solutions that assist in the critical functions of law enforcement, surveillance, access control, traffic management and asset control. Premises and Community Management The protection of people and assets is a critical concern for all organizations. GET Group combines the latest in security technologies to provide the right solution tailored to the security, safety, and privacy needs of each customer. For a complete protection, GET Group offers a comprehensive end-to-end solution for people and vehicle access control. NEW Verifier Solutions for mDL Seamless Verification is here More Details NEW Verifier Solutions for mDL Seamless Verification is here GET MOBILE ID Your ID is Going Global More Details Verify your ID with a simple SCAN Featured Industry Transportation As cities become more populated, car ownership increases, putting a strain on urban traffic systems. To address this, solutions are needed that improve awareness, simplify the system, and reduce workload. The goal is to ensure the safe and responsible movement of all road users, maximize the utilization of transportation resources, and respond quickly to traffic incidents. GET offers solutions by adding enhanced visibility and intelligence to traffic systems through its integrated solutions such as Automatic Vehicle Identification Systems and Electronic Toll Collections. The transportation industry is the backbone of global connectivity and plays a pivotal role in facilitating economic growth and societal development. At GET Group, we recognize the significance of this industry and are committed to providing innovative solutions that enhance efficiency, reliability, and safety in transportation operations. More Details As cities become more populated, car ownership increases, putting a strain on urban traffic systems. To address this, solutions are needed that improve awareness, simplify the system, and reduce workload. The goal is to ensure the safe and responsible movement of all road users, maximize the utilization of transportation resources, and respond quickly to traffic incidents. GET offers solutions by adding enhanced visibility and intelligence to traffic systems through its integrated solutions such as Automatic Vehicle Identification Systems and Electronic Toll Collections. The transportation industry is the backbone of global connectivity and plays a pivotal role in facilitating economic growth and societal development. At GET Group, we recognize the significance of this industry and are committed to providing innovative solutions that enhance efficiency, reliability, and safety in transportation operations. Meet Us There Join us at global events to discover our innovative solutions for a safer and secure future. Discover More 7 days left from 07-10-2025 to 09-10-2025 Lusaka, Zambia Booth No. More Details 62 days left from 01-12-2025 to 03-12-2025 Kuala Lumpur, Malaysia Booth No. More Details 63 days left from 02-12-2025 to 04-12-2025 Paris, France Booth No. More Details Gallery Join us at global events to discover our innovative solutions for a safer and secure future. Our Solutions Identity Management Digital Transformation Law Enforcement Premises and Community Management Premises and Community Management Latest News Empowering Trusted ID Verification: GET Group's Future-Proof ISO 18013-5 Verifier for Seamless, Secure, and Worldwide Acceptance GET Group's Future-Proof ISO 18013-5 Verifier for Seamless, Secure, and Worldwide Acceptance As digital identity... 09-09-2025 Phoenix AZ, USA Read More Revolutionizing National ID Security: GET Group's Breakthrough Thermal Ribbons The Next-Gen Security Ribbons GET Group, a global pioneer in identity and security solutions, proudly... 24-04-2025 Dubai, UAE Read More GET Group Marks 21st Successful Participation at TRUSTECH 2024 GET Group is proud to announce the successful completion of its 21st participation at TRUSTECH,... 03-12-2024 Paris, France Read More Reach us Contact us Our Offices United Arab Emirates Egypt Qatar Saudi Arabia United States Canada Colombia China Featured Case Studies ADHAM ADHAM solution has helped revolutionize regular police vehicles into intelligent patrols, armed with advanced communication, analytics, and surveillance technology to adeptly address the complexities of enforcing traffic rules. Read More GET Group's Successful Integration as MOSIP Integrators GET Group has been awarded the prestigious role of integrators for the Modular Open Source Identity Platform. Read More Empowering Trusted ID Verification: GET Group's Future-Proof ISO 18013-5 Verifier for Seamless, Secure, and Worldwide Acceptance GET Group's Future-Proof ISO 18013-5 Verifier for Seamless, Secure, and Worldwide Acceptance As digital identity... Revolutionizing National ID Security: GET Group's Breakthrough Thermal Ribbons The Next-Gen Security Ribbons GET Group, a global pioneer in identity and security solutions, proudly... GET Group Marks 21st Successful Participation at TRUSTECH 2024 GET Group is proud to announce the successful completion of its 21st participation at TRUSTECH,... ADHAM solution has helped revolutionize regular police vehicles into intelligent patrols, armed with advanced communication, analytics, and surveillance technology to adeptly address the complexities of enforcing traffic rules. GET Group's Successful Integration as MOSIP Integrators GET Group has been awarded the prestigious role of integrators for the Modular Open Source Identity Platform. No records were found."
  ]
}