{
  "company": "getgroupna.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Leading system integrator for secure solutions that enhance Identity, Credential, and Access Management (ICAM) operations. From the US and Canadian Passport to the DoD Common Access Card, our printing technology has enhanced the security of identity documents across North America. We have personalized more travel documents and IDs than any other solutions provider and earned a reputation as a trusted partner to Governments worldwide. Since 1994, Global Enterprise Technologies Corp. (GET Group NA) has provided secure, advanced, and complete solutions that enhance citizen IDs and meet our diversified customer needs, while ensuring timely delivery with optimum quality standards served by a reliable, innovative, committed, flexible, and trusted work force. While doing so, we ensure that we maintain a long-term relationship with all our stakeholders based on integrity, trust, and respect. Our company brings together the most innovative technologies available in the market to provide high-end secure solutions that enhance Identity, Credential, and Access Management (ICAM) for: • US & Canadian Government Agencies • Motor Vehicle Agencies • State, Provincial and Local Government • Law Enforcement Agencies About GET Group North America Providing Custom and Secure Identity, Credential, and Access Management Solutions Balancing security, cost, quality and durability in a world where document fraud has become commonplace. See how GET responds to these challenges. Registration & Enrollment Solutions for Issuance of Secure Identification Documents GET NA delivers full solutions (including hardware and software) necessary for the registration and enrollment of individuals to issue secure documents such as driver's licenses, identification cards and passports. Our Registration solution facilitates the submission of biographical information, biometrics (photo, fingerprints and iris scan), supporting information and payment enabling our customers to conduct the following functions prior to issuing a document: This can include self-service registration components (web enabled and kiosk) to front load the application process. Our Enrollment solutions capture the applicant's biographic and biometric details that feed multiple customer processes such as adjudication, populating cardholder databases and document issuance. These processes require numerous industry peripherals such as identity document/card authentication and imaging devices, 1D/2D barcode readers, contact/contactless smart card and RFID readers, digital cameras, digital fingerprint devices, digital iris devices and signature pads. Implementation of Secure ID Programs from Start to Finish The development of personal identification documents is an extremely complex and exacting process: from the development of the card material and security features, the security design and secure production of cards and documents that are ready for personalization. For all these processes GET Secure ID Solutions provide our customers with in-depth experience and expertise developed through the implementation of identification programs around the world. Durable, Cost Effective Substrate Materials ID cards and passports are subject to many kinds of stress, which is why they need to be as durable as possible in order to resist physical tampering, external influences, wear and tear, chemicals, temperature fluctuations, environmental conditions, and UV radiation. Depending upon the intended lifetime of a specific document, GET NA bases its selection of credential/card body material that will meet or exceed the client expectations by providing the highest quality standards but also being cost effective and meeting internal profit requirements. In selecting the right substrate material, GET NA matches the requirements and interests of its customers. All of GET NA documents meet exacting physical and durability standards. Security-Enhancing Designs for Identification Documents When designing secure credentials, GET NA draws upon years of experience in document design and integration of security features. We assist our customers to design a secure document that delivers the right security features for their environment, blending the design with the intended personalized data. Our designers are experts at developing unique and highly secure credential designs that include counterfeit deterrent features, diffractive optically variable devices, secure laminates, specialty and security inks and other attributes to significantly enhance security. They are very familiar with card and document materials and manufacturing processes, thus are ideally suited to recommend the optimum combination of substrate, design and security features. Partnering in Advanced Production of Secure ID Cards, Passports, Driver's Licenses, and More Our partners' manufacturing facilities use the most technically advanced production equipment available today for secure credential, passport and smart card production. Their versatility and flexibility allows GET NA to deliver popular module sizes and configurations for both memory and microcontrollers. Unique Identification Personalization Systems The printer equipment required to personalize a secure document is equally as important as the security features and design considerations. Many technologies exist that cater to the different needs and requirements of the customer. Depending on the selected type (substrate) of the card (PVC, PET, or Polycarbonate), GET NA offers hardware that personalizes the document and adheres to the strict standards and life cycle of the documents by leveraging reverse thermal transfer and laser engraving technologies. In addition to application of photo and identifying information, our Personalization Systems will encode chips embedded in the documents with cardholder information and digital certificates. An exclusive GET NA offering is the CP500 printer, the worlds' only desktop 600 dpi pigment ink retransfer ID card-printing solution. It enables users to personalize contact and contactless ID cards, while incorporating unique pigment inks that offer the greatest level of resistance to wear and UV fading in the market thus maintaining color and integrity over time. GET NA also offers select laser engraving printers for personalization of polycarbonate cards in a centralized or a decentralized environment. This technology interfaces with a laser sensitive polymer layer inside the polycarbonate data page or card, absorbing the energy of a focused laser beam at the right wavelength. This results in the decomposition of the polymer around the laser focal point to produce a darkened area. The laser written information is located inside the card body and laser engraving is therefore considered to be forgery proof. Subject to customer requirements, GET NA is able to provide a full array of personalization equipment that supports large-scale high-volume issuance and over-the-counter and mid-size deployments. GET NA provides a comprehensive ID management system that addresses all the needs of credential issuing authorities for a complete, secure and integrated solution incorporating PKI capabilities based on BAC, and EAC functionalities. Its modular design allows for customization for all applications, and for easy expansion as the customer's requirements change. Complete Life-Cycle Operations Support for Secure Identification Projects GET NA provides innovative identification credentials (ID cards, driver's licenses and passports) and personalization technologies, addressing emerging technical and security challenges every day. We have implemented complex passport and identification projects worldwide, providing full implementation, project management, service and support – ensuring that our systems operate smoothly from day one. GET NA provides a full range of Operations Support to our clients. We provide specialized Subject Matter Experts that have a proven record of performance with stellar references to work with our government customers. We are certified under CMMI Level 3 and ISO 27001. Our Project Management Office leads our multi-disciplinary efforts, guiding our customers through the entire project life-cycle. Our team provides the full range of discovery, design, development, implementation, maintenance and support. To ensure the success of each project, our team carefully plans, implements, tests, and monitors performance – always seeking opportunities to further increase program performance. Additionally, we provide customer assessment and advisory support to ensure program success. Expert Network Systems Engineering Solutions As government agencies seek to leverage their use of credential technology to facilitate operations, the challenge of using strong authentication everywhere becomes more complex as infrastructures and authentication requirements become more dynamic. This is compounded by limits in design, compatibility, and functional requirements. GET NA Network Systems Engineering provides the credentials, controls, and device ecosystem to implement trust across users, devices, and services. This meets the challenges of the evolving threat landscape so agencies can continue to collaborate, communicate, and transact with confidence, and making it harder for attackers to exploit the weaknesses commonly found in traditional identity systems. Agencies can now rapidly deploy multi-use credentials through GET NA's converged access solutions, enabling the highest levels of trust where and when required without complexity. The foundation of GET NA's solution is a single universal identity credential that can be used to trust or securely access any resource — identity, premises or information. We provide a secure web portal to issue, manage, or revoke credentials, without the complexity and cost of internal deployments. GET NA analyzes plans and administers network infrastructure to leverage full capabilities of identification cards. We provide IT support for the design of integrated access management solutions that enable physical and logical access control. Additionally, we provide solutions to manage provisioning/access management. Our highly skilled and trained technicians design, install, and service integrated solutions from many leading providers. We utilize the most reliable and proven products in the industry to custom design the most effective solution based on the unique requirements of each of our customers. News and Upcoming Events for our latest news +1 781 890 6700 230 Third Ave. Waltham, MA 02451 USA Copyright ."
  ]
}