{
  "company": "grabango.com",
  "dominant_topics": [
    6,
    0,
    -1
  ],
  "topic_counts": {
    "6": 8,
    "0": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "6": "stripe, payments, think, really, payment",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.4285714285714285,
    "framing_surveillance": 0.0,
    "framing_market": 0.5714285714285714,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1,
      "6": 8
    }
  },
  "sample_docs": [
    "Grabango's mission is to eliminate lines, and save people time. How We Got Here Lines annoy us. They always have, so we decided to do something about it. We're a group of technology and retail experts that have come together to improve shopping for everyone. We use advanced technology to give you back your time. Continue to shop the way you are used to and, when done, feel free to simply walk out of the store. Where We Are Going Checkout-Free shopping has moved from science fiction into our modern present. As it becomes commonplace across retail brands, we will support all shoppers and retailers who want to use it. Meet the Executive Team Founder of Pandora Media (NYSE: P). Board Member of Blue Shield of California. Founder of Hydra Systems. Triple major in Computer Science, Mathematics, and Physics Cornell. Founder of Capius Consulting, financial due diligence. CFO Impact Justice. Protiviti, Arthur Andersen, Price Waterhouse, and SDG. MBA Stanford. Head of BD & Strategy for LendUp, SVP of BD for Citigroup. Emerging Payments (Retail Sector). Board Member, AirTouch-Globalstar. Economics UCSB. VP, Product & Engineering VP of Engineering & Product for Sight Machine, Scientist at Amgen. Ph.D. Washington University in St. Louis. Founder & CEO of Blindsight. Executive Director of the Center for Human-compatible AI. Director of Computer Vision at Amazon/A9. Ph.D. Harvard. Do the right thing, particularly when you don't have to. Think recklessly, but temper your actions with pragmatism. Hire the best people, and treasure them. Don't Live with Broken Have the courage to admit mistakes, and the urgency to correct them. Delight customers, both internal and external. for email alerts: Grabango Co.",
    "This has been compiled to better serve those who are concerned with how their 'Personally Identifiable Information' (PII) is being used online. PII, as described in US privacy law and information security, is information that can be used on its own or with other information to identify, contact, or locate a single person, or to identify an individual in context. Please read our carefully to get a clear understanding of how we collect, use, protect or otherwise handle your Personally Identifiable Information in accordance with our website. What personal information do we collect from the people that visit our blog, website or app? When registering on our site when requesting additional information, as appropriate, you may be asked to enter your email address or other details to help you gain access to more information about Grabango. When do we collect information? We collect information from you when you fill out a form or enter information on our site. How do we use your information? We may use the information we collect from you when you register or for our newsletter, respond to a survey or marketing communication, or use certain other site features in the following ways: To request periodic emails regarding our products and services. How do we protect your information? We only provide articles and information. We never ask for credit card numbers. We use regular Malware scanning. Your personal information is contained behind secured networks and is only accessible by a limited number of persons who have special access rights to such systems and are required to keep the information confidential. We implement a variety of security measures when a user enters, submits, or accesses their information to maintain the safety of your personal information. Do we use 'cookies'? We do not use cookies for tracking purposes. Third-party disclosure We do not sell, trade, or otherwise transfer to outside parties your Personally Identifiable Information. Third-party links We do not include or offer third-party products or services on our website. Google Google's advertising requirements can be summed up by Google's Advertising Principles . They are put in place to provide a positive experience for users. We have not enabled Google AdSense on our site, but we may do so in the future. California Online Privacy Protection Act CalOPPA is the first state law in the nation to require commercial websites and online services to post a . The law's reach stretches well beyond California to require any person or company in the United States (and conceivably the world) that operates websites collecting Personally Identifiable Information from California consumers to post a conspicuous on its website stating exactly the information being collected and those individuals or companies with whom it is being shared. Read more here . According to CalOPPA, we agree to the following: Users can visit our site anonymously. Once this is created, we will add a link to it on our home page or as a minimum, on the first significant page after entering our website. Our link includes the word 'Privacy' and can easily be found on the page specified above. You will be notified of any changes on our Page. Does our site allow third-party behavioral tracking? It's also important to note that we do not allow third-party behavioral tracking. COPPA (Children Online Privacy Protection Act) When it comes to the collection of personal information from children under the age of 13 years old, the Children's Online Privacy Protection Act (COPPA) puts parents in control. The Federal Trade Commission, United States' consumer protection agency, enforces the COPPA Rule, which spells out what operators of websites and online services must do to protect children's privacy and safety online. We do not specifically market to children under the age of 13 years old. Fair Information Practices The Fair Information Practices Principles form the backbone of privacy law in the United States and the concepts they include have played a significant role in the development of data protection laws around the globe. Understanding the Fair Information Practice Principles and how they should be implemented is critical to comply with the various privacy laws that protect personal information. In order to be in line with Fair Information Practices we will take the following responsive action, should a data breach occur: We will notify you via email within 21 business days of our confirming the existence and severity of such breach. We also agree to the Individual Redress Principle which requires that individuals have the right to legally pursue enforceable rights against data collectors and processors who fail to adhere to the law. This principle requires not only that individuals have enforceable rights against data users, but also that individuals have recourse to courts or government agencies to investigate and/or prosecute non-compliance by data processors. The CAN-SPAM Act is a law that sets the rules for commercial email, establishes requirements for commercial messages, gives recipients the right to have emails stopped from being sent to them, and spells out tough penalties for violations. We collect your email address in order to: • Send information, respond to inquiries, and/or other requests for Grabango related information. To be in accordance with CANSPAM, we agree to the following: Not use false or misleading subjects or email addresses. Identify the message as an advertisement in some reasonable way. Include the physical address of our business or site headquarters. Monitor third-party email marketing services for compliance, if one is used. Honor opt-out/unsubscribe requests quickly. Allow users to unsubscribe by using the link at the bottom of each email. If at any time you would like to unsubscribe from receiving future emails, email us at: Follow the instructions at the bottom of each email and/or write info@grabango.com and we will promptly remove you from ALL correspondence. Contacting Us If there are any questions regarding this , you may contact us at info@grabango.com for email alerts: Grabango Co.",
    "WATCH: Grabango aims to eliminate checkout lines in stores Grocery chain Giant Eagle taps Grabango to pilot checkout-free experiences Get In, Get Out: Grabango Brings Checkout-Free Tech to Large Grocers Computer Vision Firms Focus on Food Retail 'Massive wakeup call': Amazon Go is giving rise to vendors to help retailers go cashierless Grabango Raises $12M To Expand Product Development, Tech Deployments for email alerts: Grabango Co.",
    "Grabango cart receipt, view 1 .jpg Grabango options screen, view 1 .jpg Grabango options screen, view 2 .jpg Grabango options screen, view 3 .jpg Grabango receipt with auto-coupon .jpg Grabango two-person shopping .jpg Will Glaser CEO .jpg Ed Scheuer CFO .jpg Andrew Radlow VP of Sales & Marketing .jpg Mark Nitzberg Computer Vision Science .jpg Retailer Benefits to Going Checkout-Free The Future of Checkout-Free Shopping for email alerts: Grabango Co.",
    "Opportunity Grabango is a leading computer vision company that develops checkout-free shopper technology. We are a team of accomplished technology and commerce professionals working to forever change the way people interact with things. If you are interested in creating products that virtually every person on earth will benefit from; then we'd like to meet you. Grabango is a leading computer vision company that develops checkout-free shopper technology. We are a team of accomplished technology and commerce professionals working to forever change the way people interact with things. If you are interested in creating products that virtually every person on earth will benefit from; then we'd like to meet you. \"I love the team's unabashed excitement for tackling unsolved problems. I'm free to explore and experiment to find the best path forward.\" - Sahill \"Grabango is definitely the best place I've ever worked. Super smart people, the work is great and I really feel like everyone here is my friend.\" - Melissa \"Nowhere else have I personally been able to make such an impact toward fulfilling a company vision.\" - Hasan Join our collaborative, builder culture as we extend our leadership in computer vision for commerce. Grabango is looking for experts in select technology and commerce fields. We have high standards and understand the need to compete for top performers like you. We believe in shared ownership so everyone at the company benefits from Grabango's success. Each member of the executive team has enjoyed the rewards of at least one prior startup exit. Together they are guiding this business in a similar winning direction. We offer gold- and platinum-tier medical and dental benefits, with multiple options so you can select the plan that best fits your, and perhaps your family's, needs. Our offices are conveniently located near the Downtown Berkeley BART Station. We also offer tax-free commuter benefits for a variety of transportation and parking options. We've adopted a flexible time off policy. It's based on our experience trusting our team to properly balance the achievement of Grabango's mission with their personal life goals. Relax with colleagues and Grabango guests at one of the many bars and restaurants in the Downtown Berkeley area. Take a look at our current job openings. If there is not a match, come back soon as we are growing quickly! for email alerts: Grabango Co."
  ]
}