{
  "company": "grandingworld.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 106,
    "-1": 16
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 16,
      "0": 106
    }
  },
  "sample_docs": [
    "bernice@granding.com +86-15656977869 Facebook Twitter Youtube Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector Products 显示 1-12 个结果(共 14 个结果) 12v Stainless Steel Push Button , Exit Push Button For Fingerprint And Rfid Access Control 阅读更多 Access Control Push Button With LED , Door Release Buttons For Public Authorities Bank 阅读更多 Access Control Push Button With NO / NC / COM For Access Control System , Plastic Fireproof Material 阅读更多 Aluminium Alloy Panel Push Button For Access Control And Multi-Door Controller 阅读更多 Fireproof Plastic Cover Access Control Exit Button For Department Stores 阅读更多 Nickel – Plated Copper Access Control Push Button , Weatherproof Push To Exit Button 阅读更多 Nickel – Plated Copper Door Exit Push Button For Access Control Press To Exit 阅读更多 One Touch Sensitive Light Switch IR Tech Access Control Door Release Button 阅读更多 Plastic Fireproof Touched Switch Push Button For Access Control With NO / NC / COM 阅读更多 Push To Release Button Door Push Button For Access Control System With LED 阅读更多 Stainless steel Exit Push Button For Access Control With Nickel – Plated Copper Button 阅读更多 Touched Push To Exit Button Switch For Access Control System And Door Controller 阅读更多 Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector 显示 1-12 个结果(共 14 个结果) 12v Stainless Steel Push Button , Exit Push Button For Fingerprint And Rfid Access Control 阅读更多 12v Stainless Steel Push Button , Exit Push Button For Fingerprint And Rfid Access Control Access Control Push Button With LED , Door Release Buttons For Public Authorities Bank 阅读更多 Access Control Push Button With LED , Door Release Buttons For Public Authorities Bank Access Control Push Button With NO / NC / COM For Access Control System , Plastic Fireproof Material 阅读更多 Access Control Push Button With NO / NC / COM For Access Control System , Plastic Fireproof Material Aluminium Alloy Panel Push Button For Access Control And Multi-Door Controller 阅读更多 Aluminium Alloy Panel Push Button For Access Control And Multi-Door Controller Fireproof Plastic Cover Access Control Exit Button For Department Stores 阅读更多 Fireproof Plastic Cover Access Control Exit Button For Department Stores Nickel – Plated Copper Access Control Push Button , Weatherproof Push To Exit Button 阅读更多 Nickel – Plated Copper Access Control Push Button , Weatherproof Push To Exit Button Nickel – Plated Copper Door Exit Push Button For Access Control Press To Exit 阅读更多 Nickel – Plated Copper Door Exit Push Button For Access Control Press To Exit One Touch Sensitive Light Switch IR Tech Access Control Door Release Button 阅读更多 One Touch Sensitive Light Switch IR Tech Access Control Door Release Button Plastic Fireproof Touched Switch Push Button For Access Control With NO / NC / COM 阅读更多 Plastic Fireproof Touched Switch Push Button For Access Control With NO / NC / COM Push To Release Button Door Push Button For Access Control System With LED 阅读更多 Push To Release Button Door Push Button For Access Control System With LED Stainless steel Exit Push Button For Access Control With Nickel – Plated Copper Button 阅读更多 Stainless steel Exit Push Button For Access Control With Nickel – Plated Copper Button Touched Push To Exit Button Switch For Access Control System And Door Controller 阅读更多 Touched Push To Exit Button Switch For Access Control System And Door Controller Products Turnstile Access Control System Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Quick link Menu Contact us bernice@granding.com +8615656977869 Facebook Twitter Youtube Turnstile Access Control System Guard Tour Patrol System RFID Card Access Control System",
    "bernice@granding.com +86-15656977869 Facebook Twitter Youtube Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector Products 显示 13-14 个结果(共 14 个结果) US Standard Infrared Door Push Button For Access Control Release Button 阅读更多 Waterproof Push button exit switch For Access Control With Hand – Shaped Symbol 阅读更多 Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector 显示 13-14 个结果(共 14 个结果) US Standard Infrared Door Push Button For Access Control Release Button 阅读更多 US Standard Infrared Door Push Button For Access Control Release Button Waterproof Push button exit switch For Access Control With Hand – Shaped Symbol 阅读更多 Waterproof Push button exit switch For Access Control With Hand – Shaped Symbol Products Turnstile Access Control System Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Quick link Menu Contact us bernice@granding.com +8615656977869 Facebook Twitter Youtube Turnstile Access Control System Guard Tour Patrol System RFID Card Access Control System",
    "bernice@granding.com +86-15656977869 Facebook Twitter Youtube Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector Products 搜索结果 3: 60mW Rechargeable Handheld Metal Detector 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 Product Category Turnstile Access Control System Swing Barrier Turnstile Tripod Turnstile Full Height Turnstile Flap Barrier Turnstile Waist Height Trurnstile Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Facial Recognition System Smart Door Lock Door Exit Button Proximity Card Hand Held Metal Detector 60mW Rechargeable Handheld Metal Detector 阅读更多 60mW Rechargeable Handheld Metal Detector Compact Size Portable Handheld Metal Detector ZK-D180 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S Products Turnstile Access Control System Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Quick link Menu Contact us bernice@granding.com +8615656977869 Facebook Twitter Youtube Turnstile Access Control System Guard Tour Patrol System RFID Card Access Control System",
    "bernice@granding.com +86-15656977869 Facebook Twitter Youtube 60mW Rechargeable Handheld Metal Detector 60mW Rechargeable Handheld Metal Detector ZK-D300, The high sensitivity hand-held metal detector for top-class security applications. Combines high reliability and ergonomics with advanced detection and operator signaling features. Share: ZK-D300, The high sensitivity hand-held metal detector for top-class security applications. Combines high reliability and ergonomics with advanced detection and operator signaling features. Product Description 60mW Rechargeable Handheld Metal Detector ZK-D300, The high sensitivity hand-held metal detector for top-class security applications. Combines high reliability and ergonomics with advanced detection and operator signaling features. ZK-D300 Handheld Metal Detector Feature: High-tech like appearance and strong anti-interference ability. Easy to use and carry. High sensitivity. Sound and light alarm, connects to external earphone. Three alarm modes: sound, vibration and sound. Uses AA battery type which is easily available, and can work continuously for more than 70 hours. In standby mode for more than 2 minutes, it will sleep automatically, and in case of more than 10 minutes of inactivity, it will shut down. It has charging and low-power indicators. Specification ZK-D300 Handheld Metal Detector Parameter: Dimension 360(L)x82.5(W)x42.5(H)mm Weight 270g Power Supply Two AA batteries Power Consumption <60mW Alarm Sound&light alarm/Vibration&light alarm Material The cover is mainly ABS and rubber Operating Temperature -10°C~+40°C (Relative Humidity: 0~95%) Product Display 1. Indicator (alarm, charging, low battery, etc.) 2. Volume hole 3. Key combination 4. Handle 5. USB port 6. Battery cover 7. Detection area 8. Battery cover screw 9. Hole for hanging rope FAQ FAQ 1. Q: Do you have any MOQ limit? A: For your convenience, we can accept 1 pc. But we offer better price for big order. 2. Q: What if the products have problems? A: We offer a 1-year warranty except for the man-made damage. And we can offer any technical support for operation problems. 3. Q: Can the device's language be in other languages? A: Yes, of course. Multi-language can be customized. Our device supports English, Spanish, Portugal, Russian, Arabic, French, German, etc. 4. Q: What about the Payment? A: You can pay for the order via T/T, Western Union, PayPal, Alibaba payment, L/C, DP 5. Q: How do you ship the goods? A: Small order: Express like DHL, UPS, TNT, FedEx Big order: By Sea or by airline. 6. Q: How can I get a sample to check your quality? A: You can require samples to check our quality. You should pay for the sample and freight cost, if you order more than 500 pcs, we return the sample cost to you. 7. Q: What about the lead time for mass production? A: small order: 1 week after payment Big order: 2-3 weeks. 8. Q: Can you supply the relevant documentation? Yes, we can provide most documentation including Certificates of Analysis / Conformance; Insurance; Origin, and other export documents where required 9. Q: Where can I get the price? A: We usually quote within 24 hours after we get your inquiry. If you are very urgent to get the price, please call us, in your Related Products 相关产品 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 阅读更多 60mW Rechargeable Handheld Metal Detector ZK-D300, The high sensitivity hand-held metal detector for top-class security applications. Combines high reliability and ergonomics with advanced detection and operator signaling features. ZK-D300 Handheld Metal Detector Feature: High-tech like appearance and strong anti-interference ability. Easy to use and carry. Sound and light alarm, connects to external earphone. Three alarm modes: sound, vibration and sound. Uses AA battery type which is easily available, and can work continuously for more than 70 hours. In standby mode for more than 2 minutes, it will sleep automatically, and in case of more than 10 minutes of inactivity, it will shut down. It has charging and low-power indicators. ZK-D300 Handheld Metal Detector Parameter: 1. Indicator (alarm, charging, low battery, etc.) 2. Volume hole 3. Key combination 4. Handle 5. USB port 6. Battery cover 7. Detection area 8. Battery cover screw 9. Hole for hanging rope 1. Q: Do you have any MOQ limit? A: For your convenience, we can accept 1 pc. But we offer better price for big order. 2. Q: What if the products have problems? A: We offer a 1-year warranty except for the man-made damage. And we can offer any technical support for operation problems. 3. Q: Can the device's language be in other languages? A: Yes, of course. Multi-language can be customized. Our device supports English, Spanish, Portugal, Russian, Arabic, French, German, etc. 4. Q: What about the Payment? A: You can pay for the order via T/T, Western Union, PayPal, Alibaba payment, L/C, DP 5. Q: How do you ship the goods? A: Small order: Express like DHL, UPS, TNT, FedEx Big order: By Sea or by airline. 6. Q: How can I get a sample to check your quality? A: You can require samples to check our quality. You should pay for the sample and freight cost, if you order more than 500 pcs, we return the sample cost to you. 7. Q: What about the lead time for mass production? A: small order: 1 week after payment Big order: 2-3 weeks. 8. Q: Can you supply the relevant documentation? Yes, we can provide most documentation including Certificates of Analysis / Conformance; Insurance; Origin, and other export documents where required 9. Q: Where can I get the price? A: We usually quote within 24 hours after we get your inquiry. If you are very urgent to get the price, please call us, in your 相关产品 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S Compact Size Portable Handheld Metal Detector ZK-D180 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 Products Turnstile Access Control System Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Quick link Menu Contact us bernice@granding.com +8615656977869 Facebook Twitter Youtube Turnstile Access Control System Guard Tour Patrol System RFID Card Access Control System",
    "bernice@granding.com +86-15656977869 Facebook Twitter Youtube Compact Size Portable Handheld Metal Detector ZK-D180 Compact Size Portable Handheld Metal Detector ZK-D180 ZK-D180 is the compact size hand held metal detector featured with a detection indicator right in the middle of its main body detecting the sizes of detected objects and visualizing in diferent color (Green to Red), a perfect tool for speeding up security process. The controllable sound and vibration efect is another highlight, security guard can identify the potential dangerous quietly. Share: ZK-D180 is the compact size hand held metal detector featured with a detection indicator right in the middle of its main body detecting the sizes of detected objects and visualizing in diferent color (Green to Red), a perfect tool for speeding up security process. The controllable sound and vibration efect is another highlight, security guard can identify the potential dangerous quietly. Product Description Compact Size Portable Handheld Metal Detector ZK-D180 ZK-D180 is the compact size hand held metal detector featured with a detection indicator right in the middle of its main body detecting the sizes of detected objects and visualizing in diferent color (Green to Red), a perfect tool for speeding up security process. The controllable sound and vibration efect is another highlight, security guard can identify the potential dangerous quietly. ZK-D180 Handheld Metal Detector Feature: Compact size , Portable; High sensitivity, able to detect object as small as a stamp; Visualize metal detection indicator; Rechargeable battery and charger; Extra-long working hours with single charge (Up to 40 working hours); Controllable sound and vibration efect; Low sensitivity mode, filter out all the small and tiny object; Low battery voltage (7V) come with same detection range. Specification ZK-D180 Handheld Metal Detector Parameter: Dimension 345(L) X 69(W) X 25(H) mm Power voltage 9V Rechargeable battery Operating voltage 7V-12V Operating current <5mA Alarm Sound & light alarm/ Vibration & light alarm Alarm sound more than or equal to 75dB(A) Operation frequency 22KHz Product Display FAQ FAQ 1. Q: Do you have any MOQ limit? A: For your convenience, we can accept 1 pc. But we offer better price for big order. 2. Q: What if the products have problems? A: We offer a 1-year warranty except for the man-made damage. And we can offer any technical support for operation problems. 3. Q: Can the device's language be in other languages? A: Yes, of course. Multi-language can be customized. Our device supports English, Spanish, Portugal, Russian, Arabic, French, German, etc. 4. Q: What about the Payment? A: You can pay for the order via T/T, Western Union, PayPal, Alibaba payment, L/C, DP 5. Q: How do you ship the goods? A: Small order: Express like DHL, UPS, TNT, FedEx Big order: By Sea or by airline. 6. Q: How can I get a sample to check your quality? A: You can require samples to check our quality. You should pay for the sample and freight cost, if you order more than 500 pcs, we return the sample cost to you. 7. Q: What about the lead time for mass production? A: small order: 1 week after payment Big order: 2-3 weeks. 8. Q: Can you supply the relevant documentation? Yes, we can provide most documentation including Certificates of Analysis / Conformance; Insurance; Origin, and other export documents where required 9. Q: Where can I get the price? A: We usually quote within 24 hours after we get your inquiry. If you are very urgent to get the price, please call us, in your Related Products 相关产品 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 60mW Rechargeable Handheld Metal Detector 阅读更多 Compact Size Portable Handheld Metal Detector ZK-D180 ZK-D180 is the compact size hand held metal detector featured with a detection indicator right in the middle of its main body detecting the sizes of detected objects and visualizing in diferent color (Green to Red), a perfect tool for speeding up security process. The controllable sound and vibration efect is another highlight, security guard can identify the potential dangerous quietly. ZK-D180 Handheld Metal Detector Feature: Compact size , Portable; High sensitivity, able to detect object as small as a stamp; Visualize metal detection indicator; Rechargeable battery and charger; Extra-long working hours with single charge (Up to 40 working hours); Controllable sound and vibration efect; Low sensitivity mode, filter out all the small and tiny object; Low battery voltage (7V) come with same detection range. ZK-D180 Handheld Metal Detector Parameter: 345(L) X 69(W) X 25(H) mm Sound & light alarm/ Vibration & light alarm more than or equal to 75dB(A) 1. Q: Do you have any MOQ limit? A: For your convenience, we can accept 1 pc. But we offer better price for big order. 2. Q: What if the products have problems? A: We offer a 1-year warranty except for the man-made damage. And we can offer any technical support for operation problems. 3. Q: Can the device's language be in other languages? A: Yes, of course. Multi-language can be customized. Our device supports English, Spanish, Portugal, Russian, Arabic, French, German, etc. 4. Q: What about the Payment? A: You can pay for the order via T/T, Western Union, PayPal, Alibaba payment, L/C, DP 5. Q: How do you ship the goods? A: Small order: Express like DHL, UPS, TNT, FedEx Big order: By Sea or by airline. 6. Q: How can I get a sample to check your quality? A: You can require samples to check our quality. You should pay for the sample and freight cost, if you order more than 500 pcs, we return the sample cost to you. 7. Q: What about the lead time for mass production? A: small order: 1 week after payment Big order: 2-3 weeks. 8. Q: Can you supply the relevant documentation? Yes, we can provide most documentation including Certificates of Analysis / Conformance; Insurance; Origin, and other export documents where required 9. Q: Where can I get the price? A: We usually quote within 24 hours after we get your inquiry. If you are very urgent to get the price, please call us, in your 相关产品 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 60mW Rechargeable Handheld Metal Detector 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 阅读更多 IP31 Waterproof Multifunctional Handheld Metal Detector ZK-D100S 60mW Rechargeable Handheld Metal Detector 阅读更多 60mW Rechargeable Handheld Metal Detector Products Turnstile Access Control System Guard Tour Patrol System Parking Management System RFID Card Access Control System Fingerprint Recognition System Quick link Menu Contact us bernice@granding.com +8615656977869 Facebook Twitter Youtube Turnstile Access Control System Guard Tour Patrol System RFID Card Access Control System"
  ]
}