{
  "company": "humaniq.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "0": 3
    }
  },
  "sample_docs": [
    "The Ethereum Blockchain provided a ready and operating blockchain for Humaniq to effectively provide banking to the unbanked with a new, decentralised app. In addition, it also offers smart contract functionality that facilitate online contractual agreements within the Humaniq app, making peer-to-peer lending and other collaborations between Humaniq users easy. They are smart because repayments and other transactions that Humaniq users commit to are automatically executed. This allows the expansion of microfinance, which to date has relied on intermediaries charging fees. The Ethereum Blockchain also underpins an encrypted messaging system between Humaniq app users, which provides privacy and security.",
    "Banking with Humaniq is simple and secure. The first time that you use the Humaniq app, you authenticate your identity so that you never need any passwords or documentation to access your account. Our face recognition technology will confirm your identity and keep your transactions secure. You are then issued with HMQ, Humaniq coins, for passing bio-identification, so you can immediately get started. You gain more HMQ for engaging with the app, for example by recommending friends and by making transactions. The more people you know who use the app, the more powerful the app becomes. HMQ enables a peer-to-peer economy. One of the main functions is sending or receiving HMQ directly to other users of the app instantly and at virtually zero-cost - making sending sums smaller than $10 without losing money possible for the first time. We are also talking to major shopping franchises in the markets we are targeting about making HMQ a payment option. And we are working to provide the infrastructure necessary to exchange cryptocurrency for local currency. We will also be adding further services over time. The plan is that you will be able to use the app to access micro-finance lenders for small loans in a 'Borrow' tab, and even employment in the 'Earn' tab, where on-line, paid tasks are collected and available for you to perform. Humaniq is a bank that pays.",
    "How is Humaniq different? Aren't you just another mobile wallet? Humaniq is a cryptocurrency unlike any other. We are working to put currency into the hands of the 2bn unbanked people. The barriers to use are low, with voice and face recognition technologies used so that the uneducated and the undocumented can access the app and open an account. It sounds accessible. But is this enough to succeed in putting cryptocurrency into the hands of the many? With Humaniq, everybody can mint coins. Unlike with other cryptocurrencies, it is not about being the first to own the coins, or having access to specialised hardware or spending a lot on electricity. Everybody, once they have used their face to pass authentication, is rewarded with HMQ. Then, when they interact with the app, they earn more. The minting of coins will continue until we have 2 billion users. But wasn't other cryptocurrency also aimed at developing countries? Other crypto also uses Ethereum's custom-built Blockchain to provide new, safe and secure, currency. But it is not used in unbanked regions because it is limited in supply, because of relative usage complexity, and because it is not promoted. The transaction capacity limit of Bitcoin is 250 thousand, compared to PayPal's 100 million active accounts. We have researched the markets we are targeting, and recruited dozens of prominent bitcoiners living in developing countries to our Humaniq Ambassador Program. They are teaching people how to use Humaniq - and earn cryptocurrency for that. Why use the Blockchain to make payments? The Blockchain is a decentralised way of confirming transactions that steps into the breach that has been created by centralised banks not serving 2 billion people around the world. The Blockchain allows payments to be checked and confirmed so there can be no double payments or lost payments, without there being a centralised authority. This technology therefore underpins an expansion of banking services to those currently shut out from the digital economy because of the existing banking infrastructure. Why the Ethereum Blockchain? The Humaniq app runs on the Ethereum platform, which is a way of running Blockchain-based, decentralised apps without unnecessary complexity and risk entailed in deploying a new Blockchain. The Ethereum Blockchain, which was first launched in the summer of 2015, is a well-established platform to provide secure banking without a central server. Using a ready and operating Blockchain allowed us to create a solution to the need for security for transactions quickly, without needless expenditure or loss of quality. This allows us to put more time and energy into concentrating on what matters most: our people-focused business model. Why invest in Humaniq? We are pleased that so many people responded so positively to our Initial Coin Offering. Nearly 12,000 people have bought HMQ cryptocurrency because they believe in our vision to provide banking to the unbanked. Humaniq has been highlighted as in the top ten per cent of cryptocurrencies by value, with a market valuation of over $5m, and our ICO as one of the most successful in the last two years. Our vision will make HMQ the de facto currency for developing countries, the oil that runs the engines of their economies. Why did you hold an ICO? We already had access to capital for our project but we believe it is fair to allow everybody to invest and to participate in Humaniq. We also wanted to help build our community and to have an opportunity to tell the story of Humaniq to more people in the media. Our belief that many would want to be involved and to support and help steer Humaniq proved well-founded: nearly 12,000 participated in the ICO held in April 2017 after reading our white paper. Our strategy is to focus on the massive potential of providing banking to the unbanked."
  ]
}