{
  "company": "idency.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 3,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 2
    }
  },
  "sample_docs": [
    "ZK Tech Biometric Products Time & Attendance, Access Control ZK Tech is a multinational enterprise, that specialises in the manufacture and development of time and attendance and access control technology. H8 is a friendly use plug-in solution for time and attendance recording using fingerprints. 3\" TFT screen, functions keys to select in and out, scheduled-bell, SMS, etc. Stores up to 500 fingerprint templates & up to 50,000 log records. USB download data when in standalone mode. SD Card, USB-Host, USB-client. Only £124.99 ex VAT (£149.99 inc VAT) Part no. iclockh8 Manufacturer Product Detail: iClock H8 iClock-560 is a Time & Attendance terminal with incorporated fingerprint sensor and display. Stores up to 30,000 users and 8,000 templates. Stores up to 200,000 log records without PC download. USB data download in standalone mode. TCP/IP port to communicate with PC Only £216.66 ex VAT (£259.99 inc VAT) Part no. iclock560 Manufacturer Product Detail: iClock 560 iClock-660 is a Time & Attendance terminal with incorporated fingerprint sensor and display. Easy to install and with a modern design. It incorporates 1,3M pixels camera for taking user photos and sending black/white photos lists to the server. The color TFT display offers users easy menu management. Only £316.66 ex VAT (£379.99 inc VAT) Part no. iclock660 Manufacturer Product Detail: iClock 660 iClock-680 is based on ZEM600 platform allowing more memory capacity and professional firmware functions. Connects to Time & Attendance management software by Ethernet, USB (also works by Wifi and GPRS) or operates standalone, downloading data by USB pendrive. Only £333.33 ex VAT (£399.99 inc VAT) Part no. iclock680 Manufacturer Product Detail: iClock 680 iClock700 is a Time & Attendance and access control terminal with incorporated ZK fingerprint sensor, 3'5 TFT display and internal backup battery. Easy to install, and with a modern design, it is the perfect solution for all kinds of installations. The iClock 700 includes an internal battery and Fingerprint cover. Only £358.33 ex VAT (£429.99 inc VAT) Part no. iclock700 Manufacturer Product Detail: iClock 700 VF380 is a new generation facial identification terminal, with Face, RFID and PIN Recognition mode. With latest facial algorithm ZK Face 7.0 and large capacity ZEM810 platform, it holds 200 face templates without dividing groups, and its verification time is less than 1 second. Only £291.66 ex VAT (£349.99 inc VAT) Part no. VF380 Manufacturer Product Detail: VF380 Users can identify or verify themsleves either by face, finger, card ID or PIN/Password. The TFT color touch screen of MulitiBio 700 provides ease of use and a rich user experience. It uses state of the art 3D imaging technology while also providing hygienic 100% touch-free biometric authentication. Only £333.33 ex VAT (£399.99 inc VAT) Part no. MB700 Manufacturer Product Detail: MB700 TF1700 is a small IP-based fingerprint terminals used for access control and time attendance. With its IP65 rated rugged waterproof and weatherproof structure, Offers durability for weather conditions including outdoors. Standalone applications such as house, office, shop, garage, factory and others. Only £333.33 ex VAT (£399.99 inc VAT) Part no. TF1700 Manufacturer Product Detail: TF1700 MA300 is an innovative biometric fingerprint reader for access control applications, offering high performance, reliability, precision and excellent matching speed. Features the fastest commercial-based fingerprint matching algorithm and high quality optical sensor. Great for Education sector Only £208.33 ex VAT (£249.99 inc VAT) Part no. MA300 Manufacturer Product Detail: MA300 SCR-100 is an access control terminal with incorporated proximity reader (EM by default). It's the perfect solution for small and medium access control installations. Connects to access control management software by Ethernet or RS232/485 port. Also operates in standalone mode via USB pendrive. Only £124.99 ex VAT (£149.99 inc VAT) Part no. SCR-100 Manufacturer Product Detail: SCR-100 L5000 Intelligent Fingerprint Lock The fingerprint lock offers state of the art single door management solution that provides you with unmatched options. Comes with OLED, standard USB interface. Only £191.66 ex VAT (£229.99 inc VAT) Part no. ZKL5000 Manufacturer Product Detail: L5000 L4000 Intelligent Fingerprint Lock The fingerprint lock offers state of the art single door management solution that provides you with unmatched options. Comes with OLED, standard USB interface. Only £191.66 ex VAT (£229.99 inc VAT) Part no. ZKL4000 Manufacturer Product Detail: L4000 For more information on ZK Technology Biometric Time & Attendance and Access Control solutions please contact us .",
    "ZKTeco CCTV. Get Sharper. Blog by Andy | Posted on Wednesday December 11 2019 Introducing the all-new ZKTeco CCTV range. We know and love ZKTeco as a leading provider of security and time management solutions. Their multi-biometric time & attendance and access control devices are robust and reliable, and they are immensely popular with our customers. Crystal clear images. Even at night. Now, ZKTeco have recently launched a range of cost efficient, high-quality IP CCTV cameras with cutting-edge Sony STARVIS sensors . These cameras deliver crystal clear images with a 20m viewing range. They also support the industry-leading IVA smart event alarm. As well as a great range of dome and bullet cameras available with Power over Ethernet (PoE), night-vision capability and resolutions of up to 4MP, there are DVRs for recording and managing footage with up to 16 channels at 4K and H265+ video compression for high quality video but efficient data storage. H.265+ is the evolutionary optimisation of H.265 and traditional H.264 and includes a series of encoding strategies such as Dynamic ROI and smart 2D&3D noise reduction. The friendly GUI provides intuitive shortcut operations, remote control and management, flexible storage and playback. It's widely used for government, banking, manufacturing, educational and commercial projects. Smart. And tough. Cameras allow detection on multiple behaviours including Tripwire, Intrusion, Objects Detection and Target Counting. Camera working temperatures range from -30°C to +60 °C and in a variety of harsh outdoor environments. The ZKTeco CCTV range is ideal for business use in office, production or retail settings and provides sharp playback for security and evidence purposes. Flexible management. You can manage your CCTV cameras via the AntarView mobile app or via input the IP address of the front-end device in your chosen internet browser. You can then monitor live video as easily as opening a website. We like them so much, we've dedicated a whole new section of our site to them. We think you'll like them too: Check out the new CCTV range from ZKTeco ZKTeco CCTV. Get Sharper. Blog by Andy | Posted on Wednesday December 11 2019 Introducing the all-new ZKTeco CCTV range. We know and love ZKTeco as a leading provider of security and time management solutions. Their multi-biometric time & attendance and access control devices are robust and reliable, and they are immensely popular with our customers. Crystal clear images. Even at night. Now, ZKTeco have recently launched a range of cost efficient, high-quality IP CCTV cameras with cutting-edge Sony STARVIS sensors . These cameras deliver crystal clear images with a 20m viewing range. They also support the industry-leading IVA smart event alarm. As well as a great range of dome and bullet cameras available with Power over Ethernet (PoE), night-vision capability and resolutions of up to 4MP, there are DVRs for recording and managing footage with up to 16 channels at 4K and H265+ video compression for high quality video but efficient data storage. H.265+ is the evolutionary optimisation of H.265 and traditional H.264 and includes a series of encoding strategies such as Dynamic ROI and smart 2D&3D noise reduction. The friendly GUI provides intuitive shortcut operations, remote control and management, flexible storage and playback. It's widely used for government, banking, manufacturing, educational and commercial projects. Cameras allow detection on multiple behaviours including Tripwire, Intrusion, Objects Detection and Target Counting. Camera working temperatures range from -30°C to +60 °C and in a variety of harsh outdoor environments. The ZKTeco CCTV range is ideal for business use in office, production or retail settings and provides sharp playback for security and evidence purposes. You can manage your CCTV cameras via the AntarView mobile app or via input the IP address of the front-end device in your chosen internet browser. You can then monitor live video as easily as opening a website. We like them so much, we've dedicated a whole new section of our site to them. We think you'll like them too: Check out the new CCTV range from ZKTeco In good company: some of Idency's clients",
    "Products Authentication Access Control Systems Accessories Biometric Solutions Facial Recognition Fingerprint Iris Bundles Controllers RFID Card Solutions Secure Key Cabinets SmartLocks Biometric Software Time & Attendance Software Fingerprint Reader Software CCTV CCTV Accessories CCTV Cameras CCTV Kits CCTV Monitors E-Signature Fingerprint Readers Fingerprint Reader Hardware Fingerprint Reader Software Finger Vein Technology HR Software Temperature & Fever Detection Time & Attendance Accessories Biometric Systems Facial Recognition Fingerprint Iris RFID Card Systems T&A Software Two Factor Authentication Networking Backup Email Security Endpoint Security Antivirus & Anti-Malware Disk Encryption Mobile Security Mobile Device Management Mobile Protection File Sharing Security Firewalls Routers 4G Cellular Routers Load Balancing Routers Secure Storage Security Management Mobile Device Management Network Management Security Awareness Training VPN Security Web Filtering Wireless Networks Authentication Access Control Systems Accessories Biometric Solutions Facial Recognition Fingerprint Iris Bundles Controllers RFID Card Solutions Secure Key Cabinets SmartLocks Biometric Software Time & Attendance Software Fingerprint Reader Software CCTV CCTV Accessories CCTV Cameras CCTV Kits CCTV Monitors E-Signature Fingerprint Readers Fingerprint Reader Hardware Fingerprint Reader Software Finger Vein Technology HR Software Temperature & Fever Detection Time & Attendance Accessories Biometric Systems Facial Recognition Fingerprint Iris RFID Card Systems T&A Software Two Factor Authentication Access Control Systems Accessories Biometric Solutions Facial Recognition Fingerprint Iris Bundles Controllers RFID Card Solutions Secure Key Cabinets SmartLocks Biometric Solutions Facial Recognition Fingerprint Iris Biometric Software Time & Attendance Software Fingerprint Reader Software Time & Attendance Software CCTV CCTV Accessories CCTV Cameras CCTV Kits CCTV Monitors Fingerprint Readers Fingerprint Reader Hardware Fingerprint Reader Software Temperature & Fever Detection Time & Attendance Accessories Biometric Systems Facial Recognition Fingerprint Iris RFID Card Systems T&A Software Biometric Systems Facial Recognition Fingerprint Iris Networking Backup Email Security Endpoint Security Antivirus & Anti-Malware Disk Encryption Mobile Security Mobile Device Management Mobile Protection File Sharing Security Firewalls Routers 4G Cellular Routers Load Balancing Routers Secure Storage Security Management Mobile Device Management Network Management Security Awareness Training VPN Security Web Filtering Wireless Networks Endpoint Security Antivirus & Anti-Malware Disk Encryption Mobile Security Mobile Device Management Mobile Protection Mobile Security Mobile Device Management Mobile Protection Routers 4G Cellular Routers Load Balancing Routers Security Management Mobile Device Management Network Management Security Awareness Training Managed Services Consultancy Services IT Audit Services Support & Set Up Services Wireless Network Services Submit Support Ticket Support & Set Up Services Brands Aerohive Anviz Barracuda Becrypt BlackBerry ClockReports Cocoon Danalock HID Hitachi Idency ievo KnowBe4 Malwarebytes OneSpan People Peplink Safire Sophos Trustone Global VIPRE WALLIX ZKTeco News Blog Idency News Feed You can now export your Malwarebytes data directly to Microsoft Excel Malwarebytes truly is a conquering cybersecurity provider and continues to add to their warrior-like strategies. But, doesn't every cybersecurity provider consider themselves hero's? How can we be sure to put our trust in Malwarebytes? Malwarebytes gives triallists an opportunity Triallists of Malwarebytes can now generate summary reports that demonstrate exactly how Malwarebytes has protected your network, and this is how they got there... Malwarebytes Cloud & On-Premise solutions have always collected a rich set of data from your connected endpoints in order for you to have full control and flexibility of your security. A common request has since surfaced to turn this rich set of collected data into useful information... Malwarebytes introduce the Malwarebytes Excel Addin. Providing easy access to import data directly into Microsoft Excel. To make everything easier, all you need for the Malwarebytes Excel Addin to work is: An account on the Malwarebytes Cloud server ( https://cloud.malwarebytes.com ). Microsoft Excel 2013 or 2016 (Office 365) on Windows. This means it doesn't matter if you own a Malwarebytes licence or not, you can try it today. The process of combining Malwarebytes with Excel is very simple. All you need to do is download the addin, and the addin adds a completely new Malwarebytes window to your Excel. Malwarebytes Excel Addin Features & Benefits Malwarebytes Excel Addin has a variety of features and benefits that give customers a wide range of possibilities and freedom. Haven't Purchased Malwarebytes Yet? Try Malwarebytes now & test your network free! REQUEST A FREE TRIAL Want to Download Malwarebytes Excel? Download Malwarebytes Excel Addin Now! DOWNLOAD Malwarebytes Excel Addin in Action With Malwarebytes Excel Addin you can perform a range of actions, including importing endpoint data, import software installed & agent information, generate summary reports for an overview of activity since Malwarebytes was installed and import detections & threats data. Excel Addin Photo Gallery Hover over the images for a description. Click the images to enlarge them. Perform a variety of actions Tables & charts created for key objects Import detections & threat data Generate summary reports Want a tour of the Malwarebytes Excel Addin? Watch this 4 minute video to see how quick and easy it is to download, import/export, and generate reports. Want more screenshots, videos and information on Malwarebytes? Check out our Malwarebytes product listings for datasheets, user manuals, operational videos, and detailed product descriptions. You can also check out our Knowledgebase for more information. Malwarebytes Knowledgebase We Can Support You For more information and to discuss your requirements, please contact us. GET IN TOUCH You can now export your Malwarebytes data directly to Microsoft Excel Malwarebytes truly is a conquering cybersecurity provider and continues to add to their warrior-like strategies. But, doesn't every cybersecurity provider consider themselves hero's? How can we be sure to put our trust in Malwarebytes? Malwarebytes gives triallists an opportunity Triallists of Malwarebytes can now generate summary reports that demonstrate exactly how Malwarebytes has protected your network, and this is how they got there... Malwarebytes Cloud & On-Premise solutions have always collected a rich set of data from your connected endpoints in order for you to have full control and flexibility of your security. A common request has since surfaced to turn this rich set of collected data into useful information... Malwarebytes introduce the Malwarebytes Excel Addin. Providing easy access to import data directly into Microsoft Excel. To make everything easier, all you need for the Malwarebytes Excel Addin to work is: An account on the Malwarebytes Cloud server ( https://cloud.malwarebytes.com ). Microsoft Excel 2013 or 2016 (Office 365) on Windows. This means it doesn't matter if you own a Malwarebytes licence or not, you can try it today. The process of combining Malwarebytes with Excel is very simple. All you need to do is download the addin, and the addin adds a completely new Malwarebytes window to your Excel. Malwarebytes Excel Addin Features & Benefits Malwarebytes Excel Addin has a variety of features and benefits that give customers a wide range of possibilities and freedom. Haven't Purchased Malwarebytes Yet? Try Malwarebytes now & test your network free! REQUEST A FREE TRIAL Want to Download Malwarebytes Excel? Download Malwarebytes Excel Addin Now! Malwarebytes Excel Addin in Action With Malwarebytes Excel Addin you can perform a range of actions, including importing endpoint data, import software installed & agent information, generate summary reports for an overview of activity since Malwarebytes was installed and import detections & threats data. Excel Addin Photo Gallery Hover over the images for a description. Click the images to enlarge them. Perform a variety of actions Tables & charts created for key objects Import detections & threat data Want a tour of the Malwarebytes Excel Addin? Watch this 4 minute video to see how quick and easy it is to download, import/export, and generate reports. Want more screenshots, videos and information on Malwarebytes? Check out our Malwarebytes product listings for datasheets, user manuals, operational videos, and detailed product descriptions. You can also check out our Knowledgebase for more information. We Can Support You For more information and to discuss your requirements, please contact us.",
    "*Free two-day shipping and returns Secure your digital world The future of authentication and security solutions In today's networked and mobile world it is essential that people and companies are set up to manage and protect their data, communications and resources. Idency delivers fast and effective authentication and security solutions. Authentication & Biometric Solutions More than 60% of business managers share passwords with others. Strong authentication can help eliminate risk to your data. Biometric ID and authentication products make strong security simple, practical and affordable. Read More Sale Anviz C2 Pro Fingerprint & RFID Time and Attendance Terminal £299.99 inc.VAT £249.99 ex.VAT Anviz W1 Fingerprint and RFID Time and Attendance Terminal £199.99 inc.VAT £166.66 ex.VAT Secure Networks and Data Protection In todays world it is essential that your network, employee devices and data are protected. A top priority for organisations is finding a way to keep control of documents and files as users share more data and work across multiple devices. Read More Malwarebytes Endpoint Protection & Response CONTACT US FOR PRICING Idency Backup CONTACT US FOR PRICING IdencyHome IdencyHome utilises the best of modern day technology and brands to make everyday items smart and secure. Protect your devices with the latest antivirus software and fingerprint single sign-on technology. Monitor and remotely control your home with affordable CCTV bundles and the latest SmartHome gadgets and security kits. Read More Sale Eikon Mini USB Fingerprint Reader £22.99 inc.VAT £19.16 ex.VAT Sale U.ARE.U 4500 Fingerprint Reader £79.99 inc.VAT £66.66 ex.VAT Services Our IT Services make a difference; we discover the problems, and find the solutions. Each service can be tailored to your business or individual requirement. Read More Sale SMART-i Wireless Smart Home Security Alarm System SH120 £173.99 inc.VAT £144.99 ex.VAT Sale Danalock V3 BTZW (Bluetooth & Z-Wave) £179.99 inc.VAT £149.99 ex.VAT Knowledgebase For answers to frequently asked support questions take a look at the Idency Knowledgebase - our repository of articles about Idency authentication and security products. It's our ever-growing resource for solutions and answers to your technical issues and questions. Something missing? Let us know Find out more Has your company's cybersecurity ever been tested? 'Twas the morning after Christmas do, when all through the office, Not a keyboard was tapping, not even a mouse! With Christmas fast approaching, everyone is celebrating with their own 'bring your hangover to work day'. It's the one day a year colleagues are popping their paracetamol, sipping their coffee, and reminiscing on the shenanigans […] Read blog post Our Clients *Free two-day shipping and returns Secure your digital world The future of authentication and security solutions In today's networked and mobile world it is essential that people and companies are set up to manage and protect their data, communications and resources. Idency delivers fast and effective authentication and security solutions. Authentication & Biometric Solutions More than 60% of business managers share passwords with others. Strong authentication can help eliminate risk to your data. Biometric ID and authentication products make strong security simple, practical and affordable. Secure Networks and Data Protection In todays world it is essential that your network, employee devices and data are protected. A top priority for organisations is finding a way to keep control of documents and files as users share more data and work across multiple devices. IdencyHome utilises the best of modern day technology and brands to make everyday items smart and secure. Protect your devices with the latest antivirus software and fingerprint single sign-on technology. Monitor and remotely control your home with affordable CCTV bundles and the latest SmartHome gadgets and security kits. Our IT Services make a difference; we discover the problems, and find the solutions. Each service can be tailored to your business or individual requirement. For answers to frequently asked support questions take a look at the Idency Knowledgebase - our repository of articles about Idency authentication and security products. It's our ever-growing resource for solutions and answers to your technical issues and questions. Something missing? Let us know Has your company's cybersecurity ever been tested? 'Twas the morning after Christmas do, when all through the office, Not a keyboard was tapping, not even a mouse! With Christmas fast approaching, everyone is celebrating with their own 'bring your hangover to work day'. It's the one day a year colleagues are popping their paracetamol, sipping their coffee, and reminiscing on the shenanigans […]",
    "In today's networked and mobile world it's essential that people and companies are set up to manage and protect their data, communications and resources. We make that possible. Authentication & Biometric Solutions People can be careless – and we all have off-days. More than 60% of business managers share passwords with others! Strong authentication, time & attendance and access control solutions using biometrics or RFID stop unauthorised personnel in their tracks. Our solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. Uni-Ubi UFace 5 Pro Facial Recognition Terminal £ 749.99 ex.VAT Go2Clock Cloud Hosted Time & Attendance System Find out more Explore all Secure Networks & Data Protection Ensuring your network and its endpoints are secure is now an imperative, everyday process of network management . Proven market leading security solutions, extra layers of protection and educating users all help eliminate the risk of your systems or precious data being compromised. Our solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. Malwarebytes Endpoint Detection & Response (EDR) For Servers Find out more Malwarebytes Managed Detection & Response (MDR) Find out more Explore all Managed Services You'll know the right solution for your business when you see it. We're here to offer services to make finding it easier. We will recommend and supply software and hardware solutions tailored to help you secure your digital world. We live and breathe the industry, and we share our expertise in our IT Services . We can even help you discover your vulnerabilities (via an IT Audit ), and then find best solutions to fill any gaps. Each service will be tailored to your business or individual requirement. Our support & consultancy managed solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. Idency Audit Suite Find out more Time & Attendance Consultancy Find out more Explore all I have been a customer of Idency's for close to 6 years and they are our go-to guys for everything Time & Attendance related.\" Chris Hainey Infrastructure & Security Manager at Millers Vanguard We have worked with Idency for over 7 years. Superb service and great support with very quick response times! I wouldn't hesitate in recommending Idency to anyone looking for Biometric Time and Attendance.\" Rod Hill Group Operations Director Your service and remote support have been excellent and very helpful in all areas of using the Clock Reports software but also just extra bits of additional information too. \" Matthew Turnbull IT Technician There is always someone to help and support us and we have needed that a lot recently with the implementation of the new devices.\" Lucy Lavender HR Manager we are highly satisfied with both the product and the outstanding support provided by Idency\" Dean Burgess IT Manager I have always found you to be very attentive in supporting me with any issues I have either encountered or from a set-up perspective.\" Vicky McTaggart Personnel Manager at Stoke Sauces Everyone at Idency have been extremely helpful with the implementation of our new time and attendance software, particularly Joe who has always answered our copious amount of questions straight away.\" Laura Quattro Support from Idency support has been excellent. Nothing is too much trouble. They are always available to answer any questions no matter how small and response time is very quick. Would recommend the support package with any Idency products!\" Rosie Customer Operations Manager [Scanning fingerprints] is vital for our business, and your software makes our lives millions of times better. Blessings my friend.\" Walter Jeweller at Joyeria Amor \"XO\" (Personalised Jewellery) Everyone is always happy to help and I feel that Idency always works on a problem until it is solved.\" Lucy Lavender HR Manager a very good solution for our Time & Attendance\" Lynn Chapman HR Manager at Reabrook Ltd Custom development projects have been meticulously scoped and consistently delivered within agreed timelines.\" Dean Burgess IT Manager Has reduced our wage bill already!\" Andy Ridge Managing Director at Industrial Engineering & Installation Services Aaron has been very helpful and prompt with answering any queries that we had in relation to the set up of the terminal and any after sales issues that arose. Thank You Aaron for all your help.\" Bernard Lee Operations Manager We are very satisfied with the scanner and find the image quality to be very good.\" Chris Jackson Managing Director, Mears and Jackson Excellent service with fast responses.\" Steven Guite Senior Operations Manager at Accuro FM We have had no issues with you and would like to keep a good connection with you as a company especially with our soon change in our infrastructure project.\" Matthew Turnbull IT Technician always found everyone I've spoken with to be very helpful & any queries have been understood & resolved in a very timely manner\" IT Technician at One+All Our overall service from Idency has been great.\" Lucy Lavender HR Manager at Cleardata UK Ltd Turnaround time on queries has been great\" HR Manager at Mademoiselle Desserts Search our knowledgebase For answers to frequently asked support questions take a look at the Idency Knowledgebase - our repository of articles about Idency authentication and security products. It's our ever-growing resource for solutions and answers to your technical issues and questions. Something missing? Frequent topics Anviz ClockReports Malwarebytes PeopleHR ZKTeco VIPRE Sophos Trustone Global (TSG) Aerohive Networks Barracuda Networks HID DigitalPersona Nest Eikon Go2Clock ievo IQCCTV Latest articles from the Idency Blog Idency supports Jamie's Farm this Christmas This Christmas, Idency is supporting Jamie's Farm, a brilliant charity that tackles real issues for disadvantaged children and young people. While it's a fun time fo... Read More How long does Payroll take you each month? Is it hours? Days, even? If you have a large number of employees, collating their hours and overtime each month takes time – even if you have accurate records from RFID or biome... Read More How old do you look? The new world of biometric age verification How facial analysis technology is being harnessed for age verification Read More In today's networked and mobile world it's essential that people and companies are set up to manage and protect their data, communications and resources. We make that possible. Authentication & Biometric Solutions People can be careless – and we all have off-days. More than 60% of business managers share passwords with others! Strong authentication, time & attendance and access control solutions using biometrics or RFID stop unauthorised personnel in their tracks. Our solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. Secure Networks & Data Protection Ensuring your network and its endpoints are secure is now an imperative, everyday process of network management . Proven market leading security solutions, extra layers of protection and educating users all help eliminate the risk of your systems or precious data being compromised. Our solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. You'll know the right solution for your business when you see it. We're here to offer services to make finding it easier. We will recommend and supply software and hardware solutions tailored to help you secure your digital world. We live and breathe the industry, and we share our expertise in our IT Services . We can even help you discover your vulnerabilities (via an IT Audit ), and then find best solutions to fill any gaps. Each service will be tailored to your business or individual requirement. Our support & consultancy managed solutions make strong security simple, practical and affordable. Even better – we take human error out of your security. Infrastructure & Security Manager at Millers Vanguard Personnel Manager at Stoke Sauces Jeweller at Joyeria Amor \"XO\" (Personalised Jewellery) HR Manager at Reabrook Ltd Managing Director at Industrial Engineering & Installation Services Managing Director, Mears and Jackson Senior Operations Manager at Accuro FM IT Technician at One+All HR Manager at Cleardata UK Ltd HR Manager at Mademoiselle Desserts For answers to frequently asked support questions take a look at the Idency Knowledgebase - our repository of articles about Idency authentication and security products. It's our ever-growing resource for solutions and answers to your technical issues and questions. Latest articles from the Idency Blog Idency supports Jamie's Farm this Christmas How long does Payroll take you each month? How old do you look? The new world of biometric age verification In good company: some of Idency's clients"
  ]
}