{
  "company": "identance.com",
  "dominant_topics": [
    0,
    -1,
    5,
    1,
    6
  ],
  "topic_counts": {
    "0": 12,
    "-1": 5,
    "5": 3,
    "1": 2,
    "6": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "5": "aml, smartsearch, money, laundering, money laundering",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.3754963131026659,
    "framing_surveillance": 0.0141803743618831,
    "framing_market": 0.6103233125354509,
    "num_docs": 23
  },
  "topic_timeline": {
    "20": {
      "-1": 5,
      "0": 12,
      "1": 2,
      "5": 3,
      "6": 1
    }
  },
  "sample_docs": [
    "Partner Program Tools, guidance, and support to deliver the very best Identity. Apply now Referral partner You share qualified leads, and earn referral fees for every deal that closes. Technology reseller Add identity verification to your platform by partnering, not building. Adopt a new revenue stream We are making sure that we are looking to win the eyes wide opened into identity verification and fraud prevention future. We are always up to date with all modern technology and sometimes even step ahead with it. You will be always updated with the \"hottest\" verification technology. Partner Program Tools, guidance, and support to deliver the very best Identity. Apply now Referral partner You share qualified leads, and earn referral fees for every deal that closes. Technology reseller Add identity verification to your platform by partnering, not building. Adopt a new revenue stream We are making sure that we are looking to win the eyes wide opened into identity verification and fraud prevention future. We are always up to date with all modern technology and sometimes even step ahead with it. You will be always updated with the \"hottest\" verification technology. Partner Program Tools, guidance, and support to deliver the very best Identity. Apply now Tools, guidance, and support to deliver the very best Identity. You share qualified leads, and earn referral fees for every deal that closes. Add identity verification to your platform by partnering, not building. Adopt a new revenue stream We are making sure that we are looking to win the eyes wide opened into identity verification and fraud prevention future. We are always up to date with all modern technology and sometimes even step ahead with it. You will be always updated with the \"hottest\" verification technology.",
    "About us Advantages of working with Identance Who we are Identance has been out since 2018, we are identity verification software solution, we provide businesses with seamless user onboarding, fraud prevention, KYC/AML and KYB automation. With Identance you don't have to worry about meeting KYC/AML/GDPR standards as not only we capture, collect and store data - we verify documents and people, preventing any fraudulent actions. Our mission Providing transparency and security globally using top-notch compliance practices. Flexibility We tailor the service according to your needs, we are the ones to adjust our product to match your experience, not vice versa In-house compliance department We have a team of professionals who can help set up the onboarding, investigate and review difficult cases and share knowledge. Industry experience Over 7 years experience starting in 2013 while being internal part of one of the biggest UK-based cryptocurrency exchanges. Advanced fraud prevention systems Our expert system allows us to set up detailed rules on accepting or rejecting customers based on multiple parameters such as age, residence, type of document, etc. Identance Hunter Using proven detection rules, Hunter screens for, and highlights potentially fraudulent applications, stopping fraudsters before they become a customer, increasing fraud savings, and assisting in management and control of bad debt. Interested in pricing or a demo? Our team is here to answer your questions about IDENTANCE Talk to an expert About us Advantages of working with Identance Who we are Identance has been out since 2018, we are identity verification software solution, we provide businesses with seamless user onboarding, fraud prevention, KYC/AML and KYB automation. With Identance you don't have to worry about meeting KYC/AML/GDPR standards as not only we capture, collect and store data - we verify documents and people, preventing any fraudulent actions. Our mission Providing transparency and security globally using top-notch compliance practices. Flexibility We tailor the service according to your needs, we are the ones to adjust our product to match your experience, not vice versa In-house compliance department We have a team of professionals who can help set up the onboarding, investigate and review difficult cases and share knowledge. Industry experience Over 7 years experience starting in 2013 while being internal part of one of the biggest UK-based cryptocurrency exchanges. Advanced fraud prevention systems Our expert system allows us to set up detailed rules on accepting or rejecting customers based on multiple parameters such as age, residence, type of document, etc. Identance Hunter Using proven detection rules, Hunter screens for, and highlights potentially fraudulent applications, stopping fraudsters before they become a customer, increasing fraud savings, and assisting in management and control of bad debt. Interested in pricing or a demo? Our team is here to answer your questions about IDENTANCE Talk to an expert About us Advantages of working with Identance Advantages of working with Identance Identance has been out since 2018, we are identity verification software solution, we provide businesses with seamless user onboarding, fraud prevention, KYC/AML and KYB automation. With Identance you don't have to worry about meeting KYC/AML/GDPR standards as not only we capture, collect and store data - we verify documents and people, preventing any fraudulent actions. Providing transparency and security globally using top-notch compliance practices. Using proven detection rules, Hunter screens for, and highlights potentially fraudulent applications, stopping fraudsters before they become a customer, increasing fraud savings, and assisting in management and control of bad debt. Interested in pricing or a demo? Our team is here to answer your questions about IDENTANCE",
    "Pricing Identance is a cloud-based Identity Verification solution build to help online organizations with remote customer onboarding. Basic KYC $ 51 / month You will get: 50 verifications/month If you need more than 50 verifications/month you can buy additional verifications after purchasing this pricing plan $1.01/verification ID Verification: Fraud / Photoshop check Standard Document OCR: First name, Last name, Date of Birth, Date of Expiry, Date of Issue, Document number Active Liveness verification Biometric Face Match Verification Geolocation check Case management dashboard Enhanced KYC $ 105 / month You will get: 50 verifications/month If you need more than 50 verifications/month you can buy additional verifications after purchasing this pricing plan $2.11/verification ID Verification: Fraud / Photoshop check Standard Document OCR: First name, Last name, Date of Birth, Date of Expiry, Date of Issue, Document number Active Liveness verification Biometric Face Match Verification Geolocation check Case management dashboard Address Verification (PoA and SoF documents like a bank statement, utility bill, tax bill, payslip, etc.) Basic Due Diligence $ 144 / month You will get: 100 verifications/month If you need more than 100 verifications/month you can buy additional verifications after purchasing this pricing plan $1.44/verification ID Verification: Fraud / Photoshop check Standard Document OCR: First name, Last name, Date of Birth, Date of Expiry, Date of Issue, Document number Active Liveness verification Biometric Face Match Verification Geolocation check Case management dashboard PEPs check Global regulatory watchlists check Adverse media check Sanctions screening: OFAC, OSFI, EU Consolidated, UN Consolidated Enhanced Due Diligence $ 237 / month You will get: 100 verifications/month If you need more than 100 verifications/month you can buy additional verifications after purchasing this pricing plan $2.37/verification ID Verification: Fraud / Photoshop check Standard Document OCR: First name, Last name, Date of Birth, Date of Expiry, Date of Issue, Document number Active Liveness verification Biometric Face Match Verification Geolocation check Case management dashboard PEPs check Global regulatory watchlists check Adverse media check Sanctions screening: OFAC, OSFI, EU Consolidated, UN Consolidated Address Verification (PoA and SoF documents like a bank statement, utility bill, tax bill, payslip, etc.) Identance is a cloud-based Identity Verification solution build to help online organizations with remote customer onboarding. 50 verifications/month If you need more than 50 verifications/month you can buy additional verifications after purchasing this pricing plan 50 verifications/month If you need more than 50 verifications/month you can buy additional verifications after purchasing this pricing plan 100 verifications/month If you need more than 100 verifications/month you can buy additional verifications after purchasing this pricing plan 100 verifications/month If you need more than 100 verifications/month you can buy additional verifications after purchasing this pricing plan",
    "Use cases Make identity verification for AML and KYC compliance work for you. Bitcoin Exchange | Bitcoin Trading - CEX.IO View use case Performing KYC/AML checks is a regulatory requirement for digital asset companies like CEX.IO. To become the crypto exchange of the future, CEX.IO needed to go above and beyond the regulations in knowing their customers and identifying those attempting to commit identity fraud in order to create accounts. 24% Increase in the number of customers onboarded 50% Decrease in the average time to onboard 37% Increase in positive verification decisions View use case Optimize your business Staying compliant can add significantly to your operational costs, thanks to manual review, but it doesn't have to. IDENTANCE helps you scale cost-effectively by using a hybrid of AI, rule-based approach and human experts, and streamlining the process to reduce your internal costs. Better user experience IDENTANCE helps you balance both priorities with user-centric design, adding extra smoothness to areas where you need to ask your customers for more data to verify their identity. For example, IDENTANCE's OCR Autofill extracts data from their identity document and uses it to automatically prefill the form, so they don't even need to type. And our SDKs work across all platforms, from desktop to tablet and smartphone, so users can pick what works for them. Use cases Make identity verification for AML and KYC compliance work for you. Bitcoin Exchange | Bitcoin Trading - CEX.IO View use case Performing KYC/AML checks is a regulatory requirement for digital asset companies like CEX.IO. To become the crypto exchange of the future, CEX.IO needed to go above and beyond the regulations in knowing their customers and identifying those attempting to commit identity fraud in order to create accounts. 24% Increase in the number of customers onboarded 50% Decrease in the average time to onboard 37% Increase in positive verification decisions View use case Optimize your business Staying compliant can add significantly to your operational costs, thanks to manual review, but it doesn't have to. IDENTANCE helps you scale cost-effectively by using a hybrid of AI, rule-based approach and human experts, and streamlining the process to reduce your internal costs. Better user experience IDENTANCE helps you balance both priorities with user-centric design, adding extra smoothness to areas where you need to ask your customers for more data to verify their identity. For example, IDENTANCE's OCR Autofill extracts data from their identity document and uses it to automatically prefill the form, so they don't even need to type. And our SDKs work across all platforms, from desktop to tablet and smartphone, so users can pick what works for them. Use cases Make identity verification for AML and KYC compliance work for you. Make identity verification for AML and KYC compliance work for you. Bitcoin Exchange | Bitcoin Trading - CEX.IO Performing KYC/AML checks is a regulatory requirement for digital asset companies like CEX.IO. To become the crypto exchange of the future, CEX.IO needed to go above and beyond the regulations in knowing their customers and identifying those attempting to commit identity fraud in order to create accounts. 24% Increase in the number of customers onboarded 50% Decrease in the average time to onboard 37% Increase in positive verification decisions Optimize your business Staying compliant can add significantly to your operational costs, thanks to manual review, but it doesn't have to. IDENTANCE helps you scale cost-effectively by using a hybrid of AI, rule-based approach and human experts, and streamlining the process to reduce your internal costs. Staying compliant can add significantly to your operational costs, thanks to manual review, but it doesn't have to. IDENTANCE helps you scale cost-effectively by using a hybrid of AI, rule-based approach and human experts, and streamlining the process to reduce your internal costs. Better user experience IDENTANCE helps you balance both priorities with user-centric design, adding extra smoothness to areas where you need to ask your customers for more data to verify their identity. For example, IDENTANCE's OCR Autofill extracts data from their identity document and uses it to automatically prefill the form, so they don't even need to type. And our SDKs work across all platforms, from desktop to tablet and smartphone, so users can pick what works for them. IDENTANCE helps you balance both priorities with user-centric design, adding extra smoothness to areas where you need to ask your customers for more data to verify their identity. For example, IDENTANCE's OCR Autofill extracts data from their identity document and uses it to automatically prefill the form, so they don't even need to type. And our SDKs work across all platforms, from desktop to tablet and smartphone, so users can pick what works for them.",
    "Identance is a cloud-based Identity Verification solution built to help online organizations with remote customer onboarding. About Identance is powered by machine learning and artificial intelligence technologies that make your verification journey fast and easy. In addition to this, our compliance experts review suspicious verifications to make sure there are no errors, false positives, or false negatives to prevent fraud and increase acceptance rates. Identance is a cloud-based Identity Verification solution built to help online organizations with remote customer onboarding. Identance is powered by machine learning and artificial intelligence technologies that make your verification journey fast and easy. In addition to this, our compliance experts review suspicious verifications to make sure there are no errors, false positives, or false negatives to prevent fraud and increase acceptance rates. Verify your customer's identity documents and face Our intelligent KYC solution can help your business run more efficiently, avoid identity risks, reduce operational costs, and verify customers remotely in seconds. It's an important part of the Customer Due Diligence process (CDD), during which the customer should prove his identity documents like Passport or ID card, as well as the residential address to check nationality and establishes the customer as a citizen of certain country. We're directly connected to thousands of up-to-date AML sources to check the actual status of your customers within PEPs, Sanctions, Regulatory watchlists, and Adverse media. Know your business (KYB) plays an essential part in ensuring that you are not onboarding businesses or a merchant that can cause financial or reputational risks for your business. We perform real-time data checks and searches on companies, directors, beneficial owners, and ID documents to ensure KYB compliance. Our intelligent KYC solution can help your business run more efficiently, avoid identity risks, reduce operational costs, and verify customers remotely in seconds. It's an important part of the Customer Due Diligence process (CDD), during which the customer should prove his identity documents like Passport or ID card, as well as the residential address to check nationality and establishes the customer as a citizen of certain country. We're directly connected to thousands of up-to-date AML sources to check the actual status of your customers within PEPs, Sanctions, Regulatory watchlists, and Adverse media. Know your business (KYB) plays an essential part in ensuring that you are not onboarding businesses or a merchant that can cause financial or reputational risks for your business. We perform real-time data checks and searches on companies, directors, beneficial owners, and ID documents to ensure KYB compliance. Testimonials Thousands of customers love us and regularly share feedback! As a regulated cryptocurrency exchange platform, we must carefully comply with legal requirements and implement a comprehensive KYC procedure. We chose Identance as a reliable solution to carry out onboarding for our clients and automate our KYC process. Oleksandr Lutskevych CEO of CEX.IO Thousands of customers love us and regularly share feedback! As a regulated cryptocurrency exchange platform, we must carefully comply with legal requirements and implement a comprehensive KYC procedure. We chose Identance as a reliable solution to carry out onboarding for our clients and automate our KYC process. Watch Identance demo Take a look at the way our solution works to provide you with a seamless identity verification experience. Want to know how our system works? Take a look at the way our solution works to provide you with a seamless identity verification experience. Want to know how our system works? Possibilities Identance provides you with multiple opportunities for protecting your company and your users, as well as scaling your business. Custom risk assessment flows and scenarios At Identance, we take specific industry and client needs into account when choosing the risk management approach. Our practices may depend on user risk profiles, compliance requirements, industry benchmarks, and more. On-demand compliance support and manual review In some cases, automatic verification does not provide the results you need. That is what our in-house agents are for. We can conduct a manual review of suspicious and high-risk users to ensure maximum security and compliance. Various branding and customization options Our verification solution can be smoothly integrated into the client's operations. We can customize UX in accordance with the client's brand book to create a seamless user experience. Identance provides you with multiple opportunities for protecting your company and your users, as well as scaling your business. Custom risk assessment flows and scenarios At Identance, we take specific industry and client needs into account when choosing the risk management approach. Our practices may depend on user risk profiles, compliance requirements, industry benchmarks, and more. On-demand compliance support and manual review In some cases, automatic verification does not provide the results you need. That is what our in-house agents are for. We can conduct a manual review of suspicious and high-risk users to ensure maximum security and compliance. Various branding and customization options Our verification solution can be smoothly integrated into the client's operations. We can customize UX in accordance with the client's brand book to create a seamless user experience. How to try and buy? Not sure if our solution is a fit for you? Start with a free trial! 01 Apply for a free trial Explore what we can offer within a 15-day period and choose the service that meets your objectives. 02 Test the system Perform your own test and talk to our sales to ask any questions related to our product & services. 03 Make a payment We guarantee the security of all payments. Choose the most suitable payment method. 04 Enjoy the result Enjoy the cutting-edge solution that offers immaculate verification results. 01 Apply for a free trial Explore what we can offer within a 15-day period and choose the service that meets your objectives. 02 Test the system Perform your own test and talk to our sales to ask any questions related to our product & services. 03 Make a payment We guarantee the security of all payments. Choose the most suitable payment method. 04 Enjoy the result Enjoy the cutting-edge solution that offers immaculate verification results. How to try and buy? Not sure if our solution is a fit for you? Start with a free trial! Apply for a free trial Explore what we can offer within a 15-day period and choose the service that meets your objectives. Perform your own test and talk to our sales to ask any questions related to our product & services. We guarantee the security of all payments. Choose the most suitable payment method. Enjoy the cutting-edge solution that offers immaculate verification results. Apply for a free trial Explore what we can offer within a 15-day period and choose the service that meets your objectives. Perform your own test and talk to our sales to ask any questions related to our product & services. We guarantee the security of all payments. Choose the most suitable payment method. Enjoy the cutting-edge solution that offers immaculate verification results. Download Application Talk to our sales, view a demo, and see with your own eyes what to expect from our product. Talk to our sales, view a demo, and see with your own eyes what to expect from our product. Anti-fraud Anti-fraud features offered by Identance: IP to physical address check check the IP address location, including the city; compare the IP address location to the address provided by the user; check the IP address for VPN usage. IP fraud check IP address scoring; IP address lifetime check; IP fraud base check. E-mail fraud check Email scoring; Email lifetime check; Email fraud base check. Phone number verification Phone number scoring; Phone number lifetime check; Phone number verification and 2FA by SMS OTP. Want to know more about our anti-fraud features? Anti-fraud features offered by Identance: check the IP address location, including the city; compare the IP address location to the address provided by the user; check the IP address for VPN usage. IP address lifetime check; IP fraud base check. Email fraud base check. Phone number lifetime check; Phone number verification and 2FA by SMS OTP. Want to know more about our anti-fraud features? Use Cases Identity verification services provided by Identance can be effectively used across various industries, including iGaming, crypto, and fintech. iGaming The online gaming industry has always attracted fraudsters who use fake identities to gamble or seek money-laundering possibilities. Identity verification can help protect iGaming operators and existing users, as well as ensure that all participants are responsible adults. Identance offers a thorough but quick verification process that will not discourage potential new users. Crypto In the crypto world, identity verification protects organizations and user wallets from fraud and theft. To prevent malicious actors from taking advantage of security loopholes, it is important for crypto exchanges and other companies in the industry to incorporate identity verification in their onboarding process. Fintech Compliance with regulatory requirements is paramount when it comes to fintech enterprises. Identity verification helps ensure that all regulations are taken into account and all users are legitimate. With Identance's smooth and easy verification process, customers can be onboarded faster and experience no inconvenience in the process. Identity verification services provided by Identance can be effectively used across various industries, including iGaming, crypto, and fintech. The online gaming industry has always attracted fraudsters who use fake identities to gamble or seek money-laundering possibilities. Identity verification can help protect iGaming operators and existing users, as well as ensure that all participants are responsible adults. Identance offers a thorough but quick verification process that will not discourage potential new users. In the crypto world, identity verification protects organizations and user wallets from fraud and theft. To prevent malicious actors from taking advantage of security loopholes, it is important for crypto exchanges and other companies in the industry to incorporate identity verification in their onboarding process. Compliance with regulatory requirements is paramount when it comes to fintech enterprises. Identity verification helps ensure that all regulations are taken into account and all users are legitimate. With Identance's smooth and easy verification process, customers can be onboarded faster and experience no inconvenience in the process. Request a face-to-face demo! Talk to our sales, view a demo and see with your own eyes what to expect from our product. Request a face-to-face demo! Talk to our sales, view a demo and see with your own eyes what to expect from our product. Thousands of customers love us and regularly share feedback! As a trusted partner, Identance provides periodic feedback to improve the KYC process. They stay in close contact with our operations teams and are open to cooperation to reduce cases of fraud. Head of Customer Support SG Veteris (Koinal) Good job, team! The guys from Identance have created a service that fully covers the requirements of the crypto world. Identance has provided all the tools we needed to secure our business. Thank you for your exceptional service! As a regulated cryptocurrency exchange platform, we must carefully comply with legal requirements and implement a comprehensive KYC procedure. We chose Identance as a reliable solution to carry out onboarding for our clients and automate our KYC process."
  ]
}