{
  "company": "incode.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "The new standard for Digital Identity Incode seamlessly adds biometrics to your end-to-end customer experience. Request a demo Technology Smile to Onboard from Incode Technologies on Vimeo . Incode's Digital Identity Solution Incode uses multiple digital modalities to understand if someone is who they say they are. Face Recognition Incode's on device (edge) face recognition is top ranked by the US government. Liveness Detection Incode's liveness detection doesn't require user actions while using 3D light-modeling for maximum security. ID Validation Incode's ID validation models performs 100+ checks to confirm that a user's ID is authentic, untampered, and valid. Fingerprint ID Incode's fingerprint recognition captures and verifies a user's fingerprint with just a mobile device. Technology Contact Sales What will more smiles do for your business? Incode offers digital identity B2B solutions that revolutionize institutions, retailers, startups, and global companies. Contact Sales Smile to onboard Users can apply for a new bank account or credit card in under 60 seconds - without downloading an app. Auto capturing. Hold still... Technology Request a Demo Smile to login Think Apple FaceID but for iOS, Android and web. Very fast, and you own your user's data. Face the camera to Technology Request a Demo Smile to greet Users are automatically recognized at the bank with just their face. Technology Request a Demo Smile to withdraw Users can withdraw money from the ATM without their debit card. Face the Camera Technology Request a Demo Smile for rewards Users can earn loyalty points at their favorite stores with just their face. No more membership cards. Easy POS integration. Technology Request a Demo Smile to pay Users can pay for goods and services with just their face. No cash or credit card needed. Technology Request a Demo The new standard for Digital Identity Incode seamlessly adds biometrics to your end-to-end customer experience. Request a demo Technology Smile to Onboard from Incode Technologies on Vimeo . The new standard for Digital Identity Incode seamlessly adds biometrics to your end-to-end customer experience. Request a demo Technology Smile to Onboard from Incode Technologies on Vimeo . The new standard for Digital Identity Incode seamlessly adds biometrics to your end-to-end customer experience. Smile to Onboard from Incode Technologies on Vimeo . Incode's Digital Identity Solution Incode uses multiple digital modalities to understand if someone is who they say they are. Face Recognition Incode's on device (edge) face recognition is top ranked by the US government. Liveness Detection Incode's liveness detection doesn't require user actions while using 3D light-modeling for maximum security. ID Validation Incode's ID validation models performs 100+ checks to confirm that a user's ID is authentic, untampered, and valid. Fingerprint ID Incode's fingerprint recognition captures and verifies a user's fingerprint with just a mobile device. Technology Contact Sales Incode's Digital Identity Solution Incode uses multiple digital modalities to understand if someone is who they say they are. Face Recognition Incode's on device (edge) face recognition is top ranked by the US government. Liveness Detection Incode's liveness detection doesn't require user actions while using 3D light-modeling for maximum security. ID Validation Incode's ID validation models performs 100+ checks to confirm that a user's ID is authentic, untampered, and valid. Fingerprint ID Incode's fingerprint recognition captures and verifies a user's fingerprint with just a mobile device. Technology Contact Sales Incode's Digital Identity Solution Incode uses multiple digital modalities to understand if someone is who they say they are. Incode's on device (edge) face recognition is top ranked by the US government. Incode's liveness detection doesn't require user actions while using 3D light-modeling for maximum security. Incode's ID validation models performs 100+ checks to confirm that a user's ID is authentic, untampered, and valid. Incode's fingerprint recognition captures and verifies a user's fingerprint with just a mobile device. What will more smiles do for your business? Incode offers digital identity B2B solutions that revolutionize institutions, retailers, startups, and global companies. Contact Sales Smile to onboard Users can apply for a new bank account or credit card in under 60 seconds - without downloading an app. Auto capturing. Hold still... Technology Request a Demo Smile to login Think Apple FaceID but for iOS, Android and web. Very fast, and you own your user's data. Face the camera to Technology Request a Demo Smile to greet Users are automatically recognized at the bank with just their face. Technology Request a Demo Smile to withdraw Users can withdraw money from the ATM without their debit card. Face the Camera Technology Request a Demo Smile for rewards Users can earn loyalty points at their favorite stores with just their face. No more membership cards. Easy POS integration. Technology Request a Demo Smile to pay Users can pay for goods and services with just their face. No cash or credit card needed. Technology Request a Demo What will more smiles do for your business? Incode offers digital identity B2B solutions that revolutionize institutions, retailers, startups, and global companies. Contact Sales What will more smiles do for your business? Incode offers digital identity B2B solutions that revolutionize institutions, retailers, startups, and global companies. Smile to onboard Users can apply for a new bank account or credit card in under 60 seconds - without downloading an app. Auto capturing. Hold still... Technology Request a Demo Users can apply for a new bank account or credit card in under 60 seconds - without downloading an app. Smile to login Think Apple FaceID but for iOS, Android and web. Very fast, and you own your user's data. Face the camera to Technology Request a Demo Think Apple FaceID but for iOS, Android and web. Very fast, and you own your user's data. Smile to greet Users are automatically recognized at the bank with just their face. Technology Request a Demo Users are automatically recognized at the bank with just their face. Smile to withdraw Users can withdraw money from the ATM without their debit card. Face the Camera Technology Request a Demo Users can withdraw money from the ATM without their debit card. Smile for rewards Users can earn loyalty points at their favorite stores with just their face. No more membership cards. Easy POS integration. Technology Request a Demo Users can earn loyalty points at their favorite stores with just their face. No more membership cards. Easy POS integration. Smile to pay Users can pay for goods and services with just their face. No cash or credit card needed. Technology Request a Demo Users can pay for goods and services with just their face. No cash or credit card needed."
  ]
}