{
  "company": "interbio.id",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 4
    }
  },
  "sample_docs": [
    "The solution enables customers to easily and securely store their ID information. Biometrics authentication can generate timestamped logs of positive and negative face or fingerprints recognition verifications done across the board. Smart cards or purpose built hardware are no longer required – the proposed solution simply needs a smartphone with the app and the person to verify identity. Our proven Civil Identity Management solution has all the components ready for a country or institution to deploy a foundational ID system. It is composed of suit of applications for enrollment, adjudication, card / ID issuance and monitoring, biometric middleware and IDMS Database (Identity Management System Database for the core components for managing life cycle of the Identity). Solution : Criminal Identity Management Primarily aimed at modernizing border checkpoints for augmenting security and automating for improved facilitation. Biometrics and Smart ID Documents are the key technologies. Leveraging BIG © , we provide reliable solutions for border management at airports, seaports, and land-based points of crossing. The BIG © platform integrates seamlessly with third party equipment such as kiosks, biometric e-passports, face capture stations at immigrations booths, e-gates and irises from a distance devices. Solution : Mobile ID A suite of verification and identification solutions dedicated for mobile environments, seamlessly integrates with existing identity infrastructure. Range of custom multi-interface and multi-biometric Hand-held Terminals (HHTs) or mobile phones. Solution : Healthcare Insurance Verification and Management An innovative and disruptive technology to mitigate the issues faced by state-owned and private Insurance Institution in verifying its members properly, automatically and in a timely manner. Our solution may transform manual verification to automated verification (online or offline) to help reduce fraud from non-eligible person who claim the benefit and to drastically cut down long verification process. Solution : e-KYC (electronic Know Your Customer) Providing seamless KYC electronically and securely through mobile or web application leveraging BioCheck™ Platform to prevent fake account registration, identity fraud, and abnormal financial transaction (such as: payment transfer, withdrawal, etc). Solution Specifics: Verification by Customer's smartphone or Client's application Simple, fast, and reliable way to verify prospective customer through face recognition against National ID Database owner (in Indonesia refers to Ditjen Dukcapil in Ministry of Home Affairs) Verification by Customer's smartphone or Client's application Simple, fast, and reliable way to verify prospective customer through face recognition against National ID Database owner (in Indonesia refers to Ditjen Dukcapil in Ministry of Home Affairs) Market Place for Loans Online Lenders-NBFCs using own capital All form of lending market places including Peer-to-Peer lenders and market place that connect non-institutional borrowers and with institutional and non-institutional lenders. Also, includes crowd funding and equity funding platforms. NBFCs that use alternative scoring and digital channels for acquisition. Merchant Payments and PoS Services Service that enable transfer of funds for various use cases - P2P (Person to Person), P2M (Person to Merchant), G2P (Government to Person). Service targeted at both Payee and Merchants by enabling requisite payment infrastructure through mobile or other technologies. Wealth advisory for mass affluent segments delivered through technology governed rules and investment strategies. Tax Filling and Processing Spend management and financial planning Tools and services for managing personal expenses and spendings; also includes tools for tracking personal credit score and credit planning. Services that utilize many data points such as financial transactions, spending patterns to build risk profile of customers, this provides an alternate to traditional underwriting methods that are unable to serve people with limited credit data.",
    "InterBio is the leading provider of biometrics and large-scale identity solutions based in Indonesia, as well as global enabler of digital transformation. With state-of-the-art technology, a robust platform, and core teams in Indonesia and India, the company collaborates with partners from the US, Europe, and Asia. Our platform are built on core technologies, including face, finger, and iris biometrics, which are ranked among the top tiers in the NIST benchmark. InterBio is a Digital Transformation Management Solution Company National Biometric Identity anables multiple uses and benefits for citizens We offer custom solutions that meet the unique and varied requirement of our customers A biometric authentication based e-KYC platform InterBio Biometrics Identity Grid (I-BIG), the end-to-end identity management suite Barcode technology that stores your biometrics securely encrypted in it A FR based video surveillance product Image analysis to detect spoofs or frauds Fair and secure election Worker access and authorization Identification to find the target Monitoring & identifying with several modalities Interbio di Konferensi DTI-CX 2025, Paparkan Kontribusi untuk Transformasi Digital... Interbio di Konferensi DTI-CX 2025, Paparkan Kontribusi untuk Transformasi Digital... Foto: Dok. Interbio Perhelatan digital besar berskala internasional, DTI-CX 2025 kembali hadir pada 6-7 Agustus 2025. Serangkaian agenda mulai dari opening... Interbio Bicara Transformasi Digital dalam Discussion Session DTI-CX 2025 Interbio Bicara Transformasi Digital dalam Discussion Session DTI-CX 2025 Foto: Dok. DTI-CX 2025 Sebagai salah satu penggerak transformasi digital baik di Indonesia maupun kancah internasional, Interbio turut mendukung dan... Interbio dan LSPR Indonesia dalam Aksi Pembangunan Masyarakat di Sukabumi Interbio dan LSPR Indonesia dalam Aksi Pembangunan Masyarakat di Sukabumi Foto: Dok. LSPR Indonesia Pada 10-12 Juli 2025, LSPR Indonesia – melalui komunitas Bumisantara – bersama Interbio mengadakan program pemberdayaan... TOTM InterBio Gelar Cybersecurity Awareness Training TOTM InterBio Gelar Cybersecurity Awareness Training Sebagai salah satu perusahaan teknologi yang aktif dalam pengembangan digital transformation di Indonesia dan global, isu keamanan siber (cybersecurity) tentu menjadi... Berbagi Kebahagiaan di Panti Tresna Werdha Budi Mulia 1 Berbagi Kebahagiaan di Panti Tresna Werdha Budi Mulia 1 Sebagai makhluk sosial, sudah sepatutnya bagi kita untuk berbagi dengan sesama. InterBio, dalam rangka menyemarakkan bulan Ramadhan dan menjalankan agenda... InterBio Dukung Rangkaian Acara Hari Disabilitas Internasional 2024 InterBio Dukung Rangkaian Acara Hari Disabilitas Internasional 2024 Kementerian Sosial RI menggelar rangkaian acara Hari Disabilitas Internasional 2024 pada 1-3 Desember 2024 di Taman Ismail Marzuki, Jakarta Pusat....",
    "get a quote Company Overview Interbio is the leading identity management biometric software solutions company. read more Potential Uses National Biometric identity enables multiple uses and benefits for the citizens. read more Capabilities We offer custom solutions that meet the unique and varied requirements of our customers. read more Products and Solutions I-BIG™ An innovative, state of the art, grid computing based enterprise platform that supports all your current and future identity management needs I-B-ENROLLER™ A complete enrolment suite for Multi-biometric and biographic data capture I-B-CAT™ I-B-CAT™ is a compact, biometric terminal specifically designed fo standalone identity authentication I-BIG-LE™ MINEX NIST and INCITS 378 compliant fingerprint algorithm I-BIG-FRS™ Achieve large-scale and high performance facial recognition requirements leveraging Interbio Identity Grid (BIGTM) I-B-MOBILE™ A suite of verification & identification solutions dedicated for mobile environments To help our customer do things efficiently. request a call back. Would you like to speak to one of our biometric specialists over the phone? Submit your details and Interbio will be in touch with you shortly. You can also email us if you would prefer. Headquarter Office 88, 3rd Floor, Jl. Casablanca Raya Kav. 88, Jakarta 12870 +62 21 2290 2348 info@interbio.id Interbio is the leading identity management biometric software solutions company. National Biometric identity enables multiple uses and benefits for the citizens. We offer custom solutions that meet the unique and varied requirements of our customers. An innovative, state of the art, grid computing based enterprise platform that supports all your current and future identity management needs A complete enrolment suite for Multi-biometric and biographic data capture I-B-CAT™ is a compact, biometric terminal specifically designed fo standalone identity authentication MINEX NIST and INCITS 378 compliant fingerprint algorithm Achieve large-scale and high performance facial recognition requirements leveraging Interbio Identity Grid (BIGTM) A suite of verification & identification solutions dedicated for mobile environments Would you like to speak to one of our biometric specialists over the phone? Submit your details and Interbio will be in touch with you shortly. You can also email us if you would prefer. Office 88, 3rd Floor, Jl. Casablanca Raya Kav. 88, Jakarta 12870 Office 88, 3rd Floor, Jl. Casablanca Raya Kav. 88, Jakarta 12870 +62 21 2290 2348 +62 21 2290 2348",
    "Think Your Mask Makes You Invisible To Facial Recognition? Not So Fast, AI Companies Say oleh admin 8 July 2020 (CNN Business) The future of facial recognition technology may depend on one very specific part of the face: the area around the eyes. Before the global pandemic, facial recognition systems typically worked by comparing measurements between different facial features in one image to those in another picture. But when you're wearing a mask over your nose, mouth, and cheeks, you're offering up a fraction of the information normally used to figure out your identity. Now, numerous facial recognition companies say they are focusing on better identifying people based on the portion of the face above the nose and, in particular, the eye region. The stakes are high to get it right, and soon. \"If the [facial recognition] companies aren't looking at this, aren't taking it seriously, I don't foresee them being around much longer,\" said Shaun Moore, CEO of Trueface, whose facial recognition technology is used by the US Air Force to authenticate the identities of people entering bases. For many individuals and privacy advocates, it may be a comforting thought that a mask could offer some measure of invisibility from computerized surveillance. But for facial recognition businesses, it poses a unique challenge at a moment when the technology appears to be in even greater demand. Facial recognition technology has grown in prevalence — and controversy — in recent years, popping up everywhere from airport check-in lines to police departments and drugstores. And it may become even more popular as businesses look to contact-free security options because of the pandemic. Yet while it could add a sense of security and convenience for businesses who roll it out, the technology has been widely criticized by privacy advocates for built-in racial biases and potential for misuse. A late July report on facial recognition algorithms and masked faces by federal researchers at the National Institute of Standards and Technology, or NIST, confirmed that many pre-Covid algorithms were not up to the task. The most accurate facial recognition algorithms that the lab tested failed to make a correct match between 5% and 50% of the time. There was one key caveat, however: All the algorithms NIST tested were submitted before mid-March. In the months since then, a number of artificial intelligence companies have said they're working to ensure their facial recognition technology can figure out who is behind the mask. The visible portion of the face This spring, as the pandemic worsened, Tech5 cofounder Rahul Parthe started getting questions from customers about masks. Specifically, they wanted to know whether the accuracy of Tech5's facial-recognition software would be hampered by facial coverings. Tech5, which is based in Geneva, Switzerland, sells face, fingerprint and iris-recognition technologies to customers ranging from healthcare companies to law enforcement. Even before the pandemic, Parthe said, the company's technology had to deal with recognizing partly concealed faces, whether by religious face coverings or masks, which have been fairly common in southeast Asia for years. Nonetheless, its facial recognition technology appeared to perform worse with a mask — at least for the Tech5 algorithm NIST tested. The algorithm ranked in the top 10 on NIST's list, but it was still better at identifying non-masked faces than masked ones. Parthe said this algorithm was designed to identify someone who might be wearing big sunglasses or sporting facial hair they didn't have on a stored picture; it was not specifically meant to deal with face masks. Even before covid, Parthe said, the company was researching recognition technology that concentrates on the eyes and forehead, which it wants to combine with iris recognition to identify people. (Iris recognition requires a special scanner and tends to cost more than facial recognition.) Now, with an increasing number of requests for facial recognition software that works well with masks, Tech5 is working on a new algorithm that will ignore the face below the nose in a picture. The upper part of the face is also the focus of Venice, California-based Trueface. Like Tech5, the company's facial recognition technology was tested by NIST, though it fared worse. (It ranked 47 out of 89 algorithms on a test where researchers put a digital image of a light blue mask over the faces of people in visa photos.) \"Masks have definitely caused us to rethink how we make our processes more efficient with the algorithms,\" Moore said. To improve on this, Moore said the company's researchers are currently working on just analyzing the visible portion of the face, rather than first trying to detect, say, a mask or a pair of sunglasses. By ignoring those objects, Trueface may speed up the overall process of recognizing the person in an image. Moore hopes this will be rolled out in four to six weeks. There are risks to this approach. Facial recognition in general has come under growing scrutiny due to concerns about its accuracy. In late 2019, for instance, a different NIST report found extensive racial bias in almost 200 facial recognition algorithms, with racial minorities much more likely to be misidentified than white people. Judging by the results of NIST's latest report on masks, this could be even more of a problem when a computer is relying on much less data about the face than it typically would. But focusing on the area of the face around the eyes and forehead makes a lot of sense to Marios Savvides, a professor at Carnegie Mellon University who studies biometric identification. Savvides said the eye and eyebrow area (which is often referred to as the periocular region) is the part of the face that changes the least as you age, even if you gain weight. This means it's likely to look quite similar in different images of the same person, even if other parts of your face (your lips, for instance) grew or shrank. \"It's a fortuitous finding in these times,\" he said. Accurate technologies can also be harmful While improving the accuracy of facial recognition for mask wearers could help businesses that want to use the technology — Trueface, for example, is now seeing demand for facial recognition to avoid employees touching key cards — it raises a host of accuracy and privacy issues. Clare Garvie, a researcher at the Georgetown Law Center on Privacy and Technology, is concerned that algorithms that are adjusted to better identify masked faces are simply going to become less accurate because they have less information to measure. \"I just see the misidentification risk vastly increases because they have less biometric to go off of,\" she said. \"It doesn't matter how they tune the algorithm.\" Maria De-Arteaga, an assistant professor at the University of Texas at Austin who studies algorithmic fairness and accountability, worries that masks meant to prevent Covid are providing reasonable-sounding justification for developing technology that would otherwise receive much more scrutiny. If it were being developed to identify people covering their faces at protests, for instance, it would yield a different reaction, she said. \"Accurate technologies can also be very harmful,\" she said. Even if these new algorithms succeed, there may still be ways to cloak yourself to facial recognition software. If you're wearing a mask and sunglasses, for instance, hardly any of your face would be visible in a picture. \"There's not much you can do with that,\" Savvides said. Source : https://amp-cnn-com.cdn.ampproject.org/c/s/amp.cnn.com/cnn/2020/08/12/tech/face-recognition-masks/index.html Related Posts 20 August 2025 Interbio di Konferensi DTI-CX 2025, Paparkan Kontribusi untuk Transformasi Digital... 21 July 2025 Interbio Bicara Transformasi Digital dalam Discussion Session DTI-CX 2025 18 July 2025 Interbio dan LSPR Indonesia dalam Aksi Pembangunan Masyarakat di Sukabumi 28 May 2025 TOTM InterBio Gelar Cybersecurity Awareness Training 1 2 3 4 » Think Your Mask Makes You Invisible To Facial Recognition? Not So Fast, AI Companies Say oleh admin 8 July 2020 (CNN Business) The future of facial recognition technology may depend on one very specific part of the face: the area around the eyes. Before the global pandemic, facial recognition systems typically worked by comparing measurements between different facial features in one image to those in another picture. But when you're wearing a mask over your nose, mouth, and cheeks, you're offering up a fraction of the information normally used to figure out your identity. Now, numerous facial recognition companies say they are focusing on better identifying people based on the portion of the face above the nose and, in particular, the eye region. The stakes are high to get it right, and soon. \"If the [facial recognition] companies aren't looking at this, aren't taking it seriously, I don't foresee them being around much longer,\" said Shaun Moore, CEO of Trueface, whose facial recognition technology is used by the US Air Force to authenticate the identities of people entering bases. For many individuals and privacy advocates, it may be a comforting thought that a mask could offer some measure of invisibility from computerized surveillance. But for facial recognition businesses, it poses a unique challenge at a moment when the technology appears to be in even greater demand. Facial recognition technology has grown in prevalence — and controversy — in recent years, popping up everywhere from airport check-in lines to police departments and drugstores. And it may become even more popular as businesses look to contact-free security options because of the pandemic. Yet while it could add a sense of security and convenience for businesses who roll it out, the technology has been widely criticized by privacy advocates for built-in racial biases and potential for misuse. A late July report on facial recognition algorithms and masked faces by federal researchers at the National Institute of Standards and Technology, or NIST, confirmed that many pre-Covid algorithms were not up to the task. The most accurate facial recognition algorithms that the lab tested failed to make a correct match between 5% and 50% of the time. There was one key caveat, however: All the algorithms NIST tested were submitted before mid-March. In the months since then, a number of artificial intelligence companies have said they're working to ensure their facial recognition technology can figure out who is behind the mask. The visible portion of the face This spring, as the pandemic worsened, Tech5 cofounder Rahul Parthe started getting questions from customers about masks. Specifically, they wanted to know whether the accuracy of Tech5's facial-recognition software would be hampered by facial coverings. Tech5, which is based in Geneva, Switzerland, sells face, fingerprint and iris-recognition technologies to customers ranging from healthcare companies to law enforcement. Even before the pandemic, Parthe said, the company's technology had to deal with recognizing partly concealed faces, whether by religious face coverings or masks, which have been fairly common in southeast Asia for years. Nonetheless, its facial recognition technology appeared to perform worse with a mask — at least for the Tech5 algorithm NIST tested. The algorithm ranked in the top 10 on NIST's list, but it was still better at identifying non-masked faces than masked ones. Parthe said this algorithm was designed to identify someone who might be wearing big sunglasses or sporting facial hair they didn't have on a stored picture; it was not specifically meant to deal with face masks. Even before covid, Parthe said, the company was researching recognition technology that concentrates on the eyes and forehead, which it wants to combine with iris recognition to identify people. (Iris recognition requires a special scanner and tends to cost more than facial recognition.) Now, with an increasing number of requests for facial recognition software that works well with masks, Tech5 is working on a new algorithm that will ignore the face below the nose in a picture. The upper part of the face is also the focus of Venice, California-based Trueface. Like Tech5, the company's facial recognition technology was tested by NIST, though it fared worse. (It ranked 47 out of 89 algorithms on a test where researchers put a digital image of a light blue mask over the faces of people in visa photos.) \"Masks have definitely caused us to rethink how we make our processes more efficient with the algorithms,\" Moore said. To improve on this, Moore said the company's researchers are currently working on just analyzing the visible portion of the face, rather than first trying to detect, say, a mask or a pair of sunglasses. By ignoring those objects, Trueface may speed up the overall process of recognizing the person in an image. Moore hopes this will be rolled out in four to six weeks. There are risks to this approach. Facial recognition in general has come under growing scrutiny due to concerns about its accuracy. In late 2019, for instance, a different NIST report found extensive racial bias in almost 200 facial recognition algorithms, with racial minorities much more likely to be misidentified than white people. Judging by the results of NIST's latest report on masks, this could be even more of a problem when a computer is relying on much less data about the face than it typically would. But focusing on the area of the face around the eyes and forehead makes a lot of sense to Marios Savvides, a professor at Carnegie Mellon University who studies biometric identification. Savvides said the eye and eyebrow area (which is often referred to as the periocular region) is the part of the face that changes the least as you age, even if you gain weight. This means it's likely to look quite similar in different images of the same person, even if other parts of your face (your lips, for instance) grew or shrank. \"It's a fortuitous finding in these times,\" he said. Accurate technologies can also be harmful While improving the accuracy of facial recognition for mask wearers could help businesses that want to use the technology — Trueface, for example, is now seeing demand for facial recognition to avoid employees touching key cards — it raises a host of accuracy and privacy issues. Clare Garvie, a researcher at the Georgetown Law Center on Privacy and Technology, is concerned that algorithms that are adjusted to better identify masked faces are simply going to become less accurate because they have less information to measure. \"I just see the misidentification risk vastly increases because they have less biometric to go off of,\" she said. \"It doesn't matter how they tune the algorithm.\" Maria De-Arteaga, an assistant professor at the University of Texas at Austin who studies algorithmic fairness and accountability, worries that masks meant to prevent Covid are providing reasonable-sounding justification for developing technology that would otherwise receive much more scrutiny. If it were being developed to identify people covering their faces at protests, for instance, it would yield a different reaction, she said. \"Accurate technologies can also be very harmful,\" she said. Even if these new algorithms succeed, there may still be ways to cloak yourself to facial recognition software. If you're wearing a mask and sunglasses, for instance, hardly any of your face would be visible in a picture. \"There's not much you can do with that,\" Savvides said. Source : https://amp-cnn-com.cdn.ampproject.org/c/s/amp.cnn.com/cnn/2020/08/12/tech/face-recognition-masks/index.html Think Your Mask Makes You Invisible To Facial Recognition? Not So Fast, AI Companies Say (CNN Business) The future of facial recognition technology may depend on one very specific part of the face: the area around the eyes. Before the global pandemic, facial recognition systems typically worked by comparing measurements between different facial features in one image to those in another picture. But when you're wearing a mask over your nose, mouth, and cheeks, you're offering up a fraction of the information normally used to figure out your identity. Now, numerous facial recognition companies say they are focusing on better identifying people based on the portion of the face above the nose and, in particular, the eye region. The stakes are high to get it right, and soon. \"If the [facial recognition] companies aren't looking at this, aren't taking it seriously, I don't foresee them being around much longer,\" said Shaun Moore, CEO of Trueface, whose facial recognition technology is used by the US Air Force to authenticate the identities of people entering bases. For many individuals and privacy advocates, it may be a comforting thought that a mask could offer some measure of invisibility from computerized surveillance. But for facial recognition businesses, it poses a unique challenge at a moment when the technology appears to be in even greater demand. Facial recognition technology has grown in prevalence — and controversy — in recent years, popping up everywhere from airport check-in lines to police departments and drugstores. And it may become even more popular as businesses look to contact-free security options because of the pandemic. Yet while it could add a sense of security and convenience for businesses who roll it out, the technology has been widely criticized by privacy advocates for built-in racial biases and potential for misuse. A late July report on facial recognition algorithms and masked faces by federal researchers at the National Institute of Standards and Technology, or NIST, confirmed that many pre-Covid algorithms were not up to the task. The most accurate facial recognition algorithms that the lab tested failed to make a correct match between 5% and 50% of the time. There was one key caveat, however: All the algorithms NIST tested were submitted before mid-March. In the months since then, a number of artificial intelligence companies have said they're working to ensure their facial recognition technology can figure out who is behind the mask. The visible portion of the face This spring, as the pandemic worsened, Tech5 cofounder Rahul Parthe started getting questions from customers about masks. Specifically, they wanted to know whether the accuracy of Tech5's facial-recognition software would be hampered by facial coverings. Tech5, which is based in Geneva, Switzerland, sells face, fingerprint and iris-recognition technologies to customers ranging from healthcare companies to law enforcement. Even before the pandemic, Parthe said, the company's technology had to deal with recognizing partly concealed faces, whether by religious face coverings or masks, which have been fairly common in southeast Asia for years. Nonetheless, its facial recognition technology appeared to perform worse with a mask — at least for the Tech5 algorithm NIST tested. The algorithm ranked in the top 10 on NIST's list, but it was still better at identifying non-masked faces than masked ones. Parthe said this algorithm was designed to identify someone who might be wearing big sunglasses or sporting facial hair they didn't have on a stored picture; it was not specifically meant to deal with face masks. Even before covid, Parthe said, the company was researching recognition technology that concentrates on the eyes and forehead, which it wants to combine with iris recognition to identify people. (Iris recognition requires a special scanner and tends to cost more than facial recognition.) Now, with an increasing number of requests for facial recognition software that works well with masks, Tech5 is working on a new algorithm that will ignore the face below the nose in a picture. The upper part of the face is also the focus of Venice, California-based Trueface. Like Tech5, the company's facial recognition technology was tested by NIST, though it fared worse. (It ranked 47 out of 89 algorithms on a test where researchers put a digital image of a light blue mask over the faces of people in visa photos.) \"Masks have definitely caused us to rethink how we make our processes more efficient with the algorithms,\" Moore said. To improve on this, Moore said the company's researchers are currently working on just analyzing the visible portion of the face, rather than first trying to detect, say, a mask or a pair of sunglasses. By ignoring those objects, Trueface may speed up the overall process of recognizing the person in an image. Moore hopes this will be rolled out in four to six weeks. There are risks to this approach. Facial recognition in general has come under growing scrutiny due to concerns about its accuracy. In late 2019, for instance, a different NIST report found extensive racial bias in almost 200 facial recognition algorithms, with racial minorities much more likely to be misidentified than white people. Judging by the results of NIST's latest report on masks, this could be even more of a problem when a computer is relying on much less data about the face than it typically would. But focusing on the area of the face around the eyes and forehead makes a lot of sense to Marios Savvides, a professor at Carnegie Mellon University who studies biometric identification. Savvides said the eye and eyebrow area (which is often referred to as the periocular region) is the part of the face that changes the least as you age, even if you gain weight. This means it's likely to look quite similar in different images of the same person, even if other parts of your face (your lips, for instance) grew or shrank. \"It's a fortuitous finding in these times,\" he said. Accurate technologies can also be harmful While improving the accuracy of facial recognition for mask wearers could help businesses that want to use the technology — Trueface, for example, is now seeing demand for facial recognition to avoid employees touching key cards — it raises a host of accuracy and privacy issues. Clare Garvie, a researcher at the Georgetown Law Center on Privacy and Technology, is concerned that algorithms that are adjusted to better identify masked faces are simply going to become less accurate because they have less information to measure. \"I just see the misidentification risk vastly increases because they have less biometric to go off of,\" she said. \"It doesn't matter how they tune the algorithm.\" Maria De-Arteaga, an assistant professor at the University of Texas at Austin who studies algorithmic fairness and accountability, worries that masks meant to prevent Covid are providing reasonable-sounding justification for developing technology that would otherwise receive much more scrutiny. If it were being developed to identify people covering their faces at protests, for instance, it would yield a different reaction, she said. \"Accurate technologies can also be very harmful,\" she said. Even if these new algorithms succeed, there may still be ways to cloak yourself to facial recognition software. If you're wearing a mask and sunglasses, for instance, hardly any of your face would be visible in a picture. \"There's not much you can do with that,\" Savvides said."
  ]
}