{
  "company": "iveda.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.3333333333333333,
    "framing_market": 0.6666666666666666,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "Products & Services Managed Video Hosting Real-Time Remote Video Surveillance Express Surveillance System In-Vehicle Mobile Video Equipment Sales and Installation Get Service! Real-Time Remote Video Surveillance Equipment Sales and Installation Technology Cloud Computing How It Works Data Center Network Security Customer Interface Demo Partner Program Program Overview Our Partners Company About Us Careers Our Customers Testimonials Investors Press Room Contact Us",
    "We enable SERVICE PROVIDERS plug-and-play video surveillance offering Iveda hands you a fully-packaged Sentir cloud video surveillance platform, ready for bundling with your current offerings to your customers. Plug-and-play video surveillance for your customers Install Sentir at your datacenter, no upfront cost We enable plug-and-play video surveillance for your customers Ask us about our Sentir Licensing Program for fast go-to-market Immediate positive cashflow -Earn recurring monthly revenue -What you sell this month, becomes a perpetual revenue It all adds up! -Increase annual revenue per user (ARPU) -Enhance customer loyalty -No upfront fees, pay per camera activation Sentir is True Cloud Video Surveillance Platform Big Data Storage Technology - Software-Defined Storage - Scale-Out Storage - Online Replication - Thin Provisioning - Server Virtualization Environment Our Business Model Telcos ISPs Dealers and Integrators Cable Service Providers Home SMBs Enterprise Government Service Providers End Users Cloud Video Surveillance and Data Management Platform for licensing to telcos, data centers, ISPs, and other service providers. Sentir® is Iveda's proprietary cloud video surveillance and data management platform. The platform features video streaming and BIG DATA storage technology. It has the functionality of traditional DVRs (digital video recorders) and NVRs (network video recorders), but delivered from the cloud as an application. Iveda licenses Sentir to telecoms, data centers, ISPs, and cable service providers around the world for fast go-to-market implementation within their global infrastructure. It is easy to deploy and requires minimal capital investment. It utilizes and optimizes existing data center resources. Sentir is flexible and scalable, ideal for large number of subscribers. Iveda has over 10 years of experience in the security technology industry, espousing cloud-based video technology since its inception. Cloud Video Surveillance Offering for Service Providers Sentir enables telecoms and other service providers a video surveillance as a service (VSaaS) offering to their customers on a subscription basis. The offering is designed as a monthly service for the mass market. VSaaS is another value-add service for their customers that can be bundled with their existing products. Consequently, enhancing customer value, satisfaction, and loyalty. In addition, this will help telecoms penetrate the managed video surveillance market, differentiating themselves and gaining significant competitive edge over their competitors. To simplify and expedite going to market, Iveda' s offering includes ZEE® plug and play IP cameras ideal for mass distribution. These cameras are easy to set up – no technical expertise required – and easy to maintain. The ZEE camera line includes indoor, outdoor, fixed, and PT (Pan/Tilt) cameras. Iveda also offers IvedaHome home automation and security system. IvedaHome is easy to install, because it runs on WiFi. It uses a smartphone or tablet to manage and access the system from the cloud. Headlines December 31, 2018 IvedaAI Pilot in Charter School and Banking and Law Enforcement in Mexico September 25, 2018 Iveda Introduces Patented Next-Gen AI Search Technology for Video Surveillance June 19, 2018 Iveda Wins $2.4 Million Government Contracts in Taiwan October 24, 2017 Iveda Expects $50 Million in Safe City Deployments in Vietnam through 2018 April 20, 2017 Iveda Wins Safe City Deployments with Vietnam Telecom December 15, 2016 Iveda Gains Momentum into 2017 with $2.6 Million Safe City Projects with Taiwan's Chunghwa Telecom November 17, 2016 Iveda Expands Safe City Initiative to Vietnam November 3, 2016 Iveda Receives Deposit for a 1,000-camera Order for Philippines Telecom October 20, 2016 Iveda Receives Deposit for a 2,000-camera Follow-on Order for Vietnam Telecom June 30, 2016 Iveda Closes $500,000 Strategic Investment Transaction for more news Plug-and-Play Cloud Cameras Cloud Home Automation and Security System Since 2009, Iveda has had the SAFETY Act Designation from the U.S. Department of Homeland Security as a Qualified Anti-Terrorism Technology Provider. Iveda now has Certification and has been placed on the \"Approved Products Lists for Homeland Security.\" Sentir® is Iveda's proprietary cloud video surveillance and data management platform. The platform features video streaming and BIG DATA storage technology. It has the functionality of traditional DVRs (digital video recorders) and NVRs (network video recorders), but delivered from the cloud as an application. Iveda licenses Sentir to telecoms, data centers, ISPs, and cable service providers around the world for fast go-to-market implementation within their global infrastructure. It is easy to deploy and requires minimal capital investment. It utilizes and optimizes existing data center resources. Sentir is flexible and scalable, ideal for large number of subscribers. Iveda has over 10 years of experience in the security technology industry, espousing cloud-based video technology since its inception. Sentir enables telecoms and other service providers a video surveillance as a service (VSaaS) offering to their customers on a subscription basis. The offering is designed as a monthly service for the mass market. VSaaS is another value-add service for their customers that can be bundled with their existing products. Consequently, enhancing customer value, satisfaction, and loyalty. In addition, this will help telecoms penetrate the managed video surveillance market, differentiating themselves and gaining significant competitive edge over their competitors. To simplify and expedite going to market, Iveda' s offering includes ZEE® plug and play IP cameras ideal for mass distribution. These cameras are easy to set up – no technical expertise required – and easy to maintain. The ZEE camera line includes indoor, outdoor, fixed, and PT (Pan/Tilt) cameras. Iveda also offers IvedaHome home automation and security system. IvedaHome is easy to install, because it runs on WiFi. It uses a smartphone or tablet to manage and access the system from the cloud. for more news Cloud Home Automation and Security System Since 2009, Iveda has had the SAFETY Act Designation from the U.S. Department of Homeland Security as a Qualified Anti-Terrorism Technology Provider. Iveda now has Certification and has been placed on the \"Approved Products Lists for Homeland Security.\" A publicly-traded company under the stock symbol IVDA",
    "ZEE® wireless cameras are enabled for Sentir® cloud-video surveillance and data management platfrom. These are inexpensive, plug and play IP cameras. Especially designed with consumers and small businesses in mind,Sentir-hosted ZEE eliminates the many hours of network setup and upkeep. With Sentir, cameras in numerous locations may be accessed on one online dashboard on virtually any Internet-enabled smartphone, tablet or computer, wherever you are in the world. Because ZEE is hosted in the cloud, there is no video degradation regardless of the number of simultaneous users. The solution provides an inexpensive and easy to install enterprise-level video surveillance solution for home, business, and government entities. The ZEE camera line includes indoor, outdoor, fixed, and PT (Pan/Tilt) cameras. Request Information Watch video featuring sample applications. Applications ZEE Features and Benefits Easy to set up WiFi Cameras Day/night Portable – easy to relocate Continuous recording in the cloud 24/7 Web access to live & recorded video Manage all your cameras on a single dashboard Remote access from computer, smartphone or tablet Alert notifications on phone, not using text messaging Cloud-stored video is safe from being stolen or destroyed Share video with multiple users with no video degradation Web-based, no proprietary software to install Play downloaded video on any video player, no software required Display live video from your smartphone on the same ZEE dashboard Watch video highlighting ZEE's features and benefits. Watch simple ZEE set up steps. All ZEE Cameras are Sentir Enabled for Easy Set-up Z-3022 Indoor/Fixed H.264 Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720P HD Resolution (1280 x 720P) Support Wide Angle~105 deg Night Vision with IR CUT Support Wide Dynamic Range (WDR) 3-Zone Motion Detection Support ONVIF Built-in PIR Sensor Support 2-way Audio (Built-in microphone & speaker) Support IEEE 802.11 b/g/n Wireless Connection Z-3203-PT Indoor/Pan/Tilt/Zoom (PTZ) H.264 Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720 HD Resolution (1280 x 720P) H.264 Video Compression Night Vision with IR CUT & IR Range for 10m Support View Angle: Horizontal 355 degree, Vertical 90 degree Support 2 Way Audio Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet (RJ-45) Interface Connection Z-3504 Outdoor/Fixed H.264 Micro SD Slot for Local Storage Night Vision with IR CUT & IR Range for 10m 1280 x 960P Fixed Lens 3.6mm / F1.2 H.264 Video Compression Night Vision with IR CUT Support Audio Input (Optional) Support ONVIF & RTSP for integration Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet Interface Connection Waterproof ZEE® wireless cameras are enabled for Sentir® cloud-video surveillance and data management platfrom. These are inexpensive, plug and play IP cameras. Especially designed with consumers and small businesses in mind,Sentir-hosted ZEE eliminates the many hours of network setup and upkeep. With Sentir, cameras in numerous locations may be accessed on one online dashboard on virtually any Internet-enabled smartphone, tablet or computer, wherever you are in the world. Because ZEE is hosted in the cloud, there is no video degradation regardless of the number of simultaneous users. The solution provides an inexpensive and easy to install enterprise-level video surveillance solution for home, business, and government entities. The ZEE camera line includes indoor, outdoor, fixed, and PT (Pan/Tilt) cameras. Request Information Watch video featuring sample applications. Applications ZEE Features and Benefits Easy to set up WiFi Cameras Day/night Portable – easy to relocate Continuous recording in the cloud 24/7 Web access to live & recorded video Manage all your cameras on a single dashboard Remote access from computer, smartphone or tablet Alert notifications on phone, not using text messaging Cloud-stored video is safe from being stolen or destroyed Share video with multiple users with no video degradation Web-based, no proprietary software to install Play downloaded video on any video player, no software required Display live video from your smartphone on the same ZEE dashboard Watch video highlighting ZEE's features and benefits. Watch simple ZEE set up steps. All ZEE Cameras are Sentir Enabled for Easy Set-up Z-3022 Indoor/Fixed H.264 Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720P HD Resolution (1280 x 720P) Support Wide Angle~105 deg Night Vision with IR CUT Support Wide Dynamic Range (WDR) 3-Zone Motion Detection Support ONVIF Built-in PIR Sensor Support 2-way Audio (Built-in microphone & speaker) Support IEEE 802.11 b/g/n Wireless Connection Z-3203-PT Indoor/Pan/Tilt/Zoom (PTZ) H.264 Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720 HD Resolution (1280 x 720P) H.264 Video Compression Night Vision with IR CUT & IR Range for 10m Support View Angle: Horizontal 355 degree, Vertical 90 degree Support 2 Way Audio Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet (RJ-45) Interface Connection Z-3504 Outdoor/Fixed H.264 Micro SD Slot for Local Storage Night Vision with IR CUT & IR Range for 10m 1280 x 960P Fixed Lens 3.6mm / F1.2 H.264 Video Compression Night Vision with IR CUT Support Audio Input (Optional) Support ONVIF & RTSP for integration Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet Interface Connection Waterproof ZEE® wireless cameras are enabled for Sentir® cloud-video surveillance and data management platfrom. These are inexpensive, plug and play IP cameras. Especially designed with consumers and small businesses in mind,Sentir-hosted ZEE eliminates the many hours of network setup and upkeep. With Sentir, cameras in numerous locations may be accessed on one online dashboard on virtually any Internet-enabled smartphone, tablet or computer, wherever you are in the world. Because ZEE is hosted in the cloud, there is no video degradation regardless of the number of simultaneous users. The solution provides an inexpensive and easy to install enterprise-level video surveillance solution for home, business, and government entities. The ZEE camera line includes indoor, outdoor, fixed, and PT (Pan/Tilt) cameras. Watch video featuring sample applications. ZEE Features and Benefits Easy to set up Portable – easy to relocate Continuous recording in the cloud 24/7 Web access to live & recorded video Manage all your cameras on a single dashboard Remote access from computer, smartphone or tablet Alert notifications on phone, not using text messaging Cloud-stored video is safe from being stolen or destroyed Share video with multiple users with no video degradation Web-based, no proprietary software to install Play downloaded video on any video player, no software required Display live video from your smartphone on the same ZEE dashboard Watch video highlighting ZEE's features and benefits. Watch simple ZEE set up steps. All ZEE Cameras are Sentir Enabled for Easy Set-up Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720P HD Resolution (1280 x 720P) Support Wide Angle~105 deg Night Vision with IR CUT Support Wide Dynamic Range (WDR) Built-in PIR Sensor Support 2-way Audio (Built-in microphone & speaker) Support IEEE 802.11 b/g/n Wireless Connection Micro SD Slot for Local Storage Day/Night, Built-in IR LED Illuminators 720 HD Resolution (1280 x 720P) Night Vision with IR CUT & IR Range for 10m Support View Angle: Horizontal 355 degree, Vertical 90 degree Support 2 Way Audio Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet (RJ-45) Interface Connection Micro SD Slot for Local Storage Night Vision with IR CUT & IR Range for 10m Fixed Lens 3.6mm / F1.2 Night Vision with IR CUT Support Audio Input (Optional) Support ONVIF & RTSP for integration Support IEEE 802.11 b/g/n Wireless Connection Support Ethernet Interface Connection A publicly-traded company under the stock symbol IVDA"
  ]
}