{
  "company": "joyusing.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 34,
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 34,
      "0": 4
    }
  },
  "sample_docs": [
    "Vision Products Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera N300 Web Camera Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Optical Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Android Motherboard MOD3399 P801 Support Warranty How To Use Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera V160 Pro Book Scanner You can search for your product by name, model number or part number. Or, locate your product using the categories below.",
    "Vision Products Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera N300 Web Camera Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Optical Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Android Motherboard MOD3399 P801 Support Warranty How To Use Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera V160 Pro Book Scanner Please note that the latest downloads and updates are ready for you here.",
    "PRODUCTS Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF SUPPORT How To Use Download Center FAQ PRODUCTS Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF SUPPORT How To Use Download Center FAQ What is Paperless Office Views: 28 Author: Site Editor Publish Time: 2018-08-31 Origin: Site In a nutshell, paperless office means handling official business by Internet in stead of paper-based files. And now, most of office software in the market are capable of realizing documents transmission without paper, but meanwhile it also needs other equipment to digitalize. This new office mode has set up a new climate of low-cost of paper, and at the same time, it has also reduced the expenditure and protected the environment. Actually the concept of paperless office has appeared since long ago, and the rapid developing of smart phone, tablet computer, cloud technology and other collaboration software pushes this concept into mainstream. Advantages 1. Improve effectiveness on job. A paperless office has abilities of resource sharing and cooperative work. Finish the complicated and chaotic work by several clicks rather than wasting time on visiting or tidying. Through the customized office system, seamless communication can be realized between every single employee in the company, that's what dramatically promote efficiency and lighten the load on staff. 2. Environmentally friendly. Sharp reduction of paper cost will not only make a contribution to protecting the environment, but also reduce the spending for company. 3. Reduce human caused errors. In the traditional office mode, the transmission of documents has to face the risk of human errors, and the more steps there are, the more risk it takes. Paperless office has perfectly solved this problem. Even though for those confidential files, the uniqueness can be guaranteed by encryption and hiding code. In the past people are more likely to believe what is written on the paper is true and safe and digital files could be easily copied or faked, especially for those never look into this new office mode. No matter which point you stand at, the paperless office is a inevitable trend and look around, the quiet revolution is taking place. In a nutshell, paperless office means handling official business by Internet in stead of paper-based files. And now, most of office software in the market are capable of realizing documents transmission without paper, but meanwhile it also needs other equipment to digitalize. This new office mode has set up a new climate of low-cost of paper, and at the same time, it has also reduced the expenditure and protected the environment. Actually the concept of paperless office has appeared since long ago, and the rapid developing of smart phone, tablet computer, cloud technology and other collaboration software pushes this concept into mainstream. 1. Improve effectiveness on job. A paperless office has abilities of resource sharing and cooperative work. Finish the complicated and chaotic work by several clicks rather than wasting time on visiting or tidying. Through the customized office system, seamless communication can be realized between every single employee in the company, that's what dramatically promote efficiency and lighten the load on staff. 2. Environmentally friendly. Sharp reduction of paper cost will not only make a contribution to protecting the environment, but also reduce the spending for company. 3. Reduce human caused errors. In the traditional office mode, the transmission of documents has to face the risk of human errors, and the more steps there are, the more risk it takes. Paperless office has perfectly solved this problem. Even though for those confidential files, the uniqueness can be guaranteed by encryption and hiding code. In the past people are more likely to believe what is written on the paper is true and safe and digital files could be easily copied or faked, especially for those never look into this new office mode. No matter which point you stand at, the paperless office is a inevitable trend and look around, the quiet revolution is taking place. Easy Scanning with HD Plus Easy Scanning with HD Plus Keeping Your Book Pages Opened with PageStay! Keeping Your Book Pages Opened with PageStay! What is Document Scanner? What is Document Scanner? Joy-Scan V160 Smart Book Scanner Joy-DocCam K Series A3 5MP/8MP/16MP Portable Document Scanner Joy-DocCam L Series 5MP/8MP Portable Document Scanner Joy-DocCam Dual-Camera Liveness Detection Document Scanner Subscribe to our newsletter to get the latest news and special deals.",
    "Vision Products Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera N300 Web Camera Document Camera V500 V500S V500M Book Scanner Joy-BookScan V160 Joy-BookScan V160 Pro Joy-BookScan CT160 Document Scanner Joy-CamScan K Series Joy-CamScan C Series Joy-CamScan E Series Joy-CamScan L Series Industrial Camera Joy-SciCam G2 4K Video Conference Camera Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Optical Camera Module Face Recognition Module Joy-BioCam DC 1330 Portrait Camera Module 4K Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module 2MP HD Camera Module 1080P Starlight Camera Module 180° Distortion Correction Camera Module Optical Camera Module 30X Optical Zoom Document Scanning Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module 16.0 MP USB Camera Module 12.0 MP Camera Module 5.0 MP Camera Module Android Motherboard MOD3399 P801 Support Warranty How To Use Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera Download Document Camera Book Scanner Web Camera V500s Document Camera V500W Document Camera V500 Document Camera V1XS Document Camera L140 Book Scanner V160 Pro Book Scanner L160 Book Scanner C500 Camera Scanner E500 Camera Scanner N200 Web Camera N300 Web Camera H800 Conference Camera Conference Camera V160 Pro Book Scanner",
    "PRODUCTS Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF SUPPORT How To Use Download Center FAQ PRODUCTS Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF Document Camera V600 V513 V500S-4K V500S V1X-4K V1XS V500/V500-4K V508 V500W Book Scanner V160 Pro V160 L140 L160 V320 V180 WebCam N300 N2020 N500 N800 N120 Camera Scanner E500 CT160 K Series C503AF SUPPORT How To Use Download Center FAQ Joy-DocCam K Series A3 5MP/8MP/16MP Portable Document Scanner Information counters data acquisition & identity verification preferred Document Scanner Patent design, A3 format, the king of integrated module expansion. 16 MP high resolution camera with A3 scan size JOYUSING K163 can scan drawing, pictures,newspaper, poster and any documents within A3(297mm×420mm) size. Flexible from A3 to A4 K163 scanner is with flexible arm to adjust from A3 to A4 shooting area. Easy to use with USB cable only Simply connect the USB cable to the K163,you can enjoy high-speed scanning. Expandable scanner with 3 USB2.0 ports and 1 USB type B port Can be connected to finger print reader, ID card reader etc. 360 degree horizontal rotation vice camera optional As video recording camera in Information Counter, it can record the customers or identity verification. Compact size compared to traditional scanner. 16.0M resolution promise high-level image quality Powerful OCR recognition from ABBYY Accurately convert scanned paper documents, images and PDFs to Word, Excel, TXT, searchable PDF and other formats. Powered by ABBYY's leading OCR technology, support more than 180 languages.The recognition rate reaches up to 98%, supporting the mixed recognition of multi-language, character, and number with the same layouts results as original images. JOYUSING document scanner makes digitizing processes fast and easy. JOYUSING software has strong image edit functions: rotate, characters adding, image cutting, saturation, contrast Ratio. It is specially designed for information counters which have very high requirement on high speed scanner. It can record the progress of any operation or demo for real time display applied in lab operation steps, product training and other demonstration. Different documents can be scanned and converted into PDF which can be checked on various devices. Suitable to scan documents, receipts, bills, certificates, books, 3D real objects etc. Print, Fax, Email, Office Integration JOYUSING K163 software can be connected to email, fax and printer to achieve office all-in-one. Specification of K series document scanner Subscribe to our newsletter to get the latest news and special deals."
  ]
}