{
  "company": "keyless.io",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 55,
    "-1": 8
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 55
    }
  },
  "sample_docs": [
    "Data Capture Data Capture Pursuant to Article 13 of the Regulation (EU) 2016/679 With this policy notice, provided pursuant to Article 13, Regulation (EU) 2016/679 (\" Regulation \" or \" GDPR \"), Keyless Technologies S.r.l. aims to provide you with the purposes of collecting and processing your data, which categories of data are processed, what are your rights granted by the data protection legislation and how can be exercised. You can find the original Italian version of this document here . Who is the Data Controller Keyless Technologies S.r.l., with registered office in Viale Luca Gaurico 9-11, 00144 - Rome, VAT no. 14880901005 - owned by Keyless Technologies Limited, a company incorporated under UK law with registered office in Milton Gate 60 Chiswell Street EC1Y 4AG, London, UK, VAT no. GB324663602 - is the controller of your personal data (\" Keyless \", the \" Data Controller \" or the \" Company \"). The Data Controller can be contacted by e-mail at gdpr@keyless.it or by regular mail at Keyless Technologies S.r.l., with registered office in Viale Luca Gaurico 9-11, 00144 - Rome. Keyless has appointed a Data Protection Officer (\"DPO\") who can be contacted by email at dpo@e-lex.it . Categories of personal data processed by Keyless within the Data Collection Campaign Keyless is a cybersecurity company that has developed an innovative technological solution allowing individuals recognition (e.g. for the purpose of accessing certain premises), starting from anonymised biometric data and, therefore, not linkable to the same individual. The aforementioned solution is based on a \" privacy preserving \" system and, specifically, on a so-called \" untraceable biometrics \" technology, which allows - starting from the fingerprint or the shape of the face - to prevent the traceability of a certain data to the subject to whom it belongs and, consequently, to his/her identity. Against this background, Keyless has launched a data collection campaign for the training of biometric privacy-preserving algorithms (so-called \" machine learning \") on which the system developed for biometric authentication on smartphone devices is based (the \" Data Collection Campaign \"). In this context, Keyless processes the following categories of personal data relating to you: common personal data (such as, for example, age and gender); particular categories of data pursuant to Article 9 of the Regulation (formerly, the so called \" sensitive data \") and, in particular, your face recorded from different angles and/or at different levels of light exposure and the dynamics relating to the movement of the phone (so-called behavioural biometrics). The aforementioned personal data will be processed by Keyless exclusively for the purpose indicated in the following paragraph. Purpose and legal basis of processing activities As part of the Data Collection Campaign, Keyless has developed an application for smartphones through which you - as a user who decides to participate in the Data Collection Campaign - can carry out test sessions aimed at collecting the information necessary to elaborate the biometric models referred to in paragraph 3 above, which are necessary for training the algorithms developed by the Company. The legal basis for the processing of your personal data is to be identified in your prior, specific and express consent. Categories of entities to whom personal data may be communicated and purposes of communications Your personal data will be processed within the Data Controller's structure by collaborators and/or employees of Keyless in their capacity as persons authorised to process data, as well as by members of the Company's Board of Directors, for the purpose of carrying out their institutional tasks and functions. Furthermore, Keyless may disclose some of your personal data to third parties that the Company uses to carry out activities related to the purposes set out in the previous paragraph, including external companies that provide Keyless with administrative and logistical services and/or external consultants. These entities shall process your personal data as data processors pursuant to Article 28 of the Regulations. The list of data processors is available from the Data Controller and can be requested by writing to the addresses indicated in paragraph 1 above. Your personal data shall not be disseminated. Your personal data will be processed by Keyless as long as necessary to carry out the activities related to the purpose set out in paragraph 4 above. At the end of the machine learning activities, your data will be stored for a period of 1 year and then permanently deleted from Keyless' systems. Transfer of data outside the European Union Keyless shall not transfer your personal data outside the European Union. Where appropriate, the Company shall carry out the aforementioned transfer through the use of standard contractual clauses adopted by the European Commission or, alternatively, on the basis of a Commission adequacy decision or other appropriate instrument under the GDPR. You may obtain information on the place where your data has been transferred and copies of such data by writing to the contact details set out in paragraph 1 above. Please note that you - as a data subject - have the rights provided for in Articles 15 et seq. of the GDPR and, in particular: the right of access personal data and, in particular, to obtain from the Data Controller confirmation as to whether or not personal data concerning you are being processed, and, where that is the case, access to the personal data; the right to rectification and, in particular, to obtain from the Data Controller without undue delay the rectification of inaccurate personal data concerning you; the right to be forgotten, i.e. the right to obtain, where applicable, from the Data Controller the erasure of personal data concerning you without undue delay; the right to request, where applicable, the portability of your personal data. To exercise your rights, please contact the Data Controller or the DPO at the addresses indicated in paragraphs 1 and 2 above, respectively. Finally, please note that, pursuant to the applicable regulations, you may lodge any complaints regarding the processing of your personal data with the Italian Data Protection Authority.",
    "Deploy Keyless for Azure B2C | read more 01 Access Anywhere. Any time. Any device. Enhance customer and employee experiences and protect their privacy through passwordless multi-factor authentication that eliminates fraud, phishing and credential reuse. Workforce Protect and enable seamless access for your employees, contractors, and partners across all touchpoints: MFA to IDP / SSO Workstation Login VPN Authentication Mobile & Web App Login VDI Authentication RDP Authentication IT Helpdesk Authentication Explore Workforce Identity Consumer Build secure, frictionless digital experiences for your customers: PSD2 SCA Mobile & Web Applications Customer MFA Customer Identification Call Center Authentication Digital Signatures Digital Access to Physical Locations Explore Customer Identity Simple, secure, and above all, private Our passwordless solutions offer unmatched security and privacy, so that you can provide frictionless authentication experiences to your workforce and customers 100 milliseconds authentication 300x faster than general purpose sMPC solutions 10+ years of research 150k authentications per month 02 Trusted by industry leaders Find out why the world's largest organizations trust Keyless to enhance productivity, strengthen security and reduce IT costs. Securing remote employee access for one of Europe's fastest growing digital banks Securing employee access for one of Europe's major retail banks Ensuring secure workstation access for a multinational A&D company 03 Driving strong business outcomes Learn why Luiss University chose Keyless to provide unique student identification and frictionless authentication, in partnership with Cisco \"The integration with LUISS and Keyless is a concrete example of the potential that can be unleashed when best available technologies come together. We've each approached this integration with openness, flexibility and safety in mind. In doing so, we've been able to ensure thousands of students can continue with their studies, pass their exams and graduate\" CEO, Cisco Italy, Agostino Santoni Watch video 04 Drive better outcomes for your workforce and customers Top-notch security No central honeypot, no data on user devices. Data can never be stolen or lost because no private information is accessible to anyone but the user. Built-in privacy Fundamental privacy preserving technology. Keyless doesn't store or process PII and helps businesses comply with privacy regulations. Industry leading UX Reduces authentication friction and MFA fatigue. At Keyless we understand the strong security does not have to compromise user experience. Anti-fraud protection Nothing to remember, nothing to steal. Keyless embeds strong anti-fraud technology and behavioral authentication to minimize the risk of account takeover, phishing, and credential stuffing. 05 Unique capabilities powered by breakthrough technology Hardware agnostic and device-independent Since we do not rely on hardware devices or their built-in sensors, Keyless offers scalable integration and deployment on a large set of devices and appliances and provide a unified user experience regardless of the user's mobile device. Privacy-preserving unique identification Keyless natively identifies your user in every touchpoint, so you can make sure that the user logging in is the correct user. Enroll once, use on every device Users enroll once in a 5-seconds process, and can then use it on all of their devices. Backup and recovery Users can recover their identity when they lose access to their devices. 06 Reduce password associated costs by going passwordless Password reset costs The average helpdesk labor cost is estimated at $70. (Forrester) The average size enterprise is expected to lose millions a year to password resets. Losses from phishing and account takeover attacks $14.7B lost due to fraud in 2018. (Javelin 2019 Identity Fraud Study) Eliminate shared secrets to protect revenue streams. Productivity related costs The average user spends 11 hours on password resets. (The National, 2019) Time that can be dramatically reduced by eliminating passwords altogether. Brand reputation 80% of hacking-related breaches leverage compromised credentials. (Verizon DBIR) Protect your organization's brand by significantly reducing security breach risk. Single Sign-On Integrations Modernize your existing identity infrastructure with pre-built integrations for workforce and consumer use-cases 07 Industry recognition for our biometric authentication solutions IAM Sample Vendor, Gartner Top 5 MFA Solution Providers in UK #1 B2B Startup by Southern European Stars #1 Most Innovative Auth Solution by Telsy Best Emerging IAM Provider 08 Request a personalized demo Find out how Keyless™ zero-trust passwordless authentication solutions can help enhance security and compliance by scheduling a free demonstration tailored to your organization. Access Anywhere. Any time. Any device. Protect and enable seamless access for your employees, contractors, and partners across all touchpoints: Build secure, frictionless digital experiences for your customers: Simple, secure, and above all, private Trusted by industry leaders Securing remote employee access for one of Europe's fastest growing digital banks Securing employee access for one of Europe's major retail banks Ensuring secure workstation access for a multinational A&D company Driving strong business outcomes Learn why Luiss University chose Keyless to provide unique student identification and frictionless authentication, in partnership with Cisco \"The integration with LUISS and Keyless is a concrete example of the potential that can be unleashed when best available technologies come together. We've each approached this integration with openness, flexibility and safety in mind. In doing so, we've been able to ensure thousands of students can continue with their studies, pass their exams and graduate\" CEO, Cisco Italy, Agostino Santoni Drive better outcomes for your workforce and customers No central honeypot, no data on user devices. Data can never be stolen or lost because no private information is accessible to anyone but the user. Fundamental privacy preserving technology. Keyless doesn't store or process PII and helps businesses comply with privacy regulations. Reduces authentication friction and MFA fatigue. At Keyless we understand the strong security does not have to compromise user experience. Nothing to remember, nothing to steal. Keyless embeds strong anti-fraud technology and behavioral authentication to minimize the risk of account takeover, phishing, and credential stuffing. Unique capabilities powered by breakthrough technology Hardware agnostic and device-independent Since we do not rely on hardware devices or their built-in sensors, Keyless offers scalable integration and deployment on a large set of devices and appliances and provide a unified user experience regardless of the user's mobile device. Keyless natively identifies your user in every touchpoint, so you can make sure that the user logging in is the correct user. Enroll once, use on every device Users enroll once in a 5-seconds process, and can then use it on all of their devices. Users can recover their identity when they lose access to their devices. Reduce password associated costs by going passwordless The average helpdesk labor cost is estimated at $70. (Forrester) The average size enterprise is expected to lose millions a year to password resets. Losses from phishing and account takeover attacks $14.7B lost due to fraud in 2018. (Javelin 2019 Identity Fraud Study) Eliminate shared secrets to protect revenue streams. The average user spends 11 hours on password resets. (The National, 2019) Time that can be dramatically reduced by eliminating passwords altogether. 80% of hacking-related breaches leverage compromised credentials. (Verizon DBIR) Protect your organization's brand by significantly reducing security breach risk. Modernize your existing identity infrastructure with pre-built integrations for workforce and consumer use-cases Industry recognition for our biometric authentication solutions IAM Sample Vendor, Gartner Top 5 MFA Solution Providers in UK #1 B2B Startup by Southern European Stars #1 Most Innovative Auth Solution by Telsy Best Emerging IAM Provider Request a personalized demo Find out how Keyless™ zero-trust passwordless authentication solutions can help enhance security and compliance by scheduling a free demonstration tailored to your organization. Keyless is a deeptech cybersecurity company pioneering privacy-preserving biometric authentication solutions that eliminate the need to store and manage sensitive information, enabling businesses to adopt zero-trust passwordless authentication, protect their remote workforce and enable strong customer authentication with just one look. © Keyless Technologies, 2020. - London – Company no. 11362854 | Rome – Startup Innovativa no. 14880901005 | Singapore – Company no. 201904868C",
    "Solutions Consumer Account protection, compliance, and trust for your customers Passwordless Login Payment Authentication Step Up Authentication Account Recovery Workforce Protecting your people and perimeter Passwordless SSO Passwordless Remote Access Shared Device Authentication Consumer Account protection, compliance, and trust for your customers Passwordless Login Payment Authentication Step Up Authentication Account Recovery Workforce Protecting your people and perimeter Passwordless SSO Passwordless Remote Access Shared Device Authentication Technology Authentication & Cryptography Biometric Solution Authentication User Flow Authentication & Cryptography Biometric Solution Authentication User Flow Industries Banking Cryptocurrency Fintech Resources Blog News Events Videos Case Studies eBooks One Pagers Reports Blog News Events Videos Case Studies eBooks One Pagers Reports Company About Team Partners Careers How can we help you?",
    "Discover How Keyless Can Transform Your Organization Discover How Keyless Can Transform Your Organization No Biometric Data Stored Anywhere The Simplest, Fastest Authentication Experience Request your custom demo video Effortless Integration, Deploy Anywhere Get your custom demo video Use Cases: From step-up to payments to account recovery. Enrollment: Get advice on passive, active, or NFC-based enrollment. Integrations: See options for mobile SDK or web SDK. Compliance: How we support GDPR, PSD2, and CCPA. Pricing: Example pricing based on similar customers. Discover our Technology and Industries Passwordless is Just the Beginning. The Future is Keyless.",
    "Solutions Consumer Account protection, compliance, and trust for your customers Passwordless Login Payment Authentication Step Up Authentication Account Recovery Workforce Protecting your people and perimeter Passwordless SSO Passwordless Remote Access Shared Device Authentication Consumer Account protection, compliance, and trust for your customers Passwordless Login Payment Authentication Step Up Authentication Account Recovery Workforce Protecting your people and perimeter Passwordless SSO Passwordless Remote Access Shared Device Authentication Technology Authentication & Cryptography Biometrics User Flows Authentication & Cryptography Biometrics User Flows Industries Banking Cryptocurrency Fintech Resources Blog News Events Videos Case Studies eBooks One Pagers Reports Blog News Events Videos Case Studies eBooks One Pagers Reports Company About Team Partners Careers Welcome to a new era of authentication. Choosing an Authentication Vendor Account Takeover Protection with Keyless Solving PSD2-SCA Challenges with Biometrics Choosing an Authentication Vendor Account Takeover Protection with Keyless Solving PSD2-SCA Challenges with Biometrics Choosing an Authentication Vendor Account Takeover Protection with Keyless Solving PSD2-SCA Challenges with Biometrics"
  ]
}