{
  "company": "kltechno.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 12,
    "-1": 8
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3076923076923077,
    "framing_surveillance": 0.0,
    "framing_market": 0.6923076923076923,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 12
    }
  },
  "sample_docs": [
    "Products Solutions We Offer - KL Techno Home We respect and are committed towards protecting your privacy. Publishing, selling or renting any personal data or information to any third party, without your consent, is against our ethics. The privacy practices of this statement apply to our services available under the domain and subdomains of the Site. By visiting this Site you agree to be bound by the of this . If you do not agree, please do not use or access our site. This does not apply to sites maintained by other companies or organizations to which we link and we are not responsible for any personal information you submit to third parties via our website. Please ensure that you read the of such other companies or organizations before submitting your details. This describes the information, as part of the normal operation of our services, we collect from you and what may happen to that information. This policy is inter alia formulated and displayed, to inform you about our information collection/retention policies and practices so that you can make an informed decision, in relation to the sharing of your personal information with us. By accepting the and the user agreement or the use of the site in general, you give your consent to our use and disclosure of your personal information in accordance with this . This is incorporated into and subject to the of the User Agreement. This is effective upon acceptance of access by you to the site. Privacy Guarantee We agree that we will not sell or rent your personal information to third parties for their marketing purposes without your explicit consent. From time to time, we may reveal general statistical information about our Site and visitors, such as number of visitors, number and type of goods and services purchased, etc. Only those of our employees who need access to your information in order to perform their duties, are allowed such access. Any employee who violates our privacy and/or security policies is subjected to disciplinary action, including possible termination and civil and/or criminal prosecution. Information We Collect The Personal Information is used for two general purposes: to process your order, and to provide you with the best possible services. Unless otherwise stated explicitly, this policy applies to personal information as disclosed on any of the media. In furtherance of the confidentiality with which we treat Personal Information, we have put in place appropriate physical, electronic, and managerial procedures to safeguard and secure the information we collect online. We use data collection devices such as \"cookies\" on certain pages of the Site to help and analyze our web page flow, measure promotional effectiveness, and promote trust and safety. \"Cookies\" are small files placed on your hard drive that assist us in providing our services. We offer certain features that are only available through the use of a \"cookie\". Cookies can also help us provide information that is targeted to your interests. Most cookies are \"session cookies,\" which means that they are automatically deleted from your hard drive at the end of a session. You are always free to decline our cookies if your browser permits. Additionally, you may encounter \"cookies\" or other similar devices on certain pages of the Site that are placed by third parties. For example, if you view a web page created by a user, there may be a \"cookie\" placed within that web page. We do not control the use of cookies by third parties. You acknowledge that you are disclosing Personal Information voluntarily. We identify and use your IP address to help diagnose problems with our server, and to administer our Website. Your IP address is also used to help identify you and to gather broad demographic information. COOKIE POLICY KL Techno operates a strict and we are committed to being transparent about how we use cookies on our website. ● Why are cookies important? Cookies help you make your online experience more efficient and relevant to your interests. For instance, they are used to remember your preferences on sites you visit often, to remember your user ID and the contents of your shopping baskets, and to help you navigate between pages efficiently. ● What is a Cookie? A cookie is a small file, or files on your computer, phone, or other device with a browser to save snippets of text for reference by the website you are visiting. All cookies have expiration dates in them that determine how long they stay in your browser: ● Session cookies - these are temporary cookies that expire (and are automatically erased) whenever you close your browser. ● Persistent cookies - these usually have an expiration date and so stay in your browser until they expire, or until you manually delete them. For example we use persistent cookies to better understand usage patterns so that we can improve the site for our customers. Cookies are grouped into the following categories: ● Essential - these are cookies that are required for the regular operation of our websites. ● Functional - these remember your preferences, and are intended to make your experience on our websites better for you. ● Analytics – these cookies are used for performance measurement to understand things including how many people visit our websites, how they navigate our sites, and what content is popular. This allows us to improve your experience with us. Additionally, you can see how Google Analytics (one of our analytics tools) uses cookie information when you use our partners' sites by visiting www.google.com/policies/privacy/partners, or any other URL Google may provide from time to time ● Advertising - these cookies enable us and our advertising partners to serve you with relevant advertisements that we think will interest you. You might see these advertisements on our sites on other sites you visit. These cookies record your visit to our website and the content you interact with. They may be placed by us, or by advertising partners with our permission. To ensure compliance with our policies, we restrict the use of third-party cookies to trusted partners. We also use third party information from third party sources to enable us deliver advertising. These sources are validated by Third party, and not by us. To delete cookies from your browser, please note the following simple steps. The following steps are indicative for Google chrome and might vary of the different browsers that you may use. Please refer Settings on your browser for further details. To ensure compliance with our policies, we restrict the use of third-party cookies to trusted partners. You may also change other setting related to Privacy and Security under the same section. We respect and are committed towards protecting your privacy. Publishing, selling or renting any personal data or information to any third party, without your consent, is against our ethics. The privacy practices of this statement apply to our services available under the domain and subdomains of the Site. By visiting this Site you agree to be bound by the of this . If you do not agree, please do not use or access our site. This does not apply to sites maintained by other companies or organizations to which we link and we are not responsible for any personal information you submit to third parties via our website. Please ensure that you read the of such other companies or organizations before submitting your details. This describes the information, as part of the normal operation of our services, we collect from you and what may happen to that information. This policy is inter alia formulated and displayed, to inform you about our information collection/retention policies and practices so that you can make an informed decision, in relation to the sharing of your personal information with us. By accepting the and the user agreement or the use of the site in general, you give your consent to our use and disclosure of your personal information in accordance with this . This is incorporated into and subject to the of the User Agreement. This is effective upon acceptance of access by you to the site. Privacy Guarantee We agree that we will not sell or rent your personal information to third parties for their marketing purposes without your explicit consent. From time to time, we may reveal general statistical information about our Site and visitors, such as number of visitors, number and type of goods and services purchased, etc. Only those of our employees who need access to your information in order to perform their duties, are allowed such access. Any employee who violates our privacy and/or security policies is subjected to disciplinary action, including possible termination and civil and/or criminal prosecution. Information We Collect The Personal Information is used for two general purposes: to process your order, and to provide you with the best possible services. Unless otherwise stated explicitly, this policy applies to personal information as disclosed on any of the media. In furtherance of the confidentiality with which we treat Personal Information, we have put in place appropriate physical, electronic, and managerial procedures to safeguard and secure the information we collect online. We use data collection devices such as \"cookies\" on certain pages of the Site to help and analyze our web page flow, measure promotional effectiveness, and promote trust and safety. \"Cookies\" are small files placed on your hard drive that assist us in providing our services. We offer certain features that are only available through the use of a \"cookie\". Cookies can also help us provide information that is targeted to your interests. Most cookies are \"session cookies,\" which means that they are automatically deleted from your hard drive at the end of a session. You are always free to decline our cookies if your browser permits. Additionally, you may encounter \"cookies\" or other similar devices on certain pages of the Site that are placed by third parties. For example, if you view a web page created by a user, there may be a \"cookie\" placed within that web page. We do not control the use of cookies by third parties. You acknowledge that you are disclosing Personal Information voluntarily. We identify and use your IP address to help diagnose problems with our server, and to administer our Website. Your IP address is also used to help identify you and to gather broad demographic information. COOKIE POLICY KL Techno operates a strict and we are committed to being transparent about how we use cookies on our website. ● Why are cookies important? Cookies help you make your online experience more efficient and relevant to your interests. For instance, they are used to remember your preferences on sites you visit often, to remember your user ID and the contents of your shopping baskets, and to help you navigate between pages efficiently. ● What is a Cookie? A cookie is a small file, or files on your computer, phone, or other device with a browser to save snippets of text for reference by the website you are visiting. All cookies have expiration dates in them that determine how long they stay in your browser: ● Session cookies - these are temporary cookies that expire (and are automatically erased) whenever you close your browser. ● Persistent cookies - these usually have an expiration date and so stay in your browser until they expire, or until you manually delete them. For example we use persistent cookies to better understand usage patterns so that we can improve the site for our customers. Cookies are grouped into the following categories: ● Essential - these are cookies that are required for the regular operation of our websites. ● Functional - these remember your preferences, and are intended to make your experience on our websites better for you. ● Analytics – these cookies are used for performance measurement to understand things including how many people visit our websites, how they navigate our sites, and what content is popular. This allows us to improve your experience with us. Additionally, you can see how Google Analytics (one of our analytics tools) uses cookie information when you use our partners' sites by visiting www.google.com/policies/privacy/partners, or any other URL Google may provide from time to time ● Advertising - these cookies enable us and our advertising partners to serve you with relevant advertisements that we think will interest you. You might see these advertisements on our sites on other sites you visit. These cookies record your visit to our website and the content you interact with. They may be placed by us, or by advertising partners with our permission. To ensure compliance with our policies, we restrict the use of third-party cookies to trusted partners. We also use third party information from third party sources to enable us deliver advertising. These sources are validated by Third party, and not by us. To delete cookies from your browser, please note the following simple steps. The following steps are indicative for Google chrome and might vary of the different browsers that you may use. Please refer Settings on your browser for further details. To ensure compliance with our policies, we restrict the use of third-party cookies to trusted partners. You may also change other setting related to Privacy and Security under the same section. KL Techno Plot No - 476/1139, Jadupur, Bhubaneswar, Odisha - 751019",
    "Products Solutions We Offer Pricing - KL Techno Pricing Home Pricing On Premise On-Premise Standalone or Web application is a In house application, meant for those organizations who want to have and want to manage their server at their end. They have complete resources to take data back up on regular intervals and IT setup in place. The charges will be valid for 1 year, and same charges will be applicable on next year renewal. KL Cloud (Desktop) Start as Just Rs 4000/- . For unlimited number of employees and devices. Attendance software with Push data technology Seamless Integration with Biometric devices Complete Leave & Shift management Email and SMS Facility Complete HR Rules Implementation feasibility Complete OT management and Comp-off Provision User based Permission and Holiday Management Hourly/Daily/Monthly Calculation feasible 30+ MIS Reports and Report writer facility Easy implementation with Excel import option For any queries please email us at sales@kltechno.com Buy Now KL Cloud Web (Online) Starts at Just Rs 15000/- . For 500 employees. And price will be extra for more employees. Completely Centralized Data and System Management Accessible - Anytime and Anywhere Multilevel Approval with workflow option Complete Employee/Manager self service portal Mobile App + GPS enabled punching (Android & iOS) DB Level Integration with Other Biometric brands Device Management utitlity for better user control Canteen Managment Faciltiy 50+ MIS Reports and Customized report generation tool Buy Now On Premise On-Premise Standalone or Web application is a In house application, meant for those organizations who want to have and want to manage their server at their end. They have complete resources to take data back up on regular intervals and IT setup in place. The charges will be valid for 1 year, and same charges will be applicable on next year renewal. KL Cloud (Desktop) Start as Just Rs 4000/- . For unlimited number of employees and devices. Attendance software with Push data technology Seamless Integration with Biometric devices Complete Leave & Shift management Email and SMS Facility Complete HR Rules Implementation feasibility Complete OT management and Comp-off Provision User based Permission and Holiday Management Hourly/Daily/Monthly Calculation feasible 30+ MIS Reports and Report writer facility Easy implementation with Excel import option For any queries please email us at sales@kltechno.com Buy Now KL Cloud Web (Online) Starts at Just Rs 15000/- . For 500 employees. And price will be extra for more employees. Completely Centralized Data and System Management Accessible - Anytime and Anywhere Multilevel Approval with workflow option Complete Employee/Manager self service portal Mobile App + GPS enabled punching (Android & iOS) DB Level Integration with Other Biometric brands Device Management utitlity for better user control Canteen Managment Faciltiy 50+ MIS Reports and Customized report generation tool Buy Now On-Premise Standalone or Web application is a In house application, meant for those organizations who want to have and want to manage their server at their end. They have complete resources to take data back up on regular intervals and IT setup in place. The charges will be valid for 1 year, and same charges will be applicable on next year renewal. Start as Just Rs 4000/- . For unlimited number of employees and devices. Attendance software with Push data technology Seamless Integration with Biometric devices Complete Leave & Shift management Email and SMS Facility Complete HR Rules Implementation feasibility Complete OT management and Comp-off Provision User based Permission and Holiday Management 30+ MIS Reports and Report writer facility Easy implementation with Excel import option For any queries please email us at sales@kltechno.com KL Cloud Web (Online) Starts at Just Rs 15000/- . For 500 employees. And price will be extra for more employees. Completely Centralized Data and System Management Accessible - Anytime and Anywhere Multilevel Approval with workflow option Complete Employee/Manager self service portal Mobile App + GPS enabled punching (Android & iOS) DB Level Integration with Other Biometric brands Device Management utitlity for better user control 50+ MIS Reports and Customized report generation tool Cloud (SAAS) Valid upto 31.3.23 KL Cloud is very light on your pockets. You need to pay as per your employee headcount on monthly basis. You can scale up or scale down anytime. You don't need to incur heavy capital expenses on servers and software licenses. KL Cloud Attendance Rs 20 /per employee / month Min Rs 1000/Month for <=50 employees and multiples of 25 there after. Cloud Based Time & Attendance software Centralize Attendance software with Push data technology Seamless Integration with Biometric devices Advanced Leave management with Email approvals Complete Device management for Multi located companies Auto recalculation of attendance on daily basis Complete OT management and Comp-off Provision Complete HR Rules Implementation feasibility User based Permission and Holiday Management Multiple shifts, break shift, flexible shift Email and SMS Facility* Employee/Manager Self service portal Mobile application with GPS enabled punching (Android and iOS) Multiple logics to prevent misuse or proxy Attendance Third Party Integration with API Cafeteria management with canteen reports. 50+ Reports for complete MIS Reporting Buy Now KL Cloud + Payroll Rs 60 /per employee / month Payroll software on a world class cloud server Dashboard with important Analytics at all pages Complete Statutory Reporting with upload ready formats Completely flexibility in defining salary heads & structure End to End TDS Management with digitally signed F16 Complete Arrears & Advance Management Complete Full & Final Management Complete Adhoc payments & deductions management Advanced Features on Expense claims & Reimbursements Payout Reports like JV & Bank formats for Salary Remittance HRIS - HR letter & Employee document management All modes of calculation i.e Hourly/Daily/Monthly feasible 30+ Reports for MIS & Customized report generation tool Various Important Statutory Forms Payroll related employee & manager panel in ESS/Mobile App 10+ Payslip formats for selection Ease of implementation with Excel Import Buy Now KL Cloud + Payroll + HRMS Rs 90 /per employee / month Digitized Onboarding Management Performance Appraisal Goal Setting & KRA Documents Managment (HR Letters) Checklist or Virutal Guide Exit Managment Event Notifications Company Policy or Forms Help Desk Broadcast or Survey or Polls Training ---- Upcoming Modules --- Rewards and Recognition Hiring and Referrals Assigning Tasks using Mobile App Buy Now Valid upto 31.3.23 KL Cloud is very light on your pockets. You need to pay as per your employee headcount on monthly basis. You can scale up or scale down anytime. You don't need to incur heavy capital expenses on servers and software licenses. KL Cloud is very light on your pockets. You need to pay as per your employee headcount on monthly basis. You can scale up or scale down anytime. You don't need to incur heavy capital expenses on servers and software licenses. Rs 20 /per employee / month Min Rs 1000/Month for <=50 employees and multiples of 25 there after. Cloud Based Time & Attendance software Centralize Attendance software with Push data technology Seamless Integration with Biometric devices Advanced Leave management with Email approvals Complete Device management for Multi located companies Auto recalculation of attendance on daily basis Complete OT management and Comp-off Provision Complete HR Rules Implementation feasibility User based Permission and Holiday Management Multiple shifts, break shift, flexible shift Email and SMS Facility* Employee/Manager Self service portal Mobile application with GPS enabled punching (Android and iOS) Multiple logics to prevent misuse or proxy Attendance Third Party Integration with API Cafeteria management with canteen reports. 50+ Reports for complete MIS Reporting KL Cloud + Payroll Rs 60 /per employee / month Payroll software on a world class cloud server Dashboard with important Analytics at all pages Complete Statutory Reporting with upload ready formats Completely flexibility in defining salary heads & structure End to End TDS Management with digitally signed F16 Complete Arrears & Advance Management Complete Full & Final Management Complete Adhoc payments & deductions management Advanced Features on Expense claims & Reimbursements Payout Reports like JV & Bank formats for Salary Remittance HRIS - HR letter & Employee document management All modes of calculation i.e Hourly/Daily/Monthly feasible 30+ Reports for MIS & Customized report generation tool Various Important Statutory Forms Payroll related employee & manager panel in ESS/Mobile App 10+ Payslip formats for selection Ease of implementation with Excel Import KL Cloud + Payroll + HRMS Rs 90 /per employee / month Goal Setting & KRA Documents Managment (HR Letters) Checklist or Virutal Guide Company Policy or Forms Broadcast or Survey or Polls ---- Upcoming Modules --- Assigning Tasks using Mobile App KL Techno Plot No - 476/1139, Jadupur, Bhubaneswar, Odisha - 751019",
    "Products Solutions We Offer About Us - KL Techno About Us Home About Us KL Techno a Division of KL Technosolution. The Division was solely formed to provide One Stop Security System Solutions for all Business and Home Users. KL Techno was formed in the Year 2018 and It's been more than 4 years we have been very consistent in our Growth and adding up more and more innovative and Latest technology products in our offering. KL Techno started with offering CCTV Solutions and then moved on to Biometric offering, We handled Biometric with Software Support which gave us an edge with our competitor's. With Biometric Also Came Access Control and Fire Alarm System, Gate Automation. For Home Users we have complete solutions from Wireless CCTV, Video Door Phone, Intrusion Alarm and Home automation. The Very plus point of Customer selecting us as a Vendor for their Electronic Security needs is our tie up with Major Brands and Our Engineers being Certified and Trained from This companies. Service & Call Centre KL Techno is a customer centric brand dedicated to delivering the best customer experience. KL Techno offers a robust infrastructure to service its customers and clients. That's not all a dedicated technical support centre has been working to ensure all customer concerns are heard and addressed in a timely manner. Certifications Our products have been accredited with major international system certifications – ISO 9001, ISO 9001 2008, ISO 14001 2014, ISO 9001 2014, quality management system certification, UL, CE, FCC, RoHS, etc. KL Techno offers a broad range of products across the world for all the major sectors of the economy, such as retail, banking, public security, infrastructure, energy resources, transportation, commercial, industrial, etc. These awards are acknowledgement of our strenuous and consistent endeavours to deliver excellence to all industry segments the best of services - in pre-sales, designing, logistics, sales, services, commissioning and technical support. They have reaffirmed our commitment and endeavor to ensure better and safe Planet. Brands Tie Up With Our Values Reliability We understand that security equipment is often the last line of defense against all security threats. We, therefore, provide technology that you can depend on even when the chips are down. Performance We constantly challenge accepted standards of quality and performance, ever raising the bar, always reaching higher, doing better Aesthetics Our security solutions are designed to blend into their environment seamlessly. They incorporate the best international sensibilities. KL Techno a Division of KL Technosolution. The Division was solely formed to provide One Stop Security System Solutions for all Business and Home Users. KL Techno was formed in the Year 2018 and It's been more than 4 years we have been very consistent in our Growth and adding up more and more innovative and Latest technology products in our offering. KL Techno started with offering CCTV Solutions and then moved on to Biometric offering, We handled Biometric with Software Support which gave us an edge with our competitor's. With Biometric Also Came Access Control and Fire Alarm System, Gate Automation. For Home Users we have complete solutions from Wireless CCTV, Video Door Phone, Intrusion Alarm and Home automation. The Very plus point of Customer selecting us as a Vendor for their Electronic Security needs is our tie up with Major Brands and Our Engineers being Certified and Trained from This companies. Service & Call Centre KL Techno is a customer centric brand dedicated to delivering the best customer experience. KL Techno offers a robust infrastructure to service its customers and clients. That's not all a dedicated technical support centre has been working to ensure all customer concerns are heard and addressed in a timely manner. Our products have been accredited with major international system certifications – ISO 9001, ISO 9001 2008, ISO 14001 2014, ISO 9001 2014, quality management system certification, UL, CE, FCC, RoHS, etc. KL Techno offers a broad range of products across the world for all the major sectors of the economy, such as retail, banking, public security, infrastructure, energy resources, transportation, commercial, industrial, etc. These awards are acknowledgement of our strenuous and consistent endeavours to deliver excellence to all industry segments the best of services - in pre-sales, designing, logistics, sales, services, commissioning and technical support. They have reaffirmed our commitment and endeavor to ensure better and safe Planet. Brands Tie Up With Brands Tie Up With We understand that security equipment is often the last line of defense against all security threats. We, therefore, provide technology that you can depend on even when the chips are down. We constantly challenge accepted standards of quality and performance, ever raising the bar, always reaching higher, doing better Our security solutions are designed to blend into their environment seamlessly. They incorporate the best international sensibilities. KL Techno Plot No - 476/1139, Jadupur, Bhubaneswar, Odisha - 751019",
    "Products Solutions We Offer AI Integrated Solution - KL Techno AI Integrated Solution Home Products AI Integrated Solution SHOW ALL Thermal Screening Solution KL-Speedface 5 TM Thermal Screening Solution KL-Speedface 5 THRL Thermal Screening Solution KL-Speedface 8 THRL Thermal Screening Solution SHOW ALL Face Recognition Solution KL-Speedface 5 SE Face Recognition Solution KL-Speedface 5 Face Recognition Solution KL-Speedface 8 Face Recognition Solution SHOW ALL Thermal Screening Solution SHOW ALL Face Recognition Solution KL Techno Plot No - 476/1139, Jadupur, Bhubaneswar, Odisha - 751019",
    "Products Solutions We Offer & Conditions - KL Techno & Conditions Home & Conditions Thank you for accessing/shopping at kltechno.com. This site is owned by KL Techno (hereinafter referred to as \"kltechno.com\"). By accessing, shopping on this site, you indicate your unconditional acceptance of these & conditions. We reserve this right, in our sole discretion, to update or revise these & conditions. Continued use of the site following the posting of any changes to the ' & conditions', constitutes your acceptance of those changes. At \"kltechno.com\", we try our best to create a space where you can explore and shop for all your favorite things in a safe and secure environment. All products and information displayed on \"kltechno.com\" constitutes an \"invitation to offer\". kltechno.com\" reserves the right to accept or reject your offer. Your order for purchase, constitutes your \"offer\" which shall be subject to the as listed below. 1. Eligibility to use our site Use of the Site is available only to persons who can legally enter into contracts under applicable laws. Persons who are \"incompetent to contract\", within the meaning of the Indian Contract Act, 1872 including un-discharged insolvents etc. are not eligible to use the Site. \"kltechno.com\" reserves the right to terminate your access to the Site if it discovers that you are under the age of 18 years or suffers from any other disability, as recognized under Indian Contract Act, 1872. 2. Membership Although it's not essential to have an account to shop with \"kltechno.com\", you can shop as a guest. As a member, you agree to provide true, accurate, current, and complete information about yourself as prompted by the site's registration form. Registration where prohibited under any law shall be void. \"kltechno.com\" reserves the right to revoke or terminate your registration for any reason at any time, without notice. 3. Electronic Communications When you use the site or send emails or other data, information or communicate to us, you agree and understand that you are communicating with us electronically and give your consent to receive communications electronically from us periodically, when required. 4. Reviews, Feedback, Submissions All reviews, comments, feedback, postcards, suggestions, ideas, and other submissions disclosed, submitted or offered to \"kltechno.com\" directly or otherwise disclosed, submitted or offered in connection with your use of this Site (collectively referred to \"Comments\") will remain \"kltechno.com\" property. Such disclosure, submission or offer of any comments shall constitute an assignment to \"kltechno.com\" of all worldwide rights, titles and interests in all copyrights and other intellectual properties in the comments, thus, it exclusively owns all such rights, titles and interests and shall not be limited in any way in its use, commercial or otherwise. \"kltechno.com\" will be entitled to use, reproduce, disclose, modify, adapt, create derivative works from, publish, display and distribute any comments you submit for any purpose whatsoever, without restriction and without compensating you in any way. \"kltechno.com\" is and shall be under no obligation (1) to maintain any Comments in confidence; or (2) to pay you any compensation for any Comments; or (3) to respond to any Comments. You agree that any comments submitted by you to the Site will not violate this policy or any right of any third party, including copyright, trademark, privacy or other personal or proprietary right(s), and will not cause injury to any person or entity. You further agree that no comments submitted by you to the site will be libelous or otherwise unlawful, threatening, abusive or obscene material, or contain software viruses, political campaigning, commercial solicitation, chain letters, mass mailings or any form of \"spam\". \"kltechno.com\" does not regularly review posted comments, but does reserve the right (but not the obligation) to monitor and edit or remove any comment submitted to the Site. You grant \"kltechno.com\" the right to use the name that you submit in connection with any of the posted comments. You agree not to use a false email address, impersonate any person or entity, or otherwise mislead as to the origin of any Comments you submit. You are and shall remain solely responsible for the content of any comments you make and you agree to indemnify \"kltechno.com\" and its affiliates for all claims resulting from any Comments you submit, we take no responsibility and assume no liability for any comments submitted by you or any third party. 5. Accuracy of Content/ Information of Products on the Web Site While \"kltechno.com\" strives to provide accurate product and pricing information, typographical errors may occur. In the event that a product is listed at an incorrect price or with incorrect information due to an error in pricing or product information, \"kltechno.com\" shall have the right, on our sole discretion, to modify the price of the products, or information of the products or to refuse or cancel any orders placed for that product, unless the product has already been dispatched. In the event. Thank you for accessing/shopping at kltechno.com. This site is owned by KL Techno (hereinafter referred to as \"kltechno.com\"). By accessing, shopping on this site, you indicate your unconditional acceptance of these & conditions. We reserve this right, in our sole discretion, to update or revise these & conditions. Continued use of the site following the posting of any changes to the ' & conditions', constitutes your acceptance of those changes. At \"kltechno.com\", we try our best to create a space where you can explore and shop for all your favorite things in a safe and secure environment. All products and information displayed on \"kltechno.com\" constitutes an \"invitation to offer\". kltechno.com\" reserves the right to accept or reject your offer. Your order for purchase, constitutes your \"offer\" which shall be subject to the as listed below. 1. Eligibility to use our site Use of the Site is available only to persons who can legally enter into contracts under applicable laws. Persons who are \"incompetent to contract\", within the meaning of the Indian Contract Act, 1872 including un-discharged insolvents etc. are not eligible to use the Site. \"kltechno.com\" reserves the right to terminate your access to the Site if it discovers that you are under the age of 18 years or suffers from any other disability, as recognized under Indian Contract Act, 1872. 2. Membership Although it's not essential to have an account to shop with \"kltechno.com\", you can shop as a guest. As a member, you agree to provide true, accurate, current, and complete information about yourself as prompted by the site's registration form. Registration where prohibited under any law shall be void. \"kltechno.com\" reserves the right to revoke or terminate your registration for any reason at any time, without notice. 3. Electronic Communications When you use the site or send emails or other data, information or communicate to us, you agree and understand that you are communicating with us electronically and give your consent to receive communications electronically from us periodically, when required. 4. Reviews, Feedback, Submissions All reviews, comments, feedback, postcards, suggestions, ideas, and other submissions disclosed, submitted or offered to \"kltechno.com\" directly or otherwise disclosed, submitted or offered in connection with your use of this Site (collectively referred to \"Comments\") will remain \"kltechno.com\" property. Such disclosure, submission or offer of any comments shall constitute an assignment to \"kltechno.com\" of all worldwide rights, titles and interests in all copyrights and other intellectual properties in the comments, thus, it exclusively owns all such rights, titles and interests and shall not be limited in any way in its use, commercial or otherwise. \"kltechno.com\" will be entitled to use, reproduce, disclose, modify, adapt, create derivative works from, publish, display and distribute any comments you submit for any purpose whatsoever, without restriction and without compensating you in any way. \"kltechno.com\" is and shall be under no obligation (1) to maintain any Comments in confidence; or (2) to pay you any compensation for any Comments; or (3) to respond to any Comments. You agree that any comments submitted by you to the Site will not violate this policy or any right of any third party, including copyright, trademark, privacy or other personal or proprietary right(s), and will not cause injury to any person or entity. You further agree that no comments submitted by you to the site will be libelous or otherwise unlawful, threatening, abusive or obscene material, or contain software viruses, political campaigning, commercial solicitation, chain letters, mass mailings or any form of \"spam\". \"kltechno.com\" does not regularly review posted comments, but does reserve the right (but not the obligation) to monitor and edit or remove any comment submitted to the Site. You grant \"kltechno.com\" the right to use the name that you submit in connection with any of the posted comments. You agree not to use a false email address, impersonate any person or entity, or otherwise mislead as to the origin of any Comments you submit. You are and shall remain solely responsible for the content of any comments you make and you agree to indemnify \"kltechno.com\" and its affiliates for all claims resulting from any Comments you submit, we take no responsibility and assume no liability for any comments submitted by you or any third party. 5. Accuracy of Content/ Information of Products on the Web Site While \"kltechno.com\" strives to provide accurate product and pricing information, typographical errors may occur. In the event that a product is listed at an incorrect price or with incorrect information due to an error in pricing or product information, \"kltechno.com\" shall have the right, on our sole discretion, to modify the price of the products, or information of the products or to refuse or cancel any orders placed for that product, unless the product has already been dispatched. In the event. KL Techno Plot No - 476/1139, Jadupur, Bhubaneswar, Odisha - 751019"
  ]
}