{
  "company": "kriosk.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Make Workplace Safer With Our Access And Temperature Screening Kiosks Next day shipping. US Based Support. Free Online Training. 1 year Warranty Call 1- 833-941-3222 Get A Quote Finance A real Time-Saver No need to keep your customers and patrons waiting on the line to take their temperature. Free updates & support Free Support for any technical, installation, set up guidance and support. Secure and Easy Easy setup and maintenance with plug and play mode. No complex IT requirements. Body Temperature Kiosk with Facial Recognition No-touch access management kiosks with temperature-measurement capability and includes facial recognition for employees, perfect for access management. It comes in three versions – desktop, pedestal with or without sanitizer and wall mount. Facial Recognition Kiosk : Use optional facial recognition for capturing visitors and employees. Temperature Screening Kiosk : Effective temperature screening in less than 1 sec, completely touch free. Call Us Digital Signage Kiosk with Temperature Screening Display promotional offers through video/ images on the 21.5″ screen to your customers and visitors and attract more customers. Keep your customers and employees safe with built in hand sanitizers. The units also come with optional temperature screening as well. Call Us Advertise and Sanitize Profitably Our digital signage units can now be used to run offers, and also ads for your business. As a advertising partner you now can earn revenue and also keep your customers safe with temperature screening and sanitizers as well. DOWNLOAD The Most Accurate Temperature Screening Kiosk Solid and Commercial Design Easy install and setup Reads temperature in ~ 1 second API friendly and can be integrated into other gate and access systems Available in 4 different products Desktop, Pedestal, Wall mount, Infrared without Face Recognition Long distance temperature screening kiosk with range of 86-113 °F (30 – 45 °C), and the accuracy is ± 32.9 °F (0.5 °C). Face Mask recognition The detection distance of 0.5-1 meter avoids the risk of personal contact and transmission 8-inch IPS full-view LCD display. Multi lingual verbal alerts including warnings for abnormal temperatures Can be integrated with other ID card readers, access and gate controls, etc. LAN/ Wi-Fi enabled HD Camera Supports 30000 face database Free technical support Online installation and setup guidance SHOP Access Management Kiosk with Temperature Screening and Facial Recognition Specifications DOWNLOAD Keeping workplace safer For Manufacturing Unit/ Warehouses our temperature screening kiosks are helping engineers and workers at distributed locations screen themselves for temperature before returning to work, using cloud based central management software. For Universities and Schools our facial recognition and access management kiosks are being deployed in multiple entry points at buildings so that they can screen the students and safely get them back to school Client Testimonials I was dropping off customer loyalty cards printed in less than one day at M&M Printing (sister company of The Observer News) and this is what I found: How cool is this self temperature taking apparatus at TBD @ 301. I'm safe to go in and order at a healthy temperature of 97.3! Show More Show Less Desi Fereira What a cool device to add to our office. Easy installation and great support from Kriosk. Show More Show Less Martin Bradford AJPS Wonderful service and timely support by the Kriosk team. The product is great and works perfect, helping our employees feel safe at our workplace. Thanks guys. Show More Show Less Brett Attenti Our customers are happy and this product makes them feel safe when they come visit. Thanks to Kriosk for the free training and timely support. Highly recommend. Show More Show Less Bea TBD Cafe Who is already using it The Access Management Kiosk with Temperature Screening and Facial Recognition is now being be used in business and public places, installed at their entry points, access gates to their buildings, facilities and place of business. Our clients are in the following industries: Manufacturing Units Retail Senior Care Colleges & Schools SHOP Product Gallery Make Workplace Safer With Our Access And Temperature Screening Kiosks Next day shipping. US Based Support. Free Online Training. 1 year Warranty Call 1- 833-941-3222 Get A Quote Finance Make Workplace Safer With Our Access And Temperature Screening Kiosks Next day shipping. US Based Support. Free Online Training. 1 year Warranty A real Time-Saver No need to keep your customers and patrons waiting on the line to take their temperature. Free updates & support Free Support for any technical, installation, set up guidance and support. Secure and Easy Easy setup and maintenance with plug and play mode. No complex IT requirements. No need to keep your customers and patrons waiting on the line to take their temperature. Free updates & support Free Support for any technical, installation, set up guidance and support. Easy setup and maintenance with plug and play mode. No complex IT requirements. Body Temperature Kiosk with Facial Recognition No-touch access management kiosks with temperature-measurement capability and includes facial recognition for employees, perfect for access management. It comes in three versions – desktop, pedestal with or without sanitizer and wall mount. Facial Recognition Kiosk : Use optional facial recognition for capturing visitors and employees. Temperature Screening Kiosk : Effective temperature screening in less than 1 sec, completely touch free. Call Us Digital Signage Kiosk with Temperature Screening Display promotional offers through video/ images on the 21.5″ screen to your customers and visitors and attract more customers. Keep your customers and employees safe with built in hand sanitizers. The units also come with optional temperature screening as well. Call Us Body Temperature Kiosk with Facial Recognition No-touch access management kiosks with temperature-measurement capability and includes facial recognition for employees, perfect for access management. It comes in three versions – desktop, pedestal with or without sanitizer and wall mount. Facial Recognition Kiosk : Use optional facial recognition for capturing visitors and employees. Temperature Screening Kiosk : Effective temperature screening in less than 1 sec, completely touch free. Digital Signage Kiosk with Temperature Screening Display promotional offers through video/ images on the 21.5″ screen to your customers and visitors and attract more customers. Keep your customers and employees safe with built in hand sanitizers. The units also come with optional temperature screening as well. Advertise and Sanitize Profitably Our digital signage units can now be used to run offers, and also ads for your business. As a advertising partner you now can earn revenue and also keep your customers safe with temperature screening and sanitizers as well. DOWNLOAD Advertise and Sanitize Profitably Our digital signage units can now be used to run offers, and also ads for your business. As a advertising partner you now can earn revenue and also keep your customers safe with temperature screening and sanitizers as well. The Most Accurate Temperature Screening Kiosk Solid and Commercial Design Easy install and setup Reads temperature in ~ 1 second API friendly and can be integrated into other gate and access systems Available in 4 different products Desktop, Pedestal, Wall mount, Infrared without Face Recognition Long distance temperature screening kiosk with range of 86-113 °F (30 – 45 °C), and the accuracy is ± 32.9 °F (0.5 °C). Face Mask recognition The detection distance of 0.5-1 meter avoids the risk of personal contact and transmission 8-inch IPS full-view LCD display. Multi lingual verbal alerts including warnings for abnormal temperatures Can be integrated with other ID card readers, access and gate controls, etc. LAN/ Wi-Fi enabled HD Camera Supports 30000 face database Free technical support Online installation and setup guidance SHOP The Most Accurate Temperature Screening Kiosk Solid and Commercial Design Easy install and setup Reads temperature in ~ 1 second API friendly and can be integrated into other gate and access systems Available in 4 different products Desktop, Pedestal, Wall mount, Infrared without Face Recognition Long distance temperature screening kiosk with range of 86-113 °F (30 – 45 °C), and the accuracy is ± 32.9 °F (0.5 °C). The detection distance of 0.5-1 meter avoids the risk of personal contact and transmission 8-inch IPS full-view LCD display. Multi lingual verbal alerts including warnings for abnormal temperatures Can be integrated with other ID card readers, access and gate controls, etc. Supports 30000 face database Online installation and setup guidance Access Management Kiosk with Temperature Screening and Facial Recognition Specifications DOWNLOAD Access Management Kiosk with Temperature Screening and Facial Recognition Specifications Keeping workplace safer For Manufacturing Unit/ Warehouses our temperature screening kiosks are helping engineers and workers at distributed locations screen themselves for temperature before returning to work, using cloud based central management software. For Universities and Schools our facial recognition and access management kiosks are being deployed in multiple entry points at buildings so that they can screen the students and safely get them back to school For Manufacturing Unit/ Warehouses our temperature screening kiosks are helping engineers and workers at distributed locations screen themselves for temperature before returning to work, using cloud based central management software. For Universities and Schools our facial recognition and access management kiosks are being deployed in multiple entry points at buildings so that they can screen the students and safely get them back to school Client Testimonials I was dropping off customer loyalty cards printed in less than one day at M&M Printing (sister company of The Observer News) and this is what I found: How cool is this self temperature taking apparatus at TBD @ 301. I'm safe to go in and order at a healthy temperature of 97.3! Show More Show Less Desi Fereira What a cool device to add to our office. Easy installation and great support from Kriosk. Show More Show Less Martin Bradford AJPS Wonderful service and timely support by the Kriosk team. The product is great and works perfect, helping our employees feel safe at our workplace. Thanks guys. Show More Show Less Brett Attenti Our customers are happy and this product makes them feel safe when they come visit. Thanks to Kriosk for the free training and timely support. Highly recommend. Show More Show Less Bea TBD Cafe I was dropping off customer loyalty cards printed in less than one day at M&M Printing (sister company of The Observer News) and this is what I found: How cool is this self temperature taking apparatus at TBD @ 301. I'm safe to go in and order at a healthy temperature of 97.3! Show More Show Less Desi Fereira I was dropping off customer loyalty cards printed in less than one day at M&M Printing (sister company of The Observer News) and this is what I found: How cool is this self temperature taking apparatus at TBD @ 301. I'm safe to go in and order at a healthy temperature of 97.3! What a cool device to add to our office. Easy installation and great support from Kriosk. Show More Show Less Martin Bradford AJPS What a cool device to add to our office. Easy installation and great support from Kriosk. Wonderful service and timely support by the Kriosk team. The product is great and works perfect, helping our employees feel safe at our workplace. Thanks guys. Show More Show Less Brett Attenti Our customers are happy and this product makes them feel safe when they come visit. Thanks to Kriosk for the free training and timely support. Highly recommend. Show More Show Less Bea TBD Cafe Who is already using it The Access Management Kiosk with Temperature Screening and Facial Recognition is now being be used in business and public places, installed at their entry points, access gates to their buildings, facilities and place of business. Our clients are in the following industries: Manufacturing Units Retail Senior Care Colleges & Schools SHOP Who is already using it The Access Management Kiosk with Temperature Screening and Facial Recognition is now being be used in business and public places, installed at their entry points, access gates to their buildings, facilities and place of business. Our clients are in the following industries:"
  ]
}