{
  "company": "metsakuur.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 3,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 1
    }
  },
  "sample_docs": [
    "The way to creating a new world together with customers A gathering of top-notch experts with the highest technological prowess working together to create innovative business outcomes METSAKUUR INC., leveraging the expertise and know-how of industry-leading facial recognition AI technology specialists, leads customer business innovation. METSAKUUR INC. has entered the financial/public industries, applying the strictest standards and obtaining official certifications for the accuracy, processing speed, and security-related technical capabilities required for facial recognition technology. Furthermore, our facial recognition AI solution has continuously improved its performance based on advanced deep learning technology. This progress is achieved through partnerships with our customers. The Way We Work A leading AI technology innovation company for a new world. Professional Comprised of top-tier professionals in the industry, we have developed our own facial recognition core technology through extensive experience and expertise over the years. Partnership Our technology is perfected through partnerships. We strive to find the optimal solutions in diverse business environments by collaborating with different companies. Evolving We continuously research and develop to enhance our proprietary technology and explore various applications of AI in video analysis through years of dedicated effort in R&D. What Technology we have for the business Leading the finance and public industries with differentiated technological capabilities. 01 Facial Recognition AI Technology Developed in-house based on advanced deep learning technology Proven technology capabilities in accuracy, processing speed, and security Supports standalone SDK, server systems, and major operating systems Commercialized face recognition technology in the finance and public sectors 02 Middleware Encryption UFACE server system optimized dedicated middleware Management of bio-information registration/storage/verification processes Support for distributed processing of massive transactions Ensures the highest performance for millions of users 03 Fin Tech Holds the largest references for commercialization in the first financial sector First commercialization of facial recognition in mobile banking in Korea Application of solutions in mobile, counter, ATM, internal access control, etc. Accumulation of optimized know-how through the introduction of technology in large financial institutions 04 SaaS Service Provides customized services tailored to customer business needs Easy and simple adoption for immediate service use Cost savings through simplified maintenance and resource management Continuous and professional management services provided Our History based on advanced technology and trust Growing together with customers through digital innovation in business 2022 Acquired the Facial Recognition Performance and Security Test Certificate from the Korea Information and Communication Technology Association Achieved 100% Facial Recognition Accuracy Certification from KISA Constructed and expanded the mobile identification system for the Korea Minting and Security Printing Corporation 화살표 Selected as a supplier for the facial recognition sector of the National Merit Medal Certificate by the Korea Minting and Security Printing Corporation Providing facial recognition solutions for Hana Bank's non-face-to-face video consultation system Supplying facial recognition services for the online test of recognized English tests by Gyowon GUMON Providing Shinhan Bank with facial recognition technology for mobile banking services 2021 Selected as a supplier for the mobile ID project of Korea Minting and Security Printing Corporation Signed a contract to supply facial recognition access terminals for SK Innovation's battery factory in Hungary Contracted to supply facial recognition solutions for Shinhan Cambodia Bank's ID verification Provided facial recognition solutions for internal control enhancement and authentication platform construction at Hana Bank Selected as a supplier for facial recognition technology in the innovation branch project of Shinhan Bank Passed the performance evaluation at the Bio Distributed Management Center of the Korea Financial Telecommunications & Clearings Institute 2020 Establishment of METSAKUUR INC. Signed a facial recognition AI supply contract with Hana Bank (First commercialization in the domestic financial sector) Successfully launched the first online exam monitoring service in Korea for the Kyowon Group Launched facial recognition authentication for Hana Bank's mobile banking service (One Q Bank) Provided facial recognition services for the 'KNN Mathematical Creativity Contest & Elementary English Proficiency Test Online Exam.' Successfully conducted a proof-of-concept (PoC) for facial recognition-based access control and productivity management at SK Construction's Ulsan site Obtained KOLAS International Certification for facial recognition processing speed Company Information Company Name MESAKUUR COMPANY CEO Lee Ji Hoon Headquarters Address 13-14F, KR Building, 141 Teheran-ro, Gangnam-gu, Seoul, South Korea Phone 02-6743-0011 Company Name MESAKUUR COMPANY CEO Lee Ji Hoon Headquarters Address 13-14F, KR Building, 141 Teheran-ro, Gangnam-gu, Seoul, South Korea Phone 02-6743-0011 The way to creating a new world together with customers METSAKUUR INC., leveraging the expertise and know-how of industry-leading facial recognition AI technology specialists, leads customer business innovation. METSAKUUR INC. has entered the financial/public industries, applying the strictest standards and obtaining official certifications for the accuracy, processing speed, and security-related technical capabilities required for facial recognition technology. Furthermore, our facial recognition AI solution has continuously improved its performance based on advanced deep learning technology. This progress is achieved through partnerships with our customers. The Way We Work A leading AI technology innovation company for a new world. Professional Comprised of top-tier professionals in the industry, we have developed our own facial recognition core technology through extensive experience and expertise over the years. Partnership Our technology is perfected through partnerships. We strive to find the optimal solutions in diverse business environments by collaborating with different companies. Evolving We continuously research and develop to enhance our proprietary technology and explore various applications of AI in video analysis through years of dedicated effort in R&D. The Way We Work A leading AI technology innovation company for a new world. Comprised of top-tier professionals in the industry, we have developed our own facial recognition core technology through extensive experience and expertise over the years. Our technology is perfected through partnerships. We strive to find the optimal solutions in diverse business environments by collaborating with different companies. We continuously research and develop to enhance our proprietary technology and explore various applications of AI in video analysis through years of dedicated effort in R&D. What Technology we have for the business Leading the finance and public industries with differentiated technological capabilities. 01 Facial Recognition AI Technology Developed in-house based on advanced deep learning technology Proven technology capabilities in accuracy, processing speed, and security Supports standalone SDK, server systems, and major operating systems Commercialized face recognition technology in the finance and public sectors 02 Middleware Encryption UFACE server system optimized dedicated middleware Management of bio-information registration/storage/verification processes Support for distributed processing of massive transactions Ensures the highest performance for millions of users 03 Fin Tech Holds the largest references for commercialization in the first financial sector First commercialization of facial recognition in mobile banking in Korea Application of solutions in mobile, counter, ATM, internal access control, etc. Accumulation of optimized know-how through the introduction of technology in large financial institutions 04 SaaS Service Provides customized services tailored to customer business needs Easy and simple adoption for immediate service use Cost savings through simplified maintenance and resource management Continuous and professional management services provided What Technology we have for the business Leading the finance and public industries with differentiated technological capabilities. Developed in-house based on advanced deep learning technology Proven technology capabilities in accuracy, processing speed, and security Supports standalone SDK, server systems, and major operating systems Commercialized face recognition technology in the finance and public sectors UFACE server system optimized dedicated middleware Management of bio-information registration/storage/verification processes Support for distributed processing of massive transactions Ensures the highest performance for millions of users Holds the largest references for commercialization in the first financial sector First commercialization of facial recognition in mobile banking in Korea Application of solutions in mobile, counter, ATM, internal access control, etc. Accumulation of optimized know-how through the introduction of technology in large financial institutions Provides customized services tailored to customer business needs Easy and simple adoption for immediate service use Cost savings through simplified maintenance and resource management Continuous and professional management services provided Our History based on advanced technology and trust Growing together with customers through digital innovation in business 2022 Acquired the Facial Recognition Performance and Security Test Certificate from the Korea Information and Communication Technology Association Achieved 100% Facial Recognition Accuracy Certification from KISA Constructed and expanded the mobile identification system for the Korea Minting and Security Printing Corporation 화살표 Selected as a supplier for the facial recognition sector of the National Merit Medal Certificate by the Korea Minting and Security Printing Corporation Providing facial recognition solutions for Hana Bank's non-face-to-face video consultation system Supplying facial recognition services for the online test of recognized English tests by Gyowon GUMON Providing Shinhan Bank with facial recognition technology for mobile banking services 2021 Selected as a supplier for the mobile ID project of Korea Minting and Security Printing Corporation Signed a contract to supply facial recognition access terminals for SK Innovation's battery factory in Hungary Contracted to supply facial recognition solutions for Shinhan Cambodia Bank's ID verification Provided facial recognition solutions for internal control enhancement and authentication platform construction at Hana Bank Selected as a supplier for facial recognition technology in the innovation branch project of Shinhan Bank Passed the performance evaluation at the Bio Distributed Management Center of the Korea Financial Telecommunications & Clearings Institute 2020 Establishment of METSAKUUR INC. Signed a facial recognition AI supply contract with Hana Bank (First commercialization in the domestic financial sector) Successfully launched the first online exam monitoring service in Korea for the Kyowon Group Launched facial recognition authentication for Hana Bank's mobile banking service (One Q Bank) Provided facial recognition services for the 'KNN Mathematical Creativity Contest & Elementary English Proficiency Test Online Exam.' Successfully conducted a proof-of-concept (PoC) for facial recognition-based access control and productivity management at SK Construction's Ulsan site Obtained KOLAS International Certification for facial recognition processing speed Our History based on advanced technology and trust Growing together with customers through digital innovation in business Acquired the Facial Recognition Performance and Security Test Certificate from the Korea Information and Communication Technology Association Achieved 100% Facial Recognition Accuracy Certification from KISA Constructed and expanded the mobile identification system for the Korea Minting and Security Printing Corporation 화살표 Selected as a supplier for the facial recognition sector of the National Merit Medal Certificate by the Korea Minting and Security Printing Corporation Providing facial recognition solutions for Hana Bank's non-face-to-face video consultation system Supplying facial recognition services for the online test of recognized English tests by Gyowon GUMON Providing Shinhan Bank with facial recognition technology for mobile banking services Selected as a supplier for the mobile ID project of Korea Minting and Security Printing Corporation Signed a contract to supply facial recognition access terminals for SK Innovation's battery factory in Hungary Contracted to supply facial recognition solutions for Shinhan Cambodia Bank's ID verification Provided facial recognition solutions for internal control enhancement and authentication platform construction at Hana Bank Selected as a supplier for facial recognition technology in the innovation branch project of Shinhan Bank Passed the performance evaluation at the Bio Distributed Management Center of the Korea Financial Telecommunications & Clearings Institute Establishment of METSAKUUR INC. Signed a facial recognition AI supply contract with Hana Bank (First commercialization in the domestic financial sector) Successfully launched the first online exam monitoring service in Korea for the Kyowon Group Launched facial recognition authentication for Hana Bank's mobile banking service (One Q Bank) Provided facial recognition services for the 'KNN Mathematical Creativity Contest & Elementary English Proficiency Test Online Exam.' Successfully conducted a proof-of-concept (PoC) for facial recognition-based access control and productivity management at SK Construction's Ulsan site Obtained KOLAS International Certification for facial recognition processing speed Company Information Company Name MESAKUUR COMPANY CEO Lee Ji Hoon Headquarters Address 13-14F, KR Building, 141 Teheran-ro, Gangnam-gu, Seoul, South Korea Phone 02-6743-0011 Company Name MESAKUUR COMPANY CEO Lee Ji Hoon Headquarters Address 13-14F, KR Building, 141 Teheran-ro, Gangnam-gu, Seoul, South Korea Phone 02-6743-0011",
    "Online Test Monitoring Service iJANUS OTM Supports fast and accurate monitoring of misconduct, providing a secure online examination service Real Time Online Test Monitoring No worries about Cheating! By utilizing facial recognition technology-based real-time monitoring, it detects any misconduct by exam takers, ensuring a secure online examination environment Key Feature Online Test Monitoring service iJANUS OTM Implementing fair online exam management technology for customer business Real-time Monitoring quipped with misconduct detection features Provides a stable online exam monitoring environment by detecting exam takers' misconduct in real-time through situational analysis such as seat departure, multiple people detection, concentration level, etc. Monitoring based on 100% accuracy in facial recognition Provides a secure exam environment through self-verification of candidates and detection of misconduct using the front camera attached to devices such as mobile phones, PCs, tablets, without the need for additional device installation. Daily participation of over 50,000 individuals Largest-scale examination operation in the country With a daily participation of over 50,000 individuals, simultaneous connections of around 8,000, and a total of over 7 million cases of AI monitoring, we possess the experience and technical expertise for the largest-scale online exam monitoring operation in the country. Web browser-based SaaS Quick and easy implementation Easily and quickly adoptable, allowing for immediate use anytime, anywhere. Simplifying maintenance and resource management can reduce system operating costs. System Structure Facial Recognition Engine Create a personalized exam environment for the candidate and proceed with the examination. Candidate Experience Step 01 Exam Creation Step 02 Pre-registration Step 03 Exam Participation Step 04 Exam Completion What industry applied to Application of large-scale online exams in various industries. Corporate Internal Assessment Employment exams, job performance evaluations, etc. Public Sector Qualification Exams Various types of qualification exams Educational Institution Regular Exams University, academies, and other educational programs Our Partners All over the world A service chosen by global corporations and top domestic education companies Online Test Monitoring Service iJANUS OTM Real Time Online Test Monitoring No worries about Cheating! By utilizing facial recognition technology-based real-time monitoring, it detects any misconduct by exam takers, ensuring a secure online examination environment No worries about Cheating! By utilizing facial recognition technology-based real-time monitoring, it detects any misconduct by exam takers, ensuring a secure online examination environment Key Feature Online Test Monitoring service iJANUS OTM Implementing fair online exam management technology for customer business Real-time Monitoring quipped with misconduct detection features Provides a stable online exam monitoring environment by detecting exam takers' misconduct in real-time through situational analysis such as seat departure, multiple people detection, concentration level, etc. Monitoring based on 100% accuracy in facial recognition Provides a secure exam environment through self-verification of candidates and detection of misconduct using the front camera attached to devices such as mobile phones, PCs, tablets, without the need for additional device installation. Daily participation of over 50,000 individuals Largest-scale examination operation in the country With a daily participation of over 50,000 individuals, simultaneous connections of around 8,000, and a total of over 7 million cases of AI monitoring, we possess the experience and technical expertise for the largest-scale online exam monitoring operation in the country. Web browser-based SaaS Quick and easy implementation Easily and quickly adoptable, allowing for immediate use anytime, anywhere. Simplifying maintenance and resource management can reduce system operating costs. Key Feature Online Test Monitoring service iJANUS OTM Implementing fair online exam management technology for customer business Real-time Monitoring quipped with misconduct detection features Provides a stable online exam monitoring environment by detecting exam takers' misconduct in real-time through situational analysis such as seat departure, multiple people detection, concentration level, etc. Monitoring based on 100% accuracy in facial recognition Provides a secure exam environment through self-verification of candidates and detection of misconduct using the front camera attached to devices such as mobile phones, PCs, tablets, without the need for additional device installation. Daily participation of over 50,000 individuals Largest-scale examination operation in the country With a daily participation of over 50,000 individuals, simultaneous connections of around 8,000, and a total of over 7 million cases of AI monitoring, we possess the experience and technical expertise for the largest-scale online exam monitoring operation in the country. Web browser-based SaaS Quick and easy implementation Easily and quickly adoptable, allowing for immediate use anytime, anywhere. Simplifying maintenance and resource management can reduce system operating costs. System Structure Facial Recognition Engine Create a personalized exam environment for the candidate and proceed with the examination. Candidate Experience Step 01 Exam Creation Step 02 Pre-registration Step 03 Exam Participation Step 04 Exam Completion System Structure Facial Recognition Engine Create a personalized exam environment for the candidate and proceed with the examination. Step 01 Exam Creation Step 03 Exam Participation Step 04 Exam Completion What industry applied to Application of large-scale online exams in various industries. Corporate Internal Assessment Employment exams, job performance evaluations, etc. Public Sector Qualification Exams Various types of qualification exams Educational Institution Regular Exams University, academies, and other educational programs What industry applied to Application of large-scale online exams in various industries. Employment exams, job performance evaluations, etc. Public Sector Qualification Exams Various types of qualification exams Educational Institution Regular Exams University, academies, and other educational programs Our Partners All over the world A service chosen by global corporations and top domestic education companies Our Partners All over the world A service chosen by global corporations and top domestic education companies",
    "Let's Make it together We are looking for talented individuals to share special moments and create a new world with METSAKUUR INC. Our Culture We support mutual growth through communication and collaboration within an autonomous and egalitarian culture. Essence over form Avoiding work for the sake of work, we focus on the essence and core, executing swiftly. Growth at the end of a challenge At the end of a challenge, the results encountered become valuable experiences and lessons, leading to growth in a better direction. Evolving corporate culture METSAKUUR's culture is not static; it evolves continuously through open communication.\" Work · Life Balance We operate various programs to achieve a harmonious balance between employees' work and life. Club support Supporting internal clubs for activities such as golf, gourmet, one-day classes, camping, and more Operating T.G.I.F. Day Regular day off on the third Friday of each month following the concept of \"Thanks God It's Friday\"(12 days of annual leave separately provided.) Community of Practice Facilitating knowledge-sharing sessions through learning and discussions related to job responsibilities for self-development and enhancement of job skills Support for education and conferences Systematic support for domestic and international conferences, seminars, lectures, etc., to enhance job competencies Invitation of external lecturers and experts Supporting departmental seminars through the invitation of external lecturers or experts Support for book purchase expenses Cost support for purchasing books in various fields related to work Welfare Benefits We provide various welfare benefits for better working conditions and performance rewards. Project Performance Bonus System Measure project-specific achievements and provide incentives to participants based on the results achieved Support for Youth Employment Subsidy Interest on the collectively saved deduction fund by workers, companies, and the government is added, and performance rewards are paid Freedom to use annual leave Various leave systems such as birthday, anniversary, and founding day off are in operation Support for the latest business equipment Free provision of various latest equipment such as MacBook, laptop, and PC upon new employee onboarding Support for convenient facilities Operation of an in-house cafeteria where employees can spend break time during working hours Operation of a snack bar Operating an in-house snack bar where employees can enjoy a variety of snacks and beverages Recruitment Procedure We value expectations, respect, and the importance of teamwork for the talents who will be joining Mesakuur Company Job application Document screening 1st practical interview 2nd executive interview Employment confirmed Let's Make it together Our Culture We support mutual growth through communication and collaboration within an autonomous and egalitarian culture. Essence over form Avoiding work for the sake of work, we focus on the essence and core, executing swiftly. Growth at the end of a challenge At the end of a challenge, the results encountered become valuable experiences and lessons, leading to growth in a better direction. Evolving corporate culture METSAKUUR's culture is not static; it evolves continuously through open communication.\" We support mutual growth through communication and collaboration within an autonomous and egalitarian culture. Avoiding work for the sake of work, we focus on the essence and core, executing swiftly. Growth at the end of a challenge At the end of a challenge, the results encountered become valuable experiences and lessons, leading to growth in a better direction. METSAKUUR's culture is not static; it evolves continuously through open communication.\" Work · Life Balance We operate various programs to achieve a harmonious balance between employees' work and life. Club support Supporting internal clubs for activities such as golf, gourmet, one-day classes, camping, and more Operating T.G.I.F. Day Regular day off on the third Friday of each month following the concept of \"Thanks God It's Friday\"(12 days of annual leave separately provided.) Community of Practice Facilitating knowledge-sharing sessions through learning and discussions related to job responsibilities for self-development and enhancement of job skills Support for education and conferences Systematic support for domestic and international conferences, seminars, lectures, etc., to enhance job competencies Invitation of external lecturers and experts Supporting departmental seminars through the invitation of external lecturers or experts Support for book purchase expenses Cost support for purchasing books in various fields related to work Work · Life Balance We operate various programs to achieve a harmonious balance between employees' work and life. Supporting internal clubs for activities such as golf, gourmet, one-day classes, camping, and more Regular day off on the third Friday of each month following the concept of \"Thanks God It's Friday\"(12 days of annual leave separately provided.) Facilitating knowledge-sharing sessions through learning and discussions related to job responsibilities for self-development and enhancement of job skills Support for education and conferences Systematic support for domestic and international conferences, seminars, lectures, etc., to enhance job competencies Invitation of external lecturers and experts Supporting departmental seminars through the invitation of external lecturers or experts Support for book purchase expenses Cost support for purchasing books in various fields related to work Welfare Benefits We provide various welfare benefits for better working conditions and performance rewards. Project Performance Bonus System Measure project-specific achievements and provide incentives to participants based on the results achieved Support for Youth Employment Subsidy Interest on the collectively saved deduction fund by workers, companies, and the government is added, and performance rewards are paid Freedom to use annual leave Various leave systems such as birthday, anniversary, and founding day off are in operation Support for the latest business equipment Free provision of various latest equipment such as MacBook, laptop, and PC upon new employee onboarding Support for convenient facilities Operation of an in-house cafeteria where employees can spend break time during working hours Operation of a snack bar Operating an in-house snack bar where employees can enjoy a variety of snacks and beverages We provide various welfare benefits for better working conditions and performance rewards. Project Performance Bonus System Measure project-specific achievements and provide incentives to participants based on the results achieved Support for Youth Employment Subsidy Interest on the collectively saved deduction fund by workers, companies, and the government is added, and performance rewards are paid Freedom to use annual leave Various leave systems such as birthday, anniversary, and founding day off are in operation Support for the latest business equipment Free provision of various latest equipment such as MacBook, laptop, and PC upon new employee onboarding Support for convenient facilities Operation of an in-house cafeteria where employees can spend break time during working hours Operation of a snack bar Operating an in-house snack bar where employees can enjoy a variety of snacks and beverages Recruitment Procedure We value expectations, respect, and the importance of teamwork for the talents who will be joining Mesakuur Company Job application Document screening 1st practical interview 2nd executive interview Employment confirmed We value expectations, respect, and the importance of teamwork for the talents who will be joining Mesakuur Company",
    "Menu Korean KOR Menu About Us We can be your solution provider partner with face recognition AI technology. About Us We can be your solution provider partner with face recognition AI technology. We can be your solution provider partner with face recognition AI technology. Metsakuur INC aims for a vibrant IT ecosystem in South Korea Metsa(=Forest) Kuur(=Cure) believes in the power of the forest. We will drive new vitality into the IT business ecosystem with our AI technology Metsakuur INC aims for a vibrant IT ecosystem in South Korea Metsa(=Forest) Kuur(=Cure) believes in the power of the forest. We will drive new vitality into the IT business ecosystem with our AI technology Company Introduction Metsakuur INC. Metsakuur INC will become an essential AI solution partner for your business based on our exclusive face recognition AI technology and various business IT experiences Partnerships completes our technology We work together to find the optimal solution in a variety of needs and different business environments. Metsakuur INC's face recognition AI solution can be provided in any form of SDK, On-Premise, or SAAS by identifying the method that is most suitable for the partner's environment. Metsakuur INC is specialized in face recognition AI technology . Through years of R&D, we boast our exclusive face recognition technology for its accuracy of 100 % and highest processing speed which is the fastest in current IT industry. Even at this moment, the researchers of Metsakuur INC are constantly focusing on R&D to improve face recognition technology and discover various AI application technologies for image analysis. Metsakuur INC will become an essential AI solution partner for your business based on our exclusive face recognition AI technology and various business IT experiences Partnerships completes our technology We work together to find the optimal solution in a variety of needs and different business environments. Metsakuur INC's face recognition AI solution can be provided in any form of SDK, On-Premise, or SAAS by identifying the method that is most suitable for the partner's environment. Metsakuur INC is specialized in face recognition AI technology . Through years of R&D, we boast our exclusive face recognition technology for its accuracy of 100 % and highest processing speed which is the fastest in current IT industry. Even at this moment, the researchers of Metsakuur INC are constantly focusing on R&D to improve face recognition technology and discover various AI application technologies for image analysis. Our History Metsakuur INC's effort to be the best company known for face recognition AI technology Metsakuur INC's effort to be the best company known for face recognition AI technology 2021 07 Selected as a face recognition supplier for the National Pension Service's blockchain public lead pilot project 06 Selected as a face recognition technology supplier for the next-generation Nara Marketplace construction project by the Public Procurement Service 05 Selected as a supplier of face recognition technology for the mobile ID card construction project of the Korea Mint Corp. 03 Selected as a face recognition supplier for Shinhan Bank's futuristic innovative branch construction project Selected as Intel Partner Alliance membership Passed the performance examination of the Bio Distributed Management Center of Korea Financial Telecommunications and Clearings Institute (KFTC) 01 Concluded a license agreement with Korea Digital Payments for face recognition SDK Selected as a participating company for the 2nd 'IBK 1st Lab' 2020 12 Collaborated with SkelterLabs and Sensicon to develop barrier-free kiosks Recorded 0.06 seconds of 1:1 million response time in KOLAS face recognition speed test Established corporate research institute 11 Additional acquisition of KISA face recognition certificate Successful PoC for access control system in Ulsan (SK engineering & construction) 10 Supplied face verification service at 'KNN Math Creativity Contest & Elementary English Language Proficiency Assessment (Online test)' Supplied face recognition SDK license with EDMS Co., Ltd. 09 Supplied face confirmation service at KBS Korean Language Proficiency Test with BP Factory Co., Ltd. Supplied face confirmation service for online lecture supervision at the International Conference of the Korean Society of Anesthesiologists with MCI Korea Confirmation of venture company 08 Launched facial recognition authentication (Hana Bank's mobile banking) 07 Supplied face confirmation service at 'Mathematics Recognition Online Test' to Kumon Institute Education Co. Ltd. 06 Selected as 10th at startup support program of \"Hana Bank 1Q Agile Lab†05 Applied for patent on analyzing concentration from face recognition based on web 04 Acquired KISA face recognition certificate 03 Won an order for face recognition solution from Hana Bank's mobile banking service \"1Q Bank†for the first time in the domestic banking sector. 02 Released demo version of analysis solution for online concentration rate 01 Released an app for mobile face recognition service Incorporated 2021 07 Selected as a face recognition supplier for the National Pension Service's blockchain public lead pilot project 06 Selected as a face recognition technology supplier for the next-generation Nara Marketplace construction project by the Public Procurement Service 05 Selected as a supplier of face recognition technology for the mobile ID card construction project of the Korea Mint Corp. 03 Selected as a face recognition supplier for Shinhan Bank's futuristic innovative branch construction project Selected as Intel Partner Alliance membership Passed the performance examination of the Bio Distributed Management Center of Korea Financial Telecommunications and Clearings Institute (KFTC) 01 Concluded a license agreement with Korea Digital Payments for face recognition SDK Selected as a participating company for the 2nd 'IBK 1st Lab' 07 Selected as a face recognition supplier for the National Pension Service's blockchain public lead pilot project Selected as a face recognition supplier for the National Pension Service's blockchain public lead pilot project 06 Selected as a face recognition technology supplier for the next-generation Nara Marketplace construction project by the Public Procurement Service Selected as a face recognition technology supplier for the next-generation Nara Marketplace construction project by the Public Procurement Service 05 Selected as a supplier of face recognition technology for the mobile ID card construction project of the Korea Mint Corp. Selected as a supplier of face recognition technology for the mobile ID card construction project of the Korea Mint Corp. 03 Selected as a face recognition supplier for Shinhan Bank's futuristic innovative branch construction project Selected as Intel Partner Alliance membership Passed the performance examination of the Bio Distributed Management Center of Korea Financial Telecommunications and Clearings Institute (KFTC) Selected as a face recognition supplier for Shinhan Bank's futuristic innovative branch construction project Selected as Intel Partner Alliance membership Passed the performance examination of the Bio Distributed Management Center of Korea Financial Telecommunications and Clearings Institute (KFTC) 01 Concluded a license agreement with Korea Digital Payments for face recognition SDK Selected as a participating company for the 2nd 'IBK 1st Lab' Concluded a license agreement with Korea Digital Payments for face recognition SDK Selected as a participating company for the 2nd 'IBK 1st Lab' 2020 12 Collaborated with SkelterLabs and Sensicon to develop barrier-free kiosks Recorded 0.06 seconds of 1:1 million response time in KOLAS face recognition speed test Established corporate research institute 11 Additional acquisition of KISA face recognition certificate Successful PoC for access control system in Ulsan (SK engineering & construction) 10 Supplied face verification service at 'KNN Math Creativity Contest & Elementary English Language Proficiency Assessment (Online test)' Supplied face recognition SDK license with EDMS Co., Ltd. 09 Supplied face confirmation service at KBS Korean Language Proficiency Test with BP Factory Co., Ltd. Supplied face confirmation service for online lecture supervision at the International Conference of the Korean Society of Anesthesiologists with MCI Korea Confirmation of venture company 08 Launched facial recognition authentication (Hana Bank's mobile banking) 07 Supplied face confirmation service at 'Mathematics Recognition Online Test' to Kumon Institute Education Co. Ltd. 06 Selected as 10th at startup support program of \"Hana Bank 1Q Agile Lab†05 Applied for patent on analyzing concentration from face recognition based on web 04 Acquired KISA face recognition certificate 03 Won an order for face recognition solution from Hana Bank's mobile banking service \"1Q Bank†for the first time in the domestic banking sector. 02 Released demo version of analysis solution for online concentration rate 01 Released an app for mobile face recognition service Incorporated 12 Collaborated with SkelterLabs and Sensicon to develop barrier-free kiosks Recorded 0.06 seconds of 1:1 million response time in KOLAS face recognition speed test Established corporate research institute Collaborated with SkelterLabs and Sensicon to develop barrier-free kiosks Recorded 0.06 seconds of 1:1 million response time in KOLAS face recognition speed test Established corporate research institute 11 Additional acquisition of KISA face recognition certificate Successful PoC for access control system in Ulsan (SK engineering & construction) Additional acquisition of KISA face recognition certificate Successful PoC for access control system in Ulsan (SK engineering & construction) 10 Supplied face verification service at 'KNN Math Creativity Contest & Elementary English Language Proficiency Assessment (Online test)' Supplied face recognition SDK license with EDMS Co., Ltd. Supplied face verification service at 'KNN Math Creativity Contest & Elementary English Language Proficiency Assessment (Online test)' Supplied face recognition SDK license with EDMS Co., Ltd. 09 Supplied face confirmation service at KBS Korean Language Proficiency Test with BP Factory Co., Ltd. Supplied face confirmation service for online lecture supervision at the International Conference of the Korean Society of Anesthesiologists with MCI Korea Confirmation of venture company Supplied face confirmation service at KBS Korean Language Proficiency Test with BP Factory Co., Ltd. Supplied face confirmation service for online lecture supervision at the International Conference of the Korean Society of Anesthesiologists with MCI Korea Confirmation of venture company 08 Launched facial recognition authentication (Hana Bank's mobile banking) Launched facial recognition authentication (Hana Bank's mobile banking) 07 Supplied face confirmation service at 'Mathematics Recognition Online Test' to Kumon Institute Education Co. Ltd. Supplied face confirmation service at 'Mathematics Recognition Online Test' to Kumon Institute Education Co. Ltd. 06 Selected as 10th at startup support program of \"Hana Bank 1Q Agile Lab†Selected as 10th at startup support program of \"Hana Bank 1Q Agile Lab†05 Applied for patent on analyzing concentration from face recognition based on web Applied for patent on analyzing concentration from face recognition based on web 04 Acquired KISA face recognition certificate Acquired KISA face recognition certificate 03 Won an order for face recognition solution from Hana Bank's mobile banking service \"1Q Bank†for the first time in the domestic banking sector. Won an order for face recognition solution from Hana Bank's mobile banking service \"1Q Bank†for the first time in the domestic banking sector. 02 Released demo version of analysis solution for online concentration rate Released demo version of analysis solution for online concentration rate 01 Released an app for mobile face recognition service Incorporated Released an app for mobile face recognition service Our Partner We can be your solution provider partner with face recognition AI technology. We can be your solution provider partner with face recognition AI technology. Contact Us Location of Metsakuur INC. Location of Metsakuur INC. Metsakuur INC. 13~14th floor, KR Tower, 141, Teheran-ro, Gangnam-gu, Seoul, Republic of Korea 02-6743-0011 050-4184-2707 master@metsakuur.com 13~14th floor, KR Tower, 141, Teheran-ro, Gangnam-gu, Seoul, Republic of Korea 02-6743-0011 master@metsakuur.com 13~14th floor, KR Tower, 141, Teheran-ro, Gangnam-gu, Seoul, Republic of Korea Contact us 02-6743-0011 master@metsakuur.com 13~14th floor, KR Tower, 141, Teheran-ro, Gangnam-gu, Seoul, Republic of Korea Contact us 13~14th floor, KR Tower, 141, Teheran-ro, Gangnam-gu, Seoul, Republic of Korea"
  ]
}