{
  "company": "myidentitypass.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 3,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 3
    }
  },
  "sample_docs": [
    "Three (3) Steps Verification Create Account Create your account in 30 seconds Get Api key Get your Api Key to make verification calls Start Verification Verify your customers using their provided documents Three (3) Steps Verification Create your account in 30 seconds Get your Api Key to make verification calls Verify your customers using their provided documents Instant Identity Verification Identitypass makes life less complicated for everyone, besides scammers. By integrating together along with your modern generation stack, you attain maximum loyalty and trust from your client while simultaneously reducing blind spots and cyber attacks. Get Started How is Identitypass Verification different? Our Artificial Intelligence driven fraud techniques captures more fraud attacks, and learn quickly to identify new fraud vectors. Fake documents Counterfeit documents Blank documents Camouflage documents Look-a-like documents Compromised documents Get started Identitypass makes life less complicated for everyone, besides scammers. By integrating together along with your modern generation stack, you attain maximum loyalty and trust from your client while simultaneously reducing blind spots and cyber attacks. How is Identitypass Verification different? Our Artificial Intelligence driven fraud techniques captures more fraud attacks, and learn quickly to identify new fraud vectors. Fake documents Counterfeit documents Blank documents Camouflage documents Look-a-like documents Compromised documents Get started How is Identitypass Verification different? Our Artificial Intelligence driven fraud techniques captures more fraud attacks, and learn quickly to identify new fraud vectors.",
    "Customers & Partners Trusted By Identity Data Verification Allows you to verify individuals and businesses identity through their existing issued Identification Numbers in a secured way. See More About Product BVN Phone Number Account Number Businesses TIN Government Issued Voters Card NIN International Passport RC Number Drivers License AND MANY MORE... AI-powered biometric Authentication From matching government issued cards with customers face to enrolling and authenticating users with biometrics, our biometrics engine empowers you to seamlessly do this. See More About Product ID Face Matching Facial Enrollment Facial Recognition Liveliness Check Identity Checkout Coming Soon Verify your customers through multiple data channels with one line Integration See More About Product Verify Identity card from over20+ Countries One line Integration Facial Recognition Liveliness Check Allows you to verify individuals and businesses identity through their existing issued Identification Numbers in a secured way. Government Issued Voters Card From matching government issued cards with customers face to enrolling and authenticating users with biometrics, our biometrics engine empowers you to seamlessly do this. Identity Checkout Coming Soon Verify your customers through multiple data channels with one line Integration Verify Identity card from over20+ Countries Who can use our Solutions? Identitypass for every Industry. From Local to Global Organisations, all you have to do is integrate our APIs into your System. Financial Services Identitypass for Financial services allows financial institutions the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. Digital Wallet Identitypass for Digital wallets allows Digital wallets the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. Online Gaming Identitypass allows Online Gaming platforms the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. View Use Cases Who can use our Solutions? Identitypass for every Industry. From Local to Global Organisations, all you have to do is integrate our APIs into your System. Identitypass for Financial services allows financial institutions the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. Identitypass for Digital wallets allows Digital wallets the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. Identitypass allows Online Gaming platforms the opportunity to verify customers using all our solutions at a very affordable charge while providing essential security for customers information. Quick API Integration Seamless API integration for Developers Identitypass provides developers with Simplified and easy to use APIs integration for third party Websites, and sleek verification system for Onsite Verification users. documentation 1 import requests; 2 url = \"https://api.myidentitypay.com/api/v1/biometrics/merchant/data/verification/nin_wo_face\" 3 payload = 'number=XXXXXXXXX' 4 headers = { 5 'X-Api-key' : '< your secret key>' 6 } 7 response = requests . request ( 8 \"POST\" , url, headers = headers, data = payload 9 ) | 1 { 2 \"status\" : true, 3 \"detail\" : \"Verification Successfull\", 4 \"nin_data\" : { 5 \"birthcountry\" : \"\", 6 \"birthdate\" : \"24-09-1989\", 7 \"maritalstatus\" : \"single\", 8 \"nspokenlang\" : \"YORUBA\", 9 \"religion\" : \"christianity\", 10 \"trackingId\" : \"\", 5 ... 11 } 12 } Seamless API integration for Developers Identitypass provides developers with Simplified and easy to use APIs integration for third party Websites, and sleek verification system for Onsite Verification users. 2 url = \"https://api.myidentitypay.com/api/v1/biometrics/merchant/data/verification/nin_wo_face\" 3 payload = 'number=XXXXXXXXX' 4 headers = { 5 'X-Api-key' : '< your secret key>' 7 response = requests . request ( 8 \"POST\" , url, headers = headers, data = payload 2 \"status\" : true, 3 \"detail\" : \"Verification Successfull\", 4 \"nin_data\" : { 5 \"birthcountry\" : \"\", 6 \"birthdate\" : \"24-09-1989\", 7 \"maritalstatus\" : \"single\", 8 \"nspokenlang\" : \"YORUBA\", 9 \"religion\" : \"christianity\", 10 \"trackingId\" : \"\", Subscribe to our Newsletter Subscribe to our Newsletter",
    "Led by powerful Automation 3s Immediate response With just a selfie you can verify any user's identity in 3 seconds 100% Superb Automation Fully automated Biometrics technology. 99% Precision Highly efficient face detection and biometric verification 98% First time face match Authenticate users on their first try using AI Image Capture. Led by powerful Automation With just a selfie you can verify any user's identity in 3 seconds Fully automated Biometrics technology. Highly efficient face detection and biometric verification Authenticate users on their first try using AI Image Capture. How Face Recognition Works Facial recognition is based on face position and landmark locations. The system calculates the similarity between the input face descriptor and all faces previously stored. The goal is to find the face(s) from the dataset that are most similar to the input face. Built with privacy in build Flexible and easy to use APIs Vast solutions for your businesses Access control without password vulnerabilities How Face Recognition Works Facial recognition is based on face position and landmark locations. The system calculates the similarity between the input face descriptor and all faces previously stored. The goal is to find the face(s) from the dataset that are most similar to the input face. Use Cases Face Authentication An efficient access control system using the face biometric. Identitypass's face authentication system allows merchants to authenticate/verify their users' identity using their faces. The face authentication gives users extra layer of authentication. Get Started Face Detection Face Detection is the first and essential step for face recognition, and it is used to detect faces in the images. It is a part of object detection and can be used in many businesses and management processes. Check out our APIs for more. Get Started Face Liveliness Check The product works in the background with any face biometric system to perform a frictionless liveliness check. Passive Facial Liveliness Detection is Critical, and essential in getting a accurate face recognition result. Explore our APIs for more understanding. Get Started Face Enrollment Smart Enrollment Technology for Face Recognition System. Human face is one of the most common and non-intrusive biometrics used to identify individuals. Enroll your users and authenticate them on returning. Get Started Age Detection From Face Face Detection API that detects the location of human faces in your images. Use our Face Details API to detect faces, gender, age, and other critical informations. Explore our apis to get more information Get Started An efficient access control system using the face biometric. Identitypass's face authentication system allows merchants to authenticate/verify their users' identity using their faces. The face authentication gives users extra layer of authentication. Face Detection is the first and essential step for face recognition, and it is used to detect faces in the images. It is a part of object detection and can be used in many businesses and management processes. Check out our APIs for more. The product works in the background with any face biometric system to perform a frictionless liveliness check. Passive Facial Liveliness Detection is Critical, and essential in getting a accurate face recognition result. Explore our APIs for more understanding. Smart Enrollment Technology for Face Recognition System. Human face is one of the most common and non-intrusive biometrics used to identify individuals. Enroll your users and authenticate them on returning. Age Detection From Face Face Detection API that detects the location of human faces in your images. Use our Face Details API to detect faces, gender, age, and other critical informations. Explore our apis to get more information",
    "Financial Services Over the years, digital finance industry has experienced a great deal of expansion, thereby leading to an ever-increasing challenge in the AML and KYC regulations — customer expectations growth, and fraudsters getting smarter, and this has always been a major worry for financial service providers. However, this has led regulators around the world to tighten requirements more. These are the thoughts behind Identitypass's verification platform which provides the solutions you need, allowing you to stay ahead of fast-changing industry regulations that can so easily affect your business. Crypto Crypto exchanges also get the opportunity to verify their clients using our AI-powered Biometric verification system. With Identitypass's Biometric verification, you get easy, secure and law compliant customers verification. It combines AI-based technology with the expertise of highly qualified fraud-spotting specialists. Businesses are also leveraging the advantages of Identitypass's fully automated, AI-powered identity verification system which eliminates unnecessary manual input by automatically capturing data from ID documents. Excellent customer experience through easy-to-follow, on-screen prompts facilitates improvement of conversion rates. The verification process is simple, utilizing a familiar, selfie-style tool. Digital wallet One common way in which a lot of individuals, firms, organizations are taking advantage of the ongoing digitization and streamlining their business processes with increasingly intensified legal and regulatory standards for today's digital transactions, is through DIGITAL WALLETS. However, you need some assurance yourself to know that you are ahead of the curve to protect clients. Fortunately, Identitypass's verification platforms provides flexible and easy access to a wide range of KYC products and services such as Biometrics verification and documents oriented verifications. The integration of these platforms are both easy and quick, it also provides scalable solutions that are suited for any organization size – from small and medium-sized businesses to multinational enterprises. Lending In time past, we have seen news of lending Organisations giving out loans to individuals who provided fake informations / falsified documents which were not duly verified thereby leading to the loss of such loans as there was no means to trace such individuals. With our layered approach using the identity document combined with facial biometrics offers a more secure way to verify identities of applicants. Be ready to tackle the heightened fraud risk during these unprecedented times Our identity document / Biometrics verification software is easy to use and can be fully integrated into your apps and websites. This means your customers can securely validate their identities during loan application, from anywhere at any time. Online Gaming As the online gaming industry grows, regulators around the world are tightening requirements while the goal is to make gaming safer and more trustworthy, if not handled properly, this can quickly lead to a reduction in player count. Bring players on board without them ever having to leave their mobile device or compromising on the customer experience by making it simple for them to verify themselves from any device, and go from the first tap to submission in under 10 seconds, with our market-leading solutions. Verify KYC documents, minimum age and prevent fraud using Identitypass's Biometric solutions. Over the years, digital finance industry has experienced a great deal of expansion, thereby leading to an ever-increasing challenge in the AML and KYC regulations — customer expectations growth, and fraudsters getting smarter, and this has always been a major worry for financial service providers. However, this has led regulators around the world to tighten requirements more. These are the thoughts behind Identitypass's verification platform which provides the solutions you need, allowing you to stay ahead of fast-changing industry regulations that can so easily affect your business. Crypto exchanges also get the opportunity to verify their clients using our AI-powered Biometric verification system. With Identitypass's Biometric verification, you get easy, secure and law compliant customers verification. It combines AI-based technology with the expertise of highly qualified fraud-spotting specialists. Businesses are also leveraging the advantages of Identitypass's fully automated, AI-powered identity verification system which eliminates unnecessary manual input by automatically capturing data from ID documents. Excellent customer experience through easy-to-follow, on-screen prompts facilitates improvement of conversion rates. The verification process is simple, utilizing a familiar, selfie-style tool. One common way in which a lot of individuals, firms, organizations are taking advantage of the ongoing digitization and streamlining their business processes with increasingly intensified legal and regulatory standards for today's digital transactions, is through DIGITAL WALLETS. However, you need some assurance yourself to know that you are ahead of the curve to protect clients. Fortunately, Identitypass's verification platforms provides flexible and easy access to a wide range of KYC products and services such as Biometrics verification and documents oriented verifications. The integration of these platforms are both easy and quick, it also provides scalable solutions that are suited for any organization size – from small and medium-sized businesses to multinational enterprises. In time past, we have seen news of lending Organisations giving out loans to individuals who provided fake informations / falsified documents which were not duly verified thereby leading to the loss of such loans as there was no means to trace such individuals. With our layered approach using the identity document combined with facial biometrics offers a more secure way to verify identities of applicants. Be ready to tackle the heightened fraud risk during these unprecedented times Our identity document / Biometrics verification software is easy to use and can be fully integrated into your apps and websites. This means your customers can securely validate their identities during loan application, from anywhere at any time. As the online gaming industry grows, regulators around the world are tightening requirements while the goal is to make gaming safer and more trustworthy, if not handled properly, this can quickly lead to a reduction in player count. Bring players on board without them ever having to leave their mobile device or compromising on the customer experience by making it simple for them to verify themselves from any device, and go from the first tap to submission in under 10 seconds, with our market-leading solutions. Verify KYC documents, minimum age and prevent fraud using Identitypass's Biometric solutions.",
    "What are the verification services offered by Identitypass? We offer BVN, NIN, Voter's card verification, Phone number, Account number, Driver's License, International passport for easy onboarding of customers. Do you also provide Biometric verification services? Yes we do. We provide a liveliness check, anti-spoofing and Facial Recognition. How long does Integration take? We have a very smooth integration process that takes about 24hours or less to integrate with our API. How often do you experience system downtimes ? This happens on rare occasions, but we always communicate to our clients when we do experience downtimes to ensure they always stay informed. Do we get charged for failed API calls ? No we do not charge for failed calls, you only get charged for successful calls. How do we fund our wallet ? You can fund your wallet from your dashboard using your debit or credit card. How do we handle issues that may arise ? Communication is very important to us, so we always setup support channels for our users on slack or skype for effective communication. Is what you do the same as Smile ID? Yes it is. We both offer verification prices though our pricing may differ. How do I integrate into any platform I build? you can integrate with our verification systems through API. We offer BVN, NIN, Voter's card verification, Phone number, Account number, Driver's License, International passport for easy onboarding of customers. Yes we do. We provide a liveliness check, anti-spoofing and Facial Recognition. We have a very smooth integration process that takes about 24hours or less to integrate with our API. This happens on rare occasions, but we always communicate to our clients when we do experience downtimes to ensure they always stay informed. No we do not charge for failed calls, you only get charged for successful calls. You can fund your wallet from your dashboard using your debit or credit card. Communication is very important to us, so we always setup support channels for our users on slack or skype for effective communication. Yes it is. We both offer verification prices though our pricing may differ. you can integrate with our verification systems through API."
  ]
}