{
  "company": "nntc.digital",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.5,
    "framing_market": 0.5,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 3
    }
  },
  "sample_docs": [
    "We focus on innovations and digital transformation projects SMART CITY IOT SOLUTIONS IOT PLATFORM FOR INDUSTRIAL SAFETY VIRTUAL & AUGMENTED REALITY 22.05.2019 NNTC's Summer Internship Program is Open We are looking for a summer interns: NNTC Summer Internship Program will give a good opportunity and skills practise for young technology enthusiasts. 29.04.2019 NNTC is launching a new product for person's safety - Digital Worker \"Digital worker†is a mix of IoT and AI technologies targeted to ensure safety and improve personnel performance with a focus on minimizing the number of accidents, preventing fraud and safety violations for industrial enterprises and construction companies. 22.05.2019 NNTC's Summer Internship Program is Open We are looking for a summer interns: NNTC Summer Internship Program will give a good opportunity and skills practise for young technology enthusiasts. NNTC's Summer Internship Program is Open We are looking for a summer interns: NNTC Summer Internship Program will give a good opportunity and skills practise for young technology enthusiasts. 29.04.2019 NNTC is launching a new product for person's safety - Digital Worker \"Digital worker†is a mix of IoT and AI technologies targeted to ensure safety and improve personnel performance with a focus on minimizing the number of accidents, preventing fraud and safety violations for industrial enterprises and construction companies. NNTC is launching a new product for person's safety - Digital Worker \"Digital worker†is a mix of IoT and AI technologies targeted to ensure safety and improve personnel performance with a focus on minimizing the number of accidents, preventing fraud and safety violations for industrial enterprises and construction companies. 11.06.2019 Hold on to Your Hard Hats. Neural Network Watching Over You and 20 Types of PPE You May Have 05.06.2019 Infographic: iFalcon Face Control Mobile 11.06.2019 Hold on to Your Hard Hats. Neural Network Watching Over You and 20 Types of PPE You May Have Hold on to Your Hard Hats. Neural Network Watching Over You and 20 Types of PPE You May Have 05.06.2019 Infographic: iFalcon Face Control Mobile Infographic: iFalcon Face Control Mobile",
    "İFALCON FACE CONTROL™ MOBILE The worlds' first autonomous mobile face recognition with AR smart glasses iFalcon Face Control ™ Mobile is a world's first fully autonomous AI-powered face recognition system integrated with a wearable device – AR smart glasses. iFalcon™ Face Control Mobile is designed for law enforcement officers and security guards on patrol. The bodycam or smart glasses screen the crowd to match faces against a database of violators, missing people or suspects. Once there is a match, the solution retrieves relevant information from the database and instantly sends an alert via AR smart glasses. iFalcon Face Control™ Mobile brings face recognition capabilities anywhere , even without the network of CCTV cameras covering every inch of the city. It proves particularly effective in: Detects people at public events, sports facilities and in other crowded areas: violators, 'watchlisted' individuals and missing people Public surveillance in transportation stations, airports, subway and other transport facilities Monitoring immigrants and identification of violators and imposters at border customs control Verification of identity according to 'white list' Preventing terrorism, espionage and unauthorized access to sensitive areas How do we stand out? iFalcon runs on an algorithm which is in the top three in of the recognition quality according to global ratings such as the Face Recognition Vendor Test compiled by the U.S. National Institute of Standards and Technology (NIST FRVT) and Labelled Faces in the Wild. AR smart glasses or bodycam detect faces with built-in camera and transmit information to a wearable portable computer over wireless channel Portable computer processes face images and compares them with faces from the database Portable computer finds the match in the database Once face match is found, a user is alerted via smart glasses Additional alerts can be sent to mobile devices",
    "We focus on innovations and digital transformation projects. Our main assets are expertise, reference projects, training programs and best-of-breed technologies in the highly demanded areas such as Face Recognition and Video Analytics, VR and AR, AI & Robotics, Internet of Things, Drones and Building Information Modeling. We are serving some of the largest government entities in the UAE and have earned a reputation of a trusted solution provider and innovative technology expert. We have strategic alliances with two international system integrators: CROC (est. 1992), top-3 system integrator, top-5 IT company and top-10 consulting business in Russia with more than 2,000 employees, and NGN , a regional group operating in MENA with expertise in complex IT infrastructure and engineering systems, listed as one of the \"Top Performing IT Companies in Turkey\". Although digital revolution has streamlined the adoption of innovations, lack of IT professionals may dramatically reduce the return on technology investment. Therefore, ongoing digital transformation is about not only embracing cutting-edge technologies, but also improving skills and qualifications of people who will drive business development in the years to come. That's what we do at NNTC. Our innovative and diversified training courses and consulting services addressing today's business challenges are designed and delivered by subject matter experts with a vast background in IT consulting and services and professional development.",
    "IOT PLATFORM FOR INDUSTRIAL SAFETY An IoT platform for industrial safety developed by NNTC aggregates data coming from any video analytics and local positioning, industrial and wearable IoT, access control and management, SCADA, and other systems. The platform can show what is happening either throughout the territory/building (including in its 3D model) or in a particular hall/shop. It processes information from all sources, detects threats, alerts a command center operator, and offers response options. The proprietary platform significantly reduces production and occupational risks by tracking the employee health and movements, thus ensuring their safety and better working conditions. Interactive 3D map showing on which ground/floor an employee is right now and where exactly Control over the wearing of personal protective equipment Detection of PPE hand-over/removal Alerting employee/operator to entering dangerous area Detection of people falling, entering danger zones without PPE, entering prohibited zones Monitoring of physical activity, non-motility, sleeping Alerting operator of the situation center Control over the wearing of personal protective equipment (PPE) Video analytics and related IoT solutions make it possible to track whether employees wear their personal protective equipment, by software-enabled monitoring of live video stream from cameras. Once the system detects a violation, like absence of goggles, it sends an alert describing the violation, its time and place. In line with the IoT paradigm, Bluetooth beacons are attached to personal protective equipment, and any signal damping indicates that a person has forgotten to take a gas mask or hard hat.",
    "NNTC integrates intelligent video analytics solutions that detect and recognize separate objects (people, vehicles, zones, etc.) in video, monitor behavior, and make forecasts. The proprietary runtime implementation of neural networks enables face processing to be executed in a fraction of a second, outperforming popular platforms in blind tests. Modules work independently from each other. In combination with other technologies such as virtualization, NNTC builds powerful, distributed and scalable solutions. Video analytics solutions help retailers run efficient marketing campaigns, improve efficiency of shopping zones, and deliver better customer experience. Video analytics allows you to: Count unique visitors and identify your loyal customers once they enter the store Count unique visitors and identify your loyal customers once they enter the store Assess the efficiency of your marketing campaigns through online sociodemographic analysis and visitor counting Assess the efficiency of your marketing campaigns through online sociodemographic analysis and visitor counting Analyze shopping zones to use your space more effectively Analyze shopping zones to use your space more effectively Monitor queues to react on peak times promptly and optimize queue time Monitor queues to react on peak times promptly and optimize queue time Deliver personalized advertising right at the point of sale Deliver personalized advertising right at the point of sale Customer: WORLDWIDE RETAIL STORES Employee on-work time registration Employee on-work time registration Detection of suspicious persons entering premises (black listing with security alerts) Detection of suspicious persons entering premises (black listing with security alerts) Control over POS terminals Control over POS terminals Reports and forecasts for peak times, number of people entering/leaving the store, and so on Reports and forecasts for peak times, number of people entering/leaving the store, and so on System is rolled out in two stores now System is rolled out in two stores now By the end of 2019, it will be rolled out in 80 stores across the country By the end of 2019, it will be rolled out in 80 stores across the country NNTC's proprietary face recognition engine detects, captures, and recognizes multiple faces per second and can be effectively used by law enforcement officers in crowded areas and at critical infrastructure facilities (transport hubs, energy/water/heating supply facilities), thus ensuring proper security on sites where individuals are to be identified or registered, including: Entrance areas of transportation stations, airports, subways, sport centers etc. Entrance areas of transportation stations, airports, subways, sport centers etc. Video surveillance, verification and access control Video surveillance, verification and access control The system automatically selects the best position for face capturing, transmits it and finds a match in the database, regardless of changes in skin, hair, etc. The system significantly reduces operator's load: no need for constant monitoring of all control areas and no space for human error. Use case: Public Security AI face recognition surveillance system covering the whole region AI face recognition surveillance system covering the whole region 21 cameras installed in the Sakhalin Region checkpoints to recognize wanted individuals 21 cameras installed in the Sakhalin Region checkpoints to recognize wanted individuals 98% of people identified – the highest possible efficiency on the market 98% of people identified – the highest possible efficiency on the market All departments have access to the system All departments have access to the system The system deployed on 12 sites (airports, ports, railway stations, etc.) The system deployed on 12 sites (airports, ports, railway stations, etc.) Analytics of video footage allows company's management to gain valuable insight into employee attendance and generate various custom reports with a large set of filters. As cameras capture employee entering the workspace, a facial recognition system instantly identifies an individual and changes their attendance status. Additionally, face recognition can be a basis for intelligent visitor management solution — a software and hardware system for logging visitors. Convenience and economy of time: a visitor pass can be requested and approved from the workplace, as tablet or smart phone allows the employees to use their work time more efficiently Convenience and economy of time: a visitor pass can be requested and approved from the workplace, as tablet or smart phone allows the employees to use their work time more efficiently No queues at the reception: pass issue in less than a minute No queues at the reception: pass issue in less than a minute Face recognition: guest movement tracking at all entrances Face recognition: guest movement tracking at all entrances Kiosk: optional self-registration kiosks to reduce traffic during peak loads Kiosk: optional self-registration kiosks to reduce traffic during peak loads High security: pass approval by different responsible persons, blacklists and site visit reports High security: pass approval by different responsible persons, blacklists and site visit reports Simple integration and servicing: web client use, integration with an enterprise portal and directory services, and Windows authentication Simple integration and servicing: web client use, integration with an enterprise portal and directory services, and Windows authentication NNTC is a supplier of AI-assisted video monitoring products by iCetana, which plugs into VMS, DVR, or cameras directly. The system analyzes every camera feed 24/7, learns what's normal in a scene and identifies anything abnormal. Once an abnormal event happens, it is displayed on a monitor, attracting operator's attention if necessary and fostering a faster reaction. Undesirable and abnormal events detected first Self-learning system adapting to change Performance in real-time and at scale Camera feed analysis: objects, edges, contrast, motion, direction, and speed Automatic identification of standard patterns Anomaly detection before the situation gets worse Abnormal event displayed and incident details instantly available for better response and reporting Operators taking action when necessary Real-time and historical reporting and data visualization"
  ]
}