{
  "company": "nominder.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Over 10 years we help companies reach their financial and branding goals. Engitech is a values-driven technology agency dedicated. Gallery Contacts 411 University St, Seattle, USA engitech@oceanthemes.net +1 -800-456-478-23 Twitter Facebook-f Pinterest-p Instagram Over 10 years we help companies reach their financial and branding goals. Engitech is a values-driven technology agency dedicated. 411 University St, Seattle, USA Professional AI Solutions We provide consulting and build custom AI systems We provide consulting and build custom AI systems Our Services Consulting It doesn't matter if you have experience with AI or not. We will analyze your requirements and consult your team on how to achieve the desired results. Data The success of AI project usually depends on correct data collection and labelling. We can help you to manage this process. Development We do model selection, custom architectures, training, evaluation and model optimization. Support Sometimes AI systems which were completely reasonable during installation deteriorate over time. With continuous support we have you covered. Consulting It doesn't matter if you have experience with AI or not. We will analyze your requirements and consult your team on how to achieve the desired results. Data The success of AI project usually depends on correct data collection and labelling. We can help you to manage this process. Development We do model selection, custom architectures, training, evaluation and model optimization. Support Sometimes AI systems which were completely reasonable during installation deteriorate over time. With continuous support we have you covered. It doesn't matter if you have experience with AI or not. We will analyze your requirements and consult your team on how to achieve the desired results. The success of AI project usually depends on correct data collection and labelling. We can help you to manage this process. We do model selection, custom architectures, training, evaluation and model optimization. Sometimes AI systems which were completely reasonable during installation deteriorate over time. With continuous support we have you covered. Face Recognition NIST Face Recognition Technology Evaluation (FRTE) 1:1 Verification ranks our face recognition algorithm as the 20th most accurate in the world, featuring: * The smallest face template, at only 258 bytes. * The 2nd fastest face template extraction algorithm. * The 2nd fastest face matching algorithm. We are among the top 20 companies with the most accurate face recognition algorithms, according to the benchmark results released on March 13, 2023 , where the results of 491 face recognition algorithms were published. NIST Face Recognition Technology Evaluation (FRTE) 1:1 Verification ranks our face recognition algorithm as the 20th most accurate in the world, featuring: * The smallest face template, at only 258 bytes. * The 2nd fastest face template extraction algorithm. * The 2nd fastest face matching algorithm. We are among the top 20 companies with the most accurate face recognition algorithms, according to the benchmark results released on March 13, 2023 , where the results of 491 face recognition algorithms were published. Face Age Estimation NIST Face Analysis Evaluation (FATE) Age Estimation & Verification ranks our face age estimation algorithm as the 2nd most accurate in the world, with: * Mean absolute error (MAE) of only 2.8 years across all datasets. * 2.5 times faster than the only more accurate algorithm. * The smallest library and data footprint on disk among the top 5 algorithms. According to the benchmark results released in January, 2025 , which evaluated 19 face age estimation algorithms from 13 companies. NIST Face Analysis Evaluation (FATE) Age Estimation & Verification ranks our face age estimation algorithm as the 2nd most accurate in the world, with: * Mean absolute error (MAE) of only 2.8 years across all datasets. * 2.5 times faster than the only more accurate algorithm. * The smallest library and data footprint on disk among the top 5 algorithms. According to the benchmark results released in January, 2025 , which evaluated 19 face age estimation algorithms from 13 companies. Solutions Artificial Intelligence is already applied in multiple domains. Technology maximizes efficiency in different industries. Don't be late. The following are only several examples: Self-Driving Vehicles Healthcare Biometrics / Surveillance Manufacturing Robotics Agriculture Artificial Intelligence is already applied in multiple domains. Technology maximizes efficiency in different industries. Don't be late. The following are only several examples: Self-Driving Vehicles Healthcare Biometrics / Surveillance Manufacturing Robotics Agriculture Artificial Intelligence is already applied in multiple domains. Technology maximizes efficiency in different industries. Don't be late. The following are only several examples: Get in Touch You think it can be solved by machine learning or perhaps you have doubts? Tell us your ideas and together we will find solutions. Contact Us You think it can be solved by machine learning or perhaps you have doubts? Tell us your ideas and together we will find solutions."
  ]
}