{
  "company": "ntechlab.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.6666666666666666,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "FACE, BODY, VEHICLE, AND LICENSE PLATE NUMBER RECOGNITION Multi-object video analytics platform REQUEST A DEMO <1 second to query that database 99 % accurate >1.5 billion faces in a database WHAT WE DO We create solutions that help to see the complete picture of the events real-time and in retrospective. In a split second, they can recognize a person's face in a crowd of thousands, track his or her location by the body features, or find all the frames containing the car of interest from all cameras within the network. Our technology helps create a safe and comfortable urban environment and improve enterprises' security and competitiveness across various industries. CHOOSE YOUR SOLUTION FOR BUSINESS Harness FindFace capabilities in your industry RETAIL | FINANCE | CORPORATE SAFETY | GAMBLING INDUSTRY | DATING SERVICES | MASS EVENTS AND STADIUMS FOR GOVERNMENT #1 in Biometric Public Safety Solutions PUBLIC SAFETY | TRANSPORT SECURITY | BIOMETRIC COMPLEX | EDUCATIONAL INSTITUTIONS | ANTI-COVID-19 CHOOSE YOUR USE CASE SECURITY Identify violators and respond before offenses are committed. CLIENT IDENTIFICATION Recognize your customers before they even enter. Improve the quality of service and increase sales. BIOMETRIC ACCESS CONTROL Provide quick access through the speed gate, complete visitor control, and time tracking. FRAUD PREVENTION The system will notify the security about the appearance of any «person of interest» and protect the business from financial losses. KNOW YOUR CUSTOMER Collect statistics on gender, age, emotions, and other data about your customers using the facial recognition system. Reach out to them on a personal level! DIDN'T FIND YOUR CASE? Leave a request, and our video analytics expert will contact you. THE HEART OF FINDFACE — THE WORLD BEST ALGORITHM NtechLab technology is recognized as the most accurate face recognition neural network in the world, according to NIST testing in May 2021 (National Institute of Standards and Technology). Our algorithms have repeatedly proven their superiority in many other independent competitions and tests. TECHNICAL CAPABILITIES FACIAL RECOGNITION Face detection even in low-quality video or in challenging conditions (poor lighting, a long distance from a camera, etc.) Instantly find the right person among multiple images or check that two photos are of the same person. Gender, age, emotions, glasses, beard, face mask BODY RECOGNITION Counting people, tracking movement between cameras, and search by body sample or body features Biometric control of employee access to secured areas, and monitoring of trespassing in restricted zones Body tracking between cameras for an accurate people count in spaces of large area or complex configuration, eliminating the repeat count between different cameras VEHICLE AND LICENSE PLATE NUMBER RECOGNITION Smart car checkpoints, tracking cars within the city or the facility territory Vehicle brand, model, color, and body type recognition Revealing and analyzing the connection between the human and the vehicle identification - HOW OUR CUSTOMERS USE FINDFACE [Case Study] Video Analytics at FIFA 2018 FindFace Multi made it possible to promptly recognize and detain nearly 100 individuals listed in databases containing some 50,000 offender photographs. Read full story [Case Study] Metropolitan-scale safe city system in Eastern Europe A one-of-a-kind video analytics solution was built in collaboration with local authorities in one of the largest cities of the Eastern Europe. Read full story [Case Study] Prevent Fraud with FindFace The Stop Shoplifter solution helps large retail chains cut losses to their annual gross revenue by 2−3%. Customers achieve a return on their investment in about… Read full story More stories Request Trial Version Fill out the form and we'll grant you trial access to FindFace Request trial WHAT THE WORLD'S MEDIA SAYS ABOUT US FindFace is a highly accurate facial recognition engine, the standout in a country known for its prowess in the space. It isn't the only firm working on such technology, but it's one of the most advanced. The US Government's National Institute of Standards and Technology recently identified NtechLab as having one of the most accurate facial recognition systems in the world. In 2018, the National Institute of Technology (NIST) noted the technological superiority of NtechLab in of software reliability and capacity. FindFace is a highly accurate facial recognition engine, the standout in a country known for its prowess in the space. It isn't the only firm working on such technology, but it's one of the most advanced. The US Government's National Institute of Standards and Technology recently identified NtechLab as having one of the most accurate facial recognition systems in the world. In 2018, the National Institute of Technology (NIST) noted the technological superiority of NtechLab in of software reliability and capacity. News and Media NtechLab has delivered a face recognition system to 220 cities in India These systems will be used to conduct exams in schools, particularly to check attendance and to exclude cases of passing tests by another person or… Read full story Man Takes Loans Using Other People's Pictures, Cheating Facial Recognition Technology A man was arrested in Brazil for using customers' photos to bypass the facial recognition login in a mobile banking app. He allegedly used the… Read full story NtechLab Conquers Southeast Asia In April, Nikolai Shiryaev, NtechLab business development manager, presented at an IT business event in Bangkok and impressed the audience with our video analytics solutions… Read full story NtechLab at the C5 Edomex participated at the third Congress of the technologies used for the security Last week, NtechLab had the honor to present at the third Edo Mex C5 Congress, organized by the State of Mexico and the C5 emergency… Read full story Compliance win announced by NtechLab after iBeta presentation attack test We are proud to share some great news with you. NtechLab's Liveness identity fraud prevention technology has once again proved its high security and passed… Read full story Designers take on facial recognition with adversarial fashion NtechLab says its tech works anyway Read full story NtechLab at Cairo ICT The bustling Cairo ICT event took place in Egypt's capital city between November 27 and 30, and NtechLab presence there was highly remarkable. Many visitors… Read full story NtechLab at GITEX GLOBAL 2022 This year, on 10−14 October, NtechLab, once again, took part in GITEX GLOBAL 2022 event, the Middle East's leading consumer computing and electronics trade show… Read full story NtechLab at Global AI Summit 2022 In 2022, NtechLab was honored to be a tech partner at the Global AI Summit held from 13 to 15 September 2022 in Riyadh, Saudi… Read full story NtechLab at Techsauce Global Summit 2022 Our company takes part in many important global IT events, and certainly we participated in the Techsauce Global Summit 2022 held in Bangkok on August… Read full story Opportunities and questions around facial recognition technology Facial recognition is an AI-powered tech advancement that provokes a range of opinions. This artificial-intelligence-enabled technology has significantly changed the game for security and surveillance;… Read full story NtechLab expands AI-based solutions in Thai urban society The advantages of security and safety have prompted many government agencies and industries to implement facial recognition technology into their daily operations, typically associated with… Read full story Award-winning facial recognition company NtechLab enters Thailand market NtechLab is a world-renowned expert in video analytics solutions powered by artificial intelligence. Read full story NtechLab announces major expansion into Mexico Company also unveils the concept of real-time facial recognition for smart cities at Expo Seguridad Read full story NIBM installs NtechLab-developed facial recognition system NIBM is the first educational institution in Sri Lanka to deploy facial recognition technology. The system is used for access control and attendance management. Facial… Read full story Sri Lanka's National Institute of Business Management Installs Facial Recognition System The facial recognition software is developed by NtechLab, artificial intelligence-based video analytics company Read full story FindFace Multi 1.2, the new version of NtechLab's video analytics platform We are pleased to announce the release of FindFace Multi 1.2, a major update to our flagship product. The new version includes new features to… Read full story NtechLab and Bangladeshi Ribat Metatech announce partnership on facial detection software NtechLab announced a partnership with Bangladeshi software company Ribat Metatech on Thursday to market facial detection and surveillance software in Bangladesh. Read full story NIST Confirms: NtechLab Has Improved Algorithm Accuracy We have great news: the NtechLab algorithm has risen in the FRVT 1:1 Verification benchmark of the US National Institute of Standards (NIST). Read full story NtechLab announces pay-by-face infrastructure NtechLab is completing development and will soon introduce NtechPay, a complete 'pay-by-face' infrastructure. NtechPay is that enables clients of retailers, banks, transport companies and service… Read full story Liveness identity fraud prevention technology verified by iBeta lab Our Liveness identity fraud prevention technology has passed PAD (Presentation Attack Detection) Level 1 testing by the reputable iBeta Quality Assurance lab. Read full story New Product — Liveness SDK Liveness SDK is a kit of libraries and UI components that enable you to embed face recognition based user identification into mobile and web applications… Read full story NtechLab showcases video analytics at Intesec Dubai It was a pleasure for us to participate in Intersec Dubai event. Andemir Bizhoev, Regional Sales Director for the MEA region, presented the FindFace Multi… Read full story Andrey Telenkov recognized as one of the most inspiring business leaders in 2021 We are thrilled to announce that Andrei Telenkov, CEO of NtechLab, has been awarded a certificate of excellence by The Silicon Review as one of… Read full story NtechLab listed among the best biometric companies in Europe We are delighted to share some great news with you. NtechLab is among Europe's Top 10 Biometric Solutions providers! Read full story NtechLab organized an international video analytics conference at Expo 2020 in Dubai. We are happy to share great news with you! Our company organized an international video analytics conference at Expo 2020 in Dubai. The event was… Read full story A new version of FindFace Multi 1.1 has been released Dear colleagues, today we present FindFace Multi 1.1, the new version of our video analytics platform. Meet our flagship product update! We are constantly improving… Read full story Minister of State in the Ministry of Railways inaugurated a СCTV surveillance system with NtechLab's facial recognition algorithm on Surat Station The Minister of State in the Ministry of Railways, Smt Darshana Jardosh, inaugurated a СCTV surveillance system that uses the NtechLab facial recognition algorithm, promising… Read full story NtechLab is now officially the best artificial intelligence startup of G20 countries We have been presented with the first G20 Innovation League award at a special event hosted by the G20 Italian Presidency. Read full story NtechLab Presented Video Analytics Technology at Major UK Security Events In September NtechLab was proud to present FindFace Mutli, our Video Analytics and Biometric solution at #DSEI2021, the major international even for Defense and Security… Read full story NtechLab participated in the Police Symposium in Brazil From August 30 to September 2, in Brasilia, the 4th Security Symposium was held. It is an event for the top-level executives of various Brazilian… Read full story Smart and Safe Port in Vladivostok The deployment of NtechLab's multi-object video analytics technology in the Vladivostok Commercial Sea Port is intended to provide a unified system to monitor labor and… Read full story NtechLab face recognition system adopted by the Indian Western Railway The system, developed by NtechLab, has been installed at 30 railway stations across the western Indian states of Gujarat and Maharashtra, and including the city… Read full story NtechLab expands into GCC with its face recognition tool With the opening of an Abu Dhabi-based representative office and the introduction of its new product FindFace Multi, NtechLab has announced its expansion into the… Read full story NtechLab announces entry into India with the world's best face recognition tech NtechLab, one of the global leaders in video analytics, today announced its entry into India launching a new tool, FindFace Multi. It detects faces and… Read full story NtechLab launches FindFace Multi, a multi-object recognition platform that detects faces and bodies of people, as well as cars NtechLab has released FindFace Multi, a detection technology that uses an advanced algorithm to recognize not only faces, but also bodies of people and cars… Read full story NtechLab scores highest biometric matching accuracy rates in three NIST test categories NtechLab is trumpeting its success in the recent Face Recognition Vendor Test (FRVT) from the U.S. National Institute of Standards and Technology (NIST), in which… Read full story Who owns your face? NtechLab co-founder Artyom Kukharenko joines Jennifer Strong to talk about facial recognition in smart cities in a MIT Technology Review podcast \"In Machines We Trust\". Read full story Focus face biometrics work on solving real-world problems, NtechLab Co-founder urges The biometric facial recognition and video analytics system developed by NtechLab gives Moscow's vast network of public cameras impressive capabilities such as high accuracy for… Read full story Facebook contest shows just how hard it is to detect deepfakes Facebook has revealed the winners of a competition for software that can detect deepfakes, doctored videos created using artificial intelligence. Third place went to Azat… Read full story How Well Can Algorithms Recognize Your Masked Face? Some vendors and users of facial recognition say the technology works well enough on masked faces. «We can identify a person wearing a balaclava, or… Read full story FindFace Facial Recognition Software Can Help Dating Sites and Apps Verify Members and Allow Users to Feel Safe Many dating site and app operators want to ensure the authenticity of the people signing up for their services because, unfortunately, a significant number of… Read full story Press Center FACE, BODY, VEHICLE, AND LICENSE PLATE NUMBER RECOGNITION Multi-object video analytics platform REQUEST A DEMO <1 second to query that database 99 % accurate >1.5 billion faces in a database FACE, BODY, VEHICLE, AND LICENSE PLATE NUMBER RECOGNITION WHAT WE DO We create solutions that help to see the complete picture of the events real-time and in retrospective. In a split second, they can recognize a person's face in a crowd of thousands, track his or her location by the body features, or find all the frames containing the car of interest from all cameras within the network. Our technology helps create a safe and comfortable urban environment and improve enterprises' security and competitiveness across various industries. We create solutions that help to see the complete picture of the events real-time and in retrospective. In a split second, they can recognize a person's face in a crowd of thousands, track his or her location by the body features, or find all the frames containing the car of interest from all cameras within the network. Our technology helps create a safe and comfortable urban environment and improve enterprises' security and competitiveness across various industries. CHOOSE YOUR SOLUTION FOR BUSINESS Harness FindFace capabilities in your industry RETAIL | FINANCE | CORPORATE SAFETY | GAMBLING INDUSTRY | DATING SERVICES | MASS EVENTS AND STADIUMS FOR GOVERNMENT #1 in Biometric Public Safety Solutions PUBLIC SAFETY | TRANSPORT SECURITY | BIOMETRIC COMPLEX | EDUCATIONAL INSTITUTIONS | ANTI-COVID-19 CHOOSE YOUR USE CASE SECURITY Identify violators and respond before offenses are committed. CLIENT IDENTIFICATION Recognize your customers before they even enter. Improve the quality of service and increase sales. BIOMETRIC ACCESS CONTROL Provide quick access through the speed gate, complete visitor control, and time tracking. FRAUD PREVENTION The system will notify the security about the appearance of any «person of interest» and protect the business from financial losses. KNOW YOUR CUSTOMER Collect statistics on gender, age, emotions, and other data about your customers using the facial recognition system. Reach out to them on a personal level! DIDN'T FIND YOUR CASE? Leave a request, and our video analytics expert will contact you. CHOOSE YOUR USE CASE THE HEART OF FINDFACE — THE WORLD BEST ALGORITHM NtechLab technology is recognized as the most accurate face recognition neural network in the world, according to NIST testing in May 2021 (National Institute of Standards and Technology). Our algorithms have repeatedly proven their superiority in many other independent competitions and tests. THE HEART OF FINDFACE — THE WORLD BEST ALGORITHM NtechLab technology is recognized as the most accurate face recognition neural network in the world, according to NIST testing in May 2021 (National Institute of Standards and Technology). Our algorithms have repeatedly proven their superiority in many other independent competitions and tests. TECHNICAL CAPABILITIES FACIAL RECOGNITION Face detection even in low-quality video or in challenging conditions (poor lighting, a long distance from a camera, etc.) Instantly find the right person among multiple images or check that two photos are of the same person. Gender, age, emotions, glasses, beard, face mask BODY RECOGNITION Counting people, tracking movement between cameras, and search by body sample or body features Biometric control of employee access to secured areas, and monitoring of trespassing in restricted zones Body tracking between cameras for an accurate people count in spaces of large area or complex configuration, eliminating the repeat count between different cameras VEHICLE AND LICENSE PLATE NUMBER RECOGNITION Smart car checkpoints, tracking cars within the city or the facility territory Vehicle brand, model, color, and body type recognition Revealing and analyzing the connection between the human and the vehicle identification HOW OUR CUSTOMERS USE FINDFACE [Case Study] Video Analytics at FIFA 2018 FindFace Multi made it possible to promptly recognize and detain nearly 100 individuals listed in databases containing some 50,000 offender photographs. Read full story [Case Study] Metropolitan-scale safe city system in Eastern Europe A one-of-a-kind video analytics solution was built in collaboration with local authorities in one of the largest cities of the Eastern Europe. Read full story [Case Study] Prevent Fraud with FindFace The Stop Shoplifter solution helps large retail chains cut losses to their annual gross revenue by 2−3%. Customers achieve a return on their investment in about… Read full story More stories HOW OUR CUSTOMERS USE FINDFACE Request Trial Version Fill out the form and we'll grant you trial access to FindFace Request trial WHAT THE WORLD'S MEDIA SAYS ABOUT US FindFace is a highly accurate facial recognition engine, the standout in a country known for its prowess in the space. It isn't the only firm working on such technology, but it's one of the most advanced. The US Government's National Institute of Standards and Technology recently identified NtechLab as having one of the most accurate facial recognition systems in the world. In 2018, the National Institute of Technology (NIST) noted the technological superiority of NtechLab in of software reliability and capacity. FindFace is a highly accurate facial recognition engine, the standout in a country known for its prowess in the space. It isn't the only firm working on such technology, but it's one of the most advanced. The US Government's National Institute of Standards and Technology recently identified NtechLab as having one of the most accurate facial recognition systems in the world. In 2018, the National Institute of Technology (NIST) noted the technological superiority of NtechLab in of software reliability and capacity. WHAT THE WORLD'S MEDIA SAYS ABOUT US News and Media NtechLab has delivered a face recognition system to 220 cities in India These systems will be used to conduct exams in schools, particularly to check attendance and to exclude cases of passing tests by another person or… Read full story Man Takes Loans Using Other People's Pictures, Cheating Facial Recognition Technology A man was arrested in Brazil for using customers' photos to bypass the facial recognition login in a mobile banking app. He allegedly used the… Read full story NtechLab Conquers Southeast Asia In April, Nikolai Shiryaev, NtechLab business development manager, presented at an IT business event in Bangkok and impressed the audience with our video analytics solutions… Read full story NtechLab at the C5 Edomex participated at the third Congress of the technologies used for the security Last week, NtechLab had the honor to present at the third Edo Mex C5 Congress, organized by the State of Mexico and the C5 emergency… Read full story Compliance win announced by NtechLab after iBeta presentation attack test We are proud to share some great news with you. NtechLab's Liveness identity fraud prevention technology has once again proved its high security and passed… Read full story Designers take on facial recognition with adversarial fashion NtechLab says its tech works anyway Read full story NtechLab at Cairo ICT The bustling Cairo ICT event took place in Egypt's capital city between November 27 and 30, and NtechLab presence there was highly remarkable. Many visitors… Read full story NtechLab at GITEX GLOBAL 2022 This year, on 10−14 October, NtechLab, once again, took part in GITEX GLOBAL 2022 event, the Middle East's leading consumer computing and electronics trade show… Read full story NtechLab at Global AI Summit 2022 In 2022, NtechLab was honored to be a tech partner at the Global AI Summit held from 13 to 15 September 2022 in Riyadh, Saudi… Read full story NtechLab at Techsauce Global Summit 2022 Our company takes part in many important global IT events, and certainly we participated in the Techsauce Global Summit 2022 held in Bangkok on August… Read full story Opportunities and questions around facial recognition technology Facial recognition is an AI-powered tech advancement that provokes a range of opinions. This artificial-intelligence-enabled technology has significantly changed the game for security and surveillance;… Read full story NtechLab expands AI-based solutions in Thai urban society The advantages of security and safety have prompted many government agencies and industries to implement facial recognition technology into their daily operations, typically associated with… Read full story Award-winning facial recognition company NtechLab enters Thailand market NtechLab is a world-renowned expert in video analytics solutions powered by artificial intelligence. Read full story NtechLab announces major expansion into Mexico Company also unveils the concept of real-time facial recognition for smart cities at Expo Seguridad Read full story NIBM installs NtechLab-developed facial recognition system NIBM is the first educational institution in Sri Lanka to deploy facial recognition technology. The system is used for access control and attendance management. Facial… Read full story Sri Lanka's National Institute of Business Management Installs Facial Recognition System The facial recognition software is developed by NtechLab, artificial intelligence-based video analytics company Read full story FindFace Multi 1.2, the new version of NtechLab's video analytics platform We are pleased to announce the release of FindFace Multi 1.2, a major update to our flagship product. The new version includes new features to… Read full story NtechLab and Bangladeshi Ribat Metatech announce partnership on facial detection software NtechLab announced a partnership with Bangladeshi software company Ribat Metatech on Thursday to market facial detection and surveillance software in Bangladesh. Read full story NIST Confirms: NtechLab Has Improved Algorithm Accuracy We have great news: the NtechLab algorithm has risen in the FRVT 1:1 Verification benchmark of the US National Institute of Standards (NIST). Read full story NtechLab announces pay-by-face infrastructure NtechLab is completing development and will soon introduce NtechPay, a complete 'pay-by-face' infrastructure. NtechPay is that enables clients of retailers, banks, transport companies and service… Read full story Liveness identity fraud prevention technology verified by iBeta lab Our Liveness identity fraud prevention technology has passed PAD (Presentation Attack Detection) Level 1 testing by the reputable iBeta Quality Assurance lab. Read full story New Product — Liveness SDK Liveness SDK is a kit of libraries and UI components that enable you to embed face recognition based user identification into mobile and web applications… Read full story NtechLab showcases video analytics at Intesec Dubai It was a pleasure for us to participate in Intersec Dubai event. Andemir Bizhoev, Regional Sales Director for the MEA region, presented the FindFace Multi… Read full story Andrey Telenkov recognized as one of the most inspiring business leaders in 2021 We are thrilled to announce that Andrei Telenkov, CEO of NtechLab, has been awarded a certificate of excellence by The Silicon Review as one of… Read full story NtechLab listed among the best biometric companies in Europe We are delighted to share some great news with you. NtechLab is among Europe's Top 10 Biometric Solutions providers! Read full story NtechLab organized an international video analytics conference at Expo 2020 in Dubai. We are happy to share great news with you! Our company organized an international video analytics conference at Expo 2020 in Dubai. The event was… Read full story A new version of FindFace Multi 1.1 has been released Dear colleagues, today we present FindFace Multi 1.1, the new version of our video analytics platform. Meet our flagship product update! We are constantly improving… Read full story Minister of State in the Ministry of Railways inaugurated a СCTV surveillance system with NtechLab's facial recognition algorithm on Surat Station The Minister of State in the Ministry of Railways, Smt Darshana Jardosh, inaugurated a СCTV surveillance system that uses the NtechLab facial recognition algorithm, promising… Read full story NtechLab is now officially the best artificial intelligence startup of G20 countries We have been presented with the first G20 Innovation League award at a special event hosted by the G20 Italian Presidency. Read full story NtechLab Presented Video Analytics Technology at Major UK Security Events In September NtechLab was proud to present FindFace Mutli, our Video Analytics and Biometric solution at #DSEI2021, the major international even for Defense and Security… Read full story NtechLab participated in the Police Symposium in Brazil From August 30 to September 2, in Brasilia, the 4th Security Symposium was held. It is an event for the top-level executives of various Brazilian… Read full story Smart and Safe Port in Vladivostok The deployment of NtechLab's multi-object video analytics technology in the Vladivostok Commercial Sea Port is intended to provide a unified system to monitor labor and… Read full story NtechLab face recognition system adopted by the Indian Western Railway The system, developed by NtechLab, has been installed at 30 railway stations across the western Indian states of Gujarat and Maharashtra, and including the city… Read full story NtechLab expands into GCC with its face recognition tool With the opening of an Abu Dhabi-based representative office and the introduction of its new product FindFace Multi, NtechLab has announced its expansion into the… Read full story NtechLab announces entry into India with the world's best face recognition tech NtechLab, one of the global leaders in video analytics, today announced its entry into India launching a new tool, FindFace Multi. It detects faces and… Read full story NtechLab launches FindFace Multi, a multi-object recognition platform that detects faces and bodies of people, as well as cars NtechLab has released FindFace Multi, a detection technology that uses an advanced algorithm to recognize not only faces, but also bodies of people and cars… Read full story NtechLab scores highest biometric matching accuracy rates in three NIST test categories NtechLab is trumpeting its success in the recent Face Recognition Vendor Test (FRVT) from the U.S. National Institute of Standards and Technology (NIST), in which… Read full story Who owns your face? NtechLab co-founder Artyom Kukharenko joines Jennifer Strong to talk about facial recognition in smart cities in a MIT Technology Review podcast \"In Machines We Trust\". Read full story Focus face biometrics work on solving real-world problems, NtechLab Co-founder urges The biometric facial recognition and video analytics system developed by NtechLab gives Moscow's vast network of public cameras impressive capabilities such as high accuracy for… Read full story Facebook contest shows just how hard it is to detect deepfakes Facebook has revealed the winners of a competition for software that can detect deepfakes, doctored videos created using artificial intelligence. Third place went to Azat… Read full story How Well Can Algorithms Recognize Your Masked Face? Some vendors and users of facial recognition say the technology works well enough on masked faces. «We can identify a person wearing a balaclava, or… Read full story FindFace Facial Recognition Software Can Help Dating Sites and Apps Verify Members and Allow Users to Feel Safe Many dating site and app operators want to ensure the authenticity of the people signing up for their services because, unfortunately, a significant number of… Read full story Press Center"
  ]
}