{
  "company": "omnigarde.com",
  "dominant_topics": [
    1,
    -1
  ],
  "topic_counts": {
    "1": 9,
    "-1": 2
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.6956521739130435,
    "framing_surveillance": 0.3043478260869565,
    "framing_market": 0.0,
    "num_docs": 11
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "1": 9
    }
  },
  "sample_docs": [
    "Home Our Products FAQ Reviews Contact Us Frequently Asked Questions Why AI? Many great successes in AI research and development have been reported in recent years. \"DeepMind's program: AlphaGo with deep learning beat the world Go champion in the tournaments. Large accuracy advancement has been seen in visual and speech recognition using AI/deep learning. All benchmark competitions in these areas have been won using AI/deep learning approaches. New products developed using deep learning show much better performance than traditional expert-crafted methods. AI is a proven technology that can be utilized in many different fields like, but not limited to: Visual and speech recognition Automated financial investing Manufacturing robots Smart assistants Proactive healthcare management Virtual travel booking agent Social media monitoring Natural Language Processing (NLP) tools What is NIST FRVT? The National Institute of Standards and Technology (NIST) Face Recognition Vendor Test (FRVT) Ongoing is aimed at measuring the performance of automated face recognition technologies applied to a wide range of civil, law enforcement and homeland security applications including verification of visa images, de-duplication of passports, recognition across photojournalism images, and identification of child exploitation victims. The performance measures the accuracy, speed, storage and memory consumption, and resilience of the tested SDK. NIST FRVT test is considered as the most independent and trust-able benchmark in face recognition. There are more than 200 companies that have submitted a total of more than 400 SDKs for the evaluation . Performance results are posted on the NIST website Why OmniGarde? We are innovators. Our technologies are cutting edge. Our products are top-tier ranked by NIST. We treat our customers with dignity and priority. We are a US based company with global vision. Our vision is to enhance people's quality of life, to be easier and more secure. Many great successes in AI research and development have been reported in recent years. \"DeepMind's program: AlphaGo with deep learning beat the world Go champion in the tournaments. Large accuracy advancement has been seen in visual and speech recognition using AI/deep learning. All benchmark competitions in these areas have been won using AI/deep learning approaches. New products developed using deep learning show much better performance than traditional expert-crafted methods. \"DeepMind's program: AlphaGo with deep learning beat the world Go champion in the tournaments. Large accuracy advancement has been seen in visual and speech recognition using AI/deep learning. All benchmark competitions in these areas have been won using AI/deep learning approaches. New products developed using deep learning show much better performance than traditional expert-crafted methods. AI is a proven technology that can be utilized in many different fields like, but not limited to: Visual and speech recognition Automated financial investing Manufacturing robots Smart assistants Proactive healthcare management Virtual travel booking agent Social media monitoring Natural Language Processing (NLP) tools Visual and speech recognition Virtual travel booking agent Natural Language Processing (NLP) tools What is NIST FRVT? The National Institute of Standards and Technology (NIST) Face Recognition Vendor Test (FRVT) Ongoing is aimed at measuring the performance of automated face recognition technologies applied to a wide range of civil, law enforcement and homeland security applications including verification of visa images, de-duplication of passports, recognition across photojournalism images, and identification of child exploitation victims. The performance measures the accuracy, speed, storage and memory consumption, and resilience of the tested SDK. NIST FRVT test is considered as the most independent and trust-able benchmark in face recognition. There are more than 200 companies that have submitted a total of more than 400 SDKs for the evaluation . Performance results are posted on the NIST website We are innovators. Our technologies are cutting edge. Our products are top-tier ranked by NIST. We treat our customers with dignity and priority. We are a US based company with global vision. Our vision is to enhance people's quality of life, to be easier and more secure. Copyright . Powered by GoDaddy Copyright .",
    "Biometric access control devices Linux System Dual cameras Fingerprint scanner 4.3 inch touch screen Communication with TCP/IP, WIFI and USB Face/Finger/Card/Pin: 3000 Android System Dual cameras Fingerprint scanner 10 inch touch screen Communication with TCP/IP, WIFI and USB Face/Finger/Card/Pin: 20000 IP65-rated waterproof Linux System Dual cameras Fingerprint scanner 5 inch touch screen Communication with TCP/IP, WIFI and USB Face/Finger/Card/Pin: 5000 IP65-rated waterproof Android System Dual cameras Fingerprint scanner Barcode scanner 8 inch touch screen Communication with TCP/IP, WIFI and USB Face/Finger/Card/Pin: 20000 IP65-rated waterproof",
    "The National Institute of Standards and Technology (NIST) Face Recognition Vendor Test (FRVT) Ongoing is aimed at measuring the performance of automated face recognition technologies applied to a wide range of civil, law enforcement, and homeland security applications, including verification of visa images, de-duplication of passports, recognition across photojournalism images, and identification of child exploitation victims. The performance measures the accuracy, speed, storage and memory consumption, and resilience of the tested SDK. The NIST FRVT test is considered the most independent and trustworthy benchmark in face recognition. Since 8/18/2023, the FRVT has been split into the FRTE (Face Recognition Technology Evaluation) and FATE (Face Analysis Technology Evaluation). FRTE deals with identity, i.e., who is in an image, whereas FATE deals with processing to determine what is in an image. The FRTE is further divided into the 1:1 and 1:N tests. The 1:1 test compares a probe face image with a pre-enrolled target face image to determine if they belong to the same subject. This test focuses on verifying the identity of a specific individual. The 1:N test compares a query face image with pre-enrolled face images to calculate similarity scores. The purpose of this test is to determine whether the query face matches any of the pre-enrolled face images or not. Both benchmarks are ongoing tests, allowing companies to submit improved software versions every four months. This allows companies to continuously enhance their algorithms and improve their performance. There are more than 200 companies that have submitted a total of more than 500 SDKs for the FRVT/FRTE evaluation. For more information about the test, it can be found on the NIST FRVT website: https://pages.nist.gov/frvt/html/frvt11.html The NIST MINEX III is an interoperability standard test to evaluate fingerprint recognition software from worldwide fingerprint developers. It is run by NIST and evaluates the compliance of template generators and template matchers across different vendors. The test establishes the compliance of template generators and template matchers with the U.S. government's Personal Identity Verification (PIV) program. NIST's MINEX III test is the most stringent benchmark to evaluate fingerprint template generation and matching. The NIST PIV program defines two levels of accuracy specifications. Vendors only achieve full compliance if they satisfy all the requirements for both Level 1 and Level 2 PIV compliance. Compliance with the PIV program is often mandatory for worldwide public and private tenders that require fingerprint technology. The US government mandates the use of only PIV-programmed fingerprint template generators and matchers as it guarantees security and interoperability. This benchmark is an ongoing test, allowing companies to submit improved software versions every three months. So far, more than 130 SDKS have been submitted to the tests. The results can be found on the NIST MINEX III website: https://www.nist.gov/itl/iad/image-group/minutiae-interoperability-exchange-minex-iii The NIST Proprietary Fingerprint Template (PFT) III is a fingerprint technology test conducted by the National Institute of Standards and Technology (NIST) to evaluate the performance and accuracy of proprietary fingerprint templates in one-to-one matching. Proprietary templates are a type of file that stores the features of a fingerprint in a way that can only be understood by the file's creator. This is in contrast to standardized fingerprint templates, which can be understood by any standards-compliant technology, as evaluated by NIST's MINEX III. PFT III is an ongoing technology evaluation from NIST in support of one-to-one proprietary template matching that allows companies to submit improved software versions every three months. Previously, NIST conducted two other one-to-one proprietary fingerprint template evaluations: the PFT II Evaluation (2010–2019) and the Original PFT Evaluation (2003–2010). For more information about the test, it can be found on the NIST PFT III website: https://www.nist.gov/itl/iad/image-group/evaluation-latent-friction-ridge-technology. The NIST Evaluation of Latent Friction Ridge Technology (ELFT) is a one-to-many biometric identification technology evaluation that uses digitized latent friction ridge images and/or feature sets as probes and all types of friction ridge images as references. ELFT exercises the template creation and template searching algorithms at the core of Automated Fingerprint Identification Systems (AFIS), not the system itself. Previously, NIST conducted two other one-to-many ELFT tests: ELFT-EFS Evaluation #2 (2010–2012) and ELFT-EFS Evaluation #21 (2008–2011). For more information about the test, it can be found on the NIST ELFT website: https://www.nist.gov/itl/iad/image-group/evaluation-latent-friction-ridge-technology. Many great successes in AI research and development have been reported in recent years. \"DeepMind's program: AlphaGo with deep learning, beat the world Go champion in the tournaments. Chat GPT was released by OpenAI. A large accuracy advancement has been seen in visual and speech recognition using AI/deep learning. All benchmark competitions in these areas have been won using AI/deep learning approaches. New products developed using deep learning show much better performance than traditional expert-crafted methods. AI is a proven technology that can be utilized in many different fields, including, but not limited to: ·Automated financial investing ·Manufacturing robots ·Smart assistants ·Proactive healthcare management ·Virtual travel booking agent ·Social media monitoring ·Natural Language Processing (NLP) tools Enhanced security: Biometric access control systems use unique biological data to authenticate and authorize people to enter a specific location or data. Biometric data cannot be shared or copied, so your facility benefits from heightened security Convenience: Users don't need to remember the passkey or carry the physical fob keys. Biometric access control combines security and convenience in a way that no other access control system can . Hygiene: Not having to physically touch a device is more hygienic as there is a reduced risk of people spreading dangerous pathogens . Efficiency: Access can be granted and annulled through the cloud, making it more efficient . Less vulnerable: Biometrics are less vulnerable to being stolen than traditional physical access tokens . The system is able to perform automatic subject recognition based on their physiological and/or behavioral characteristics: such as the face, voice, iris, fingerprint, and palmprint,… It has two applications: one is verification and the other is identification. The verification is to take an unknown biometric and compare it with a pre-enrolled known biometric subject to determine whether they belong to the same subject. The identification is to take an unknown biometric and compare it with N pre-enrolled known biometric subjects to determine whether it belongs to one of them or not. Examples: AFIS(automatic fingerprint identification system), ABIS(automatic biometric identification system). AI is a set of technologies that enable computers to perform a variety of advanced functions, including the ability to see, understand and translate spoken and written language, analyze data, make recommendations, and more. Deep learning uses artificial neural networks to mimic the learning process of the human brain. CNN(convolutional neural network) is one type of neural networks. An AI model: is a neural network after deep learning using a large set of data, which can be used to perform a desired function; TAR and FA/MR are the two most important parameters to measure the accuracy of a biometric recognition system. FRR(false reject rate)=1-TAR, SDK contains a set of APIs(Application Programming Interfaces) that allow third-party developers to use them to develop their applications. For example, Fingerprint SDK, contains feature extraction, matching, and other functional APIs which allow third-party developers to use them to develop a product such as a time attendant system.",
    "Omnigarde Celebrates Breakthrough Performance in NIST Face Recognition ... Omnigarde new AI Software achieved top-1 and 2 positions among US-based companies and top-8 and 11 positions ... Omnigarde Excels in NIST Face Recognition Vendor 1:1 Verification Test with New AI.. Omnigarde's new AI software has achieved a top-3 ranking among US-based companies and a top-15 ranking globally in the NIST FRVT 1:1 benchmark. Omnigarde's new Fingerprint Software achieved top-1 rank in template generators... Omnigarde's newly submitted Software made a great improvement on its template generator and native matching over its previously submitted version",
    "OmniBACS is a biometric access control system built based on our cutting-edge biometric technologies. Our biometric access control system offers several advantages over traditional access control systems. Our system can be configured to use face, fingerprint, card, pin or combination of them to enhance security and provide ease of use. It can be tailored for different access control applications"
  ]
}