{
  "company": "otilumionics.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 6
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 6
    }
  },
  "sample_docs": [
    "© OTI Lumionics Inc. 2013 We are a privately held company working to unlock the full potential of OLED technology for display and lighting applications. OTI Lumionics Inc. was founded by an award winning team of researchers, engineers and creative minds with over 25 years experience in the optoelectronics and vacuum technology sectors. The company owns the full rights to its patented core technology and is working to implement HaloTorrâ\"¢ and ElektroTorrâ\"¢ for mass production of OLEDs and other organic optoelectronic devices. Using these technologies OTI Lumionics has developed direct drop-in replacements for the de facto standard electrodes used in OLEDs, which when used in mass production overcome the bottleneck in traditional manufacturing. These disruptive solutions greatly reduce manufacturing costs and are helping to accelerate penetration of OLEDs into the greater than $140B flat-panel display and $100B general lighting markets. OTI Lumionics' proprietary technology can be seamlessly retrofit into existing production lines, and is being integrated into next generation high-volume and low-cost production tools. © OTI Lumionics Inc. 2013",
    "© OTI Lumionics Inc. 2013 Our technologies have been developed into direct drop-in replacements for the de facto standard electrodes used in OLEDs and other organic electronics, which when used in mass production overcome the bottleneck in traditional manufacturing. OTI Lumionics' solutions can be seamlessly retrofit into exist production lines, and is being integrated into next generation high-volume and low-cost production tools. We provide complete HaloTorr™ system packages, including vacuum pumping, plasma module and precursor sources for various size substrates from small lab scale samples up to full size Gen 2 (370 × 470 mm 2 ) mass production and beyond. Read More >> ElektroTorr™ sources are available in various sizes that are compatible with standard vacuum deposition equipment, or as complete deposition modules. Custom configurations and mass production solutions are available upon request. Read More >> We provide prototyping services for evaluating new OLED materials, processes and equipment. Prototype panels built to your specification are currently available in 50 mm and 100 mm sizes. Custom sizes and specialty substrates are available upon request. Read More >> © OTI Lumionics Inc. 2013",
    "Solutions Under Display NIR Sensors 3D Facial Recognition Under Display Cameras Transparent Displays (AR) Under Display NIR Sensors Technology CPM™ Patterning Materials Discovery Quantum Computing We Develop Production-Ready Advanced Materials for Electronics Electronics are Enabled by Advanced Materials Advanced materials form the foundation of all modern technology. Many of the software and services we use everyday depend on ever more powerful hardware to run. Advancements in computing power, data storage, energy efficiency, and batteries are all enabled by innovations in advanced materials and fine chemicals. Enabling New Areas for Innovation We are developing solutions to enhance transparency, reduce power consumption, and improve image quality of transparent displays. Our advanced materials are enabling the future of display technology allowing complex sensors to be directly integrated under the display panel. Our advanced materials are enabling the future of transparent displays allowing under display cameras that will eliminate display notches. Advanced Materials by Design At OTI Lumionics we are developing advanced materials—by design—using quantum simulations , machine learning and real-world testing in pilot production. We are currently focused on key enabling materials for OLED displays that will be used in next-generation consumer electronics and automotive. Our advanced electrode materials, and associated manufacturing technology, are being used to build transparent displays and lighting. We work closely with our partners and customers to design new materials that are mass-production ready. Using our computational Materials Discovery Platform, we are able to rapidly iterate new materials, allowing fast turn around time to meet our customers' needs. Our materials are vigorously tested to our customers' exacting specifications, using our in-house pilot production facility for thin-film electronics. Scale-up and mass production supply of our materials is provided by our network of Tier 1 chemical and materials partners. Between our in-house facilities, and industrial and academic partners, we offer the following capabilities: Materials synthesis + scale-up Testing in pilot production testing Application engineering + prototyping High Performance Computing (HPC) and Machine Learning (AI) remove the guesswork. Screen 1,000x more candidates Partnering with established chemical suppliers for rapid synthetic scale-up from gram to ton. Faster time to market In-house pilot production testing de-risks material performance in mass production. Seamless transfer to production Quantum Computing for Computational Chemistry Advanced Materials for OLED Displays CPM™ Patterning – New Patterning Process Based on Self-Assembly Our advanced materials for self-assembly patterning enable a new area for innovation in OLED display Reduce display power consumption Increase display transparency (AR) Integrate sensors into the display Increase display resolution Reduce display power consumption Increase display transparency (AR) Integrate sensors into the display Our team includes technical and product experts from the OLED materials, specialty chemical, and pharmaceutical industries. Our team includes veterans from the display manufacturing and consumer electronic industries specializing in OLED applications. Our team includes seasoned front-line process engineers from the display and semiconductor industries specializing in yield tune-up.",
    "Solutions Under Display NIR Sensors 3D Facial Recognition Under Display Cameras Transparent Displays (AR) Under Display NIR Sensors Technology CPMâ\"¢ Patterning Materials Discovery Quantum Computing Enabling bigger and better transparent displays. Advanced Materials for Transparent Displays Our ConducTorr™ Electrode , developed using our proprietary Materials Discovery Platform . is enabling bigger and better transparent displays for use in new product applications. Our patternable electrode materials have an ultra-low sheet resistance of < 1 Ω/â˜, enabling larger and brighter displays without IR losses. Our materials enable high performance transparent displays which facilitate new applications for augmented reality. Our materials enable the high resolution of mobile displays in larger size formats for tablet, monitor and TV sized displays. >65% Transparent OLED Display CPMâ\"¢ Patterning – Advanced Materials for Transparent Displays Cathode Patterning for Transparent Displays Applications of Transparent OLED Our advanced materials are enabling the future of display technology allowing complex sensors to be directly integrated under the display panel. Our advanced materials are enabling the future of transparent displays allowing under display cameras that will eliminate display notches.",
    "Solutions Under Display NIR Sensors 3D Facial Recognition Under Display Cameras Transparent Displays (AR) Under Display NIR Sensors Technology CPM™ Patterning Materials Discovery Quantum Computing Enabling quantum computing for materials discovery. Quantum computing for materials discovery Quantum computing has the potential to disrupt nearly every industry with exponential performance gains over classical computing. Our team is applying quantum methods to improve our Materials Discovery Platform . More accurate property predictions Our team of theoreticians and quantum chemists are developing key foundational theory to enable quantum computers to solve the most difficult and high value problems in materials science and chemistry. Our team of quantum chemists and computer scientists builds on top of the foundational work of our quantum theory team to develop state-of the art quantum and quantum-inspired algorithms for computational chemistry. Our team of quantum software engineers translate the powerful quantum and quantum-inspired algorithms developed by our algorithm team into optimized code that can be run on any quantum computing hardware. Read some of our latest research in quantum computing. Read More arxiv.org Read More arxiv.org Read More arxiv.org Read More arxiv.org Read More arxiv.org Read More arxiv.org Read More arxiv.org Read More arxiv.org"
  ]
}