{
  "company": "papilon.com.tr",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 1,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.125,
    "framing_surveillance": 0.875,
    "framing_market": 0.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1
    }
  },
  "sample_docs": [
    "Join Us at ICPA 2025 Showcasing innovative prison and security solutions. Committed to safer societies with holistic biometric intelligence since 2012. Beyond Biometrics, Holistic Intelligence Backed by innovation and advanced expertise, our solutions empower safer societies and smarter systems — today and tomorrow. Beyond Biometrics, Holistic Intelligence From AI-powered analytics to mobile field solutions, Papilon bridges forward-thinking technologies with the evolving demands of today's world. Beyond Biometrics, Holistic Intelligence Papilon delivers forensic and civil technologies designed to meet the fast-changing needs of both public institutions and private organizations. Join Us at ICPA 2025 Showcasing innovative prison and security solutions. Committed to safer societies with holistic biometric intelligence since 2012. Beyond Biometrics, Holistic Intelligence Backed by innovation and advanced expertise, our solutions empower safer societies and smarter systems — today and tomorrow. Beyond Biometrics, Holistic Intelligence From AI-powered analytics to mobile field solutions, Papilon bridges forward-thinking technologies with the evolving demands of today's world. Beyond Biometrics, Holistic Intelligence Papilon delivers forensic and civil technologies designed to meet the fast-changing needs of both public institutions and private organizations. Join Us at ICPA 2025 Showcasing innovative prison and security solutions. Committed to safer societies with holistic biometric intelligence since 2012. Beyond Biometrics, Holistic Intelligence Backed by innovation and advanced expertise, our solutions empower safer societies and smarter systems — today and tomorrow. Beyond Biometrics, Holistic Intelligence From AI-powered analytics to mobile field solutions, Papilon bridges forward-thinking technologies with the evolving demands of today's world. Beyond Biometrics, Holistic Intelligence Papilon delivers forensic and civil technologies designed to meet the fast-changing needs of both public institutions and private organizations. Join Us at ICPA 2025 Showcasing innovative prison and security solutions. Committed to safer societies with holistic biometric intelligence since 2012. Beyond Biometrics, Holistic Intelligence Backed by innovation and advanced expertise, our solutions empower safer societies and smarter systems — today and tomorrow. Beyond Biometrics, Holistic Intelligence From AI-powered analytics to mobile field solutions, Papilon bridges forward-thinking technologies with the evolving demands of today's world. Beyond Biometrics, Holistic Intelligence Papilon delivers forensic and civil technologies designed to meet the fast-changing needs of both public institutions and private organizations. Products See All See All Blogs More What is Vehicle Recognition System? The increasing demand for fuel purchases results in the search for more effective ways in fuel purchasing operations. Access Control Systems Access control systems are the most important factor enabling authorized persons to pass through doors and turnstiles in laboratories, nuclear facilities, military facilities, and companies. Let's take a closer look at this structure. Biometrics 101 Most of the time we can't even recognize it, but still, it happens. Even when we see each others' faces, biometrics comes into play. What is Biometrics? It has happened to almost all of us; biometric photographs are requested for driver's licenses, ID cards, and passports. So what is biometrics? What is Artificial Intelligence? Robots that behave like humans, computers that defeat world champions in chess, driverless vehicles, chatbots.. Fingerprint Scanner What is a fingerprint? Patterns also called \"papilla\", form shapes called fingerprints. What is Digital Onboarding? Online accounts created in a short period through biometric authentication are protected by several standards. What is a Face Recognition System? Today, facial recognition systems used in numerous areas mainly serve to identify and verify people through facial information. What is Iris Recognition System? Iris recognition systems use the iris layer in our eyes. The colored muscle layer around the pupil is called the iris. What is ABIS? ABIS is the abbreviation of Automated Biometric Identification System. ABIS is a software that stores and identifies large-scale biometric data. Media Agencies In today's rapidly changing world, media agencies have to scan millions of data. In this repository of videos and visuals, celebrities, people and objects should be labeled Why Do People Migrate? Papilon immigration solutions use biometrics and AI to solve problems created by immigration. What is Vehicle Recognition System? The increasing demand for fuel purchases results in the search for more effective ways in fuel purchasing operations. Access control systems are the most important factor enabling authorized persons to pass through doors and turnstiles in laboratories, nuclear facilities, military facilities, and companies. Let's take a closer look at this structure. Most of the time we can't even recognize it, but still, it happens. Even when we see each others' faces, biometrics comes into play. It has happened to almost all of us; biometric photographs are requested for driver's licenses, ID cards, and passports. So what is biometrics? What is Artificial Intelligence? Robots that behave like humans, computers that defeat world champions in chess, driverless vehicles, chatbots.. What is a fingerprint? Patterns also called \"papilla\", form shapes called fingerprints. What is Digital Onboarding? Online accounts created in a short period through biometric authentication are protected by several standards. What is a Face Recognition System? Today, facial recognition systems used in numerous areas mainly serve to identify and verify people through facial information. What is Iris Recognition System? Iris recognition systems use the iris layer in our eyes. The colored muscle layer around the pupil is called the iris. ABIS is the abbreviation of Automated Biometric Identification System. ABIS is a software that stores and identifies large-scale biometric data. In today's rapidly changing world, media agencies have to scan millions of data. In this repository of videos and visuals, celebrities, people and objects should be labeled Why Do People Migrate? Papilon immigration solutions use biometrics and AI to solve problems created by immigration. Subscribe to our newsletter to ! PAPİLON SAVUNMA TEKNOLOJİ VE TİCARET ANONİM ŞİRKETİ Mebusevleri, Ergin St. No:9, 06570 Çankaya/Ankara Follow Us Products HOLISTIKA Digital Identity Platform Data-Driven Insight Platform FORENSIKA Solutions Government Law Enforcement Finance & Telco Health Media & Marketing Facility & Workforce Management Travel & Transportation Agriculture Retail & E-Services FAQ Cookie Policy Ethics Policy Personal Data Protection Policy Information Note on Processing of Personal Data Information Assurance Policy Discrimination Policy Occupational Health & Safety Policy Company About us Career Become a Partner News Blogs Glossary Ongoing R&D Projects Follow Us All Rights , PAPİLON Subscribe to our newsletter to ! PAPİLON SAVUNMA TEKNOLOJİ VE TİCARET ANONİM ŞİRKETİ Mebusevleri, Ergin St. No:9, 06570 Çankaya/Ankara PAPİLON SAVUNMA TEKNOLOJİ VE TİCARET ANONİM ŞİRKETİ Mebusevleri, Ergin St. No:9, 06570 Çankaya/Ankara Facility & Workforce Management Personal Data Protection Policy Information Note on Processing of Personal Data Occupational Health & Safety Policy All Rights , PAPİLON",
    "Home Papilon Savunma 2017-05-08T10:16:03+00:00 PAPILON AFIS Databases 15 The total length of papillary lines on the fingerprint images entered into PAPILON AFIS databases is distances between the Earth and the Moon or 5,783,290,600 m NOW A MEMBER of SSI BIOMETRIC IDENTITY MANAGEMENT BORDER AND IMMIGRATION MANAGEMENT BALLISTIC IDENTIFICATION SOLUTIONS CRIMINAL EVIDENCE ANALYSING SET ‹ PRODUCTS › Papilon's unprecedented biometrics & ballistics identification products are certified by the world's most prestigious institutions such as FBI. APFIS APFIS | Automated Palm and Fingerprint Identification System Live Scanners LS-1101 | Fingerprint and Palmprint Scanner LS-1102 | Fingerprint and Palmprint Scanner LS-4421 | Fingerprint Scanner LS-4422 | Fingerprint Scanner LS-11 | One-Fingerprint Scanner LS-01 | One-Fingerprint Scanner Contactless Fingerprint Scanner Access Control BEOGS | Biometrics Integrated Automatic Gates System PAPILON GWI | Access Control and Tracking System PAPILON VIDEO SURVEILLANCE | Surveillance and Video Processing System PAPILON VSS1 | Video Camera GK-01 | Access Control System Biometric Work Stations LS Work Station | Finger and Palm Print Scanning Station APFIS Work Station | Automated Palm and Fingerprint Identification System Work Station MDS-45C Work Station | Multi Functional Work Station Mobile Devices PAPILON M | Mobile Bag for Biometric Identity Search and Verification MKDS 30 & MKDS 45 | Identity Registration and Check System Handheld Biometric Terminals DPP-6 MT-01 MT-07 PAPILON FILTER | Instant ID Check Software Mobile Ballistic Identification Set Forensic Devices EXPERTLAB | Criminal Evidence Analysing Set RASTR | Criminal Evidence Developing and Processing System FOSKO | Criminal Evidence Photographing Set TVC 9.1 USB | Short Distance Camera BLIP | Forged Money Identification System PAPILON LATOP | Crime Scene Analysing Device Face Recognition PYUZ | Face Recognition System FK-2T | Biometric Photographic System FK-3 | Portable Video and Photographing System KLIM3D | Face Composite Producing System Iris Recognition ZIRKON Series | Iris Identification System Ballistic Identification ARSENAL ABIS | Automated Ballistic Identification System BS-16 | Ballistic Scanner Physical Security Virtual Reality NuiTrack | Skeleton, Face and Motion Recognition System VicoVR | Wireless Sensor for Virtual Reality SeeMetrix | Audience Analytics System 3Divi Face SDK ‹ SOLUTIONS › Papilon's leading security solutions are leveraged by industry expertise, best of breed technology and constant system developments. By Industry Justice & Public Safety Biometric Identity Management Criminal Justice Management Border & Immigration Managament Facilities Management Sensitive Site Surveillance Management Biometric Voting Management Public Venue & Event Safety Commercial Security Community/Residential Area Solutions Banking & Financial Markets Solutions Workforce Management Gaming House Management By System APFIS | Automated Palm and Fingerprint Identification System ARSENAL ABIS | Automated Ballistic Identification System BEOGS | Biometrics Integrated Automatic Gates System ZIRKON | Iris Identification System PYUZ | Face Recognition System LIVE SCANNING By Technology Fingerprint ID Face Recognition Iris Recognition Virtual Reality Multi-Modal Biometrics FACE RECOGNITION PYUZ 2 FACE RECOGNITION PYUZ FINGERPRINT IDENTIFICATION PAPILON APFIS 2 FINGERPRINT IDENTIFICATION PAPILON APFIS IRIS RECOGNITION ZIRKON 2 IRIS RECOGNITION ZIRKON Papilon Savunma offers to law enforcements, enterprise corporations and other institutions a reliable security collaboration; by combining state-of-the-art technology, know-how and hands on experience together. BLOG Papilon Savunma 2017-03-18T12:00:17+00:00 US' Much Debated Fingerprint Expansion Policy: From Two to Ten Papilon Savunma 2017-03-18T12:00:17+00:00 June 29th, 2016 | 0 Comments Summary This information note encompasses US-VISIT's policy alteration in regards to collecting biometric data from international visitors. The biometric acquisition had been executed at ports entry [...] Papilon Savunma 2017-03-18T12:00:21+00:00 Privacy in Biometrics: Why You Should Not Worry About Papilon Savunma 2017-03-18T12:00:21+00:00 April 23rd, 2016 | 4 Comments Introduction Biometrics are one of the most commonly discussed security trend right now – due to its dramatic penetration to daily lives, in such short amount of [...] NEWS Papilon Savunma 2018-10-30T10:14:02+00:00 We are celebrating Turkish National Day of Victory Papilon Savunma 2018-10-30T10:14:02+00:00 August 30th, 2018 | 0 Comments As Papilon Savunma, we celebrate the 30th of August, Turkish National Day of Victory! [...] Papilon Savunma 2018-10-30T10:26:41+00:00 Ramadan Feast Papilon Savunma 2018-10-30T10:26:41+00:00 June 15th, 2018 | 0 Comments Mubarak eid. Papilon Savunma celebrate your Ramadan Feast, and wish you a happy and healthy feast [...] Papilon Savunma 2017-12-07T10:18:57+00:00 Indian Police are Enjoying Further Success with Papilon System and Products Papilon Savunma 2017-12-07T10:18:57+00:00 November 17th, 2017 | 0 Comments Having started to use Papilon Systems and Products this year, Papilon's Shared R&D results makes noticeable difference to the [...] Papilon Savunma 2017-11-20T10:09:28+00:00 High Level Criminal Investigation Officials from Tanzania Participated Papilon Savunma Program Papilon Savunma 2017-11-20T10:09:28+00:00 November 11th, 2017 | 0 Comments Papilon Savunma was honored with the visit of a team of high level security officials from the Criminal Investigation [...] Papilon Savunma 2017-10-04T00:18:36+00:00 Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited Papilon Savunma Papilon Savunma 2017-10-04T00:18:36+00:00 September 29th, 2017 | 0 Comments Head of International Co-operation Department of the Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited [...] Papilon Savunma 2017-11-03T11:19:29+00:00 Iraqi Criminal Investigations Staff Has Met the World's Fastest and Most Accurate Biometrical Identification Systems Papilon Savunma 2017-11-03T11:19:29+00:00 September 29th, 2017 | 0 Comments The Iraqi security committe of the Head of Criminal Department, Fingerprint Department Manager and Crime Scene Investigation Department Manager [...] EVENTS Papilon Savunma 2017-10-26T15:41:41+00:00 Papilon Savunma Accompanied the Reception of the National Day of the Republic of Zambia Papilon Savunma 2017-10-26T15:41:41+00:00 October 26th, 2017 | 0 Comments As Papilon Savunma, we accompanied the reception of the National Day of the Republic of Zambia hosted by the [...] Papilon Savunma 2017-09-11T11:22:37+00:00 Papilon Participated to 2nd R & D and Innovation Summit and Exhibition Papilon Savunma 2017-09-11T11:22:37+00:00 September 11th, 2017 | 0 Comments As Papilon Savunma, we participated the 2nd R & D and Innovation Summit and Exhibition which [...] Papilon Savunma 2017-08-30T13:09:38+00:00 Papilon Savunma Participated to \"IT Sector Gathering\" Meeting Papilon Savunma 2017-08-30T13:09:38+00:00 August 14th, 2017 | 0 Comments Papilon Savunma Participated to TOBB \"IT Sector Gathering\" Meeting. Papilon Savunma 2017-07-19T10:35:07+00:00 Muehlbauer Tecurity Center Days Papilon Savunma 2017-07-19T10:35:07+00:00 July 6th, 2017 | 0 Comments Papilon Savunma is invited to the 2nd of the Technology Days (Tecurity Center) in Roding, Germany, organized by German leading [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to European Commission's Horizon 2020 Program Papilon Savunma 2017-03-18T12:00:11+00:00 March 9th, 2017 | 0 Comments European Commission's Horizon 2020 Program Secure Societies Field 2017 Call Information Day and Project Market Event on 6-7th [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to Kick-off 2017 Event, As An Invitee of Horizon 2020 Papilon Savunma 2017-03-18T12:00:11+00:00 February 26th, 2017 | 0 Comments Papilon Savunma is invited to the kick-off meeting of 2017 which took place in 22nd of February as the [...] Home Papilon Savunma 2017-05-08T10:16:03+00:00 PAPILON AFIS Databases 15 The total length of papillary lines on the fingerprint images entered into PAPILON AFIS databases is distances between the Earth and the Moon or 5,783,290,600 m NOW A MEMBER of SSI BIOMETRIC IDENTITY MANAGEMENT BORDER AND IMMIGRATION MANAGEMENT BALLISTIC IDENTIFICATION SOLUTIONS CRIMINAL EVIDENCE ANALYSING SET ‹ PRODUCTS › Papilon's unprecedented biometrics & ballistics identification products are certified by the world's most prestigious institutions such as FBI. APFIS APFIS | Automated Palm and Fingerprint Identification System Live Scanners LS-1101 | Fingerprint and Palmprint Scanner LS-1102 | Fingerprint and Palmprint Scanner LS-4421 | Fingerprint Scanner LS-4422 | Fingerprint Scanner LS-11 | One-Fingerprint Scanner LS-01 | One-Fingerprint Scanner Contactless Fingerprint Scanner Access Control BEOGS | Biometrics Integrated Automatic Gates System PAPILON GWI | Access Control and Tracking System PAPILON VIDEO SURVEILLANCE | Surveillance and Video Processing System PAPILON VSS1 | Video Camera GK-01 | Access Control System Biometric Work Stations LS Work Station | Finger and Palm Print Scanning Station APFIS Work Station | Automated Palm and Fingerprint Identification System Work Station MDS-45C Work Station | Multi Functional Work Station Mobile Devices PAPILON M | Mobile Bag for Biometric Identity Search and Verification MKDS 30 & MKDS 45 | Identity Registration and Check System Handheld Biometric Terminals DPP-6 MT-01 MT-07 PAPILON FILTER | Instant ID Check Software Mobile Ballistic Identification Set Forensic Devices EXPERTLAB | Criminal Evidence Analysing Set RASTR | Criminal Evidence Developing and Processing System FOSKO | Criminal Evidence Photographing Set TVC 9.1 USB | Short Distance Camera BLIP | Forged Money Identification System PAPILON LATOP | Crime Scene Analysing Device Face Recognition PYUZ | Face Recognition System FK-2T | Biometric Photographic System FK-3 | Portable Video and Photographing System KLIM3D | Face Composite Producing System Iris Recognition ZIRKON Series | Iris Identification System Ballistic Identification ARSENAL ABIS | Automated Ballistic Identification System BS-16 | Ballistic Scanner Physical Security Virtual Reality NuiTrack | Skeleton, Face and Motion Recognition System VicoVR | Wireless Sensor for Virtual Reality SeeMetrix | Audience Analytics System 3Divi Face SDK ‹ SOLUTIONS › Papilon's leading security solutions are leveraged by industry expertise, best of breed technology and constant system developments. By Industry Justice & Public Safety Biometric Identity Management Criminal Justice Management Border & Immigration Managament Facilities Management Sensitive Site Surveillance Management Biometric Voting Management Public Venue & Event Safety Commercial Security Community/Residential Area Solutions Banking & Financial Markets Solutions Workforce Management Gaming House Management By System APFIS | Automated Palm and Fingerprint Identification System ARSENAL ABIS | Automated Ballistic Identification System BEOGS | Biometrics Integrated Automatic Gates System ZIRKON | Iris Identification System PYUZ | Face Recognition System LIVE SCANNING By Technology Fingerprint ID Face Recognition Iris Recognition Virtual Reality Multi-Modal Biometrics FACE RECOGNITION PYUZ 2 FACE RECOGNITION PYUZ FINGERPRINT IDENTIFICATION PAPILON APFIS 2 FINGERPRINT IDENTIFICATION PAPILON APFIS IRIS RECOGNITION ZIRKON 2 IRIS RECOGNITION ZIRKON Papilon Savunma offers to law enforcements, enterprise corporations and other institutions a reliable security collaboration; by combining state-of-the-art technology, know-how and hands on experience together. BLOG Papilon Savunma 2017-03-18T12:00:17+00:00 US' Much Debated Fingerprint Expansion Policy: From Two to Ten Papilon Savunma 2017-03-18T12:00:17+00:00 June 29th, 2016 | 0 Comments Summary This information note encompasses US-VISIT's policy alteration in regards to collecting biometric data from international visitors. The biometric acquisition had been executed at ports entry [...] Papilon Savunma 2017-03-18T12:00:21+00:00 Privacy in Biometrics: Why You Should Not Worry About Papilon Savunma 2017-03-18T12:00:21+00:00 April 23rd, 2016 | 4 Comments Introduction Biometrics are one of the most commonly discussed security trend right now – due to its dramatic penetration to daily lives, in such short amount of [...] NEWS Papilon Savunma 2018-10-30T10:14:02+00:00 We are celebrating Turkish National Day of Victory Papilon Savunma 2018-10-30T10:14:02+00:00 August 30th, 2018 | 0 Comments As Papilon Savunma, we celebrate the 30th of August, Turkish National Day of Victory! [...] Papilon Savunma 2018-10-30T10:26:41+00:00 Ramadan Feast Papilon Savunma 2018-10-30T10:26:41+00:00 June 15th, 2018 | 0 Comments Mubarak eid. Papilon Savunma celebrate your Ramadan Feast, and wish you a happy and healthy feast [...] Papilon Savunma 2017-12-07T10:18:57+00:00 Indian Police are Enjoying Further Success with Papilon System and Products Papilon Savunma 2017-12-07T10:18:57+00:00 November 17th, 2017 | 0 Comments Having started to use Papilon Systems and Products this year, Papilon's Shared R&D results makes noticeable difference to the [...] Papilon Savunma 2017-11-20T10:09:28+00:00 High Level Criminal Investigation Officials from Tanzania Participated Papilon Savunma Program Papilon Savunma 2017-11-20T10:09:28+00:00 November 11th, 2017 | 0 Comments Papilon Savunma was honored with the visit of a team of high level security officials from the Criminal Investigation [...] Papilon Savunma 2017-10-04T00:18:36+00:00 Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited Papilon Savunma Papilon Savunma 2017-10-04T00:18:36+00:00 September 29th, 2017 | 0 Comments Head of International Co-operation Department of the Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited [...] Papilon Savunma 2017-11-03T11:19:29+00:00 Iraqi Criminal Investigations Staff Has Met the World's Fastest and Most Accurate Biometrical Identification Systems Papilon Savunma 2017-11-03T11:19:29+00:00 September 29th, 2017 | 0 Comments The Iraqi security committe of the Head of Criminal Department, Fingerprint Department Manager and Crime Scene Investigation Department Manager [...] EVENTS Papilon Savunma 2017-10-26T15:41:41+00:00 Papilon Savunma Accompanied the Reception of the National Day of the Republic of Zambia Papilon Savunma 2017-10-26T15:41:41+00:00 October 26th, 2017 | 0 Comments As Papilon Savunma, we accompanied the reception of the National Day of the Republic of Zambia hosted by the [...] Papilon Savunma 2017-09-11T11:22:37+00:00 Papilon Participated to 2nd R & D and Innovation Summit and Exhibition Papilon Savunma 2017-09-11T11:22:37+00:00 September 11th, 2017 | 0 Comments As Papilon Savunma, we participated the 2nd R & D and Innovation Summit and Exhibition which [...] Papilon Savunma 2017-08-30T13:09:38+00:00 Papilon Savunma Participated to \"IT Sector Gathering\" Meeting Papilon Savunma 2017-08-30T13:09:38+00:00 August 14th, 2017 | 0 Comments Papilon Savunma Participated to TOBB \"IT Sector Gathering\" Meeting. Papilon Savunma 2017-07-19T10:35:07+00:00 Muehlbauer Tecurity Center Days Papilon Savunma 2017-07-19T10:35:07+00:00 July 6th, 2017 | 0 Comments Papilon Savunma is invited to the 2nd of the Technology Days (Tecurity Center) in Roding, Germany, organized by German leading [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to European Commission's Horizon 2020 Program Papilon Savunma 2017-03-18T12:00:11+00:00 March 9th, 2017 | 0 Comments European Commission's Horizon 2020 Program Secure Societies Field 2017 Call Information Day and Project Market Event on 6-7th [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to Kick-off 2017 Event, As An Invitee of Horizon 2020 Papilon Savunma 2017-03-18T12:00:11+00:00 February 26th, 2017 | 0 Comments Papilon Savunma is invited to the kick-off meeting of 2017 which took place in 22nd of February as the [...] A MEMBER of SSI BORDER AND IMMIGRATION MANAGEMENT CRIMINAL EVIDENCE ANALYSING SET Papilon's unprecedented biometrics & ballistics identification products are certified by the world's most prestigious institutions such as FBI. APFIS | Automated Palm and Fingerprint Identification System LS-1101 | Fingerprint and Palmprint Scanner LS-1102 | Fingerprint and Palmprint Scanner LS-4421 | Fingerprint Scanner LS-4422 | Fingerprint Scanner LS-11 | One-Fingerprint Scanner LS-01 | One-Fingerprint Scanner BEOGS | Biometrics Integrated Automatic Gates System PAPILON GWI | Access Control and Tracking System PAPILON VIDEO SURVEILLANCE | Surveillance and Video Processing System PAPILON VSS1 | Video Camera GK-01 | Access Control System LS Work Station | Finger and Palm Print Scanning Station APFIS Work Station | Automated Palm and Fingerprint Identification System Work Station MDS-45C Work Station | Multi Functional Work Station PAPILON M | Mobile Bag for Biometric Identity Search and Verification MKDS 30 & MKDS 45 | Identity Registration and Check System PAPILON FILTER | Instant ID Check Software Mobile Ballistic Identification Set EXPERTLAB | Criminal Evidence Analysing Set RASTR | Criminal Evidence Developing and Processing System FOSKO | Criminal Evidence Photographing Set TVC 9.1 USB | Short Distance Camera BLIP | Forged Money Identification System PAPILON LATOP | Crime Scene Analysing Device PYUZ | Face Recognition System FK-2T | Biometric Photographic System FK-3 | Portable Video and Photographing System KLIM3D | Face Composite Producing System ZIRKON Series | Iris Identification System ARSENAL ABIS | Automated Ballistic Identification System BS-16 | Ballistic Scanner NuiTrack | Skeleton, Face and Motion Recognition System VicoVR | Wireless Sensor for Virtual Reality SeeMetrix | Audience Analytics System Papilon's leading security solutions are leveraged by industry expertise, best of breed technology and constant system developments. Justice & Public Safety Justice & Public Safety Border & Immigration Managament Sensitive Site Surveillance Management Public Venue & Event Safety Banking & Financial Markets Solutions ARSENAL ABIS | Automated Ballistic Identification System BEOGS | Biometrics Integrated Automatic Gates System ZIRKON | Iris Identification System PYUZ | Face Recognition System Papilon Savunma offers to law enforcements, enterprise corporations and other institutions a reliable security collaboration; by combining state-of-the-art technology, know-how and hands on experience together. Papilon Savunma 2017-03-18T12:00:17+00:00 US' Much Debated Fingerprint Expansion Policy: From Two to Ten Papilon Savunma 2017-03-18T12:00:17+00:00 June 29th, 2016 | 0 Comments Summary This information note encompasses US-VISIT's policy alteration in regards to collecting biometric data from international visitors. The biometric acquisition had been executed at ports entry [...] Papilon Savunma 2017-03-18T12:00:21+00:00 Privacy in Biometrics: Why You Should Not Worry About Papilon Savunma 2017-03-18T12:00:21+00:00 April 23rd, 2016 | 4 Comments Introduction Biometrics are one of the most commonly discussed security trend right now – due to its dramatic penetration to daily lives, in such short amount of [...] Papilon Savunma 2017-03-18T12:00:17+00:00 US' Much Debated Fingerprint Expansion Policy: From Two to Ten Papilon Savunma 2017-03-18T12:00:17+00:00 June 29th, 2016 | 0 Comments Summary This information note encompasses US-VISIT's policy alteration in regards to collecting biometric data from international visitors. The biometric acquisition had been executed at ports entry [...] US' Much Debated Fingerprint Expansion Policy: From Two to Ten Papilon Savunma 2017-03-18T12:00:17+00:00 June 29th, 2016 | 0 Comments Summary This information note encompasses US-VISIT's policy alteration in regards to collecting biometric data from international visitors. The biometric acquisition had been executed at ports entry [...] Papilon Savunma 2017-03-18T12:00:21+00:00 Privacy in Biometrics: Why You Should Not Worry About Papilon Savunma 2017-03-18T12:00:21+00:00 April 23rd, 2016 | 4 Comments Introduction Biometrics are one of the most commonly discussed security trend right now – due to its dramatic penetration to daily lives, in such short amount of [...] Privacy in Biometrics: Why You Should Not Worry About Papilon Savunma 2017-03-18T12:00:21+00:00 April 23rd, 2016 | 4 Comments Introduction Biometrics are one of the most commonly discussed security trend right now – due to its dramatic penetration to daily lives, in such short amount of [...] Papilon Savunma 2018-10-30T10:14:02+00:00 We are celebrating Turkish National Day of Victory Papilon Savunma 2018-10-30T10:14:02+00:00 August 30th, 2018 | 0 Comments As Papilon Savunma, we celebrate the 30th of August, Turkish National Day of Victory! [...] Papilon Savunma 2018-10-30T10:26:41+00:00 Ramadan Feast Papilon Savunma 2018-10-30T10:26:41+00:00 June 15th, 2018 | 0 Comments Mubarak eid. Papilon Savunma celebrate your Ramadan Feast, and wish you a happy and healthy feast [...] Papilon Savunma 2017-12-07T10:18:57+00:00 Indian Police are Enjoying Further Success with Papilon System and Products Papilon Savunma 2017-12-07T10:18:57+00:00 November 17th, 2017 | 0 Comments Having started to use Papilon Systems and Products this year, Papilon's Shared R&D results makes noticeable difference to the [...] Papilon Savunma 2017-11-20T10:09:28+00:00 High Level Criminal Investigation Officials from Tanzania Participated Papilon Savunma Program Papilon Savunma 2017-11-20T10:09:28+00:00 November 11th, 2017 | 0 Comments Papilon Savunma was honored with the visit of a team of high level security officials from the Criminal Investigation [...] Papilon Savunma 2017-10-04T00:18:36+00:00 Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited Papilon Savunma Papilon Savunma 2017-10-04T00:18:36+00:00 September 29th, 2017 | 0 Comments Head of International Co-operation Department of the Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited [...] Papilon Savunma 2017-11-03T11:19:29+00:00 Iraqi Criminal Investigations Staff Has Met the World's Fastest and Most Accurate Biometrical Identification Systems Papilon Savunma 2017-11-03T11:19:29+00:00 September 29th, 2017 | 0 Comments The Iraqi security committe of the Head of Criminal Department, Fingerprint Department Manager and Crime Scene Investigation Department Manager [...] Papilon Savunma 2018-10-30T10:14:02+00:00 We are celebrating Turkish National Day of Victory Papilon Savunma 2018-10-30T10:14:02+00:00 August 30th, 2018 | 0 Comments As Papilon Savunma, we celebrate the 30th of August, Turkish National Day of Victory! [...] We are celebrating Turkish National Day of Victory Papilon Savunma 2018-10-30T10:14:02+00:00 August 30th, 2018 | 0 Comments As Papilon Savunma, we celebrate the 30th of August, Turkish National Day of Victory! [...] Papilon Savunma 2018-10-30T10:26:41+00:00 Ramadan Feast Papilon Savunma 2018-10-30T10:26:41+00:00 June 15th, 2018 | 0 Comments Mubarak eid. Papilon Savunma celebrate your Ramadan Feast, and wish you a happy and healthy feast [...] Papilon Savunma 2018-10-30T10:26:41+00:00 June 15th, 2018 | 0 Comments Mubarak eid. Papilon Savunma celebrate your Ramadan Feast, and wish you a happy and healthy feast [...] Papilon Savunma 2017-12-07T10:18:57+00:00 Indian Police are Enjoying Further Success with Papilon System and Products Papilon Savunma 2017-12-07T10:18:57+00:00 November 17th, 2017 | 0 Comments Having started to use Papilon Systems and Products this year, Papilon's Shared R&D results makes noticeable difference to the [...] Indian Police are Enjoying Further Success with Papilon System and Products Papilon Savunma 2017-12-07T10:18:57+00:00 November 17th, 2017 | 0 Comments Having started to use Papilon Systems and Products this year, Papilon's Shared R&D results makes noticeable difference to the [...] Papilon Savunma 2017-11-20T10:09:28+00:00 High Level Criminal Investigation Officials from Tanzania Participated Papilon Savunma Program Papilon Savunma 2017-11-20T10:09:28+00:00 November 11th, 2017 | 0 Comments Papilon Savunma was honored with the visit of a team of high level security officials from the Criminal Investigation [...] High Level Criminal Investigation Officials from Tanzania Participated Papilon Savunma Program Papilon Savunma 2017-11-20T10:09:28+00:00 November 11th, 2017 | 0 Comments Papilon Savunma was honored with the visit of a team of high level security officials from the Criminal Investigation [...] Papilon Savunma 2017-10-04T00:18:36+00:00 Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited Papilon Savunma Papilon Savunma 2017-10-04T00:18:36+00:00 September 29th, 2017 | 0 Comments Head of International Co-operation Department of the Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited [...] Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited Papilon Savunma Papilon Savunma 2017-10-04T00:18:36+00:00 September 29th, 2017 | 0 Comments Head of International Co-operation Department of the Turkish Republic Ministry of National Defence, Undersecreteriat of Defence Industries has visited [...] Papilon Savunma 2017-11-03T11:19:29+00:00 Iraqi Criminal Investigations Staff Has Met the World's Fastest and Most Accurate Biometrical Identification Systems Papilon Savunma 2017-11-03T11:19:29+00:00 September 29th, 2017 | 0 Comments The Iraqi security committe of the Head of Criminal Department, Fingerprint Department Manager and Crime Scene Investigation Department Manager [...] Iraqi Criminal Investigations Staff Has Met the World's Fastest and Most Accurate Biometrical Identification Systems Papilon Savunma 2017-11-03T11:19:29+00:00 September 29th, 2017 | 0 Comments The Iraqi security committe of the Head of Criminal Department, Fingerprint Department Manager and Crime Scene Investigation Department Manager [...] Papilon Savunma 2017-10-26T15:41:41+00:00 Papilon Savunma Accompanied the Reception of the National Day of the Republic of Zambia Papilon Savunma 2017-10-26T15:41:41+00:00 October 26th, 2017 | 0 Comments As Papilon Savunma, we accompanied the reception of the National Day of the Republic of Zambia hosted by the [...] Papilon Savunma 2017-09-11T11:22:37+00:00 Papilon Participated to 2nd R & D and Innovation Summit and Exhibition Papilon Savunma 2017-09-11T11:22:37+00:00 September 11th, 2017 | 0 Comments As Papilon Savunma, we participated the 2nd R & D and Innovation Summit and Exhibition which [...] Papilon Savunma 2017-08-30T13:09:38+00:00 Papilon Savunma Participated to \"IT Sector Gathering\" Meeting Papilon Savunma 2017-08-30T13:09:38+00:00 August 14th, 2017 | 0 Comments Papilon Savunma Participated to TOBB \"IT Sector Gathering\" Meeting. Papilon Savunma 2017-07-19T10:35:07+00:00 Muehlbauer Tecurity Center Days Papilon Savunma 2017-07-19T10:35:07+00:00 July 6th, 2017 | 0 Comments Papilon Savunma is invited to the 2nd of the Technology Days (Tecurity Center) in Roding, Germany, organized by German leading [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to European Commission's Horizon 2020 Program Papilon Savunma 2017-03-18T12:00:11+00:00 March 9th, 2017 | 0 Comments European Commission's Horizon 2020 Program Secure Societies Field 2017 Call Information Day and Project Market Event on 6-7th [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to Kick-off 2017 Event, As An Invitee of Horizon 2020 Papilon Savunma 2017-03-18T12:00:11+00:00 February 26th, 2017 | 0 Comments Papilon Savunma is invited to the kick-off meeting of 2017 which took place in 22nd of February as the [...] Papilon Savunma 2017-10-26T15:41:41+00:00 Papilon Savunma Accompanied the Reception of the National Day of the Republic of Zambia Papilon Savunma 2017-10-26T15:41:41+00:00 October 26th, 2017 | 0 Comments As Papilon Savunma, we accompanied the reception of the National Day of the Republic of Zambia hosted by the [...] Papilon Savunma Accompanied the Reception of the National Day of the Republic of Zambia Papilon Savunma 2017-10-26T15:41:41+00:00 October 26th, 2017 | 0 Comments As Papilon Savunma, we accompanied the reception of the National Day of the Republic of Zambia hosted by the [...] Papilon Savunma 2017-09-11T11:22:37+00:00 Papilon Participated to 2nd R & D and Innovation Summit and Exhibition Papilon Savunma 2017-09-11T11:22:37+00:00 September 11th, 2017 | 0 Comments As Papilon Savunma, we participated the 2nd R & D and Innovation Summit and Exhibition which [...] Papilon Participated to 2nd R & D and Innovation Summit and Exhibition Papilon Savunma 2017-09-11T11:22:37+00:00 September 11th, 2017 | 0 Comments As Papilon Savunma, we participated the 2nd R & D and Innovation Summit and Exhibition which [...] Papilon Savunma 2017-08-30T13:09:38+00:00 Papilon Savunma Participated to \"IT Sector Gathering\" Meeting Papilon Savunma 2017-08-30T13:09:38+00:00 August 14th, 2017 | 0 Comments Papilon Savunma Participated to TOBB \"IT Sector Gathering\" Meeting. Papilon Savunma Participated to \"IT Sector Gathering\" Meeting Papilon Savunma 2017-08-30T13:09:38+00:00 August 14th, 2017 | 0 Comments Papilon Savunma Participated to TOBB \"IT Sector Gathering\" Meeting. Papilon Savunma 2017-07-19T10:35:07+00:00 Muehlbauer Tecurity Center Days Papilon Savunma 2017-07-19T10:35:07+00:00 July 6th, 2017 | 0 Comments Papilon Savunma is invited to the 2nd of the Technology Days (Tecurity Center) in Roding, Germany, organized by German leading [...] Muehlbauer Tecurity Center Days Papilon Savunma 2017-07-19T10:35:07+00:00 July 6th, 2017 | 0 Comments Papilon Savunma is invited to the 2nd of the Technology Days (Tecurity Center) in Roding, Germany, organized by German leading [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to European Commission's Horizon 2020 Program Papilon Savunma 2017-03-18T12:00:11+00:00 March 9th, 2017 | 0 Comments European Commission's Horizon 2020 Program Secure Societies Field 2017 Call Information Day and Project Market Event on 6-7th [...] Papilon Participated to European Commission's Horizon 2020 Program Papilon Savunma 2017-03-18T12:00:11+00:00 March 9th, 2017 | 0 Comments European Commission's Horizon 2020 Program Secure Societies Field 2017 Call Information Day and Project Market Event on 6-7th [...] Papilon Savunma 2017-03-18T12:00:11+00:00 Papilon Participated to Kick-off 2017 Event, As An Invitee of Horizon 2020 Papilon Savunma 2017-03-18T12:00:11+00:00 February 26th, 2017 | 0 Comments Papilon Savunma is invited to the kick-off meeting of 2017 which took place in 22nd of February as the [...] Papilon Participated to Kick-off 2017 Event, As An Invitee of Horizon 2020 Papilon Savunma 2017-03-18T12:00:11+00:00 February 26th, 2017 | 0 Comments Papilon Savunma is invited to the kick-off meeting of 2017 which took place in 22nd of February as the [...]"
  ]
}