{
  "company": "passphere.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "The event and ticketing management system where you take control Passphere is an idea born out of the frustrations event organisers face everyday. To support event organisers by providing insightful data and functionality to deliver more services for less Passphere utilises the latest solutions in server management to allow processing of thousands of transactions per second. Passphere cleverly analyses the detail and has deep in-built capabilities to support you and your event. Real-time reporting and event editing helps you track buyer behavior and assist ticket buying customers at every step of the way. Passphere's customisable branding turns ticketing into part of your event experience. Passphere's mobile platform gives you total control over sales, marketing and coordination. Mobilise your ticketing staff to sell tickets with one click. Personalise our system, start selling tickets. One click refunds, EDM capability, easy complimentary ticket and discount features with the ability to select user tiers for staff. Control over access for your team, automate tedious tasks and gain the insights you need to deliver a successful event. Fully Responsive User Platform Customise our system to work for you. Passphere ticketing is easy to personalise, a seamless part of your event experience. Control event access for your team, automate tedious tasks and gain the insights you need to deliver a successful event. Passphere at the door Our app quickly delivers. Scanning visitor passes, use visitor redemption for those who have forgotten their tickets, and allow door sales that don't restrict to cash. Ask us a question or inquire about listing your event on Passphere in the near future.",
    "Passphere x iTicket. We have merged with iTICKET.co.nz to bring ticketing that works to New Zealand. Passphere is a global ready ticketing system that will inspire creators to take control. We offer experiences that connect and technology that truly evolves to suit your needs. We've taken all constraints off Launching as 3 unique products, you take control! Passphere API for developers Build without limits, allowing the growth of a community of passionate people who can make a real difference to the future of ticketing A White Label ticketing solution, for Promoters to seamlessly integrate powerful ticketing into their own websites with ease iTICKET Powered by Passphere Our strategic launch merger in New Zealand, featuring custom DIY event builds, group bookings, allocated seating and much much more! We care about our promoters The Passphere platform will give power back to every event organiser from the smallest gig to the largest scale venues selling thousands of tickets per second. Creating a people centric platform, provides rich data back to our organisers to better plan and run events globally. Are you one of these? We have created a platform that not only works, but one that is people centric and focused on providing a world leading technology solution. We aren't specializing in one user group, so go about what we offer for you. Looking to enjoy breathtaking experiences? Organise amazing experiences around the world? Find it hard to manage your venue for promoters? Want to build amazing booking experiences?"
  ]
}