{
  "company": "paybyface.io",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "A customer centric, seamless and secure digital payment ecosystem for a safer, faster and more convenient shopping experience. Published by admin at April 2, 2024 0 PayByFace® Biometric Face Authentication Payment Processing Platform Expands Across Major European Markets PayByFace® Biometric Face Authentication Payment Processing Platform Expands Across Major European Markets Published by admin at May 6, 2022 0 When your smile is your wallet – Paybyface is now live in Bulgaria When your smile is your wallet – Paybyface is now live in Bulgaria Published by admin at May 5, 2022 0 Imperiul Leilor Romania – Mihai Draghici : \"De ce n-ai plăti cu faÈ›a, pentru că nu pleci niciodată de acasă fără față?†Imperiul Leilor Romania – Mihai Draghici : \"De ce n-ai plăti cu faÈ›a, pentru că nu pleci niciodată de acasă fără față?†Make payments faster, secured and super convenient Visit Our VIP Store Create your free account today...",
    "Welcome to face recognition biometric payment processing We provide a seamless and secure digital payment ecosystem for a faster and more convenient shopping experience. Innovative Cardless Payment Processing Carrying your debit and credit cards everywhere you go can easily be lost or stolen and the 4-digit PIN is not very secure. With PayByFace it's like an Uber app for making payments when you go shopping! You no longer need to carry your cards or cash, simply use our proprietary face recognition cardless payment app and just take a selfie to buy things at participating merchants around town. https://youtu.be/PA2XuKC5WWc Become a Participating Merchant In Our Beta Program Out of paper. No signal. Cards don't swipe. Are you a merchant and tired of your ancient legacy devices? Email us to about our innovative biometric cashless payment platform. Customers can now pay you using our POS system with just their selfie! Email Us For Details Today Welcome to face recognition biometric payment processing Innovative Cardless Payment Processing Innovative Cardless Payment Processing Carrying your debit and credit cards everywhere you go can easily be lost or stolen and the 4-digit PIN is not very secure. With PayByFace it's like an Uber app for making payments when you go shopping! You no longer need to carry your cards or cash, simply use our proprietary face recognition cardless payment app and just take a selfie to buy things at participating merchants around town. Become a Participating Merchant In Our Beta Program Out of paper. No signal. Cards don't swipe. Are you a merchant and tired of your ancient legacy devices? Email us to about our innovative biometric cashless payment platform. Customers can now pay you using our POS system with just their selfie!"
  ]
}