{
  "company": "pillohealth.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 7,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 2
    }
  },
  "sample_docs": [
    "Pillo Health FAQ Our Platform Who is Pillo Health? Pillo Health is a healthcare solutions company that improves outcomes for businesses by leveraging proprietary technology to scale in-home patient engagement. Get to know our team here . What makes Pillo Health so unique? First and foremost, Pillo Health provides a unique proprietary platform. It is designed with human emotion and engagement protocols in mind to ensure compliance. Our proactive, voice-enabled health assistant tracks health regimens, and then initiates encouraging interactions which promote adherence and independence while enhancing connections between users, care teams and health organizations. Second, the team at Pillo Health lives and breathes our values of integrity, empathy, engagement and autonomy. We don't just make product, we bake these values into our lives and our work, because we believe that when creating technological solutions for highly sensitive interactions, we must consider all human elements including privacy, emotion, motivation and self-reliance. Is the technology HIPAA compliant? Yes, we adhere to all HIPAA requirements. Pillo Health stands behind and supports the storage of the data in a HIPAA compliant manner. Further, we separate personal information and health information to increase privacy. How does Pillo Health protect the user's privacy? User privacy is of utmost importance to us and we adhere to strict rules. Our platform is HIPAA compliant so the data that we collect is stored and transported according to all HIPAA regulations. This means we will not store or archive any voice or face data. We keep your user information completely separate from your medication data so that your personal health information is protected. All data is transported using secure encrypted communication and is stored in a third-party HIPAA-compliant cloud. Is Pillo Health's platform customizable? Yes. With Pillo Health, custom services from third parties can be integrated to the Pillo Health platform and delivered to customers through our Pillo device as well as other connected devices via our secure, state-of-the-art cloud-based platform. about our technology on our Platform page . Does Pillo Health record the user's voice and keep those voice records? Voice capture is done locally on the device. Any voice or audio after the wake word is converted from spoken word to text using a third-party cloud speech recognition provider directly from the robot. Currently the user's speech only goes to that third-party speech recognizer. Pillo Health does receive the recognized results and stores those results in a HIPAA compliant manner. Who supplies the speech recognition technology? Pillo Health uses a large cloud technology provider for its speech recognition capabilities. This cloud provider does not know who is speaking and therefore the speech they receive remains anonymous. What happens with facial recognition data? We use facial recognition to authenticate the primary user before dispensing their medications. Pillo takes pictures of the user and then a cloud face recognition engine from a third-party cloud provider uses those pictures and returns an abstract face model to the device. No information about the user's face or pictures of the user are stored on the device or in the third-party cloud provider. What is the relationship between Pillo Health and Stanley Black and Decker, and what is Pria? Pria is powered by Pillo Health and is our first consumer product, launched in September 2019 in partnership with Stanley Black and Decker. Pillo Health developed the innovative, proprietary technology platform that powers Pria by BLACK + DECKER. BLACK + DECKER markets and distributes Pria to consumers in need of an in-home solution to extend the circle of caregiving. about Pria here . How can I become a partner? If you're looking for new ways to engage with your customers, improve health outcomes, and lower overall costs, visit our Partners page to send us a message and discuss how your solution can be powered by Pillo Health. With Pillo Health's voice-first, HIPAA-compliant platform, businesses can create a continuous in-home engagement model. Our robot is smart, secure, and an engaging \"someone†who ensures attention and adherence to medication and health regimens. Our Device What is the Pillo device? The Pillo robot is an automated medication management and voice first smart home healthcare device that brings to life Pillo Health's technology. The platform is also accessible via mobile devices for professional and family caregivers. Meet Pillo on our Devices page! What smart assistant features does the device support? Reminders Find information online (weather, news, FAQ) Voice-activated device control Conversational interactions Google Maps-powered location and time zone support What types of questions can I ask Pillo? Pillo can support a wide range of questions, and continues to every day. Besides asking for your scheduled doses, users can ask Pillo about the weather, facts, to tell jokes or recite a poem! What languages does Pillo support? Currently, Pillo can speak and understand English. We are working on expanding to new languages in the future. Can Pillo really recognize an end user? Yes. Pillo can see users from several feet away, if the lighting conditions are optimal. The device's omnidirectional microphones mean that Pillo can be placed anywhere in the room and still hear users from all directions. How many doses of medication can Pillo store, and how do you load them? Pillo can store and dispense medications for one person and up to 28 doses. For example, if someone takes their medications once per day, or 7 doses per week, he/she would store four-weeks' worth of doses in Pillo. If someone were to take a few medications twice per day, or fourteen doses per week, he/she would store two weeks' worth of doses. The loading process is simple via a wheel that fits in the back of the device, and Pillo guides users through the process pill-by-pill. What types of medications can Pillo manage? While Pillo only stores solid pills, the device will remind users to take other forms of medications (liquid, inhaler, gel) via notifications on device and mobile. Users are asked to confirm that they took these medications on their Pillo mobile application. How does Pillo help users to remember their medications? Pillo leverages both an on-device and mobile notification system to remind users. When it is time to take a dose, the device will alert the user with lights and sound. The device uses either facial recognition or a pin code to dispense the dose to the appropriate user. In addition, caregivers who have the mobile app will be alerted when the dose is taken. Pillo can also alert a care giver if a medication is missed. That caregiver can then reach out and even do a video call directly to the Pillo device. How do Pillo drop-in calls work? Drop-in voice or video calling is a completely optional feature that lets the user or caregiver connect instantly between the Pillo device and mobile application, similar to a two-way intercom. Drop-in functionality is permission-based and is as simple as placing a phone call. Real-time alerts and voice and video calling capabilities allow professional and family caregivers to check in on loved ones and monitor their health remotely, improving compliance and adherence without sacrificing independence. Does the device support Amazon Alexa or Google Home? Currently, Pillo's technology is compatible with the Pillo device and mobile application only. What phones are compatible with Pillo's mobile application? Both iOS and Android phones are compatible with Pillo. We support iOS 11.3 and later versions, as well as Android Lollipop 5.0 and later versions. Pillo Health FAQ Our Platform Who is Pillo Health? Pillo Health is a healthcare solutions company that improves outcomes for businesses by leveraging proprietary technology to scale in-home patient engagement. Get to know our team here . What makes Pillo Health so unique? First and foremost, Pillo Health provides a unique proprietary platform. It is designed with human emotion and engagement protocols in mind to ensure compliance. Our proactive, voice-enabled health assistant tracks health regimens, and then initiates encouraging interactions which promote adherence and independence while enhancing connections between users, care teams and health organizations. Second, the team at Pillo Health lives and breathes our values of integrity, empathy, engagement and autonomy. We don't just make product, we bake these values into our lives and our work, because we believe that when creating technological solutions for highly sensitive interactions, we must consider all human elements including privacy, emotion, motivation and self-reliance. Is the technology HIPAA compliant? Yes, we adhere to all HIPAA requirements. Pillo Health stands behind and supports the storage of the data in a HIPAA compliant manner. Further, we separate personal information and health information to increase privacy. How does Pillo Health protect the user's privacy? User privacy is of utmost importance to us and we adhere to strict rules. Our platform is HIPAA compliant so the data that we collect is stored and transported according to all HIPAA regulations. This means we will not store or archive any voice or face data. We keep your user information completely separate from your medication data so that your personal health information is protected. All data is transported using secure encrypted communication and is stored in a third-party HIPAA-compliant cloud. Is Pillo Health's platform customizable? Yes. With Pillo Health, custom services from third parties can be integrated to the Pillo Health platform and delivered to customers through our Pillo device as well as other connected devices via our secure, state-of-the-art cloud-based platform. about our technology on our Platform page . Does Pillo Health record the user's voice and keep those voice records? Voice capture is done locally on the device. Any voice or audio after the wake word is converted from spoken word to text using a third-party cloud speech recognition provider directly from the robot. Currently the user's speech only goes to that third-party speech recognizer. Pillo Health does receive the recognized results and stores those results in a HIPAA compliant manner. Who supplies the speech recognition technology? Pillo Health uses a large cloud technology provider for its speech recognition capabilities. This cloud provider does not know who is speaking and therefore the speech they receive remains anonymous. What happens with facial recognition data? We use facial recognition to authenticate the primary user before dispensing their medications. Pillo takes pictures of the user and then a cloud face recognition engine from a third-party cloud provider uses those pictures and returns an abstract face model to the device. No information about the user's face or pictures of the user are stored on the device or in the third-party cloud provider. What is the relationship between Pillo Health and Stanley Black and Decker, and what is Pria? Pria is powered by Pillo Health and is our first consumer product, launched in September 2019 in partnership with Stanley Black and Decker. Pillo Health developed the innovative, proprietary technology platform that powers Pria by BLACK + DECKER. BLACK + DECKER markets and distributes Pria to consumers in need of an in-home solution to extend the circle of caregiving. about Pria here . How can I become a partner? If you're looking for new ways to engage with your customers, improve health outcomes, and lower overall costs, visit our Partners page to send us a message and discuss how your solution can be powered by Pillo Health. With Pillo Health's voice-first, HIPAA-compliant platform, businesses can create a continuous in-home engagement model. Our robot is smart, secure, and an engaging \"someone†who ensures attention and adherence to medication and health regimens. Our Device What is the Pillo device? The Pillo robot is an automated medication management and voice first smart home healthcare device that brings to life Pillo Health's technology. The platform is also accessible via mobile devices for professional and family caregivers. Meet Pillo on our Devices page! What smart assistant features does the device support? Reminders Find information online (weather, news, FAQ) Voice-activated device control Conversational interactions Google Maps-powered location and time zone support What types of questions can I ask Pillo? Pillo can support a wide range of questions, and continues to every day. Besides asking for your scheduled doses, users can ask Pillo about the weather, facts, to tell jokes or recite a poem! What languages does Pillo support? Currently, Pillo can speak and understand English. We are working on expanding to new languages in the future. Can Pillo really recognize an end user? Yes. Pillo can see users from several feet away, if the lighting conditions are optimal. The device's omnidirectional microphones mean that Pillo can be placed anywhere in the room and still hear users from all directions. How many doses of medication can Pillo store, and how do you load them? Pillo can store and dispense medications for one person and up to 28 doses. For example, if someone takes their medications once per day, or 7 doses per week, he/she would store four-weeks' worth of doses in Pillo. If someone were to take a few medications twice per day, or fourteen doses per week, he/she would store two weeks' worth of doses. The loading process is simple via a wheel that fits in the back of the device, and Pillo guides users through the process pill-by-pill. What types of medications can Pillo manage? While Pillo only stores solid pills, the device will remind users to take other forms of medications (liquid, inhaler, gel) via notifications on device and mobile. Users are asked to confirm that they took these medications on their Pillo mobile application. How does Pillo help users to remember their medications? Pillo leverages both an on-device and mobile notification system to remind users. When it is time to take a dose, the device will alert the user with lights and sound. The device uses either facial recognition or a pin code to dispense the dose to the appropriate user. In addition, caregivers who have the mobile app will be alerted when the dose is taken. Pillo can also alert a care giver if a medication is missed. That caregiver can then reach out and even do a video call directly to the Pillo device. How do Pillo drop-in calls work? Drop-in voice or video calling is a completely optional feature that lets the user or caregiver connect instantly between the Pillo device and mobile application, similar to a two-way intercom. Drop-in functionality is permission-based and is as simple as placing a phone call. Real-time alerts and voice and video calling capabilities allow professional and family caregivers to check in on loved ones and monitor their health remotely, improving compliance and adherence without sacrificing independence. Does the device support Amazon Alexa or Google Home? Currently, Pillo's technology is compatible with the Pillo device and mobile application only. What phones are compatible with Pillo's mobile application? Both iOS and Android phones are compatible with Pillo. We support iOS 11.3 and later versions, as well as Android Lollipop 5.0 and later versions. Our Platform Who is Pillo Health? Pillo Health is a healthcare solutions company that improves outcomes for businesses by leveraging proprietary technology to scale in-home patient engagement. Get to know our team here . What makes Pillo Health so unique? First and foremost, Pillo Health provides a unique proprietary platform. It is designed with human emotion and engagement protocols in mind to ensure compliance. Our proactive, voice-enabled health assistant tracks health regimens, and then initiates encouraging interactions which promote adherence and independence while enhancing connections between users, care teams and health organizations. Second, the team at Pillo Health lives and breathes our values of integrity, empathy, engagement and autonomy. We don't just make product, we bake these values into our lives and our work, because we believe that when creating technological solutions for highly sensitive interactions, we must consider all human elements including privacy, emotion, motivation and self-reliance. Is the technology HIPAA compliant? Yes, we adhere to all HIPAA requirements. Pillo Health stands behind and supports the storage of the data in a HIPAA compliant manner. Further, we separate personal information and health information to increase privacy. How does Pillo Health protect the user's privacy? User privacy is of utmost importance to us and we adhere to strict rules. Our platform is HIPAA compliant so the data that we collect is stored and transported according to all HIPAA regulations. This means we will not store or archive any voice or face data. We keep your user information completely separate from your medication data so that your personal health information is protected. All data is transported using secure encrypted communication and is stored in a third-party HIPAA-compliant cloud. Is Pillo Health's platform customizable? Yes. With Pillo Health, custom services from third parties can be integrated to the Pillo Health platform and delivered to customers through our Pillo device as well as other connected devices via our secure, state-of-the-art cloud-based platform. about our technology on our Platform page . Does Pillo Health record the user's voice and keep those voice records? Voice capture is done locally on the device. Any voice or audio after the wake word is converted from spoken word to text using a third-party cloud speech recognition provider directly from the robot. Currently the user's speech only goes to that third-party speech recognizer. Pillo Health does receive the recognized results and stores those results in a HIPAA compliant manner. Who supplies the speech recognition technology? Pillo Health uses a large cloud technology provider for its speech recognition capabilities. This cloud provider does not know who is speaking and therefore the speech they receive remains anonymous. What happens with facial recognition data? We use facial recognition to authenticate the primary user before dispensing their medications. Pillo takes pictures of the user and then a cloud face recognition engine from a third-party cloud provider uses those pictures and returns an abstract face model to the device. No information about the user's face or pictures of the user are stored on the device or in the third-party cloud provider. What is the relationship between Pillo Health and Stanley Black and Decker, and what is Pria? Pria is powered by Pillo Health and is our first consumer product, launched in September 2019 in partnership with Stanley Black and Decker. Pillo Health developed the innovative, proprietary technology platform that powers Pria by BLACK + DECKER. BLACK + DECKER markets and distributes Pria to consumers in need of an in-home solution to extend the circle of caregiving. about Pria here . How can I become a partner? If you're looking for new ways to engage with your customers, improve health outcomes, and lower overall costs, visit our Partners page to send us a message and discuss how your solution can be powered by Pillo Health. With Pillo Health's voice-first, HIPAA-compliant platform, businesses can create a continuous in-home engagement model. Our robot is smart, secure, and an engaging \"someone†who ensures attention and adherence to medication and health regimens. Pillo Health is a healthcare solutions company that improves outcomes for businesses by leveraging proprietary technology to scale in-home patient engagement. Get to know our team here . First and foremost, Pillo Health provides a unique proprietary platform. It is designed with human emotion and engagement protocols in mind to ensure compliance. Our proactive, voice-enabled health assistant tracks health regimens, and then initiates encouraging interactions which promote adherence and independence while enhancing connections between users, care teams and health organizations. Second, the team at Pillo Health lives and breathes our values of integrity, empathy, engagement and autonomy. We don't just make product, we bake these values into our lives and our work, because we believe that when creating technological solutions for highly sensitive interactions, we must consider all human elements including privacy, emotion, motivation and self-reliance. Yes, we adhere to all HIPAA requirements. Pillo Health stands behind and supports the storage of the data in a HIPAA compliant manner. Further, we separate personal information and health information to increase privacy. User privacy is of utmost importance to us and we adhere to strict rules. Our platform is HIPAA compliant so the data that we collect is stored and transported according to all HIPAA regulations. This means we will not store or archive any voice or face data. We keep your user information completely separate from your medication data so that your personal health information is protected. All data is transported using secure encrypted communication and is stored in a third-party HIPAA-compliant cloud. Yes. With Pillo Health, custom services from third parties can be integrated to the Pillo Health platform and delivered to customers through our Pillo device as well as other connected devices via our secure, state-of-the-art cloud-based platform. about our technology on our Platform page . Voice capture is done locally on the device. Any voice or audio after the wake word is converted from spoken word to text using a third-party cloud speech recognition provider directly from the robot. Currently the user's speech only goes to that third-party speech recognizer. Pillo Health does receive the recognized results and stores those results in a HIPAA compliant manner. Pillo Health uses a large cloud technology provider for its speech recognition capabilities. This cloud provider does not know who is speaking and therefore the speech they receive remains anonymous. We use facial recognition to authenticate the primary user before dispensing their medications. Pillo takes pictures of the user and then a cloud face recognition engine from a third-party cloud provider uses those pictures and returns an abstract face model to the device. No information about the user's face or pictures of the user are stored on the device or in the third-party cloud provider. Pria is powered by Pillo Health and is our first consumer product, launched in September 2019 in partnership with Stanley Black and Decker. Pillo Health developed the innovative, proprietary technology platform that powers Pria by BLACK + DECKER. BLACK + DECKER markets and distributes Pria to consumers in need of an in-home solution to extend the circle of caregiving. about Pria here . If you're looking for new ways to engage with your customers, improve health outcomes, and lower overall costs, visit our Partners page to send us a message and discuss how your solution can be powered by Pillo Health. With Pillo Health's voice-first, HIPAA-compliant platform, businesses can create a continuous in-home engagement model. Our robot is smart, secure, and an engaging \"someone†who ensures attention and adherence to medication and health regimens. Our Device What is the Pillo device? The Pillo robot is an automated medication management and voice first smart home healthcare device that brings to life Pillo Health's technology. The platform is also accessible via mobile devices for professional and family caregivers. Meet Pillo on our Devices page! What smart assistant features does the device support? Reminders Find information online (weather, news, FAQ) Voice-activated device control Conversational interactions Google Maps-powered location and time zone support What types of questions can I ask Pillo? Pillo can support a wide range of questions, and continues to every day. Besides asking for your scheduled doses, users can ask Pillo about the weather, facts, to tell jokes or recite a poem! What languages does Pillo support? Currently, Pillo can speak and understand English. We are working on expanding to new languages in the future. Can Pillo really recognize an end user? Yes. Pillo can see users from several feet away, if the lighting conditions are optimal. The device's omnidirectional microphones mean that Pillo can be placed anywhere in the room and still hear users from all directions. How many doses of medication can Pillo store, and how do you load them? Pillo can store and dispense medications for one person and up to 28 doses. For example, if someone takes their medications once per day, or 7 doses per week, he/she would store four-weeks' worth of doses in Pillo. If someone were to take a few medications twice per day, or fourteen doses per week, he/she would store two weeks' worth of doses. The loading process is simple via a wheel that fits in the back of the device, and Pillo guides users through the process pill-by-pill. What types of medications can Pillo manage? While Pillo only stores solid pills, the device will remind users to take other forms of medications (liquid, inhaler, gel) via notifications on device and mobile. Users are asked to confirm that they took these medications on their Pillo mobile application. How does Pillo help users to remember their medications? Pillo leverages both an on-device and mobile notification system to remind users. When it is time to take a dose, the device will alert the user with lights and sound. The device uses either facial recognition or a pin code to dispense the dose to the appropriate user. In addition, caregivers who have the mobile app will be alerted when the dose is taken. Pillo can also alert a care giver if a medication is missed. That caregiver can then reach out and even do a video call directly to the Pillo device. How do Pillo drop-in calls work? Drop-in voice or video calling is a completely optional feature that lets the user or caregiver connect instantly between the Pillo device and mobile application, similar to a two-way intercom. Drop-in functionality is permission-based and is as simple as placing a phone call. Real-time alerts and voice and video calling capabilities allow professional and family caregivers to check in on loved ones and monitor their health remotely, improving compliance and adherence without sacrificing independence. Does the device support Amazon Alexa or Google Home? Currently, Pillo's technology is compatible with the Pillo device and mobile application only. What phones are compatible with Pillo's mobile application? Both iOS and Android phones are compatible with Pillo. We support iOS 11.3 and later versions, as well as Android Lollipop 5.0 and later versions. The Pillo robot is an automated medication management and voice first smart home healthcare device that brings to life Pillo Health's technology. The platform is also accessible via mobile devices for professional and family caregivers. Meet Pillo on our Devices page! Reminders Find information online (weather, news, FAQ) Voice-activated device control Conversational interactions Google Maps-powered location and time zone support Find information online (weather, news, FAQ) Google Maps-powered location and time zone support Pillo can support a wide range of questions, and continues to every day. Besides asking for your scheduled doses, users can ask Pillo about the weather, facts, to tell jokes or recite a poem! Currently, Pillo can speak and understand English. We are working on expanding to new languages in the future. Yes. Pillo can see users from several feet away, if the lighting conditions are optimal. The device's omnidirectional microphones mean that Pillo can be placed anywhere in the room and still hear users from all directions. Pillo can store and dispense medications for one person and up to 28 doses. For example, if someone takes their medications once per day, or 7 doses per week, he/she would store four-weeks' worth of doses in Pillo. If someone were to take a few medications twice per day, or fourteen doses per week, he/she would store two weeks' worth of doses. The loading process is simple via a wheel that fits in the back of the device, and Pillo guides users through the process pill-by-pill. While Pillo only stores solid pills, the device will remind users to take other forms of medications (liquid, inhaler, gel) via notifications on device and mobile. Users are asked to confirm that they took these medications on their Pillo mobile application. Pillo leverages both an on-device and mobile notification system to remind users. When it is time to take a dose, the device will alert the user with lights and sound. The device uses either facial recognition or a pin code to dispense the dose to the appropriate user. In addition, caregivers who have the mobile app will be alerted when the dose is taken. Pillo can also alert a care giver if a medication is missed. That caregiver can then reach out and even do a video call directly to the Pillo device. Drop-in voice or video calling is a completely optional feature that lets the user or caregiver connect instantly between the Pillo device and mobile application, similar to a two-way intercom. Drop-in functionality is permission-based and is as simple as placing a phone call. Real-time alerts and voice and video calling capabilities allow professional and family caregivers to check in on loved ones and monitor their health remotely, improving compliance and adherence without sacrificing independence. Currently, Pillo's technology is compatible with the Pillo device and mobile application only. Both iOS and Android phones are compatible with Pillo. We support iOS 11.3 and later versions, as well as Android Lollipop 5.0 and later versions.",
    "Meet Pillo, The Home Health Companion Contact Us for More Info Meet Pillo, The Home Health Companion Contact Us for More Info Our Feature Device Is Customized to Your Needs We affectionately called her 'Pillo'. What would you name yours? Derek Hatchett Commercial Director Pillo Health Key Benefits Proactive, Voice-First Technology When it's time for a dose of medication, Pillo wakes up and proactively alerts users, improving engagement to health regimens by encouraging, guiding, and connecting. Bridging the gap Our real-time alerts and video-calling capabilities allow professional and family caregivers to monitor the health of a loved one remotely, improving compliance and adherence without sacrificing their independence. Safety and Personalizations Pillo Health devices use camera and biometric technology to ensure that information and medication are provided to the correct user. By knowing who she's interacting with, our assistant can personalize the experience to their needs. Explore our Platform Are your customers' medicine cabinets this smart? Storage Pillo Health devices have a secure, tamper-proof pill storage area large enough to hold 28 doses of medication for a single user. Camera Say cheese! Pillo Health's facial recognition technology allows the device to digitally map the face of the user to ensure that doses are only dispensed to the prescription holder. Voice-First Technology Thanks to Pillo Health's technology, the device recognizes the user's voice and gets more familiar with preferences over time. Display The 9x5 display not only features a friendly face, but also functions as a customized menu. Check medication and workout progress as well as adjust settings from the sleek screen. Power Source Pillo Health's device is powered by plugging into a traditional outlet. The device can also function on 6 hours of stored battery life. Pill Cup & Sensor Pillo dispenses medications into the pill cup and can detect when it's removed, providing a power tool for measuring adherence and providing extra safety to your customer. Loading Made Simple Our assistant guides users through the loading process via voice and on-screen visual instructions. There's no more need to sort pills, set timers, or worry about making mistakes. Our device can store up to 4 weeks of medication. And when it's time for a refill, our assistant will alert the user. Hi Sarah, it's time to load your medication. Safer Dispensing When dispensing medications, Pillo follows a secure patented process, which includes facial recognition or PIN entry as well as a combination of sensors to confirm delivery of medications. Hi Sarah, it's time to take your dose! Health on the Go Your customers can use our connected mobile application to see their medication schedule on-the-go and track their health data. With their permission, the app keeps loved ones and caregivers in the loop by notifying them about any missed doses or responses to check-in questions. Hi Susan, Sarah missed her morning dose. Pillo Health Published on 12 Oct 2018 I would definitely recommend a Pillo Health product to my family and friends. I think the features are great, especially for older adults. William, 52 It's multi-faceted. It's like having another person in the house when you can't be there. Not only is it a delivery of medications, but it's a safety measure too. Patricia, 70 The method I used [for medication] was memory, and that wasn't good for me. Then Pillo came into my life and I didn't have to rely on memory any more. PIllo was there for me. Robin, 58 Introducing Pria by BLACK+DECKER Meet Pillo Health's first consumer product, Pria! Launched in September 2019, Pria is the combined vision of Pillo Health and Stanley Black & Decker. Check out Pria's website, browse custom features, and perhaps even place an order for a loved one! Pria by BLACK+DECKER powered by Pillo Health is helping the world get one step closer to at-home health independence. Visit Pria's Website Meet Pillo, The Home Health Companion Contact Us for More Info Meet Pillo, The Home Health Companion Contact Us for More Info Meet Pillo, The Home Health Companion Meet Pillo, The Home Health Companion Our Feature Device Is Customized to Your Needs We affectionately called her 'Pillo'. What would you name yours? Derek Hatchett Commercial Director Pillo Health Our Feature Device Is Customized to Your Needs Key Benefits Proactive, Voice-First Technology When it's time for a dose of medication, Pillo wakes up and proactively alerts users, improving engagement to health regimens by encouraging, guiding, and connecting. Bridging the gap Our real-time alerts and video-calling capabilities allow professional and family caregivers to monitor the health of a loved one remotely, improving compliance and adherence without sacrificing their independence. Safety and Personalizations Pillo Health devices use camera and biometric technology to ensure that information and medication are provided to the correct user. By knowing who she's interacting with, our assistant can personalize the experience to their needs. Explore our Platform When it's time for a dose of medication, Pillo wakes up and proactively alerts users, improving engagement to health regimens by encouraging, guiding, and connecting. Our real-time alerts and video-calling capabilities allow professional and family caregivers to monitor the health of a loved one remotely, improving compliance and adherence without sacrificing their independence. Pillo Health devices use camera and biometric technology to ensure that information and medication are provided to the correct user. By knowing who she's interacting with, our assistant can personalize the experience to their needs. Are your customers' medicine cabinets this smart? Storage Pillo Health devices have a secure, tamper-proof pill storage area large enough to hold 28 doses of medication for a single user. Camera Say cheese! Pillo Health's facial recognition technology allows the device to digitally map the face of the user to ensure that doses are only dispensed to the prescription holder. Voice-First Technology Thanks to Pillo Health's technology, the device recognizes the user's voice and gets more familiar with preferences over time. Display The 9x5 display not only features a friendly face, but also functions as a customized menu. Check medication and workout progress as well as adjust settings from the sleek screen. Power Source Pillo Health's device is powered by plugging into a traditional outlet. The device can also function on 6 hours of stored battery life. Pill Cup & Sensor Pillo dispenses medications into the pill cup and can detect when it's removed, providing a power tool for measuring adherence and providing extra safety to your customer. Are your customers' medicine cabinets this smart? Pillo Health devices have a secure, tamper-proof pill storage area large enough to hold 28 doses of medication for a single user. Say cheese! Pillo Health's facial recognition technology allows the device to digitally map the face of the user to ensure that doses are only dispensed to the prescription holder. Thanks to Pillo Health's technology, the device recognizes the user's voice and gets more familiar with preferences over time. The 9x5 display not only features a friendly face, but also functions as a customized menu. Check medication and workout progress as well as adjust settings from the sleek screen. Pillo Health's device is powered by plugging into a traditional outlet. The device can also function on 6 hours of stored battery life. Pill Cup & Sensor Pillo dispenses medications into the pill cup and can detect when it's removed, providing a power tool for measuring adherence and providing extra safety to your customer. Loading Made Simple Our assistant guides users through the loading process via voice and on-screen visual instructions. There's no more need to sort pills, set timers, or worry about making mistakes. Our device can store up to 4 weeks of medication. And when it's time for a refill, our assistant will alert the user. Hi Sarah, it's time to load your medication. Our assistant guides users through the loading process via voice and on-screen visual instructions. There's no more need to sort pills, set timers, or worry about making mistakes. Our device can store up to 4 weeks of medication. And when it's time for a refill, our assistant will alert the user. Hi Sarah, it's time to load your medication. Safer Dispensing When dispensing medications, Pillo follows a secure patented process, which includes facial recognition or PIN entry as well as a combination of sensors to confirm delivery of medications. Hi Sarah, it's time to take your dose! When dispensing medications, Pillo follows a secure patented process, which includes facial recognition or PIN entry as well as a combination of sensors to confirm delivery of medications. Hi Sarah, it's time to take your dose! Health on the Go Your customers can use our connected mobile application to see their medication schedule on-the-go and track their health data. With their permission, the app keeps loved ones and caregivers in the loop by notifying them about any missed doses or responses to check-in questions. Hi Susan, Sarah missed her morning dose. Health on the Go Your customers can use our connected mobile application to see their medication schedule on-the-go and track their health data. With their permission, the app keeps loved ones and caregivers in the loop by notifying them about any missed doses or responses to check-in questions. Hi Susan, Sarah missed her morning dose. Pillo Health Published on 12 Oct 2018 I would definitely recommend a Pillo Health product to my family and friends. I think the features are great, especially for older adults. William, 52 It's multi-faceted. It's like having another person in the house when you can't be there. Not only is it a delivery of medications, but it's a safety measure too. Patricia, 70 The method I used [for medication] was memory, and that wasn't good for me. Then Pillo came into my life and I didn't have to rely on memory any more. PIllo was there for me. Robin, 58 Published on 12 Oct 2018 I would definitely recommend a Pillo Health product to my family and friends. I think the features are great, especially for older adults. William, 52 It's multi-faceted. It's like having another person in the house when you can't be there. Not only is it a delivery of medications, but it's a safety measure too. Patricia, 70 The method I used [for medication] was memory, and that wasn't good for me. Then Pillo came into my life and I didn't have to rely on memory any more. PIllo was there for me. Robin, 58 Introducing Pria by BLACK+DECKER Meet Pillo Health's first consumer product, Pria! Launched in September 2019, Pria is the combined vision of Pillo Health and Stanley Black & Decker. Check out Pria's website, browse custom features, and perhaps even place an order for a loved one! Pria by BLACK+DECKER powered by Pillo Health is helping the world get one step closer to at-home health independence. Visit Pria's Website Introducing Pria by BLACK+DECKER Meet Pillo Health's first consumer product, Pria! Launched in September 2019, Pria is the combined vision of Pillo Health and Stanley Black & Decker. Check out Pria's website, browse custom features, and perhaps even place an order for a loved one! Pria by BLACK+DECKER powered by Pillo Health is helping the world get one step closer to at-home health independence.",
    "Pillo for Pharmacy Pillo for Pharmacy Achieve more meaningful relationships with your patients Pillo Health gives you continuous insight into your customers' entire medication regimens and empowers them to be a full participant in their own care through better understanding & use of their medications. How Can Your Pharmacy Benefit from Pillo? Deliver Higher Customer Satisfaction With 2-way video calling, you're able to provide best-in class care regardless of patient location, while modernizing consultations and the brown bag review process Increase Revenues Pillo's secure cloud-based platform provides customizations aimed at increasing customer loyalty, enabling refills, and driving foot traffic in retail settings as well as online sales for your home-delivery model. Understand Patients' Adherence to Medications With visibility into adherence and non-adherence events, you're armed with information as to why patients aren't able to maintain their medication regimen. Capture Accurate Medication Adherence Data On average, users engage with Pillo 6 times throughout the day, capturing richer data sets about their medication adherence and lifestyles in order to deliver more reliable intel for PBM and provider partners. Streamline Medication Therapy Management Efforts Program Medication-Related Action Plans into Pillo for increased adherence, and simplify documentation of engagement data generated from Pillo's custom reporting. Fend Off the Competition Scalable fulfillment solutions fill, verify, and seal prescription packaging while also allowing users to modify their daily pill regimen as their treatment plan evolves. Automated Multi-Dose Prescription Fulfillment with Pharmacy Auto Load (PAL) Pillo Health's Pharmacy Auto Load, or PAL, is a pharmacy-filled consumable designed for seamless integration with Pillo devices. With PAL, pharmacies streamline their ability to fulfill multi-dose prescriptions by automatically filling, checking, and sealing the consumable tray in less time and with more accuracy than manual filling operations. The automation is available for both low-volume and high-volume pharmacies to drive higher efficiencies, allowing pharmacy teams to engage in deeper, more meaningful relationships with customers. Customizable Platform & Reporting Features 2-Way Video Calling Connect with your physically restricted or homebound patients through video calls CRM Integration Generate engagement for loyalty programs and centralize patient data & communication Ecommerce Push in-store coupons, product recommendations, and other retail information to drive commerce Prescription Management Schedule refill reminders to ensure continuity of adherence Auto-Ordering of Refills Trigger automatic refills for retail pickup or in-home delivery Adherence Data Capture actionable, closed-loop data on medication adherence & non-adherence events Care Plan Alerts Program Medication-Related Action Plans into Pillo to generate push notifications and reminders Pharmacist Care Portal Deliver proactive content and information-gathering prompts at scale across deployed Pillo devices Pharmacy Auto Load (PAL) Fill multi-dose pharmacy consumable tray through automation that integrate into Pillo If you are looking for new ways to engage with your customers, streamline multi-dose prescriptions, and get clarity into your patients' medication adherence habits, we'd love to hear from you. Pillo for Pharmacy Pillo for Pharmacy Achieve more meaningful relationships with your patients Pillo Health gives you continuous insight into your customers' entire medication regimens and empowers them to be a full participant in their own care through better understanding & use of their medications. Achieve more meaningful relationships with your patients Pillo Health gives you continuous insight into your customers' entire medication regimens and empowers them to be a full participant in their own care through better understanding & use of their medications. How Can Your Pharmacy Benefit from Pillo? Deliver Higher Customer Satisfaction With 2-way video calling, you're able to provide best-in class care regardless of patient location, while modernizing consultations and the brown bag review process Increase Revenues Pillo's secure cloud-based platform provides customizations aimed at increasing customer loyalty, enabling refills, and driving foot traffic in retail settings as well as online sales for your home-delivery model. Understand Patients' Adherence to Medications With visibility into adherence and non-adherence events, you're armed with information as to why patients aren't able to maintain their medication regimen. Capture Accurate Medication Adherence Data On average, users engage with Pillo 6 times throughout the day, capturing richer data sets about their medication adherence and lifestyles in order to deliver more reliable intel for PBM and provider partners. Streamline Medication Therapy Management Efforts Program Medication-Related Action Plans into Pillo for increased adherence, and simplify documentation of engagement data generated from Pillo's custom reporting. Fend Off the Competition Scalable fulfillment solutions fill, verify, and seal prescription packaging while also allowing users to modify their daily pill regimen as their treatment plan evolves. How Can Your Pharmacy Benefit from Pillo? Deliver Higher Customer Satisfaction With 2-way video calling, you're able to provide best-in class care regardless of patient location, while modernizing consultations and the brown bag review process Pillo's secure cloud-based platform provides customizations aimed at increasing customer loyalty, enabling refills, and driving foot traffic in retail settings as well as online sales for your home-delivery model. Understand Patients' Adherence to Medications With visibility into adherence and non-adherence events, you're armed with information as to why patients aren't able to maintain their medication regimen. Capture Accurate Medication Adherence Data On average, users engage with Pillo 6 times throughout the day, capturing richer data sets about their medication adherence and lifestyles in order to deliver more reliable intel for PBM and provider partners. Streamline Medication Therapy Management Efforts Program Medication-Related Action Plans into Pillo for increased adherence, and simplify documentation of engagement data generated from Pillo's custom reporting. Fend Off the Competition Scalable fulfillment solutions fill, verify, and seal prescription packaging while also allowing users to modify their daily pill regimen as their treatment plan evolves. Automated Multi-Dose Prescription Fulfillment with Pharmacy Auto Load (PAL) Pillo Health's Pharmacy Auto Load, or PAL, is a pharmacy-filled consumable designed for seamless integration with Pillo devices. With PAL, pharmacies streamline their ability to fulfill multi-dose prescriptions by automatically filling, checking, and sealing the consumable tray in less time and with more accuracy than manual filling operations. The automation is available for both low-volume and high-volume pharmacies to drive higher efficiencies, allowing pharmacy teams to engage in deeper, more meaningful relationships with customers. Automated Multi-Dose Prescription Fulfillment with Pharmacy Auto Load (PAL) Pillo Health's Pharmacy Auto Load, or PAL, is a pharmacy-filled consumable designed for seamless integration with Pillo devices. With PAL, pharmacies streamline their ability to fulfill multi-dose prescriptions by automatically filling, checking, and sealing the consumable tray in less time and with more accuracy than manual filling operations. The automation is available for both low-volume and high-volume pharmacies to drive higher efficiencies, allowing pharmacy teams to engage in deeper, more meaningful relationships with customers. Customizable Platform & Reporting Features 2-Way Video Calling Connect with your physically restricted or homebound patients through video calls CRM Integration Generate engagement for loyalty programs and centralize patient data & communication Ecommerce Push in-store coupons, product recommendations, and other retail information to drive commerce Prescription Management Schedule refill reminders to ensure continuity of adherence Auto-Ordering of Refills Trigger automatic refills for retail pickup or in-home delivery Adherence Data Capture actionable, closed-loop data on medication adherence & non-adherence events Care Plan Alerts Program Medication-Related Action Plans into Pillo to generate push notifications and reminders Pharmacist Care Portal Deliver proactive content and information-gathering prompts at scale across deployed Pillo devices Pharmacy Auto Load (PAL) Fill multi-dose pharmacy consumable tray through automation that integrate into Pillo Customizable Platform & Reporting Features Connect with your physically restricted or homebound patients through video calls Generate engagement for loyalty programs and centralize patient data & communication Push in-store coupons, product recommendations, and other retail information to drive commerce Schedule refill reminders to ensure continuity of adherence Trigger automatic refills for retail pickup or in-home delivery Capture actionable, closed-loop data on medication adherence & non-adherence events Program Medication-Related Action Plans into Pillo to generate push notifications and reminders Deliver proactive content and information-gathering prompts at scale across deployed Pillo devices Pharmacy Auto Load (PAL) Fill multi-dose pharmacy consumable tray through automation that integrate into Pillo If you are looking for new ways to engage with your customers, streamline multi-dose prescriptions, and get clarity into your patients' medication adherence habits, we'd love to hear from you. If you are looking for new ways to engage with your customers, streamline multi-dose prescriptions, and get clarity into your patients' medication adherence habits, we'd love to hear from you.",
    "Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Designed for your Customers' Needs. Only with Pillo Health's voice-first, HIPAA compliant platform can businesses create a continuous in-home engagement model. Pillo, our proactive, smart, and secure 'someone,' makes your customers' health and wellbeing your business. Explore our Platform Remote Health Remote patient monitoring and telemedicine programs can allow care teams to remotely track the health of their patients at home, collaborate with the patients' doctors and family, and detect problems before they lead to readmissions See More . Pharmacy Pillo Health provides unprecedented access to assist patients at home. By improving medication adherence and reducing medication-related complications, our platform helps increase patient satisfaction Consumer Devices Our proactive smart home device blends seamlessly into daily life, allowing businesses to connect to customers in a whole new way. The voice-first digital companion can also augment and interact with existing 'smart' products Personal Care Develop long-lasting consumer relationships by communicating with them at home. We provide a 'grow with us' digital health companion for the whole family, from prenatal needs to caring for aging loved ones Our Partners say The team's passion for the mission was palpable. That combined with their impressive knowledge of the healthcare space and impeccable attention to detail made the experience seamless. We are proud of the relationship, and of our new product called Pria! Sean O'Brien Director, Health@Home Technologies Stanley Black & Decker Read the Case Study Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Pillo Health is Your Health and Wellness Partner in the Home Designed for your Customers' Needs. Only with Pillo Health's voice-first, HIPAA compliant platform can businesses create a continuous in-home engagement model. Pillo, our proactive, smart, and secure 'someone,' makes your customers' health and wellbeing your business. Explore our Platform Designed for your Customers' Needs. Only with Pillo Health's voice-first, HIPAA compliant platform can businesses create a continuous in-home engagement model. Pillo, our proactive, smart, and secure 'someone,' makes your customers' health and wellbeing your business. Remote Health Remote patient monitoring and telemedicine programs can allow care teams to remotely track the health of their patients at home, collaborate with the patients' doctors and family, and detect problems before they lead to readmissions See More . Pharmacy Pillo Health provides unprecedented access to assist patients at home. By improving medication adherence and reducing medication-related complications, our platform helps increase patient satisfaction Consumer Devices Our proactive smart home device blends seamlessly into daily life, allowing businesses to connect to customers in a whole new way. The voice-first digital companion can also augment and interact with existing 'smart' products Personal Care Develop long-lasting consumer relationships by communicating with them at home. We provide a 'grow with us' digital health companion for the whole family, from prenatal needs to caring for aging loved ones Remote patient monitoring and telemedicine programs can allow care teams to remotely track the health of their patients at home, collaborate with the patients' doctors and family, and detect problems before they lead to readmissions See More . Pillo Health provides unprecedented access to assist patients at home. By improving medication adherence and reducing medication-related complications, our platform helps increase patient satisfaction Our proactive smart home device blends seamlessly into daily life, allowing businesses to connect to customers in a whole new way. The voice-first digital companion can also augment and interact with existing 'smart' products Develop long-lasting consumer relationships by communicating with them at home. We provide a 'grow with us' digital health companion for the whole family, from prenatal needs to caring for aging loved ones Our Partners say The team's passion for the mission was palpable. That combined with their impressive knowledge of the healthcare space and impeccable attention to detail made the experience seamless. We are proud of the relationship, and of our new product called Pria! Sean O'Brien Director, Health@Home Technologies Stanley Black & Decker Read the Case Study Stanley Black & Decker",
    "Pillo for Remote Health Pillo for Remote Health Closing the Loop on Medication Management Pillo Health offers healthcare partners a new way to engage populations with chronic conditions, an enhanced digital connectivity portfolio, and improved revenue metrics in value-based and at-risk healthcare environments. Pillo closes the loop on medication management by providing accurate and reliable visibility into medication adherence and its relation to other clinical data from integrated devices. A Secure & Engaging Addition to the Remote Health Ecosystem Patients who use Pillo adhere to their medication regimens up to 88% of the time and interact with Pillo upwards of 6+ times per day. Healthcare professionals can capitalize on this important touchpoint to generate more consistent and observable engagement with connected devices and health surveys - the billable activity that generates revenue. Generate revenue through increased billable activity and virtual visits Generate a continuous stream of real-time medication adherence and lifestyle data Increase engagement with clinical surveys and care plans Improve patient outcomes and reduce hospital readmissions Proactively Capture Key Medication Adherence & Lifestyle Data from Patients Highly configurable RPM Integrations for in-home connected medical devices to sync and report health data Proactive reminders promote adherence to complex medication regimens and provider-directed care plans Voice-first technology delivered through natural language processing and is trained to recognize the primary user's voice Surveys automate intake of patient information & habits for streamlined reporting Device Integrations & Customizations Using a combination of adaptive AI and secure, cloud-based integrations, the technology platform that powers Pillo comes in highly versatile configurations. For RPM, device data is collected and passed from devices to Pillo as well as the host RPM platform or Pillo Health's Remotely portal. Telemedicine Integration with existing telemedicine services to connect users with healthcare professionals through 2-way video calls Device Integrations Streamline syncing with wireless scales, pulse oximeters, bluetooth thermometers, and dozens of other connected devices Customization Access to private SDK to create and customize patient experiences RPM Platform Integration Bi-directional integration with your existing RPM dashboard and EHR Socially Connected Health Connection to loved ones and care partners with the ability to check in through alerts and video calls Provider Care Portal Pillo Remotely web portal to control, monitor, and interact with deployed devices Security Permission-based drop-ins from emergency providers through PERS alert Medication Management Refill prompts and provider notifications for non-adherence events Improve the Quality and Safety of Healthcare at Home Including Pillo in your product portfolio enables providers to decrease readmissions and unnecessary hospitalizations, while enhancing the patient experience, improving population health, and reducing the per capita cost of health care. Pillo for Remote Health Pillo for Remote Health Pillo for Remote Health Pillo for Remote Health Pillo for Remote Health Closing the Loop on Medication Management Pillo Health offers healthcare partners a new way to engage populations with chronic conditions, an enhanced digital connectivity portfolio, and improved revenue metrics in value-based and at-risk healthcare environments. Pillo closes the loop on medication management by providing accurate and reliable visibility into medication adherence and its relation to other clinical data from integrated devices. Closing the Loop on Medication Management Pillo Health offers healthcare partners a new way to engage populations with chronic conditions, an enhanced digital connectivity portfolio, and improved revenue metrics in value-based and at-risk healthcare environments. Pillo closes the loop on medication management by providing accurate and reliable visibility into medication adherence and its relation to other clinical data from integrated devices. A Secure & Engaging Addition to the Remote Health Ecosystem Patients who use Pillo adhere to their medication regimens up to 88% of the time and interact with Pillo upwards of 6+ times per day. Healthcare professionals can capitalize on this important touchpoint to generate more consistent and observable engagement with connected devices and health surveys - the billable activity that generates revenue. Generate revenue through increased billable activity and virtual visits Generate a continuous stream of real-time medication adherence and lifestyle data Increase engagement with clinical surveys and care plans Improve patient outcomes and reduce hospital readmissions A Secure & Engaging Addition to the Remote Health Ecosystem Patients who use Pillo adhere to their medication regimens up to 88% of the time and interact with Pillo upwards of 6+ times per day. Healthcare professionals can capitalize on this important touchpoint to generate more consistent and observable engagement with connected devices and health surveys - the billable activity that generates revenue. Generate revenue through increased billable activity and virtual visits Generate a continuous stream of real-time medication adherence and lifestyle data Increase engagement with clinical surveys and care plans Improve patient outcomes and reduce hospital readmissions Proactively Capture Key Medication Adherence & Lifestyle Data from Patients Highly configurable RPM Integrations for in-home connected medical devices to sync and report health data Proactive reminders promote adherence to complex medication regimens and provider-directed care plans Voice-first technology delivered through natural language processing and is trained to recognize the primary user's voice Surveys automate intake of patient information & habits for streamlined reporting Proactively Capture Key Medication Adherence & Lifestyle Data from Patients Highly configurable RPM Integrations for in-home connected medical devices to sync and report health data Proactive reminders promote adherence to complex medication regimens and provider-directed care plans Voice-first technology delivered through natural language processing and is trained to recognize the primary user's voice Surveys automate intake of patient information & habits for streamlined reporting Device Integrations & Customizations Using a combination of adaptive AI and secure, cloud-based integrations, the technology platform that powers Pillo comes in highly versatile configurations. For RPM, device data is collected and passed from devices to Pillo as well as the host RPM platform or Pillo Health's Remotely portal. Telemedicine Integration with existing telemedicine services to connect users with healthcare professionals through 2-way video calls Device Integrations Streamline syncing with wireless scales, pulse oximeters, bluetooth thermometers, and dozens of other connected devices Customization Access to private SDK to create and customize patient experiences RPM Platform Integration Bi-directional integration with your existing RPM dashboard and EHR Socially Connected Health Connection to loved ones and care partners with the ability to check in through alerts and video calls Provider Care Portal Pillo Remotely web portal to control, monitor, and interact with deployed devices Security Permission-based drop-ins from emergency providers through PERS alert Medication Management Refill prompts and provider notifications for non-adherence events Device Integrations & Customizations Using a combination of adaptive AI and secure, cloud-based integrations, the technology platform that powers Pillo comes in highly versatile configurations. For RPM, device data is collected and passed from devices to Pillo as well as the host RPM platform or Pillo Health's Remotely portal. Integration with existing telemedicine services to connect users with healthcare professionals through 2-way video calls Streamline syncing with wireless scales, pulse oximeters, bluetooth thermometers, and dozens of other connected devices Access to private SDK to create and customize patient experiences Bi-directional integration with your existing RPM dashboard and EHR Connection to loved ones and care partners with the ability to check in through alerts and video calls Pillo Remotely web portal to control, monitor, and interact with deployed devices Permission-based drop-ins from emergency providers through PERS alert Refill prompts and provider notifications for non-adherence events Improve the Quality and Safety of Healthcare at Home Including Pillo in your product portfolio enables providers to decrease readmissions and unnecessary hospitalizations, while enhancing the patient experience, improving population health, and reducing the per capita cost of health care. Improve the Quality and Safety of Healthcare at Home Including Pillo in your product portfolio enables providers to decrease readmissions and unnecessary hospitalizations, while enhancing the patient experience, improving population health, and reducing the per capita cost of health care."
  ]
}