{
  "company": "preciate.me",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "Innovative technology Our proprietary facial recognition system was designed and built by Israel's top cyber security experts. 99.8% accuracy, No human errors All calculation is done in the cloud, no expensive hardware is needed on-site Prevention of fraudulent entrance using a picture instead of a real person Advance fraud detection of forged documents It takes less than a second to verify each person Safe, Private & Secured In order to comply with the strictest , the system does not keep any personal information. Immediately after registration, all personal information is deleted and only a mathematical vector is kept. Â The user's privacy is fully kept. We don't know who you are or where you're at. We can only verify that you have a valid COVID-19 vaccine The user's information is completely safe. It is all deleted immediately upon registration, all we keep is a vector that represents the user's face Innovative technology Our proprietary facial recognition system was designed and built by Israel's top cyber security experts. 99.8% accuracy, No human errors All calculation is done in the cloud, no expensive hardware is needed on-site Prevention of fraudulent entrance using a picture instead of a real person Advance fraud detection of forged documents It takes less than a second to verify each person Safe, Private & Secured In order to comply with the strictest , the system does not keep any personal information. Immediately after registration, all personal information is deleted and only a mathematical vector is kept. Innovative technology Our proprietary facial recognition system was designed and built by Israel's top cyber security experts. Our proprietary facial recognition system was designed and built by Israel's top cyber security experts. 99.8% accuracy, No human errors All calculation is done in the cloud, no expensive hardware is needed on-site Prevention of fraudulent entrance using a picture instead of a real person Advance fraud detection of forged documents It takes less than a second to verify each person 99.8% accuracy, No human errors All calculation is done in the cloud, no expensive hardware is needed on-site Prevention of fraudulent entrance using a picture instead of a real person Advance fraud detection of forged documents It takes less than a second to verify each person Safe, Private & Secured In order to comply with the strictest , the system does not keep any personal information. Immediately after registration, all personal information is deleted and only a mathematical vector is kept. Safe, Private & Secured In order to comply with the strictest , the system does not keep any personal information. Immediately after registration, all personal information is deleted and only a mathematical vector is kept. The user's privacy is fully kept. We don't know who you are or where you're at. We can only verify that you have a valid COVID-19 vaccine The user's information is completely safe. It is all deleted immediately upon registration, all we keep is a vector that represents the user's face The user's privacy is fully kept. We don't know who you are or where you're at. We can only verify that you have a valid COVID-19 vaccine The user's information is completely safe. It is all deleted immediately upon registration, all we keep is a vector that represents the user's face",
    "About Us Who we are Preciate offers the ultimate customer recognition and personalization solutions: Our tools are built for a wide range of retail and hospitality verticals: stadiums, theaters, Apparel, QSRs, coffee shops, grocery stores, cosmetics, hotels and more. ​ We are a team of cybersecurity experts developing state-of-the-art facial recognition and personalization technology for retail, hotels, and hospitality. Our technology empowers businesses to provide their customers with an outstanding, personalized, and seamless experience. Our Founders Avi Naor Co-Founder & Chairman AS ONE OF THE PIONEERS OF THE ISRAELI HIGH-TECH INDUSTRY, BUSINESS AND SOCIAL ENTREPRENEUR AVI NAOR WAS THE FOUNDER OF AMDOCS (NASDAQ: DOX), A $9B MARKET CAP COMPANY WHERE HE SERVED AS PRESIDENT AND CEO BETWEEN 1995 AND 2002. SINCE THEN, HE HAS SERVED AS BOARD CHAIRMAN AND BOARD MEMBER OF A NUMBER OF ISRAELI-BASED COMPANIES. AVI IS PASSIONATE ABOUT HELPING \"BRICK AND MORTAR†RETAILERS CONNECT WITH CUSTOMERS IN RICHER, MORE PERSONAL SHOPPING EXPERIENCES. Eyal Fisher Co-Founder & CEO EYAL IS A VETERAN TECHNOLOGY PROFESSIONAL WITH OVER 20 YEARS OF EXPERIENCE IN R&D AND CYBER TECHNOLOGY IN THE ISRAEL DEFENSE FORCES (IDF). HIS LAST POSITION WAS THE HEAD OF THE CYBER DIVISION UNIT AT THE RENOWNED UNIT 8200, AT THE RANK OF COLONEL. EYAL IS A RECIPIENT OF THE PRESTIGIOUS ISRAEL DEFENSE PRIZE AND HOLDS AN M.SC. AND B.SC. WITH HONORS IN ELECTRONICS ENGINEERING FROM THE TEL AVIV UNIVERSITY. EYAL IS COMMITTED TO BRINGING THE HIGHEST LEVELS OF PRIVACY AND SECURITY TO RETAIL SYSTEMS IN ORDER TO ENABLE THE TRANSITION TO NEXT-GENERATION OMNI-CHANNEL RETAIL Meet The Team Prof. Bruce Philips Strategy & Corporate Development LinkedIn Moshe Shefer CFO LinkedIn Oded Menachem Operation & Sales LinkedIn Eyal Shtrauch Chief Architect LinkedIn Aviv Peled Algo LinkedIn Omri Landman Product LinkedIn Michael Davidovich Software LinkedIn Avi Din Software LinkedIn Talor Mishani Customer Support LinkedIn \"This is the Future. Let us take you there\" Who we are Preciate offers the ultimate customer recognition and personalization solutions: Our tools are built for a wide range of retail and hospitality verticals: stadiums, theaters, Apparel, QSRs, coffee shops, grocery stores, cosmetics, hotels and more. ​ We are a team of cybersecurity experts developing state-of-the-art facial recognition and personalization technology for retail, hotels, and hospitality. Our technology empowers businesses to provide their customers with an outstanding, personalized, and seamless experience. Who we are Preciate offers the ultimate customer recognition and personalization solutions: Our tools are built for a wide range of retail and hospitality verticals: stadiums, theaters, Apparel, QSRs, coffee shops, grocery stores, cosmetics, hotels and more. ​ We are a team of cybersecurity experts developing state-of-the-art facial recognition and personalization technology for retail, hotels, and hospitality. Our technology empowers businesses to provide their customers with an outstanding, personalized, and seamless experience. Preciate offers the ultimate customer recognition and personalization solutions: Our tools are built for a wide range of retail and hospitality verticals: stadiums, theaters, Apparel, QSRs, coffee shops, grocery stores, cosmetics, hotels and more. We are a team of cybersecurity experts developing state-of-the-art facial recognition and personalization technology for retail, hotels, and hospitality. Our technology empowers businesses to provide their customers with an outstanding, personalized, and seamless experience. Our Founders Avi Naor Co-Founder & Chairman AS ONE OF THE PIONEERS OF THE ISRAELI HIGH-TECH INDUSTRY, BUSINESS AND SOCIAL ENTREPRENEUR AVI NAOR WAS THE FOUNDER OF AMDOCS (NASDAQ: DOX), A $9B MARKET CAP COMPANY WHERE HE SERVED AS PRESIDENT AND CEO BETWEEN 1995 AND 2002. SINCE THEN, HE HAS SERVED AS BOARD CHAIRMAN AND BOARD MEMBER OF A NUMBER OF ISRAELI-BASED COMPANIES. AVI IS PASSIONATE ABOUT HELPING \"BRICK AND MORTAR†RETAILERS CONNECT WITH CUSTOMERS IN RICHER, MORE PERSONAL SHOPPING EXPERIENCES. Eyal Fisher Co-Founder & CEO EYAL IS A VETERAN TECHNOLOGY PROFESSIONAL WITH OVER 20 YEARS OF EXPERIENCE IN R&D AND CYBER TECHNOLOGY IN THE ISRAEL DEFENSE FORCES (IDF). HIS LAST POSITION WAS THE HEAD OF THE CYBER DIVISION UNIT AT THE RENOWNED UNIT 8200, AT THE RANK OF COLONEL. EYAL IS A RECIPIENT OF THE PRESTIGIOUS ISRAEL DEFENSE PRIZE AND HOLDS AN M.SC. AND B.SC. WITH HONORS IN ELECTRONICS ENGINEERING FROM THE TEL AVIV UNIVERSITY. EYAL IS COMMITTED TO BRINGING THE HIGHEST LEVELS OF PRIVACY AND SECURITY TO RETAIL SYSTEMS IN ORDER TO ENABLE THE TRANSITION TO NEXT-GENERATION OMNI-CHANNEL RETAIL Avi Naor Co-Founder & Chairman AS ONE OF THE PIONEERS OF THE ISRAELI HIGH-TECH INDUSTRY, BUSINESS AND SOCIAL ENTREPRENEUR AVI NAOR WAS THE FOUNDER OF AMDOCS (NASDAQ: DOX), A $9B MARKET CAP COMPANY WHERE HE SERVED AS PRESIDENT AND CEO BETWEEN 1995 AND 2002. SINCE THEN, HE HAS SERVED AS BOARD CHAIRMAN AND BOARD MEMBER OF A NUMBER OF ISRAELI-BASED COMPANIES. AVI IS PASSIONATE ABOUT HELPING \"BRICK AND MORTAR†RETAILERS CONNECT WITH CUSTOMERS IN RICHER, MORE PERSONAL SHOPPING EXPERIENCES. Eyal Fisher Co-Founder & CEO EYAL IS A VETERAN TECHNOLOGY PROFESSIONAL WITH OVER 20 YEARS OF EXPERIENCE IN R&D AND CYBER TECHNOLOGY IN THE ISRAEL DEFENSE FORCES (IDF). HIS LAST POSITION WAS THE HEAD OF THE CYBER DIVISION UNIT AT THE RENOWNED UNIT 8200, AT THE RANK OF COLONEL. EYAL IS A RECIPIENT OF THE PRESTIGIOUS ISRAEL DEFENSE PRIZE AND HOLDS AN M.SC. AND B.SC. WITH HONORS IN ELECTRONICS ENGINEERING FROM THE TEL AVIV UNIVERSITY. EYAL IS COMMITTED TO BRINGING THE HIGHEST LEVELS OF PRIVACY AND SECURITY TO RETAIL SYSTEMS IN ORDER TO ENABLE THE TRANSITION TO NEXT-GENERATION OMNI-CHANNEL RETAIL AS ONE OF THE PIONEERS OF THE ISRAELI HIGH-TECH INDUSTRY, BUSINESS AND SOCIAL ENTREPRENEUR AVI NAOR WAS THE FOUNDER OF AMDOCS (NASDAQ: DOX), A $9B MARKET CAP COMPANY WHERE HE SERVED AS PRESIDENT AND CEO BETWEEN 1995 AND 2002. SINCE THEN, HE HAS SERVED AS BOARD CHAIRMAN AND BOARD MEMBER OF A NUMBER OF ISRAELI-BASED COMPANIES. AVI IS PASSIONATE ABOUT HELPING \"BRICK AND MORTAR†RETAILERS CONNECT WITH CUSTOMERS IN RICHER, MORE PERSONAL SHOPPING EXPERIENCES. EYAL IS A VETERAN TECHNOLOGY PROFESSIONAL WITH OVER 20 YEARS OF EXPERIENCE IN R&D AND CYBER TECHNOLOGY IN THE ISRAEL DEFENSE FORCES (IDF). HIS LAST POSITION WAS THE HEAD OF THE CYBER DIVISION UNIT AT THE RENOWNED UNIT 8200, AT THE RANK OF COLONEL. EYAL IS A RECIPIENT OF THE PRESTIGIOUS ISRAEL DEFENSE PRIZE AND HOLDS AN M.SC. AND B.SC. WITH HONORS IN ELECTRONICS ENGINEERING FROM THE TEL AVIV UNIVERSITY. EYAL IS COMMITTED TO BRINGING THE HIGHEST LEVELS OF PRIVACY AND SECURITY TO RETAIL SYSTEMS IN ORDER TO ENABLE THE TRANSITION TO NEXT-GENERATION OMNI-CHANNEL RETAIL Meet The Team Prof. Bruce Philips Strategy & Corporate Development LinkedIn Moshe Shefer CFO LinkedIn Oded Menachem Operation & Sales LinkedIn Eyal Shtrauch Chief Architect LinkedIn Aviv Peled Algo LinkedIn Omri Landman Product LinkedIn Michael Davidovich Software LinkedIn Avi Din Software LinkedIn Talor Mishani Customer Support LinkedIn Prof. Bruce Philips Strategy & Corporate Development LinkedIn Moshe Shefer CFO LinkedIn Strategy & Corporate Development Oded Menachem Operation & Sales LinkedIn Eyal Shtrauch Chief Architect LinkedIn Aviv Peled Algo LinkedIn Omri Landman Product LinkedIn Michael Davidovich Software LinkedIn Avi Din Software LinkedIn Talor Mishani Customer Support LinkedIn \"This is the Future. Let us take you there\" \"This is the Future. Let us take you there\"",
    "Solutions Preciate Pass Preciate pass allows immediate verification and validation of vaccinated individuals. It only requires a short registration by the users and a tablet.Users' privacy is fully kept, and no lines are formed. 1 Quick Enrollment 2 Automatic certifications validation 3 Fast on-site verification We developed a cloud-based system that automatically detect, analyze and compare documents and photos of live individuals. 1 Annual Growth 2 The user has a valid vaccination certification Preciate Pay-by-Face Download PDF Preciate Clienteling Our proprietary facial recognition system is designed specifically for retail and hospitality. Consumers opt-in and enroll with a simple selfie photo. Download PDF Button Solutions Preciate Pass Preciate pass allows immediate verification and validation of vaccinated individuals. It only requires a short registration by the users and a tablet.Users' privacy is fully kept, and no lines are formed. Preciate Pass Preciate pass allows immediate verification and validation of vaccinated individuals. It only requires a short registration by the users and a tablet.Users' privacy is fully kept, and no lines are formed. Preciate pass allows immediate verification and validation of vaccinated individuals. It only requires a short registration by the users and a tablet.Users' privacy is fully kept, and no lines are formed. 1 Quick Enrollment 2 Automatic certifications validation 3 Fast on-site verification 1 Quick Enrollment 2 Automatic certifications validation 3 Fast on-site verification We developed a cloud-based system that automatically detect, analyze and compare documents and photos of live individuals. 1 Annual Growth 2 The user has a valid vaccination certification We developed a cloud-based system that automatically detect, analyze and compare documents and photos of live individuals. 1 Annual Growth 2 The user has a valid vaccination certification The user has a valid vaccination certification Preciate Pay-by-Face Download PDF Preciate Pay-by-Face Download PDF Preciate Clienteling Our proprietary facial recognition system is designed specifically for retail and hospitality. Consumers opt-in and enroll with a simple selfie photo. Download PDF Button Preciate Clienteling Our proprietary facial recognition system is designed specifically for retail and hospitality. Consumers opt-in and enroll with a simple selfie photo. Download PDF Our proprietary facial recognition system is designed specifically for retail and hospitality. Consumers opt-in and enroll with a simple selfie photo."
  ]
}