{
  "company": "privateid.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 1,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1
    }
  },
  "sample_docs": [
    "Fast, convenient & passwordless Biometric MFA on all browsers, platforms and devices keeps your employees, customers and data safe. Users securely and privately authenticate using face recognition, speaker identification and fingerprint identification with active liveness. Overview Identity is the keystone of security. Seamlessly eliminate usernames and passwords and protect your accounts across all browsers, platforms and devices using Private Identity's massively scalable biometric identification & authentication solution. Users authenticate in real time (200ms) with high accuracy (IR=99.78%) and global privacy compliance using facial recognition, voice (speaker identification), fingerprint identification and passive & active liveness. It is easy to get started with built-in Enterprise directory integrations, full compliance with open standards, no upfront costs, no hardware to buy and no software to install. Identity Without PII Private Identity provides biometric identification and authentication without requesting or storing usernames, passwords, email addresses, tokens or shared secrets, any personal identifiable information (PII) or any other information that could be used to trace the identity of a person. About Private Biometrics GDPR, CCPA & BIPA Private Identity is the only biometric security solution to fully protect individual privacy and comply with global data privacy laws by encrypting all biometrics at rest, in transit and in use with one-way fully homomorphic encryption as specified by IEEE 2410-2019. We process encrypted face, voice, fingerprint and active liveness (private biometric) inputs with high accuracy (IR=99.78%) at the edge and return identity in 200ms constant time. To accomplish this, we use two DNNs that work hand-in-hand to encrypt and classify each biometric. The first DNN is a small lightweight TensorFlow model that runs on the device. The second DNN accurately classifies an unlimited number of identities (classes) in parallel using fault-tolerant, elastic Kubernetesâ\"¢ container(s). About IEEE 2410 About private Biometrics Enterprise-Grade Microservices Architecture Our microservices architecture is composed of three lightweight, elastic Kubernetesâ\"¢ building blocks (enroll, predict and liveness) that communicate using RESTful APIs. These independent services provide resilience and scalability, enable customers to go to market faster and easily integrate and deploy with legacy and third-party services. Private Identity also supports full Enterprise directory integration using OAuth 2.0/OIDC and SAML 2.0. Start small and scale up to billions of customers without human intervention-- even during peak usage. About Microservice Edge Computing Private Identity encrypts biometrics on the browser or device using TensorFlowâ\"¢ on-device pre-trained models. Computing homomorphic encryption at the edge assures full data privacy and confidentiality by never transmitting a plaintext biometric, reduces data flows to the cloud by 99.95%, achieves massive horizontal scalability and allows users to authenticate even when devices cannot reliably connect to a network. about TensorFlow.js Open Standards We provide industry leadership in the development of open standards for biometric privacy, cryptography and security. We partner with trusted security firms to perform full-scope assessments, penetration tests, reviews, audits and IEEE 2410, ISO 27000 & ISO 9000 certifications. Our commitment to open standards helps foster innovation and competition and reduce cost and complexity. Fast, convenient & passwordless Biometric MFA on all browsers, platforms and devices keeps your employees, customers and data safe. Users securely and privately authenticate using face recognition, speaker identification and fingerprint identification with active liveness. Identity is the keystone of security. Seamlessly eliminate usernames and passwords and protect your accounts across all browsers, platforms and devices using Private Identity's massively scalable biometric identification & authentication solution. Users authenticate in real time (200ms) with high accuracy (IR=99.78%) and global privacy compliance using facial recognition, voice (speaker identification), fingerprint identification and passive & active liveness. It is easy to get started with built-in Enterprise directory integrations, full compliance with open standards, no upfront costs, no hardware to buy and no software to install. Private Identity provides biometric identification and authentication without requesting or storing usernames, passwords, email addresses, tokens or shared secrets, any personal identifiable information (PII) or any other information that could be used to trace the identity of a person. GDPR, CCPA & BIPA Private Identity is the only biometric security solution to fully protect individual privacy and comply with global data privacy laws by encrypting all biometrics at rest, in transit and in use with one-way fully homomorphic encryption as specified by IEEE 2410-2019. We process encrypted face, voice, fingerprint and active liveness (private biometric) inputs with high accuracy (IR=99.78%) at the edge and return identity in 200ms constant time. To accomplish this, we use two DNNs that work hand-in-hand to encrypt and classify each biometric. The first DNN is a small lightweight TensorFlow model that runs on the device. The second DNN accurately classifies an unlimited number of identities (classes) in parallel using fault-tolerant, elastic Kubernetesâ\"¢ container(s). Our microservices architecture is composed of three lightweight, elastic Kubernetesâ\"¢ building blocks (enroll, predict and liveness) that communicate using RESTful APIs. These independent services provide resilience and scalability, enable customers to go to market faster and easily integrate and deploy with legacy and third-party services. Private Identity also supports full Enterprise directory integration using OAuth 2.0/OIDC and SAML 2.0. Start small and scale up to billions of customers without human intervention-- even during peak usage. Private Identity encrypts biometrics on the browser or device using TensorFlowâ\"¢ on-device pre-trained models. Computing homomorphic encryption at the edge assures full data privacy and confidentiality by never transmitting a plaintext biometric, reduces data flows to the cloud by 99.95%, achieves massive horizontal scalability and allows users to authenticate even when devices cannot reliably connect to a network. We provide industry leadership in the development of open standards for biometric privacy, cryptography and security. We partner with trusted security firms to perform full-scope assessments, penetration tests, reviews, audits and IEEE 2410, ISO 27000 & ISO 9000 certifications. Our commitment to open standards helps foster innovation and competition and reduce cost and complexity. Encryption Standards IEEE 2410-2019 Standard for Biometric Open Protocol Standard requires use of 1-way fully homomorphic encryption to protect biometrics at rest, in transit and in use. US DOD Standard Trusted Computer System Evaluation Criteria (TCSEC) DoD 5200.28-STD. Mandatory for use by all DoD Components in carrying out technical security evaluation activities applicable to the processing and storage of classified and other sensitive DoD information Orange Book. US ODNI Intelligence Community Directive 503 Protecting Sensitive Compartmented Information Within Information Systems. Applies to all US government organizations, their commercial contractors, and Allied governments information systems that process, store, or communicate intelligence information. Federal Information Processing Standard (FIPS) 197, Advanced Encryption Standard (AES) NIST Special Publication 800-21. Guideline for Implementing Cryptography in the Federal Government. TLS / IPSEC / SSL Standard protocols to provide privacy and data integrity between two or more communicating computer applications. IEEE 2410-2019 Standard for Biometric Open Protocol Standard requires use of 1-way fully homomorphic encryption to protect biometrics at rest, in transit and in use. US DOD Standard Trusted Computer System Evaluation Criteria (TCSEC) DoD 5200.28-STD. Mandatory for use by all DoD Components in carrying out technical security evaluation activities applicable to the processing and storage of classified and other sensitive DoD information Orange Book. US ODNI Intelligence Community Directive 503 Protecting Sensitive Compartmented Information Within Information Systems. Applies to all US government organizations, their commercial contractors, and Allied governments information systems that process, store, or communicate intelligence information. Federal Information Processing Standard (FIPS) 197, Advanced Encryption Standard (AES) NIST Special Publication 800-21. Guideline for Implementing Cryptography in the Federal Government. TLS / IPSEC / SSL Standard protocols to provide privacy and data integrity between two or more communicating computer applications. Security- And Safety-Critical Architecture / Standards DoD Multiple Independent Levels of Security/Safety (MILS) Architecture Compartmentalized approach to the design of security-critical, safety-critical, high-assurance computing systems ISO 27001:2013 Information Security Management Standard Framework includes all legal, physical and technical controls involved in the information risk management processes. ISO 9001:2015 Quality Management Standard Standard ensures software meets the needs of customers, other stakeholders and satisfy statutory and regulatory requirements. OAuth 2.0 / Open ID Connect / SAML 2.0 Standards that cover authorization, federation, identity management and single sign-on (SSO). Security- And Safety-Critical Architecture / Standards DoD Multiple Independent Levels of Security/Safety (MILS) Architecture Compartmentalized approach to the design of security-critical, safety-critical, high-assurance computing systems ISO 27001:2013 Information Security Management Standard Framework includes all legal, physical and technical controls involved in the information risk management processes. ISO 9001:2015 Quality Management Standard Standard ensures software meets the needs of customers, other stakeholders and satisfy statutory and regulatory requirements. OAuth 2.0 / Open ID Connect / SAML 2.0 Standards that cover authorization, federation, identity management and single sign-on (SSO). Features Protects User Accounts From Fraud Biometric MFA protects against data breaches, eliminates password resets and greatly reduces the risk of account takeover fraud, phishing, credential reuse and credential stuffing. Passwordless Biometric MFA on Any Device Provides a consistent customer and employee identification and authentication experience across all modern browsers, devices, platforms and channels without hardware to buy or software to install. Enroll once and authenticate everywhere. Allows multiple users per device and multiple devices per user. Get Employees Up and Running in Minutes Compatible with Google Cloud Identity, Azure AD, AWS Identity and Access Management (IAM), Ping Identity, Okta,OneLogin, ForgeRock and thousands of other SaaS platforms using OAuth 2.0/OIDC and SAML 2.0. Face Recognition Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's face with 99.78% accuracy in 200ms. Webcams and phones work well. Minimum face resolution is 224x224 pixels and the DNN accommodates most boundary conditions including low light and blurry images. Speaker Identification Enroll an unlimited number of users. Use encrypted match to determine the identify an unknown user's voice with 98.70% accuracy in 600ms. Webcams and phones work well. Requires minimum of 3 seconds of 8.1kHz stereo telephone quality audio. The DNN accommodates most boundary conditions including low quality audio and background noise. Fingerprint Identification Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's fingerprints with 99.9% accuracy in 200ms. Webcams and phones work well. Minimum fingerprint resolution is 224x224 pixels. The algorithm accommodates most boundary conditions including low light and blurry images. Private User Behavioral Analytics Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's behavior with 99.9% accuracy in 200ms. Webcams, phones and watches work well. Behavior data includes 70+ encrypted data points including geolocation, temperature, accelerometer, health monitoring, gyroscope and magnetometer. Passive & Active Liveness Ensure that biometrics are only collected from a live human user. Passive liveness includes small muscle movement analysis of eyes, eyebrowses, lips and chin. Active liveness requires the user read out loud a random sentence and then assures that the user spoke the requested words and the user's voice identity matches the user's face identity. High Availability SLA Have confidence in the availability of Private Identity knowing that the service runs in elastic, fault-tolerant Kubernetes containers on public or private Clouds. We guarantee 99.9% uptime and maintain compliance with international standards and government requirements for privacy, encryption and security. Multi-Regional Infrastructure Deploy Private Identity in a specific region or globally using low-latency Cloud infrastructure. Expand the service to additional regions as needed. Private Identity is multilingual and built to serve global audiences. Automatic Updates Private Identity automatically updates itself, monitors for issues, adds and removes Kubernetes cubes as user demand changes, and instantly replace cubes that fail. Accuracy, Scalability & Performance Users easily enroll on any device and then immediately authenticate across all platforms and devices. Private Identity is scalable, elastic and built to serve global audiences. Delivers massive horizontal scalability and real-time performance using edge computing, CPUs, GPUs and Edge TPUs. View More View Less Protects User Accounts From Fraud Biometric MFA protects against data breaches, eliminates password resets and greatly reduces the risk of account takeover fraud, phishing, credential reuse and credential stuffing. Passwordless Biometric MFA on Any Device Provides a consistent customer and employee identification and authentication experience across all modern browsers, devices, platforms and channels without hardware to buy or software to install. Enroll once and authenticate everywhere. Allows multiple users per device and multiple devices per user. Get Employees Up and Running in Minutes Compatible with Google Cloud Identity, Azure AD, AWS Identity and Access Management (IAM), Ping Identity, Okta,OneLogin, ForgeRock and thousands of other SaaS platforms using OAuth 2.0/OIDC and SAML 2.0. Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's face with 99.78% accuracy in 200ms. Webcams and phones work well. Minimum face resolution is 224x224 pixels and the DNN accommodates most boundary conditions including low light and blurry images. Enroll an unlimited number of users. Use encrypted match to determine the identify an unknown user's voice with 98.70% accuracy in 600ms. Webcams and phones work well. Requires minimum of 3 seconds of 8.1kHz stereo telephone quality audio. The DNN accommodates most boundary conditions including low quality audio and background noise. Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's fingerprints with 99.9% accuracy in 200ms. Webcams and phones work well. Minimum fingerprint resolution is 224x224 pixels. The algorithm accommodates most boundary conditions including low light and blurry images. Private User Behavioral Analytics Enroll an unlimited number of users. Use encrypted match to determine the identity of an unknown user's behavior with 99.9% accuracy in 200ms. Webcams, phones and watches work well. Behavior data includes 70+ encrypted data points including geolocation, temperature, accelerometer, health monitoring, gyroscope and magnetometer. Passive & Active Liveness Ensure that biometrics are only collected from a live human user. Passive liveness includes small muscle movement analysis of eyes, eyebrowses, lips and chin. Active liveness requires the user read out loud a random sentence and then assures that the user spoke the requested words and the user's voice identity matches the user's face identity. Have confidence in the availability of Private Identity knowing that the service runs in elastic, fault-tolerant Kubernetes containers on public or private Clouds. We guarantee 99.9% uptime and maintain compliance with international standards and government requirements for privacy, encryption and security. Deploy Private Identity in a specific region or globally using low-latency Cloud infrastructure. Expand the service to additional regions as needed. Private Identity is multilingual and built to serve global audiences. Private Identity automatically updates itself, monitors for issues, adds and removes Kubernetes cubes as user demand changes, and instantly replace cubes that fail. Accuracy, Scalability & Performance Users easily enroll on any device and then immediately authenticate across all platforms and devices. Private Identity is scalable, elastic and built to serve global audiences. Delivers massive horizontal scalability and real-time performance using edge computing, CPUs, GPUs and Edge TPUs. Works With Your Enterprise Directory Private Identity elegantly integrates with your existing Enterprise directory using OAuth 2.0/OIDC and SAML 2.0. And Many Others… Works With Your Enterprise Directory Private Identity elegantly integrates with your existing Enterprise directory using OAuth 2.0/OIDC and SAML 2.0. System Parameters Encrypted Search SPEED 200ms Encrypted search across unlimited private biometrics (1:Many Open-set Identification) THROUGHPUT No Theoretical Maximum 100,000 encrypted searches/sec tested 2/2019 using Google Cloud AI Platform. Encrypted Match ACCURACY Identification Rate (IR) 99.78% Speed of Template Creation 14.3ms Template Size 4kb Open-set False Positive Identification Rate (FPIR) 0.00% Open-set False Negative Identification Rate (FNIR) 0.00% False Negative Matching Rate (FNMR) 0.22% False Matching Rate (FMR) 0.00% Equal Error Rate (EER) 0.00% Encrypted search across unlimited private biometrics (1:Many Open-set Identification) 100,000 encrypted searches/sec tested 2/2019 using Google Cloud AI Platform. Speed of Template Creation Open-set False Positive Identification Rate (FPIR) Open-set False Negative Identification Rate (FNIR) False Negative Matching Rate (FNMR) False Matching Rate (FMR) Equal Error Rate (EER) Technology & Innovation Partners We actively partner with innovative technology companies to help improve current offerings, create new solutions, build the identity industry and drive new business at a global level. about ID DataWeb â\"¢ about DUO Security â\"¢ about Ping Identity â\"¢ Technology & Innovation Partners We actively partner with innovative technology companies to help improve current offerings, create new solutions, build the identity industry and drive new business at a global level. \"We are excited to work with Private Identity to provide private face, voice and fingerprint recognition for our clients. Their team is a pleasure to work with, our customers appreciate their advanced technology and their solutions integrate well into our architecture\" David Coxe CEO, ID DataWeb \"We are excited to work with Private Identity to provide private face, voice and fingerprint recognition for our clients. Their team is a pleasure to work with, our customers appreciate their advanced technology and their solutions integrate well into our architecture\" David Coxe CEO, ID DataWeb About Us Private Identity LLC is a Washington DC-based AI/cryptography software company that provides one-way, fully homomorphic encrypted biometric identity systems that operate in real time and absolute accuracy. The societal good achieved by solving one-way fully homomorphic encryption is full privacy. Our underlying technology was developed by a small group of top computer scientists and software developers from around the world with considerable experience in machine learning. We applied our collective knowledge and experience and converged on a solution to homomorphic encryption in early 2018. We shared our solution with IEEE P2410 Working Group in May 2018 and subsequently helped update the IEEE 2410-2019 Standard for Biometric Open Protocol. Our first cryptography patent was granted in September 2019. Additional patents are pending worldwide. Private Identity LLC is a Washington DC-based AI/cryptography software company that provides one-way, fully homomorphic encrypted biometric identity systems that operate in real time and absolute accuracy. The societal good achieved by solving one-way fully homomorphic encryption is full privacy. Our underlying technology was developed by a small group of top computer scientists and software developers from around the world with considerable experience in machine learning. We applied our collective knowledge and experience and converged on a solution to homomorphic encryption in early 2018. We shared our solution with IEEE P2410 Working Group in May 2018 and subsequently helped update the IEEE 2410-2019 Standard for Biometric Open Protocol. Our first cryptography patent was granted in September 2019. Additional patents are pending worldwide. Key Relationships \"If I have seen further it is only by standing on the shoulders of Giants.†- Sir Isaac Newton, 1676 Edge Computing TensorFlow Team TensiorFlow.org Cloud ML Engine Alex Lee Google AI Platform (GCP) Business Advisory Richard Fields Allen & Co Corporate Law Stephen Huttler Pillsbury Winthrop Shaw Pittman LLP Intellectual Property Matthew Grady Wolf, Greenfield & Sacks, P.C. Audit William Leffler RSM US LLP \"If I have seen further it is only by standing on the shoulders of Giants.†- Sir Isaac Newton, 1676 Leadership Mike Pollard, ceo Mike is an entrepreneur experienced in high-growth technology ventures in biometrics, machine learning, big data and security. Prior to co-founding Private Identity, Mike served as VP and General Manager in Thomson Reuters' healthcare and science business. Prior to this, he served as co-founder and Executive VP of Discovery Logic (acquired by Thomson Reuters), founded and served as CEO and Chair of thinkXML, and founded and served as CEO of Science Management Corp. Scott Streit, cto Scott is a highly regarded data scientist focused on cryptography, biometrics, machine learning, cloud computing and cyber security. Scott currently leads \"everything technical†at Private Identity, serves as Chair of Biometric Security for IEEE and leads the IEEE 2410 Standard for Biometric Open Protocol. Prior to Private Identity, Scott served as CTO for a large biometrics company, was a research professor for 30 years and supported the US Government for 26 years. Scott has authored several key patents and papers in machine learning, biometrics and authentication. Mike is an entrepreneur experienced in high-growth technology ventures in biometrics, machine learning, big data and security. Prior to co-founding Private Identity, Mike served as VP and General Manager in Thomson Reuters' healthcare and science business. Prior to this, he served as co-founder and Executive VP of Discovery Logic (acquired by Thomson Reuters), founded and served as CEO and Chair of thinkXML, and founded and served as CEO of Science Management Corp. Scott is a highly regarded data scientist focused on cryptography, biometrics, machine learning, cloud computing and cyber security. Scott currently leads \"everything technical†at Private Identity, serves as Chair of Biometric Security for IEEE and leads the IEEE 2410 Standard for Biometric Open Protocol. Prior to Private Identity, Scott served as CTO for a large biometrics company, was a research professor for 30 years and supported the US Government for 26 years. Scott has authored several key patents and papers in machine learning, biometrics and authentication.",
    "The way to verify identity On-device biometric authentication in 25ms without any images leaving your device. Privacy-preserving identity powered by homomorphic tokens at the Edge. For Developers What we provide Bring privacy to every identity workflow Point Solutions Turnkey Solutions Facial Recognition Privacy-preserving facial recognition, powered by homomorphic tokens, enables seamless on-device authentication using only anonymized data. Precise on-device 1:1 matching at the edge, with no images or PII ever transmitted to a server. Privacy-preserving, highly accurate 1:n search and match in 25ms constant time with instant deduplication across a unlimited sized gallery. Mitigate data breach risks and does not incur GDPR, CCPA, BIPA, and HIPAA privacy law obligations. Certifed compliant to IEEE 2410 Standard for Biometric Privacy. Explore Document Verify Suite Ultra-fast, on-device document capture with intuitive feedback, data extraction and photo to selfie match. Document authenticity & data validation certified complaint to NIST 800-63 IAL2 and AAL2 guidelines. On-device selfie match to the extracted photo headshot on the ID to preserve user privacy and save costs. Fully automated forensic document review to determine document authenticity. Authoritative system of records checks and 3rd party data validation. Explore Liveness detection Passive, on-device liveness technology prevents spoofing while preserving user privacy. Stops spoof attempts including paper, digital screen, masks and deepfakes Seamless user experience with Active liveness options Patented on-device processing, no images leave the users device Explore Facial Age Estimation Accurately and conveniently estimate a user's age in 20ms on-device without bias. Protects user privacy as no image ever leaves the users device Video Stream Biometric Age Tracking Highest accuracy facial age estimation algorithm in the world, certified by UK Age Check Certification Scheme (ACCS) . Explore Verifiable Credentials Next generation digital identities that can be accessed, managed and shared directly from any browser. Access and share details from a secure VC directly from the browser. Enables secure expedited guest checkout to increases conversion while reducing 1st and 3rd party chargeback fraud. Instantly onboard users with white labeled digital identities at sign-up. Explore MediaSafeâ\"¢ Facial Biometric Tracking & Deepfake Detection in Video Stream Instantly identify, track, age-verify faces and detect deepfakes in video streams to enhance trust, meet compliance, and increase security. Real-time, privacy preserving 1:1 match and 1:n search in 25ms constant time across unlimited gallery in video Video Stream Biometric Identity Tracking (BEWL) Low processing requirements provide faster speeds at lower costs Eliminates security and privacy risks as only anonymized data is created, processed or stored Explore PrivateID Verification Enrollment Platform (KYC/KYE/AML/CFT) Protect user privacy with fully customizable identity verification workflows that seamlessly support your registration process. Certified to NIST 800-63 Identity Assurance Level 2 (IAL2) to meet your regulatory and compliance requirements On-device selfie match to extracted photo headshot on the ID Fully automated forensic document review with on-device data extraction to ensure document authenticity Authoritative system of records checks and 3rd party data validation Explore FIDO2 Ultrapassâ\"¢ Passwordless Auth Privacy-preserving facial biometric authentication, with ability to integrate FIDO2 Passkeys and other privacy-preserving biometric factors, enables instant and secure identity authentication for any use case. Perform accurate 1:1 match and 1:n search across an unlimited gallery from any device, ensuring that no images or PII leave the user's device. Certified to NIST 800-63 Authentication Assurance Level (AAL2) Instant identity confirmation for passwordless login, payment authorization, account modifications and recovery workflows Explore Fully-Compliant Age Assurance The premier age verification platform designed for simplicity, privacy, and compliance. Verify age for any age-restricted products or services. Protects user privacy as no image ever leaves the users device. Highest accuracy facial age estimation algorithm in the world, certified by UK Age Check Certification Scheme (ACCS) . Capture photoID's for additional on-device identity and age verification with complete user privacy. Explore ISO Biometric Interchange Photo ID Creator Instantly generates an unattended, complaint ISO 19794-5/INCITS 385-2004 (S2019) Face Portrait using any device. Supports Drivers Licenses, Passports, School IDs, CAC Cards, Employee Badging, Law Enforcement, and more. Customizable background and configurations to met any orginization's credentialing standard On-device liveness detection to prevent spoofing Privacy-preserving processing at the Edge eliminate FedRAMP requirments. Explore Industries Get a turnkey solution for your business Fast, secure and private identity verification solutions to meet your organization's KYC and KYE registration and authentication requirements across all digital and physical properties. +195 Countries and regions covered worldwide. +1 Billion Hyper-scalable to meet your global consumer auth needs Easy to build & to use The world's most powerful and easy-to-use Private Identity® SDKs Privacy-preserving low code/no-code integration so you don't need to stitch together disparate systems or spend months integrating identity, privacy, authentication and KYC/AML/CFT functionality. (Web, Swift, Kotlin, Python, etc) For Developers Join the best Ready to get started? Give it a try now and see how fast and easy passwordless sign-up and sign-in can be. Privacy By Design Learn how Ultrapass can streamline and secure sign-in and authentication. > Prevent payments fraud Fight fraud with on-device liveness detection > On-device biometric authentication in 25ms without any images leaving your device. Privacy-preserving identity powered by homomorphic tokens at the Edge. Bring privacy to every identity workflow Privacy-preserving facial recognition, powered by homomorphic tokens, enables seamless on-device authentication using only anonymized data. Precise on-device 1:1 matching at the edge, with no images or PII ever transmitted to a server. Privacy-preserving, highly accurate 1:n search and match in 25ms constant time with instant deduplication across a unlimited sized gallery. Mitigate data breach risks and does not incur GDPR, CCPA, BIPA, and HIPAA privacy law obligations. Certifed compliant to IEEE 2410 Standard for Biometric Privacy. Ultra-fast, on-device document capture with intuitive feedback, data extraction and photo to selfie match. Document authenticity & data validation certified complaint to NIST 800-63 IAL2 and AAL2 guidelines. On-device selfie match to the extracted photo headshot on the ID to preserve user privacy and save costs. Fully automated forensic document review to determine document authenticity. Authoritative system of records checks and 3rd party data validation. Passive, on-device liveness technology prevents spoofing while preserving user privacy. Stops spoof attempts including paper, digital screen, masks and deepfakes Seamless user experience with Active liveness options Patented on-device processing, no images leave the users device Accurately and conveniently estimate a user's age in 20ms on-device without bias. Protects user privacy as no image ever leaves the users device Video Stream Biometric Age Tracking Highest accuracy facial age estimation algorithm in the world, certified by UK Age Check Certification Scheme (ACCS) . Next generation digital identities that can be accessed, managed and shared directly from any browser. Access and share details from a secure VC directly from the browser. Enables secure expedited guest checkout to increases conversion while reducing 1st and 3rd party chargeback fraud. Instantly onboard users with white labeled digital identities at sign-up. MediaSafeâ\"¢ Facial Biometric Tracking & Deepfake Detection in Video Stream Instantly identify, track, age-verify faces and detect deepfakes in video streams to enhance trust, meet compliance, and increase security. Real-time, privacy preserving 1:1 match and 1:n search in 25ms constant time across unlimited gallery in video Video Stream Biometric Identity Tracking (BEWL) Low processing requirements provide faster speeds at lower costs Eliminates security and privacy risks as only anonymized data is created, processed or stored PrivateID Verification Enrollment Platform (KYC/KYE/AML/CFT) Protect user privacy with fully customizable identity verification workflows that seamlessly support your registration process. Certified to NIST 800-63 Identity Assurance Level 2 (IAL2) to meet your regulatory and compliance requirements On-device selfie match to extracted photo headshot on the ID Fully automated forensic document review with on-device data extraction to ensure document authenticity Authoritative system of records checks and 3rd party data validation FIDO2 Ultrapassâ\"¢ Passwordless Auth Privacy-preserving facial biometric authentication, with ability to integrate FIDO2 Passkeys and other privacy-preserving biometric factors, enables instant and secure identity authentication for any use case. Perform accurate 1:1 match and 1:n search across an unlimited gallery from any device, ensuring that no images or PII leave the user's device. Certified to NIST 800-63 Authentication Assurance Level (AAL2) Instant identity confirmation for passwordless login, payment authorization, account modifications and recovery workflows The premier age verification platform designed for simplicity, privacy, and compliance. Verify age for any age-restricted products or services. Protects user privacy as no image ever leaves the users device. Highest accuracy facial age estimation algorithm in the world, certified by UK Age Check Certification Scheme (ACCS) . Capture photoID's for additional on-device identity and age verification with complete user privacy. ISO Biometric Interchange Photo ID Creator Instantly generates an unattended, complaint ISO 19794-5/INCITS 385-2004 (S2019) Face Portrait using any device. Supports Drivers Licenses, Passports, School IDs, CAC Cards, Employee Badging, Law Enforcement, and more. Customizable background and configurations to met any orginization's credentialing standard On-device liveness detection to prevent spoofing Privacy-preserving processing at the Edge eliminate FedRAMP requirments. Get a turnkey solution for your business Fast, secure and private identity verification solutions to meet your organization's KYC and KYE registration and authentication requirements across all digital and physical properties. Countries and regions covered worldwide. Hyper-scalable to meet your global consumer auth needs The world's most powerful and easy-to-use Private Identity® SDKs Ready to get started? Give it a try now and see how fast and easy passwordless sign-up and sign-in can be. Learn how Ultrapass can streamline and secure sign-in and authentication. Fight fraud with on-device liveness detection"
  ]
}