{
  "company": "recfaces.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "We've turned smart and accurate facial recognition technology into simple and convenient solutions that are applicable here and now. The RecFaces development team Biometric identification Ready-made face recognition solution Our solutions are ready to work in 20 minutes. All you need to do is to create a photo database using simple import tools. As a result, you will get a biometric facial recognition system ready to operate without any programming or the help of highly qualified specialists. Easy installation in 20 minutes Clear reports in faces and numbers Detailed documentation Easy photo import for a quick start Ready-made integration modules Compliance with Privacy Protection policies of different countries User-friendly interface Mobile app Open API for independent integrations Our solutions help you manage business tasks faster and more efficiently with a user-friendly interface for facial recognition technology. You can also use our solutions' interface to work in familiar information systems. Id-Guard A biometric software product for increasing the level of security at the facility during video surveillance Business centers , Industrial facilities , Sports facilities and others Id-Gate A biometric software product for biometric identity verification in access control and management systems Business centers , Public Institutions , Industrial facilities and others Id-Check A biometric software product with facial recognition for reliable identity check Id-Logon Biometric software product with robust user authentication for unlocking a device or gaining access to operating systems or apps Id-Time A software product that provides simple and reliable working time and attendance by identifying faces using tablets, IP cameras, or terminals Id-Welcome A biometric software product for displaying personalized media content Id-Target A biometric software product with facial recognition that provides enhanced communication with clients Id-Line A biometric software product with facial recognition that expands the electronic queue systems with personalized services for visitors Ready-made integrations with ACS, video surveillance systems and other solutions We have developed ready-made integration modules that provide seamless connection and easy data flow configuration between our solutions and video surveillance systems, access control systems, corporate time attendance apps, multimedia servers, etc. The integration modules come with our solutions free of charge and are quickly installed using a simple step-by-step installation package. Each module has been tested by our technology partners. Our technology partners: RecFaces is trusted: To improve a shopping mall's visitor safety and monitor face mask wearing. Jockey Club shopping center, Brazil To control visitor flow to sports events. Gosford Arena Sports Stadium, Australia To ensure security at a busy transport facility. Metro station, Thailand To improve the security level and provide instant incident alerts. Governmental body, Egypt To improve passenger safety at the transport facility. Jomo Kenyatta Airport, Kenya To confirm customers' identity and to increase transaction security. One of the leading commercial banks, Azerbaijan To improve a shopping mall's visitor safety and monitor face mask wearing. Jockey Club shopping center, Brazil To control visitor flow to sports events. Gosford Arena Sports Stadium, Australia To ensure security at a busy transport facility. Metro station, Thailand To improve the security level and provide instant incident alerts. Governmental body, Egypt To improve passenger safety at the transport facility. Jomo Kenyatta Airport, Kenya To confirm customers' identity and to increase transaction security. One of the leading commercial banks, Azerbaijan What biometric solution will suit your business best, and what benefits will you get? At RecFaces, we provide our customers with a training experience that applies to the business. Listen to an overview lecture on the application of biometrics Or for our product Introductory webinars For more information, don't hesitate to get in touch with us by email at sales@recfaces.com Ready-made face recognition solution Our solutions are ready to work in 20 minutes. All you need to do is to create a photo database using simple import tools. As a result, you will get a biometric facial recognition system ready to operate without any programming or the help of highly qualified specialists. Ready-made integrations with ACS, video surveillance systems and other solutions We have developed ready-made integration modules that provide seamless connection and easy data flow configuration between our solutions and video surveillance systems, access control systems, corporate time attendance apps, multimedia servers, etc. The integration modules come with our solutions free of charge and are quickly installed using a simple step-by-step installation package. Each module has been tested by our technology partners. To improve a shopping mall's visitor safety and monitor face mask wearing. Jockey Club shopping center, Brazil To control visitor flow to sports events. Gosford Arena Sports Stadium, Australia To ensure security at a busy transport facility. To improve the security level and provide instant incident alerts. To improve passenger safety at the transport facility. Jomo Kenyatta Airport, Kenya To confirm customers' identity and to increase transaction security. One of the leading commercial banks, Azerbaijan To improve a shopping mall's visitor safety and monitor face mask wearing. Jockey Club shopping center, Brazil To control visitor flow to sports events. Gosford Arena Sports Stadium, Australia To ensure security at a busy transport facility. To improve the security level and provide instant incident alerts. To improve passenger safety at the transport facility. Jomo Kenyatta Airport, Kenya To confirm customers' identity and to increase transaction security. One of the leading commercial banks, Azerbaijan What biometric solution will suit your business best, and what benefits will you get? At RecFaces, we provide our customers with a training experience that applies to the business. Listen to an overview lecture on the application of biometrics Or for our product Introductory webinars For more information, don't hesitate to get in touch with us by email at sales@recfaces.com"
  ]
}