{
  "company": "saltosystems.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 50
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 50
    }
  },
  "sample_docs": [
    "SALTO electronic locks now SKIDATA compatible Auto-locking office doors installed in new business complex SALTO at Healthcare Estates Exhibition SALTO off-line readers integrate with Group 4 Technology Symmetry System SALTO provides access control for Hard Rock Hotel Water World partners with SALTO for Access Control SALTO tee's off in Ghana Canadian hospital invests in security from SALTO Delaware College (DCAD) housing secured with SALTO SALTO makes the cut at new golf resort Home SALTO Corporate website SALTO USA website ABOUT US Presentation Location Corporate responsibility APPLICATIONS BY SECTOR What SALTO can do for you? Education Corporate Government Airports Healthcare Hotel What SALTO can do for you? SYSTEM COMPONENTS System Overview Scalable Access Control System SVN (Virtual Network) Electronic locks Electronic cylinder Wall Readers Control Units i-Lockers Energy Management Devices Management tools Software Ident. media System Overview Scalable Access Control System SVN (Virtual Network) Electronic locks Electronic cylinder Wall Readers Control Units i-Lockers Energy Management Devices Management tools Software Ident. media Scalable Access Control System SALTO WORLD WIDE Salto EMEA Salto Asia Pacific Salto America SALTO in your language",
    "One of the main targets of our access control development is the reduction of access control related management time, without the loss of functionality, flexibility, control and security. As a result of this the ground breaking, patented, Salto Virtual Network was developed. In summary this means the following: The SVN system allows stand-alone locks to read, receive and write information on the cards. As most User access related info is kept (encrypted) on the ID carriers, on line wall readers are able to update (and receive information from) the cards at any time everywhere in the building, while for the standard user the up-dater is just another wall reader. This functionality opens up a whole range of exciting possibilities for ID carrier control in modern buildings.",
    "Modern buildings require access solutions that are increasingly practical, flexible and can live up to the security requirements of today's world. Mechanical locking systems offer very little flexibility, and electronic access control systems have, until now, involved costly physical changes in doors, complex installations, and produced a lot of maintenance problems. SALTO has been created to give solutions to these constantly changing market demands. It has a clear commitment to users and companies, offering an effective solution to all the access requirements. For this, SALTO has manufactured a new electronic locking system that offers the flexible and functional access control that buildings need. Look at the appreciable advantages: There is no need to hard-wire the building. Security is not compromised by the desire for comfort and simplicity. Possibility of using the Salto Virtual Net (SVN). Copyproof and protected data carrier for high security. It allows a wide choice of handle styles. Installation is fast, self contained and straightforward. The lock is simple and intuitive to use. It presents an important cost saving.",
    "Salto offers a complete range of wall Readers with off-line or on-line control units, for the control of entrance doors, elevators (including automatic level selection), parking garages etc. There are different models of wall readers, depending on interior/exterior use and type of surface. The simple use of the escutcheons is repeated when using the wall readers. See the range of control units for the access control features.",
    "Here we are talking about buildings in which a restricted, but numerous, group of people have access to many doors. These are applications in which system management, comfort and control of access are put first. Buildings such as offices, institutional buildings, hospitals, etc. are included in this category. Normally this group of users tends to be very stable, where users utilise their keys for longer periods of time. The management of access flow and users access time zones in these buildings, and the possibility of obtaining door audit trails, are all key elements to these kinds of installations. The ability to create different levels of Security by using several Salto product solutions (including the ability to control doors with multi-point locking Systems), offers a new dimension to modern access control in a closed user group environment. Indeed, maintaining the highest levels of flexibility, with regard to number of users, number of doors, access changes and System management, makes Salto the only real solution for this type of buildings. This application refers to buildings with a high and changeable transit of users, such as hotels, health resorts, congress centres, sports amenities etc. These installations are based on a secure locking organisation that requires flexible time limited access. Hotel guests normally stay for short periods of time after which their access authorisation is automatically withdrawn from the lock. Another specific characteristic is the importance of the shortest possible check-in times at the front desk, with regard to the locking system. Clever front desk peripherals and state-of-the-art software make sure that the Salto system minimises the time spent at check-in updating the access control of users. Salto provides a Security level that a hotel owner knows gives all guests a feeling that their families and belongings are well protected during their stay. Salto , of course, completes the open user group package with a range of necessary accessories like energy saver switches, wall-readers and safes, and the choice of key type means maximum compatibility with other services such as vending machines, 'pay as you go' services, club membership schemes etc, as well as with most of the PMS Systems."
  ]
}