{
  "company": "samtechinfonet.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 12
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 12
    }
  },
  "sample_docs": [
    "AboutUs Company Overview How Are We Different Awards & Recognition Alliances & Technology Partnerships People Power How Are We Different Alliances & Technology Partnerships Services e-Governance practice Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Products Face Recognition FaceChk Image Compress ICOM BPM Platform FaceChk Attendance Management FaceChk Visitor Management We Satisfy Our Clients By Exceeding Their Expectations Of Quality And Level Of Service. We Perform Research And Development Efforts In Search Of Innovative Solutions. Results Driven Solutions Enabling Customers To Exceed Potential And Lower Their Costs. Solving Problems While Providing The Most Efficient And Cost Saving Solutions Possible Welcome to Samtech Infonet Samtech InfoNet Limited was incorporated in July 1989. It began with a foray into the growing system integration and services market . Samtech InfoNet Limited is ISO 9001:2015 certified IT Services, Software and Systems Integration Company. We have been helping our enterprise and government clients across the world in provisioning innovative IT solutions., Samtech's strength comes from solutions, services and customer relationships. In the process Samtech have grown because of customer focus. Samtech started investing its time, energy and valuable resources with an intent to understand the IT enablement and e-governance needs for the central and state governments aligned to the National e-Governance Plan (NeGP) of Government of India thus providing innovative ideas and solutions to the various government departments ranging from Software and Portal Solutions, content and digitization services and facilities management services in line with the vision of benefiting the Common man the \"Citizen of India†Samtech in its last 27 years of successful existence has served a variety of customers across geographies in the enterprise, public sector and government segments. Our work has been appreciated by many of our customers and technology Partners. We have developed a successful Plan-Do-Act-Analyze model of delivery and create POC and Pilots before transitioning the production and scaling it. This avoids any surprises and cultural shocks while optimizing the processes and content. Ethical, Healthy, Knowledge community To be the vendor of choice for large and mid-sized global corporations, enabling their companies, which are knowledge centric in their vision and are premium service seekers We shall offer the core benefit of knowledge, technology and best practices in the capacity of consultant,enabler, implementation partner, service provider and content developer. Internally, we shall create a knowledge community; an ethical, healthy and quality company that guarantees customer satisfaction through new business paradigms while maximizing our stake holder's value. Samtech's e-governance practice draws its expertise from domain specialists in the governance and public sector arena. We employ consultants, retired senior government officers and panel of experts who have spent years on understanding and provisioning of e-governance solution. Software Development & Portal Solution Samtech Infonet can design, develop, integrate, and test one or more components of your embedded software system, get to market faster, and reallocate resources on other high-priority tasks. Content & Document Digitization Digitally preserving your historical collections and institutional media is imperative. Through our process, we give new life to the obsolete media of yesterday. Serving public and private institutions, our unparalleled attention to detail Facilities Management & Infrastructure Support Samtech InfoNet offers critical services, such as management of computer hardware infrastructure that ensure a safe and reliable physical environment. Through our experience and technical expertise, we aim for a long-term reduction... Technology Staffing & Staff Augmentation A staff augmentation through Samtech Infonet can help you achieve your technology goals with industry and technical experience which will accelerate the quality and speed of your project or requirements. Website & Enterprise Portal Development Samtech is positioned to deliver portal solutions of a wide variety of types, scope and complexity. And whatever the underlying scenario, we assure delivery of a dynamic experience your customers, partners and employees are instinctively looking for. 14 DSIDC Computer Complex, Scheme1, Okhla Industrial Area Phase II, New Delhi-110020, India",
    "AboutUs Company Overview How Are We Different Awards & Recognition Alliances & Technology Partnerships People Power How Are We Different Alliances & Technology Partnerships Services e-Governance practice Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Products Face Recognition FaceChk Image Compress ICOM BPM Platform FaceChk Attendance Management FaceChk Visitor Management We Satisfy Our Clients By Exceeding Their Expectations Of Quality And Level Of Service. We Perform Research And Development Efforts In Search Of Innovative Solutions. Results Driven Solutions Enabling Customers To Exceed Potential And Lower Their Costs. Solving Problems While Providing The Most Efficient And Cost Saving Solutions Possible Welcome to Samtech Infonet Samtech InfoNet Limited was incorporated in July 1989. It began with a foray into the growing system integration and services market . Samtech InfoNet Limited is ISO 9001:2015 certified IT Services, Software and Systems Integration Company. We have been helping our enterprise and government clients across the world in provisioning innovative IT solutions., Samtech's strength comes from solutions, services and customer relationships. In the process Samtech have grown because of customer focus. Samtech started investing its time, energy and valuable resources with an intent to understand the IT enablement and e-governance needs for the central and state governments aligned to the National e-Governance Plan (NeGP) of Government of India thus providing innovative ideas and solutions to the various government departments ranging from Software and Portal Solutions, content and digitization services and facilities management services in line with the vision of benefiting the Common man the \"Citizen of India†Samtech in its last 27 years of successful existence has served a variety of customers across geographies in the enterprise, public sector and government segments. Our work has been appreciated by many of our customers and technology Partners. We have developed a successful Plan-Do-Act-Analyze model of delivery and create POC and Pilots before transitioning the production and scaling it. This avoids any surprises and cultural shocks while optimizing the processes and content. Ethical, Healthy, Knowledge community To be the vendor of choice for large and mid-sized global corporations, enabling their companies, which are knowledge centric in their vision and are premium service seekers We shall offer the core benefit of knowledge, technology and best practices in the capacity of consultant,enabler, implementation partner, service provider and content developer. Internally, we shall create a knowledge community; an ethical, healthy and quality company that guarantees customer satisfaction through new business paradigms while maximizing our stake holder's value. Samtech's e-governance practice draws its expertise from domain specialists in the governance and public sector arena. We employ consultants, retired senior government officers and panel of experts who have spent years on understanding and provisioning of e-governance solution. Software Development & Portal Solution Samtech Infonet can design, develop, integrate, and test one or more components of your embedded software system, get to market faster, and reallocate resources on other high-priority tasks. Content & Document Digitization Digitally preserving your historical collections and institutional media is imperative. Through our process, we give new life to the obsolete media of yesterday. Serving public and private institutions, our unparalleled attention to detail Facilities Management & Infrastructure Support Samtech InfoNet offers critical services, such as management of computer hardware infrastructure that ensure a safe and reliable physical environment. Through our experience and technical expertise, we aim for a long-term reduction... Technology Staffing & Staff Augmentation A staff augmentation through Samtech Infonet can help you achieve your technology goals with industry and technical experience which will accelerate the quality and speed of your project or requirements. Website & Enterprise Portal Development Samtech is positioned to deliver portal solutions of a wide variety of types, scope and complexity. And whatever the underlying scenario, we assure delivery of a dynamic experience your customers, partners and employees are instinctively looking for. (91 -11) 65682488 / 99 14 DSIDC Computer Complex, Scheme1, Okhla Industrial Area Phase II, New Delhi-110020, India",
    "AboutUs Company Overview How Are We Different Awards & Recognition Alliances & Technology Partnerships People Power How Are We Different Alliances & Technology Partnerships Services e-Governance practice Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Products Face Recognition FaceChk Image Compress ICOM BPM Platform FaceChk Attendance Management FaceChk Visitor Management Face Recognition Software FaceChk Face Recognition deals with the identification and verification of a person from a digital image or from a video source. It can determine the unknown identity of human being on the basis of the facial characteristics and features derived from the digital image of that person. It is an artificial intelligence based system which perceive and learn contents of the image like human and perform search based on it FaceChk is an Artificial Intelligence based system which is capable of searching faces in a given set of database with high accuracy. The software has been benchmarked on Labelled Faces in the Wild (LFW) benchmark database, which consists of over 13,000 images of the faces collected from the web. Each face has been labeled with the name of the person pictured among which 1680 of the people pictured have two or more distinct photos in the data set. FaceChk Software has achieved 98% accuracy on this database Teacher Management System TEMIS National Disaster Management Authority Portal Crime and Criminal tracking Network System(CCTNS) Delhi & Himachal Social Justice Management System (SJMS) HVPNL Portal & Data Digitisation Services Incredible India Web Portal Software & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development (91 -11) 65682488 / 99 14 DSIDC Computer Complex, Scheme1, Okhla Industrial Area Phase II, New Delhi-110020, India",
    "AboutUs Company Overview How Are We Different Awards & Recognition Alliances & Technology Partnerships People Power How Are We Different Alliances & Technology Partnerships Services e-Governance practice Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Products Face Recognition FaceChk Image Compress ICOM BPM Platform FaceChk Attendance Management FaceChk Visitor Management Content and Document Digitization Samtech Infonet can setup your Document Management Solution in a way that compliments your service force. The structured, indexed way in which information is stored and retrieved ensures customers face minimum wait during support calls, as the service agent can quickly and efficiently access all pertinent details and instructions. Digitally preserving your historical collections and institutional media is imperative. Through our process, we give new life to the obsolete media of yesterday. Serving public and private institutions, our unparalleled attention to detail For legal reasons, certain documents need to be retained for long periods of time. Samtech Infonet can provide you with options for off-site storage of paper documents as part of an imaging contract. Electronic Document Management can provide another form of security through Disaster Recovery (DR). Once the data is converted to digital format, a backup copy is stored in a disaster recovery vault. The customer is only charged a fee if and when it becomes necessary to use the backup to recover lost information. Should an unfortunate disaster occur, Samtech Infonet will have you operational again within a few hours, eliminating costly downtime. Scanning and Digital Imaging is the conversion of physical documents and images of any kind, in any format, into their digital equivalents. Reduction in physical space requirements and a much quicker document search and retrieval are just two of the many benefits of digitizing your paperwork. Samtech provides total imaging solutions and aims for operator-efficient design and productivity. We focus on client-specific document management requirements and, partnering with world leaders, offer you effective solutions keeping in mind present and future needs. Teacher Management System TEMIS National Disaster Management Authority Portal Crime and Criminal tracking Network System(CCTNS) Delhi & Himachal Social Justice Management System (SJMS) HVPNL Portal & Data Digitisation Services Incredible India Web Portal Software & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development (91 -11) 65682488 / 99 14 DSIDC Computer Complex, Scheme1, Okhla Industrial Area Phase II, New Delhi-110020, India",
    "AboutUs Company Overview How Are We Different Awards & Recognition Alliances & Technology Partnerships People Power How Are We Different Alliances & Technology Partnerships Services e-Governance practice Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Software Development & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development Products Face Recognition FaceChk Image Compress ICOM BPM Platform FaceChk Attendance Management FaceChk Visitor Management Upon realizing the intent of Central Government and specially State Governments to IT enable their functions, Samtech incepted its e-governance practice in the year 2002. Since then we have acquired valuable knowledge, learning and insight into various governance aspects. This learning helped us identify innovative and practical solutions to solve business problems for our various government clients. Samtech e-Governance practice draws its expertise from domain specialists in the governance and public sector arena. We employ consultants, retired senior government officers and panel of experts who have spent years on understanding and provisioning of e-governance solution. Samtech e-governance Solutions Agriculture Portal Information, Advisory and Transactions for farming household Access through Kiosk, Phone, Mobile, Web Education Framework ERP and Automation for University/ College Education Information System for Government School Systems Tourism Portal Framework One Stop Shop for Tourists, Visitors, Industry and Citizens Comprehensive Experiential Content E-Gov HR Automation Complete Lifecycle Human Resource Automation for Government Recruitment to Retirement Our work has been appreciated by many of our customers and technology partners. Agriculture Portal Information, Advisory and Transactions for farming household Access through Kiosk, Phone, Mobile, Web Information, Advisory and Transactions for farming household Access through Kiosk, Phone, Mobile, Web Education Framework ERP and Automation for University/ College Education Information System for Government School Systems ERP and Automation for University/ College Education Information System for Government School Systems Tourism Portal Framework One Stop Shop for Tourists, Visitors, Industry and Citizens Comprehensive Experiential Content One Stop Shop for Tourists, Visitors, Industry and Citizens E-Gov HR Automation Complete Lifecycle Human Resource Automation for Government Recruitment to Retirement Complete Lifecycle Human Resource Automation for Government Teacher Management System TEMIS National Disaster Management Authority Portal Crime and Criminal tracking Network System(CCTNS) Delhi & Himachal Social Justice Management System (SJMS) HVPNL Portal & Data Digitisation Services Incredible India Web Portal Software & Portal Solution Content & Document Digitisation Facilities Management & Infrastructure Support Technology Staffing & Staff Augmentation Website & Enterprise Portal Development (91 -11) 65682488 / 99 14 DSIDC Computer Complex, Scheme1, Okhla Industrial Area Phase II, New Delhi-110020, India"
  ]
}