{
  "company": "secure.prm.net.au",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 24
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 24
    }
  },
  "sample_docs": [
    "Looking for peace of mind when employing a new employee? Pre Employment Screening Checks to suit all levels of responsibility and risk within your organisation. Lots of blatant SEO content that won't appear Discover how we can help you. At the heart of all our Pre Employment Screening Checks is our online Police Checks . Find out more or login now . Privacy & Security Policy Copyright -2009 The Personnel Risk Management Group Pty Ltd.",
    "The PRM Group Australia's First and Largest Online Police Check Provider. What are the benefits? Applicants are not giving away their identity! The recipient is not receiving false certified documents! There is a complete verification and audit trail! Quick, simple and secure! Need a Police Check fast? Individuals can order an Online Police Check in a matter of minutes and in most cases be returned within the hour We are here to solve your Identity verification needs! PharmacyID is the most secure system of identity verification in Australia. With locations in every state and territory in both metropolitan and regional centres, PharmacyID will be the largest identity verification retail network in Australia. Trusted, convenient and connected by The PRM Group. Applicable for a range of ID verification requirements Online National Police Checks. ID cards for universities and TAFE. ID Cards for high risk work. Commercial identity checks. Corporate biometric ID authentication. The Document Verification Service The Document Verification Service (DVS) is a national online system that allows organisations to compare a customer's identifying information with a government record. Learn how DVS works Australia's First and Largest Online Police Check Provider. What are the benefits? Applicants are not giving away their identity! The recipient is not receiving false certified documents! There is a complete verification and audit trail! Quick, simple and secure! Need a Police Check fast? Individuals can order an Online Police Check in a matter of minutes and in most cases be returned within the hour We are here to solve your Identity verification needs! PharmacyID is the most secure system of identity verification in Australia. With locations in every state and territory in both metropolitan and regional centres, PharmacyID will be the largest identity verification retail network in Australia. Trusted, convenient and connected by The PRM Group. Applicable for a range of ID verification requirements Online National Police Checks. ID cards for universities and TAFE. ID Cards for high risk work. Commercial identity checks. Corporate biometric ID authentication. The Document Verification Service The Document Verification Service (DVS) is a national online system that allows organisations to compare a customer's identifying information with a government record. Learn how DVS works What are the benefits? Applicants are not giving away their identity! The recipient is not receiving false certified documents! There is a complete verification and audit trail! Quick, simple and secure! The recipient is not receiving false certified documents! There is a complete verification and audit trail! Quick, simple and secure! There is a complete verification and audit trail! Quick, simple and secure! Quick, simple and secure! Need a Police Check fast? Individuals can order an Online Police Check in a matter of minutes and in most cases be returned within the hour We are here to solve your Identity verification needs! PharmacyID is the most secure system of identity verification in Australia. With locations in every state and territory in both metropolitan and regional centres, PharmacyID will be the largest identity verification retail network in Australia. Trusted, convenient and connected by The PRM Group. Applicable for a range of ID verification requirements Online National Police Checks. ID cards for universities and TAFE. ID Cards for high risk work. Commercial identity checks. Corporate biometric ID authentication. ID cards for universities and TAFE. ID Cards for high risk work. Commercial identity checks. Corporate biometric ID authentication. ID Cards for high risk work. Commercial identity checks. Corporate biometric ID authentication. Commercial identity checks. Corporate biometric ID authentication. Corporate biometric ID authentication. The Document Verification Service The Document Verification Service (DVS) is a national online system that allows organisations to compare a customer's identifying information with a government record. Ensure your identity is protected! PharmacyID is the most secure system of identity verification in Australia. With locations in every State and Territory in both metropolitan and regional centres, PharmacyID will be the largest identity verification retail network in Australia. Trusted, convenient and connected by The PRM Group. Watch Video Ensure your identity is protected! PharmacyID is the most secure system of identity verification in Australia. With locations in every State and Territory in both metropolitan and regional centres, PharmacyID will be the largest identity verification retail network in Australia. Trusted, convenient and connected by The PRM Group. Watch Video Frequently Asked Questions How long does it take for my check to be processed? 75% of our police checks are returned within the hour whilst the remaining 25% can take anywhere between 2 - 20 business days to be completed and returned. How much is the police check and how can I make payment? Police check applications cost $52.00 including GST and must be paid for online using a Credit Card. Where is the closest PharmacyID member? Once your application has been submitted and paid for you will be provided with a map displaying the nearest PharmacyID member based on your current residential address. This map is interactive and can be changed to suit the location that best suits you. Can my employer validate and confirm my police check certificate? You can have your application validated by using the Police Check Lookup Tool that is available from our site. Please visit https://secure.prm.net.au/police-checks/applicationLookup.aspx and complete the fields and click search. A legitimate check will then be displayed. How long is my police check valid for? Police checks are a point in time check and should not be relied upon for an unreasonable amount of time for this purpose. Legislative requirements differ in regard to how long a police check can be used. For example, in the Aged Care industry, a police check is valid for three years, after which time it must be renewed. Is my police check the same as a working with children's check? The Working with Children Check and the Aged /Vulnerable/Children police check are the same police checks, however the WWC check includes additional background screening. Therefore a WWC must be applied for separately. What if my chosen pharmacy is not able to verify my identity? PharmacyID has built in two contingency methods to verify your identity. Identity documents can still be copied and certified and then sent via email to our office on helpdesk@pharmacyid.com.au or mail your verified documents by mail to PO Box 611 Moonee Ponds VIC 3039. If I need help completing my online police check can someone help me? Yes. Our consultants are available to assist you during business hours (Monday-Friday 8.00am to 5.00pm AEST) on 03 9379 3383 or via Live Chat. More questions? Get in touch How long does it take for my check to be processed? How much is the police check and how can I make payment? Where is the closest PharmacyID member? Can my employer validate and confirm my police check certificate? How long is my police check valid for? Is my police check the same as a working with children's check? What if my chosen pharmacy is not able to verify my identity? If I need help completing my online police check can someone help me?",
    "Pre Employment Screening Checks How we can help you The PRM Group can compile a package to suit your specific needs from the checks listed below. Outlined below is an alphabetical list of Pre Employment Screening checks (background checks) that The Personnel Risk Management Group (The PRM Group) undertakes. Many clients use one of our five packages, which are listed for your convenience. You can simply select from the options listed below to create your own package to meet your organisations needs: Academic Qualifications Check. (This check covers academic from the year prior to tertiary and all tertiary) Bankruptcy Check via Insolvency Services Trust Australia (ITSA) Credit Check (This Personal Credit Check includes disclosure of Civil Judgements. This is a limited check in accordance with Part III of the Privacy Act) Creditworthiness of Companies and Detailed Company Searches (There are several such searches which vary in complexity and cost). Criminal History Check (NCHRC) / Police Check / Criminal Record Check - Australia-wide electronically Directorships Searches and Searches of other Company/Business Interests via ASIC Disqualified Directors and Disqualified Company Officers Electoral Roll Check (on each address provided) Employment History Confirmation for past five years together with References from Line Managers/Referees Land Title Search re ownership of Property Overseas Checks. Most of the above checks can be done overseas, provided that they are permitted by local laws Overseas Criminal History Check / Police Check / Criminal Record Check (where permitted by law) Reference Checks from Line Managers/Referees for periods of Five or Ten Years Right to Work in Australia check via DIAC (formerly DIMIA) Telephone Listing Check (on each address provided) Privacy & Security Policy Copyright -2011 The Personnel Risk Management Group Pty Ltd.",
    "Technical Integration The PRM Group's in-house development team has extensive knowledge of working with government and non-government organisations to integrate DVS, police checks and a wide variety of verification of identity services into systems and processes. This approach does result in significant reductions in data entry, provide organisations with greater flexibility, improved data analytics, reduced costs and of course returns valuable time to staff. Our custom built restful Police Check API allows us to easily integrate with any third party platform, including HR systems. Integrating with our API means you will never have to leave your own internal systems to manage your checks again. Our Police Check API allows you to easily: Start a Police Check Check on the status of a check at anytime Download Certificates Retrieve Customised Reports Our DVS API allows you to easily: Check a wide range of Government issued Documents including (Driver Licences, Passports, Medicare Cards, Australian Citizenship Certificates) in real-time Download Certificates Please speak to us on how we can help your business streamline your Identity Verifications or Police Checks. The PRM Group's in-house development team can work with organisations on projects involving SAP, B2B, Web APIs, Web Development, Data Encryption and many others. User Accounts The PRM Group system is a flexible roles and permissions based system, which allows user levels to be set appropriately for individual organisations. The online system is colour coded to provide immediate identification of individual checks and the system contains a wide variety of search features. Corporate Dashboard A corporate account includes a 'dashboard' that allows users to view the status of checks in real time. The dashboard provides full visibility over all checks throughout the process, from submission to closure. As soon as check results are received we provide authorized users with an email alert allowing them to take the appropriate action. Reporting The PRM Group national police check client portal is a fully digital, online system and therefore fully auditable to support compliance needs. The extraction of client data is extremely easy and fast and this allows The PRM Group to provide clients with tailored reports in a variety of formats Importing data to Accounting Packages The PRM Group's digital, online system allows for the easy extraction of monthly invoicing data. Once exported the data is compatible with importing into a wide variety of the accounting packages available, for example MYOB, QuickBooks, Xero & Sage One to name a few. This compatibility removes a considerable amount of data entry and the likelihood of errors associated with manual entry. The PRM Group's in-house development team has extensive knowledge of working with government and non-government organisations to integrate DVS, police checks and a wide variety of verification of identity services into systems and processes. This approach does result in significant reductions in data entry, provide organisations with greater flexibility, improved data analytics, reduced costs and of course returns valuable time to staff. Our custom built restful Police Check API allows us to easily integrate with any third party platform, including HR systems. Integrating with our API means you will never have to leave your own internal systems to manage your checks again. Our Police Check API allows you to easily: Our Police Check API allows you to easily: Start a Police Check Check on the status of a check at anytime Our DVS API allows you to easily: Our DVS API allows you to easily: Check a wide range of Government issued Documents including (Driver Licences, Passports, Medicare Cards, Australian Citizenship Certificates) in real-time Please speak to us on how we can help your business streamline your Identity Verifications or Police Checks. The PRM Group's in-house development team can work with organisations on projects involving SAP, B2B, Web APIs, Web Development, Data Encryption and many others. The PRM Group system is a flexible roles and permissions based system, which allows user levels to be set appropriately for individual organisations. The online system is colour coded to provide immediate identification of individual checks and the system contains a wide variety of search features. A corporate account includes a 'dashboard' that allows users to view the status of checks in real time. The dashboard provides full visibility over all checks throughout the process, from submission to closure. As soon as check results are received we provide authorized users with an email alert allowing them to take the appropriate action. The PRM Group national police check client portal is a fully digital, online system and therefore fully auditable to support compliance needs. The extraction of client data is extremely easy and fast and this allows The PRM Group to provide clients with tailored reports in a variety of formats Importing data to Accounting Packages Importing data to Accounting Packages The PRM Group's digital, online system allows for the easy extraction of monthly invoicing data. Once exported the data is compatible with importing into a wide variety of the accounting packages available, for example MYOB, QuickBooks, Xero & Sage One to name a few. This compatibility removes a considerable amount of data entry and the likelihood of errors associated with manual entry.",
    "PharmacyID provides Australian Government, business and consumers with a more efficient, secure and trusted identity service through their local community pharmacy. Identity verification has become a standard requirement in the set up of personal accounts with service providers on and offline. However, giving away personal information to multiple organisations increases the risk of someone stealing identity information. Current verification of identity systems have limitations and serious flaws that are targeted by criminals. PharmacyID brings together the power of the community pharmacy network in Australia with state-of-the-art identity verification technology to solve these problems quickly, efficiently and with absolute security. PharmacyID now offers the most secure national identity system for services such as national police history checks and future services that may include passport and visa applications, licence renewals, proof of age cards, confirmation of identity for retail purchases, banking and finance transactions and identity verification for domestic and international travel. What are the Benefits? Applicants are not giving away their identity. The recipient is not receiving false certified documents. There is a complete verification and audit trail. Quick, easy and secure. PharmacyID has been designed and developed by The PRM Group, one of Australia's most trusted identity verification businesses. The PRM Group is accredited by the Commonwealth Government to provide National Police Check (NPC) services for companies, government and private individuals."
  ]
}