{
  "company": "signdesk.com",
  "dominant_topics": [
    0,
    24
  ],
  "topic_counts": {
    "0": 12,
    "24": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "24": "signature, electronic, sign, signatures, contract"
  },
  "framing_scores": {
    "framing_ethical": 0.3547619047619048,
    "framing_surveillance": 0.0166666666666666,
    "framing_market": 0.6285714285714286,
    "num_docs": 13
  },
  "topic_timeline": {
    "20": {
      "0": 12,
      "24": 1
    }
  },
  "sample_docs": [
    "Switch to Paperless Workflow Today Cut costs and improve efficiency with our eSign, eStamp & Documentation Workflows Switch to Paperless Workflow Today Cut costs and improve efficiency with our eSign, eStamp & Documentation Workflows SignDesk transforms manual disconnected processes into seamless procedures with its Contract Workflow Automation solution. It includes the Digital Stamping, eSign workflow, and the eMandate solutions. Paperless Nirvana Why struggle with physical copies when you can have all your documents done online? Why struggle with physical copies when you can have all your documents done online? Why Choose Us? Quick and Simple Sign documents online in just a few minutes, from anywhere, anytime Secure and Risk-free The SHA-256 algorithm ensures data-safety, prevents hash collisions and vulnerabilities Legally Valid The IT Act, 2000, authenticates the use of electronic signatures as a valid signature Paperless Workflow Digitally stamp your documents with no delays in a simple process Invite Multiple Parties Digitally stamp your documents with no delays in a simple process Configurable Workflow Quick and simple process to ensure timely payments with e-Mandate Sign documents online in just a few minutes, from anywhere, anytime The SHA-256 algorithm ensures data-safety, prevents hash collisions and vulnerabilities The IT Act, 2000, authenticates the use of electronic signatures as a valid signature Digitally stamp your documents with no delays in a simple process Digitally stamp your documents with no delays in a simple process Quick and simple process to ensure timely payments with e-Mandate Creating Workflow Automation Solutions for All Industries Ease business processes using our solutions Finance Automate loan documentation by creating and signing documents digitally, paying stamp duty online to ensure their legal validity, and automating debit payments electronically through one platform. view more... Insurance Improve the speed of documentation processes through quick access to documents by making faster approvals and payments, thereby streamlining insurance documentation. view more... Retail Onboard vendors faster by creating contracts from anywhere, at any time. Pay online stamp duty on agreements and invite parties to eSign documents. view more... Human Resources Speed up recruitment and employment processes by making signatures online. Customise and use existing templates, share and retrieve documents securely. view more... Creating Workflow Automation Solutions for All Industries Ease business processes using our solutions Automate loan documentation by creating and signing documents digitally, paying stamp duty online to ensure their legal validity, and automating debit payments electronically through one platform. Improve the speed of documentation processes through quick access to documents by making faster approvals and payments, thereby streamlining insurance documentation. Onboard vendors faster by creating contracts from anywhere, at any time. Pay online stamp duty on agreements and invite parties to eSign documents. Speed up recruitment and employment processes by making signatures online. Customise and use existing templates, share and retrieve documents securely. Product Overview scan.it scan.it is an AI-based eKYC solution. It facilitates smooth and secure client onboarding through Video-based Digital KYC, Image-based eKYC and Offline Aadhaar KYC. Our system supports verification of all types of KYC documents which include PAN, Aadhaar, Driver's License, Voter ID, etc. stamp.it stamp.it offers online Stamp Duty payment enabling a seamless contract workflow. It includes the eSign Workflow solution to facilitate smooth uninterrupted documentation. Now create agreements and contracts from anywhere at any time. ink.it ink.it by SignDesk consists of the eSign workflow and USB token-based signatures. Electronically sign documents within minutes from anywhere, at any time. link.it link.it is the eMandate solution offered by SignDesk. It enables the management of recurring payments by authorising the customer's bank to make debits periodically. Set up recurring auto-debit transactions for your business instantly. scan.it is an AI-based eKYC solution. It facilitates smooth and secure client onboarding through Video-based Digital KYC, Image-based eKYC and Offline Aadhaar KYC. Our system supports verification of all types of KYC documents which include PAN, Aadhaar, Driver's License, Voter ID, etc. stamp.it offers online Stamp Duty payment enabling a seamless contract workflow. It includes the eSign Workflow solution to facilitate smooth uninterrupted documentation. Now create agreements and contracts from anywhere at any time. ink.it by SignDesk consists of the eSign workflow and USB token-based signatures. Electronically sign documents within minutes from anywhere, at any time. link.it is the eMandate solution offered by SignDesk. It enables the management of recurring payments by authorising the customer's bank to make debits periodically. Set up recurring auto-debit transactions for your business instantly. Our Trusted Clients + 300 more businesses Awards & Achievements 20 Most Promising Digital Signature Service Providers-2018 10 Most Promising Legal Technology Solution Providers-2017 Mentored by Google-2018 10K Virtual Incubation Assistance-2017 Program Mentored by Reliance Summer-2017 India's Coolest Startup-2017 Top 50 Most User-friendly Technologies-2016 Rising Stars-2016 Previous Next 20 Most Promising Digital Signature Service Providers-2018 10 Most Promising Legal Technology Solution Providers-2017 10K Virtual Incubation Assistance-2017 Program Mentored by Reliance Summer-2017 Top 50 Most User-friendly Technologies-2016 Get to Know how Signdesk can help your business Get to Know how Signdesk can help your business",
    "Stories We're Featured In Contact PR 080-46682650 / 607 pr@signdesk.com Stories We're Featured In Digital Stamping To mark the release of a new and improved version of SignDesk's digital stamping solution, Business Standard, a leading business newspaper, published an article heralding digital stamping and SignDesk's role in the stamping out of fraud in India. Financial Crime in a Digital Age — Why Banks Need a Holistic Approach SignDesk's Co-Founder spoke to Biometric update about Banks can no longer adequately deal with threats of cybercrime on a case-by-case basis, due to the sheer volume of threats and explained about how SignDesk helps control financial fraud. Digital Signatures in COVID-19 Krupesh Bhat, SignDesk's founder, spoke to Money Control about how SignDesk is helping businesses sign & execute contracts digitally, and how an increasing number of businesses are looking for a digital contracting product. End-to-end Loan Digitization SignDesk's co-founder Ashok Kadsur spoke to iBS intelligence about how SignDesk's products enabled digitized loans which helped banks and NBFCs support businesses through the COVID-19 pandemic. Priority Lending for Start-ups With RBI including start-ups in the priority sector lending group, SignDesk's co-founder Ashok Kadsur spoke to Business Standard about how young start-ups with fresh ideas need better financial backing. Increased Demand for Digitization SignDesk's founder Krupesh Bhat spoke to The Week about how IT companies are seeing a rising interest in their digitized solutions in the wake of COVID-19 and how SignDesk is responding to this growing demand. Innovation in RegTech SignDesk was featured in the Economic Times in an article about how legal tech startups such as SignDesk are revolutionising RegTech with innovative use of technology. Financial Crime in a Digital Age — Why Banks Need a Holistic Approach Digital Signatures in COVID-19 Priority Lending for Start-ups Increased Demand for Digitization Sector-wide Automation Krupesh Bhat, SignDesk's founder, spoke to the Hindu about how businesses in healthcare, FMCG, education, and cosmetics are digitizing their workflows with SignDesk's solutions. Chinese Cyber-attacks on Indian Institutions In the wake of numerous cyber-attacks, SignDesk's co-founder Ashok Kadsur spoke to the Economic Times about how the Chinese are targeting India's IT and banking sector. Safeguarding from Hackers SignDesk's founder Krupesh Bhat spoke to Times Now about the steps that businesses and the common man can take to protect themselves against cyber-attacks. Cryptocurrency Boom The Week spoke to SignDesk's co-founder Ashok Kadsur about the lockdown-fuelled boom in cryptocurrency trading and how it might pan out given the looming ban on crypto trading. How AI & ML Enables Process Automation in Digital Onboarding By combining the pattern detection & decision-making capabilities of well-trained AI, businesses can apply AI & ML models to detect fraud, improve customer experience & boost process automation. Improving Accessibility in Contactless Banking Using Video KYC Krupesh Bhat, Founder of SignDesk - speaks about Contactless Banking and the SignDesk part in paperless banking documentation. Blockchain based KYC - The Future of Verification Insights from market-oriented research has shown that DLTs such as blockchain can help with the elimination of inefficiencies and duplication in KYC processes. Chinese Cyber-attacks on Indian Institutions How AI & ML Enables Process Automation in Digital Onboarding Improving Accessibility in Contactless Banking Using Video KYC Blockchain based KYC - The Future of Verification The Future of Onboarding SignDesk's co-founder Ashok Kadsur spoke to Money control about how SignDesk uses AI & ML to expedite and automate onboarding to make it faster and safer. Govt. Should Create Public, Digital Infrastructure: Nandan Nilekani SignDesk featured in Business Standard on its launch on August 3, 2016. Launched by former UIDAI Chief, Mr. Nandan Nilekani, explained how the government creates a legal infrastructure and private bodies build on it with innovative solutions for more efficient use. Aadhaar-linked Digital Signature Facility Launched The leading Indian daily newspaper covered SignDesk's Aadhaar based eSign service on its online platform a day after its launch. Make Legal Documentation Quick and Simple Two days before the SignDesk website launch, Deccan Herald published an article about LegalDesk.com making legal documentation procedures easy. Similarly, SignDesk is a faster way of signing documents online within minutes from anywhere, at any time. Now, Get Legal and Professional Help in a Click The Economic Times reported on SignDesk's quick and efficient system for drafting legal documents online and instantly eSigning documents. The Legal Stamp! Entrepreneur India magazine announced the company as a hassle-free legal documentation service provider in India. SignDesk Rolls Out Digitised E-Stamping Solution Across India Krupesh Bhat, the founder of SignDesk - Stamping is so ubiquitous in activities such as taking loans, and executing contracts that people take for granted how inconvenient the physical stamping process is. I'm glad to say that digital stamping has actually helped people in this respect. Here's an Example of India Leading the World in Tech Infrastructure Tech In Asia, a media event publisher and job platform, published an article on SignDesk quoting it as an exemplary figure for setting an example of India leading the world as a tech infrastructure platform The Future of Onboarding Govt. Should Create Public, Digital Infrastructure: Nandan Nilekani",
    "Flexible plans & fair pricing, tailored to your documentation needs Thousands of businesses have successfully automated their documentation with SignDesk. Are you ready to join the club? Monthly Annual Individual Free Single user 3 documents per month 10 Electronic signatures Multiparty signing Notifications & reminders Audit trail Smart dashboard Web & Android support SMB Basic SMB Advance 499 / month 5988 5390 Pay 10% less 799 / month 9588 8630 Pay 10% less Billed monthly 3 users 25 documents per month All Individual plan features , plus: 20 Aadhaar signatures 75 Electronic signatures Email-based customer support Add-on Customizable templates 4 users 50 documents per month All Individual plan features , plus: 40 Aadhaar signatures 150 Electronic signatures Email-based customer support Add-on Customizable templates Corporate 1399 / month 16788 15110 Pay 10% less Billed monthly 10 users 100 documents per month All SMB plan features , plus: 60 Aadhaar signatures / DSC Digital stamping (DL, GJ, KA, TN) 300 Electronic signatures Email & phone-based customer support Custom signature positioning Add-on Customizable templates Enterprise Contact For Pricing Unlimited users Unlimited documents All Corporate plan features , plus: Digital stamping for PAN India DSC & PAN-based signatures Customizable workflows User roles & permissions SSO login & API support View more > Disclaimer Stamping solutions for the corporate packages are limited to General Agreement. *Please note that the pricing mentioned above is monthly & that all packages will be billed annually. SignDesk Pricing Overview SignDesk offers a free Individual package with 3 documents, 3 templates & electronic signatures. Our paid packages all offer multiparty signing on documents, Aadhaar signatures & unlimited templates, along with email-based customer support. Want to digitally stamp your documents, utilize all-new video-based evidence creation & use API-driven documentation solutions? Talk to sales to find the best option for you. Compare Our Plans Our Top Features Individual SMB Corporate Enterprise Electronic signatures Multiparty signing Automated reminders Smart & intuitive dashboard Web & Android support Document management Audit trail Aadhaar signatures User roles & permissions Email based customer support Phone based customer support Custom template creation DSC & PAN-based signatures APIs Digital stamping PAN India Customizable workflows & dashboard SLAs & up-time commitment Liveliness checks Live screen sharing SSO login Premium customer support Automated payment collection Industry-grade data encryption Customized reports Frequently Asked Questions Yes, you can choose the Individual subscription plan which is free of charge and available for a single user. You can create up to 3 documents per month with storage for 30 days. You can contact the SignDesk team for the Enterprise plan that allows more than 10 users with unlimited document creation and the respective storage capacity. All of our packages offer Aadhaar/Digital signatures apart from our free subscription. You can choose our SMB, Corporate or Enterprise plan based on the number of users & documents. Once the offered aadhaar signatures are utilized, you can always increase the limit by purchasing the same through contacting SIgnDesk support. Aadhaar signatures pack can be purchased for Individual plan subscriptions too by contacting us. All of our packages offer electronic signatures including the Individual plan which is free of charge. You can choose the plan that works for you based on the number of users and documents to be created per month, or you can talk to sales to find the best option for you. If you wish to upgrade or renew your plan, you can purchase a new subscription from our package options . We hate to see you go but if it's necessary, you can cancel your subscription and request a refund any time within 30 days of activation of the subscription. We will assess each refund request and issue refunds on a pro-rata basis for the remaining period of the subscription. We will be unable to issue a refund if the entire plan has been exhausted by you. No cancelation will be allowed after 30 days of commencement of the subscription. You can contact us at care@signdesk.com for any queries related to payment for your subscription. Once you run out of Aadhar signatures, you can get a top-up to purchase additional Aadhaar signatures. Flexible plans & fair pricing, tailored to your documentation needs Thousands of businesses have successfully automated their documentation with SignDesk. Are you ready to join the club? 3 documents per month Web & Android support 5988 5390 Pay 10% less 9588 8630 Pay 10% less 25 documents per month All Individual plan features , plus: 50 documents per month All Individual plan features , plus: 16788 15110 Pay 10% less 100 documents per month All SMB plan features , plus: 60 Aadhaar signatures / DSC Digital stamping (DL, GJ, KA, TN) Email & phone-based customer support All Corporate plan features , plus: Digital stamping for PAN India DSC & PAN-based signatures User roles & permissions SSO login & API support SignDesk offers a free Individual package with 3 documents, 3 templates & electronic signatures. Our paid packages all offer multiparty signing on documents, Aadhaar signatures & unlimited templates, along with email-based customer support. Want to digitally stamp your documents, utilize all-new video-based evidence creation & use API-driven documentation solutions? Talk to sales to find the best option for you. Frequently Asked Questions Yes, you can choose the Individual subscription plan which is free of charge and available for a single user. You can create up to 3 documents per month with storage for 30 days. You can contact the SignDesk team for the Enterprise plan that allows more than 10 users with unlimited document creation and the respective storage capacity. All of our packages offer Aadhaar/Digital signatures apart from our free subscription. You can choose our SMB, Corporate or Enterprise plan based on the number of users & documents. Once the offered aadhaar signatures are utilized, you can always increase the limit by purchasing the same through contacting SIgnDesk support. Aadhaar signatures pack can be purchased for Individual plan subscriptions too by contacting us. All of our packages offer electronic signatures including the Individual plan which is free of charge. You can choose the plan that works for you based on the number of users and documents to be created per month, or you can talk to sales to find the best option for you. If you wish to upgrade or renew your plan, you can purchase a new subscription from our package options . We hate to see you go but if it's necessary, you can cancel your subscription and request a refund any time within 30 days of activation of the subscription. We will assess each refund request and issue refunds on a pro-rata basis for the remaining period of the subscription. We will be unable to issue a refund if the entire plan has been exhausted by you. No cancelation will be allowed after 30 days of commencement of the subscription. You can contact us at care@signdesk.com for any queries related to payment for your subscription. Once you run out of Aadhar signatures, you can get a top-up to purchase additional Aadhaar signatures. Still got questions? Let's talk! Still got questions? Let's talk! Company About Us Product Pricing Careers Awards Media Use Cases Case Studies Contact us Product Overview Plans Partnership Industry Finance Insurance Retail Human Resource Real Estate Manufacturing Pharmaceuticals Legal Telecom Construction All Solutions Product Digital Onboarding Digital Stamping eSign Workflow eNach Digital KYC eMandate CLM VCIP VBIP Aadhaar eSign Electronic Signature Reach Us 080 69186955 INDIA #95, Rudra Chambers, 11th Cross, Malleshwaram Bangalore - 560003. UAE Desk D08, 15th Floor, Al Sarab Tower, ADGM Square, Abu Dhabi, UAE. USA 7511 Greenwood Ave North, Unit #4141, Seattle, WA 98103. Receive Expert Insights Recent Blogs Support support@signdesk.com © Copyright by DeskNine Pvt. Ltd. . of Use Cookies Policy © Copyright by DeskNine Pvt. Ltd. .",
    "Video-based Customer Identification Procedure or V-CIP is a seamless, real-time, and end-to-end encrypted procedure envisaged by RBI for digital customer identification and paperless KYC verification. This alternative video-based process is carried out by banks or other Regulated Entities (REs) through an official trained for face-to-face V-CIP. The process involves Online or offline Aadhaar verification for banks & other REs PAN image & live photo capture Image data validation & facial matching Geo-tagging to determine customer location Fully automated customer onboarding & video KYC verification Experience the AI-powered frontier of Online Video KYC verification Cost-effective KYC verification at incredible speeds Utilizes cutting-edge OCR, data extraction & verification techniques to deliver a customer onboarding product that steps hard on the gas but is light on your wallet Cutting-edge AI Employs state-of-the-art ML techniques and smart AI to instantly spot fake IDs, predict your compliance requirements, and verify KYC documents Geared to impress with VCIP Boasts an attractive and intuitive UI that ensures your customers sail smoothly through the VCIP-enabled onboarding process with zero drop-offs Industry-grade security Robust liveness checks and anti-fraud filters deter any potential scammers and enterprise-level client data security protects your customers' information End-to-end solution Zero add ons, no third parties, and no fat. A lightweight and self-contained onboarding solution that fits Video KYC into your digital channels Assured compliance Automated compliance and risk management technology ensures compliance, our smart notification and workflow management system leaves a virtual paper trail so you never miss anything Paper-free KYC Physical KYC verification is a drain on your efficiency and results in excessive costs. Our completely digital Video KYC verification solution utilizes VCIP to clear away the paper and pave the way for you to reach the top. Are you ready to cut your KYC costs by up to 90% using Video KYC? Highlights of SignDesk's Video KYC Solution Banks & other financial institutions spend weeks to onboard a single customer and shell out millions for KYC checks and compliance requirements. SignDesk's digital customer onboarding solution cuts onboarding costs by 90% and uses VCIP to provide a single, compliant, and fraud-free platform that takes your customers through the Video KYC process smoothly. All your customers need to take out a loan or open an account is a phone with an internet connection. Insurance companies need to verify several documents, confirm identities, and complete long KYC procedures to onboard customers. This results in long waiting times and several customers leaving the onboarding process unfinished. SignDesk provides your customers with an intuitive and friendly onboarding experience by leveraging the latest in ML techniques and secure e-signatures with an acute legal understanding, so your insurance company can onboard customers quickly using Video KYC and meet all their needs. Securities & mutual funds Regulated intermediaries take an inordinate amount of time to onboard and verify investors. This process is further complicated by document verification and KYC checks. SignDesk offers an efficient and cost-effective way for intermediaries to onboard investors using SEBI-compliant video-based verification. Our Video KYC solution is quick, lightweight, and ensures onboarding with zero drop-offs. Both companies and HR consultancies require an expedient and attractive employee-centric onboarding solution to give new employees a welcoming first experience. Our customizable employee onboarding product ensures that your company makes the perfect first impression on new employees using VCIP, priming them for a long and productive relationship with your company. Get to Know how Signdesk can help your business Get to Know how Signdesk can help your business",
    "Welcome to SignDesk's (referred to as \"Policyâ€). SignDesk.com is owned by Desk Nine Private Limited. SignDesk.com, Desk Nine Private Limited, its affiliates, sister companies, and subsidiaries (collectively, \"SignDeskâ€, \"weâ€, \"our†or \"usâ€) are engaged inter alia in the business of providing AI based digital documentation solutions, more fully described in our of Use , and any other policies we may make available on the Platform from time to time (collectively, \" â€). This Policy outlines our practices in relation to the collection, storage, usage, processing, and disclosure of personal data that you have chosen to share with us when you access, use, or otherwise interact with our website available at www.signdesk.com or our mobile application (collectively, \"Platformâ€), avail products or services that SignDesk offers you on or though the Platform, or partner with us to provide customers with these services (collectively, the \"Servicesâ€). At SignDesk, we are committed to respecting your privacy and protecting your personal data. In order to provide you with access to the Services, we have to collect and otherwise process certain data about you. This Policy explains how we process and use personal data about you. By interacting with us, submitting information to us, and using the Services, you confirm that you have read and agree to be bound by this Policy and consent to the collection, use, disclosure, and/or retention of your personal information in accordance with the processing activities described under this Policy. In certain circumstances you may provide us with the personal data of other individuals such as your business partners, customers, clients, users, or vendors. You represent and warrant that you have obtained such individuals' informed consent for their personal data to be collected, used, or disclosed in accordance with this Policy. Your information will be used in other ways for which specific notice may be provided at the time of collection. This supplements but does not supersede nor replace any other consent which you may have previously provided to us, nor does it affect any right that we may have at law in connection with the collection, use, disclosure and/or retention of your personal data. Please refer to Section 1 to understand how the of this Policy apply to you. 1. BACKGROUND AND KEY INFORMATION About Us: The Services are made available to you by SignDesk. If you have any questions about this Policy, how we process or handle your personal data, or otherwise, you may reach out to us with your queries, grievances, feedback, and comments by contacting our grievance officer/data protection officer whose details are provided below. Name: Sudhanva Siddhant Holla Designation: Grievance Officer/ Data Protection Officer Email: privacy@signdesk.com How this Policy applies: This Policy applies to all natural and legal persons' and individuals who are competent to contract and who access or use our website, mobile applications, or other products or services made available by us or prospective customers of our products and services (hereafter, \"Usersâ€) and our clients who use the Platform to provide the Services to their Users (\"Clientsâ€). For the avoidance of doubt, references to \"you†across this Policy are to Users and Clients. By using the Services, you consent to the collection, storage, usage, and disclosure of your personal data, as described in, and collected by us in accordance with this Policy. Data Controller: SignDesk is a controller for any information directly received through your use of the Platform. SignDesk is committed to process such data fairly and reasonably and in a manner that protects the interest of the Users. We solely determine the manner in which your personal data is processed. Data Processor: In case you use the Platform through our Clients, SignDesk is a processor and your data shall be controlled through in the manner provided in their . Any data collected from you is solely limited to your use of the Platform. Our Clients shall be the data controller in this regard. Third-Party Links: The Platform may include links to third-party websites, plug-ins, applications, and services. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for such sites' content, any use of such sites, or their privacy statements or the security of any data shared with such third-party websites. Once you have left our website, we cannot be responsible for the protection and privacy of any personal data which you provide. When you leave the Platform or otherwise access such websites, plug-ins, applications, and services, we encourage you to read the made available by the third-party. 2. PERSONAL DATA THAT WE COLLECT When you use the Services as a User, we collect different types of personal data about you. This includes but is not limited to: Contact Data, such as your email address, location, pin code and phone numbers. Identity and Profile Data, such as your name, government issued identifier (Aadhaar and PAN details), passport, or other identification number, telephone numbers, username or similar identifiers, age, photographs, gender, and type of business, business information. Marketing and Communications Data, such as your email address, information posted in service requests, offers, wants, feedback, comments, and discussions in our blog and chat boxes, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), and other technology on the devices that you use to access the Platform. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. When you use the Services as a Client, we collect different types of personal data about you. This includes but is not limited to: Contact Data, such as email addresses, phone numbers, location, pincode, permanent address, and registered offices. Identity and Profile-related Data, such as your name, your authorized representative's name and details, mobile number, gender, date of birth, age, address, zip code, description of services provided, content and information about your business including photographs and videos, credit or debit card details, government-issued identifiers (Aadhaar details, PAN details), cancelled cheque, GST details, tax residency certificate, information from testimonials, polls, surveys, and feedbacks. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), device metadata, and other technology on the devices that you use to access the Platform. Marketing and Communications Data, such as feedback, comments, and discussions in our blog, responses, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. We also collect, use, and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data under law as it does not directly or indirectly reveal your identity. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this Policy. What happens if I refuse to provide my personal data? Where we need to collect personal data by law, or under the of a contract (such as the ), and you fail to provide that data when requested, we may not be able to perform the contract (for example, to provide you with the Services). In this case, we may have to cancel or limit your access to the Services, but we will, where reasonably practical, notify you if this is the case at the time. The Platform is not intended or designed to attract or be otherwise used by children under the age of 18 years. It is not intended to collect personal information from or about children under the age of 18 years. Children under the age of 18 years should not submit their personal data via the Platform. If you believe that your child has submitted personal information and you would like to request that their information be removed from our systems, please submit a request to the Grievance Officer/ Data Protection Officer in the manner described in Section 1(a) to this Policy and reasonable efforts will be made to comply with your request within 30 (Thirty) days of the request. 3.HOW DO WE COLLECT PERSONAL DATA? We use different methods to collect personal data from and about you including through: Direct Interactions. You provide us your personal data when you interact with us. This includes personal data you provide when you, for example: create an account or profile with us at the time of registration; use the Platform or the Services; request marketing communications to be sent to you; or report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials. create an account or profile with us at the time of registration on the Platform, or through third party social media platforms (including but not limited to Facebook, Google, or Gmail); submit an enquiry or a quote request with us; use the Platform or the Services; request that we contact you and/or interact with our customer servicing team via our communication channels such as a phone call; facilitate payments through the Platform; complete purchase orders, requests or applications for our products or services (by phone, in person, snail mail, or electronically); interact with our promotional advertisements or social media posts, whether inadvertently or otherwise through any third party platforms; report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials; perform an online transaction; respond to our request for additional personal data; or submit your personal data to us for any other reason; provide us with camera permissions that allows you to upload any picture straight from the camera; or provide us with access to your photo gallery that allows you to upload any picture from your photo gallery. We also collect information from mobile devices for a better user experience like: Camera (Pictures): Granting camera permission allows the user to upload any picture straight from the camera, you can safely deny camera permissions for this. Photo Gallery (Pictures): Granting photo gallery access allows the user to upload any picture from their photo gallery, you can safely deny photo gallery access for this. Automated technologies or interactions. We automatically collect Technical Data about your operating system, equipment, browsing actions, and patterns each time you use the Platform. We collect this personal data by using cookies, web beacons, pixel tags, server logs, and other similar technologies. We may also receive Technical Data about you if you visit other websites that employ our cookies. We may also collect information about your usage and browsing habits using various web-based technologies. Third parties or publicly available sources. We will receive personal data about you from various third parties, including, without limitation: Technical Data from analytics providers such as Google Analytics, Google and advertising networks; Our business partners or our Clients through which you create or access the Platform, such as payment providers, social media services, or applications or websites who use our APIs or whose API we use; Background verifiers; Credit reference bodies, regulatory and law enforcement authorities, for reasons including delivery of our products and/or services, performance of conditions of agreements and/or to comply with our legal and regulatory obligations; Identity and profile-related data from publicly available sources; and Marketing service providers. 4. HOW DO WE USE YOUR PERSONAL DATA? We will only use your personal data when the law allows us to do so. Most commonly, we will use your personal data where we need to provide the Services, or where we need to comply with a legal obligation. We use your personal data for the following purposes: to communicate with you; to maintain and improve customer relationship; to administer and process any payments related to products, services and/or facilities requested by you; to establish your identity and background; to verify your identity, and create your user account with us on the Platform at the time of registration and to manage your account, including access to your purchase history; to provide the Services to you including processing your order and providing you with end-to-end interior design and execution services;, and to administer or otherwise carry out obligations to you; if you are a Client, to assess the performance of your services rendered to Users; to monitor your activities on the Platform; to monitor trends and personalise your experience; to improve the functionality of our Services based on the information and feedback we receive from you; to conduct internal marketing analysis, customer profiling activities, analysis of customer patterns and choices, planning and statistical and trend analysis in relation to our products and/or services; for product development and testing; to improve customer service to effectively respond to Users' Service requests, grievances, and support needs; to develop new product features, analyse our products, and also facilitate financial solutions and insurance that our connected to our Services; to track transactions and process payments; to send periodic notifications to manage our relationship with you including to notify you of changes to our Services, to inform you of changes and developments to our policies, and other administrative information, including for the purposes of servicing you in relation to the products and services offered to you, and to send other occasional company news and updates related to us or the Services and to receive occasional company news and updates related to us or the Services; to assist with the management of the Services offered to you, including to send you information and updates about the Services you have availed, communicate with you about and administer your participation in special events, contests, sweepstakes, programs, surveys and other offers, operate and communicate with you about our social network pages or mobile applications; to tailor ads displayed to you on the Platform and on third- party websites to your interests and history; to conduct credit reference checks and establish your creditworthiness, where necessary, in providing you with the products, services and/or facilities; to administer and protect our business and the Platform, including for troubleshooting, data analysis, system testing, and performing accounting auditing and other internal operations; to improve our business and delivery models; to perform our obligations that arise out of the arrangement we are about to enter or have entered with you; to enforce our ; to market our Services to you via SMS, phone call, email, fax, mail, social media and/or any other appropriate communication channels to members of our loyalty programmes e.g. referrals, website membership, consented social media affiliations in accordance with their consent (you may opt out of any marketing communications at any time so long as the information you wish to opt out from has no direct or indirect impact towards our users); to transfer information about you if acquired by or merged with another company or otherwise required to be transferred to another entity for the purposes of providing you with the Services; to comply with our legal obligations; and to maintain and update internal record keeping; for internal administrative purposes; to send you seasonal greetings messages from time to time; to share any of your personal data with the auditor for our internal audit and reporting purposes; to share any of your personal data pursuant to any agreement or document which you have duly entered with us for purposes of seeking legal and/or financial advice and/or for purposes of commencing legal action; to share any of your personal data with our joint venture/business partners to jointly develop products and/or services or launch marketing campaigns; to share any of your personal data with insurance companies necessary for the purpose of applying and obtaining insurance policy(ies), if necessary; to share any of your personal data with financial institutions necessary for the purpose of applying and obtaining credit facility(ies), if necessary; for audit, risk management and security purposes; for detecting, investigating and preventing fraudulent, prohibited or illegal activities; to transfer or assign our rights, interests and obligations under any agreements entered into with us; for meeting any applicable legal or regulatory requirements and making disclosure under the requirements of any applicable law, regulation, direction, court order, by-law, guideline, circular or code applicable to us; to enforce or defend our rights and your rights under, and to comply with, our obligations under the applicable laws, legislation and regulations; to respond to subpoenas, court orders, establish or exercise our legal rights, or defend ourselves against legal claims (for example the police, fraud investigation organizations, insurers, solicitors, auditors and financial advisors);. to investigate, prevent, or take action regarding illegal activities, suspected fraud, violation of the , or as otherwise required by law; to ensure Platform security; storing, hosting, backing up (whether for disaster recovery or otherwise) of personal data whether within or outside India; and to verify compliance with the governing the use of our Platform including monitoring private messages sent through our Platform private messaging service. You agree and acknowledge that by using our Services or accessing the Platform, you authorise us, our associate partners, affiliates, and end-users, customers, and partners to contact you via email, phone, or otherwise. This is to enable us to provide the Services, provide you with marketing material, and ensure that you are aware of all the features of the Services. You agree and acknowledge that any and all information pertaining to you, whether or not you directly provide it to us (via the Services or otherwise), including but not limited to personal correspondence such as emails, instructions from you, etc., may be collected, compiled, and shared by us in order to render the Services to you. This may include but not be limited to vendors, social media companies, third-party service providers, storage providers, data analytics providers, consultants, lawyers, and auditors. We may also share this information with other entities in the SignDesk group within India and across borders worldwide in connection with the above-mentioned purposes. Those countries may not have the same data protection laws as your country of residence and your personal data may be subject to applicable foreign laws. You agree and acknowledge that we may share data without your consent, when it is required by law or by any court or government agency or authority to disclose such information, or if disclosure is necessary or appropriate to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual fraudulent or illegal activity. Such disclosures are made in good faith and belief that it is reasonably necessary to do so for enforcing this Policy or the , or in order to comply with any applicable laws and regulations. 5. COOKIES We use cookies to distinguish you from other users of our Platform and remember your preferences. This helps us to provide you with a seamless user experience when you use our Platform and also allows us to improve our Services. For further information about the cookies we use, please refer to our Cookie Policy, available at. Should you wish to disable the cookies associated with these technologies you may do so by changing the settings on your browser or mobile devices. However, please note that this may affect the functionality of the Platform. 6. DISCLOSURES OF YOUR PERSONAL DATA We may share your personal data with third parties set out below for the purposes set out in Section 4: Internal third parties, which are other companies within the SignDesk group of companies. External third parties such as: Trusted third parties such as our associate partners, payment processors and service providers that provide services for us or on our behalf and based on our instructions. This includes hosting and operating our Platform, providing marketing assistance, conducting our business, fulfilling orders, processing payments and transaction-related processes, transmitting content, conducting credit-assessment risks for short term credits availed by you from us, processing your insurance-related claims, and to enable us to provide the Services to our end-users or customers. These third parties are not permitted to use or disclose your personal data except as necessary to perform services on our behalf or comply with legal requirements; If you are a User, Clients to enable them to provide specific services to you; If you are a Client, Users who seek to use the services you choose to offer through the Platform; Analytic service providers and advertising networks that conduct web analytics to help us improve our Platform and Services. These analytics providers may use cookies and other technologies to perform their services; data centres and/or servers located within or outside India for data storage purposes or otherwise; payment channels including but not limited to financial institutions for purpose of assessing, verifying, effectuating and facilitating payment of any amount due to us in connection with your purchase of our products and/or services; our joint venture/business partners, third-party product and/or service providers, suppliers, vendors, contractors, data processors or agents, that provide related products and/or services in connection with our business, or discharge or perform one or more of the herein mentioned purposes and other purposes required to operate and maintain our business, including but not limited to call centers, telecommunication companies, logistics companies, information technology companies and data centers; insurance companies for the purpose of applying and obtaining insurance policy(ies), if necessary; financial institutions, merchants, and credit card organisations in connection with your commercial transactions with us; and government agencies, law enforcement agencies, courts, tribunals, regulatory bodies, industry regulators, ministries, and/or statutory agencies or bodies, offices, or municipality in any jurisdiction, as required by law or regulators and other bodies, as required by law or regulation. We require all third parties to respect the security of your personal data and to treat it in accordance with the law. 7. ACCESS AND UPDATING YOUR PERSONAL DATA You hereby warrant that all personal data that you provide us with is accurate, up-to-date, and true. When you use our Services, we make best efforts to provide you with the ability to access and correct inaccurate or deficient data, subject to any legal requirements. 8. TRANSFERS OF YOUR PERSONAL DATA We comply with applicable laws in respect of storage and transfers of personal data, and ensure that the recipient of your personal data ensures a level of data protection comparable to the standards under applicable laws. As a part of your use of the Services, the information and personal data you provide to us may be transferred to and stored in countries other than the country you are based in, in accordance with the procedure prescribed under applicable laws. This may happen if any of our servers are from time to time located in a country other than the one you are based, or one of our service providers is located in a country other than one you are based in. By submitting your information and personal data to us, you agree to the transfer, storage, and processing of such information and personal data in the manner described above. 9. DATA SECURITY We implement appropriate security measures to protect your personal data from unauthorised access, and follow standards prescribed by applicable law. We implement physical, electronic, and managerial privacy protective features such as encryption, password protection and role-based access control. We have implemented various strategies, controls, policies, and measures to keep your data secure and keep these measures under close review. We do our best to ensure that your data is protected and only accessible to SignDesk Group employees (or subcontractors) who need it to carry out their job responsibilities. We are committed to providing appropriate security controls to protect your personal information. However, no security system is perfect, and it cannot be promised that information about you will remain secure in all circumstances, including the security of your data during transmission or the security of data on your device. There is always a risk that a third party, without authorisation, might unlawfully access the systems or otherwise access personal information. We are also not responsible for the authenticity of any information which is provided by you or otherwise collected from your use of the Services, whether personal or otherwise. It is important that you also play a role in keeping your personal data safe and secure. When signing up for an online account, please be sure to choose an account password that would be difficult for others to guess and never reveal your password to anyone else. You are responsible for keeping this password confidential and for any use of your account. If you use a shared or public computer, never choose to have your login ID/email address or password remembered and make sure to of your account every time you leave the computer. You should also make use of any privacy settings or controls we provide you in our Platform. Please further note that identity theft and the practice known as \"phishing\" are of great concern to us. Safeguarding information to help protect you from identity theft is a top priority. We do not and will not, at any time, request your credit card information or national identification numbers in a non-secure or unsolicited e-mail or telephone communication. 10. DATA RETENTION You agree and acknowledge that your personal data will continue to be stored and retained by us for as long as necessary to fulfil our stated purpose(s) and for a reasonable period after the termination of your account on the Platform or access to the Services to comply with our legal rights and obligations. In some circumstances, we may aggregate your personal data (so that it can no longer be associated with you) for research or statistical purposes, in which case we may use this information indefinitely without further notice to you. 11. DATA RIGHTS SignDesk would like to make sure you are fully aware of all of your data protection rights. Every user is entitled to the following: The right to access – You have the right to request SignDesk for copies of your personal data. We may charge you a small fee for this service depending on the jurisdiction where the request is made. The right to rectification – You have the right to request SignDesk to correct any information you believe is inaccurate. You also have the right to request SignDesk to complete the information you believe is incomplete. The right to erasure – You have the right to request SignDesk to erase your personal data, under certain conditions. The right to restrict processing – You have the right to request SignDesk to restrict the processing of your personal data, under certain conditions. The right to object to processing – You have the right to object to SignDesk's processing of your personal data, under certain conditions. The right to data portability – You have the right to request SignDesk to transfer the data that we have collected to another organization, or directly to you, under certain conditions. The right to object to automated decision making – You have the right to request SignDesk to not be a subject to automated decision making in a way that adversely affects your legal rights, under certain conditions. If you make a request, we will respond to you within 1 month of receipt of such request. If you would like to exercise any of these rights, please contact our Grievance Officer through the contact information provided above. Please note that these data protection rights are subject to the jurisdiction where you reside, these may be applied differently according to applicable laws. 12. BUSINESS TRANSITIONS You are aware that in the event we go through or propose to go through a business transition, such as a merger, acquisition by another organisation, or sale of all or a portion of our assets, reorganisation or in the event of bankruptcy, your personal data might be among the assets transferred or sold or otherwise shared. Should such a sale or transfer occur, we will use reasonable efforts to direct the transferee to use personal information you have provided to us in a manner that is consistent with our Policy. Following such a sale or transfer, you may contact the entity to which we transferred your personal information with any inquiries concerning the processing of that information. 13. UPDATES TO THIS POLICY We regularly review and may occasionally update our Policy. If we make changes to this Policy, we will notify you of the changes through the Platform or through other means, such as email. We encourage you to periodically review this Policy for the latest information on our privacy practices. If you do not agree with our processing activities as described in this Policy, please do not access or use the Services. It is also important that the personal data we hold about you is accurate and current. Please keep us informed if your personal data changes during your relationship with us. To the extent permitted under applicable law, by accessing our Platform or Services after such notice, you consent to updates made to this Policy. Welcome to SignDesk's (referred to as \"Policyâ€). SignDesk.com is owned by Desk Nine Private Limited. SignDesk.com, Desk Nine Private Limited, its affiliates, sister companies, and subsidiaries (collectively, \"SignDeskâ€, \"weâ€, \"our†or \"usâ€) are engaged inter alia in the business of providing AI based digital documentation solutions, more fully described in our of Use , and any other policies we may make available on the Platform from time to time (collectively, \" â€). This Policy outlines our practices in relation to the collection, storage, usage, processing, and disclosure of personal data that you have chosen to share with us when you access, use, or otherwise interact with our website available at www.signdesk.com or our mobile application (collectively, \"Platformâ€), avail products or services that SignDesk offers you on or though the Platform, or partner with us to provide customers with these services (collectively, the \"Servicesâ€). At SignDesk, we are committed to respecting your privacy and protecting your personal data. In order to provide you with access to the Services, we have to collect and otherwise process certain data about you. This Policy explains how we process and use personal data about you. By interacting with us, submitting information to us, and using the Services, you confirm that you have read and agree to be bound by this Policy and consent to the collection, use, disclosure, and/or retention of your personal information in accordance with the processing activities described under this Policy. In certain circumstances you may provide us with the personal data of other individuals such as your business partners, customers, clients, users, or vendors. You represent and warrant that you have obtained such individuals' informed consent for their personal data to be collected, used, or disclosed in accordance with this Policy. Your information will be used in other ways for which specific notice may be provided at the time of collection. This supplements but does not supersede nor replace any other consent which you may have previously provided to us, nor does it affect any right that we may have at law in connection with the collection, use, disclosure and/or retention of your personal data. Please refer to Section 1 to understand how the of this Policy apply to you. 1. BACKGROUND AND KEY INFORMATION About Us: The Services are made available to you by SignDesk. If you have any questions about this Policy, how we process or handle your personal data, or otherwise, you may reach out to us with your queries, grievances, feedback, and comments by contacting our grievance officer/data protection officer whose details are provided below. Name: Sudhanva Siddhant Holla Designation: Grievance Officer/ Data Protection Officer Email: privacy@signdesk.com The Services are made available to you by SignDesk. If you have any questions about this Policy, how we process or handle your personal data, or otherwise, you may reach out to us with your queries, grievances, feedback, and comments by contacting our grievance officer/data protection officer whose details are provided below. Name: Sudhanva Siddhant Holla Designation: Grievance Officer/ Data Protection Officer How this Policy applies: This Policy applies to all natural and legal persons' and individuals who are competent to contract and who access or use our website, mobile applications, or other products or services made available by us or prospective customers of our products and services (hereafter, \"Usersâ€) and our clients who use the Platform to provide the Services to their Users (\"Clientsâ€). For the avoidance of doubt, references to \"you†across this Policy are to Users and Clients. By using the Services, you consent to the collection, storage, usage, and disclosure of your personal data, as described in, and collected by us in accordance with this Policy. This Policy applies to all natural and legal persons' and individuals who are competent to contract and who access or use our website, mobile applications, or other products or services made available by us or prospective customers of our products and services (hereafter, \"Usersâ€) and our clients who use the Platform to provide the Services to their Users (\"Clientsâ€). For the avoidance of doubt, references to \"you†across this Policy are to Users and Clients. By using the Services, you consent to the collection, storage, usage, and disclosure of your personal data, as described in, and collected by us in accordance with this Policy. Data Controller: SignDesk is a controller for any information directly received through your use of the Platform. SignDesk is committed to process such data fairly and reasonably and in a manner that protects the interest of the Users. We solely determine the manner in which your personal data is processed. SignDesk is a controller for any information directly received through your use of the Platform. SignDesk is committed to process such data fairly and reasonably and in a manner that protects the interest of the Users. We solely determine the manner in which your personal data is processed. Data Processor: In case you use the Platform through our Clients, SignDesk is a processor and your data shall be controlled through in the manner provided in their . Any data collected from you is solely limited to your use of the Platform. Our Clients shall be the data controller in this regard. In case you use the Platform through our Clients, SignDesk is a processor and your data shall be controlled through in the manner provided in their . Any data collected from you is solely limited to your use of the Platform. Our Clients shall be the data controller in this regard. Third-Party Links: The Platform may include links to third-party websites, plug-ins, applications, and services. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for such sites' content, any use of such sites, or their privacy statements or the security of any data shared with such third-party websites. Once you have left our website, we cannot be responsible for the protection and privacy of any personal data which you provide. When you leave the Platform or otherwise access such websites, plug-ins, applications, and services, we encourage you to read the made available by the third-party. The Platform may include links to third-party websites, plug-ins, applications, and services. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for such sites' content, any use of such sites, or their privacy statements or the security of any data shared with such third-party websites. Once you have left our website, we cannot be responsible for the protection and privacy of any personal data which you provide. When you leave the Platform or otherwise access such websites, plug-ins, applications, and services, we encourage you to read the made available by the third-party. 2. PERSONAL DATA THAT WE COLLECT When you use the Services as a User, we collect different types of personal data about you. This includes but is not limited to: Contact Data, such as your email address, location, pin code and phone numbers. Identity and Profile Data, such as your name, government issued identifier (Aadhaar and PAN details), passport, or other identification number, telephone numbers, username or similar identifiers, age, photographs, gender, and type of business, business information. Marketing and Communications Data, such as your email address, information posted in service requests, offers, wants, feedback, comments, and discussions in our blog and chat boxes, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), and other technology on the devices that you use to access the Platform. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. Contact Data, such as your email address, location, pin code and phone numbers. Identity and Profile Data, such as your name, government issued identifier (Aadhaar and PAN details), passport, or other identification number, telephone numbers, username or similar identifiers, age, photographs, gender, and type of business, business information. Marketing and Communications Data, such as your email address, information posted in service requests, offers, wants, feedback, comments, and discussions in our blog and chat boxes, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), and other technology on the devices that you use to access the Platform. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. When you use the Services as a Client, we collect different types of personal data about you. This includes but is not limited to: Contact Data, such as email addresses, phone numbers, location, pincode, permanent address, and registered offices. Identity and Profile-related Data, such as your name, your authorized representative's name and details, mobile number, gender, date of birth, age, address, zip code, description of services provided, content and information about your business including photographs and videos, credit or debit card details, government-issued identifiers (Aadhaar details, PAN details), cancelled cheque, GST details, tax residency certificate, information from testimonials, polls, surveys, and feedbacks. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), device metadata, and other technology on the devices that you use to access the Platform. Marketing and Communications Data, such as feedback, comments, and discussions in our blog, responses, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. Contact Data, such as email addresses, phone numbers, location, pincode, permanent address, and registered offices. Identity and Profile-related Data, such as your name, your authorized representative's name and details, mobile number, gender, date of birth, age, address, zip code, description of services provided, content and information about your business including photographs and videos, credit or debit card details, government-issued identifiers (Aadhaar details, PAN details), cancelled cheque, GST details, tax residency certificate, information from testimonials, polls, surveys, and feedbacks. Technical Data, which includes your IP address, browser type, internet service provider, details of operating system, registered domain or home server, access time, page views, device ID, device type, frequency of visiting our website and use of the Platform, website and mobile application activity, clicks, date, API Logs, and time stamps, location data, search , search results, access times, and referring website's address(es), device metadata, and other technology on the devices that you use to access the Platform. Marketing and Communications Data, such as feedback, comments, and discussions in our blog, responses, your preferences in receiving marketing communications from us and our third parties, and your communication preferences. Transaction Data, such as details of the Services you have availed, your credit or debit card details for tracking transactions that you may provide us through our payment processors, including banking details and UPI IDs for processing payments, as applicable. Usage Data, which includes information about how you use the Services, your activity on the Platform, user taps and clicks, user interests, time spent on the Platform, details About User journey on the mobile application, and page views. We also collect, use, and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data under law as it does not directly or indirectly reveal your identity. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this Policy. What happens if I refuse to provide my personal data? Where we need to collect personal data by law, or under the of a contract (such as the ), and you fail to provide that data when requested, we may not be able to perform the contract (for example, to provide you with the Services). In this case, we may have to cancel or limit your access to the Services, but we will, where reasonably practical, notify you if this is the case at the time. Where we need to collect personal data by law, or under the of a contract (such as the ), and you fail to provide that data when requested, we may not be able to perform the contract (for example, to provide you with the Services). In this case, we may have to cancel or limit your access to the Services, but we will, where reasonably practical, notify you if this is the case at the time. The Platform is not intended or designed to attract or be otherwise used by children under the age of 18 years. It is not intended to collect personal information from or about children under the age of 18 years. Children under the age of 18 years should not submit their personal data via the Platform. If you believe that your child has submitted personal information and you would like to request that their information be removed from our systems, please submit a request to the Grievance Officer/ Data Protection Officer in the manner described in Section 1(a) to this Policy and reasonable efforts will be made to comply with your request within 30 (Thirty) days of the request. 3.HOW DO WE COLLECT PERSONAL DATA? We use different methods to collect personal data from and about you including through: Direct Interactions. You provide us your personal data when you interact with us. This includes personal data you provide when you, for example: create an account or profile with us at the time of registration; use the Platform or the Services; request marketing communications to be sent to you; or report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials. create an account or profile with us at the time of registration on the Platform, or through third party social media platforms (including but not limited to Facebook, Google, or Gmail); submit an enquiry or a quote request with us; use the Platform or the Services; request that we contact you and/or interact with our customer servicing team via our communication channels such as a phone call; facilitate payments through the Platform; complete purchase orders, requests or applications for our products or services (by phone, in person, snail mail, or electronically); interact with our promotional advertisements or social media posts, whether inadvertently or otherwise through any third party platforms; report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials; perform an online transaction; respond to our request for additional personal data; or submit your personal data to us for any other reason; provide us with camera permissions that allows you to upload any picture straight from the camera; or provide us with access to your photo gallery that allows you to upload any picture from your photo gallery. We also collect information from mobile devices for a better user experience like: Camera (Pictures): Granting camera permission allows the user to upload any picture straight from the camera, you can safely deny camera permissions for this. Photo Gallery (Pictures): Granting photo gallery access allows the user to upload any picture from their photo gallery, you can safely deny photo gallery access for this. create an account or profile with us at the time of registration; use the Platform or the Services; request marketing communications to be sent to you; or report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials. create an account or profile with us at the time of registration on the Platform, or through third party social media platforms (including but not limited to Facebook, Google, or Gmail); submit an enquiry or a quote request with us; use the Platform or the Services; request that we contact you and/or interact with our customer servicing team via our communication channels such as a phone call; facilitate payments through the Platform; complete purchase orders, requests or applications for our products or services (by phone, in person, snail mail, or electronically); interact with our promotional advertisements or social media posts, whether inadvertently or otherwise through any third party platforms; report a problem with the Platform and/or our Services, give us feedback, contact us, or provide testimonials; perform an online transaction; respond to our request for additional personal data; or submit your personal data to us for any other reason; provide us with camera permissions that allows you to upload any picture straight from the camera; or provide us with access to your photo gallery that allows you to upload any picture from your photo gallery. We also collect information from mobile devices for a better user experience like: Camera (Pictures): Granting camera permission allows the user to upload any picture straight from the camera, you can safely deny camera permissions for this. Photo Gallery (Pictures): Granting photo gallery access allows the user to upload any picture from their photo gallery, you can safely deny photo gallery access for this. Automated technologies or interactions. We automatically collect Technical Data about your operating system, equipment, browsing actions, and patterns each time you use the Platform. We collect this personal data by using cookies, web beacons, pixel tags, server logs, and other similar technologies. We may also receive Technical Data about you if you visit other websites that employ our cookies. We may also collect information about your usage and browsing habits using various web-based technologies. Third parties or publicly available sources. We will receive personal data about you from various third parties, including, without limitation: Technical Data from analytics providers such as Google Analytics, Google and advertising networks; Our business partners or our Clients through which you create or access the Platform, such as payment providers, social media services, or applications or websites who use our APIs or whose API we use; Background verifiers; Credit reference bodies, regulatory and law enforcement authorities, for reasons including delivery of our products and/or services, performance of conditions of agreements and/or to comply with our legal and regulatory obligations; Identity and profile-related data from publicly available sources; and Marketing service providers. Technical Data from analytics providers such as Google Analytics, Google and advertising networks; Our business partners or our Clients through which you create or access the Platform, such as payment providers, social media services, or applications or websites who use our APIs or whose API we use; Credit reference bodies, regulatory and law enforcement authorities, for reasons including delivery of our products and/or services, performance of conditions of agreements and/or to comply with our legal and regulatory obligations; Identity and profile-related data from publicly available sources; and 4. HOW DO WE USE YOUR PERSONAL DATA? We will only use your personal data when the law allows us to do so. Most commonly, we will use your personal data where we need to provide the Services, or where we need to comply with a legal obligation. We use your personal data for the following purposes: to communicate with you; to maintain and improve customer relationship; to administer and process any payments related to products, services and/or facilities requested by you; to establish your identity and background; to verify your identity, and create your user account with us on the Platform at the time of registration and to manage your account, including access to your purchase history; to provide the Services to you including processing your order and providing you with end-to-end interior design and execution services;, and to administer or otherwise carry out obligations to you; if you are a Client, to assess the performance of your services rendered to Users; to monitor your activities on the Platform; to monitor trends and personalise your experience; to improve the functionality of our Services based on the information and feedback we receive from you; to conduct internal marketing analysis, customer profiling activities, analysis of customer patterns and choices, planning and statistical and trend analysis in relation to our products and/or services; for product development and testing; to improve customer service to effectively respond to Users' Service requests, grievances, and support needs; to develop new product features, analyse our products, and also facilitate financial solutions and insurance that our connected to our Services; to track transactions and process payments; to send periodic notifications to manage our relationship with you including to notify you of changes to our Services, to inform you of changes and developments to our policies, and other administrative information, including for the purposes of servicing you in relation to the products and services offered to you, and to send other occasional company news and updates related to us or the Services and to receive occasional company news and updates related to us or the Services; to assist with the management of the Services offered to you, including to send you information and updates about the Services you have availed, communicate with you about and administer your participation in special events, contests, sweepstakes, programs, surveys and other offers, operate and communicate with you about our social network pages or mobile applications; to tailor ads displayed to you on the Platform and on third- party websites to your interests and history; to conduct credit reference checks and establish your creditworthiness, where necessary, in providing you with the products, services and/or facilities; to administer and protect our business and the Platform, including for troubleshooting, data analysis, system testing, and performing accounting auditing and other internal operations; to improve our business and delivery models; to perform our obligations that arise out of the arrangement we are about to enter or have entered with you; to enforce our ; to market our Services to you via SMS, phone call, email, fax, mail, social media and/or any other appropriate communication channels to members of our loyalty programmes e.g. referrals, website membership, consented social media affiliations in accordance with their consent (you may opt out of any marketing communications at any time so long as the information you wish to opt out from has no direct or indirect impact towards our users); to transfer information about you if acquired by or merged with another company or otherwise required to be transferred to another entity for the purposes of providing you with the Services; to comply with our legal obligations; and to maintain and update internal record keeping; for internal administrative purposes; to send you seasonal greetings messages from time to time; to share any of your personal data with the auditor for our internal audit and reporting purposes; to share any of your personal data pursuant to any agreement or document which you have duly entered with us for purposes of seeking legal and/or financial advice and/or for purposes of commencing legal action; to share any of your personal data with our joint venture/business partners to jointly develop products and/or services or launch marketing campaigns; to share any of your personal data with insurance companies necessary for the purpose of applying and obtaining insurance policy(ies), if necessary; to share any of your personal data with financial institutions necessary for the purpose of applying and obtaining credit facility(ies), if necessary; for audit, risk management and security purposes; for detecting, investigating and preventing fraudulent, prohibited or illegal activities; to transfer or assign our rights, interests and obligations under any agreements entered into with us; for meeting any applicable legal or regulatory requirements and making disclosure under the requirements of any applicable law, regulation, direction, court order, by-law, guideline, circular or code applicable to us; to enforce or defend our rights and your rights under, and to comply with, our obligations under the applicable laws, legislation and regulations; to respond to subpoenas, court orders, establish or exercise our legal rights, or defend ourselves against legal claims (for example the police, fraud investigation organizations, insurers, solicitors, auditors and financial advisors);. to investigate, prevent, or take action regarding illegal activities, suspected fraud, violation of the , or as otherwise required by law; to ensure Platform security; storing, hosting, backing up (whether for disaster recovery or otherwise) of personal data whether within or outside India; and to verify compliance with the governing the use of our Platform including monitoring private messages sent through our Platform private messaging service. to communicate with you; to maintain and improve customer relationship; to administer and process any payments related to products, services and/or facilities requested by you; to establish your identity and background; to verify your identity, and create your user account with us on the Platform at the time of registration and to manage your account, including access to your purchase history; to provide the Services to you including processing your order and providing you with end-to-end interior design and execution services;, and to administer or otherwise carry out obligations to you; if you are a Client, to assess the performance of your services rendered to Users; to monitor your activities on the Platform; to monitor trends and personalise your experience; to improve the functionality of our Services based on the information and feedback we receive from you; to conduct internal marketing analysis, customer profiling activities, analysis of customer patterns and choices, planning and statistical and trend analysis in relation to our products and/or services; for product development and testing; to improve customer service to effectively respond to Users' Service requests, grievances, and support needs; to develop new product features, analyse our products, and also facilitate financial solutions and insurance that our connected to our Services; to track transactions and process payments; to send periodic notifications to manage our relationship with you including to notify you of changes to our Services, to inform you of changes and developments to our policies, and other administrative information, including for the purposes of servicing you in relation to the products and services offered to you, and to send other occasional company news and updates related to us or the Services and to receive occasional company news and updates related to us or the Services; to assist with the management of the Services offered to you, including to send you information and updates about the Services you have availed, communicate with you about and administer your participation in special events, contests, sweepstakes, programs, surveys and other offers, operate and communicate with you about our social network pages or mobile applications; to tailor ads displayed to you on the Platform and on third- party websites to your interests and history; to conduct credit reference checks and establish your creditworthiness, where necessary, in providing you with the products, services and/or facilities; to administer and protect our business and the Platform, including for troubleshooting, data analysis, system testing, and performing accounting auditing and other internal operations; to improve our business and delivery models; to perform our obligations that arise out of the arrangement we are about to enter or have entered with you; to enforce our ; to market our Services to you via SMS, phone call, email, fax, mail, social media and/or any other appropriate communication channels to members of our loyalty programmes e.g. referrals, website membership, consented social media affiliations in accordance with their consent (you may opt out of any marketing communications at any time so long as the information you wish to opt out from has no direct or indirect impact towards our users); to transfer information about you if acquired by or merged with another company or otherwise required to be transferred to another entity for the purposes of providing you with the Services; to comply with our legal obligations; and to maintain and update internal record keeping; for internal administrative purposes; to send you seasonal greetings messages from time to time; to share any of your personal data with the auditor for our internal audit and reporting purposes; to share any of your personal data pursuant to any agreement or document which you have duly entered with us for purposes of seeking legal and/or financial advice and/or for purposes of commencing legal action; to share any of your personal data with our joint venture/business partners to jointly develop products and/or services or launch marketing campaigns; to share any of your personal data with insurance companies necessary for the purpose of applying and obtaining insurance policy(ies), if necessary; to share any of your personal data with financial institutions necessary for the purpose of applying and obtaining credit facility(ies), if necessary; for audit, risk management and security purposes; for detecting, investigating and preventing fraudulent, prohibited or illegal activities; to transfer or assign our rights, interests and obligations under any agreements entered into with us; for meeting any applicable legal or regulatory requirements and making disclosure under the requirements of any applicable law, regulation, direction, court order, by-law, guideline, circular or code applicable to us; to enforce or defend our rights and your rights under, and to comply with, our obligations under the applicable laws, legislation and regulations; to respond to subpoenas, court orders, establish or exercise our legal rights, or defend ourselves against legal claims (for example the police, fraud investigation organizations, insurers, solicitors, auditors and financial advisors);. to investigate, prevent, or take action regarding illegal activities, suspected fraud, violation of the , or as otherwise required by law; to ensure Platform security; storing, hosting, backing up (whether for disaster recovery or otherwise) of personal data whether within or outside India; and to verify compliance with the governing the use of our Platform including monitoring private messages sent through our Platform private messaging service. You agree and acknowledge that by using our Services or accessing the Platform, you authorise us, our associate partners, affiliates, and end-users, customers, and partners to contact you via email, phone, or otherwise. This is to enable us to provide the Services, provide you with marketing material, and ensure that you are aware of all the features of the Services. You agree and acknowledge that any and all information pertaining to you, whether or not you directly provide it to us (via the Services or otherwise), including but not limited to personal correspondence such as emails, instructions from you, etc., may be collected, compiled, and shared by us in order to render the Services to you. This may include but not be limited to vendors, social media companies, third-party service providers, storage providers, data analytics providers, consultants, lawyers, and auditors. We may also share this information with other entities in the SignDesk group within India and across borders worldwide in connection with the above-mentioned purposes. Those countries may not have the same data protection laws as your country of residence and your personal data may be subject to applicable foreign laws. You agree and acknowledge that we may share data without your consent, when it is required by law or by any court or government agency or authority to disclose such information, or if disclosure is necessary or appropriate to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual fraudulent or illegal activity. Such disclosures are made in good faith and belief that it is reasonably necessary to do so for enforcing this Policy or the , or in order to comply with any applicable laws and regulations. We use cookies to distinguish you from other users of our Platform and remember your preferences. This helps us to provide you with a seamless user experience when you use our Platform and also allows us to improve our Services. For further information about the cookies we use, please refer to our Cookie Policy, available at. Should you wish to disable the cookies associated with these technologies you may do so by changing the settings on your browser or mobile devices. However, please note that this may affect the functionality of the Platform. 6. DISCLOSURES OF YOUR PERSONAL DATA We may share your personal data with third parties set out below for the purposes set out in Section 4: Internal third parties, which are other companies within the SignDesk group of companies. External third parties such as: Trusted third parties such as our associate partners, payment processors and service providers that provide services for us or on our behalf and based on our instructions. This includes hosting and operating our Platform, providing marketing assistance, conducting our business, fulfilling orders, processing payments and transaction-related processes, transmitting content, conducting credit-assessment risks for short term credits availed by you from us, processing your insurance-related claims, and to enable us to provide the Services to our end-users or customers. These third parties are not permitted to use or disclose your personal data except as necessary to perform services on our behalf or comply with legal requirements; If you are a User, Clients to enable them to provide specific services to you; If you are a Client, Users who seek to use the services you choose to offer through the Platform; Analytic service providers and advertising networks that conduct web analytics to help us improve our Platform and Services. These analytics providers may use cookies and other technologies to perform their services; data centres and/or servers located within or outside India for data storage purposes or otherwise; payment channels including but not limited to financial institutions for purpose of assessing, verifying, effectuating and facilitating payment of any amount due to us in connection with your purchase of our products and/or services; our joint venture/business partners, third-party product and/or service providers, suppliers, vendors, contractors, data processors or agents, that provide related products and/or services in connection with our business, or discharge or perform one or more of the herein mentioned purposes and other purposes required to operate and maintain our business, including but not limited to call centers, telecommunication companies, logistics companies, information technology companies and data centers; insurance companies for the purpose of applying and obtaining insurance policy(ies), if necessary; financial institutions, merchants, and credit card organisations in connection with your commercial transactions with us; and government agencies, law enforcement agencies, courts, tribunals, regulatory bodies, industry regulators, ministries, and/or statutory agencies or bodies, offices, or municipality in any jurisdiction, as required by law or regulators and other bodies, as required by law or regulation. We require all third parties to respect the security of your personal data and to treat it in accordance with the law. Internal third parties, which are other companies within the SignDesk group of companies. External third parties such as: Trusted third parties such as our associate partners, payment processors and service providers that provide services for us or on our behalf and based on our instructions. This includes hosting and operating our Platform, providing marketing assistance, conducting our business, fulfilling orders, processing payments and transaction-related processes, transmitting content, conducting credit-assessment risks for short term credits availed by you from us, processing your insurance-related claims, and to enable us to provide the Services to our end-users or customers. These third parties are not permitted to use or disclose your personal data except as necessary to perform services on our behalf or comply with legal requirements; If you are a User, Clients to enable them to provide specific services to you; If you are a Client, Users who seek to use the services you choose to offer through the Platform; Analytic service providers and advertising networks that conduct web analytics to help us improve our Platform and Services. These analytics providers may use cookies and other technologies to perform their services; data centres and/or servers located within or outside India for data storage purposes or otherwise; payment channels including but not limited to financial institutions for purpose of assessing, verifying, effectuating and facilitating payment of any amount due to us in connection with your purchase of our products and/or services; our joint venture/business partners, third-party product and/or service providers, suppliers, vendors, contractors, data processors or agents, that provide related products and/or services in connection with our business, or discharge or perform one or more of the herein mentioned purposes and other purposes required to operate and maintain our business, including but not limited to call centers, telecommunication companies, logistics companies, information technology companies and data centers; insurance companies for the purpose of applying and obtaining insurance policy(ies), if necessary; financial institutions, merchants, and credit card organisations in connection with your commercial transactions with us; and government agencies, law enforcement agencies, courts, tribunals, regulatory bodies, industry regulators, ministries, and/or statutory agencies or bodies, offices, or municipality in any jurisdiction, as required by law or regulators and other bodies, as required by law or regulation. Trusted third parties such as our associate partners, payment processors and service providers that provide services for us or on our behalf and based on our instructions. This includes hosting and operating our Platform, providing marketing assistance, conducting our business, fulfilling orders, processing payments and transaction-related processes, transmitting content, conducting credit-assessment risks for short term credits availed by you from us, processing your insurance-related claims, and to enable us to provide the Services to our end-users or customers. These third parties are not permitted to use or disclose your personal data except as necessary to perform services on our behalf or comply with legal requirements; If you are a User, Clients to enable them to provide specific services to you; If you are a Client, Users who seek to use the services you choose to offer through the Platform; Analytic service providers and advertising networks that conduct web analytics to help us improve our Platform and Services. These analytics providers may use cookies and other technologies to perform their services; data centres and/or servers located within or outside India for data storage purposes or otherwise; payment channels including but not limited to financial institutions for purpose of assessing, verifying, effectuating and facilitating payment of any amount due to us in connection with your purchase of our products and/or services; our joint venture/business partners, third-party product and/or service providers, suppliers, vendors, contractors, data processors or agents, that provide related products and/or services in connection with our business, or discharge or perform one or more of the herein mentioned purposes and other purposes required to operate and maintain our business, including but not limited to call centers, telecommunication companies, logistics companies, information technology companies and data centers; insurance companies for the purpose of applying and obtaining insurance policy(ies), if necessary; financial institutions, merchants, and credit card organisations in connection with your commercial transactions with us; and government agencies, law enforcement agencies, courts, tribunals, regulatory bodies, industry regulators, ministries, and/or statutory agencies or bodies, offices, or municipality in any jurisdiction, as required by law or regulators and other bodies, as required by law or regulation. We require all third parties to respect the security of your personal data and to treat it in accordance with the law. 7. ACCESS AND UPDATING YOUR PERSONAL DATA You hereby warrant that all personal data that you provide us with is accurate, up-to-date, and true. When you use our Services, we make best efforts to provide you with the ability to access and correct inaccurate or deficient data, subject to any legal requirements. 8. TRANSFERS OF YOUR PERSONAL DATA We comply with applicable laws in respect of storage and transfers of personal data, and ensure that the recipient of your personal data ensures a level of data protection comparable to the standards under applicable laws. As a part of your use of the Services, the information and personal data you provide to us may be transferred to and stored in countries other than the country you are based in, in accordance with the procedure prescribed under applicable laws. This may happen if any of our servers are from time to time located in a country other than the one you are based, or one of our service providers is located in a country other than one you are based in. By submitting your information and personal data to us, you agree to the transfer, storage, and processing of such information and personal data in the manner described above. We implement appropriate security measures to protect your personal data from unauthorised access, and follow standards prescribed by applicable law. We implement physical, electronic, and managerial privacy protective features such as encryption, password protection and role-based access control. We have implemented various strategies, controls, policies, and measures to keep your data secure and keep these measures under close review. We do our best to ensure that your data is protected and only accessible to SignDesk Group employees (or subcontractors) who need it to carry out their job responsibilities. We are committed to providing appropriate security controls to protect your personal information. However, no security system is perfect, and it cannot be promised that information about you will remain secure in all circumstances, including the security of your data during transmission or the security of data on your device. There is always a risk that a third party, without authorisation, might unlawfully access the systems or otherwise access personal information. We are also not responsible for the authenticity of any information which is provided by you or otherwise collected from your use of the Services, whether personal or otherwise. It is important that you also play a role in keeping your personal data safe and secure. When signing up for an online account, please be sure to choose an account password that would be difficult for others to guess and never reveal your password to anyone else. You are responsible for keeping this password confidential and for any use of your account. If you use a shared or public computer, never choose to have your login ID/email address or password remembered and make sure to of your account every time you leave the computer. You should also make use of any privacy settings or controls we provide you in our Platform. Please further note that identity theft and the practice known as \"phishing\" are of great concern to us. Safeguarding information to help protect you from identity theft is a top priority. We do not and will not, at any time, request your credit card information or national identification numbers in a non-secure or unsolicited e-mail or telephone communication. You agree and acknowledge that your personal data will continue to be stored and retained by us for as long as necessary to fulfil our stated purpose(s) and for a reasonable period after the termination of your account on the Platform or access to the Services to comply with our legal rights and obligations. In some circumstances, we may aggregate your personal data (so that it can no longer be associated with you) for research or statistical purposes, in which case we may use this information indefinitely without further notice to you. SignDesk would like to make sure you are fully aware of all of your data protection rights. Every user is entitled to the following: The right to access – You have the right to request SignDesk for copies of your personal data. We may charge you a small fee for this service depending on the jurisdiction where the request is made. The right to rectification – You have the right to request SignDesk to correct any information you believe is inaccurate. You also have the right to request SignDesk to complete the information you believe is incomplete. The right to erasure – You have the right to request SignDesk to erase your personal data, under certain conditions. The right to restrict processing – You have the right to request SignDesk to restrict the processing of your personal data, under certain conditions. The right to object to processing – You have the right to object to SignDesk's processing of your personal data, under certain conditions. The right to data portability – You have the right to request SignDesk to transfer the data that we have collected to another organization, or directly to you, under certain conditions. The right to object to automated decision making – You have the right to request SignDesk to not be a subject to automated decision making in a way that adversely affects your legal rights, under certain conditions. The right to access – You have the right to request SignDesk for copies of your personal data. We may charge you a small fee for this service depending on the jurisdiction where the request is made. The right to rectification – You have the right to request SignDesk to correct any information you believe is inaccurate. You also have the right to request SignDesk to complete the information you believe is incomplete. The right to erasure – You have the right to request SignDesk to erase your personal data, under certain conditions. The right to restrict processing – You have the right to request SignDesk to restrict the processing of your personal data, under certain conditions. The right to object to processing – You have the right to object to SignDesk's processing of your personal data, under certain conditions. The right to data portability – You have the right to request SignDesk to transfer the data that we have collected to another organization, or directly to you, under certain conditions. The right to object to automated decision making – You have the right to request SignDesk to not be a subject to automated decision making in a way that adversely affects your legal rights, under certain conditions. If you make a request, we will respond to you within 1 month of receipt of such request. If you would like to exercise any of these rights, please contact our Grievance Officer through the contact information provided above. Please note that these data protection rights are subject to the jurisdiction where you reside, these may be applied differently according to applicable laws. You are aware that in the event we go through or propose to go through a business transition, such as a merger, acquisition by another organisation, or sale of all or a portion of our assets, reorganisation or in the event of bankruptcy, your personal data might be among the assets transferred or sold or otherwise shared. Should such a sale or transfer occur, we will use reasonable efforts to direct the transferee to use personal information you have provided to us in a manner that is consistent with our Policy. Following such a sale or transfer, you may contact the entity to which we transferred your personal information with any inquiries concerning the processing of that information. 13. UPDATES TO THIS POLICY We regularly review and may occasionally update our Policy. If we make changes to this Policy, we will notify you of the changes through the Platform or through other means, such as email. We encourage you to periodically review this Policy for the latest information on our privacy practices. If you do not agree with our processing activities as described in this Policy, please do not access or use the Services. It is also important that the personal data we hold about you is accurate and current. Please keep us informed if your personal data changes during your relationship with us. To the extent permitted under applicable law, by accessing our Platform or Services after such notice, you consent to updates made to this Policy."
  ]
}