{
  "company": "stcon.sa",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Privacy and Cookie Policy This STCON Information Technology Company (STCON LLC) Privacy and Cookie Policy covers all activities of users on https://stcon.sa website (the \"Website\"), use of applications of STCON LLC and its affiliates, as well as use of all other connected products and services, collectively referred to as the \"Services\". This Privacy and Cookie Policy describes what Personal Data and Other Information (as defined below) STCON Information Technology Company may collect online and offline, where appropriate, and how STCON Information Technology Company uses and shares such information. By using this Website, and particularly submitting your information through various contact addresses you consent to the collection, storage and use of your Personal Data and Other Information according to this policy. We reserve the right to change this Privacy and Cookie Policy as we may deem necessary from time to time or as may be required by law. STCON Information Technology Company is a company registered and operating in the Kingdom of Saudi Arabia and located at Prince Mohammed Bin Abdulaziz Road, Al Olaya Dist., Building No. 3074, Riyadh 12213, Kingdom of Saudi Arabia. When this mentions \"we\", \"us\", or \"our\" it refers to STCON Information Technology Company that is responsible for processing and control of the information you submit (\"Data Controller\"). 1. What information do we collect? STCON Information Technology Company collects information to operate our business and provide you with innovative technology solutions. We collect both Personal Data and Other Information in support of these efforts, however, STCON Information Technology Company does not collect or process any Sensitive Data. \"Personal Data\" is information that can be used, directly or indirectly, alone or together with other information, to identify you as an individual. This may include your location data , and Cookies (Please see Cookies section below for more information), except for Sensitive Data as defined below. \"Sensitive Data\" personal data revealing racial or ethnic origin, or religious, intellectual or political belief, data relating to security criminal convictions and offenses, biometric or genetic data for the purpose of identifying the person, health data, and data that indicates that one or both of the individual's parents are unknown. \"Other Information\" is information that is anonymous, aggregate, de-identified, or that otherwise does not reveal your identity. We collect and use this information to understand how you and our other customers as a whole use our Website and Services and constantly tune, enhance, innovate and build products and services to reflect the needs of customers. Generally, we do not consider Other Information to be Personal Data. Regardless, if we link together Other Information in a way that renders it individually identifiable, we will treat the combined information as Personal Data. Transparency and Choice: You control what, how, and when you share your Personal Data with STCON Information Technology Company. We want you to easily understand your rights and our obligations to you. So, we have tried to use plain language throughout this Privacy and Cookie Policy. We believe you should be able to control the use of your Personal Data — and know that you can ask us to stop, that means that you can withdraw your consent at any time. We collect Personal Data in the following ways : 1. When you register with us through the «contact us» and other functionalities as well as sending message to any e-mail displayed there, we collect registration and other details (e.g., name, username and password, contact information (such as email addresses, telephone numbers, and location), your activity on this Website. 2. When you use or interact with our Services (including, but not limited to, by filling in forms on our Website), we collect Personal Data such as traffic data, cookies, location data, IP address and other data. Other Information: We may collect Other Information about your use of our Website and Services. This includes, for example, your device type, browser type, operating system, internet domain and host name, date and time of access to our Website as well as referring and onward URL, as well as data about the activities you undertake and how you interact with our Website and Services. 2. Usage of Personal Data We use the information we collect to: Provide you with information you request (e.g. providing you with information about our software products and related services). Provide customer service to resolve technical issues you meet and/or to respond to your requests for assistance. Provide you with marketing information (in case of your consent), e.g. articles, newsletters or other content. Perform a contract we have with you. In course of your Personal Data usage, we may transfer this information to some the STCON LLC affiliate (-s) and subsidiary (-ies), if we in our sole discretion consider this necessary. All STCON LLC's affiliates and subsidiaries are committed to use and process your data in strict accordance with this policy. The Personal Data that we collect may be stored, processed and transferred between any countries and locations in which STCON LLC's affiliates and subsidiaries operate in order to enable us to use the information in accordance with this Policy. We commit ourselves to ensuring the proper level of protection of your Personal Data in all our locations where it is transferred, stored and processed. How long will we keep your Personal Data? We will retain any Personal Data you submit as long as we have an ongoing relationship with you or if we are required to retain your Personal Data by legal obligation. Your Personal Data will not be kept for longer than is necessary to fulfill the purpose for which the personal data was collected. 3. Legal basis for collecting Personal Data Collecting Personal Data based on consents . The collection of Personal Data based on consent from the data subject will be done by using «Consent Forms» that will store documentation related to the consent given by the individual. Individual consents will always be stored and documented in our systems. Collecting Personal Data based on contracts . We use Personal Data for fulfilling our obligations related to contracts and agreements with customers, partners and suppliers. Collecting Personal Data based on legitimate interest . We may use Personal Data if it is considered to be of legitimate interest to provide users with an easy-to-use and efficient site, build more useful Services, and comply with applicable law, and if the privacy interests of the data subjects do not override this interest. Normally, to establish the legal basis for data collection, an assessment has been made during which a mutual interest between STCON Information Technology Company and the individual person has been identified. This legal basis is primarily related to our sales and marketing purposes. We will always inform individuals about their privacy rights and the purpose for collecting personal data. 4. Disclosing Personal Information to Third Parties We do not sell, rent or trade your Personal Information to third parties for use in their marketing purposes. We may disclose Personal Data to the following third parties: Regulators and other competent authorities. Our distributors according to your geographic location/area to process your requests in a more efficient manner, when appropriate. Our affiliated companies. Our employees, officers, insurers, professional advisers, agents, suppliers or subcontractors insofar as reasonably necessary for the purposes set out in this Policy. Our Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This Privacy and Cookie Policy does not extend to your use of such websites. You are advised to read the of other websites prior to using them. 5. Your rights As the data subject you have the right to object to certain ways that we use your Personal Data, or to ask us to delete, remove, or stop using your Personal Data if there is no need for us to keep it. This is known as the \"right to object\" and \"right to erasure\", or the \"right to be forgotten\". Please note such requests may not always be possible due to legal obligations we may have to keep such records. You have the right to request rectification of your Personal Data so that it can be corrected or completed if it is inaccurate or incomplete. You have the right to request and obtain a copy of your Personal Data that you have provided to STCON Information Technology Company. You can withdraw any consent to Personal Data processing at any time. To exercise these rights, or If you have any questions or complaints regarding your Personal Data processing, feel free to ask us via info@stcon.sa If you remain dissatisfied, then you have the right to apply directly to your national supervisory authority for a decision. 6. Children Our Website and Services are not intended for children. If you are under 18 or otherwise would be required to obtain the consent of a parent or guardian in order to share information with STCON Information Technology Company, you should not send any information about yourself to us. If a person under 18 submits information via any part of our Website and/or Services, and we learn that the person submitting the information is under 18, we will delete this information as soon as possible. 7. Cookies This Website uses and collects cookies, including third party cookies. You may block use of cookies at any time by adjusting your browser's privacy settings, however, some functionality of this site may not work properly. Cookies are small encrypted text files that are stored on your computer or other device by our Website and allow our Website or a third-party to recognize you and make your next visit easier and our Website more useful to you. Cookies do not typically contain any information that personally identifies a user, but personal information that we store about you may be linked to the information stored in and obtained from cookies. Functional and Performance cookies Analytical/performance cookies: these cookies allow us to recognize and count the number of visitors and to see how visitors move around our Website. These helps us to improve the way our Website work, for example, by ensuring that users are finding what they are looking for easily and do not encounter technical errors. Functionality cookies: these are used to recognize you when you return to our Website. Usage of cookies of this character enables us to personalize our content for you and remember your preferences. All information these cookies collect is aggregated and anonymous. Third-Party cookies We may allow third parties to use cookies (e.g. these cookies are used by Google Analytics). Besides, our Website may have \"share\" buttons that allow users to share content of our Website with their friends on social networks. These third parties may use cookies when you are logged onto their pages and visit our Website. We do not control the cookies of third parties. Please visit these third-party websites to obtain more information about their use of cookies. There are also free programs you can download from reputable sources that allow you to set your preferences and block the vast majority of third-party cookies. Strictly Necessary cookies These are cookies that are required for the operation of our Website. We use cookies for the following reasons: For marketing purposes. To improve your experience of using our Website and our range of products and services. At no point do our cookies or those of our third parties store your personal payment information. How to manage cookies You can turn Functional and Performance cookies on and off. Strictly Necessary cookies can't be turned off. Effective Date of this : 29.02.2024 Privacy and Cookie Policy This STCON Information Technology Company (STCON LLC) Privacy and Cookie Policy covers all activities of users on https://stcon.sa website (the \"Website\"), use of applications of STCON LLC and its affiliates, as well as use of all other connected products and services, collectively referred to as the \"Services\". This Privacy and Cookie Policy describes what Personal Data and Other Information (as defined below) STCON Information Technology Company may collect online and offline, where appropriate, and how STCON Information Technology Company uses and shares such information. By using this Website, and particularly submitting your information through various contact addresses you consent to the collection, storage and use of your Personal Data and Other Information according to this policy. We reserve the right to change this Privacy and Cookie Policy as we may deem necessary from time to time or as may be required by law. STCON Information Technology Company is a company registered and operating in the Kingdom of Saudi Arabia and located at Prince Mohammed Bin Abdulaziz Road, Al Olaya Dist., Building No. 3074, Riyadh 12213, Kingdom of Saudi Arabia. When this mentions \"we\", \"us\", or \"our\" it refers to STCON Information Technology Company that is responsible for processing and control of the information you submit (\"Data Controller\"). 1. What information do we collect? STCON Information Technology Company collects information to operate our business and provide you with innovative technology solutions. We collect both Personal Data and Other Information in support of these efforts, however, STCON Information Technology Company does not collect or process any Sensitive Data. \"Personal Data\" is information that can be used, directly or indirectly, alone or together with other information, to identify you as an individual. This may include your location data , and Cookies (Please see Cookies section below for more information), except for Sensitive Data as defined below. \"Sensitive Data\" personal data revealing racial or ethnic origin, or religious, intellectual or political belief, data relating to security criminal convictions and offenses, biometric or genetic data for the purpose of identifying the person, health data, and data that indicates that one or both of the individual's parents are unknown. \"Other Information\" is information that is anonymous, aggregate, de-identified, or that otherwise does not reveal your identity. We collect and use this information to understand how you and our other customers as a whole use our Website and Services and constantly tune, enhance, innovate and build products and services to reflect the needs of customers. Generally, we do not consider Other Information to be Personal Data. Regardless, if we link together Other Information in a way that renders it individually identifiable, we will treat the combined information as Personal Data. Transparency and Choice: You control what, how, and when you share your Personal Data with STCON Information Technology Company. We want you to easily understand your rights and our obligations to you. So, we have tried to use plain language throughout this Privacy and Cookie Policy. We believe you should be able to control the use of your Personal Data — and know that you can ask us to stop, that means that you can withdraw your consent at any time. We collect Personal Data in the following ways : 1. When you register with us through the «contact us» and other functionalities as well as sending message to any e-mail displayed there, we collect registration and other details (e.g., name, username and password, contact information (such as email addresses, telephone numbers, and location), your activity on this Website. 2. When you use or interact with our Services (including, but not limited to, by filling in forms on our Website), we collect Personal Data such as traffic data, cookies, location data, IP address and other data. Other Information: We may collect Other Information about your use of our Website and Services. This includes, for example, your device type, browser type, operating system, internet domain and host name, date and time of access to our Website as well as referring and onward URL, as well as data about the activities you undertake and how you interact with our Website and Services. 2. Usage of Personal Data We use the information we collect to: Provide you with information you request (e.g. providing you with information about our software products and related services). Provide customer service to resolve technical issues you meet and/or to respond to your requests for assistance. Provide you with marketing information (in case of your consent), e.g. articles, newsletters or other content. Perform a contract we have with you. In course of your Personal Data usage, we may transfer this information to some the STCON LLC affiliate (-s) and subsidiary (-ies), if we in our sole discretion consider this necessary. All STCON LLC's affiliates and subsidiaries are committed to use and process your data in strict accordance with this policy. The Personal Data that we collect may be stored, processed and transferred between any countries and locations in which STCON LLC's affiliates and subsidiaries operate in order to enable us to use the information in accordance with this Policy. We commit ourselves to ensuring the proper level of protection of your Personal Data in all our locations where it is transferred, stored and processed. How long will we keep your Personal Data? We will retain any Personal Data you submit as long as we have an ongoing relationship with you or if we are required to retain your Personal Data by legal obligation. Your Personal Data will not be kept for longer than is necessary to fulfill the purpose for which the personal data was collected. 3. Legal basis for collecting Personal Data Collecting Personal Data based on consents . The collection of Personal Data based on consent from the data subject will be done by using «Consent Forms» that will store documentation related to the consent given by the individual. Individual consents will always be stored and documented in our systems. Collecting Personal Data based on contracts . We use Personal Data for fulfilling our obligations related to contracts and agreements with customers, partners and suppliers. Collecting Personal Data based on legitimate interest . We may use Personal Data if it is considered to be of legitimate interest to provide users with an easy-to-use and efficient site, build more useful Services, and comply with applicable law, and if the privacy interests of the data subjects do not override this interest. Normally, to establish the legal basis for data collection, an assessment has been made during which a mutual interest between STCON Information Technology Company and the individual person has been identified. This legal basis is primarily related to our sales and marketing purposes. We will always inform individuals about their privacy rights and the purpose for collecting personal data. 4. Disclosing Personal Information to Third Parties We do not sell, rent or trade your Personal Information to third parties for use in their marketing purposes. We may disclose Personal Data to the following third parties: Regulators and other competent authorities. Our distributors according to your geographic location/area to process your requests in a more efficient manner, when appropriate. Our affiliated companies. Our employees, officers, insurers, professional advisers, agents, suppliers or subcontractors insofar as reasonably necessary for the purposes set out in this Policy. Our Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This Privacy and Cookie Policy does not extend to your use of such websites. You are advised to read the of other websites prior to using them. 5. Your rights As the data subject you have the right to object to certain ways that we use your Personal Data, or to ask us to delete, remove, or stop using your Personal Data if there is no need for us to keep it. This is known as the \"right to object\" and \"right to erasure\", or the \"right to be forgotten\". Please note such requests may not always be possible due to legal obligations we may have to keep such records. You have the right to request rectification of your Personal Data so that it can be corrected or completed if it is inaccurate or incomplete. You have the right to request and obtain a copy of your Personal Data that you have provided to STCON Information Technology Company. You can withdraw any consent to Personal Data processing at any time. To exercise these rights, or If you have any questions or complaints regarding your Personal Data processing, feel free to ask us via info@stcon.sa If you remain dissatisfied, then you have the right to apply directly to your national supervisory authority for a decision. 6. Children Our Website and Services are not intended for children. If you are under 18 or otherwise would be required to obtain the consent of a parent or guardian in order to share information with STCON Information Technology Company, you should not send any information about yourself to us. If a person under 18 submits information via any part of our Website and/or Services, and we learn that the person submitting the information is under 18, we will delete this information as soon as possible. 7. Cookies This Website uses and collects cookies, including third party cookies. You may block use of cookies at any time by adjusting your browser's privacy settings, however, some functionality of this site may not work properly. Cookies are small encrypted text files that are stored on your computer or other device by our Website and allow our Website or a third-party to recognize you and make your next visit easier and our Website more useful to you. Cookies do not typically contain any information that personally identifies a user, but personal information that we store about you may be linked to the information stored in and obtained from cookies. Functional and Performance cookies Analytical/performance cookies: these cookies allow us to recognize and count the number of visitors and to see how visitors move around our Website. These helps us to improve the way our Website work, for example, by ensuring that users are finding what they are looking for easily and do not encounter technical errors. Functionality cookies: these are used to recognize you when you return to our Website. Usage of cookies of this character enables us to personalize our content for you and remember your preferences. All information these cookies collect is aggregated and anonymous. Third-Party cookies We may allow third parties to use cookies (e.g. these cookies are used by Google Analytics). Besides, our Website may have \"share\" buttons that allow users to share content of our Website with their friends on social networks. These third parties may use cookies when you are logged onto their pages and visit our Website. We do not control the cookies of third parties. Please visit these third-party websites to obtain more information about their use of cookies. There are also free programs you can download from reputable sources that allow you to set your preferences and block the vast majority of third-party cookies. Strictly Necessary cookies These are cookies that are required for the operation of our Website. We use cookies for the following reasons: For marketing purposes. To improve your experience of using our Website and our range of products and services. At no point do our cookies or those of our third parties store your personal payment information. How to manage cookies You can turn Functional and Performance cookies on and off. Strictly Necessary cookies can't be turned off. Effective Date of this : 29.02.2024 Privacy and Cookie Policy This STCON Information Technology Company (STCON LLC) Privacy and Cookie Policy covers all activities of users on https://stcon.sa website (the \"Website\"), use of applications of STCON LLC and its affiliates, as well as use of all other connected products and services, collectively referred to as the \"Services\". This Privacy and Cookie Policy describes what Personal Data and Other Information (as defined below) STCON Information Technology Company may collect online and offline, where appropriate, and how STCON Information Technology Company uses and shares such information. By using this Website, and particularly submitting your information through various contact addresses you consent to the collection, storage and use of your Personal Data and Other Information according to this policy. We reserve the right to change this Privacy and Cookie Policy as we may deem necessary from time to time or as may be required by law. STCON Information Technology Company is a company registered and operating in the Kingdom of Saudi Arabia and located at Prince Mohammed Bin Abdulaziz Road, Al Olaya Dist., Building No. 3074, Riyadh 12213, Kingdom of Saudi Arabia. When this mentions \"we\", \"us\", or \"our\" it refers to STCON Information Technology Company that is responsible for processing and control of the information you submit (\"Data Controller\"). 1. What information do we collect? STCON Information Technology Company collects information to operate our business and provide you with innovative technology solutions. We collect both Personal Data and Other Information in support of these efforts, however, STCON Information Technology Company does not collect or process any Sensitive Data. \"Personal Data\" is information that can be used, directly or indirectly, alone or together with other information, to identify you as an individual. This may include your location data , and Cookies (Please see Cookies section below for more information), except for Sensitive Data as defined below. \"Sensitive Data\" personal data revealing racial or ethnic origin, or religious, intellectual or political belief, data relating to security criminal convictions and offenses, biometric or genetic data for the purpose of identifying the person, health data, and data that indicates that one or both of the individual's parents are unknown. \"Other Information\" is information that is anonymous, aggregate, de-identified, or that otherwise does not reveal your identity. We collect and use this information to understand how you and our other customers as a whole use our Website and Services and constantly tune, enhance, innovate and build products and services to reflect the needs of customers. Generally, we do not consider Other Information to be Personal Data. Regardless, if we link together Other Information in a way that renders it individually identifiable, we will treat the combined information as Personal Data. Transparency and Choice: You control what, how, and when you share your Personal Data with STCON Information Technology Company. We want you to easily understand your rights and our obligations to you. So, we have tried to use plain language throughout this Privacy and Cookie Policy. We believe you should be able to control the use of your Personal Data — and know that you can ask us to stop, that means that you can withdraw your consent at any time. We collect Personal Data in the following ways : 1. When you register with us through the «contact us» and other functionalities as well as sending message to any e-mail displayed there, we collect registration and other details (e.g., name, username and password, contact information (such as email addresses, telephone numbers, and location), your activity on this Website. 2. When you use or interact with our Services (including, but not limited to, by filling in forms on our Website), we collect Personal Data such as traffic data, cookies, location data, IP address and other data. Other Information: We may collect Other Information about your use of our Website and Services. This includes, for example, your device type, browser type, operating system, internet domain and host name, date and time of access to our Website as well as referring and onward URL, as well as data about the activities you undertake and how you interact with our Website and Services. 2. Usage of Personal Data We use the information we collect to: Provide you with information you request (e.g. providing you with information about our software products and related services). Provide customer service to resolve technical issues you meet and/or to respond to your requests for assistance. Provide you with marketing information (in case of your consent), e.g. articles, newsletters or other content. Perform a contract we have with you. In course of your Personal Data usage, we may transfer this information to some the STCON LLC affiliate (-s) and subsidiary (-ies), if we in our sole discretion consider this necessary. All STCON LLC's affiliates and subsidiaries are committed to use and process your data in strict accordance with this policy. The Personal Data that we collect may be stored, processed and transferred between any countries and locations in which STCON LLC's affiliates and subsidiaries operate in order to enable us to use the information in accordance with this Policy. We commit ourselves to ensuring the proper level of protection of your Personal Data in all our locations where it is transferred, stored and processed. How long will we keep your Personal Data? We will retain any Personal Data you submit as long as we have an ongoing relationship with you or if we are required to retain your Personal Data by legal obligation. Your Personal Data will not be kept for longer than is necessary to fulfill the purpose for which the personal data was collected. 3. Legal basis for collecting Personal Data Collecting Personal Data based on consents . The collection of Personal Data based on consent from the data subject will be done by using «Consent Forms» that will store documentation related to the consent given by the individual. Individual consents will always be stored and documented in our systems. Collecting Personal Data based on contracts . We use Personal Data for fulfilling our obligations related to contracts and agreements with customers, partners and suppliers. Collecting Personal Data based on legitimate interest . We may use Personal Data if it is considered to be of legitimate interest to provide users with an easy-to-use and efficient site, build more useful Services, and comply with applicable law, and if the privacy interests of the data subjects do not override this interest. Normally, to establish the legal basis for data collection, an assessment has been made during which a mutual interest between STCON Information Technology Company and the individual person has been identified. This legal basis is primarily related to our sales and marketing purposes. We will always inform individuals about their privacy rights and the purpose for collecting personal data. 4. Disclosing Personal Information to Third Parties We do not sell, rent or trade your Personal Information to third parties for use in their marketing purposes. We may disclose Personal Data to the following third parties: Regulators and other competent authorities. Our distributors according to your geographic location/area to process your requests in a more efficient manner, when appropriate. Our affiliated companies. Our employees, officers, insurers, professional advisers, agents, suppliers or subcontractors insofar as reasonably necessary for the purposes set out in this Policy. Our Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This Privacy and Cookie Policy does not extend to your use of such websites. You are advised to read the of other websites prior to using them. 5. Your rights As the data subject you have the right to object to certain ways that we use your Personal Data, or to ask us to delete, remove, or stop using your Personal Data if there is no need for us to keep it. This is known as the \"right to object\" and \"right to erasure\", or the \"right to be forgotten\". Please note such requests may not always be possible due to legal obligations we may have to keep such records. You have the right to request rectification of your Personal Data so that it can be corrected or completed if it is inaccurate or incomplete. You have the right to request and obtain a copy of your Personal Data that you have provided to STCON Information Technology Company. You can withdraw any consent to Personal Data processing at any time. To exercise these rights, or If you have any questions or complaints regarding your Personal Data processing, feel free to ask us via info@stcon.sa If you remain dissatisfied, then you have the right to apply directly to your national supervisory authority for a decision. 6. Children Our Website and Services are not intended for children. If you are under 18 or otherwise would be required to obtain the consent of a parent or guardian in order to share information with STCON Information Technology Company, you should not send any information about yourself to us. If a person under 18 submits information via any part of our Website and/or Services, and we learn that the person submitting the information is under 18, we will delete this information as soon as possible. 7. Cookies This Website uses and collects cookies, including third party cookies. You may block use of cookies at any time by adjusting your browser's privacy settings, however, some functionality of this site may not work properly. Cookies are small encrypted text files that are stored on your computer or other device by our Website and allow our Website or a third-party to recognize you and make your next visit easier and our Website more useful to you. Cookies do not typically contain any information that personally identifies a user, but personal information that we store about you may be linked to the information stored in and obtained from cookies. Functional and Performance cookies Analytical/performance cookies: these cookies allow us to recognize and count the number of visitors and to see how visitors move around our Website. These helps us to improve the way our Website work, for example, by ensuring that users are finding what they are looking for easily and do not encounter technical errors. Functionality cookies: these are used to recognize you when you return to our Website. Usage of cookies of this character enables us to personalize our content for you and remember your preferences. All information these cookies collect is aggregated and anonymous. Third-Party cookies We may allow third parties to use cookies (e.g. these cookies are used by Google Analytics). Besides, our Website may have \"share\" buttons that allow users to share content of our Website with their friends on social networks. These third parties may use cookies when you are logged onto their pages and visit our Website. We do not control the cookies of third parties. Please visit these third-party websites to obtain more information about their use of cookies. There are also free programs you can download from reputable sources that allow you to set your preferences and block the vast majority of third-party cookies. Strictly Necessary cookies These are cookies that are required for the operation of our Website. We use cookies for the following reasons: For marketing purposes. To improve your experience of using our Website and our range of products and services. At no point do our cookies or those of our third parties store your personal payment information. How to manage cookies You can turn Functional and Performance cookies on and off. Strictly Necessary cookies can't be turned off. Effective Date of this : 29.02.2024 This STCON Information Technology Company (STCON LLC) Privacy and Cookie Policy covers all activities of users on https://stcon.sa website (the \"Website\"), use of applications of STCON LLC and its affiliates, as well as use of all other connected products and services, collectively referred to as the \"Services\". This Privacy and Cookie Policy describes what Personal Data and Other Information (as defined below) STCON Information Technology Company may collect online and offline, where appropriate, and how STCON Information Technology Company uses and shares such information. By using this Website, and particularly submitting your information through various contact addresses you consent to the collection, storage and use of your Personal Data and Other Information according to this policy. We reserve the right to change this Privacy and Cookie Policy as we may deem necessary from time to time or as may be required by law. STCON Information Technology Company is a company registered and operating in the Kingdom of Saudi Arabia and located at Prince Mohammed Bin Abdulaziz Road, Al Olaya Dist., Building No. 3074, Riyadh 12213, Kingdom of Saudi Arabia. When this mentions \"we\", \"us\", or \"our\" it refers to STCON Information Technology Company that is responsible for processing and control of the information you submit (\"Data Controller\"). 1. What information do we collect? STCON Information Technology Company collects information to operate our business and provide you with innovative technology solutions. We collect both Personal Data and Other Information in support of these efforts, however, STCON Information Technology Company does not collect or process any Sensitive Data. \"Personal Data\" is information that can be used, directly or indirectly, alone or together with other information, to identify you as an individual. This may include your location data , and Cookies (Please see Cookies section below for more information), except for Sensitive Data as defined below. \"Sensitive Data\" personal data revealing racial or ethnic origin, or religious, intellectual or political belief, data relating to security criminal convictions and offenses, biometric or genetic data for the purpose of identifying the person, health data, and data that indicates that one or both of the individual's parents are unknown. \"Other Information\" is information that is anonymous, aggregate, de-identified, or that otherwise does not reveal your identity. We collect and use this information to understand how you and our other customers as a whole use our Website and Services and constantly tune, enhance, innovate and build products and services to reflect the needs of customers. Generally, we do not consider Other Information to be Personal Data. Regardless, if we link together Other Information in a way that renders it individually identifiable, we will treat the combined information as Personal Data. Transparency and Choice: You control what, how, and when you share your Personal Data with STCON Information Technology Company. We want you to easily understand your rights and our obligations to you. So, we have tried to use plain language throughout this Privacy and Cookie Policy. We believe you should be able to control the use of your Personal Data — and know that you can ask us to stop, that means that you can withdraw your consent at any time. We collect Personal Data in the following ways : 1. When you register with us through the «contact us» and other functionalities as well as sending message to any e-mail displayed there, we collect registration and other details (e.g., name, username and password, contact information (such as email addresses, telephone numbers, and location), your activity on this Website. 2. When you use or interact with our Services (including, but not limited to, by filling in forms on our Website), we collect Personal Data such as traffic data, cookies, location data, IP address and other data. Other Information: We may collect Other Information about your use of our Website and Services. This includes, for example, your device type, browser type, operating system, internet domain and host name, date and time of access to our Website as well as referring and onward URL, as well as data about the activities you undertake and how you interact with our Website and Services. 2. Usage of Personal Data We use the information we collect to: Provide you with information you request (e.g. providing you with information about our software products and related services). Provide customer service to resolve technical issues you meet and/or to respond to your requests for assistance. Provide you with marketing information (in case of your consent), e.g. articles, newsletters or other content. Perform a contract we have with you. In course of your Personal Data usage, we may transfer this information to some the STCON LLC affiliate (-s) and subsidiary (-ies), if we in our sole discretion consider this necessary. All STCON LLC's affiliates and subsidiaries are committed to use and process your data in strict accordance with this policy. The Personal Data that we collect may be stored, processed and transferred between any countries and locations in which STCON LLC's affiliates and subsidiaries operate in order to enable us to use the information in accordance with this Policy. We commit ourselves to ensuring the proper level of protection of your Personal Data in all our locations where it is transferred, stored and processed. How long will we keep your Personal Data? We will retain any Personal Data you submit as long as we have an ongoing relationship with you or if we are required to retain your Personal Data by legal obligation. Your Personal Data will not be kept for longer than is necessary to fulfill the purpose for which the personal data was collected. 3. Legal basis for collecting Personal Data Collecting Personal Data based on consents . The collection of Personal Data based on consent from the data subject will be done by using «Consent Forms» that will store documentation related to the consent given by the individual. Individual consents will always be stored and documented in our systems. Collecting Personal Data based on contracts . We use Personal Data for fulfilling our obligations related to contracts and agreements with customers, partners and suppliers. Collecting Personal Data based on legitimate interest . We may use Personal Data if it is considered to be of legitimate interest to provide users with an easy-to-use and efficient site, build more useful Services, and comply with applicable law, and if the privacy interests of the data subjects do not override this interest. Normally, to establish the legal basis for data collection, an assessment has been made during which a mutual interest between STCON Information Technology Company and the individual person has been identified. This legal basis is primarily related to our sales and marketing purposes. We will always inform individuals about their privacy rights and the purpose for collecting personal data. 4. Disclosing Personal Information to Third Parties We do not sell, rent or trade your Personal Information to third parties for use in their marketing purposes. We may disclose Personal Data to the following third parties: Regulators and other competent authorities. Our distributors according to your geographic location/area to process your requests in a more efficient manner, when appropriate. Our employees, officers, insurers, professional advisers, agents, suppliers or subcontractors insofar as reasonably necessary for the purposes set out in this Policy. Our Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This Privacy and Cookie Policy does not extend to your use of such websites. You are advised to read the of other websites prior to using them. As the data subject you have the right to object to certain ways that we use your Personal Data, or to ask us to delete, remove, or stop using your Personal Data if there is no need for us to keep it. This is known as the \"right to object\" and \"right to erasure\", or the \"right to be forgotten\". Please note such requests may not always be possible due to legal obligations we may have to keep such records. You have the right to request rectification of your Personal Data so that it can be corrected or completed if it is inaccurate or incomplete. You have the right to request and obtain a copy of your Personal Data that you have provided to STCON Information Technology Company. You can withdraw any consent to Personal Data processing at any time. To exercise these rights, or If you have any questions or complaints regarding your Personal Data processing, feel free to ask us via info@stcon.sa If you remain dissatisfied, then you have the right to apply directly to your national supervisory authority for a decision. Our Website and Services are not intended for children. If you are under 18 or otherwise would be required to obtain the consent of a parent or guardian in order to share information with STCON Information Technology Company, you should not send any information about yourself to us. If a person under 18 submits information via any part of our Website and/or Services, and we learn that the person submitting the information is under 18, we will delete this information as soon as possible. This Website uses and collects cookies, including third party cookies. You may block use of cookies at any time by adjusting your browser's privacy settings, however, some functionality of this site may not work properly. Cookies are small encrypted text files that are stored on your computer or other device by our Website and allow our Website or a third-party to recognize you and make your next visit easier and our Website more useful to you. Cookies do not typically contain any information that personally identifies a user, but personal information that we store about you may be linked to the information stored in and obtained from cookies. Functional and Performance cookies Analytical/performance cookies: these cookies allow us to recognize and count the number of visitors and to see how visitors move around our Website. These helps us to improve the way our Website work, for example, by ensuring that users are finding what they are looking for easily and do not encounter technical errors. Functionality cookies: these are used to recognize you when you return to our Website. Usage of cookies of this character enables us to personalize our content for you and remember your preferences. All information these cookies collect is aggregated and anonymous. Third-Party cookies We may allow third parties to use cookies (e.g. these cookies are used by Google Analytics). Besides, our Website may have \"share\" buttons that allow users to share content of our Website with their friends on social networks. These third parties may use cookies when you are logged onto their pages and visit our Website. We do not control the cookies of third parties. Please visit these third-party websites to obtain more information about their use of cookies. There are also free programs you can download from reputable sources that allow you to set your preferences and block the vast majority of third-party cookies. These are cookies that are required for the operation of our Website. We use cookies for the following reasons: To improve your experience of using our Website and our range of products and services. At no point do our cookies or those of our third parties store your personal payment information. How to manage cookies You can turn Functional and Performance cookies on and off. Strictly Necessary cookies can't be turned off. Effective Date of this : 29.02.2024"
  ]
}