{
  "company": "sumsub.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 5,
    "-1": 3
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.4795081967213114,
    "framing_surveillance": 0.0286885245901639,
    "framing_market": 0.4918032786885246,
    "num_docs": 8
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 5
    }
  },
  "sample_docs": [
    "Join one or more expert-led sessions and earn a certificate for each. © Sumsub , 2015- 2025 . . Privacy Notice Cookie Policy & Conditions Of Use CCPA Notification Data Disposal And Destruction Data Protection Registration Number: ZA222205. Company Registration Number: 09688671. Address: 30 St. Mary Axe, London, England, EC3A 8BF",
    "Products Approach any identity verification challenge confidently User Verification Verify users worldwide. Smooth online identity verification and compliance have finally come together Business Verification Streamline your verification flow and welcome more companies to your business at record speeds Transaction Monitoring Detect suspicious activity in user transactions to stay compliant with your regulatory requirements and prevent fraud Fraud Prevention Unlock the power of our advanced ML algorithms to tackle all types of fraud at every user interaction Secure every step of the customer journey Orchestrate identity verification checks, code-free. Place checks at any stage of the customer journey for top anti-fraud protection and pass rates worldwide. Industries Get a turnkey identity verification solution for your business Fintech iGaming Trading Crypto Mobility Marketplaces Let the numbers do the talking: get 240% ROI Сompanies that work with Sumsub identity verification software save costs and increase revenue, according to the \"Total Economic Impact™ Of Sumsub's Verification Platform study by Forrester Consulting. Let's see what results you can get 240% ROI 3.21m NPV 4.55m Benefits PV < 6 month payback Full security & compliance Integrations Maximize pass rates with the right integration Unilink Web and Mobile SDK API Unilink Skip the integration process entirely and add an identity verification link or QR code to your website. Your customers can pass verification immediately by simply clicking the link. Reviews See why 4000+ clients trust Sumsub \"After we signed with Sumsub and integrated their tool, we managed to increase the speed of verification by more than 4 times. Concurrently, the number of our clients increased by more than 3 times.†Clyde Zorgvol Deputy Group Head of Compliance \"With Sumsub, we've managed to reduce user fraud to practically zero. Since we began using Sumsub, fraud is just one less thing we've had to worry about.†Amram Adar Co-Founder and CEO \"As an online marketplace, security and safety for our users are critical issues. We needed KYC software that we could trust. Partnering with Sumsub supported our platform's growth by allowing us to onboard many more users safely and securely.†Jonathan Cook Teacher Success Manager \"The most exciting thing about working with Sumsub is the improved conversion rate – an 80% increase compared to our previous flow. It's definitely a better choice for us as more people are coming to the platform and doing it faster. That is the biggest improvement from a company perspective.†Alvin Han Compliance Officer \"Sumsub's specific competence in this area complement our existing compliance routines very well. They have been able to customize KYC document screening to fit our specific flows and need.†Maria Fedorova COO at Exness \"Working with Sumsub, we value responsive support, fast and easy integration, flexibility and willingness to provide customized features. For us it's a turnkey solution that allows us to focus on the most critical tasks using their ready-made product.†Andrey Ilinsky Product Owner \"Sumsub's solution helped us not to drown in paperwork, and simplify the end-user onboarding and compliance officer routine. To verify each applicant, it now took around 30 seconds instead of 10 minutes. Document processing time was reduced in half with a successful profile completion 99.5% of the time.†Daniil Petin COO \"We wanted user onboarding to be as clear and straightforward as possible, and the UI that Sumsub has is great! We think it's a really, really good addition to our business.†Nikolina Travner COO \"Thanks to Sumsub's solution, we have zero fraud, which is quite rare in the cash advance sector. Since we can fully rely on Sumsub's KYC process and risk assessment, we can delegate user onboarding to Sumsub and focus on other areas of our business.†Benjamin Daudignac Co-Founder \"Sumsub is a top notch solution aligned with our compliance needs and priorities. Flexibility and the client orientation together with the best industry standards making Sumsub a reliable software provider.†Artjoms Lemtjugovs Chief Compliance Officer Begin your journey with Sumsub today FAQ What is online identity verification? It's an act of confirming a person's true identity by verifying their documents and true presence. It's possible to perform online identity verification with a number of documents, namely: personal IDs, passports, driving licenses, and a number of others documents. Applicable documents can vary depending on the jurisdiction and country. What is identity verification solution? ID verification is one of the best ways to verify identity. With an identity verification solution, it's possible to carry out cross-checks via government databases (if available) and liveness verification coupled with ID verification in order to get the most reliable verification accuracy. How much does identity verification cost? An identity verification provider's costs depend on a particular solution and the complexity of the check required. It can be as little as $0.05 per verification and up to custom pricing set out based on multi-level checks of various entities. How do ID verification services work? Identity verification software matches provided data (such as document scans) with available databases, performs forgery checks and watchlist screening, and initiates other verification steps required by a given jurisdiction. What is the best identity verification service? Since jurisdictions are constantly updated due to ongoing measures to prevent crime and some businesses require more than just ID verification, the best approach is to opt for an all-in-one identity verification provider. Sumsub offers its customers a unified flow to verify users, businesses, and transactions, along with monitoring and reporting tools. Approach any identity verification challenge confidently User Verification Verify users worldwide. Smooth online identity verification and compliance have finally come together Business Verification Streamline your verification flow and welcome more companies to your business at record speeds Transaction Monitoring Detect suspicious activity in user transactions to stay compliant with your regulatory requirements and prevent fraud Fraud Prevention Unlock the power of our advanced ML algorithms to tackle all types of fraud at every user interaction User Verification Verify users worldwide. Smooth online identity verification and compliance have finally come together Verify users worldwide. Smooth online identity verification and compliance have finally come together Business Verification Streamline your verification flow and welcome more companies to your business at record speeds Streamline your verification flow and welcome more companies to your business at record speeds Transaction Monitoring Detect suspicious activity in user transactions to stay compliant with your regulatory requirements and prevent fraud Detect suspicious activity in user transactions to stay compliant with your regulatory requirements and prevent fraud Fraud Prevention Unlock the power of our advanced ML algorithms to tackle all types of fraud at every user interaction Unlock the power of our advanced ML algorithms to tackle all types of fraud at every user interaction Secure every step of the customer journey Orchestrate identity verification checks, code-free. Place checks at any stage of the customer journey for top anti-fraud protection and pass rates worldwide. Industries Get a turnkey identity verification solution for your business Fintech iGaming Trading Crypto Mobility Marketplaces Get a turnkey identity verification solution for your business Let the numbers do the talking: get 240% ROI Сompanies that work with Sumsub identity verification software save costs and increase revenue, according to the \"Total Economic Impact™ Of Sumsub's Verification Platform study by Forrester Consulting. Let's see what results you can get 240% ROI 3.21m NPV 4.55m Benefits PV < 6 month payback Let the numbers do the talking: get 240% ROI Сompanies that work with Sumsub identity verification software save costs and increase revenue, according to the \"Total Economic Impact™ Of Sumsub's Verification Platform study by Forrester Consulting. Let's see what results you can get < 6 month payback Full security & compliance Maximize pass rates with the right integration Unilink Web and Mobile SDK API Unilink Skip the integration process entirely and add an identity verification link or QR code to your website. Your customers can pass verification immediately by simply clicking the link. Web and Mobile SDK Skip the integration process entirely and add an identity verification link or QR code to your website. Your customers can pass verification immediately by simply clicking the link. See why 4000+ clients trust Sumsub \"After we signed with Sumsub and integrated their tool, we managed to increase the speed of verification by more than 4 times. Concurrently, the number of our clients increased by more than 3 times.†Clyde Zorgvol Deputy Group Head of Compliance \"With Sumsub, we've managed to reduce user fraud to practically zero. Since we began using Sumsub, fraud is just one less thing we've had to worry about.†Amram Adar Co-Founder and CEO \"As an online marketplace, security and safety for our users are critical issues. We needed KYC software that we could trust. Partnering with Sumsub supported our platform's growth by allowing us to onboard many more users safely and securely.†Jonathan Cook Teacher Success Manager \"The most exciting thing about working with Sumsub is the improved conversion rate – an 80% increase compared to our previous flow. It's definitely a better choice for us as more people are coming to the platform and doing it faster. That is the biggest improvement from a company perspective.†Alvin Han Compliance Officer \"Sumsub's specific competence in this area complement our existing compliance routines very well. They have been able to customize KYC document screening to fit our specific flows and need.†Maria Fedorova COO at Exness \"Working with Sumsub, we value responsive support, fast and easy integration, flexibility and willingness to provide customized features. For us it's a turnkey solution that allows us to focus on the most critical tasks using their ready-made product.†Andrey Ilinsky Product Owner \"Sumsub's solution helped us not to drown in paperwork, and simplify the end-user onboarding and compliance officer routine. To verify each applicant, it now took around 30 seconds instead of 10 minutes. Document processing time was reduced in half with a successful profile completion 99.5% of the time.†Daniil Petin COO \"We wanted user onboarding to be as clear and straightforward as possible, and the UI that Sumsub has is great! We think it's a really, really good addition to our business.†Nikolina Travner COO \"Thanks to Sumsub's solution, we have zero fraud, which is quite rare in the cash advance sector. Since we can fully rely on Sumsub's KYC process and risk assessment, we can delegate user onboarding to Sumsub and focus on other areas of our business.†Benjamin Daudignac Co-Founder \"Sumsub is a top notch solution aligned with our compliance needs and priorities. Flexibility and the client orientation together with the best industry standards making Sumsub a reliable software provider.†Artjoms Lemtjugovs Chief Compliance Officer \"After we signed with Sumsub and integrated their tool, we managed to increase the speed of verification by more than 4 times. Concurrently, the number of our clients increased by more than 3 times.†Deputy Group Head of Compliance \"With Sumsub, we've managed to reduce user fraud to practically zero. Since we began using Sumsub, fraud is just one less thing we've had to worry about.†\"As an online marketplace, security and safety for our users are critical issues. We needed KYC software that we could trust. Partnering with Sumsub supported our platform's growth by allowing us to onboard many more users safely and securely.†\"The most exciting thing about working with Sumsub is the improved conversion rate – an 80% increase compared to our previous flow. It's definitely a better choice for us as more people are coming to the platform and doing it faster. That is the biggest improvement from a company perspective.†\"Sumsub's specific competence in this area complement our existing compliance routines very well. They have been able to customize KYC document screening to fit our specific flows and need.†\"Working with Sumsub, we value responsive support, fast and easy integration, flexibility and willingness to provide customized features. For us it's a turnkey solution that allows us to focus on the most critical tasks using their ready-made product.†\"Sumsub's solution helped us not to drown in paperwork, and simplify the end-user onboarding and compliance officer routine. To verify each applicant, it now took around 30 seconds instead of 10 minutes. Document processing time was reduced in half with a successful profile completion 99.5% of the time.†\"We wanted user onboarding to be as clear and straightforward as possible, and the UI that Sumsub has is great! We think it's a really, really good addition to our business.†\"Thanks to Sumsub's solution, we have zero fraud, which is quite rare in the cash advance sector. Since we can fully rely on Sumsub's KYC process and risk assessment, we can delegate user onboarding to Sumsub and focus on other areas of our business.†\"Sumsub is a top notch solution aligned with our compliance needs and priorities. Flexibility and the client orientation together with the best industry standards making Sumsub a reliable software provider.†Begin your journey with Sumsub today Begin your journey with Sumsub today FAQ What is online identity verification? It's an act of confirming a person's true identity by verifying their documents and true presence. It's possible to perform online identity verification with a number of documents, namely: personal IDs, passports, driving licenses, and a number of others documents. Applicable documents can vary depending on the jurisdiction and country. What is identity verification solution? ID verification is one of the best ways to verify identity. With an identity verification solution, it's possible to carry out cross-checks via government databases (if available) and liveness verification coupled with ID verification in order to get the most reliable verification accuracy. How much does identity verification cost? An identity verification provider's costs depend on a particular solution and the complexity of the check required. It can be as little as $0.05 per verification and up to custom pricing set out based on multi-level checks of various entities. How do ID verification services work? Identity verification software matches provided data (such as document scans) with available databases, performs forgery checks and watchlist screening, and initiates other verification steps required by a given jurisdiction. What is the best identity verification service? Since jurisdictions are constantly updated due to ongoing measures to prevent crime and some businesses require more than just ID verification, the best approach is to opt for an all-in-one identity verification provider. Sumsub offers its customers a unified flow to verify users, businesses, and transactions, along with monitoring and reporting tools. FAQ What is online identity verification? It's an act of confirming a person's true identity by verifying their documents and true presence. It's possible to perform online identity verification with a number of documents, namely: personal IDs, passports, driving licenses, and a number of others documents. Applicable documents can vary depending on the jurisdiction and country. What is identity verification solution? ID verification is one of the best ways to verify identity. With an identity verification solution, it's possible to carry out cross-checks via government databases (if available) and liveness verification coupled with ID verification in order to get the most reliable verification accuracy. How much does identity verification cost? An identity verification provider's costs depend on a particular solution and the complexity of the check required. It can be as little as $0.05 per verification and up to custom pricing set out based on multi-level checks of various entities. How do ID verification services work? Identity verification software matches provided data (such as document scans) with available databases, performs forgery checks and watchlist screening, and initiates other verification steps required by a given jurisdiction. What is the best identity verification service? Since jurisdictions are constantly updated due to ongoing measures to prevent crime and some businesses require more than just ID verification, the best approach is to opt for an all-in-one identity verification provider. Sumsub offers its customers a unified flow to verify users, businesses, and transactions, along with monitoring and reporting tools. What is online identity verification? It's an act of confirming a person's true identity by verifying their documents and true presence. It's possible to perform online identity verification with a number of documents, namely: personal IDs, passports, driving licenses, and a number of others documents. Applicable documents can vary depending on the jurisdiction and country. What is online identity verification? It's an act of confirming a person's true identity by verifying their documents and true presence. It's possible to perform online identity verification with a number of documents, namely: personal IDs, passports, driving licenses, and a number of others documents. Applicable documents can vary depending on the jurisdiction and country. What is identity verification solution? ID verification is one of the best ways to verify identity. With an identity verification solution, it's possible to carry out cross-checks via government databases (if available) and liveness verification coupled with ID verification in order to get the most reliable verification accuracy. What is identity verification solution? ID verification is one of the best ways to verify identity. With an identity verification solution, it's possible to carry out cross-checks via government databases (if available) and liveness verification coupled with ID verification in order to get the most reliable verification accuracy. How much does identity verification cost? An identity verification provider's costs depend on a particular solution and the complexity of the check required. It can be as little as $0.05 per verification and up to custom pricing set out based on multi-level checks of various entities. How much does identity verification cost? An identity verification provider's costs depend on a particular solution and the complexity of the check required. It can be as little as $0.05 per verification and up to custom pricing set out based on multi-level checks of various entities. How do ID verification services work? Identity verification software matches provided data (such as document scans) with available databases, performs forgery checks and watchlist screening, and initiates other verification steps required by a given jurisdiction. How do ID verification services work? Identity verification software matches provided data (such as document scans) with available databases, performs forgery checks and watchlist screening, and initiates other verification steps required by a given jurisdiction. What is the best identity verification service? Since jurisdictions are constantly updated due to ongoing measures to prevent crime and some businesses require more than just ID verification, the best approach is to opt for an all-in-one identity verification provider. Sumsub offers its customers a unified flow to verify users, businesses, and transactions, along with monitoring and reporting tools. What is the best identity verification service? Since jurisdictions are constantly updated due to ongoing measures to prevent crime and some businesses require more than just ID verification, the best approach is to opt for an all-in-one identity verification provider. Sumsub offers its customers a unified flow to verify users, businesses, and transactions, along with monitoring and reporting tools.",
    "Enjoy great drinks, delicious food, and unmatched networking with the brightest minds who are shaping the future of fraud prevention and compliance. Join one or more expert-led sessions and earn a certificate for each. Limited Offer: 4 for the Price of 3 3 hands-on workshops to choose from © Sumsub , 2015- 2025 . . Privacy Notice Cookie Policy & Conditions Of Use CCPA Notification Data Disposal And Destruction Data Protection Registration Number: ZA222205. Company Registration Number: 09688671. Address: 30 St. Mary Axe, London, England, EC3A 8BF",
    "Agenda Workshop Day Novеmber 19 Main Summit Day Novеmber 20 Main Summit Day All Stages Main Stage Breakout Stage All topics Join one or more expert-led sessions and earn a certificate for each. Limited Offer: 4 for the Price of 3 3 hands-on workshops to choose from © Sumsub , 2015- 2025 . . Privacy Notice Cookie Policy & Conditions Of Use CCPA Notification Data Disposal And Destruction Data Protection Registration Number: ZA222205. Company Registration Number: 09688671. Address: 30 St. Mary Axe, London, England, EC3A 8BF",
    "Join one or more expert-led sessions and earn a certificate for each. Limited Offer: 4 for the Price of 3 3 hands-on workshops to choose from Tell us what you'd like to talk about. Structured, free-style, doesn't matter—we're all ears. Deadline for applications September 30, 2025 *Early applicants will be given priority consideration. Don't miss your chance to be a part of this premier event! © Sumsub , 2015- 2025 . . Privacy Notice Cookie Policy & Conditions Of Use CCPA Notification Data Disposal And Destruction Data Protection Registration Number: ZA222205. Company Registration Number: 09688671. Address: 30 St. Mary Axe, London, England, EC3A 8BF"
  ]
}