{
  "company": "sunartek.com",
  "dominant_topics": [
    3
  ],
  "topic_counts": {
    "3": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "3": 1
    }
  },
  "sample_docs": [
    "New Launches SALUS Custom-built a high-end secure platform designed to protect users from communication interception, IMSI catchers, trojans, phishing, and malware attacks. Read More VOICE PRINT ANALYSIS Advanced informative speech analysis system, capable of analyzing audio files for Speech/Non-speech detection, Language identification, and Speaker identification. Read More Solutions OSINT provides an open platform for seeking valuable information about an individual or any subject of interest. Facial Recognition systems at Sunartek have emerged as the fastest, reliable and scalable system. VPA is an advanced informative speech analysis system, capable of analyzing audio files for various purpose. Natural Language Processing is an advancing technology that assists digital systems to understand, articulate, and manipulate human language. Cryptanalysis is an exclusive technology used for decoding encrypted messages in the best way possible. Big Data Analysis refers to extracting, processing, and analyzing unstructured data and text from a multitude of sources. Sunartek's Vision platform automatically and continuously crawls the internet and darknet, extracting and indexing millions of pages daily to create database. Our intelligent solutions include Cell Phone Interception, Satellite Interception, Radio Monitoring systems and other special products. Sunartek's FARBS system is an API-based solution that can be integrated with a banking application. Salus is a custom-built a high-end secure platform designed to protect users from communication interception. Download Brochure Services DEVELOPMENT Our research and development team conducts several innovative research in the field of cyber defense. TRAINING Our well-informed faculty provides practical training on cryptanalysis, cyber security, and warfare. SUPPORT Our adept team of technicians not only provides great services but also imparts relentless support. Values Global Excellence Customer Satisfaction Confidentiality SALUS Custom-built a high-end secure platform designed to protect users from communication interception, IMSI catchers, trojans, phishing, and malware attacks. Read More VOICE PRINT ANALYSIS Advanced informative speech analysis system, capable of analyzing audio files for Speech/Non-speech detection, Language identification, and Speaker identification. Read More SALUS Custom-built a high-end secure platform designed to protect users from communication interception, IMSI catchers, trojans, phishing, and malware attacks. Read More VOICE PRINT ANALYSIS Advanced informative speech analysis system, capable of analyzing audio files for Speech/Non-speech detection, Language identification, and Speaker identification. Read More Custom-built a high-end secure platform designed to protect users from communication interception, IMSI catchers, trojans, phishing, and malware attacks. Advanced informative speech analysis system, capable of analyzing audio files for Speech/Non-speech detection, Language identification, and Speaker identification. OSINT provides an open platform for seeking valuable information about an individual or any subject of interest. Facial Recognition systems at Sunartek have emerged as the fastest, reliable and scalable system. VPA is an advanced informative speech analysis system, capable of analyzing audio files for various purpose. Natural Language Processing is an advancing technology that assists digital systems to understand, articulate, and manipulate human language. Cryptanalysis is an exclusive technology used for decoding encrypted messages in the best way possible. Big Data Analysis refers to extracting, processing, and analyzing unstructured data and text from a multitude of sources. Sunartek's Vision platform automatically and continuously crawls the internet and darknet, extracting and indexing millions of pages daily to create database. Our intelligent solutions include Cell Phone Interception, Satellite Interception, Radio Monitoring systems and other special products. Sunartek's FARBS system is an API-based solution that can be integrated with a banking application. Salus is a custom-built a high-end secure platform designed to protect users from communication interception. DEVELOPMENT Our research and development team conducts several innovative research in the field of cyber defense. TRAINING Our well-informed faculty provides practical training on cryptanalysis, cyber security, and warfare. SUPPORT Our adept team of technicians not only provides great services but also imparts relentless support. Our research and development team conducts several innovative research in the field of cyber defense. Our well-informed faculty provides practical training on cryptanalysis, cyber security, and warfare. Our adept team of technicians not only provides great services but also imparts relentless support. Global Excellence Customer Satisfaction Confidentiality"
  ]
}