{
  "company": "suspecttech.com",
  "dominant_topics": [
    1,
    2
  ],
  "topic_counts": {
    "1": 3,
    "2": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "1": 3,
      "2": 1
    }
  },
  "sample_docs": [
    "AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. Secure CJIS compliant with Azure government, on-premise, and desktop deployment Camera Agnostic Support for dashcams, bodycams, and surveillance cameras from all vendors AI Powered Advanced algorithms built by our team of in-house experts Privacy Protector Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Video Converter Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion Partners Contact Us AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. Secure CJIS compliant with Azure government, on-premise, and desktop deployment Camera Agnostic Support for dashcams, bodycams, and surveillance cameras from all vendors AI Powered Advanced algorithms built by our team of in-house experts AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. CJIS compliant with Azure government, on-premise, and desktop deployment Support for dashcams, bodycams, and surveillance cameras from all vendors Advanced algorithms built by our team of in-house experts Privacy Protector Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Video Converter Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion",
    "AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. Secure CJIS compliant with Azure government, on-premise, and desktop deployment Camera Agnostic Support for dashcams, bodycams, and surveillance cameras from all vendors AI Powered Advanced algorithms built by our team of in-house experts Privacy Protector Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Video Converter Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion Partners Contact Us AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. Secure CJIS compliant with Azure government, on-premise, and desktop deployment Camera Agnostic Support for dashcams, bodycams, and surveillance cameras from all vendors AI Powered Advanced algorithms built by our team of in-house experts AgentAI platform assists law enforcement agencies by accelerating and enhancing their ability to protect, investigate, alert, and report. CJIS compliant with Azure government, on-premise, and desktop deployment Support for dashcams, bodycams, and surveillance cameras from all vendors Advanced algorithms built by our team of in-house experts Privacy Protector Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Auto redaction of faces, people, and cars Manual redaction support for audio and custom identifiable information CJIS compliant data security Azure government, on-premise, and desktop deployment support Video Converter Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion Support for DVR, bodycam, dashcam and surveillance video formats Review frame by frame Drag and drop videos for investigation Technical support for proprietary video format conversion",
    "Protect People & Premises Providing a visual AI platform for actionable intelligence Protect People & Premises CJIS compliant with Azure Cloud, On-premise, and desktop deployment. Supports dashcams, bodycams, and security cameras from any vendor. Advanced algorithms built by team of in-house experts in USA. Products Exact Redact Auto redact faces, people, screens and license plates Manual redaction support for audio and custom objects in video CJIS Compliant Data Security Azure Government, On-Premise, And Desktop Deployment Support Read More Face SDK Group similar faces in large volumes of image and video data Recognize age, gender, ethnicity, glasses, mask, and hat attributes Read More Investigator Quickly Search people, vehicle, similar images by using advanced AI filters Recognize license plates, vehicle make and model Manage cases and generate investigation reports Summarize hours of videos into minutes for expert review Read More Video Converter Convert any video format into MP4 format Cut and concatenate videos to specified timeline Read More Auto redact faces, people, screens and license plates Manual redaction support for audio and custom objects in video CJIS Compliant Data Security Azure Government, On-Premise, And Desktop Deployment Support Group similar faces in large volumes of image and video data Recognize age, gender, ethnicity, glasses, mask, and hat attributes Quickly Search people, vehicle, similar images by using advanced AI filters Recognize license plates, vehicle make and model Manage cases and generate investigation reports Summarize hours of videos into minutes for expert review Convert any video format into MP4 format Cut and concatenate videos to specified timeline Our products accelerate the investigations by providing advanced AI tools and intuitive workflows Our proprietary algorithms are heavily customized for speed and accuracy by leveraging cutting-edge AI and deep learning advancements Our AI products are optimized to be deployed at large scale on Cloud, On-Premise, Desktop and Edge computing environments Our products are trusted by top security organizations in USA. Core technology built by researchers from Princeton University.",
    "NVIDIA Metropolis Partner Suspect Technologies builds GPU-accelerated deep learning applications and is an NVIDIA technology partner. To , please visit: https://www.nvidia.com/en-us/deep-learning-ai/industries/ai-cities/ NVIDIA Metropolis Partner Suspect Technologies builds GPU-accelerated deep learning applications and is an NVIDIA technology partner. To , please visit: https://www.nvidia.com/en-us/deep-learning-ai/industries/ai-cities/"
  ]
}