{
  "company": "sz1.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 19,
    "-1": 6
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 19
    }
  },
  "sample_docs": [
    "Products & Solutions All Products New Retail Payment POS Self-Service Kiosk Retail Signage Smart City Smart Utility Building Automation Smart Home & Office Smart Panel Access Control & Time Attendance Industrial IoT EV Charging Stations Custom Commercial Grade Tablet 10.1\" to 55\" Harness the power of Rockchip RK3288 / RK3399 family processors with dedicated Android O/S. High Definition LCD displays integrated with commercial grade ARM mother boards. Available in finished or frameless form factor. POE+ available for units up to 15.6\" and optional Wi-Fi/Bluetooth/ RS232 /GPIO capability. More >> VideoMax Series Industrial Grade Video Screens 10.1\" – 55\" Dual function LCD screens can function as stand-alone advertising player or dedicated monitor compatible with any media player or computer. Ad Player functions include but not limited to: looping video, default video loop with up to 8 push buttons for user event triggering, motion sensor, magnet sensor, RFID reader, Barcode Scanner, SD Card for content, and more. LCD industrial Monitor features include HDMI & VGA inputs and optional USB touch screen integration. More >> Total Retail Solutions Retail Showroom Product Selection Audio + Video + Lighting Today's retail field is more and more complicated because shoppers are more and more informed, and they have quite a few alternative choices online. To engage, inform, convert shoppers , the retail showroom product experience & demonstration systems should be very intuitive, smart & inexpensive to deliver a WOW effect once the shoppers touch the systems. More >> Face Recognition Device Face Recognition Cameras With Computer Vision Have Been Widely Used For Payment, Security Check & Corporate Check-in Applications. More >> Android POS Terminal Android POS Terminals Either Single-Screen Or Dual-Screen Type, Widely Used In Various New Retail Applications Like Convenience Store, Super Market Payment Check-Out, Bars, Hotels, inventory management & hospitality. More >> Vending Kiosk Traditional Business Like Coffee Vending, Juice Vending, Ice-cream Vending, Token Vending, Ticketing, Queue Management… Is Going To Work In The Unattended Condition With Smart Kiosks. More >> About SZ1 SZ1 empowers customers around the world to facilitate their intelligent hardware design, development & mass-production, to help them go-to-market & scale with proprietary solutions, to sustain their competitive advantage by relentless innovation in product management, in doing so we have developed the full scope of technical capabilities in manufacturing smart industrial ARM devices. Our exceptional product portfolio includes but not limited to Android Commercial Tablets, POS terminal, new retail vending kiosk, IoT Displays, Control Panel, and custom solutions……. Customer First We Succeed Only When Our Customers Do, Thus, We Do Everything To Ensure Our Customers' Success, Our Team Is Organized To Focus On And Be Rewarded Only For Customer-driven Metrics. Exceptional Product Portfolio Living In The Electronics Manufacturing Hub Of The World, We Are Able To Make An Exceptional Product Portfolio That Is Constantly Evolving To Meet The Dynamic Requirements Of Our Clients. Verifiable Quality To Focus On Verifiable Quality Goals & Deliver What We Inspect Is The Hallmark Of Shenzhen One Team. Engineered Solutions We Proudly Engage Ourselves As Product Designer & Solution Maker, Our Passion For Solution Ownership, In-house Engineering Distinguishes Our Products & Solutions. Products & Solutions All Products New Retail Payment POS Self-Service Kiosk Retail Signage Smart City Smart Utility Building Automation Smart Home & Office Smart Panel Access Control & Time Attendance Industrial IoT EV Charging Stations Custom Commercial Grade Tablet 10.1\" to 55\" Harness the power of Rockchip RK3288 / RK3399 family processors with dedicated Android O/S. High Definition LCD displays integrated with commercial grade ARM mother boards. Available in finished or frameless form factor. POE+ available for units up to 15.6\" and optional Wi-Fi/Bluetooth/ RS232 /GPIO capability. More >> VideoMax Series Industrial Grade Video Screens 10.1\" – 55\" Dual function LCD screens can function as stand-alone advertising player or dedicated monitor compatible with any media player or computer. Ad Player functions include but not limited to: looping video, default video loop with up to 8 push buttons for user event triggering, motion sensor, magnet sensor, RFID reader, Barcode Scanner, SD Card for content, and more. LCD industrial Monitor features include HDMI & VGA inputs and optional USB touch screen integration. More >> Total Retail Solutions Retail Showroom Product Selection Audio + Video + Lighting Today's retail field is more and more complicated because shoppers are more and more informed, and they have quite a few alternative choices online. To engage, inform, convert shoppers , the retail showroom product experience & demonstration systems should be very intuitive, smart & inexpensive to deliver a WOW effect once the shoppers touch the systems. More >> Face Recognition Device Face Recognition Cameras With Computer Vision Have Been Widely Used For Payment, Security Check & Corporate Check-in Applications. More >> Android POS Terminal Android POS Terminals Either Single-Screen Or Dual-Screen Type, Widely Used In Various New Retail Applications Like Convenience Store, Super Market Payment Check-Out, Bars, Hotels, inventory management & hospitality. More >> Vending Kiosk Traditional Business Like Coffee Vending, Juice Vending, Ice-cream Vending, Token Vending, Ticketing, Queue Management… Is Going To Work In The Unattended Condition With Smart Kiosks. More >> About SZ1 SZ1 empowers customers around the world to facilitate their intelligent hardware design, development & mass-production, to help them go-to-market & scale with proprietary solutions, to sustain their competitive advantage by relentless innovation in product management, in doing so we have developed the full scope of technical capabilities in manufacturing smart industrial ARM devices. Our exceptional product portfolio includes but not limited to Android Commercial Tablets, POS terminal, new retail vending kiosk, IoT Displays, Control Panel, and custom solutions……. Customer First We Succeed Only When Our Customers Do, Thus, We Do Everything To Ensure Our Customers' Success, Our Team Is Organized To Focus On And Be Rewarded Only For Customer-driven Metrics. Exceptional Product Portfolio Living In The Electronics Manufacturing Hub Of The World, We Are Able To Make An Exceptional Product Portfolio That Is Constantly Evolving To Meet The Dynamic Requirements Of Our Clients. Verifiable Quality To Focus On Verifiable Quality Goals & Deliver What We Inspect Is The Hallmark Of Shenzhen One Team. Engineered Solutions We Proudly Engage Ourselves As Product Designer & Solution Maker, Our Passion For Solution Ownership, In-house Engineering Distinguishes Our Products & Solutions. New Retail Payment POS Self-Service Kiosk Retail Signage Smart City Smart Utility Building Automation Smart Home & Office Smart Panel Access Control & Time Attendance Access Control & Time Attendance Industrial IoT EV Charging Stations Harness the power of Rockchip RK3288 / RK3399 family processors with dedicated Android O/S. High Definition LCD displays integrated with commercial grade ARM mother boards. Available in finished or frameless form factor. POE+ available for units up to 15.6\" and optional Wi-Fi/Bluetooth/ RS232 /GPIO capability. Industrial Grade Video Screens 10.1\" – 55\" Dual function LCD screens can function as stand-alone advertising player or dedicated monitor compatible with any media player or computer. Ad Player functions include but not limited to: looping video, default video loop with up to 8 push buttons for user event triggering, motion sensor, magnet sensor, RFID reader, Barcode Scanner, SD Card for content, and more. LCD industrial Monitor features include HDMI & VGA inputs and optional USB touch screen integration. Retail Showroom Product Selection Audio + Video + Lighting Today's retail field is more and more complicated because shoppers are more and more informed, and they have quite a few alternative choices online. To engage, inform, convert shoppers , the retail showroom product experience & demonstration systems should be very intuitive, smart & inexpensive to deliver a WOW effect once the shoppers touch the systems. Face Recognition Cameras With Computer Vision Have Been Widely Used For Payment, Security Check & Corporate Check-in Applications. Android POS Terminals Either Single-Screen Or Dual-Screen Type, Widely Used In Various New Retail Applications Like Convenience Store, Super Market Payment Check-Out, Bars, Hotels, inventory management & hospitality. Traditional Business Like Coffee Vending, Juice Vending, Ice-cream Vending, Token Vending, Ticketing, Queue Management… Is Going To Work In The Unattended Condition With Smart Kiosks. SZ1 empowers customers around the world to facilitate their intelligent hardware design, development & mass-production, to help them go-to-market & scale with proprietary solutions, to sustain their competitive advantage by relentless innovation in product management, in doing so we have developed the full scope of technical capabilities in manufacturing smart industrial ARM devices. Our exceptional product portfolio includes but not limited to Android Commercial Tablets, POS terminal, new retail vending kiosk, IoT Displays, Control Panel, and custom solutions……. We Succeed Only When Our Customers Do, Thus, We Do Everything To Ensure Our Customers' Success, Our Team Is Organized To Focus On And Be Rewarded Only For Customer-driven Metrics. Living In The Electronics Manufacturing Hub Of The World, We Are Able To Make An Exceptional Product Portfolio That Is Constantly Evolving To Meet The Dynamic Requirements Of Our Clients. To Focus On Verifiable Quality Goals & Deliver What We Inspect Is The Hallmark Of Shenzhen One Team. We Proudly Engage Ourselves As Product Designer & Solution Maker, Our Passion For Solution Ownership, In-house Engineering Distinguishes Our Products & Solutions.",
    "Project Description Description Specification Support Inquiry Bill Payment Kiosks & Payment Self Service Hardware Solutions Available from 10.1-inch to 43-inch, Standard and Custom Hardware, with modular design peripherals, All can be easily customized to include client-specific flow requirements. Description Built To Last: Commercial Grade Our bill payment kiosks are designed and built with full consideration of commercial application scenarios where 7/24/365 durability is a must, thus every components employed are commercial grade to ensure the consistent performance in industrial environments, heavy-duty use. Proprietary Solution With Design-in Support Our payment kiosk solutions are designed and built under one single roof from board-level SMT, tooling development to production, via owning the complete process, we are able to support any design-in request with very tight delivery target. We are able to quickly modify our standard hardware to fit your custom installation and mounting profiles, no matter it is pedestal, countertop or wall mount. In addition, we provide support for real-time alerts and status visibility of connectivity, application & components with Iot signaling. Specification Framed Or Open Frame Up to 43-inch Capacitive Or Resistive Touch HDMI /VGA/ DVI /DP /CVBS Custom Firmware Support 1080P & 4K Resolutions -20 to 60°C Panel Specific Item Specification Notes Model No. Droid2150BP Display Screen size : 21.5\" (Diagonal) Active area : 476.6(H) x 268.1(V) mm Max. Resolution : 1920 (H) x 1080 (V) Brightness : 250 cd/m2 Contrast ratio : 1000 : 1 Viewing angle : 85/85/85/85(L/R/U/D) Aspect Ratio: 16:9 18.5-inch Optional Touchscreen Capacitive Multi-touch Processor Cortex-A17 Quadcore RK3288 @1.8GHz, GPU Mali T764 Optional With RK3399, Cortex-A72 DualCore 1.8GHz + Cortex-A53 Quadcore 1.4GHz , GPU Mali-T864 Memory / Storage 2GB DDR3 /32GB eMMC 4GB DDR4 +16GB for RK3399 Operating System Android 7.1 WiFi AP6236 (Broadcom IEEE802.11 b/g/n), Bluetooth 4.0 Included Ethernet RTL8211E 10/100M I/O >Micro USB for OTG; >Type A USB 2.0 x2; >220V AC Power 150W; >Power On/Off Button; >Micro SD Card x1; >8ohm 3w speakerx2; >HDMI out x1; >Earphone: 20mW@16ohm, 3.5mm; AC-DC adapter optional Camera Dual-Lens Wide Dynamics 2.0 MP Camera With Facial Recognition; Card Dispenser Support Vending & Collecting, up to 80pcs Printer 80mm thermal printer and A4 printer RFID/NFC reader Supported Expansion Options Finger-printer reader, high-speed scanner, A4 printer,Key pad, electro-magnet pen, cash dispenser, MSR reader 4G LTE Optional, wordwide bands supported Dimension Weight Environmental Maintenance Pull & Press Openner For Easy Access To Internal Components Materials CNC, power-coaded, finger-proof Kiosk On Wheel Built-in 4 wheels on bottom for easy relocation Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Daisy-chain-screens-stretched Daisy-chain-screens-stretched Battery Powered Shelf Talker Battery Powered Shelf Talker Project Description Description Specification Support Inquiry Bill Payment Kiosks & Payment Self Service Hardware Solutions Available from 10.1-inch to 43-inch, Standard and Custom Hardware, with modular design peripherals, All can be easily customized to include client-specific flow requirements. Description Built To Last: Commercial Grade Our bill payment kiosks are designed and built with full consideration of commercial application scenarios where 7/24/365 durability is a must, thus every components employed are commercial grade to ensure the consistent performance in industrial environments, heavy-duty use. Proprietary Solution With Design-in Support Our payment kiosk solutions are designed and built under one single roof from board-level SMT, tooling development to production, via owning the complete process, we are able to support any design-in request with very tight delivery target. We are able to quickly modify our standard hardware to fit your custom installation and mounting profiles, no matter it is pedestal, countertop or wall mount. In addition, we provide support for real-time alerts and status visibility of connectivity, application & components with Iot signaling. Specification Framed Or Open Frame Up to 43-inch Capacitive Or Resistive Touch HDMI /VGA/ DVI /DP /CVBS Custom Firmware Support 1080P & 4K Resolutions -20 to 60°C Panel Specific Item Specification Notes Model No. Droid2150BP Display Screen size : 21.5\" (Diagonal) Active area : 476.6(H) x 268.1(V) mm Max. Resolution : 1920 (H) x 1080 (V) Brightness : 250 cd/m2 Contrast ratio : 1000 : 1 Viewing angle : 85/85/85/85(L/R/U/D) Aspect Ratio: 16:9 18.5-inch Optional Touchscreen Capacitive Multi-touch Processor Cortex-A17 Quadcore RK3288 @1.8GHz, GPU Mali T764 Optional With RK3399, Cortex-A72 DualCore 1.8GHz + Cortex-A53 Quadcore 1.4GHz , GPU Mali-T864 Memory / Storage 2GB DDR3 /32GB eMMC 4GB DDR4 +16GB for RK3399 Operating System Android 7.1 WiFi AP6236 (Broadcom IEEE802.11 b/g/n), Bluetooth 4.0 Included Ethernet RTL8211E 10/100M I/O >Micro USB for OTG; >Type A USB 2.0 x2; >220V AC Power 150W; >Power On/Off Button; >Micro SD Card x1; >8ohm 3w speakerx2; >HDMI out x1; >Earphone: 20mW@16ohm, 3.5mm; AC-DC adapter optional Camera Dual-Lens Wide Dynamics 2.0 MP Camera With Facial Recognition; Card Dispenser Support Vending & Collecting, up to 80pcs Printer 80mm thermal printer and A4 printer RFID/NFC reader Supported Expansion Options Finger-printer reader, high-speed scanner, A4 printer,Key pad, electro-magnet pen, cash dispenser, MSR reader 4G LTE Optional, wordwide bands supported Dimension Weight Environmental Maintenance Pull & Press Openner For Easy Access To Internal Components Materials CNC, power-coaded, finger-proof Kiosk On Wheel Built-in 4 wheels on bottom for easy relocation Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Daisy-chain-screens-stretched Daisy-chain-screens-stretched Battery Powered Shelf Talker Battery Powered Shelf Talker Bill Payment Kiosks & Payment Self Service Hardware Solutions Available from 10.1-inch to 43-inch, Standard and Custom Hardware, with modular design peripherals, All can be easily customized to include client-specific flow requirements. Built To Last: Commercial Grade Our bill payment kiosks are designed and built with full consideration of commercial application scenarios where 7/24/365 durability is a must, thus every components employed are commercial grade to ensure the consistent performance in industrial environments, heavy-duty use. Proprietary Solution With Design-in Support Our payment kiosk solutions are designed and built under one single roof from board-level SMT, tooling development to production, via owning the complete process, we are able to support any design-in request with very tight delivery target. We are able to quickly modify our standard hardware to fit your custom installation and mounting profiles, no matter it is pedestal, countertop or wall mount. In addition, we provide support for real-time alerts and status visibility of connectivity, application & components with Iot signaling. Framed Or Open Frame Capacitive Or Resistive Touch HDMI /VGA/ DVI /DP /CVBS 1080P & 4K Resolutions Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Proprietary, modular-base solution with interplay of hardware & software. We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. We are able to develop the customized hardware and software precisely as per clients confirmed requirements. We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Related Products Transparent Screen Transparent Screen Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Daisy-chain-screens-stretched Daisy-chain-screens-stretched Battery Powered Shelf Talker Battery Powered Shelf Talker Transparent Screen Transparent Screen Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Battery Powered Shelf Talker Battery Powered Shelf Talker Battery Powered Shelf Talker",
    "Project Description Description Specification Support Inquiry Desktop Payment POS & Self-Service Kiosk Featuring Facial Recognition Payment, 2D Code With Keypad & Thermal Printer A Smart Helper Guiding Customers in Self-checkout, Making Self-service Easier Than Ever Before. Description A Lightsome Kiosk For Stores in All Sizes With Natural Fit On Desktop Droid1330K is designed to simplify the payment experience in retail stores. It has a slope angle to fit the natural viewing habits of store shoppers, and it stands firmly on desktop thanks to its triangle design. No more fixture kit, it fits naturally. As a user friendly payment & service kiosk, it has placed the 2D code scanner on the frontal bottom and facial recognition camera on frontal top, thus, there is no learning curve both for store operators as well as shoppers in point of sale. Built-in Thermal Printer & Keypad On Rear Side Saving Space & Being Customer-Friendly Receipts of all transactions will be printed automatically for customers to check the purchased items, the thermal printer has been built-into the rear side with an access door for changing till rolls. Sometimes, when a custom payment amount is needed saying some extra service has not been listed in POS database, the store operator could input the value manually via the keypad on back. Not Just A Payment Terminal Droid1330K is not just a payment terminal, it is also used in getting new customers, simplifying store operation, automating self-checkout and contactless self-pick'n go via facial-ID or 2D code scanning, Delivering great shopping experience to customers. Specification Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core IPS HD Screen 13.3-inch Full Viewing Angle Capacitive Touchscreen 10-Point Multi-Touch 2GB or 4GB RAM For Speedy Response Facial Recognition Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE 4G LTE Optional With Built-in PCI Socket Thermal Printer 58mm thermal printer on rear Android 7.1 Android OS 7.1 Model No. Droid1330K Display 13.3\" (337.8 mm) diagonal, color LCD, LED backlit Resolution 1920x1080 pixels Viewing Angle 178° horizontal, 178° vertical Touchscreen Projected capacitive NFC Card Reader Optional, Support protocals ISO14443A, ISO14443B,IOS15693,ISO18092, Felica with APDU commands Thermal Printer 58mm( with auto cutter ) 2D Code Scanner Supports 1D, 2D codes, distance 5-20cm 4G LTE Optional Biometric Camera 2.0 MP pixels ( single lens, dual‐lens, 3D optional ) Installation Place-N-Play ( No Extra Custom Kiosk Enclosure ) Dimension 425.9*221.8*190.7mm Weight 4.8kgs Available Extension Available with 8-inch, 10.1-inch With Similar Design Styles Processor Rockchip Dual‐Core Cortex‐A72 1.8GHz + Quad‐core Cortex‐A53 1.4GHz RK3399 (optional with RK3288 ) RAM DDR3, 4GB (eMMC) <2GB for RK3288 ) ROM 16GB OS Android 7.1 I/O Ports 1 x RJ45, 2 x USB 2.0, 1 x USB Micro 2.0 OTG, 1 x 3.5mm earphone, 1 x TF card slot, 1 x 12V/3A DC in 5.0mm Jack, RJ11 x1 Power Supply DC 12V, 3A Audio Built-in stereo speakers 20mW @16ohm / 2Wx2 External Speakers Bluetooth 4.2 Media Support 1080P other video decoders (VC-1, MPEG-1/2/4, VP8) Color Black as default, custom color available Storage Temperature ‐15 ‐‐ 65 degrees Working Temperature 0 ‐‐ 50 degrees Storage/Working Humidity 10 ‐‐ 90% Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Project Description Description Specification Support Inquiry Desktop Payment POS & Self-Service Kiosk Featuring Facial Recognition Payment, 2D Code With Keypad & Thermal Printer A Smart Helper Guiding Customers in Self-checkout, Making Self-service Easier Than Ever Before. Description A Lightsome Kiosk For Stores in All Sizes With Natural Fit On Desktop Droid1330K is designed to simplify the payment experience in retail stores. It has a slope angle to fit the natural viewing habits of store shoppers, and it stands firmly on desktop thanks to its triangle design. No more fixture kit, it fits naturally. As a user friendly payment & service kiosk, it has placed the 2D code scanner on the frontal bottom and facial recognition camera on frontal top, thus, there is no learning curve both for store operators as well as shoppers in point of sale. Built-in Thermal Printer & Keypad On Rear Side Saving Space & Being Customer-Friendly Receipts of all transactions will be printed automatically for customers to check the purchased items, the thermal printer has been built-into the rear side with an access door for changing till rolls. Sometimes, when a custom payment amount is needed saying some extra service has not been listed in POS database, the store operator could input the value manually via the keypad on back. Not Just A Payment Terminal Droid1330K is not just a payment terminal, it is also used in getting new customers, simplifying store operation, automating self-checkout and contactless self-pick'n go via facial-ID or 2D code scanning, Delivering great shopping experience to customers. Specification Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core IPS HD Screen 13.3-inch Full Viewing Angle Capacitive Touchscreen 10-Point Multi-Touch 2GB or 4GB RAM For Speedy Response Facial Recognition Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE 4G LTE Optional With Built-in PCI Socket Thermal Printer 58mm thermal printer on rear Android 7.1 Android OS 7.1 Model No. Droid1330K Display 13.3\" (337.8 mm) diagonal, color LCD, LED backlit Resolution 1920x1080 pixels Viewing Angle 178° horizontal, 178° vertical Touchscreen Projected capacitive NFC Card Reader Optional, Support protocals ISO14443A, ISO14443B,IOS15693,ISO18092, Felica with APDU commands Thermal Printer 58mm( with auto cutter ) 2D Code Scanner Supports 1D, 2D codes, distance 5-20cm 4G LTE Optional Biometric Camera 2.0 MP pixels ( single lens, dual‐lens, 3D optional ) Installation Place-N-Play ( No Extra Custom Kiosk Enclosure ) Dimension 425.9*221.8*190.7mm Weight 4.8kgs Available Extension Available with 8-inch, 10.1-inch With Similar Design Styles Processor Rockchip Dual‐Core Cortex‐A72 1.8GHz + Quad‐core Cortex‐A53 1.4GHz RK3399 (optional with RK3288 ) RAM DDR3, 4GB (eMMC) <2GB for RK3288 ) ROM 16GB OS Android 7.1 I/O Ports 1 x RJ45, 2 x USB 2.0, 1 x USB Micro 2.0 OTG, 1 x 3.5mm earphone, 1 x TF card slot, 1 x 12V/3A DC in 5.0mm Jack, RJ11 x1 Power Supply DC 12V, 3A Audio Built-in stereo speakers 20mW @16ohm / 2Wx2 External Speakers Bluetooth 4.2 Media Support 1080P other video decoders (VC-1, MPEG-1/2/4, VP8) Color Black as default, custom color available Storage Temperature ‐15 ‐‐ 65 degrees Working Temperature 0 ‐‐ 50 degrees Storage/Working Humidity 10 ‐‐ 90% Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Desktop Payment POS & Self-Service Kiosk Featuring Facial Recognition Payment, 2D Code With Keypad & Thermal Printer A Smart Helper Guiding Customers in Self-checkout, Making Self-service Easier Than Ever Before. A Lightsome Kiosk For Stores in All Sizes With Natural Fit On Desktop Droid1330K is designed to simplify the payment experience in retail stores. It has a slope angle to fit the natural viewing habits of store shoppers, and it stands firmly on desktop thanks to its triangle design. No more fixture kit, it fits naturally. As a user friendly payment & service kiosk, it has placed the 2D code scanner on the frontal bottom and facial recognition camera on frontal top, thus, there is no learning curve both for store operators as well as shoppers in point of sale. Built-in Thermal Printer & Keypad On Rear Side Saving Space & Being Customer-Friendly Receipts of all transactions will be printed automatically for customers to check the purchased items, the thermal printer has been built-into the rear side with an access door for changing till rolls. Sometimes, when a custom payment amount is needed saying some extra service has not been listed in POS database, the store operator could input the value manually via the keypad on back. Not Just A Payment Terminal Droid1330K is not just a payment terminal, it is also used in getting new customers, simplifying store operation, automating self-checkout and contactless self-pick'n go via facial-ID or 2D code scanning, Delivering great shopping experience to customers. Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core 13.3-inch Full Viewing Angle 2GB or 4GB RAM Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE Optional With Built-in PCI Socket 58mm thermal printer on rear Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Proprietary, modular-base solution with interplay of hardware & software. We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. We are able to develop the customized hardware and software precisely as per clients confirmed requirements. We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO",
    "Project Description Description Specification Support Inquiry Manhole cover sensors The Best Sensing Solutions—Directly from the street Description Manhole Protector: From Manhole lock to Manhole cover open detector Manholes leading to underground supply systems are essential for their maintenance, for example, it concerns telecommunication networks, water supply networks, gas supply networks and electricity networks, and so on. Although it is very crucial to a city's operations, the manhole can be one of the least protected and most vulnerable assets. Nowadays manhole cover failure such as metal theft (for manhole cover or copper cable underneath it) is on the rise and generally becomes a society issue. An unauthorized opening of manhole is very dangerous, it can cause deadly fall-in accidents to people and also inflict a huge amount of damage to public property. The conventional Manhole locks To protect the manhole and prevent it from being opened by simply a manhole cover hook, conventionally, the use of the manhole cover locks has been implemented. One problem is that it is hard for the manhole O&M agency to manage so many manhole keys, sometimes the keys are lost and this increases the difficulty. Another problem is that it may make the road surface uneven with the additional key structure on the manhole. With the new technology developments, the need for a fully automated manhole monitoring system has become practical. Automated monitoring of manhole and manhole cover is part of the development of smart cities and Internet of Things (IoT) which are the targets for modern governments to control and monitor the assets in cities. Manhole cover open detector With 6='s Manhole Cover Open Detector, you can deploy real-time monitoring and protection against metal theft, vandalism, and unauthorized access of manholes. The product utilizes a range of commercially available, off- theshelf sensors to detect and prevent manhole related incidents. Signals are transmitted from the sensor device to a cloud platform via LPWAN (Low Power Wide Area Network) technologies, such as GPRS, NB-IoT, etc. The sensors in combination with the cloud-based dashboard will allow you to monitor and well plan the maintenance of manholes. Key Features • Detect open/closed status of a manhole cover • Easy to install, wireless communication and free maintenance • Cloud based platform with GIS (Geographic information system) dashboard • Automatic alarm and message notification support Benefits • Monitor, report, predict and optimize your manholes • Pick up on unauthorized activities and well plan maintenance schedules • 24/7 monitoring with multiple status messages updated per day and instant alarm notification • Total flexibility and reliability, can be deployed in urban or rural environments Specification Product Guide Product Range WH-SXT-MOC-000G-301 WH-SXT-MOC-000G-302 WH-SXT-MOC-000N-301 WH-SXT-MWL-000G-301 Operation Sensor Type Reed switch Reed switch Reed switch Reed switch Alert triggering time (minimum) 0.7 s 0.7 s 0.7 s 0.7 s Communications Radio 2G GSM/GPRS 850/900/1800/1900 MHz 2G GSM/GPRS 850/900/1800/1900 MHz NB-IoT 2G GSM/GPRS 850/900/1800/1900 MHz SIM Card Micro SIM card Micro SIM card Micro SIM card Micro SIM card Electrical Power source Built-in battery Built-in battery Built-in battery Built-in battery Battery type Lithium-ion Lithium-ion Lithium-ion Lithium-ion Input voltage 3.6 V 3.6 V 3.6 V 3.6 V Battery capacity 8500 mAh 19000 mAh 7000 mAh 8500 mAh Battery lifetime 3~5 years 6~8 years 3~5 years 3~5 years Mechanical Dimensions 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm Material Polycarbonate Polycarbonate Polycarbonate Polycarbonate Environmental Operating temperature -25 °C to 65 °C -25 °C to 65 °C -25 °C to 65 °C -25 °C to 65 °C IP Rating IP68 IP68 IP68 IP68 Interfaces GPIO interface No No No Yes, for water level sensor Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Taxi Roof LED Display Double-sided Taxi Roof LED Display Double-sided Water Level Sensor Water Level Sensor Parking Lot Sensors Parking Lot Sensors Custom Parcel Locker System Custom Parcel Locker System Project Description Description Specification Support Inquiry Manhole cover sensors The Best Sensing Solutions—Directly from the street Description Manhole Protector: From Manhole lock to Manhole cover open detector Manholes leading to underground supply systems are essential for their maintenance, for example, it concerns telecommunication networks, water supply networks, gas supply networks and electricity networks, and so on. Although it is very crucial to a city's operations, the manhole can be one of the least protected and most vulnerable assets. Nowadays manhole cover failure such as metal theft (for manhole cover or copper cable underneath it) is on the rise and generally becomes a society issue. An unauthorized opening of manhole is very dangerous, it can cause deadly fall-in accidents to people and also inflict a huge amount of damage to public property. The conventional Manhole locks To protect the manhole and prevent it from being opened by simply a manhole cover hook, conventionally, the use of the manhole cover locks has been implemented. One problem is that it is hard for the manhole O&M agency to manage so many manhole keys, sometimes the keys are lost and this increases the difficulty. Another problem is that it may make the road surface uneven with the additional key structure on the manhole. With the new technology developments, the need for a fully automated manhole monitoring system has become practical. Automated monitoring of manhole and manhole cover is part of the development of smart cities and Internet of Things (IoT) which are the targets for modern governments to control and monitor the assets in cities. Manhole cover open detector With 6='s Manhole Cover Open Detector, you can deploy real-time monitoring and protection against metal theft, vandalism, and unauthorized access of manholes. The product utilizes a range of commercially available, off- theshelf sensors to detect and prevent manhole related incidents. Signals are transmitted from the sensor device to a cloud platform via LPWAN (Low Power Wide Area Network) technologies, such as GPRS, NB-IoT, etc. The sensors in combination with the cloud-based dashboard will allow you to monitor and well plan the maintenance of manholes. Key Features • Detect open/closed status of a manhole cover • Easy to install, wireless communication and free maintenance • Cloud based platform with GIS (Geographic information system) dashboard • Automatic alarm and message notification support Benefits • Monitor, report, predict and optimize your manholes • Pick up on unauthorized activities and well plan maintenance schedules • 24/7 monitoring with multiple status messages updated per day and instant alarm notification • Total flexibility and reliability, can be deployed in urban or rural environments Specification Product Guide Product Range WH-SXT-MOC-000G-301 WH-SXT-MOC-000G-302 WH-SXT-MOC-000N-301 WH-SXT-MWL-000G-301 Operation Sensor Type Reed switch Reed switch Reed switch Reed switch Alert triggering time (minimum) 0.7 s 0.7 s 0.7 s 0.7 s Communications Radio 2G GSM/GPRS 850/900/1800/1900 MHz 2G GSM/GPRS 850/900/1800/1900 MHz NB-IoT 2G GSM/GPRS 850/900/1800/1900 MHz SIM Card Micro SIM card Micro SIM card Micro SIM card Micro SIM card Electrical Power source Built-in battery Built-in battery Built-in battery Built-in battery Battery type Lithium-ion Lithium-ion Lithium-ion Lithium-ion Input voltage 3.6 V 3.6 V 3.6 V 3.6 V Battery capacity 8500 mAh 19000 mAh 7000 mAh 8500 mAh Battery lifetime 3~5 years 6~8 years 3~5 years 3~5 years Mechanical Dimensions 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm 105 mm x 75 mm x 305 mm Material Polycarbonate Polycarbonate Polycarbonate Polycarbonate Environmental Operating temperature -25 °C to 65 °C -25 °C to 65 °C -25 °C to 65 °C -25 °C to 65 °C IP Rating IP68 IP68 IP68 IP68 Interfaces GPIO interface No No No Yes, for water level sensor Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Taxi Roof LED Display Double-sided Taxi Roof LED Display Double-sided Water Level Sensor Water Level Sensor Parking Lot Sensors Parking Lot Sensors Custom Parcel Locker System Custom Parcel Locker System The Best Sensing Solutions—Directly from the street Manhole Protector: From Manhole lock to Manhole cover open detector Manholes leading to underground supply systems are essential for their maintenance, for example, it concerns telecommunication networks, water supply networks, gas supply networks and electricity networks, and so on. Although it is very crucial to a city's operations, the manhole can be one of the least protected and most vulnerable assets. Nowadays manhole cover failure such as metal theft (for manhole cover or copper cable underneath it) is on the rise and generally becomes a society issue. An unauthorized opening of manhole is very dangerous, it can cause deadly fall-in accidents to people and also inflict a huge amount of damage to public property. The conventional Manhole locks To protect the manhole and prevent it from being opened by simply a manhole cover hook, conventionally, the use of the manhole cover locks has been implemented. One problem is that it is hard for the manhole O&M agency to manage so many manhole keys, sometimes the keys are lost and this increases the difficulty. Another problem is that it may make the road surface uneven with the additional key structure on the manhole. With the new technology developments, the need for a fully automated manhole monitoring system has become practical. Automated monitoring of manhole and manhole cover is part of the development of smart cities and Internet of Things (IoT) which are the targets for modern governments to control and monitor the assets in cities. Manhole cover open detector With 6='s Manhole Cover Open Detector, you can deploy real-time monitoring and protection against metal theft, vandalism, and unauthorized access of manholes. The product utilizes a range of commercially available, off- theshelf sensors to detect and prevent manhole related incidents. Signals are transmitted from the sensor device to a cloud platform via LPWAN (Low Power Wide Area Network) technologies, such as GPRS, NB-IoT, etc. The sensors in combination with the cloud-based dashboard will allow you to monitor and well plan the maintenance of manholes. • Detect open/closed status of a manhole cover • Easy to install, wireless communication and free maintenance • Cloud based platform with GIS (Geographic information system) dashboard • Automatic alarm and message notification support • Monitor, report, predict and optimize your manholes • Pick up on unauthorized activities and well plan maintenance schedules • 24/7 monitoring with multiple status messages updated per day and instant alarm notification • Total flexibility and reliability, can be deployed in urban or rural environments Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Proprietary, modular-base solution with interplay of hardware & software. We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. We are able to develop the customized hardware and software precisely as per clients confirmed requirements. We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Related Products Taxi Roof LED Display Double-sided Taxi Roof LED Display Double-sided Water Level Sensor Water Level Sensor Parking Lot Sensors Parking Lot Sensors Custom Parcel Locker System Custom Parcel Locker System Taxi Roof LED Display Double-sided Taxi Roof LED Display Double-sided Taxi Roof LED Display Double-sided Water Level Sensor Water Level Sensor Parking Lot Sensors Parking Lot Sensors Custom Parcel Locker System Custom Parcel Locker System Custom Parcel Locker System",
    "Project Description Description Specification Support Inquiry mini Digital Concierge Android Kiosk With Payment & Access Control Features Improving Customer Experience & Saving Operation Cost A Versatile mini android kiosk making payment & self-service easier than before ever. Description Facial Recognition Payment & Strong GPU Power >Portrait mode display mode, providing user-friendly facial recognition experience: Glance at the camera then go; >Strong processor with powerful GPU for processing secured facial image data quickly & precisely; Slim & Simple, Elegant Design To Fit Any Store Or Hotel Desktop >Very slim body in screen part as mother board has been housed into the basement; >Upward Slope Providing the best viewing angle for users; >Place-n-play with reliable self-stand; Rich Communication Interface For Developers & Custom Options >Custom options including but not limited to connections of thermal printer, keypad, cash drawer, infrared thermal imaging sensor; >I/O ports placed at the rear side facing store operators with cable management port cover (optional); Specification Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core IPS HD Screen 10.1-inch 1920×1200 pixels Full Viewing Angle Capacitive Touchscreen 10-Point Multi-Touch 2GB or 4GB RAM For Speedy Response Facial Recognition Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE 4G LTE Optional With Built-in PCI Socket Thermal Printer Optional, Connects externally Android 7.1 Android OS 7.1 Model No. Droid1011 Display 10.1\" (247.5 mm) diagonal, color LCD, LED backlit Resolution 1920x1200 pixels Viewing Angle 178° horizontal, 178° vertical Touchscreen Projected capacitive NFC Card Reader Optional, Support protocals ISO14443A, ISO14443B,IOS15693,ISO18092, Felica with APDU commands Thermal Printer Needs external connection 2D Code Scanner Supports 1D, 2D codes, distance 5-20cm 4G LTE Optional Biometric Camera 2.0 MP pixels ( single lens, dual‐lens, 3D optional ), adjustable angle Installation Place-N-Play ( No Extra Custom Kiosk Enclosure ) Dimension 270*182*120mm Weight 1.8kgs Available Extension Available with 8-inch, 13.3-inch With Similar Design Styles Processor Rockchip Dual‐Core Cortex‐A72 1.8GHz + Quad‐core Cortex‐A53 1.4GHz RK3399 (optional with RK3288 ) RAM DDR3, 4GB (eMMC) <2GB for RK3288 ) ROM 16GB OS Android 7.1 I/O Ports 1 x RJ45, 2 x USB 2.0, 1 x USB Micro 2.0 OTG, 1 x 3.5mm earphone, 1 x TF card slot, 1 x 12V/3A DC in 5.0mm Jack, RJ11 x1 Power Supply DC 12V, 3A Audio Built-in stereo speakers 20mW @16ohm / 2Wx2 External Speakers Bluetooth 4.2 Media Support 1080P other video decoders (VC-1, MPEG-1/2/4, VP8) Color Black, White as default, custom color available Storage Temperature ‐15 ‐‐ 65 degrees Working Temperature 0 ‐‐ 50 degrees Storage/Working Humidity 10 ‐‐ 90% Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Project Description Description Specification Support Inquiry mini Digital Concierge Android Kiosk With Payment & Access Control Features Improving Customer Experience & Saving Operation Cost A Versatile mini android kiosk making payment & self-service easier than before ever. Description Facial Recognition Payment & Strong GPU Power >Portrait mode display mode, providing user-friendly facial recognition experience: Glance at the camera then go; >Strong processor with powerful GPU for processing secured facial image data quickly & precisely; Slim & Simple, Elegant Design To Fit Any Store Or Hotel Desktop >Very slim body in screen part as mother board has been housed into the basement; >Upward Slope Providing the best viewing angle for users; >Place-n-play with reliable self-stand; Rich Communication Interface For Developers & Custom Options >Custom options including but not limited to connections of thermal printer, keypad, cash drawer, infrared thermal imaging sensor; >I/O ports placed at the rear side facing store operators with cable management port cover (optional); Specification Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core IPS HD Screen 10.1-inch 1920×1200 pixels Full Viewing Angle Capacitive Touchscreen 10-Point Multi-Touch 2GB or 4GB RAM For Speedy Response Facial Recognition Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE 4G LTE Optional With Built-in PCI Socket Thermal Printer Optional, Connects externally Android 7.1 Android OS 7.1 Model No. Droid1011 Display 10.1\" (247.5 mm) diagonal, color LCD, LED backlit Resolution 1920x1200 pixels Viewing Angle 178° horizontal, 178° vertical Touchscreen Projected capacitive NFC Card Reader Optional, Support protocals ISO14443A, ISO14443B,IOS15693,ISO18092, Felica with APDU commands Thermal Printer Needs external connection 2D Code Scanner Supports 1D, 2D codes, distance 5-20cm 4G LTE Optional Biometric Camera 2.0 MP pixels ( single lens, dual‐lens, 3D optional ), adjustable angle Installation Place-N-Play ( No Extra Custom Kiosk Enclosure ) Dimension 270*182*120mm Weight 1.8kgs Available Extension Available with 8-inch, 13.3-inch With Similar Design Styles Processor Rockchip Dual‐Core Cortex‐A72 1.8GHz + Quad‐core Cortex‐A53 1.4GHz RK3399 (optional with RK3288 ) RAM DDR3, 4GB (eMMC) <2GB for RK3288 ) ROM 16GB OS Android 7.1 I/O Ports 1 x RJ45, 2 x USB 2.0, 1 x USB Micro 2.0 OTG, 1 x 3.5mm earphone, 1 x TF card slot, 1 x 12V/3A DC in 5.0mm Jack, RJ11 x1 Power Supply DC 12V, 3A Audio Built-in stereo speakers 20mW @16ohm / 2Wx2 External Speakers Bluetooth 4.2 Media Support 1080P other video decoders (VC-1, MPEG-1/2/4, VP8) Color Black, White as default, custom color available Storage Temperature ‐15 ‐‐ 65 degrees Working Temperature 0 ‐‐ 50 degrees Storage/Working Humidity 10 ‐‐ 90% Support About US Our Process About US Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Peace of mind Proprietary, modular-base solution with interplay of hardware & software. >> Our Process Project Goal Recognition We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Diagnosis Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. Research & Design We are able to develop the customized hardware and software precisely as per clients confirmed requirements. Validation We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements Test & Trial We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass Production & Launch Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. Alex , Yandex For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University Ozalp Tozan , Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. Tomar , Creative Director , Outform SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. Greg, Account Manager , Jabra They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Jacky Wong, Project Manager , Jetinno, Guangzhou Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Facebook Twitter LinkedIn Reddit Whatsapp Google+ Tumblr Pinterest Vk Email Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO mini Digital Concierge Android Kiosk With Payment & Access Control Features Improving Customer Experience & Saving Operation Cost A Versatile mini android kiosk making payment & self-service easier than before ever. Facial Recognition Payment & Strong GPU Power >Portrait mode display mode, providing user-friendly facial recognition experience: Glance at the camera then go; >Strong processor with powerful GPU for processing secured facial image data quickly & precisely; Slim & Simple, Elegant Design To Fit Any Store Or Hotel Desktop >Very slim body in screen part as mother board has been housed into the basement; >Upward Slope Providing the best viewing angle for users; >Place-n-play with reliable self-stand; Rich Communication Interface For Developers & Custom Options >Custom options including but not limited to connections of thermal printer, keypad, cash drawer, infrared thermal imaging sensor; >I/O ports placed at the rear side facing store operators with cable management port cover (optional); Quad-Core Or 6-Core Processor RK3288 Quadcore Or RK3399 6-Core 10.1-inch 1920×1200 pixels Full Viewing Angle 2GB or 4GB RAM Available With Single-lens, dual lens and 3D structural camera Developer Friendly Android OS Dedicated Android OS With Rich API For Developers 4G LTE Optional With Built-in PCI Socket Our mission is to improve the quality of the clients' business life with safety, efficiency and peace of mind, via simple customization of our existing product lines or design & development of 100% new products. Safety Lowest Product Failure Rate, Product Life-circle Support; Efficiency Increase productivity and decrease costs; Proprietary, modular-base solution with interplay of hardware & software. We understand each customer has their own unique knowledge about industrial smart electronics solution, they may face different challenges, thus have different project requirements with different expectation. Due to the above, the starting point of our job is to recognize the actual project target, helping our customers address the multiple aspects of the whole project, from installation, user experience to maintenance. Our product team together with skilled engineers, project managers and customer success executives would engage directly with customer's cross-functional teams, to obtain the full view of client's challenge as well as the possible untapped pain, while presenting clients the existing solutions & case studies , thus clients could make better decisions about what they should buy. We are able to develop the customized hardware and software precisely as per clients confirmed requirements. We would quickly develop a concept-of-approval prototype to realize what clients need, in order to validate the requirements We would implement comprehensive testing via trial production, ensuring zero risk of mass-production failure. Mass productions come as carefully planned, informed of our customers, with daily logging data shared so that shipment schedule could be reassured. What Our Clients Say… SZ1 makes everything clear, simple and transparent, like plugging us into Shenzhen local resources. For some people, I'm sure SZ1 is just a side show in their business, but for us, it's a critical part of our success. We have increased revenue 30% since working with SZ1.\" Ozalp Tozan, Research Lab, PhD & Technology Director of Atilim University SZ1 gives us peace of mind as a great technology partner for the most challenging project with A-brand clients. SZ1 builds retail display solution for us with every user element modular preset, every project they response rapidly, even if we ask for a change in the last minute… amazing partner. They analyse and understand our requirements for coffee machine vending kiosk like a doctor, many intractable issues were addressed & recognized before project implementation. Some Of Exciting Projects We Accomplished Before… Interested ? Send US an Inquiry ! Interested ? Send US an Inquiry ! Share This Solution, Choose Your Platform! Related Products Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Transparent Screen Transparent Screen Bill Payment Kiosk Bill Payment Kiosk Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Handheld Enterprise Tablet Windows And Android Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO Linux Media Player With Brightsign Styled IO"
  ]
}