{
  "company": "tascent.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 17,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.2588235294117647,
    "framing_market": 0.7411764705882353,
    "num_docs": 18
  },
  "topic_timeline": {
    "20": {
      "-1": 17,
      "0": 1
    }
  },
  "sample_docs": [
    "Tascent Delivers Top Performance in DHS Face Recognition Test Bringing biometrics to life: Devices and software with unparalleled usability Explore Products & Services Tascent Enterprise Suite: Comprehensive software tools for biometric identity Watch the video Tascent Provides End-to-End Biometric Travel Solution for Royal Caribbean DHS Biometric Rally Results DHS Biometric Rally Results Products & Services Products & Services Tascent Enterprise Suite Tascent Enterprise Suite Royal Caribbean Face Recognition Royal Caribbean Face Recognition Tascent Delivers Top Performance in DHS Face Recognition Test Tascent Delivers Top Performance in DHS Face Recognition Test Bringing biometrics to life: Devices and software with unparalleled usability Explore Products & Services Bringing biometrics to life: Devices and software with unparalleled usability Tascent Enterprise Suite: Comprehensive software tools for biometric identity Watch the video Tascent Enterprise Suite: Comprehensive software tools for biometric identity Tascent Provides End-to-End Biometric Travel Solution for Royal Caribbean Tascent Provides End-to-End Biometric Travel Solution for Royal Caribbean DHS Biometric Rally Results DHS Biometric Rally Results Products & Services Products & Services Tascent Enterprise Suite Tascent Enterprise Suite Royal Caribbean Face Recognition Royal Caribbean Face Recognition Products Tascent Enterprise Suite A modern approach to biometric identity systems Access Data Sheet Watch the Video Access Data Sheet Tascent Enterprise Suite represents a thoroughly modern approach to biometric identity software. Delivering comprehensive capabilities in a way that's simple and intuitive, Tascent Enterprise Suite makes it easy to deploy and manage complete biometric identity systems. [ About Tascent Tascent Enterprise Suite] InSight One The next generation for high throughput iris recognition Access Data Sheet Watch the Video Access Data Sheet Delivering effortless, fast, and highly accurate biometric enrollment and identification, InSight One captures best-in-class iris and face biometrics in a sleek, elegant device. Designed for high throughput identification and verification, InSight One sets the stage for the future of travel, access, and identity. [ About Tascent InSight One] Tascent MX Mobile registration, identification, and verification. Evolved. Access Data Sheet Watch the Video Access Data Sheet The next generation of Tascent Mobile, Tascent MX combines the world's leading smartphone devices with advanced face, fingerprint, and iris biometrics to power enrollment and authentication. Smaller, more intuitive, more powerful, and now featuring a unique approach to multi-platform, multi-generation support. [ About Tascent Tascent MX] A modern approach to biometric identity systems Tascent Enterprise Suite represents a thoroughly modern approach to biometric identity software. Delivering comprehensive capabilities in a way that's simple and intuitive, Tascent Enterprise Suite makes it easy to deploy and manage complete biometric identity systems. The next generation for high throughput iris recognition Delivering effortless, fast, and highly accurate biometric enrollment and identification, InSight One captures best-in-class iris and face biometrics in a sleek, elegant device. Designed for high throughput identification and verification, InSight One sets the stage for the future of travel, access, and identity. Mobile registration, identification, and verification. Evolved. The next generation of Tascent Mobile, Tascent MX combines the world's leading smartphone devices with advanced face, fingerprint, and iris biometrics to power enrollment and authentication. Smaller, more intuitive, more powerful, and now featuring a unique approach to multi-platform, multi-generation support. Applications Travel Tascent's high throughput and mobile identity products deliver efficiency, safety, and personalized treatment for the wide range of use cases consistently encountered in air travel, from bag drop to VIP lounge to boarding and even in-flight. Border Management Tascent's iris recognition and multimodal biometric systems enable increased efficiency and decreased queues in high throughput border management environments while also supporting mobile applications in the air, on the ground, and in the field. Public Safety Positive identity confirmation using Tascent's multimodal high throughput and smartphone-based mobile biometric capabilities is helping to improve the safety, security, and efficiency of public safety organizations around the world. Travel Tascent's high throughput and mobile identity products deliver efficiency, safety, and personalized treatment for the wide range of use cases consistently encountered in air travel, from bag drop to VIP lounge to boarding and even in-flight. Tascent's high throughput and mobile identity products deliver efficiency, safety, and personalized treatment for the wide range of use cases consistently encountered in air travel, from bag drop to VIP lounge to boarding and even in-flight. Border Management Tascent's iris recognition and multimodal biometric systems enable increased efficiency and decreased queues in high throughput border management environments while also supporting mobile applications in the air, on the ground, and in the field. Tascent's iris recognition and multimodal biometric systems enable increased efficiency and decreased queues in high throughput border management environments while also supporting mobile applications in the air, on the ground, and in the field. Public Safety Positive identity confirmation using Tascent's multimodal high throughput and smartphone-based mobile biometric capabilities is helping to improve the safety, security, and efficiency of public safety organizations around the world. Positive identity confirmation using Tascent's multimodal high throughput and smartphone-based mobile biometric capabilities is helping to improve the safety, security, and efficiency of public safety organizations around the world. Tascent, Inc. 475 Alberto Way Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com Close 475 Alberto Way Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com",
    "With a fully automated face and iris scan process supported by real-time feedback, InSight One captures high quality dual iris and face images in about 2 seconds at a standoff distance of 0.5 to 1.0 meters, creating an experience that is both appealing to users and well-suited to a wide variety of applications. Download the data sheet. InSight One's customizable LCD and LED user interface is seamlessly integrated into the precision-crafted aluminum enclosure, delivering a natural, unified, and visually-pleasing user experience. InSight One offers a convenient, comfortable way to capture high quality face and iris images that meet or exceed demanding ISO / ICAO standards for format and quality. See the tech specs. Tascent offers a variety of mounting options to enable tight integration of InSight One in desktop, e-Gate, and kiosk applications as well as custom color options to aesthetically match its surroundings. InSight One Self-Service Solutions InSight One's powerful and intuitive multimodal biometric capabilities are available in a variety of form factors to support a wide range of self-service applications. InSight One is available as an embeddable OEM module to provide robust iris and face biometric capabilities for kiosk and other self-service touchpoints. The InSight One OEM Module enables integrators to bring biometric enrollment, identification, and verification in self-service kiosks to enhance the experience and security of services provided. about InSight One Self-Service Solutions. With a fully automated face and iris scan process supported by real-time feedback, InSight One captures high quality dual iris and face images in about 2 seconds at a standoff distance of 0.5 to 1.0 meters, creating an experience that is both appealing to users and well-suited to a wide variety of applications. Download the data sheet. InSight One's customizable LCD and LED user interface is seamlessly integrated into the precision-crafted aluminum enclosure, delivering a natural, unified, and visually-pleasing user experience. InSight One offers a convenient, comfortable way to capture high quality face and iris images that meet or exceed demanding ISO / ICAO standards for format and quality. See the tech specs. Tascent offers a variety of mounting options to enable tight integration of InSight One in desktop, e-Gate, and kiosk applications as well as custom color options to aesthetically match its surroundings. InSight One Self-Service Solutions InSight One's powerful and intuitive multimodal biometric capabilities are available in a variety of form factors to support a wide range of self-service applications. InSight One is available as an embeddable OEM module to provide robust iris and face biometric capabilities for kiosk and other self-service touchpoints. The InSight One OEM Module enables integrators to bring biometric enrollment, identification, and verification in self-service kiosks to enhance the experience and security of services provided. about InSight One Self-Service Solutions. Key features Compact form factor, world-class industrial design Simultaneous dual iris and face capture at a standoff distance of 0.5 to 1.0 meter Fully automated capture process supported by real-time feedback enables intuitive operation even for non-acclimated users On-demand face capture for multiple poses Based on patented technology, best-in-class iris imaging delivers superior accuracy even in challenging real-world environments Can be integrated as a secure locked-down network appliance or point-to-point USB peripheral Open architecture, standards-compliant design enables rapid integration and deployment with new or existing infrastructure Technical specifications 0.5 – 1.0 meter (1.6 – 3.3 ft) standoff distance Accommodates users from 1.2 to 2.1 meters (3.9 to 6.8 ft) high Iris images meet or exceed ISO 19794-6 and 29794-6 standards for format and image quality Face images meet or exceed ISO 19794-5 and 29794-5 image quality standards for format and image quality 2 second image dual iris + face capture LED-based illuminator is eye safe at all distances Fully configurable high resolution 5†LCD and integrated LED illlumination Optional 10,000 user on-board database PKI encryption with standard P12 or self-signed 1024 bit certificates SOAP over HTTPS and USB 2.0 interfaces FCC certified, CE (pending), UL Product Safety, IEC 64271 Eye Safety Compact form factor, world-class industrial design Simultaneous dual iris and face capture at a standoff distance of 0.5 to 1.0 meter Fully automated capture process supported by real-time feedback enables intuitive operation even for non-acclimated users On-demand face capture for multiple poses Based on patented technology, best-in-class iris imaging delivers superior accuracy even in challenging real-world environments Can be integrated as a secure locked-down network appliance or point-to-point USB peripheral Open architecture, standards-compliant design enables rapid integration and deployment with new or existing infrastructure 0.5 – 1.0 meter (1.6 – 3.3 ft) standoff distance Accommodates users from 1.2 to 2.1 meters (3.9 to 6.8 ft) high Iris images meet or exceed ISO 19794-6 and 29794-6 standards for format and image quality Face images meet or exceed ISO 19794-5 and 29794-5 image quality standards for format and image quality 2 second image dual iris + face capture LED-based illuminator is eye safe at all distances Fully configurable high resolution 5†LCD and integrated LED illlumination Optional 10,000 user on-board database PKI encryption with standard P12 or self-signed 1024 bit certificates SOAP over HTTPS and USB 2.0 interfaces FCC certified, CE (pending), UL Product Safety, IEC 64271 Eye Safety Tascent, Inc. 475 Alberto Way Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com Close 475 Alberto Way Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com",
    "Tascent Biometrics & Identity Tascent Delivers Top Performance in DHS Test of Cooperative Face Recognition August 14, 2019 13 Company's new InSight Face product scores highest accuracy, efficiency, and customer satisfaction LOS GATOS, CA – August 14, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced that it has received top performance marks in all categories in... read more Panasonic Avionics and Tascent Partner to Enhance Air Traveler Experience with Biometrics September 26, 2017 4 Multimodal biometrics to streamline travel and deliver industry innovation LONG BEACH, CA – September 26, 2017 – Panasonic Avionics Corporation (Panasonic), the world leader in inflight entertainment and connectivity, and Tascent, Inc., a biometrics and identity innovation company, today announced their... read more Tascent InSight One Wins Silver in IDSA International Design Excellence Awards 2017 August 22, 2017 1 InSight One awarded top honor among Commercial and Industrial products Los Gatos, CA—August 22, 2017—Tascent InSight One wins Silver in the International Design Excellence Awards (IDEA®) 2017 hosted by the Industrial Designers Society of America (IDSA). The iris and face... read more Tascent InSight One Wins 2017 Spark Design Award July 19, 2017 0 We are happy to announce that Tascent InSight One has won the Silver Spark Award! Thank you Spark Awards for the 2017 product design recognition. read more Tascent InSight One Wins 2017 Good Design Australia Award June 20, 2017 0 InSight One championed for user-centric design excellence LOS GATOS, Ca. – June 20, 2017 - Tascent™ has won the 2017 Good Design® Australia award for its InSight One iris and face recognition system. The accolade is one of Australia's most... read more Tascent InSight One Wins Red Dot Award for Outstanding Product Design April 03, 2017 0 Tascent's biometric recognition system beats out more than 5,500 applicants to win prestigious internationally recognized quality seal. LOS GATOS, CA – April 3, 2017 – Tascent™ InSight® One has achieved the globally recognized \"Red Dot†award for high quality design. In the... read more Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more CATEGORIES Awards Blog Entries Customer Projects Events Media Coverage News Press Releases Products Tascent Delivers Top Performance in DHS Test of Cooperative Face Recognition August 14, 2019 13 Company's new InSight Face product scores highest accuracy, efficiency, and customer satisfaction LOS GATOS, CA – August 14, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced that it has received top performance marks in all categories in... read more Panasonic Avionics and Tascent Partner to Enhance Air Traveler Experience with Biometrics September 26, 2017 4 Multimodal biometrics to streamline travel and deliver industry innovation LONG BEACH, CA – September 26, 2017 – Panasonic Avionics Corporation (Panasonic), the world leader in inflight entertainment and connectivity, and Tascent, Inc., a biometrics and identity innovation company, today announced their... read more Tascent InSight One Wins Silver in IDSA International Design Excellence Awards 2017 August 22, 2017 1 InSight One awarded top honor among Commercial and Industrial products Los Gatos, CA—August 22, 2017—Tascent InSight One wins Silver in the International Design Excellence Awards (IDEA®) 2017 hosted by the Industrial Designers Society of America (IDSA). The iris and face... read more Tascent InSight One Wins 2017 Spark Design Award July 19, 2017 0 We are happy to announce that Tascent InSight One has won the Silver Spark Award! Thank you Spark Awards for the 2017 product design recognition. read more Tascent InSight One Wins 2017 Good Design Australia Award June 20, 2017 0 InSight One championed for user-centric design excellence LOS GATOS, Ca. – June 20, 2017 - Tascent™ has won the 2017 Good Design® Australia award for its InSight One iris and face recognition system. The accolade is one of Australia's most... read more Tascent InSight One Wins Red Dot Award for Outstanding Product Design April 03, 2017 0 Tascent's biometric recognition system beats out more than 5,500 applicants to win prestigious internationally recognized quality seal. LOS GATOS, CA – April 3, 2017 – Tascent™ InSight® One has achieved the globally recognized \"Red Dot†award for high quality design. In the... read more Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more Tascent Delivers Top Performance in DHS Test of Cooperative Face Recognition August 14, 2019 13 Company's new InSight Face product scores highest accuracy, efficiency, and customer satisfaction LOS GATOS, CA – August 14, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced that it has received top performance marks in all categories in... read more Tascent Delivers Top Performance in DHS Test of Cooperative Face Recognition Company's new InSight Face product scores highest accuracy, efficiency, and customer satisfaction LOS GATOS, CA – August 14, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced that it has received top performance marks in all categories in... Panasonic Avionics and Tascent Partner to Enhance Air Traveler Experience with Biometrics September 26, 2017 4 Multimodal biometrics to streamline travel and deliver industry innovation LONG BEACH, CA – September 26, 2017 – Panasonic Avionics Corporation (Panasonic), the world leader in inflight entertainment and connectivity, and Tascent, Inc., a biometrics and identity innovation company, today announced their... read more Panasonic Avionics and Tascent Partner to Enhance Air Traveler Experience with Biometrics Multimodal biometrics to streamline travel and deliver industry innovation LONG BEACH, CA – September 26, 2017 – Panasonic Avionics Corporation (Panasonic), the world leader in inflight entertainment and connectivity, and Tascent, Inc., a biometrics and identity innovation company, today announced their... Tascent InSight One Wins Silver in IDSA International Design Excellence Awards 2017 August 22, 2017 1 InSight One awarded top honor among Commercial and Industrial products Los Gatos, CA—August 22, 2017—Tascent InSight One wins Silver in the International Design Excellence Awards (IDEA®) 2017 hosted by the Industrial Designers Society of America (IDSA). The iris and face... read more Tascent InSight One Wins Silver in IDSA International Design Excellence Awards 2017 InSight One awarded top honor among Commercial and Industrial products Los Gatos, CA—August 22, 2017—Tascent InSight One wins Silver in the International Design Excellence Awards (IDEA®) 2017 hosted by the Industrial Designers Society of America (IDSA). The iris and face... Tascent InSight One Wins 2017 Spark Design Award July 19, 2017 0 We are happy to announce that Tascent InSight One has won the Silver Spark Award! Thank you Spark Awards for the 2017 product design recognition. read more Tascent InSight One Wins 2017 Spark Design Award We are happy to announce that Tascent InSight One has won the Silver Spark Award! Thank you Spark Awards for the 2017 product design recognition. Tascent InSight One Wins 2017 Good Design Australia Award June 20, 2017 0 InSight One championed for user-centric design excellence LOS GATOS, Ca. – June 20, 2017 - Tascent™ has won the 2017 Good Design® Australia award for its InSight One iris and face recognition system. The accolade is one of Australia's most... read more Tascent InSight One Wins 2017 Good Design Australia Award InSight One championed for user-centric design excellence LOS GATOS, Ca. – June 20, 2017 - Tascent™ has won the 2017 Good Design® Australia award for its InSight One iris and face recognition system. The accolade is one of Australia's most... Tascent InSight One Wins Red Dot Award for Outstanding Product Design April 03, 2017 0 Tascent's biometric recognition system beats out more than 5,500 applicants to win prestigious internationally recognized quality seal. LOS GATOS, CA – April 3, 2017 – Tascent™ InSight® One has achieved the globally recognized \"Red Dot†award for high quality design. In the... read more Tascent InSight One Wins Red Dot Award for Outstanding Product Design Tascent's biometric recognition system beats out more than 5,500 applicants to win prestigious internationally recognized quality seal. LOS GATOS, CA – April 3, 2017 – Tascent™ InSight® One has achieved the globally recognized \"Red Dot†award for high quality design. In the... Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more Tascent Introduces Mobile Biometric Platform for iPhone Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... Tascent, Inc. 475 Alberto Way, Suite 200 Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com Close 475 Alberto Way, Suite 200 Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com",
    "Tascent Biometrics & Identity Tascent Expands Mobile Biometric Product Family, Focusing on Flexibility June 18, 2019 6 Tascent M1 enables powerful and cost-effective biometric identity solutions across range of Samsung Galaxy devices, powered by OtterBox uniVERSE JOHANNESBURG, SOUTH AFRICA – June 18, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced the availability of Tascent... read more Tascent Partners with First Advantage to Transform the Candidate Screening Experience August 13, 2018 1 Tascent MX and Enterprise Suite to power mobile biometric registration for global leader in employee background checks Atlanta, GA — August 13, 2018 — Consistent with its commitment to continuous innovation, First Advantage, a global leader in background check and drug... read more Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more CATEGORIES Awards Blog Entries Events Media Coverage News Press Releases Products Tascent Expands Mobile Biometric Product Family, Focusing on Flexibility June 18, 2019 6 Tascent M1 enables powerful and cost-effective biometric identity solutions across range of Samsung Galaxy devices, powered by OtterBox uniVERSE JOHANNESBURG, SOUTH AFRICA – June 18, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced the availability of Tascent... read more Tascent Partners with First Advantage to Transform the Candidate Screening Experience August 13, 2018 1 Tascent MX and Enterprise Suite to power mobile biometric registration for global leader in employee background checks Atlanta, GA — August 13, 2018 — Consistent with its commitment to continuous innovation, First Advantage, a global leader in background check and drug... read more Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more Tascent Expands Mobile Biometric Product Family, Focusing on Flexibility June 18, 2019 6 Tascent M1 enables powerful and cost-effective biometric identity solutions across range of Samsung Galaxy devices, powered by OtterBox uniVERSE JOHANNESBURG, SOUTH AFRICA – June 18, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced the availability of Tascent... read more Tascent Expands Mobile Biometric Product Family, Focusing on Flexibility Tascent M1 enables powerful and cost-effective biometric identity solutions across range of Samsung Galaxy devices, powered by OtterBox uniVERSE JOHANNESBURG, SOUTH AFRICA – June 18, 2019 – Tascent, Inc., the leader in intuitive biometrics, today announced the availability of Tascent... Tascent Partners with First Advantage to Transform the Candidate Screening Experience August 13, 2018 1 Tascent MX and Enterprise Suite to power mobile biometric registration for global leader in employee background checks Atlanta, GA — August 13, 2018 — Consistent with its commitment to continuous innovation, First Advantage, a global leader in background check and drug... read more Tascent Partners with First Advantage to Transform the Candidate Screening Experience Tascent MX and Enterprise Suite to power mobile biometric registration for global leader in employee background checks Atlanta, GA — August 13, 2018 — Consistent with its commitment to continuous innovation, First Advantage, a global leader in background check and drug... Tascent Introduces Mobile Biometric Platform for iPhone July 19, 2016 0 Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... read more Tascent Introduces Mobile Biometric Platform for iPhone Integrated iris, face, fingerprint and voice enable wide range of biometric applications including travel, public safety & humanitarian aid. LOS GATOS, CA – July 19, 2016 – Tascent™, Inc., an innovator in biometrics and identity, today announced the availability of... Tascent, Inc. 475 Alberto Way, Suite 200 Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com Close 475 Alberto Way, Suite 200 Los Gatos, CA 95032 USA +1 (408) 335-4700 info@tascent.com",
    "Cross-Platform / Cross-Generation Support Tascent M1 isn't bound to the form factor of a specific mobile device. Leveraging the OtterBox uniVERSE Case System, the same biometric peripheral can be used across multiple device form factors and generations. Easy Attach / Detach Powered by OtterBox uniVERSE and a USB Type-C connector, M1 can be robustly attached or simply detached with little effort. This makes it ideal for users who only need the advanced biometric capability of M1 on an intermittent basis. Single-Device Experience When connected, M1 provides a seamless, single device user experience, including an external USB Type-C port for passthrough charging. Cross-Platform / Cross-Generation Support Tascent M1 isn't bound to the form factor of a specific mobile device. Leveraging the OtterBox uniVERSE Case System, the same biometric peripheral can be used across multiple device form factors and generations. Cross-Platform / Cross-Generation Support Tascent M1 isn't bound to the form factor of a specific mobile device. Leveraging the OtterBox uniVERSE Case System, the same biometric peripheral can be used across multiple device form factors and generations. Easy Attach / Detach Powered by OtterBox uniVERSE and a USB Type-C connector, M1 can be robustly attached or simply detached with little effort. This makes it ideal for users who only need the advanced biometric capability of M1 on an intermittent basis. Easy Attach / Detach Powered by OtterBox uniVERSE and a USB Type-C connector, M1 can be robustly attached or simply detached with little effort. This makes it ideal for users who only need the advanced biometric capability of M1 on an intermittent basis. Single-Device Experience When connected, M1 provides a seamless, single device user experience, including an external USB Type-C port for passthrough charging. When connected, M1 provides a seamless, single device user experience, including an external USB Type-C port for passthrough charging. M1 is one of the most compact and portable mobile fingerprint solutions available. While lightweight, it is highly durable, meeting IP65 and MIL-STD-810G specifications for ingress and drop protection. Metric System English Lightweight 55g M1 only 230g with S8 1.94oz M1 only 8.11oz with S8 Compact 133.6mm x 44.5mm x 16.2mm 5.26in x 1.75in x 0.64in Durable IP65 and MIL-STD-810G tested M1 is one of the most compact and portable mobile fingerprint solutions available. While lightweight, it is highly durable, meeting IP65 and MIL-STD-810G specifications for ingress and drop protection. Lightweight 55g M1 only 230g with S8 1.94oz M1 only 8.11oz with S8 Compact 133.6mm x 44.5mm x 16.2mm 5.26in x 1.75in x 0.64in 133.6mm x 44.5mm x 16.2mm 5.26in x 1.75in x 0.64in Durable IP65 and MIL-STD-810G tested IP65 and MIL-STD-810G tested FAP 30 Non-Optical Fingerprint Featuring next-generation capacitive TFT technology, Tascent M1 delivers 500dpi imaging and fast capture in all lighting conditions. M1 is extremely power efficient, enabling all-day use and supporting an ultra-low power standby mode when not in use. FAP 30 Non-Optical Fingerprint Featuring next-generation capacitive TFT technology, Tascent M1 delivers 500dpi imaging and fast capture in all lighting conditions. M1 is extremely power efficient, enabling all-day use and supporting an ultra-low power standby mode when not in use. Intuitive, High-Performance Biometric Capture The Tascent Mobile App and Tascent Mobile SDK provide intuitive guidance for face, fingerprint, biographic, and identity document capture for both operator and subject, resulting in superior biometric performance with minimal training. Intuitive, High-Performance Biometric Capture The Tascent Mobile App and Tascent Mobile SDK provide intuitive guidance for face, fingerprint, biographic, and identity document capture for both operator and subject, resulting in superior biometric performance with minimal training. Benefits of smartphone-based mobile biometrics include: Intuitive and simple user interface Integrated WiFi, 4G, and LTE communications High quality GPS location tracking Vast array of relevant off-the-shelf and custom apps and enterprise-grade security and device management tools Benefits of smartphone-based mobile biometrics include: Intuitive and simple user interface Intuitive and simple user interface Integrated WiFi, 4G, and LTE communications Integrated WiFi, 4G, and LTE communications High quality GPS location tracking High quality GPS location tracking Vast array of relevant off-the-shelf and custom apps and enterprise-grade security and device management tools Vast array of relevant off-the-shelf and custom apps and enterprise-grade security and device management tools A Perfect Match Tascent Enterprise Suite works seamlessly with Tascent Mobile – unleashing the full potential of its leading-edge capabilities. about Tascent Enterprise Suite Tascent Enterprise Suite works seamlessly with Tascent Mobile – unleashing the full potential of its leading-edge capabilities. about Tascent Enterprise Suite Custom Apps for Tailored Applications The Tascent Mobile SDK combines all of the tools necessary for developers to rapidly integrate the world-class biometric capabilities of the Tascent Mobile Product Family into custom software solutions that run on Android and iOS devices. Going beyond typical software development kits, the Tascent Mobile SDK incorporates the capture experience from the Tascent Mobile App in the form of Encapsulated Application Elements that developers can drop-in to their custom applications. Custom Apps for Tailored Applications The Tascent Mobile SDK combines all of the tools necessary for developers to rapidly integrate the world-class biometric capabilities of the Tascent Mobile Product Family into custom software solutions that run on Android and iOS devices. Going beyond typical software development kits, the Tascent Mobile SDK incorporates the capture experience from the Tascent Mobile App in the form of Encapsulated Application Elements that developers can drop-in to their custom applications. Download the data sheet FRONT BACK KEY FEATURES Non-optical FAP 30 fingerprint sensor works in bright sunlight Compact form factor weighs 55 g (M1 only), 230 g (including Samsung S8 and OtterBox case) Sleek, yet rugged: IP65 and MIL-STD 810G tested Works with Samsung Galaxy S8, S9, Tab A, Tab Active and expanding ecosystem of devices supported by the OtterBox uniVERSE Case System Compatible with Tascent Mobile App and Tascent Mobile SDK for Android TECHNICAL SPECIFICATIONS Weight: 55 g (1.94 oz) Dimensions (H x W x T): 133.6 mm (5.26 in) x 44.5 mm (1.75 in) x 16.2 mm (0.64 in) Environmental Protection: IP65, MIL STD 810G (drop, shock, and vibration) OtterBox uniVERSE Case System provides OtterBox Certified Drop+ Protection for the smartphone Supported Hardware Platforms: Samsung Galaxy devices supported by OtterBox uniVERSE, including Galaxy S8, S9, Tab A, Tab Active Phone Connectivity: USB Type-C Included in Package: Tascent M1 Fingerprint Capture: FAP-30 Single print 0.8†x 0.1â€, Capacitive TFT-based Sensor; 500 dpi resolution Face Capture: Utilizes integrated smartphone camera for high-quality auto-focus capture, BSI low-light sensitive with integrated flash / torch Face Capture ISO 19794-5 standards compliant at >0.5 m stand-off: >140 pixels between eyes, ISO-compliant cropping, De-rotation Optional features enabled by Tascent Mobile App, including on-device image quality metrics and matching, NFC reading, and Passport / MRZ scanning Samsung Galaxy S8 Non-optical FAP 30 fingerprint sensor works in bright sunlight Compact form factor weighs 55 g (M1 only), 230 g (including Samsung S8 and OtterBox case) Sleek, yet rugged: IP65 and MIL-STD 810G tested Works with Samsung Galaxy S8, S9, Tab A, Tab Active and expanding ecosystem of devices supported by the OtterBox uniVERSE Case System Compatible with Tascent Mobile App and Tascent Mobile SDK for Android Weight: 55 g (1.94 oz) Dimensions (H x W x T): 133.6 mm (5.26 in) x 44.5 mm (1.75 in) x 16.2 mm (0.64 in) Environmental Protection: IP65, MIL STD 810G (drop, shock, and vibration) OtterBox uniVERSE Case System provides OtterBox Certified Drop+ Protection for the smartphone Supported Hardware Platforms: Samsung Galaxy devices supported by OtterBox uniVERSE, including Galaxy S8, S9, Tab A, Tab Active Phone Connectivity: USB Type-C Included in Package: Tascent M1 Fingerprint Capture: FAP-30 Single print 0.8†x 0.1â€, Capacitive TFT-based Sensor; 500 dpi resolution Face Capture: Utilizes integrated smartphone camera for high-quality auto-focus capture, BSI low-light sensitive with integrated flash / torch Face Capture ISO 19794-5 standards compliant at >0.5 m stand-off: >140 pixels between eyes, ISO-compliant cropping, De-rotation Optional features enabled by Tascent Mobile App, including on-device image quality metrics and matching, NFC reading, and Passport / MRZ scanning"
  ]
}