{
  "company": "trinamixsensing.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 7,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 1
    }
  },
  "sample_docs": [
    "trinamiX at LASER World of PHOTONICS 2023 Visit trinamiX at LASER World of PHOTONICS 2023 Thursday, 15 June 2023 As in previous years, we'll be packing our demo kits and return to Munich for LASER World of PHOTONICS - the world's leading platform for the laser and photonics industry. From June 27 to 30 , our team will present exciting innovations that we are driving in the fields of biometrics and spectroscopy. In of biometrics, visitors of our booth 520 in hall A3 will experience trinamiX Face Authentication – running on an Android-based smartphone reference design and mounted invisibly behind its display. The solution introduces a new gold standard for biometric authentication by not only erasing the need for a notch or punchhole but also fulfilling the industry's highest security standards. We're further showcasing our face authentication as part of novel automotive solutions : The Driver Identification Display developed with Continental for driver authentication inside the cabin, and the Vehicle Access System developed with Antolin for a frictionless access and protection against theft. On the spectroscopy side, we're premiering exciting novelties around our latest breakthroughs in business and consumer solutions . Visit our booth to learn all about our next-generation handheld NIR spectrometer trinamiX PAL Two that will complement our successful Mobile NIR Spectroscopy Solutions . Giving an outlook into the future, our team will also demonstrate how we are taking the miniaturization of NIR spectroscopy a huge step further by seamlessly integrating the proven technology into smartphones and wearables. Arrange a meeting If you are interested in learning more about our technologies or are looking for ways to partner with us, please don't hesitate to arrange a meeting with our experts in Munich. Just share your contact details with us and let us know your availabilities and field of interest in the description field, and we will reach out to you shortly. Visit trinamiX at LASER World of PHOTONICS 2023 As in previous years, we'll be packing our demo kits and return to Munich for LASER World of PHOTONICS - the world's leading platform for the laser and photonics industry. From June 27 to 30 , our team will present exciting innovations that we are driving in the fields of biometrics and spectroscopy. In of biometrics, visitors of our booth 520 in hall A3 will experience trinamiX Face Authentication – running on an Android-based smartphone reference design and mounted invisibly behind its display. The solution introduces a new gold standard for biometric authentication by not only erasing the need for a notch or punchhole but also fulfilling the industry's highest security standards. We're further showcasing our face authentication as part of novel automotive solutions : The Driver Identification Display developed with Continental for driver authentication inside the cabin, and the Vehicle Access System developed with Antolin for a frictionless access and protection against theft. On the spectroscopy side, we're premiering exciting novelties around our latest breakthroughs in business and consumer solutions . Visit our booth to learn all about our next-generation handheld NIR spectrometer trinamiX PAL Two that will complement our successful Mobile NIR Spectroscopy Solutions . Giving an outlook into the future, our team will also demonstrate how we are taking the miniaturization of NIR spectroscopy a huge step further by seamlessly integrating the proven technology into smartphones and wearables. If you are interested in learning more about our technologies or are looking for ways to partner with us, please don't hesitate to arrange a meeting with our experts in Munich. Just share your contact details with us and let us know your availabilities and field of interest in the description field, and we will reach out to you shortly.",
    "Getting your trinamiX PAL One ready in 5 steps! Step 1: Activate your license You will receive a personal invitation email from our support team. Claim your license by simply clicking on the \"Activate\" button in the email. You will then be redirected to the Customer Portal where you will be asked to set up your account. How to and activate license Step 2: Open the app and connect the spectrometer Download the Spectroscopy App and with the credentials you used during sign-up in the Customer Portal. Switch on the spectrometer. Open the app and navigate to the spectrometer settings. Tap the refresh button to search for available spectrometers and select yours from the list to connect. For more detailed information and respective download links . Step 3: Calibrate the spectrometer To ensure optimum results you need to calibrate your spectrometer. Click the button \"Calibrate\" in the spectrometer settings and follow the guided two-step process in the app. Tutorial: How to calibrate the trinamiX PAL One Step 4: Perform a measurement After successfully calibrating your spectrometer, you can start with your first measurement. Select the application according to your sample type and enter a sample ID. To ensure accurate measurements, please refer to the measurement instructions. You can find them by selecting your application and clicking the information button. Learn how to measure feed , plastic and textile samples. Step 5: Analyse the measurement data In the Customer Portal you can manage your measurements, create reports and export your data to share with others. Access your measurement history Download measurement results in the desired format Visualize the spectral information Technical Infos trinamiX PAL One is a portable NIR spectrometer designed for on-site material analysis, such as identifying plastic types or analyzing nutrient content in feed. Design and ergonomics: Compact, easy-to-use, with a centrally positioned button for enhanced comfort and control. Durability: IP65-rated, dust and water-resistant for use in harsh environments. Measurement principle: Uses near-infrared (NIR) light reflection to analyze molecular composition. Data is sent via Bluetooth to a smartphone app for real-time results. Calibration: Includes an integrated reference standard for accurate measurements, protected by a snap-on cover. Spare Parts The spectrometer includes two on-site replaceable spare parts: the reference standard and the lamp module. To purchase a spare part, please contact your sales representative or reach out to our customer service team. customerservice@trinamix.de To learn how to replace spare parts yourself, please refer to the instructions below or download the corresponding manuals. The reference standard is a crucial part and should be replaced if it becomes dirty or if it is damaged. You can order a new reference standard via our support team . The lamp has a lifetime of up to 250,000 scans. 1. Open the spectrometer Ensure the device is turned off. Hold the spectrometer body in one hand with the specimen interface facing you. With your other hand, rotate the spectrometer head (1) counterclockwise until it is fully opened (2). 2. Replace the lamp module Carefully loosen the existing lamp module by lifting it up (the module is only connected via a 2-pole header connector) (1). Take the new lamp module from the packaging and attach it in the same direction as the old module (2). 3. Inspect spectrometer and O-ring Before closing the spectrometer, inspect the lamp module and optical filter to ensure they are free from dust, dirt, fingerprints, and other contaminants. Additionally, check the O-ring in the head for any damage, abrasion, brittleness, or improper fit that could compromise the seal. Replace the O-ring if needed. FAQs Yes, the trinamiX Guide App lets you adjust the calibration frequency during operation. To manage your spectrometer settings, go to the settings menu. However, reducing this frequency may affect the accuracy of your results. We recommend to calibrate your spectrometer every hour. You can measure when being offline, but the results are calculated in the cloud, so you need to get internet connection to see the measurement results. The scan window is made of sapphire and thus quite scratch resistant with Moh's1 hardness of 9. For comparison: a diamond has a Moh hardness of 10, steel of 4.5. Yes, PAL One complies with the product class IP65 and are therefore classified as protected against dust and water jets. Please note: the USB charger of PAL One is designed for indoor use only (dry location). Connection LED Blinking green = connected (wireless) Constant green = connected (USB) Blinking red = not connected Scan LED Blinking green = Spectrometer ready to scan Constant red = Spectrometer not ready to scan (e.g. calibration required) Battery LED Constant green = Battery level high Blinking green = Charge battery soon / Charging Blinking red = Battery too low / Charger not compatible Downloads Access essential documents to support your trinamiX spectroscopy experience. Getting your trinamiX PAL One ready in 5 steps! Step 1: Activate your license You will receive a personal invitation email from our support team. Claim your license by simply clicking on the \"Activate\" button in the email. You will then be redirected to the Customer Portal where you will be asked to set up your account. How to and activate license Step 2: Open the app and connect the spectrometer Download the Spectroscopy App and with the credentials you used during sign-up in the Customer Portal. Switch on the spectrometer. Open the app and navigate to the spectrometer settings. Tap the refresh button to search for available spectrometers and select yours from the list to connect. For more detailed information and respective download links . Step 3: Calibrate the spectrometer To ensure optimum results you need to calibrate your spectrometer. Click the button \"Calibrate\" in the spectrometer settings and follow the guided two-step process in the app. Tutorial: How to calibrate the trinamiX PAL One Step 4: Perform a measurement After successfully calibrating your spectrometer, you can start with your first measurement. Select the application according to your sample type and enter a sample ID. To ensure accurate measurements, please refer to the measurement instructions. You can find them by selecting your application and clicking the information button. Learn how to measure feed , plastic and textile samples. Step 5: Analyse the measurement data In the Customer Portal you can manage your measurements, create reports and export your data to share with others. Access your measurement history Download measurement results in the desired format Visualize the spectral information trinamiX PAL One is a portable NIR spectrometer designed for on-site material analysis, such as identifying plastic types or analyzing nutrient content in feed. Design and ergonomics: Compact, easy-to-use, with a centrally positioned button for enhanced comfort and control. Durability: IP65-rated, dust and water-resistant for use in harsh environments. Measurement principle: Uses near-infrared (NIR) light reflection to analyze molecular composition. Data is sent via Bluetooth to a smartphone app for real-time results. Calibration: Includes an integrated reference standard for accurate measurements, protected by a snap-on cover. The spectrometer includes two on-site replaceable spare parts: the reference standard and the lamp module. To purchase a spare part, please contact your sales representative or reach out to our customer service team. customerservice@trinamix.de To learn how to replace spare parts yourself, please refer to the instructions below or download the corresponding manuals. The reference standard is a crucial part and should be replaced if it becomes dirty or if it is damaged. You can order a new reference standard via our support team . The lamp has a lifetime of up to 250,000 scans. 1. Open the spectrometer Ensure the device is turned off. Hold the spectrometer body in one hand with the specimen interface facing you. With your other hand, rotate the spectrometer head (1) counterclockwise until it is fully opened (2). 2. Replace the lamp module Carefully loosen the existing lamp module by lifting it up (the module is only connected via a 2-pole header connector) (1). Take the new lamp module from the packaging and attach it in the same direction as the old module (2). 3. Inspect spectrometer and O-ring Before closing the spectrometer, inspect the lamp module and optical filter to ensure they are free from dust, dirt, fingerprints, and other contaminants. Additionally, check the O-ring in the head for any damage, abrasion, brittleness, or improper fit that could compromise the seal. Replace the O-ring if needed. Yes, the trinamiX Guide App lets you adjust the calibration frequency during operation. To manage your spectrometer settings, go to the settings menu. However, reducing this frequency may affect the accuracy of your results. We recommend to calibrate your spectrometer every hour. You can measure when being offline, but the results are calculated in the cloud, so you need to get internet connection to see the measurement results. The scan window is made of sapphire and thus quite scratch resistant with Moh's1 hardness of 9. For comparison: a diamond has a Moh hardness of 10, steel of 4.5. Yes, PAL One complies with the product class IP65 and are therefore classified as protected against dust and water jets. Please note: the USB charger of PAL One is designed for indoor use only (dry location). Spectrometer ready to scan Spectrometer not ready to scan (e.g. calibration required) Charge battery soon / Charging Battery too low / Charger not compatible Access essential documents to support your trinamiX spectroscopy experience.",
    "trinamiX in the News Media coverage 14. April 2025 – Automotive Industries Will Cars Function Like Smartwatches in the Future? A display featuring integrated vital signs measurement will be showcased at Auto Shanghai. The ongoing integration of smart technology is transforming vehicle interiors into personalized spaces. Read this article on www.ai-online.com 23. January 2025 Biometric Update trinamiX partners on ultra-compact 3D biometric face authentication module TrinamiX and meta-optics designer and manufacturer NIL Technology (NILT) have announced a collaboration to bring biometric facial authentication and 3D depth-mapping to the mass market in an ultra-compact form factor. Read this article on www.biometricupdate.com 20. January 2025 Autocar The invisible biometric tech making your next car safer Biometrics is the science of recognition using biological characteristics and this system goes further by detecting occupants using a camera and laser projector. The technology looks through a high-resolution OLED screen and is invisible to the naked eye. It was developed by Continental in conjunction with its partner, Trinamix. Read this article on www.autocar.co.uk 13. June 2024 Plastics Technology Mobile Spectroscopy System Expands to Identification of Multimaterial and Monomaterial Films BASF's wholly-owned subsidiary trinamiX, a leading provider of mobile NIR (near infrared) spectroscopy has expanded its handheld technology with a new application specifically designed to identify multimaterial and monomaterial films. Such mobile analytics and accessible identification technology can help to ensure highest quality in production and recycling. Read this article on www.ptonline.com 18. May 2024 Notebookcheck Display Week 2024 | Trinamix und TCL CSOT zeigen NIR-Gesichtserkennung unter faltbarem OLED-Display Die Ludwigshafener BASF-Ausgründung Trinamix zeigte auf der Display Week zusammen mit TCL CSOT seine Lösung für eine Gesichtserkennung unter einem Display, die mit NIR-Lasern arbeitet. Read this article on www.notebookcheck.com 15. May 2024 LEDinside trinamiX presents secure Face Authentication firstly integrated behind a foldable screen for smartphones at International Display Week The featured OLED display meets the growing demand for secure Face Authentication in foldable smartphones. The unique patented technology of trinamiX securely verifies a user's identity by differentiating between human skin and other materials for reliable liveness detection. The result is an immersive visual experience. Read this article on www.ledinside.com 29. April 2024 Plastics Insights Plastic and Textile Identification with Trinamix Trinamix, a provider of mobile spectroscopy solutions and subsidiary of BASF, will showcase its versatile plastics and textile identification technology at NPE 2024. From designing plastics packaging that is sortable, to quality control for in- and outgoing plastics, to cleaner sorting for improved recycling; mobile identification of plastic and textile types adds benefits across the supply chain. Read this article on en.kunststoffe.de 16. April 2024 Feed & Additive Intraco and trinamiX collaborate for mobile feed analysis Premixes and concentrates supplier Intraco has collaborated with spectroscopy solutions provider trinamiX to include a mobile NIR spectroscopy solution for feed analysis in its portfolio. Read this article on www.feedandadditive.com 11. March 2024 BBC One Morning Live Do you REALLY know what's in your spices? Jaega Wise investigates food fraudsters bulking out spices with cheap ingredients. Watch this clip on www.bbc.co.uk 22. February 2024 Cosmetics Design Europe Democratising dermatology: new consumer spectroscopy launch for more personalisation At the Mobile World Congress in Barcelona from 26th – 29th February, biometric solutions provider trinamiX will be unvealing a new consumer spectroscopy for mobile devices that could impact the cosmetics industry and offer new levels of personalisation. Read the article on www.cosmeticsdesign-europe.com 17. January 2024 WIRED TrinamiX's PAL One Helps Expand Recycling to New Frontiers Handheld spectrometer technology identifies the plastic content of objects, helping to simplify the recycling process. Read the article on www.wired.com 28. November 2023 MedCity News Why Consumers Should Care About Biomarkers — And How Technology Developers and Manufacturers Can Bridge the Gap More precise and consumer-friendly biomarker detection technologies are coming to market at a pace that can help users gain rich insight into their health and well-being from anywhere and at any time. This is especially important when it comes to preventive healthcare. Read the article on www.medcitynews.com 29. June 2023 le journal de montréal La technologie au secours de la technologie pour contrer les vols de voitures Au moins deux solutions sont actuellement en développement utilisant des technologies de pointe pour contrer le vol de véhicules. Read the article on www.journaldemontreal.com 29. June 2023 What Car? AI predicts the car of the future Artificial intelligence has predicted what the car of 2035 will be like – but how close is it to reality? Read the article on www.whatcar.com 28. June 2023 Global Times With a focus on innovation and cooperation, MWC 2023 kicks off in Shanghai The Mobile World Congress (MWC) Shanghai kicked off at the Shanghai New International Expo Centre (SNIEC) on Wednesday, bringing together global leaders from the mobile ecosystem. Read the article on www.globaltimes.cn 09. March 2023 OnQ Blog Spoof-proof phones: Virtually un-hackable face authentication is here trinamiX is working with Qualcomm to unlock the world's highest biometric smartphone security behind OLED display for use with Snapdragon platforms. Read the article on www.qualcomm.com trinamiX in the News 14. April 2025 – Automotive Industries Will Cars Function Like Smartwatches in the Future? A display featuring integrated vital signs measurement will be showcased at Auto Shanghai. The ongoing integration of smart technology is transforming vehicle interiors into personalized spaces. Read this article on www.ai-online.com 23. January 2025 Biometric Update trinamiX partners on ultra-compact 3D biometric face authentication module TrinamiX and meta-optics designer and manufacturer NIL Technology (NILT) have announced a collaboration to bring biometric facial authentication and 3D depth-mapping to the mass market in an ultra-compact form factor. Read this article on www.biometricupdate.com 20. January 2025 Autocar The invisible biometric tech making your next car safer Biometrics is the science of recognition using biological characteristics and this system goes further by detecting occupants using a camera and laser projector. The technology looks through a high-resolution OLED screen and is invisible to the naked eye. It was developed by Continental in conjunction with its partner, Trinamix. Read this article on www.autocar.co.uk 13. June 2024 Plastics Technology Mobile Spectroscopy System Expands to Identification of Multimaterial and Monomaterial Films BASF's wholly-owned subsidiary trinamiX, a leading provider of mobile NIR (near infrared) spectroscopy has expanded its handheld technology with a new application specifically designed to identify multimaterial and monomaterial films. Such mobile analytics and accessible identification technology can help to ensure highest quality in production and recycling. Read this article on www.ptonline.com 18. May 2024 Notebookcheck Display Week 2024 | Trinamix und TCL CSOT zeigen NIR-Gesichtserkennung unter faltbarem OLED-Display Die Ludwigshafener BASF-Ausgründung Trinamix zeigte auf der Display Week zusammen mit TCL CSOT seine Lösung für eine Gesichtserkennung unter einem Display, die mit NIR-Lasern arbeitet. Read this article on www.notebookcheck.com 15. May 2024 LEDinside trinamiX presents secure Face Authentication firstly integrated behind a foldable screen for smartphones at International Display Week The featured OLED display meets the growing demand for secure Face Authentication in foldable smartphones. The unique patented technology of trinamiX securely verifies a user's identity by differentiating between human skin and other materials for reliable liveness detection. The result is an immersive visual experience. Read this article on www.ledinside.com 29. April 2024 Plastics Insights Plastic and Textile Identification with Trinamix Trinamix, a provider of mobile spectroscopy solutions and subsidiary of BASF, will showcase its versatile plastics and textile identification technology at NPE 2024. From designing plastics packaging that is sortable, to quality control for in- and outgoing plastics, to cleaner sorting for improved recycling; mobile identification of plastic and textile types adds benefits across the supply chain. Read this article on en.kunststoffe.de 16. April 2024 Feed & Additive Intraco and trinamiX collaborate for mobile feed analysis Premixes and concentrates supplier Intraco has collaborated with spectroscopy solutions provider trinamiX to include a mobile NIR spectroscopy solution for feed analysis in its portfolio. Read this article on www.feedandadditive.com 11. March 2024 BBC One Morning Live Do you REALLY know what's in your spices? Jaega Wise investigates food fraudsters bulking out spices with cheap ingredients. Watch this clip on www.bbc.co.uk 22. February 2024 Cosmetics Design Europe Democratising dermatology: new consumer spectroscopy launch for more personalisation At the Mobile World Congress in Barcelona from 26th – 29th February, biometric solutions provider trinamiX will be unvealing a new consumer spectroscopy for mobile devices that could impact the cosmetics industry and offer new levels of personalisation. Read the article on www.cosmeticsdesign-europe.com 17. January 2024 WIRED TrinamiX's PAL One Helps Expand Recycling to New Frontiers Handheld spectrometer technology identifies the plastic content of objects, helping to simplify the recycling process. Read the article on www.wired.com 28. November 2023 MedCity News Why Consumers Should Care About Biomarkers — And How Technology Developers and Manufacturers Can Bridge the Gap More precise and consumer-friendly biomarker detection technologies are coming to market at a pace that can help users gain rich insight into their health and well-being from anywhere and at any time. This is especially important when it comes to preventive healthcare. Read the article on www.medcitynews.com 29. June 2023 le journal de montréal La technologie au secours de la technologie pour contrer les vols de voitures Au moins deux solutions sont actuellement en développement utilisant des technologies de pointe pour contrer le vol de véhicules. Read the article on www.journaldemontreal.com 29. June 2023 What Car? AI predicts the car of the future Artificial intelligence has predicted what the car of 2035 will be like – but how close is it to reality? Read the article on www.whatcar.com 28. June 2023 Global Times With a focus on innovation and cooperation, MWC 2023 kicks off in Shanghai The Mobile World Congress (MWC) Shanghai kicked off at the Shanghai New International Expo Centre (SNIEC) on Wednesday, bringing together global leaders from the mobile ecosystem. Read the article on www.globaltimes.cn 09. March 2023 OnQ Blog Spoof-proof phones: Virtually un-hackable face authentication is here trinamiX is working with Qualcomm to unlock the world's highest biometric smartphone security behind OLED display for use with Snapdragon platforms. Read the article on www.qualcomm.com Â",
    "Experience enhanced functionality that empowers your data analysis on the go The trinamiX Guide App is a key component of our mobile NIR spectroscopy solution, alongside the Customer Portal. With your software license, you can immediately access your applications, allowing you to view your measurement results in real-time directly on your smartphone. Designed to be user-friendly, the app will guide you through each process, ensuring a smooth and efficient experience as you utilize the solution. Your companion for guided measurements, every step of the way Key features and advantages: User-Friendly : I ntuitive design that facilitates easy capture and analysis of spectral data. Real-Time Analysis : Enables quick decision-making through real-time spectrum analysis. Data Visualization : Engaging graphics and charts that simplify the understanding and interpretation. Mobile Flexibility : A mobile app that allows users to capture and analyze spectral data on-the-go. Our Mobile NIR Spectroscopy Solution Includes FAQs The trinamiX Guide App is available for download from the appropriate app stores for Android and iOS platforms. Please note that you will receive your access via email shortly after purchasing your Mobile NIR Spectroscopy Solution. Access to the trinamiX Guide App after downloading it from the App Store or Google Play Store requires an active license. If you do not have a license through purchasing the solution, you will not be able to access the trinamiX Guide App. Please ensure you have the necessary licensing to fully utilize the App. For more information on the functionalities and key features of the trinamiX Guide App, please visit our website's dedicated support section . You can also contact our support team for any specific inquiries. Explore a selection of our valued users Own Applications & Connecting to your Software In addition to ready-to-use applications, we provide the option to develop custom solutions. For example, by developing your own applications or with our OpenAPI, that seamlessly integrates your software with our mobile solution. This additional service enables the measured parameters to be efficiently processed in e.g ration formulation software and quality control systems. about your options . Downloads Experience enhanced functionality that empowers your data analysis on the go The trinamiX Guide App is a key component of our mobile NIR spectroscopy solution, alongside the Customer Portal. With your software license, you can immediately access your applications, allowing you to view your measurement results in real-time directly on your smartphone. Designed to be user-friendly, the app will guide you through each process, ensuring a smooth and efficient experience as you utilize the solution. Your companion for guided measurements, every step of the way Key features and advantages: User-Friendly : I ntuitive design that facilitates easy capture and analysis of spectral data. Real-Time Analysis : Enables quick decision-making through real-time spectrum analysis. Data Visualization : Engaging graphics and charts that simplify the understanding and interpretation. Mobile Flexibility : A mobile app that allows users to capture and analyze spectral data on-the-go. Our Mobile NIR Spectroscopy Solution Includes The trinamiX Guide App is available for download from the appropriate app stores for Android and iOS platforms. Please note that you will receive your access via email shortly after purchasing your Mobile NIR Spectroscopy Solution. Access to the trinamiX Guide App after downloading it from the App Store or Google Play Store requires an active license. If you do not have a license through purchasing the solution, you will not be able to access the trinamiX Guide App. Please ensure you have the necessary licensing to fully utilize the App. For more information on the functionalities and key features of the trinamiX Guide App, please visit our website's dedicated support section . You can also contact our support team for any specific inquiries. Explore a selection of our valued users Own Applications & Connecting to your Software In addition to ready-to-use applications, we provide the option to develop custom solutions. For example, by developing your own applications or with our OpenAPI, that seamlessly integrates your software with our mobile solution. This additional service enables the measured parameters to be efficiently processed in e.g ration formulation software and quality control systems. about your options .",
    "trinamiX joins Qualcomm Software Accelerator Program Next-generation of facial recognition: trinamiX joins Qualcomm Software Accelerator Program February 25, 2020 trinamiX has joined the Qualcomm Software Accelerator Program to enable its patented technology for 'live skin' detection as the new goldstandard for facial recognition across mobile devices. Through this new collaboration with Qualcomm Technologies, OEM customers will now be able to use the trinamiX proprietary 'Beam Profile Analysis' technology, which extracts 3 data streams from a single camera system: a 2D IR image, a 3D depth map, and most uniquely – material classification. With this fundamentally new approach to security, it is now possible to combine standard facial-recognition algorithms from any 3rd party with the unique ability to sense 'live skin'. This eliminates the ability to fool the phone into unlocking via a mask, a high-resolution print, or even a 3D rendering of the rightful owner's facial features. Our patented technology enables an industry-leading, secure, and robust facial recognition solution for devices ranging from smartphones to laptops and up to securing access control systems. \"Qualcomm Technologies has always differentiated its product line through a unique blend of raw performance combined with industry-leading features demanded by the most innovative mobile device OEMs,†says Manvinder Singh, Vice President, Product Management, Qualcomm Technologies, Inc. \"We are very excited to be working with trinamiX and look forward to trinamiX getting this novel technology into the hands of customers at the earliest possible opportunity.†We are excited about this development and are looking forward to the next steps in collaboration with Qualcomm! If you are interested to get further information about our technology, get in direct contact with us via info@trinamix.de . Technical details on Beam Profile Analysis may also be found on our website . News release trinamiX has joined the Qualcomm Software Accelerator Program_US letter PDF, 0.2 MB Pressemitteilung Teilnahme am Qualcomm Software Accelerator Program PDF, 0.2 MB Other articles trinamiX launches Mobile Near Infrared Spectroscopy Solution: PbS and PbSe bare chip detectors on solderable PCBs Next-generation of facial recognition: trinamiX joins Qualcomm Software Accelerator Program trinamiX has joined the Qualcomm Software Accelerator Program to enable its patented technology for 'live skin' detection as the new goldstandard for facial recognition across mobile devices. Through this new collaboration with Qualcomm Technologies, OEM customers will now be able to use the trinamiX proprietary 'Beam Profile Analysis' technology, which extracts 3 data streams from a single camera system: a 2D IR image, a 3D depth map, and most uniquely – material classification. With this fundamentally new approach to security, it is now possible to combine standard facial-recognition algorithms from any 3rd party with the unique ability to sense 'live skin'. This eliminates the ability to fool the phone into unlocking via a mask, a high-resolution print, or even a 3D rendering of the rightful owner's facial features. Our patented technology enables an industry-leading, secure, and robust facial recognition solution for devices ranging from smartphones to laptops and up to securing access control systems. \"Qualcomm Technologies has always differentiated its product line through a unique blend of raw performance combined with industry-leading features demanded by the most innovative mobile device OEMs,†says Manvinder Singh, Vice President, Product Management, Qualcomm Technologies, Inc. \"We are very excited to be working with trinamiX and look forward to trinamiX getting this novel technology into the hands of customers at the earliest possible opportunity.†We are excited about this development and are looking forward to the next steps in collaboration with Qualcomm! If you are interested to get further information about our technology, get in direct contact with us via info@trinamix.de . Technical details on Beam Profile Analysis may also be found on our website . trinamiX launches Mobile Near Infrared Spectroscopy Solution: PbS and PbSe bare chip detectors on solderable PCBs"
  ]
}