{
  "company": "trucrowd.tech",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 26,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.6548672566371682,
    "framing_surveillance": 0.0331858407079646,
    "framing_market": 0.3119469026548672,
    "num_docs": 27
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 26
    }
  },
  "sample_docs": [
    "January 26, 2025 Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping Face biometrics in sports often come with misconceptions that lead to unnecessary concerns and hesitation. Here's what you need to know to make an educated decision. Read More Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping December 22, 2024 Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter Stadium bans sound serious but fail to solve any problem. Fake fan data, borrowed tickets, and offenders slipping through the security checks keep causing trouble. It is a vicious cycle with seemingly no end. But, here is how you can make stadium bans work while increasing attendance and growing matchday revenue. Read More Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter November 23, 2024 Ticket Subscriptions Beat Dynamic Pricing in Football Clubs are raising ticket prices to boost matchday revenue, but this approach ignores the needs of local fan groups. Could ticket subscriptions offer a better solution — boosting sales while providing added benefits? Read More Ticket Subscriptions Beat Dynamic Pricing in Football October 21, 2024 Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? The increasing number of football matches in recent years, driven by new competition formats, has sparked considerable debate within the football community. While various stakeholders point fingers at one another, we examine the impact of this trend on the business side of clubs. We uncover unexpected connections with merchandise revenue, which could offer a rescue hand to tackling high player salaries. Read More Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? September 17, 2024 Impact of Stadium Security on the Bottom Line The matchday organization team faces huge pressure every weekend. A small mistake could cost the club 5.8% of their season's matchday revenue, with most losses coming indirectly. Many believe it's a choice between security and fan convenience, but what if it wasn't? Read More Impact of Stadium Security on the Bottom Line August 29, 2024 How fan data can help football clubs maximize matchday revenue Perfect attendance is very rare. Data from the German Bundesliga and Bundesliga 2 reveals a significant number of no-shows at games. Season ticket holders skip about 10-12% of their games on average compared to one-time visitors, who miss their games 5-7% of the time. You might think this isn't a big problem since the clubs have already been paid for those empty seats. But what if it was? Read More How fan data can help football clubs maximize matchday revenue July 25, 2024 \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. Read More \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit June 16, 2024 Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences The integration of new stadium technologies has revolutionized the fan experience in sports venues. Among these, biometrics stand out, offering a seamless and more personalized interaction from entry to exit. In this blog post, we delve into the cutting-edge application of facial biometrics, exploring its multifaceted benefits ranging from touchless entry and enhanced security to personalized fan experiences and efficient crowd management. Read More Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences May 22, 2024 Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling Ticket reselling has been a pressing issue for decades as fans pay on average 203% more for tickets found on secondary ticketing platforms. This causes 25% in ticket sales losses for event organizers globally. Here is the solution. Read More Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling May 1, 2024 Stadium Technologies: A Balance Between Innovation And Fan Comfort The journey towards embracing advanced stadium technologies is not just about installing new systems but about bringing fans along on this journey. Through education, engagement, and continuous improvement, sports clubs can successfully lead their fans toward a more secure, efficient, and enjoyable stadium experience. By adopting innovations like the one of TruCrowd, clubs can set a precedent in the sporting world, offering fans not just a game but an experience they'll cherish. Read More Stadium Technologies: A Balance Between Innovation And Fan Comfort January 26, 2025 Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping Face biometrics in sports often come with misconceptions that lead to unnecessary concerns and hesitation. Here's what you need to know to make an educated decision. Read More Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping December 22, 2024 Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter Stadium bans sound serious but fail to solve any problem. Fake fan data, borrowed tickets, and offenders slipping through the security checks keep causing trouble. It is a vicious cycle with seemingly no end. But, here is how you can make stadium bans work while increasing attendance and growing matchday revenue. Read More Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter November 23, 2024 Ticket Subscriptions Beat Dynamic Pricing in Football Clubs are raising ticket prices to boost matchday revenue, but this approach ignores the needs of local fan groups. Could ticket subscriptions offer a better solution — boosting sales while providing added benefits? Read More Ticket Subscriptions Beat Dynamic Pricing in Football October 21, 2024 Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? The increasing number of football matches in recent years, driven by new competition formats, has sparked considerable debate within the football community. While various stakeholders point fingers at one another, we examine the impact of this trend on the business side of clubs. We uncover unexpected connections with merchandise revenue, which could offer a rescue hand to tackling high player salaries. Read More Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? September 17, 2024 Impact of Stadium Security on the Bottom Line The matchday organization team faces huge pressure every weekend. A small mistake could cost the club 5.8% of their season's matchday revenue, with most losses coming indirectly. Many believe it's a choice between security and fan convenience, but what if it wasn't? Read More Impact of Stadium Security on the Bottom Line August 29, 2024 How fan data can help football clubs maximize matchday revenue Perfect attendance is very rare. Data from the German Bundesliga and Bundesliga 2 reveals a significant number of no-shows at games. Season ticket holders skip about 10-12% of their games on average compared to one-time visitors, who miss their games 5-7% of the time. You might think this isn't a big problem since the clubs have already been paid for those empty seats. But what if it was? Read More How fan data can help football clubs maximize matchday revenue July 25, 2024 \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. Read More \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit June 16, 2024 Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences The integration of new stadium technologies has revolutionized the fan experience in sports venues. Among these, biometrics stand out, offering a seamless and more personalized interaction from entry to exit. In this blog post, we delve into the cutting-edge application of facial biometrics, exploring its multifaceted benefits ranging from touchless entry and enhanced security to personalized fan experiences and efficient crowd management. Read More Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences May 22, 2024 Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling Ticket reselling has been a pressing issue for decades as fans pay on average 203% more for tickets found on secondary ticketing platforms. This causes 25% in ticket sales losses for event organizers globally. Here is the solution. Read More Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling May 1, 2024 Stadium Technologies: A Balance Between Innovation And Fan Comfort The journey towards embracing advanced stadium technologies is not just about installing new systems but about bringing fans along on this journey. Through education, engagement, and continuous improvement, sports clubs can successfully lead their fans toward a more secure, efficient, and enjoyable stadium experience. By adopting innovations like the one of TruCrowd, clubs can set a precedent in the sporting world, offering fans not just a game but an experience they'll cherish. Read More Stadium Technologies: A Balance Between Innovation And Fan Comfort January 26, 2025 Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping Face biometrics in sports often come with misconceptions that lead to unnecessary concerns and hesitation. Here's what you need to know to make an educated decision. Read More Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping December 22, 2024 Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter Stadium bans sound serious but fail to solve any problem. Fake fan data, borrowed tickets, and offenders slipping through the security checks keep causing trouble. It is a vicious cycle with seemingly no end. But, here is how you can make stadium bans work while increasing attendance and growing matchday revenue. Read More Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter November 23, 2024 Ticket Subscriptions Beat Dynamic Pricing in Football Clubs are raising ticket prices to boost matchday revenue, but this approach ignores the needs of local fan groups. Could ticket subscriptions offer a better solution — boosting sales while providing added benefits? Read More Ticket Subscriptions Beat Dynamic Pricing in Football Ticket Subscriptions Beat Dynamic Pricing in Football October 21, 2024 Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? The increasing number of football matches in recent years, driven by new competition formats, has sparked considerable debate within the football community. While various stakeholders point fingers at one another, we examine the impact of this trend on the business side of clubs. We uncover unexpected connections with merchandise revenue, which could offer a rescue hand to tackling high player salaries. Read More Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? Will the Increasing Number of Football Matches Require Clubs to Grow Their Merchandise Sales? September 17, 2024 Impact of Stadium Security on the Bottom Line The matchday organization team faces huge pressure every weekend. A small mistake could cost the club 5.8% of their season's matchday revenue, with most losses coming indirectly. Many believe it's a choice between security and fan convenience, but what if it wasn't? Read More Impact of Stadium Security on the Bottom Line Impact of Stadium Security on the Bottom Line August 29, 2024 How fan data can help football clubs maximize matchday revenue Perfect attendance is very rare. Data from the German Bundesliga and Bundesliga 2 reveals a significant number of no-shows at games. Season ticket holders skip about 10-12% of their games on average compared to one-time visitors, who miss their games 5-7% of the time. You might think this isn't a big problem since the clubs have already been paid for those empty seats. But what if it was? Read More How fan data can help football clubs maximize matchday revenue How fan data can help football clubs maximize matchday revenue July 25, 2024 \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. Read More \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit \"Let me see your face†– facial recognition at stadiums is really about security, easy access is just its visible benefit June 16, 2024 Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences The integration of new stadium technologies has revolutionized the fan experience in sports venues. Among these, biometrics stand out, offering a seamless and more personalized interaction from entry to exit. In this blog post, we delve into the cutting-edge application of facial biometrics, exploring its multifaceted benefits ranging from touchless entry and enhanced security to personalized fan experiences and efficient crowd management. Read More Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences Top Five Trends in Stadium Technologies: How Facial Biometrics Play a Crucial Role in Enhancing Fan Experiences May 22, 2024 Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling Ticket reselling has been a pressing issue for decades as fans pay on average 203% more for tickets found on secondary ticketing platforms. This causes 25% in ticket sales losses for event organizers globally. Here is the solution. Read More Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling Biometrics Offer an Effective Way to Address Losses Caused by Illegal Ticket Reselling May 1, 2024 Stadium Technologies: A Balance Between Innovation And Fan Comfort The journey towards embracing advanced stadium technologies is not just about installing new systems but about bringing fans along on this journey. Through education, engagement, and continuous improvement, sports clubs can successfully lead their fans toward a more secure, efficient, and enjoyable stadium experience. By adopting innovations like the one of TruCrowd, clubs can set a precedent in the sporting world, offering fans not just a game but an experience they'll cherish. Read More Stadium Technologies: A Balance Between Innovation And Fan Comfort Stadium Technologies: A Balance Between Innovation And Fan Comfort TruCrowd s.r.o. MaleÅ¡ická 28552b Žižkov, 130 00, Praha 3 Building the Future of Fan Experience with Face Ticket Technology",
    "Powering Existing Ticketing and Access Control with Face Biometrics Explore our Solution Facial recognition technology trusted by: Major football clubs in Brazil 20+ governments Banks Telcos What changes when you switch from token-based tickets to identity-based ticketing? Monetize the Ticket Resale Market Clubs currently lack control over secondary ticket sales, resulting in an estimated 20% revenue loss, increased fraud, and fan frustration. By tying tickets to identity, all transfers and resales can occur exclusively under your control. Solve Stadium Security Spectators often face hooligan aggression, leading to clubs losing fans from valuable demographics. Preventing hooligans from entering stadiums, makes the events safer and more family-friendly. 3x Faster Access Long waiting lines create discomfort and a risky environment, resulting in a poor fan experience. By verifying legal identity during purchase, fans can enjoy faster access and a smoother stadium experience. Personalized Fan Experience Clubs often lack data on the majority of their fans, hindering their ability to create memorable experiences for all visitors. By connecting every purchase to specific individuals, we enable individually crafted fan experiences. Secure & Quick Payments While cashless systems enhance revenue, they won't solve long queues. By securely verifying your fans' identities, other services such as face payments become instantly available. Bring true fans in Process Complete face ticket technology Face registration & KYC Identity engine Ticketless access control Certified Face Ticket Technology We are a spinoff from Innovatrics , one of the world's leading biometric vendors. Powering Existing Ticketing and Access Control with Face Biometrics Explore our Solution Facial recognition technology trusted by: Major football clubs in Brazil 20+ governments Banks Telcos What changes when you switch from token-based tickets to identity-based ticketing? Monetize the Ticket Resale Market Clubs currently lack control over secondary ticket sales, resulting in an estimated 20% revenue loss, increased fraud, and fan frustration. By tying tickets to identity, all transfers and resales can occur exclusively under your control. Solve Stadium Security Spectators often face hooligan aggression, leading to clubs losing fans from valuable demographics. Preventing hooligans from entering stadiums, makes the events safer and more family-friendly. 3x Faster Access Long waiting lines create discomfort and a risky environment, resulting in a poor fan experience. By verifying legal identity during purchase, fans can enjoy faster access and a smoother stadium experience. Personalized Fan Experience Clubs often lack data on the majority of their fans, hindering their ability to create memorable experiences for all visitors. By connecting every purchase to specific individuals, we enable individually crafted fan experiences. Secure & Quick Payments While cashless systems enhance revenue, they won't solve long queues. By securely verifying your fans' identities, other services such as face payments become instantly available. Bring true fans in Process Complete face ticket technology Face registration & KYC Identity engine Ticketless access control Certified Face Ticket Technology We are a spinoff from Innovatrics , one of the world's leading biometric vendors. Powering Existing Ticketing and Access Control with Face Biometrics Facial recognition technology trusted by: Major football clubs in Brazil What changes when you switch from token-based tickets to identity-based ticketing? Monetize the Ticket Resale Market Clubs currently lack control over secondary ticket sales, resulting in an estimated 20% revenue loss, increased fraud, and fan frustration. By tying tickets to identity, all transfers and resales can occur exclusively under your control. Spectators often face hooligan aggression, leading to clubs losing fans from valuable demographics. Preventing hooligans from entering stadiums, makes the events safer and more family-friendly. Long waiting lines create discomfort and a risky environment, resulting in a poor fan experience. By verifying legal identity during purchase, fans can enjoy faster access and a smoother stadium experience. Clubs often lack data on the majority of their fans, hindering their ability to create memorable experiences for all visitors. By connecting every purchase to specific individuals, we enable individually crafted fan experiences. Secure & Quick Payments While cashless systems enhance revenue, they won't solve long queues. By securely verifying your fans' identities, other services such as face payments become instantly available. Bring true fans in Complete face ticket technology Face registration & KYC Certified Face Ticket Technology TruCrowd s.r.o. MaleÅ¡ická 28552b Žižkov, 130 00, Praha 3 Building the Future of Fan Experience with Face Ticket Technology © TruCrowd 2025. Web by Wonder Blue.",
    "Ticket reselling, commonly known as ticket scalping , has long been a challenge faced by artists, sports clubs, venues, promoters, and most importantly, fans. This issue is prevalent at events where demand exceeds the available supply. Ticket Reselling Takes Various Forms and Scales Individual resellers often stand outside venues, attempting to sell physical tickets directly to attendees. Some resellers operate on online marketplaces, selling tickets to multiple buyers for the same seat, resulting in only the first purchaser gaining entry. Larger players like Viagogo, StubHub, Vivid Seats, and others engage in unethical practices. They acquire large quantities of tickets, which they then sell on their platforms at significant markups over face value. The most common practice is the use of ticket bots . They buy tickets in bulk and create artificial demand, causing events to sell out quickly. For example, during Taylor Swift's 2023 tour, 2 million tickets sold in a day out of 2.4 million available, with 3.5 billion transaction attempts . That means, roughly half of the world tried to buy a ticket which is total nonsense. Imperva's 2023 Bad Bot Report found that 83.4% of global entertainment website traffic in 2022 came from automation bots. These practices lead to revenue losses for primary ticket sellers. According to a recent report by the National Independent Talent Organization, fans pay an average of 203% more than face value when buying tickets from resellers on secondary sites. Primary Ticketing Vendors Leave Revenue on the Table In the most recent events, Scotland fans are facing prices of over €14,000 for tickets to the opening game of Euro 2024 against hosts Germany if they buy from unauthorized resellers. Price of these tickets was between 50-600€ based on the category. Meaning they are being resold at more than 23 times their face value in the best-case scenario. Overall, ticket reselling has several negative effects: Genuine fans are unable to attend the event. The audience in the stadium is often composed of \"white teeth†individuals as some in the industry refer to them rather than passionate supporters. The atmosphere at these events falls short of its potential which is the main reason artists and athletes perform. Event organizers, who take on significant risks, miss out on potential revenue opportunities due to ticket reselling practices. Resellers are a significant drag on ancillary revenues because they don't buy ticket insurance, don't buy merchandise, don't donate, don't book hospitality etc.. Countries Initiated Efforts to Combat Illegal Ticket Reselling In South Korea, the government recently implemented a law revision banning the use of macro tools to purchase tickets. Violators could face penalties of up to one year in prison or a €7,000 fine , as announced by the Ministry of Culture, Sports, and Tourism. In the UK, the industry had high hopes for government action regarding amendments related to secondary ticketing platforms. One proposed bill aimed to require platforms to verify ticket purchases from the primary market before allowing postings. However, the outcome was ultimately unfavorable , disappointing those anticipating stricter regulations. This raises a discussion whether the secondary ticket market is really only negative and needs to be eliminated. Let's look what benefits event organizers could lose It drives sales on primary markets because consumers anticipate price increases if they delay purchasing tickets closer to the event date. Fans benefit from the flexibility to resell their tickets if they are unable to attend an event. It can generate additional revenue for primary ticketing vendors as fans often purchase extra tickets with the intention of inviting friends to join them later Banning ticket resale by governments is ineffective and disrupts market dynamics. We believe the key is to establish and facilitate an effective white-label resale platform. All event organizers and promoters should operate both primary and secondary ticketing platforms. This approach allows them to maintain complete control over their ticketing revenues . Facial Biometric Ticketing Comes to the Rescue The most promising solution is implementing facial biometric ticketing, which addresses various perspectives effectively. With facial biometric ticketing , your ticket is directly linked to you—your face becomes your ticket. This technology prevents bots from making purchases. It offers added security by eliminating the risk of losing or having your ticket stolen. It also enhances convenience since you don't need to present a physical or digital ticket at the venue entry. Moreover, if you're unable to attend, you can easily access the official resale platform to list your ticket for sale. You'll receive payment once the buyer validates the ticket with their own face. The resale platform can operate as an auction with a traditional bidding system. It can allow buyers to set their own prices or imposing a cap on the sale price. This approach enables primary ticketing vendors to earn multiple times on the same ticket and retain full revenue, all while ensuring customer satisfaction and flexibility for fans. Ticket reselling is here to stay because it's a part of how people naturally behave. However, how organizations approach and manage this challenge will determine its success and the value it brings to content owners. Related Posts Why Biometric Payments at Stadiums Are a Hidden Opportunity for Cashless Providers May 31, 2025 Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer April 28, 2025 Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It April 18, 2025 Ticket reselling, commonly known as ticket scalping , has long been a challenge faced by artists, sports clubs, venues, promoters, and most importantly, fans. This issue is prevalent at events where demand exceeds the available supply. Ticket Reselling Takes Various Forms and Scales Individual resellers often stand outside venues, attempting to sell physical tickets directly to attendees. Some resellers operate on online marketplaces, selling tickets to multiple buyers for the same seat, resulting in only the first purchaser gaining entry. Larger players like Viagogo, StubHub, Vivid Seats, and others engage in unethical practices. They acquire large quantities of tickets, which they then sell on their platforms at significant markups over face value. The most common practice is the use of ticket bots . They buy tickets in bulk and create artificial demand, causing events to sell out quickly. For example, during Taylor Swift's 2023 tour, 2 million tickets sold in a day out of 2.4 million available, with 3.5 billion transaction attempts . That means, roughly half of the world tried to buy a ticket which is total nonsense. Imperva's 2023 Bad Bot Report found that 83.4% of global entertainment website traffic in 2022 came from automation bots. These practices lead to revenue losses for primary ticket sellers. According to a recent report by the National Independent Talent Organization, fans pay an average of 203% more than face value when buying tickets from resellers on secondary sites. Primary Ticketing Vendors Leave Revenue on the Table In the most recent events, Scotland fans are facing prices of over €14,000 for tickets to the opening game of Euro 2024 against hosts Germany if they buy from unauthorized resellers. Price of these tickets was between 50-600€ based on the category. Meaning they are being resold at more than 23 times their face value in the best-case scenario. Overall, ticket reselling has several negative effects: Genuine fans are unable to attend the event. The audience in the stadium is often composed of \"white teeth†individuals as some in the industry refer to them rather than passionate supporters. The atmosphere at these events falls short of its potential which is the main reason artists and athletes perform. Event organizers, who take on significant risks, miss out on potential revenue opportunities due to ticket reselling practices. Resellers are a significant drag on ancillary revenues because they don't buy ticket insurance, don't buy merchandise, don't donate, don't book hospitality etc.. Countries Initiated Efforts to Combat Illegal Ticket Reselling In South Korea, the government recently implemented a law revision banning the use of macro tools to purchase tickets. Violators could face penalties of up to one year in prison or a €7,000 fine , as announced by the Ministry of Culture, Sports, and Tourism. In the UK, the industry had high hopes for government action regarding amendments related to secondary ticketing platforms. One proposed bill aimed to require platforms to verify ticket purchases from the primary market before allowing postings. However, the outcome was ultimately unfavorable , disappointing those anticipating stricter regulations. This raises a discussion whether the secondary ticket market is really only negative and needs to be eliminated. Let's look what benefits event organizers could lose It drives sales on primary markets because consumers anticipate price increases if they delay purchasing tickets closer to the event date. Fans benefit from the flexibility to resell their tickets if they are unable to attend an event. It can generate additional revenue for primary ticketing vendors as fans often purchase extra tickets with the intention of inviting friends to join them later Banning ticket resale by governments is ineffective and disrupts market dynamics. We believe the key is to establish and facilitate an effective white-label resale platform. All event organizers and promoters should operate both primary and secondary ticketing platforms. This approach allows them to maintain complete control over their ticketing revenues . Facial Biometric Ticketing Comes to the Rescue The most promising solution is implementing facial biometric ticketing, which addresses various perspectives effectively. With facial biometric ticketing , your ticket is directly linked to you—your face becomes your ticket. This technology prevents bots from making purchases. It offers added security by eliminating the risk of losing or having your ticket stolen. It also enhances convenience since you don't need to present a physical or digital ticket at the venue entry. Moreover, if you're unable to attend, you can easily access the official resale platform to list your ticket for sale. You'll receive payment once the buyer validates the ticket with their own face. The resale platform can operate as an auction with a traditional bidding system. It can allow buyers to set their own prices or imposing a cap on the sale price. This approach enables primary ticketing vendors to earn multiple times on the same ticket and retain full revenue, all while ensuring customer satisfaction and flexibility for fans. Ticket reselling is here to stay because it's a part of how people naturally behave. However, how organizations approach and manage this challenge will determine its success and the value it brings to content owners. Ticket reselling, commonly known as ticket scalping , has long been a challenge faced by artists, sports clubs, venues, promoters, and most importantly, fans. This issue is prevalent at events where demand exceeds the available supply. Ticket Reselling Takes Various Forms and Scales Individual resellers often stand outside venues, attempting to sell physical tickets directly to attendees. Some resellers operate on online marketplaces, selling tickets to multiple buyers for the same seat, resulting in only the first purchaser gaining entry. Larger players like Viagogo, StubHub, Vivid Seats, and others engage in unethical practices. They acquire large quantities of tickets, which they then sell on their platforms at significant markups over face value. The most common practice is the use of ticket bots . They buy tickets in bulk and create artificial demand, causing events to sell out quickly. For example, during Taylor Swift's 2023 tour, 2 million tickets sold in a day out of 2.4 million available, with 3.5 billion transaction attempts . That means, roughly half of the world tried to buy a ticket which is total nonsense. Imperva's 2023 Bad Bot Report found that 83.4% of global entertainment website traffic in 2022 came from automation bots. These practices lead to revenue losses for primary ticket sellers. According to a recent report by the National Independent Talent Organization, fans pay an average of 203% more than face value when buying tickets from resellers on secondary sites. Primary Ticketing Vendors Leave Revenue on the Table In the most recent events, Scotland fans are facing prices of over €14,000 for tickets to the opening game of Euro 2024 against hosts Germany if they buy from unauthorized resellers. Price of these tickets was between 50-600€ based on the category. Meaning they are being resold at more than 23 times their face value in the best-case scenario. Overall, ticket reselling has several negative effects: Genuine fans are unable to attend the event. The audience in the stadium is often composed of \"white teeth†individuals as some in the industry refer to them rather than passionate supporters. The atmosphere at these events falls short of its potential which is the main reason artists and athletes perform. Event organizers, who take on significant risks, miss out on potential revenue opportunities due to ticket reselling practices. Resellers are a significant drag on ancillary revenues because they don't buy ticket insurance, don't buy merchandise, don't donate, don't book hospitality etc.. Countries Initiated Efforts to Combat Illegal Ticket Reselling In South Korea, the government recently implemented a law revision banning the use of macro tools to purchase tickets. Violators could face penalties of up to one year in prison or a €7,000 fine , as announced by the Ministry of Culture, Sports, and Tourism. In the UK, the industry had high hopes for government action regarding amendments related to secondary ticketing platforms. One proposed bill aimed to require platforms to verify ticket purchases from the primary market before allowing postings. However, the outcome was ultimately unfavorable , disappointing those anticipating stricter regulations. This raises a discussion whether the secondary ticket market is really only negative and needs to be eliminated. Let's look what benefits event organizers could lose It drives sales on primary markets because consumers anticipate price increases if they delay purchasing tickets closer to the event date. Fans benefit from the flexibility to resell their tickets if they are unable to attend an event. It can generate additional revenue for primary ticketing vendors as fans often purchase extra tickets with the intention of inviting friends to join them later Banning ticket resale by governments is ineffective and disrupts market dynamics. We believe the key is to establish and facilitate an effective white-label resale platform. All event organizers and promoters should operate both primary and secondary ticketing platforms. This approach allows them to maintain complete control over their ticketing revenues . Facial Biometric Ticketing Comes to the Rescue The most promising solution is implementing facial biometric ticketing, which addresses various perspectives effectively. With facial biometric ticketing , your ticket is directly linked to you—your face becomes your ticket. This technology prevents bots from making purchases. It offers added security by eliminating the risk of losing or having your ticket stolen. It also enhances convenience since you don't need to present a physical or digital ticket at the venue entry. Moreover, if you're unable to attend, you can easily access the official resale platform to list your ticket for sale. You'll receive payment once the buyer validates the ticket with their own face. The resale platform can operate as an auction with a traditional bidding system. It can allow buyers to set their own prices or imposing a cap on the sale price. This approach enables primary ticketing vendors to earn multiple times on the same ticket and retain full revenue, all while ensuring customer satisfaction and flexibility for fans. Ticket reselling is here to stay because it's a part of how people naturally behave. However, how organizations approach and manage this challenge will determine its success and the value it brings to content owners. Why Biometric Payments at Stadiums Are a Hidden Opportunity for Cashless Providers May 31, 2025 Why Biometric Payments at Stadiums Are a Hidden Opportunity for Cashless Providers Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer April 28, 2025 Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It April 18, 2025 Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It TruCrowd s.r.o. MaleÅ¡ická 28552b Žižkov, 130 00, Praha 3 Building the Future of Fan Experience with Face Ticket Technology © TruCrowd 2025. Web by Wonder Blue.",
    "Let's be honest. Being a smaller football club can feel like a tough match, both on and off the pitch. Budgets are tight and trying something new can be scary. But here's the thing. While the big clubs chase global fame, smaller clubs still have something powerful: a strong community. Take the 2. Bundesliga, Germany's second division, for example. On average, their stadiums attract more fans than France's first division. How? The answer lies in a football culture built around community and tradition. People return week after week because they feel part of something bigger than themselves. However, times are changing. That loyal fanbase is aging. If younger generations do not feel connected now, who will fill your stands in ten years? Empty seats mean missed revenue and lost atmosphere. Fan engagement is the key to tackling these challenges. It helps you keep loyal supporters close, attract younger fans, and make every matchday feel like part of something bigger. In the next sections, we will show how other clubs are doing this successfully and how smaller clubs can make it their biggest strength. An aging fanbase clubs can't ignore One of the biggest challenges for football clubs today is an aging fanbase. Yet, many clubs are not paying attention to it. The stands still fill up and on the surface, everything seems fine. But under that surface, the problem grows. If younger generations do not connect with your club now, who will come to your stadium in 10 years? The numbers speak for themselves. In the UK, only 30% of people aged 18 to 34 feel passionate about football. Besides, even more than a third don't really care that much about football. It is not that young fans don't like sports at all; they just consume sports differently. They want quick highlights, behind-the-scenes content, and interaction beyond just watching a match. According to PwC , Gen Z fans are far more likely to follow football through social media and digital platforms rather than rooting in the stands. This is where technology comes in. Younger fans expect seamless, hassle-free experiences. They don't want to fumble with paper tickets or even QR codes. Biometric ticketing fits naturally into their digital mindset, allowing them to enter the stadium effortlessly, just like they unlock their phones. An important factor for the younger generation is to make everything go faster. With a biometric solution, fans can enter the stadium up to 3x faster. Still, many clubs remain conservative. They like to stick to old habits, afraid to change what once worked well. That hesitation is dangerous, as younger generations expect more. They want entertainment and a reason to feel part of something. For smaller clubs, this challenge becomes even bigger. Unlike top clubs, they cannot rely on occasional fans or tourists. However, this also means they have the chance to build something stronger. As a smaller club, a close connection with the local community is the biggest strength. With the right fan engagement strategies, they can make younger fans feel part of the club's story and turn them into loyal supporters for years to come. When mindset beats money It is possible to do things differently. Some clubs have shown that you don't need the biggest budget or the best players to stand out. They have shown that it is important to have a look off the pitch. Still, it is not that simple. You need creativity and courage, putting extra focus on your fans. 2. Bundesliga This league has become Europe's most-attended second division , even surpassing France's first league. The reason? A clear fan-first approach. Ticket prices stay affordable and stadiums feel welcoming for families and all supporters. Their famous 50 plus 1 rule keeps clubs in the hands of their fans, meaning decisions are made for the people who matter most. Fans are not treated as passive customers but as active participants in the club's story. FC Slovan Liberec Another example is this smaller Czech club focusing on connecting with their younger fanbase . However, instead of giving exclusive content to reporters, Slovan Liberec has taken control of their own storytelling. Their behind-the-scenes series, player stories, and exclusive content are now available through their own platform, creating a direct line to fans while also generating revenue. By keeping key content behind a paywall, they ensure that engagement translates into both loyalty and financial support, proving that smart digital strategies can make a real difference for smaller clubs. Venezia FC Then there is also the Italian club Venezia FC , which has turned their club into a fashionable brand. Although being one of the most famous touristic cities in Europe, they had a hard time getting the home crowd behind them and had no international appeal. They recognized the need for change and shifted their priority from on-field performance to off-the-pitch engagement. By collaborating with designers and focusing on style, they wanted to tell a story that goes beyond football. Their creative and unique approach attracted global attention and cultivated a loyal fanbase. They clearly proved that out-of-the-box thinking can lead to lasting success. These examples show what smaller clubs can achieve when they think differently and put fan engagement at the center of everything. It is not about size but about mindset. Using data to boost fan engagement Strong fan engagement starts with knowing who your fans are and what they care about. Data allows clubs to understand who their supporters are and what they care about. With the right data, clubs can personalize the fan experience. You can send targeted offers, invite the right people to events, and create content that speaks to each group. Fans do not want to feel like one of many. Just like regular customers, fans want to feel seen and valued. Moreover, it is also a key aspect of marketing. Small clubs do not have endless budgets. Therefore, smart, data-driven marketing helps them reach the right fans with the right message at the right time. This increases ticket sales, boosts merchandise revenue, making each euro spent more effective. In fact, leveraging fan data effectively has proven to be a game-changer in maximizing matchday revenue . However, the challenge lies in collecting and using this data efficiently without adding friction to the fan experience. With the right tools, clubs can streamline this process, ensuring they not only boost revenue but also strengthen fan engagement in the long run. On top of that, data also plays a crucial role when dealing with partners. Sponsors and commercial partners want more than a logo on a shirt. They want to know who your fans are. What do they buy? Which brands do they follow? What drives their loyalty? If you cannot answer those questions, you are missing opportunities. European giant nearly dropped the ball on this. Even the biggest clubs struggle with this. FC Barcelona signed a €280 million sponsorship deal with Spotify. But according to Sport , Spotify was disappointed to gain access to data from less than 1 percent of Barcelona's claimed 350 million registered supporters. This lack of real data made it harder to activate the sponsorship and deliver value. For smaller clubs, this is both a challenge and an opportunity. You may not have millions of fans, but you can really know them well. Collecting the right data and using it wisely can help you build stronger fan relationships and become more attractive to sponsors. In the end, good data makes everything you do smarter. Why bold moves matter more than big budgets The future belongs to clubs that are willing to evolve. Smaller clubs do not need massive budgets or superstar squads to make an impact. They need focus. Focus on their community and most importantly, their fans. By adapting to new expectations and staying creative, smaller clubs can build something that lasts. Innovation doesn't always mean huge investments. It often starts with smarter choices. For example, using data to better understand fan behavior, offering more personalized experiences, and finding new ways to keep fans engaged beyond matchdays. One of the most important factors is making fan experiences seamless. By embracing innovation and implementing technologies such as biometric ticketing, clubs can enhance the fan journey. Entry becomes fast and smooth, while also offering a more secure experience. In the end, it all comes down to fan engagement In today's competitive football landscape, fan engagement is the key to ensuring long-term success, especially for smaller clubs. By focusing on building strong connections with your fans and understanding what they want, you can create a loyal fanbase that returns game after game. Leveraging data and innovation, including solutions like TruCrowd's identity technology , allows clubs to better understand fan behavior and deliver personalized experiences. Embracing such technologies helps streamline the fan journey, providing a smoother, more secure experience while keeping fans engaged both on and off the pitch. Don't sit back and watch other clubs innovate. Start small and think big, because the future isn't waiting. The time to invest in fan engagement and innovative strategies is now. Related Posts Lessons from Brazil: 8 steps to ensure implementation speed doesn't compromise strong biometric data security February 27, 2025 Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping January 26, 2025 Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter December 22, 2024 Let's be honest. Being a smaller football club can feel like a tough match, both on and off the pitch. Budgets are tight and trying something new can be scary. But here's the thing. While the big clubs chase global fame, smaller clubs still have something powerful: a strong community. Take the 2. Bundesliga, Germany's second division, for example. On average, their stadiums attract more fans than France's first division. How? The answer lies in a football culture built around community and tradition. People return week after week because they feel part of something bigger than themselves. However, times are changing. That loyal fanbase is aging. If younger generations do not feel connected now, who will fill your stands in ten years? Empty seats mean missed revenue and lost atmosphere. Fan engagement is the key to tackling these challenges. It helps you keep loyal supporters close, attract younger fans, and make every matchday feel like part of something bigger. In the next sections, we will show how other clubs are doing this successfully and how smaller clubs can make it their biggest strength. An aging fanbase clubs can't ignore One of the biggest challenges for football clubs today is an aging fanbase. Yet, many clubs are not paying attention to it. The stands still fill up and on the surface, everything seems fine. But under that surface, the problem grows. If younger generations do not connect with your club now, who will come to your stadium in 10 years? The numbers speak for themselves. In the UK, only 30% of people aged 18 to 34 feel passionate about football. Besides, even more than a third don't really care that much about football. It is not that young fans don't like sports at all; they just consume sports differently. They want quick highlights, behind-the-scenes content, and interaction beyond just watching a match. According to PwC , Gen Z fans are far more likely to follow football through social media and digital platforms rather than rooting in the stands. This is where technology comes in. Younger fans expect seamless, hassle-free experiences. They don't want to fumble with paper tickets or even QR codes. Biometric ticketing fits naturally into their digital mindset, allowing them to enter the stadium effortlessly, just like they unlock their phones. An important factor for the younger generation is to make everything go faster. With a biometric solution, fans can enter the stadium up to 3x faster. Still, many clubs remain conservative. They like to stick to old habits, afraid to change what once worked well. That hesitation is dangerous, as younger generations expect more. They want entertainment and a reason to feel part of something. For smaller clubs, this challenge becomes even bigger. Unlike top clubs, they cannot rely on occasional fans or tourists. However, this also means they have the chance to build something stronger. As a smaller club, a close connection with the local community is the biggest strength. With the right fan engagement strategies, they can make younger fans feel part of the club's story and turn them into loyal supporters for years to come. When mindset beats money It is possible to do things differently. Some clubs have shown that you don't need the biggest budget or the best players to stand out. They have shown that it is important to have a look off the pitch. Still, it is not that simple. You need creativity and courage, putting extra focus on your fans. 2. Bundesliga This league has become Europe's most-attended second division , even surpassing France's first league. The reason? A clear fan-first approach. Ticket prices stay affordable and stadiums feel welcoming for families and all supporters. Their famous 50 plus 1 rule keeps clubs in the hands of their fans, meaning decisions are made for the people who matter most. Fans are not treated as passive customers but as active participants in the club's story. FC Slovan Liberec Another example is this smaller Czech club focusing on connecting with their younger fanbase . However, instead of giving exclusive content to reporters, Slovan Liberec has taken control of their own storytelling. Their behind-the-scenes series, player stories, and exclusive content are now available through their own platform, creating a direct line to fans while also generating revenue. By keeping key content behind a paywall, they ensure that engagement translates into both loyalty and financial support, proving that smart digital strategies can make a real difference for smaller clubs. Venezia FC Then there is also the Italian club Venezia FC , which has turned their club into a fashionable brand. Although being one of the most famous touristic cities in Europe, they had a hard time getting the home crowd behind them and had no international appeal. They recognized the need for change and shifted their priority from on-field performance to off-the-pitch engagement. By collaborating with designers and focusing on style, they wanted to tell a story that goes beyond football. Their creative and unique approach attracted global attention and cultivated a loyal fanbase. They clearly proved that out-of-the-box thinking can lead to lasting success. These examples show what smaller clubs can achieve when they think differently and put fan engagement at the center of everything. It is not about size but about mindset. Using data to boost fan engagement Strong fan engagement starts with knowing who your fans are and what they care about. Data allows clubs to understand who their supporters are and what they care about. With the right data, clubs can personalize the fan experience. You can send targeted offers, invite the right people to events, and create content that speaks to each group. Fans do not want to feel like one of many. Just like regular customers, fans want to feel seen and valued. Moreover, it is also a key aspect of marketing. Small clubs do not have endless budgets. Therefore, smart, data-driven marketing helps them reach the right fans with the right message at the right time. This increases ticket sales, boosts merchandise revenue, making each euro spent more effective. In fact, leveraging fan data effectively has proven to be a game-changer in maximizing matchday revenue . However, the challenge lies in collecting and using this data efficiently without adding friction to the fan experience. With the right tools, clubs can streamline this process, ensuring they not only boost revenue but also strengthen fan engagement in the long run. On top of that, data also plays a crucial role when dealing with partners. Sponsors and commercial partners want more than a logo on a shirt. They want to know who your fans are. What do they buy? Which brands do they follow? What drives their loyalty? If you cannot answer those questions, you are missing opportunities. European giant nearly dropped the ball on this. Even the biggest clubs struggle with this. FC Barcelona signed a €280 million sponsorship deal with Spotify. But according to Sport , Spotify was disappointed to gain access to data from less than 1 percent of Barcelona's claimed 350 million registered supporters. This lack of real data made it harder to activate the sponsorship and deliver value. For smaller clubs, this is both a challenge and an opportunity. You may not have millions of fans, but you can really know them well. Collecting the right data and using it wisely can help you build stronger fan relationships and become more attractive to sponsors. In the end, good data makes everything you do smarter. Why bold moves matter more than big budgets The future belongs to clubs that are willing to evolve. Smaller clubs do not need massive budgets or superstar squads to make an impact. They need focus. Focus on their community and most importantly, their fans. By adapting to new expectations and staying creative, smaller clubs can build something that lasts. Innovation doesn't always mean huge investments. It often starts with smarter choices. For example, using data to better understand fan behavior, offering more personalized experiences, and finding new ways to keep fans engaged beyond matchdays. One of the most important factors is making fan experiences seamless. By embracing innovation and implementing technologies such as biometric ticketing, clubs can enhance the fan journey. Entry becomes fast and smooth, while also offering a more secure experience. In the end, it all comes down to fan engagement In today's competitive football landscape, fan engagement is the key to ensuring long-term success, especially for smaller clubs. By focusing on building strong connections with your fans and understanding what they want, you can create a loyal fanbase that returns game after game. Leveraging data and innovation, including solutions like TruCrowd's identity technology , allows clubs to better understand fan behavior and deliver personalized experiences. Embracing such technologies helps streamline the fan journey, providing a smoother, more secure experience while keeping fans engaged both on and off the pitch. Don't sit back and watch other clubs innovate. Start small and think big, because the future isn't waiting. The time to invest in fan engagement and innovative strategies is now. Let's be honest. Being a smaller football club can feel like a tough match, both on and off the pitch. Budgets are tight and trying something new can be scary. But here's the thing. While the big clubs chase global fame, smaller clubs still have something powerful: a strong community. Take the 2. Bundesliga, Germany's second division, for example. On average, their stadiums attract more fans than France's first division. How? The answer lies in a football culture built around community and tradition. People return week after week because they feel part of something bigger than themselves. However, times are changing. That loyal fanbase is aging. If younger generations do not feel connected now, who will fill your stands in ten years? Empty seats mean missed revenue and lost atmosphere. Fan engagement is the key to tackling these challenges. It helps you keep loyal supporters close, attract younger fans, and make every matchday feel like part of something bigger. In the next sections, we will show how other clubs are doing this successfully and how smaller clubs can make it their biggest strength. An aging fanbase clubs can't ignore One of the biggest challenges for football clubs today is an aging fanbase. Yet, many clubs are not paying attention to it. The stands still fill up and on the surface, everything seems fine. But under that surface, the problem grows. If younger generations do not connect with your club now, who will come to your stadium in 10 years? The numbers speak for themselves. In the UK, only 30% of people aged 18 to 34 feel passionate about football. Besides, even more than a third don't really care that much about football. It is not that young fans don't like sports at all; they just consume sports differently. They want quick highlights, behind-the-scenes content, and interaction beyond just watching a match. According to PwC , Gen Z fans are far more likely to follow football through social media and digital platforms rather than rooting in the stands. This is where technology comes in. Younger fans expect seamless, hassle-free experiences. They don't want to fumble with paper tickets or even QR codes. Biometric ticketing fits naturally into their digital mindset, allowing them to enter the stadium effortlessly, just like they unlock their phones. An important factor for the younger generation is to make everything go faster. With a biometric solution, fans can enter the stadium up to 3x faster. Still, many clubs remain conservative. They like to stick to old habits, afraid to change what once worked well. That hesitation is dangerous, as younger generations expect more. They want entertainment and a reason to feel part of something. For smaller clubs, this challenge becomes even bigger. Unlike top clubs, they cannot rely on occasional fans or tourists. However, this also means they have the chance to build something stronger. As a smaller club, a close connection with the local community is the biggest strength. With the right fan engagement strategies, they can make younger fans feel part of the club's story and turn them into loyal supporters for years to come. When mindset beats money It is possible to do things differently. Some clubs have shown that you don't need the biggest budget or the best players to stand out. They have shown that it is important to have a look off the pitch. Still, it is not that simple. You need creativity and courage, putting extra focus on your fans. This league has become Europe's most-attended second division , even surpassing France's first league. The reason? A clear fan-first approach. Ticket prices stay affordable and stadiums feel welcoming for families and all supporters. Their famous 50 plus 1 rule keeps clubs in the hands of their fans, meaning decisions are made for the people who matter most. Fans are not treated as passive customers but as active participants in the club's story. Another example is this smaller Czech club focusing on connecting with their younger fanbase . However, instead of giving exclusive content to reporters, Slovan Liberec has taken control of their own storytelling. Their behind-the-scenes series, player stories, and exclusive content are now available through their own platform, creating a direct line to fans while also generating revenue. By keeping key content behind a paywall, they ensure that engagement translates into both loyalty and financial support, proving that smart digital strategies can make a real difference for smaller clubs. Then there is also the Italian club Venezia FC , which has turned their club into a fashionable brand. Although being one of the most famous touristic cities in Europe, they had a hard time getting the home crowd behind them and had no international appeal. They recognized the need for change and shifted their priority from on-field performance to off-the-pitch engagement. By collaborating with designers and focusing on style, they wanted to tell a story that goes beyond football. Their creative and unique approach attracted global attention and cultivated a loyal fanbase. They clearly proved that out-of-the-box thinking can lead to lasting success. These examples show what smaller clubs can achieve when they think differently and put fan engagement at the center of everything. It is not about size but about mindset. Using data to boost fan engagement Strong fan engagement starts with knowing who your fans are and what they care about. Data allows clubs to understand who their supporters are and what they care about. With the right data, clubs can personalize the fan experience. You can send targeted offers, invite the right people to events, and create content that speaks to each group. Fans do not want to feel like one of many. Just like regular customers, fans want to feel seen and valued. Moreover, it is also a key aspect of marketing. Small clubs do not have endless budgets. Therefore, smart, data-driven marketing helps them reach the right fans with the right message at the right time. This increases ticket sales, boosts merchandise revenue, making each euro spent more effective. In fact, leveraging fan data effectively has proven to be a game-changer in maximizing matchday revenue . However, the challenge lies in collecting and using this data efficiently without adding friction to the fan experience. With the right tools, clubs can streamline this process, ensuring they not only boost revenue but also strengthen fan engagement in the long run. On top of that, data also plays a crucial role when dealing with partners. Sponsors and commercial partners want more than a logo on a shirt. They want to know who your fans are. What do they buy? Which brands do they follow? What drives their loyalty? If you cannot answer those questions, you are missing opportunities. Even the biggest clubs struggle with this. FC Barcelona signed a €280 million sponsorship deal with Spotify. But according to Sport , Spotify was disappointed to gain access to data from less than 1 percent of Barcelona's claimed 350 million registered supporters. This lack of real data made it harder to activate the sponsorship and deliver value. For smaller clubs, this is both a challenge and an opportunity. You may not have millions of fans, but you can really know them well. Collecting the right data and using it wisely can help you build stronger fan relationships and become more attractive to sponsors. In the end, good data makes everything you do smarter. Why bold moves matter more than big budgets The future belongs to clubs that are willing to evolve. Smaller clubs do not need massive budgets or superstar squads to make an impact. They need focus. Focus on their community and most importantly, their fans. By adapting to new expectations and staying creative, smaller clubs can build something that lasts. Innovation doesn't always mean huge investments. It often starts with smarter choices. For example, using data to better understand fan behavior, offering more personalized experiences, and finding new ways to keep fans engaged beyond matchdays. One of the most important factors is making fan experiences seamless. By embracing innovation and implementing technologies such as biometric ticketing, clubs can enhance the fan journey. Entry becomes fast and smooth, while also offering a more secure experience. In the end, it all comes down to fan engagement In today's competitive football landscape, fan engagement is the key to ensuring long-term success, especially for smaller clubs. By focusing on building strong connections with your fans and understanding what they want, you can create a loyal fanbase that returns game after game. Leveraging data and innovation, including solutions like TruCrowd's identity technology , allows clubs to better understand fan behavior and deliver personalized experiences. Embracing such technologies helps streamline the fan journey, providing a smoother, more secure experience while keeping fans engaged both on and off the pitch. Don't sit back and watch other clubs innovate. Start small and think big, because the future isn't waiting. The time to invest in fan engagement and innovative strategies is now. Lessons from Brazil: 8 steps to ensure implementation speed doesn't compromise strong biometric data security February 27, 2025 Lessons from Brazil: 8 steps to ensure implementation speed doesn't compromise strong biometric data security Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping January 26, 2025 Biometric Ticketing and Venue Access Can Comply with GDPR While Solving Compliance, Security and Preventing Ticket Scalping Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter December 22, 2024 Stadium Bans Are Useless if You Can't Stop Banned Fans to Enter TruCrowd s.r.o. MaleÅ¡ická 28552b Žižkov, 130 00, Praha 3 Building the Future of Fan Experience with Face Ticket Technology © TruCrowd 2025. Web by Wonder Blue.",
    "Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. One point where facial recognition at stadiums can get confusing is its role. It aims to replace two different functions at once: access and security. For access, it allows the use of a face as a ticket, eliminating the need to carry any ticket. For security purposes, its role is akin to that of security staff: it checks whether a person is a known hooligan or a fraudster. It performs this task more quickly and accurately than any person ever could, resulting in virtually zero errors. Any error could lead to a security incident, a fine for the club , or both—not to mention negative coverage of the game and perceived insecurity of the venue. Let's look at these two roles of facial recognition in more detail. Role 1: Your Face is Your Ticket To verify the identity of a ticket holder at the entrance gate, the spectator does not need any ticket or token. The face, and only the face, is literally the ticket. The venue owner or club doesn't need to know the name or any other personally identifiable information. They just use the image of a face to check whether a given person has indeed bought a ticket. Facial recognition is being considered by football clubs with great interest. It's no surprise—the benefits can easily outweigh the costs. The technology promises to eliminate fines for unruly fans, prevent hooliganism and fights at the stadium, and consequently attract 10% to 15% more families to stadiums, as estimated by Lorin Parys, CEO of the Pro League. \"There is a hard core of 2 to 3 percent of the spectators – I don't want to call them fans – who are holding our football hostage today. We want that 2 to 3 percent out of our stadiums, because then we will grow 10 to 15 percent in spectator numbers. These are families with children who are staying away today. We want to make stadiums safe again.†Lorin Parys, CEO of the Pro League Additionally, it can reduce long waiting lines and dangerous bottlenecks, and eradicate fake tickets or overpriced reselling . Fans are also receptive to this idea. Contrary to fears about their faces being \"stolen\" and misused, existing deployments show that fans are seeking security, comfort, and fair pricing. Role 2: Security Without Mistakes The security aspect is promoted mostly by federations and regulators that require clubs to verify the identities of ticket buyers and to authorize the entry to the stadium upon presentation of a valid Ticket per person (regardless of age) and proof of identity of the Ticket Holder with valid photograph ( UEFA UEFA EURO 2024â\"¢TICKETING ) . Simply, they should know who is at the stadium during events. This is not for faster access or more accurate fan data; it's to limit the security threats posed by unruly fans and other external threats, such as terrorism, that all mass events unfortunately face. Unlike using facial recognition as a face ticket for stadium access, using it to prevent security incidents, eliminate racism, or keep dangerous individuals out of stadiums requires associating the face with personally identifiable information. Achieving the security requirements set by regulators without facial recognition technology is nearly impossible. Manual identity checks at the stadium gates would involve staff verifying ticket names against IDs and matching faces to ID photos, which is less accurate than biometrics. It would also result in longer waiting lines and more risky bottlenecks. Not to mention the risks of false positives and negatives. In the first case, security could detain innocent persons due to a suspicious name or behavior, according to staff judgment. In the second case, failure to identify a known hooligan due to a false ID means security and financial risks. Both of these risks are not only minimized with biometrics but can also be precisely measured and easily mitigated, resulting in virtually no errors. Currently, despite the requirements, these identity checks are not effectively enforced. This creates a situation where important rules are in place but are impractical to implement without technological support. The Privacy Dilemma The main concern preventing the full adoption of facial recognition is privacy and GDPR compliance . Clubs face a tradeoff between creating a safe experience for their fans, avoiding issues like racism and vandalism, and protecting their privacy. GDPR stipulates that less intrusive methods of identification should be used if available. While paper tickets are less intrusive for access control, they do not represent an alternative for reducing security risks at mass events like facial recognition. While the right to privacy is certainly one of the most important pillars of a free society, it is also important to measure the true risks related to each of these two use cases. Data Breaches It is true that to implement a face ticket solution, the faces or biometric templates of attendees must be captured and stored in a database for matching at the entrance gate. It is also true that these faces do not have to be kept in the same system as all other personal data, such as names, addresses, … The privacy-proof solution design keeps these two datasets separated, thereby mitigating the risk. The solutions providing face identification services also operate on high-security software architecture that complies with the strictest data protection requirements. It is also important to acknowledge that there have been no confirmed cases of full-blown identity theft solely from a leaked facial recognition database as most entities will require liveness checks for opening bank accounts and other tasks. The primary risk associated with a facial database breach is the possibility for malicious actors to combine leaked facial data with other publicly available information to create a more complete profile. Needless to say, the main sources of this public information are social networks that already contain both faces and publicly available personal information. Identification in Public Areas Another significant concern is the identification of individuals in public areas. This issue rightfully ranks among the most feared abuses of facial recognition technology. Particularly detrimental to democracy and human rights, it is extensively covered and discussed in the world's only AI regulation, the AI Act . It is also true that for face ticket systems to function, faces need to be identified, and cameras are positioned at the stadium gates. The identification is possible only against a list of individuals who have opted in for such identification. Most importantly, the ethical aspect of protecting other individuals that did not want their faces scanned is addressed at the technological level. A properly designed face ticket solution has the capability to restrict the exact area within the camera's view where identification occurs, with accuracy down to tens of centimeters. This designated area can be clearly marked so that individuals who do not wish to have their faces identified can avoid it. Facial recognition at stadiums – Experience from Existing Deployments Facial recognition technology is deemed high-risk due to significant privacy concerns. However, in countries where face tickets are fully deployed—such as the Brazil, and Mexico—it is implemented with individual consent in controlled environments. Stadiums offer a controlled setting where consent is easily obtained, and biometric data can be securely managed. Ticket holders retain constant control over their data and can request its deletion after the event. This approach has shown positive outcomes, including reduced hate crimes, the apprehension of wanted individuals (e.g., the Palmeiras case), increased match day revenue for clubs, and the elimination of bottlenecks. Facial recognition technology currently stands as the most effective solution to stadium security challenges . There is no less intrusive alternative that provides the same level of safety and convenience. Beyond security benefits, facial recognition enhances stadium experiences by preventing ticket fraud, curbing abusive ticket reselling , ensuring fair pricing, expediting entry, and enabling secure payments. The first clubs to adopt facial recognition at stadiums will win with their fan base. By embracing facial recognition, clubs can ensure a safer and more enjoyable experience for their fans while also reaping the financial and operational benefits that come with it. Related Posts Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer April 28, 2025 Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It April 18, 2025 How smaller clubs can turn challenges into fan engagement success by investing in technology March 31, 2025 Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. One point where facial recognition at stadiums can get confusing is its role. It aims to replace two different functions at once: access and security. For access, it allows the use of a face as a ticket, eliminating the need to carry any ticket. For security purposes, its role is akin to that of security staff: it checks whether a person is a known hooligan or a fraudster. It performs this task more quickly and accurately than any person ever could, resulting in virtually zero errors. Any error could lead to a security incident, a fine for the club , or both—not to mention negative coverage of the game and perceived insecurity of the venue. Let's look at these two roles of facial recognition in more detail. Role 1: Your Face is Your Ticket To verify the identity of a ticket holder at the entrance gate, the spectator does not need any ticket or token. The face, and only the face, is literally the ticket. The venue owner or club doesn't need to know the name or any other personally identifiable information. They just use the image of a face to check whether a given person has indeed bought a ticket. Facial recognition is being considered by football clubs with great interest. It's no surprise—the benefits can easily outweigh the costs. The technology promises to eliminate fines for unruly fans, prevent hooliganism and fights at the stadium, and consequently attract 10% to 15% more families to stadiums, as estimated by Lorin Parys, CEO of the Pro League. \"There is a hard core of 2 to 3 percent of the spectators – I don't want to call them fans – who are holding our football hostage today. We want that 2 to 3 percent out of our stadiums, because then we will grow 10 to 15 percent in spectator numbers. These are families with children who are staying away today. We want to make stadiums safe again.†Lorin Parys, CEO of the Pro League Additionally, it can reduce long waiting lines and dangerous bottlenecks, and eradicate fake tickets or overpriced reselling . Fans are also receptive to this idea. Contrary to fears about their faces being \"stolen\" and misused, existing deployments show that fans are seeking security, comfort, and fair pricing. Role 2: Security Without Mistakes The security aspect is promoted mostly by federations and regulators that require clubs to verify the identities of ticket buyers and to authorize the entry to the stadium upon presentation of a valid Ticket per person (regardless of age) and proof of identity of the Ticket Holder with valid photograph ( UEFA UEFA EURO 2024â\"¢TICKETING ) . Simply, they should know who is at the stadium during events. This is not for faster access or more accurate fan data; it's to limit the security threats posed by unruly fans and other external threats, such as terrorism, that all mass events unfortunately face. Unlike using facial recognition as a face ticket for stadium access, using it to prevent security incidents, eliminate racism, or keep dangerous individuals out of stadiums requires associating the face with personally identifiable information. Achieving the security requirements set by regulators without facial recognition technology is nearly impossible. Manual identity checks at the stadium gates would involve staff verifying ticket names against IDs and matching faces to ID photos, which is less accurate than biometrics. It would also result in longer waiting lines and more risky bottlenecks. Not to mention the risks of false positives and negatives. In the first case, security could detain innocent persons due to a suspicious name or behavior, according to staff judgment. In the second case, failure to identify a known hooligan due to a false ID means security and financial risks. Both of these risks are not only minimized with biometrics but can also be precisely measured and easily mitigated, resulting in virtually no errors. Currently, despite the requirements, these identity checks are not effectively enforced. This creates a situation where important rules are in place but are impractical to implement without technological support. The Privacy Dilemma The main concern preventing the full adoption of facial recognition is privacy and GDPR compliance . Clubs face a tradeoff between creating a safe experience for their fans, avoiding issues like racism and vandalism, and protecting their privacy. GDPR stipulates that less intrusive methods of identification should be used if available. While paper tickets are less intrusive for access control, they do not represent an alternative for reducing security risks at mass events like facial recognition. While the right to privacy is certainly one of the most important pillars of a free society, it is also important to measure the true risks related to each of these two use cases. Data Breaches It is true that to implement a face ticket solution, the faces or biometric templates of attendees must be captured and stored in a database for matching at the entrance gate. It is also true that these faces do not have to be kept in the same system as all other personal data, such as names, addresses, … The privacy-proof solution design keeps these two datasets separated, thereby mitigating the risk. The solutions providing face identification services also operate on high-security software architecture that complies with the strictest data protection requirements. It is also important to acknowledge that there have been no confirmed cases of full-blown identity theft solely from a leaked facial recognition database as most entities will require liveness checks for opening bank accounts and other tasks. The primary risk associated with a facial database breach is the possibility for malicious actors to combine leaked facial data with other publicly available information to create a more complete profile. Needless to say, the main sources of this public information are social networks that already contain both faces and publicly available personal information. Identification in Public Areas Another significant concern is the identification of individuals in public areas. This issue rightfully ranks among the most feared abuses of facial recognition technology. Particularly detrimental to democracy and human rights, it is extensively covered and discussed in the world's only AI regulation, the AI Act . It is also true that for face ticket systems to function, faces need to be identified, and cameras are positioned at the stadium gates. The identification is possible only against a list of individuals who have opted in for such identification. Most importantly, the ethical aspect of protecting other individuals that did not want their faces scanned is addressed at the technological level. A properly designed face ticket solution has the capability to restrict the exact area within the camera's view where identification occurs, with accuracy down to tens of centimeters. This designated area can be clearly marked so that individuals who do not wish to have their faces identified can avoid it. Facial recognition at stadiums – Experience from Existing Deployments Facial recognition technology is deemed high-risk due to significant privacy concerns. However, in countries where face tickets are fully deployed—such as the Brazil, and Mexico—it is implemented with individual consent in controlled environments. Stadiums offer a controlled setting where consent is easily obtained, and biometric data can be securely managed. Ticket holders retain constant control over their data and can request its deletion after the event. This approach has shown positive outcomes, including reduced hate crimes, the apprehension of wanted individuals (e.g., the Palmeiras case), increased match day revenue for clubs, and the elimination of bottlenecks. Facial recognition technology currently stands as the most effective solution to stadium security challenges . There is no less intrusive alternative that provides the same level of safety and convenience. Beyond security benefits, facial recognition enhances stadium experiences by preventing ticket fraud, curbing abusive ticket reselling , ensuring fair pricing, expediting entry, and enabling secure payments. The first clubs to adopt facial recognition at stadiums will win with their fan base. By embracing facial recognition, clubs can ensure a safer and more enjoyable experience for their fans while also reaping the financial and operational benefits that come with it. Regulations require sports clubs to verify the identities of ticket purchasers, but current methods for checking IDs at stadium gates are ineffective. This creates a problematic gap: clubs are held accountable for who enters, but lack the tools to enforce it. Facial recognition at stadiums, while currently banned for access control, offers a solution to this security conundrum. One point where facial recognition at stadiums can get confusing is its role. It aims to replace two different functions at once: access and security. For access, it allows the use of a face as a ticket, eliminating the need to carry any ticket. For security purposes, its role is akin to that of security staff: it checks whether a person is a known hooligan or a fraudster. It performs this task more quickly and accurately than any person ever could, resulting in virtually zero errors. Any error could lead to a security incident, a fine for the club , or both—not to mention negative coverage of the game and perceived insecurity of the venue. Let's look at these two roles of facial recognition in more detail. Role 1: Your Face is Your Ticket To verify the identity of a ticket holder at the entrance gate, the spectator does not need any ticket or token. The face, and only the face, is literally the ticket. The venue owner or club doesn't need to know the name or any other personally identifiable information. They just use the image of a face to check whether a given person has indeed bought a ticket. Facial recognition is being considered by football clubs with great interest. It's no surprise—the benefits can easily outweigh the costs. The technology promises to eliminate fines for unruly fans, prevent hooliganism and fights at the stadium, and consequently attract 10% to 15% more families to stadiums, as estimated by Lorin Parys, CEO of the Pro League. \"There is a hard core of 2 to 3 percent of the spectators – I don't want to call them fans – who are holding our football hostage today. We want that 2 to 3 percent out of our stadiums, because then we will grow 10 to 15 percent in spectator numbers. These are families with children who are staying away today. We want to make stadiums safe again.†Lorin Parys, CEO of the Pro League Additionally, it can reduce long waiting lines and dangerous bottlenecks, and eradicate fake tickets or overpriced reselling . Fans are also receptive to this idea. Contrary to fears about their faces being \"stolen\" and misused, existing deployments show that fans are seeking security, comfort, and fair pricing. Role 2: Security Without Mistakes The security aspect is promoted mostly by federations and regulators that require clubs to verify the identities of ticket buyers and to authorize the entry to the stadium upon presentation of a valid Ticket per person (regardless of age) and proof of identity of the Ticket Holder with valid photograph ( UEFA UEFA EURO 2024â\"¢TICKETING ) . Simply, they should know who is at the stadium during events. This is not for faster access or more accurate fan data; it's to limit the security threats posed by unruly fans and other external threats, such as terrorism, that all mass events unfortunately face. Unlike using facial recognition as a face ticket for stadium access, using it to prevent security incidents, eliminate racism, or keep dangerous individuals out of stadiums requires associating the face with personally identifiable information. Achieving the security requirements set by regulators without facial recognition technology is nearly impossible. Manual identity checks at the stadium gates would involve staff verifying ticket names against IDs and matching faces to ID photos, which is less accurate than biometrics. It would also result in longer waiting lines and more risky bottlenecks. Not to mention the risks of false positives and negatives. In the first case, security could detain innocent persons due to a suspicious name or behavior, according to staff judgment. In the second case, failure to identify a known hooligan due to a false ID means security and financial risks. Both of these risks are not only minimized with biometrics but can also be precisely measured and easily mitigated, resulting in virtually no errors. Currently, despite the requirements, these identity checks are not effectively enforced. This creates a situation where important rules are in place but are impractical to implement without technological support. The main concern preventing the full adoption of facial recognition is privacy and GDPR compliance . Clubs face a tradeoff between creating a safe experience for their fans, avoiding issues like racism and vandalism, and protecting their privacy. GDPR stipulates that less intrusive methods of identification should be used if available. While paper tickets are less intrusive for access control, they do not represent an alternative for reducing security risks at mass events like facial recognition. While the right to privacy is certainly one of the most important pillars of a free society, it is also important to measure the true risks related to each of these two use cases. It is true that to implement a face ticket solution, the faces or biometric templates of attendees must be captured and stored in a database for matching at the entrance gate. It is also true that these faces do not have to be kept in the same system as all other personal data, such as names, addresses, … The privacy-proof solution design keeps these two datasets separated, thereby mitigating the risk. The solutions providing face identification services also operate on high-security software architecture that complies with the strictest data protection requirements. It is also important to acknowledge that there have been no confirmed cases of full-blown identity theft solely from a leaked facial recognition database as most entities will require liveness checks for opening bank accounts and other tasks. The primary risk associated with a facial database breach is the possibility for malicious actors to combine leaked facial data with other publicly available information to create a more complete profile. Needless to say, the main sources of this public information are social networks that already contain both faces and publicly available personal information. Identification in Public Areas Another significant concern is the identification of individuals in public areas. This issue rightfully ranks among the most feared abuses of facial recognition technology. Particularly detrimental to democracy and human rights, it is extensively covered and discussed in the world's only AI regulation, the AI Act . It is also true that for face ticket systems to function, faces need to be identified, and cameras are positioned at the stadium gates. The identification is possible only against a list of individuals who have opted in for such identification. Most importantly, the ethical aspect of protecting other individuals that did not want their faces scanned is addressed at the technological level. A properly designed face ticket solution has the capability to restrict the exact area within the camera's view where identification occurs, with accuracy down to tens of centimeters. This designated area can be clearly marked so that individuals who do not wish to have their faces identified can avoid it. Facial recognition at stadiums – Experience from Existing Deployments Facial recognition technology is deemed high-risk due to significant privacy concerns. However, in countries where face tickets are fully deployed—such as the Brazil, and Mexico—it is implemented with individual consent in controlled environments. Stadiums offer a controlled setting where consent is easily obtained, and biometric data can be securely managed. Ticket holders retain constant control over their data and can request its deletion after the event. This approach has shown positive outcomes, including reduced hate crimes, the apprehension of wanted individuals (e.g., the Palmeiras case), increased match day revenue for clubs, and the elimination of bottlenecks. Facial recognition technology currently stands as the most effective solution to stadium security challenges . There is no less intrusive alternative that provides the same level of safety and convenience. Beyond security benefits, facial recognition enhances stadium experiences by preventing ticket fraud, curbing abusive ticket reselling , ensuring fair pricing, expediting entry, and enabling secure payments. The first clubs to adopt facial recognition at stadiums will win with their fan base. By embracing facial recognition, clubs can ensure a safer and more enjoyable experience for their fans while also reaping the financial and operational benefits that come with it. Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer April 28, 2025 Why commercial managers miss out on real value for sponsors and how B2B ticketing automation is the answer Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It April 18, 2025 Why Ticketing Companies Fail to Stop Ticket Touting and How to Fix It How smaller clubs can turn challenges into fan engagement success by investing in technology March 31, 2025 How smaller clubs can turn challenges into fan engagement success by investing in technology TruCrowd s.r.o. MaleÅ¡ická 28552b Žižkov, 130 00, Praha 3 Building the Future of Fan Experience with Face Ticket Technology © TruCrowd 2025. Web by Wonder Blue."
  ]
}