{
  "company": "ulsee.com",
  "dominant_topics": [
    -1,
    14
  ],
  "topic_counts": {
    "-1": 4,
    "14": 2
  },
  "topic_descriptions": {
    "14": "authored, minivision, minivision technology, panasonic, singapore"
  },
  "framing_scores": {
    "framing_ethical": 0.7272727272727273,
    "framing_surveillance": 0.0,
    "framing_market": 0.2727272727272727,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "14": 2
    }
  },
  "sample_docs": [
    "Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! View More ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. Our Products The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Lifelike Augmented Reality Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! Cutting-Edge Deep-Learning With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. Let's Make Cool Projects Together! JOIN US Become a part of our team! Let's Make Cool Projects Together! Become a part of our team! PRODUCTS FACE TRACKING GLASSES TRY-ON FACE VERIFICATION AR FACE MASKS",
    "Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! View More ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. Our Products The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Lifelike Augmented Reality Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! Cutting-Edge Deep-Learning With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. Let's Make Cool Projects Together! JOIN US Become a part of our team! Let's Make Cool Projects Together! Become a part of our team! PRODUCTS FACE VERIFICATION AR FACE MASKS FACE TRACKING GLASSES TRY-ON AUTOMOBILE",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget ULSee (pronounced \"You'll See\") was formed by seasoned veterans in Computer Vision and Platform Development. Our company is fully committed to delivering exceptionally innovative experiences for mobile devices and PCs, and are particularly equipped to provide full turn-key solutions that meet the growing demand for Online to Offline (O2O) commerce, virtual try-on, social media, and other augmented reality forms of conducting business that are rapidly gaining in popularity. There are a growing number of applications that are relevant for computer vision, and ULSee technology is at the forefront of tackling these problems. We do this providing the finest core technologies in face tracking and recognition to provide advanced next generation solutions to our customers and partners. iOS, Android, Windows, OSX, and Linux To about how you can work with ULSee, please contact us .",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget ULSee's face tracking SDK is in a leading class of its own. With staggering accuracy and speed, it tracks a total of 66 facial landmarks, including ones on the critical jawline. And it will continue to have outstanding, robust performance even in challenging pose and imaging conditions. Our face tracker works with the standard cameras found in smartphone, tablets, laptops, webcams, and other personal electronic devices. No 3D camera or depth sensor is required. The algorithms and patented technology ensure unparalleled performance with a compact footprint. Applications are virtually unlimited, bounded only by the imagination of developers to build innovative, next generation apps that require professional and accurate tracking. Possible applications include the following: Virtual try-on/mirror (eyewear, cosmetics, jewelry) Eye and head controlled human computer interface Advanced biometrics (recognition, behavioral, emotion analysis) Our SDK is available for use in on multiple operating platforms – iOS, Android, PC, Mac, and Linux. To enter the beginning of a new and exciting era of computer vision products, please contact us at info@ulsee.com . With ULSee virtual try-on applications, users can virtually try-on various products almost anywhere and anytime. These products include eyewear, cosmetics, and jewelry. Vendors using a virtual try-on solution may be able to reduce product returns that cost significant time and money. A ULSee virtual try-on solution builds a 3D face model using real time video from a standard camera. Once this model is built, face and head accessories such as eyewear, makeup, and jewelry can then be virtually fitted and placed. In this way, users can find, create, and see for themselves their own style and have a convenient and accessible \"Try Before You Buy†experience. Virtual try-on solutions are available for use in on multiple operating platforms – iOS, Android, PC, Mac, and Linux. Available Virtual Try-On Applications: Other related face/head virtual try-on To find out more about ULSee's virtual try-on applications, please contact us at info@ulsee.com . ULSee measures pupillary distance, relying on output information from the face tracker. This metric reconstruction is completed using a standard camera, without the need for any inertial measurement unit. This measurement ability supplements ULSee's virtual try-on applications, such as enabling users to have a better idea as to whether the size of a certain model of eyewear would be a good fit (e.g., eye size, bridge size, etc.). Generally, measurements are accurate to within approximately +/- 2 mm. To find out more about ULSee's pupillary distance measurement, please contact us at info@ulsee.com .",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget ULSee's face recognition technology revolutionizes the industry and sets new standards for other to follow. Utilizing components of our face tracker, our face recognition is the ideal combination of accuracy, cost, and overall accessibility. This technology works with the standard cameras found in personal electronic devices and does not require any 3D camera or depth sensor. The technology also has the advantage of being able to recognize fraudulent images. A multitude of applications are possible from this core technology. Applications include security/surveillance, payment verification/identification, and genealogy analysis. Related applications encompass areas such as customer satisfaction and demographic analysis. To enter the beginning of a new and exciting era of computer vision products, please contact us at info@ulsee.com ."
  ]
}