{
  "company": "ulsee.com",
  "dominant_topics": [
    2,
    -1
  ],
  "topic_counts": {
    "2": 9,
    "-1": 2
  },
  "topic_descriptions": {
    "2": "uv, printer, transparency, printers, printing"
  },
  "framing_scores": {
    "framing_ethical": 0.8571428571428571,
    "framing_surveillance": 0.0,
    "framing_market": 0.1428571428571428,
    "num_docs": 11
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "2": 9
    }
  },
  "sample_docs": [
    "Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! View More ULSee Plugin is now available on Unity Hello world, ULSee plugin is now available on Unity Asset market. Welcome to join us to create a fantastic world with our high technology! Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. Our Products The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Lifelike Augmented Reality Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! Cutting-Edge Deep-Learning With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. Let's Make Cool Projects Together! JOIN US Become a part of our team! Let's Make Cool Projects Together! Become a part of our team! PRODUCTS FACE TRACKING GLASSES TRY-ON FACE VERIFICATION AR FACE MASKS",
    "Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! Transforming Vision Into Reality ULSee is revolutionizing the way humans and computers interact, merging virtual and real worlds in ways never before accomplished. Our breakthrough products are making possible what was previously impossible--It's in our code. If you are ready to create something amazing or take your product to the next level, contact us today! ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! View More ULSee Plugin is now available on Unity Hello World, ULSee plugin is now available on Unity Asset Store. Welcome to join us to create a fantastic world with our high technology! Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. View More Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulation! ULSee won the champion of 2016 \"Qiantang Star\" Innovation and Entrepreneurship Competition. Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. View More Congratulations to our technical partner : LINE Japanese Messaging Company LINE went public on the New York Stock Exchange (NYSE) today in the biggiest tech IPO of 2016. LINE is a messaging platform used widely in Asia, and boasts over 200 million monthly users. Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. View More Augmented Reality for Disney Blockbuster Alice Through the Looking Glass is the interactive AR (Augmented Reality) experience at the D23 EXPO 2015. Supported by ULSee face tracking technology, the 'wonder mirror' can transform anyone into an amazing character from the the Disney film. Pairing 3D elements and makeup effects with users' face to create a true, real-time augmented transformation. Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? View More Animated Lenses Come to the LINE Camera App ULSee's markerless facial tracking technology, which tracks 66 facial points in real time, allows companies like LINE to create fun and immersive products for their LINE camera app. Users can seamlessly apply a myriad of special effects, stickers and masks. What kind of products can we help you create? Savetrack Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. View More Thanks to ULSee's breakthrough face tracking technology, companies like Savetrack™ are making the road a safer place by detecting driver facial gestures, expressions and eye movement to monitor fatigue and distraction. Information is then uploaded to the cloud for monitoring and analysis. Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. View More Camera360 Adds Popular Features #1 ranked beauty camera app Camera360 employs ULSee technology to give users a host of incredible tools, including beautifying filters, stickers, augmented reality tools and much more. ULSee helps companies keep up with current consumer trends and what's hot. Our Products The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Lifelike Augmented Reality Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! Cutting-Edge Deep-Learning With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. The Go-To Face Tracker ULSee face tracking technology is unrivaled in the industry, delivering real-time tracking of at least 66 facial points under even the most challenging lighting conditions. Combining face tracking and augmented reality technology, ULSee delivers an outstanding Virtual Try-On (VTO) experience. Amazing Animated Face Masks Combining face tracking technology and animated mask effects, ULSee can add accessories to your face, or transform your face altogether into whatever you wish--even a celebrity! With massive amounts of algorithms, big data, and computational power, ULSee helps machines learn in real time with accuracy, and drives innovation in the Artificial Intelligence space. Let's Make Cool Projects Together! JOIN US Become a part of our team! Let's Make Cool Projects Together! Become a part of our team! PRODUCTS FACE VERIFICATION AR FACE MASKS FACE TRACKING GLASSES TRY-ON AUTOMOBILE",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget We are hiring! Are you looking for an exciting and rewarding career at a growing technology company? ULSee is always on the lookout for outstanding talent. We realize that the key to our success lies within our incredible employee talent pool and world-class team. Our company culture thrives on being highly collaborative and entrepreneurial in nature. Over 90% of our employees hold master's and advanced degrees from many of the top universities in the world. At ULSee, we understand that being a leading company requires that we constantly hire and retain elite talent. Graduates from top-tier research universities Experienced technology leaders and innovators Individuals with a desire to solve big problems Entrepreneurial visionaries who can think outside of the box Professionals with an internationally-focused mindset Focus on innovation and career development If you think that you are a qualified candidate for the ULSee team, we want to hear from you. Please send all HR inquiries through our contact us page .",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget Are you ready to make an impact?! For Licensing, Partnerships, and Business inquiries, please contact: Paul Liu ( sales@ulsee.com ) Phone: +886-2-8502-2798, Ext 612 For Technology inquiries, please contact: Chris Yang ( chris@ulsee.com ) China æ­å·žä¿æ–°ç§'技有é™å…¬å¸ æ­å·žå¸'滨江区浦沿街é\"å—环路3760å·902室 Room 902, No. 3760, Puyan Street South Loop, Binjiang District, Hangzhou City, China 310000 Taiwan 3F, No. 28, Lane 128, Jingye 1st Rd. Zhong Shan District, Taipei, Taiwan 10462",
    "This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget This Is A Custom Widget This Sliding Bar can be switched on or off in theme options, and can take any widget you throw at it or even fill it with your custom HTML Code. Its perfect for grabbing the attention of your viewers. Choose between 1, 2, 3 or 4 columns, set the background color, widget divider color, activate transparency, a top border or fully disable it on desktop and mobile. This Is A Custom Widget"
  ]
}