{
  "company": "uniqul.com",
  "dominant_topics": [
    1,
    0,
    -1,
    3
  ],
  "topic_counts": {
    "1": 10,
    "0": 3,
    "-1": 2,
    "3": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.5714285714285714,
    "framing_surveillance": 0.4285714285714285,
    "framing_market": 0.0,
    "num_docs": 16
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 3,
      "1": 10,
      "3": 1
    }
  },
  "sample_docs": [
    "About Uniqul. Our mission at Uniqul™ is to make Face Recognition technology more affordable and easy to integrate. Uniqul API is provided and operated by Dutch company Uniqul Technologies BV and Finnish company Uniqul Oy. Our focus is providing SDKs and API solutions for a range of customers, from small and medium sized businesses and up to Fortune 500 companies. The core idea behind Uniqul. is to provide a Face recognition API which can be integrated in any product within a few hours. Our vision is to simplify the integeration procedure by minimizing the amount of code that developers need to write in order to add Facial Recognition and Liveness Test to existing software or to rapidly build an MVP. To facilitate wide adoption of this technology, we provide flexible white-lable Face Recognition and Deep Learning based technology solutions. Leveraging on years of experience working with Banking industry, our team provides best in class face recognition technology and relevant consulting services. Contact us: info@uniqul.com Amersfoort Utrechtseweg 341, 3818 EL Amersfoort, The Netherlands Helsinki Betonimiehenkuja 3D, 02150 Espoo, Finland Our mission at Uniqul™ is to make Face Recognition technology more affordable and easy to integrate. Uniqul API is provided and operated by Dutch company Uniqul Technologies BV and Finnish company Uniqul Oy. Our focus is providing SDKs and API solutions for a range of customers, from small and medium sized businesses and up to Fortune 500 companies. The core idea behind Uniqul. is to provide a Face recognition API which can be integrated in any product within a few hours. Our vision is to simplify the integeration procedure by minimizing the amount of code that developers need to write in order to add Facial Recognition and Liveness Test to existing software or to rapidly build an MVP. To facilitate wide adoption of this technology, we provide flexible white-lable Face Recognition and Deep Learning based technology solutions. Leveraging on years of experience working with Banking industry, our team provides best in class face recognition technology and relevant consulting services. Utrechtseweg 341, 3818 EL Amersfoort, The Netherlands Betonimiehenkuja 3D, 02150 Espoo, Finland Want to know more or discuss how Uniqul IDV can make your identity process easier? Get In Touch or check out more demos Want to know more or discuss how Uniqul IDV can make your identity process easier? or check out more demos",
    "Login to Developer Account Manage your customer integrations. SIGNUP or LOGIN Signup OR LOGIN Login to Developer Account Manage your customer integrations. Want to know more or discuss how Uniqul IDV can make your identity process easier? Get In Touch or check out more demos Want to know more or discuss how Uniqul IDV can make your identity process easier? or check out more demos",
    "EN FI Face recognition payments Experience the world wallet-free. The way payments should be No cards or phones, just you in the store. Key features: What is Uniqul? Pay by simply being in the store A hassle-free payment experience The process of checkout is simple. You walk through the checkout, and your cloud wallet is shown on a tablet screen. You press ok, and that's it. Behind the scenes, face recognition is performed while you are approaching the checkout point, and the only thing that the system needs is the user's confirmation. This is how we envision convenience. We decided not just to enable people to walk without wallets – but to travel wallet free. The new cloud technologies, which Uniqul is built upon, enable your wallet to be anywhere you need in an instance of a second. Pay by simply being in the store. Anywhere. As featured on How to get Uniqul? Want to try it out in person or install one in your store How to ? Visit a place where they already got Uniqul installed. Come in front of the camera, and press . A glance in the camera, and your Uniqul account is ready to use!Right there you can load balance the way that suits you best: be it banking card or cash. And then – wherever you go - your wallet is already waiting! Cashier will give you a SignUp card. Get online, and set up your existing bank account to load your Uniqul account automatically. Want to have Uniqul in your store? Increased customer shopping experience, reduced transaction times and shorter queues. We built Uniqul with connectivity and performance in mind. It is easy to integrate and get to work with your existing POS system. Simplest Uniqul is just a HD-camera and a pair of tablets. Select configuration that suites your store! Get yours today. Visit Uniqul's Web store *. * Currently available only in Finland. FAQ Frequently asked questions about Uniqul How does Uniqul work? You first have to make an account providing basic information about you and your preferred payment method. After this you will be able to pay within the subscription area of your choice. Shopping will be the same up to the point of payment – where you only click \"OK†on our tablet to confirm the purchase. Where can I register, can I do it online? You can currently only register at Uniqul Points, located in the first places where Uniqul is used. They consist of a tablet and a camera. The System automatically takes your base recognition photo during the registration and then you select a subscription area. After that, you are good to go. Will you share biometric info with third parties or government officials? No. Contact us Uniqul Technologies BV / Uniqul Oy Urmonderbaan 22, 6167RD, Geleen, Netherlands / Betonimiehenkuja 3 D, 02150, Espoo, Finland Press press@uniqul.com Business business@uniqul.com General info@uniqul.com Face recognition payments Experience the world wallet-free. Face recognition payments Experience the world wallet-free. Face recognition payments Experience the world wallet-free. The way payments should be No cards or phones, just you in the store. Key features: The way payments should be No cards or phones, just you in the store. Key features: What is Uniqul? Pay by simply being in the store A hassle-free payment experience The process of checkout is simple. You walk through the checkout, and your cloud wallet is shown on a tablet screen. You press ok, and that's it. Behind the scenes, face recognition is performed while you are approaching the checkout point, and the only thing that the system needs is the user's confirmation. This is how we envision convenience. We decided not just to enable people to walk without wallets – but to travel wallet free. The new cloud technologies, which Uniqul is built upon, enable your wallet to be anywhere you need in an instance of a second. Pay by simply being in the store. Anywhere. Pay by simply being in the store A hassle-free payment experience The process of checkout is simple. You walk through the checkout, and your cloud wallet is shown on a tablet screen. You press ok, and that's it. Behind the scenes, face recognition is performed while you are approaching the checkout point, and the only thing that the system needs is the user's confirmation. This is how we envision convenience. We decided not just to enable people to walk without wallets – but to travel wallet free. The new cloud technologies, which Uniqul is built upon, enable your wallet to be anywhere you need in an instance of a second. Pay by simply being in the store. Anywhere. How to get Uniqul? Want to try it out in person or install one in your store How to ? Visit a place where they already got Uniqul installed. Come in front of the camera, and press . A glance in the camera, and your Uniqul account is ready to use!Right there you can load balance the way that suits you best: be it banking card or cash. And then – wherever you go - your wallet is already waiting! Cashier will give you a SignUp card. Get online, and set up your existing bank account to load your Uniqul account automatically. Want to have Uniqul in your store? Increased customer shopping experience, reduced transaction times and shorter queues. We built Uniqul with connectivity and performance in mind. It is easy to integrate and get to work with your existing POS system. Simplest Uniqul is just a HD-camera and a pair of tablets. Select configuration that suites your store! Get yours today. Visit Uniqul's Web store *. * Currently available only in Finland. How to get Uniqul? Want to try it out in person or install one in your store Want to try it out in person or install one in your store How to ? Visit a place where they already got Uniqul installed. Come in front of the camera, and press . A glance in the camera, and your Uniqul account is ready to use!Right there you can load balance the way that suits you best: be it banking card or cash. And then – wherever you go - your wallet is already waiting! Cashier will give you a SignUp card. Get online, and set up your existing bank account to load your Uniqul account automatically. Want to have Uniqul in your store? Increased customer shopping experience, reduced transaction times and shorter queues. We built Uniqul with connectivity and performance in mind. It is easy to integrate and get to work with your existing POS system. Simplest Uniqul is just a HD-camera and a pair of tablets. Select configuration that suites your store! Get yours today. Visit Uniqul's Web store *. * Currently available only in Finland. FAQ Frequently asked questions about Uniqul How does Uniqul work? You first have to make an account providing basic information about you and your preferred payment method. After this you will be able to pay within the subscription area of your choice. Shopping will be the same up to the point of payment – where you only click \"OK†on our tablet to confirm the purchase. Where can I register, can I do it online? You can currently only register at Uniqul Points, located in the first places where Uniqul is used. They consist of a tablet and a camera. The System automatically takes your base recognition photo during the registration and then you select a subscription area. After that, you are good to go. Will you share biometric info with third parties or government officials? No. Frequently asked questions about Uniqul How does Uniqul work? You first have to make an account providing basic information about you and your preferred payment method. After this you will be able to pay within the subscription area of your choice. Shopping will be the same up to the point of payment – where you only click \"OK†on our tablet to confirm the purchase. Where can I register, can I do it online? You can currently only register at Uniqul Points, located in the first places where Uniqul is used. They consist of a tablet and a camera. The System automatically takes your base recognition photo during the registration and then you select a subscription area. After that, you are good to go. Will you share biometric info with third parties or government officials? Contact us Uniqul Technologies BV / Uniqul Oy Urmonderbaan 22, 6167RD, Geleen, Netherlands / Betonimiehenkuja 3 D, 02150, Espoo, Finland Press press@uniqul.com Business business@uniqul.com General info@uniqul.com Uniqul Technologies BV / Uniqul Oy Urmonderbaan 22, 6167RD, Geleen, Netherlands / Betonimiehenkuja 3 D, 02150, Espoo, Finland",
    "Protect your on-boarding process For every 10 000 customer on-boardings there are about 200 attempts of Identity Theft . Protect your on-boarding process For every 10 000 customer on-boardings there are about 200 attempts of Identity Theft . Uniqul offers a new Liveness Test process: Uniqul offers a new Liveness Test process: Scan Face Say Numbers Move Head Ready Defend against new and emerging attacks Defend against new and emerging attacks Mask and Photo Attacks The simplest of Identity Theft attacks involve use of photographs which are either printed on high-quality printers or 3D printed masks. Uniqul's Liveness Test process is designed to intercept this type of attacks, providing smooth and secure user experience. Video attacks A high-sophistication Identity Theft attack, when attacker has obtained a video of the victim's on-boarding process. This type of attacks happen particularly to well-off individuals who are some of your most valuable customers. Uniqul has a solution to intercept these kind of attacks, preventing unnecessary litigation. Deep-Fake Attacks The most sophisticated type of Identity Theft attack, is the one which uses an engineered video of a user performing a Identity Verification procedure. These attacks are particularly difficult to detect due to an emerging technology of Video Deep-Fakes. Uniqul has a solution which allows to intercept these kind of attacks on on-boarding process, preventing litigation related to money laundering. Mask and Photo Attacks The simplest of Identity Theft attacks involve use of photographs which are either printed on high-quality printers or 3D printed masks. Uniqul's Liveness Test process is designed to intercept this type of attacks, providing smooth and secure user experience. Mask and Photo Attacks The simplest of Identity Theft attacks involve use of photographs which are either printed on high-quality printers or 3D printed masks. Uniqul's Liveness Test process is designed to intercept this type of attacks, providing smooth and secure user experience. Video attacks A high-sophistication Identity Theft attack, when attacker has obtained a video of the victim's on-boarding process. This type of attacks happen particularly to well-off individuals who are some of your most valuable customers. Uniqul has a solution to intercept these kind of attacks, preventing unnecessary litigation. A high-sophistication Identity Theft attack, when attacker has obtained a video of the victim's on-boarding process. This type of attacks happen particularly to well-off individuals who are some of your most valuable customers. Uniqul has a solution to intercept these kind of attacks, preventing unnecessary litigation. Deep-Fake Attacks The most sophisticated type of Identity Theft attack, is the one which uses an engineered video of a user performing a Identity Verification procedure. These attacks are particularly difficult to detect due to an emerging technology of Video Deep-Fakes. Uniqul has a solution which allows to intercept these kind of attacks on on-boarding process, preventing litigation related to money laundering. The most sophisticated type of Identity Theft attack, is the one which uses an engineered video of a user performing a Identity Verification procedure. These attacks are particularly difficult to detect due to an emerging technology of Video Deep-Fakes. Uniqul has a solution which allows to intercept these kind of attacks on on-boarding process, preventing litigation related to money laundering. Want to know more or discuss how Uniqul IDV can make your identity process easier? Get In Touch or check out more demos Want to know more or discuss how Uniqul IDV can make your identity process easier? or check out more demos",
    "FaceFalcon™ Biometric Document verification process Scan Passport Read NFC Cryptographic checks Ready FaceFalcon™ Biometric Document verification process Did you know what nearly 92% of all smartphones globally already have NFC? NFC reading is the fastest growing standard in the mobile. The vast majority of Android and iOS devices have NFC-reading function, which enables them to act as a secure Biometric Passport or ID reading devices. All your most valuable customers already have an NFC device and Biometric passport. Make a move to meet their demands with FaceFalcon™ IDV. Did you know what nearly 92% of all smartphones globally already have NFC? NFC reading is the fastest growing standard in the mobile. The vast majority of Android and iOS devices have NFC-reading function, which enables them to act as a secure Biometric Passport or ID reading devices. All your most valuable customers already have an NFC device and Biometric passport. Make a move to meet their demands with FaceFalcon™ IDV. Learn how NFC can improve on-boarding process. Learn how NFC can improve on-boarding process. Cryptographic Checks New Biometric Passport or ID-document provides higher degree of security through implementing an NFC-chip. This chip, typically compliant with ISO/IEC 14443 standard, holds the customer biometric data in digital and encrypted format. FaceFalcon™ IDV has a special module to check the cryptographic validity of the chip using Public Key Infrastructure (PKI). Fast Scan on Mobile NFC-scanning makes users feel that with Your solution, they are stepping into a new digital age. NFC-scan takes only about 5 seconds, and feels both easy to do and secure. Here at Uniqul, we have focused on quality and reliability of NFC scan. High-Definition Photograph Scanning an NFC-enabled biometric ID document allows to retrieve a high resolution of the user's photograph. This can ensure fast and accurate Facial recognition and Liveness check process. Cryptographic Checks New Biometric Passport or ID-document provides higher degree of security through implementing an NFC-chip. This chip, typically compliant with ISO/IEC 14443 standard, holds the customer biometric data in digital and encrypted format. FaceFalcon™ IDV has a special module to check the cryptographic validity of the chip using Public Key Infrastructure (PKI). Biometric Passport or ID-document provides higher degree of security through implementing an NFC-chip. This chip, typically compliant with ISO/IEC 14443 standard, holds the customer biometric data in digital and encrypted format. FaceFalcon™ IDV has a special module to check the cryptographic validity of the chip using Public Key Infrastructure (PKI). Fast Scan on Mobile NFC-scanning makes users feel that with Your solution, they are stepping into a new digital age. NFC-scan takes only about 5 seconds, and feels both easy to do and secure. Here at Uniqul, we have focused on quality and reliability of NFC scan. Fast Scan on Mobile NFC-scanning makes users feel that with Your solution, they are stepping into a new digital age. NFC-scan takes only about 5 seconds, and feels both easy to do and secure. Here at Uniqul, we have focused on quality and reliability of NFC scan. High-Definition Photograph Scanning an NFC-enabled biometric ID document allows to retrieve a high resolution of the user's photograph. This can ensure fast and accurate Facial recognition and Liveness check process. Scanning an NFC-enabled biometric ID document allows to retrieve a high resolution of the user's photograph. This can ensure fast and accurate Facial recognition and Liveness check process. Want to know more or discuss how AI can make your onboarding process easier? Get In Touch or check out more demos Want to know more or discuss how AI can make your onboarding process easier? or check out more demos"
  ]
}