{
  "company": "us.getcubo.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 21
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 21
    }
  },
  "sample_docs": [
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. Free Shipping 1 Year Warranty 45-Day Money Back CuboAi Smart Health Bundle $459 $499 The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. Included: CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad CuboAi Smart Temp Floor Stand Crib Mount Mobile Stand 1 year of CuboAi Premium included. FREE! Free Shipping 1 Year Warranty 45-Day Money Back Payment methods More information Includes CuboAi Plus 3-Stand Set, the Sleep Sensor Pad, and our ALL NEW Smart Temp. 1 year of CuboAi Premium included. FREE! 1. For all orders placed on the CuboAi official website, standard shipping will take 3 to 10 business days. However, it might take up to 14 business days in some areas due to reasons beyond our control (e.g. courier's delivery schedules, routing, weather, road shut-downs, etc.) 2. The 3-Stand Set comes with a Mobile Stand, a Crib Mount and a Floor Stand (with a set of shared stand components between the Crib Mount and the Floor Stand). To create a complete Crib Mount set, attach the Crib Mount to the shared stand. To create a complete Floor Stand set, swap out the Crib Mount that's attached to the shared stand, and replace it with the floor base. 3. Stable Wi-Fi connection is required. We recommend Wi-Fi download/upload speed to be at least 5Mbps. 4. Smartphone is required. CuboAi App is available for the iOS and Android system. Mobile device must be iOS 14/Android 9.0 or newer. 5. CuboAi Sleep Sensor Pad must pair with a CuboAi Plus Smart Baby Monitor. 6. CuboAi Sleep Sensor Pad should be placed in the middle of the crib under the mattress. 7. The thickness of the mattress should be between 2.36\" - 5.12\" / 6- 13cm for optimal accuracy. For the best functionality, these mattress types work better than others: Spring Based, Coir Based, Spring/Coir Combination. For other types, please contact customer service (support@cuboai.com) for more information. 8. CuboAi Sleep Sensor Pad is a product designed to help you understand your baby's breathing motion patterns through continuous data collection and analysis. It is not a medical device and is not intended to diagnose, treat or cure any disease or any other conditions, including but not limited to Sudden Infant Death Syndrome (SIDS). False readings about your baby's breathing motion patterns are potential risks of CuboAi Sleep Sensor Pad. CuboAi Sleep Sensor Pad should not be a replacement for the care of an adult or medical device of any kind. 9. Smart Temp is FDA cleared. 10. For stable temperature reading, always keep Smart Temp within 5 meters (16.4 feet) of the Smart Baby Monitor. 11. Smart Temp Tape is for one-time use only. 12. Smart Temp's charger uses rechargeable lithium-ion batteries. 13. We do not accept returns on our medical devices to protect our customers' health and safety. For return eligibility, products must be unused, sealed, and, if applicable, with the outer plastic film intact. 14. If you need to return this bundle, please make sure all items are returned together. 15. International transaction fees may apply. Our parenting-focused features reduce parental anxiety by 78% Safety Sleep Memories See how to set up the Smart Health Bundle Add-Ons 3-Stand Set How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health CuboAi Smart Baby Monitor Traditional Baby Monitors Safety Covered-Face & Rollover Detection Breathing Motion Detection* Sleep Sleep Analytics Built-In Lullabies Health Cough Detection Continuous Body Temperature Detection* Memories Daily Highlights 18-Hr Playback with Event Tags Reassurance Picture-in-Picture Temperature and Humidity Alerts Security CTIA Cybersecurity Certified Family Sharing Who's Online & Connection History *Additional add-on products required 4.4/5 (2,985) Making parents' lives easier Influencers Amazon reviews Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. RYRY Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! Lerunia The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Jamie Mather Rebekah Hambley @mrs.hambley Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" Karlyn Tawar @houseoftawar The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! Elena Gant So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. Beth Grace Moore @bethgracemoore [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details All features Specs Frequently Asked Questions 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. View all Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. CuboAi Smart Health Bundle The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad 1 year of CuboAi Premium included. FREE! Our parenting-focused features reduce parental anxiety by 78% Safety Sleep Memories Our parenting-focused features reduce parental anxiety by 78% See how to set up the Smart Health Bundle How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health CuboAi Smart Baby Monitor Traditional Baby Monitors Safety Covered-Face & Rollover Detection Breathing Motion Detection* Sleep Sleep Analytics Built-In Lullabies Health Cough Detection Continuous Body Temperature Detection* Memories Daily Highlights 18-Hr Playback with Event Tags Reassurance Picture-in-Picture Temperature and Humidity Alerts Security CTIA Cybersecurity Certified Family Sharing Who's Online & Connection History *Additional add-on products required How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health Covered-Face & Rollover Detection Continuous Body Temperature Detection* 18-Hr Playback with Event Tags Temperature and Humidity Alerts Who's Online & Connection History *Additional add-on products required Making parents' lives easier Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Help your baby grow with the best support Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. CuboAi Smart Baby Monitor (Gen 3) [Special Purchase Link] $359.00 Experience unparalleled peace of mind with CuboAi, our smartest AI-powered baby monitor and app. Stay connected to your baby in crystal-clear HD video from anywhere, with advanced safety features and CTIA cybersecurity certification ensuring a secure connection. CuboAi Smart Baby Monitor (Gen 3) [Special Purchase Link] Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Safety Bundle $419 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Safety Bundle Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. CuboAi Extended Warranty - 6 month $24.90 (a) Purchase Eligibility: *To be eligible for the extended warranty service, the purchase of a new product must be completed within two months prior to the expiration of the original warranty. (b) Applicable Scope: CuboAi provides the extended warranty service exclusively in specific areas. In the event that customers outside these specific areas apply for the extended warranty service, CuboAi reserves the right to determine whether to provide the service. (c) Applicable Products: The extended warranty service is solely applicable to the Baby Monitor included in the new product package. (d) Usage Restrictions: Once the purchase of the extended warranty is completed, the extended warranty service cannot be canceled or transferred to another Baby Monitor. Customers are permitted to purchase the extended warranty service once for the same Baby Monitor. If ineligible, the order will be automatically canceled and refunded. If your order number cannot be provided for verification, the warranty for your baby monitor will be determined based on the manufacture date. (e) Usage Conditions: The extended warranty service must be used in compliance with the applicable of the original warranty . Following a successful purchase of the extended warranty, customers are required to submit an electronic warranty form as proof. Any revisions to the extended warranty price and conditions will be promptly announced on the official CuboAi website without notice. CuboAi reserves the right to modify or terminate the sale of the extended warranty. *New products: CuboAi Smart Health Bundle / CuboAi Sleep Safety Bundle / CuboAi Smart Baby Monitor - 3-Stand Set / CuboAi Smart Baby Monitor - Wall Mount Set *Specific areas: Taiwan/Hong Kong/Macao/United States/Canada/Australia/Japan Note: 1. To activate the service after purchase, please contact CuboAi support team at support@getcubo.com/Facebook Messenger/in-app chat to provide order ID, CuboAi App account email , and the camera's serial number . 2. If you wish to purchase CuboAi Extend Warranty for multiple cameras, please place another order for each device respectively. 3. Our return policy does not apply to this service (non-physical product). Once the order is placed, customers won't be eligible for refund. *The serial number, which starts with CB, can be found on the bottom of the camera. CuboAi Extended Warranty - 6 month *To be eligible for the extended warranty service, the purchase of a new product must be completed within two months prior to the expiration of the original warranty. CuboAi provides the extended warranty service exclusively in specific areas. In the event that customers outside these specific areas apply for the extended warranty service, CuboAi reserves the right to determine whether to provide the service. The extended warranty service is solely applicable to the Baby Monitor included in the new product package. Once the purchase of the extended warranty is completed, the extended warranty service cannot be canceled or transferred to another Baby Monitor. Customers are permitted to purchase the extended warranty service once for the same Baby Monitor. If ineligible, the order will be automatically canceled and refunded. If your order number cannot be provided for verification, the warranty for your baby monitor will be determined based on the manufacture date. The extended warranty service must be used in compliance with the applicable of the original warranty . Following a successful purchase of the extended warranty, customers are required to submit an electronic warranty form as proof. Any revisions to the extended warranty price and conditions will be promptly announced on the official CuboAi website without notice. CuboAi reserves the right to modify or terminate the sale of the extended warranty. *New products: CuboAi Smart Health Bundle / CuboAi Sleep Safety Bundle / CuboAi Smart Baby Monitor - 3-Stand Set / CuboAi Smart Baby Monitor - Wall Mount Set *Specific areas: Taiwan/Hong Kong/Macao/United States/Canada/Australia/Japan Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need Sales End in 0 Days 0 Hrs 0 Mins 0 Secs 2023 Best of The Bump Awards Winner - BEST BABY MONITOR! Free Shipping 1 Year Warranty 45-Day Money Back CuboAi Smart Health Bundle $329 $419 The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. Included: CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad CuboAi Smart Temp Floor Stand Crib Mount Mobile Stand 1 year of CuboAi Premium included. FREE! Free Shipping 1 Year Warranty 45-Day Money Back Payment methods More information Includes CuboAi Plus 3-Stand Set, the Sleep Sensor Pad, and our ALL NEW Smart Temp. 1 year of CuboAi Premium included. FREE! 1. For all orders placed on the CuboAi official website, standard shipping will take 3 to 10 business days. However, it might take up to 14 business days in some areas due to reasons beyond our control (e.g. courier's delivery schedules, routing, weather, road shut-downs, etc.) 2. The 3-Stand Set comes with a Mobile Stand, a Crib Mount and a Floor Stand (with a set of shared stand components between the Crib Mount and the Floor Stand). To create a complete Crib Mount set, attach the Crib Mount to the shared stand. To create a complete Floor Stand set, swap out the Crib Mount that's attached to the shared stand, and replace it with the floor base. 3. Stable Wi-Fi connection is required. We recommend Wi-Fi download/upload speed to be at least 5Mbps. 4. Smartphone is required. CuboAi App is available for the iOS and Android system. Mobile device must be iOS 14/Android 9.0 or newer. 5. CuboAi Sleep Sensor Pad must pair with a CuboAi Plus Smart Baby Monitor. 6. CuboAi Sleep Sensor Pad should be placed in the middle of the crib under the mattress. 7. The thickness of the mattress should be between 2.36\" - 5.12\" / 6- 13cm for optimal accuracy. For the best functionality, these mattress types work better than others: Spring Based, Coir Based, Spring/Coir Combination. For other types, please contact customer service (support@cuboai.com) for more information. 8. CuboAi Sleep Sensor Pad is a product designed to help you understand your baby's breathing motion patterns through continuous data collection and analysis. It is not a medical device and is not intended to diagnose, treat or cure any disease or any other conditions, including but not limited to Sudden Infant Death Syndrome (SIDS). False readings about your baby's breathing motion patterns are potential risks of CuboAi Sleep Sensor Pad. CuboAi Sleep Sensor Pad should not be a replacement for the care of an adult or medical device of any kind. 9. Smart Temp is FDA cleared. 10. For stable temperature reading, always keep Smart Temp within 5 meters (16.4 feet) of the Smart Baby Monitor. 11. Smart Temp Tape is for one-time use only. 12. Smart Temp's charger uses rechargeable lithium-ion batteries. 13. We do not accept returns on our medical devices to protect our customers' health and safety. For return eligibility, products must be unused, sealed, and, if applicable, with the outer plastic film intact. 14. If you need to return this bundle, please make sure all items are returned together. 15. International transaction fees may apply. See what we can do for your family Safety Sleep Memories See how to set up the Smart Health Bundle Add-Ons 3-Stand Set How our night vision compares More comparisons CuboAi Smart Baby Monitor Other Smart Baby Monitors Traditional Baby Monitors Exclusive Features AI Covered-Face & Rollover Detection Breathing Motion Detection with AI Mode Cough Detection Body Temperature Detection Body Temperature (90-Day History)* High Accuracy AI Detection Music Therapist Playlist AI Lullaby Schedule 18-Hr Playback with Event Tags Who's Online and Connection History Family Sharing (8 Users) Standout Features True Cry Detection Few Auto Photo Capture Few Sleep Analytics Few Danger Zone Detection Few Lullabies Few Multiple Baby Monitor Support Few Customizable Alerts Few *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp 4.4/5 (2,985) Making parents' lives easier Influencers Amazon reviews Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. RYRY Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! Lerunia The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Jamie Mather Rebekah Hambley @mrs.hambley Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" Karlyn Tawar @houseoftawar The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! Elena Gant So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. Beth Grace Moore @bethgracemoore [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details All features Specs App Services Covered-Face & Rollover Detection True Cry Detection Cough Detection Sleep Sensor Pad AI Mode* Body Temperature Detection** Body Temperature History (90 Days Data Storage)** Built-In Lullabies Auto Photo Capture Danger Zone Detection Nighttime Sleep Report Daytime Sleep Report Daily Sleep Summary Daily Highlights 18-Hr Playback + Event Tags View & Video Download View & Video Download Notification Events 7-Day Record View & Video Download View & Video Download Sleep Analytics (Data Storage) 30 Days Unlimited Moments Wall (Data Storage) 30 Days 90 Days Playlist by a Music Therapist 9 songs 28 songs AI Lullaby Schedule 1 schedule 10 schedules Price $4.99/mo or $49.99/yr after end of free year trial $7.99/mo or $79.99/yr after end of 7-day free trial 1 year of FREE CuboAi Care Premium included in your CuboAi Set or Bundle purchase. All purchases of CuboAi Plus Smart Baby Monitor come with one year of CuboAi Care Premium Plan included, which begins when you pair your product to the CuboAi App for the first time. Do not pair your product until you are ready for the subscription period to begin. The subscription period will expire one year after pairing, after which you will no longer be subscribed to a CuboAi Care Plan and will only have access to basic camera functions. You may manually renew your Premium Plan subscription or upgrade to Ultimate Plan at the then-current price (which may vary from the current price). Current prices can be found above. If a customer does not want to use the CuboAi Care Premium included with purchase, the customer can contact customer support to cancel the subscription. However, by canceling the included subscription, the customer is voiding the subscription and will need to pay the then-current price if customer chooses to re-activate. Please note that the \"Free Trial\" eligibility may vary based on the App Store/Google Play policy. *Requires CuboAi Sleep Sensor Pad **Requires CuboAi Smart Temp Show less Frequently Asked Questions 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. View all Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. CuboAi Smart Health Bundle The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad 1 year of CuboAi Premium included. FREE! See what we can do for your family Safety Sleep Memories See what we can do for your family See how to set up the Smart Health Bundle How our night vision compares More comparisons CuboAi Smart Baby Monitor Other Smart Baby Monitors Traditional Baby Monitors Exclusive Features AI Covered-Face & Rollover Detection Breathing Motion Detection with AI Mode Cough Detection Body Temperature Detection Body Temperature (90-Day History)* High Accuracy AI Detection Music Therapist Playlist AI Lullaby Schedule 18-Hr Playback with Event Tags Who's Online and Connection History Family Sharing (8 Users) Standout Features True Cry Detection Few Auto Photo Capture Few Sleep Analytics Few Danger Zone Detection Few Lullabies Few Multiple Baby Monitor Support Few Customizable Alerts Few *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp How our night vision compares *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp Making parents' lives easier Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details 1 year of FREE CuboAi Care Premium included in your CuboAi Set or Bundle purchase. All purchases of CuboAi Plus Smart Baby Monitor come with one year of CuboAi Care Premium Plan included, which begins when you pair your product to the CuboAi App for the first time. Do not pair your product until you are ready for the subscription period to begin. The subscription period will expire one year after pairing, after which you will no longer be subscribed to a CuboAi Care Plan and will only have access to basic camera functions. You may manually renew your Premium Plan subscription or upgrade to Ultimate Plan at the then-current price (which may vary from the current price). Current prices can be found above. If a customer does not want to use the CuboAi Care Premium included with purchase, the customer can contact customer support to cancel the subscription. However, by canceling the included subscription, the customer is voiding the subscription and will need to pay the then-current price if customer chooses to re-activate. Please note that the \"Free Trial\" eligibility may vary based on the App Store/Google Play policy. *Requires CuboAi Sleep Sensor Pad **Requires CuboAi Smart Temp 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Help your baby grow with the best support Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. CuboAi Sleep Safety Bundle (Gen 3) [Special Purchase Link] $499.00 Elevate your baby monitoring experience with our award-winning smart baby monitor bundle. The new Sleep Sensor Pad ensures proactive notifications for critical moments, including covered face detection, rollover alerts, and breathing motions, without the need for wearables. CuboAi Sleep Safety Bundle (Gen 3) [Special Purchase Link] Elevate your baby monitoring experience with our award-winning smart baby monitor bundle. The new Sleep Sensor Pad ensures proactive notifications for critical moments, including covered face detection, rollover alerts, and breathing motions, without the need for wearables. Choosing a selection results in a full page refresh. Opens in a new window."
  ]
}