{
  "company": "us.getcubo.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 9,
    "0": 5
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.9770642201834864,
    "framing_surveillance": 0.0,
    "framing_market": 0.0229357798165137,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 9,
      "0": 5
    }
  },
  "sample_docs": [
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. Free Shipping 1 Year Warranty 45-Day Money Back CuboAi Smart Health Bundle $459 $499 The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. Included: CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad CuboAi Smart Temp Floor Stand Crib Mount Mobile Stand 1 year of CuboAi Premium included. FREE! Free Shipping 1 Year Warranty 45-Day Money Back Payment methods More information Includes CuboAi Plus 3-Stand Set, the Sleep Sensor Pad, and our ALL NEW Smart Temp. 1 year of CuboAi Premium included. FREE! 1. For all orders placed on the CuboAi official website, standard shipping will take 3 to 10 business days. However, it might take up to 14 business days in some areas due to reasons beyond our control (e.g. courier's delivery schedules, routing, weather, road shut-downs, etc.) 2. The 3-Stand Set comes with a Mobile Stand, a Crib Mount and a Floor Stand (with a set of shared stand components between the Crib Mount and the Floor Stand). To create a complete Crib Mount set, attach the Crib Mount to the shared stand. To create a complete Floor Stand set, swap out the Crib Mount that's attached to the shared stand, and replace it with the floor base. 3. Stable Wi-Fi connection is required. We recommend Wi-Fi download/upload speed to be at least 5Mbps. 4. Smartphone is required. CuboAi App is available for the iOS and Android system. Mobile device must be iOS 14/Android 9.0 or newer. 5. CuboAi Sleep Sensor Pad must pair with a CuboAi Plus Smart Baby Monitor. 6. CuboAi Sleep Sensor Pad should be placed in the middle of the crib under the mattress. 7. The thickness of the mattress should be between 2.36\" - 5.12\" / 6- 13cm for optimal accuracy. For the best functionality, these mattress types work better than others: Spring Based, Coir Based, Spring/Coir Combination. For other types, please contact customer service (support@cuboai.com) for more information. 8. CuboAi Sleep Sensor Pad is a product designed to help you understand your baby's breathing motion patterns through continuous data collection and analysis. It is not a medical device and is not intended to diagnose, treat or cure any disease or any other conditions, including but not limited to Sudden Infant Death Syndrome (SIDS). False readings about your baby's breathing motion patterns are potential risks of CuboAi Sleep Sensor Pad. CuboAi Sleep Sensor Pad should not be a replacement for the care of an adult or medical device of any kind. 9. Smart Temp is FDA cleared. 10. For stable temperature reading, always keep Smart Temp within 5 meters (16.4 feet) of the Smart Baby Monitor. 11. Smart Temp Tape is for one-time use only. 12. Smart Temp's charger uses rechargeable lithium-ion batteries. 13. We do not accept returns on our medical devices to protect our customers' health and safety. For return eligibility, products must be unused, sealed, and, if applicable, with the outer plastic film intact. 14. If you need to return this bundle, please make sure all items are returned together. 15. International transaction fees may apply. Our parenting-focused features reduce parental anxiety by 78% Safety Sleep Memories See how to set up the Smart Health Bundle Add-Ons 3-Stand Set How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health CuboAi Smart Baby Monitor Traditional Baby Monitors Safety Covered-Face & Rollover Detection Breathing Motion Detection* Sleep Sleep Analytics Built-In Lullabies Health Cough Detection Continuous Body Temperature Detection* Memories Daily Highlights 18-Hr Playback with Event Tags Reassurance Picture-in-Picture Temperature and Humidity Alerts Security CTIA Cybersecurity Certified Family Sharing Who's Online & Connection History *Additional add-on products required 4.4/5 (2,985) Making parents' lives easier Influencers Amazon reviews Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. RYRY Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! Lerunia The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Jamie Mather Rebekah Hambley @mrs.hambley Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" Karlyn Tawar @houseoftawar The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! Elena Gant So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. Beth Grace Moore @bethgracemoore [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details All features Specs Frequently Asked Questions 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. View all Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. CuboAi Smart Health Bundle The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad 1 year of CuboAi Premium included. FREE! Our parenting-focused features reduce parental anxiety by 78% Safety Sleep Memories Our parenting-focused features reduce parental anxiety by 78% See how to set up the Smart Health Bundle How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health CuboAi Smart Baby Monitor Traditional Baby Monitors Safety Covered-Face & Rollover Detection Breathing Motion Detection* Sleep Sleep Analytics Built-In Lullabies Health Cough Detection Continuous Body Temperature Detection* Memories Daily Highlights 18-Hr Playback with Event Tags Reassurance Picture-in-Picture Temperature and Humidity Alerts Security CTIA Cybersecurity Certified Family Sharing Who's Online & Connection History *Additional add-on products required How our night vision compares Leading AI technology to safeguard your baby's safety, sleep, and health Covered-Face & Rollover Detection Continuous Body Temperature Detection* 18-Hr Playback with Event Tags Temperature and Humidity Alerts Who's Online & Connection History *Additional add-on products required Making parents' lives easier Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Help your baby grow with the best support Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need Sales End in 0 Days 0 Hrs 0 Mins 0 Secs 2023 Best of The Bump Awards Winner - BEST BABY MONITOR! Free Shipping 1 Year Warranty 45-Day Money Back CuboAi Smart Health Bundle $329 $419 The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. Included: CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad CuboAi Smart Temp Floor Stand Crib Mount Mobile Stand 1 year of CuboAi Premium included. FREE! Free Shipping 1 Year Warranty 45-Day Money Back Payment methods More information Includes CuboAi Plus 3-Stand Set, the Sleep Sensor Pad, and our ALL NEW Smart Temp. 1 year of CuboAi Premium included. FREE! 1. For all orders placed on the CuboAi official website, standard shipping will take 3 to 10 business days. However, it might take up to 14 business days in some areas due to reasons beyond our control (e.g. courier's delivery schedules, routing, weather, road shut-downs, etc.) 2. The 3-Stand Set comes with a Mobile Stand, a Crib Mount and a Floor Stand (with a set of shared stand components between the Crib Mount and the Floor Stand). To create a complete Crib Mount set, attach the Crib Mount to the shared stand. To create a complete Floor Stand set, swap out the Crib Mount that's attached to the shared stand, and replace it with the floor base. 3. Stable Wi-Fi connection is required. We recommend Wi-Fi download/upload speed to be at least 5Mbps. 4. Smartphone is required. CuboAi App is available for the iOS and Android system. Mobile device must be iOS 14/Android 9.0 or newer. 5. CuboAi Sleep Sensor Pad must pair with a CuboAi Plus Smart Baby Monitor. 6. CuboAi Sleep Sensor Pad should be placed in the middle of the crib under the mattress. 7. The thickness of the mattress should be between 2.36\" - 5.12\" / 6- 13cm for optimal accuracy. For the best functionality, these mattress types work better than others: Spring Based, Coir Based, Spring/Coir Combination. For other types, please contact customer service (support@cuboai.com) for more information. 8. CuboAi Sleep Sensor Pad is a product designed to help you understand your baby's breathing motion patterns through continuous data collection and analysis. It is not a medical device and is not intended to diagnose, treat or cure any disease or any other conditions, including but not limited to Sudden Infant Death Syndrome (SIDS). False readings about your baby's breathing motion patterns are potential risks of CuboAi Sleep Sensor Pad. CuboAi Sleep Sensor Pad should not be a replacement for the care of an adult or medical device of any kind. 9. Smart Temp is FDA cleared. 10. For stable temperature reading, always keep Smart Temp within 5 meters (16.4 feet) of the Smart Baby Monitor. 11. Smart Temp Tape is for one-time use only. 12. Smart Temp's charger uses rechargeable lithium-ion batteries. 13. We do not accept returns on our medical devices to protect our customers' health and safety. For return eligibility, products must be unused, sealed, and, if applicable, with the outer plastic film intact. 14. If you need to return this bundle, please make sure all items are returned together. 15. International transaction fees may apply. See what we can do for your family Safety Sleep Memories See how to set up the Smart Health Bundle Add-Ons 3-Stand Set How our night vision compares More comparisons CuboAi Smart Baby Monitor Other Smart Baby Monitors Traditional Baby Monitors Exclusive Features AI Covered-Face & Rollover Detection Breathing Motion Detection with AI Mode Cough Detection Body Temperature Detection Body Temperature (90-Day History)* High Accuracy AI Detection Music Therapist Playlist AI Lullaby Schedule 18-Hr Playback with Event Tags Who's Online and Connection History Family Sharing (8 Users) Standout Features True Cry Detection Few Auto Photo Capture Few Sleep Analytics Few Danger Zone Detection Few Lullabies Few Multiple Baby Monitor Support Few Customizable Alerts Few *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp 4.4/5 (2,985) Making parents' lives easier Influencers Amazon reviews Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. RYRY Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! Lerunia The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Jamie Mather Rebekah Hambley @mrs.hambley Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" Karlyn Tawar @houseoftawar The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! Elena Gant So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. Beth Grace Moore @bethgracemoore [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details All features Specs App Services Covered-Face & Rollover Detection True Cry Detection Cough Detection Sleep Sensor Pad AI Mode* Body Temperature Detection** Body Temperature History (90 Days Data Storage)** Built-In Lullabies Auto Photo Capture Danger Zone Detection Nighttime Sleep Report Daytime Sleep Report Daily Sleep Summary Daily Highlights 18-Hr Playback + Event Tags View & Video Download View & Video Download Notification Events 7-Day Record View & Video Download View & Video Download Sleep Analytics (Data Storage) 30 Days Unlimited Moments Wall (Data Storage) 30 Days 90 Days Playlist by a Music Therapist 9 songs 28 songs AI Lullaby Schedule 1 schedule 10 schedules Price $4.99/mo or $49.99/yr after end of free year trial $7.99/mo or $79.99/yr after end of 7-day free trial 1 year of FREE CuboAi Care Premium included in your CuboAi Set or Bundle purchase. All purchases of CuboAi Plus Smart Baby Monitor come with one year of CuboAi Care Premium Plan included, which begins when you pair your product to the CuboAi App for the first time. Do not pair your product until you are ready for the subscription period to begin. The subscription period will expire one year after pairing, after which you will no longer be subscribed to a CuboAi Care Plan and will only have access to basic camera functions. You may manually renew your Premium Plan subscription or upgrade to Ultimate Plan at the then-current price (which may vary from the current price). Current prices can be found above. If a customer does not want to use the CuboAi Care Premium included with purchase, the customer can contact customer support to cancel the subscription. However, by canceling the included subscription, the customer is voiding the subscription and will need to pay the then-current price if customer chooses to re-activate. Please note that the \"Free Trial\" eligibility may vary based on the App Store/Google Play policy. *Requires CuboAi Sleep Sensor Pad **Requires CuboAi Smart Temp Show less Frequently Asked Questions 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. View all Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. CuboAi Smart Health Bundle The NEW Smart Health Bundle offers technology with 3 senses for monitoring Baby's safety to ensure parents don't miss a thing. This bundle includes a CuboAi Smart Baby Monitor (3-Stand Set), a Sleep Sensor Pad, and a Smart Temp. Our Camera AI uses computer vision to watch over Baby, while working with the Sleep Sensor Pad to monitor Baby's breathing motions and the Smart Temp to detect and record Baby's body temperature in real-time. CuboAi Plus Smart Baby Monitor CuboAi Sleep Sensor Pad 1 year of CuboAi Premium included. FREE! See what we can do for your family Safety Sleep Memories See what we can do for your family See how to set up the Smart Health Bundle How our night vision compares More comparisons CuboAi Smart Baby Monitor Other Smart Baby Monitors Traditional Baby Monitors Exclusive Features AI Covered-Face & Rollover Detection Breathing Motion Detection with AI Mode Cough Detection Body Temperature Detection Body Temperature (90-Day History)* High Accuracy AI Detection Music Therapist Playlist AI Lullaby Schedule 18-Hr Playback with Event Tags Who's Online and Connection History Family Sharing (8 Users) Standout Features True Cry Detection Few Auto Photo Capture Few Sleep Analytics Few Danger Zone Detection Few Lullabies Few Multiple Baby Monitor Support Few Customizable Alerts Few *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp How our night vision compares *Breathing Motion Detection w/ AI Mode requires Sleep Sensor Pad *Body Temperature Detection requires Smart Temp Making parents' lives easier Comes with a good quality camera and pad that has breathing motion sensors, when motion is detected the camera will pick up every movement, alerting the parent via the app that there has been motion. What impresses me the most is the accuracy and timing of the camera integrating with the AI pad. Honestly it's a such a relief to being able to track it and also having data that I can share on my pediatrician visits. This is technology at it best to put parents at ease. When it comes to my kids I always want the best. This is giving me huge piece of mind! The pad is fantastic at putting you at ease. You can easily access a live feed off the camera when the pad detects unusual movement and act upon it if needed. For a bundle that gives you peace of mind, I don't really think you can put a price on it. I highly recommend it. Having a baby in and out of the hospital, with 10 different surgeries, feeling like she's just finally out of recovery from one surgery and she's jumping into the next one makes life very stressful! But the @cubobabymonitor has made us feel so much more at ease knowing we can monitor Rosie so closely while she's sleeping. The clear crisp image plus the sleep sensor pad let's us know that Rosie is safe but also alerts us when Rosie needs our help!\" The setup is super simple, all you have to do is slide the sleep sensor pad under the babies mattress and connect it through the app, that's it! With the combined breathing motion sensor pad and the CuboAi monitor I get complete peace of mind and am alerted if I need to check on the baby allowing her to sleep in peace without me bugging her or any intrusive devices attached to her! So my favorite feature of this pad is basically one-time installation. You go put it under baby's mattress and basically forget it. It's super easy and you don't have to set it up every time baby's in the crib...it's going to sense every little motion your baby makes, when the baby yawns, or breathing, or moving and it's going to alert you if something goes wrong. [Sleep Sensor Pad] is non-contact, non-intrusive so it goes where they are already sleeping. You don't need additional wearables for this thing to work and it's kind of a set-it-and-forget-it. You put it under there, and you can just trust that you have all of the analytics that you need about your baby's sleep. Look into the details 1 year of FREE CuboAi Care Premium included in your CuboAi Set or Bundle purchase. All purchases of CuboAi Plus Smart Baby Monitor come with one year of CuboAi Care Premium Plan included, which begins when you pair your product to the CuboAi App for the first time. Do not pair your product until you are ready for the subscription period to begin. The subscription period will expire one year after pairing, after which you will no longer be subscribed to a CuboAi Care Plan and will only have access to basic camera functions. You may manually renew your Premium Plan subscription or upgrade to Ultimate Plan at the then-current price (which may vary from the current price). Current prices can be found above. If a customer does not want to use the CuboAi Care Premium included with purchase, the customer can contact customer support to cancel the subscription. However, by canceling the included subscription, the customer is voiding the subscription and will need to pay the then-current price if customer chooses to re-activate. Please note that the \"Free Trial\" eligibility may vary based on the App Store/Google Play policy. *Requires CuboAi Sleep Sensor Pad **Requires CuboAi Smart Temp 1. Does CuboAi/CuboAi Plus require Wi-Fi? Yes! CuboAi/CuboAi Plus is a Wi-Fi camera and needs to be connected to your home Wi-Fi network to connect to our App and the cloud. This way you can fully utilize our features! 2. How do I set up my CuboAi Plus? Please refer to the Quick Start Guide - 3-Stand Set or Quick Start Guide - Wall Mount Set for assembly instructions. 3. How do Covered-Face and Rollover Alerts work? It's quite simple. Based on Baby's movement, positioning, and face visibility in the crib, CuboAi/CuboAi Plus will determine if an alert needs to be sent. In the event that our camera detects Baby rolling over or Baby's mouth and/or nose is covered, an alert will be sent to parents through our App. 4. Does CuboAi support multiple logins? Of course! CuboAi supports up to 8 concurrent logins. You and your family members can check in on your little one using our App from anywhere, any time –as long as you're connected to the Internet. Additionally, as long as you're logged into our App, all notifications will be sent to your phone. Help your baby grow with the best support Find the product best suited for your family's needs Our Bundles Smart Baby Monitor Add-Ons Shop All Help your baby grow with the best support Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! for our emails to access exclusive CuboAi-only expert advice and offers. Get $10 Off CuboAi Sets & Bundle! Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Subscribe to our mailing list to receive a discount code. CuboAi Sleep Safety Bundle (Gen 3) [Special Purchase Link] $499.00 Elevate your baby monitoring experience with our award-winning smart baby monitor bundle. The new Sleep Sensor Pad ensures proactive notifications for critical moments, including covered face detection, rollover alerts, and breathing motions, without the need for wearables. CuboAi Sleep Safety Bundle (Gen 3) [Special Purchase Link] Elevate your baby monitoring experience with our award-winning smart baby monitor bundle. The new Sleep Sensor Pad ensures proactive notifications for critical moments, including covered face detection, rollover alerts, and breathing motions, without the need for wearables. Choosing a selection results in a full page refresh. Opens in a new window.",
    "Cubo Ai Smart Baby Monitor Regular price $299.00 Nayeli R. This camera has been nothing but amazing! It has met all my needs I was looking for in a baby monitor. I have own this cute baby camera for almost a year now and it still works amazing since day 1. The picture quality is clear day and night. The alerts are spot on when my little one rolls over or cries. I also love how it grows with my child. I would definitely recommend to anyone expecting or is currently looking for a new baby monitor. I promise you won't be disappointed in this camera. It's the cutest and best addition to any nursery. Chi We bought our Cubo from Taiwan originally because of the feature that you can share the account with up to 8 people. This way, our family can see our baby whenever they want. The video quality is quite good and its night vision is perfect. It has many safety monitoring features you can choose to use such as rollover, cover mouth, etc. and you can set up the appropriate sensitivity for crying detection. I like that it uses a cute birdy sound to alert you so that you don't have to constantly watch the video and still know what's going on. One other great feature I love is that it will automatically take photos and videos of our baby so that we can save cute moments on our phone. It also monitors room temperature and humidity quite accurately, which is very useful to keep an optimal sleeping environment for our baby. The other good thing is that they have excellent customer service - always respond to our questions and request quickly. We have been using it for 6-month now and everything runs great. I would recommend it :) Rudy Great baby monitor my wife and I get a lot more rest now knowing cubo is helping us watch our baby the notifications are awesome ! Captures everything so far Zachary R. \"Amazing baby monitor. It gives me the peace of mind knowing that I will be alerted if my baby rolls over onto her stomachs. I love that it can be viewed on my phone and I can watch my baby while I am at work. The app is a bit quirky at times but the devs are working constantly to improve it.\" Apexle \"I didn't think this was all that necessary when we first got it, since we had already received another really well reviewed baby monitor as a gift at a baby shower. That one had its own monitor that would be charged so you could view it real time without having to use your phone. The resolution was a bit low on that one, but we didn't need to use our phone to view it (nor could we since it didn't allow connection to a phone). But other than that, I wouldn't be able to tell what had happened in the past or even in the last few seconds unless I happened to be looking at the monitor at that moment. So when our friend got us this, it seemed redundant at first, but we figured at least we could use it with our phones in case we weren't home (since the other monitor required you to be within a certain distance). But thats where Cubo excels; the software automatically takes photo snapshots and even small video clips and saves them to a temporary cloud which you can download within a certain time. There would be clips and photos back multiple days and you can even scroll through the days (and nights) to see what has happened since then. You'd be surprised at all the little highlights that you might miss while your baby is in the crib. I think that was one of the key points to Cubo, the software that can sometimes accurately detect your baby crying or if its face is covered. Eventually, my wife and I ended up using the Cubo exclusively, and only use the other baby monitor if we needed to use our phones or was busy with something else and didn't want to drain the phone battery. Otherwise, we use Cubo to not only check up on baby but also to see what baby has been doing in the past. We can even share limited functions to family so they can see baby at specific times or we can disable it when we want privacy for our baby., Overall a really great product and they update the software often as well according to community feedback. I hope they continue to update their software and update it often, they've been doing a good job and listnening to customer feedback so far.\" Magnolia I got Cubo through its Indiegogo launch, and we are loving it! The picture quality is amazing, and the photo/video capture feature is just very cool. The app is very user friendly and has a great user interface. Also, the in-app chat feature to get help with any questions or concerns has been quick and very helpful- great service from the Cubo folks!! A couple other advantages I've specifically liked: I can mirror the live feed to my AppleTV, and the notification sounds (birds chirping) are clever but also ensure you hear them since they are different from any other notification sound you might normally have. Plus, the actually hardware (the Cubo bird) is SUPER cute in the nursery! Robert K. W. Cool features, it's nice to receive a notification when something is happening to our 4 months old, even when you're not home ! The camera and mic quality is good, it also records everything so you can go back in time and see what happened. It has a cute night light you can switch on and off in the app that is very well designed and very user friendly! Alexandria I have only had the monitor for about 2 days now and I am in LOVE! I love the many features it has compared to my Motorola non-wifi monitor I had 3 years ago with my first. My favorite feature is that I can use my phone and still have the audio in the background so that if I hear anything I can quickly go right back to the live stream. There is a small delay in audio but almost non existent. Quality is great! If you're looking for a monitor to watch over the crib and not the entire room than this one is perfect! Titzu W. This is a nice product that I like the real time monitor with simply an app. It's really easy to use and control the camera. Setting up crying alert is convinient. However openining up the app make take seconds, and sometimes lost connections depend on internet stability. Better buy this with good internet connection throughout the room you want to monitor. Jordan W. \"We use this product to keep our family in touch. Grandparents can open up the app to check in on the little ones and even talk to them! The app has been intuitive to use and the alerts keep me up to date on baby. Setup was a breeze. We were able to get even some non-tech savvy family connected with almost no issue. There is a small delay in the stream, but it hasn't been a problem for us. Bottom line: This monitor has been great. Highly recommended.\" Sabrina I absolutely love this monitor! It is truly the VIP of baby monitor! It is so easy to install, quick and ready to go. The cute bird like feature fit our room decor. The picture quality is clear both during the day and at night, especially it got the light too. I like that it has the temperature feature gives me piece of mind knowing that it isn't too hot or too cold for my baby. I can see everything on my phone plus the talk back feature is great for our baby boy. I truly love this product!!! Hsu D. I own a Levana baby monitor at home but it doesn't come with built-in wifi functionality so I decided to purchase a Cubo AI to try it out. Love the temperature and humidity detection as my daughter has dry skin and her room is on the cooler side of our house. I turn on the portable heater and humidifier in the room and check the app to find that my daughter is sleeping in the most comfortable room temperature, leaving me a piece of mind throughout the night. The physical set up of the monitor, wifi, and app set up on my phone was super easy. The HD quality of the camera is very clear during the daytime and the night sight is impressive. The motion and sound alerts are super clear without any delay. As a new mom, I wish I had known Cubo AI sooner! :) I highly, HIGHLY recommend this product! You will only need just this ONE Cubo AI and you're good for the rest of the years to go! Devin \"This is a solid 4.5 star monitor. Tl;dr - Get this monitor. You won't be disappointed. Great performance. High quality. Room for improvement on inconsequential items. The monitor itself does everything I expected it to do, so I'd be remiss to give it anything less than 5-stars, but the rest of the experience has some room for improvement (which is to be expected with a product that's relatively new to market.) I already have the Owlet sock (not the cam), so the three key things I wanted: 1. Access via phone/smart device - I didn't want to have to carry around a separate monitor that would have limited range. Yes, this has the security implications of someone hacking your data, but welcome to the 21st century. 2. \"\"Environment info\"\", e.g. temperature - We live in the Pacific Northwest, so winters are cold enough that we need to run the furnace, which has variable performance in different rooms. Even though the thermostat might be set to 72, I want to know that the room is safe/comfy for my baby. 3. Notifications - I figured this would be a no-brainer with any smart-device enable monitor. Apparently not. Cubo hits all of these areas, so there is my 5-star satisfaction. Now, more details on the good: - Video quality: I'm able to zoom in and get all the details I'd expect. - App performance: I typically only have a .5 second lag on the live video stream, and notifications (baby crying, potential face cover) are within 1-2 seconds. Given I'm getting this for safety reasons (knowing if something is wrong), this is crucial. Other smart devices I have in my house have a 5-20 second delay, so I'm impressed by how seamless Cubo's notifications are. - Versatility: The fact that this comes with three different \"\"mounting\"\" options (floor stand, crib mount, mobile stand) was one of the contributing factors of me getting a Cubo over the Nanit. More on that below. I love the idea that I can use this well after my child is out of their crib. - Covered face/rollover detection: From what I understand, this is the only unit that does this. I've only receive a couple of these notifications, and while the baby wasn't actually in direct harm, they definitely had turned over enough that I was glad to be alerted. - Customer service: I ordered this on Amazon before their big \"\"US Amazon launch\"\", which had a coupon associated with it. A little disappointed that I purchased while the coupon was being advertised, but before it was active, I reached out and they were very responsive and made sure to do right by me as a customer. Very impressed. Also, there is a good community on Facebook where other users discuss success stories/questions, which is nice. Neither good nor bad: - Number of notifications: Again, comparing to other smart devices I have in my house (e.g. Ring doorbell, Wyze cam, etc), I'm used to \"\"false positives\"\", i.e. alerts that are technically accurate but don't require my attention. So far, all the alerts I get from Cubo are accurate (baby is crying, baby's face might be covered, can't detect baby). However, more often than not, I'm aware because I'm in the room. The alerts are customizable (you can set what you want to be alerted for), but I'd rather be able to toggle notifications on/off entirely. If the baby is in the crib and I'm in the room folding laundry, I don't want notifications. If I'm watching a movie, I want all the notifications. For context, I've received 83 notifications in the past 36 hours. To improve: - The physical setup: Specifically, setting up the floor stand required using more force to get the pieces together than I'd like (it made me feel like I was doing something wrong or was about to break something). You have to feed the cord through each piece a little bit at a time in order for the pieces to fit together, and the cord didn't really slide well, making me think it wasn't supposed to move. The unit felt sturdy afterwards. - Packaging: Admittedly I've become a little spoiled in this area with other hi-tech gadgets and their clean unpacking experience. This wasn't terrible, but my biggest complaint is that there are three mounting options (crib mount, floor stand, mobile mount - which is actually a great thing!), but there isn't a nice way to store the other two while not in use. The initial box is far too large to just tuck away in a closet. I'd love some way to either nest the yet-to-be-used pieces and/or a simple holding case that you can tuck away until you need them. - UX of the app: As stated above, the performance of the app is incredible. However, the layout (UI) is not intuitive, and the overall UX has too much going on when you first open the app. The random photos it takes are fun, but are just that...random. Maybe 1 in 10 is one I'd like to keep. Several are just the back of my wife's head as she's either getting baby out of the bassinet or putting him down. Overall, I would still recommend this over other monitors I've researched (e.g. Owlet cam, nanit plus, miku, etc). This doesn't have the baby health vitals, which would be a huge plus (I also use the Owlet sock to get heart rate and O2), and between those two I have total peace of mind. I opted for Cubo over Nanit plus (which gives the breathing rate) mainly because of cost and versatility. Cubo was nearly half as much as the Nanit plus, and the Nanit was not as versatile as the Cubo (i.e. you're not able to move the Nanit around after you mount it). I opted for Cubo over the Owlet cam (despite having the sock) because Owlet cam didn't give notifications on the phone (and also, cost).\" Jessica C. My husband came to be while still pregnant and mentioned this Kickstarter for a baby cam and at first I was hesitant but after seeing the video and all the features I knew this would be perfect. I suffer from anxiety and being a new mom is really scary so for me to have cubo notify me for dangers really sets my anxiety at ease and I can sleep through the night knowing she's okay. I'd highly recommend this product for not only a baby monitor but it grows with your child later on in life so you can always know they are safe Herman l. Extremely happy with Cubo. So far the most appreciated feature Cubo has is the sharing function. I have my Dad in South Africa connected to Cubo too, so he's able to get daily snaps, and live video and see his granddaughter grow up in Canada. Little things like this make Cubo an unbelievable addition to the family. No issues so far. The two way audio is a little soft when talking to your phone, but Cubo has listened to customers remarks on this and have said they are working on improving this. Great to see a company actually take the time to read its customers input and make something positive of it. Keep up the good work. Ariel C. My favorite part about Cubo is being able to look back at what happen while my son was sleeping with the 18 hour playback. I also love being able to check on him during the day for naptime while I am at work. He wakes up very easily when I walk into the room, so having this camera has really made a huge difference. Chelsea M. Let me just say that I couldn't be happier with the overall design, quality and customer service behind this sweet little crib cam. It's so easy to call it the Cubo Crib cam, but it is that and so much more! It is an absolute life changer. I love that it grows with my baby and that the baby monitor mount includes a stand for baby monitor. Whether you opt to use the shelf stand, crib stand or floor stand, it's so easy to switch! How many other smart baby monitors do you know to offer so many versatile options, in just the stand preference? Kristin M. Cubo is already a helpful part of our family. We use a lot of passive, eco-friendly heating and cooling at home. But babies aren't as comfortable when it's hot or cold as us adults, so Cubo's temperature settings remind us when the bedroom is outside what's a safe range for our little one. Cubo's face detection AI has warned me when my cat tries to get in the baby's bassinet. That's already been hugely important in our day to day life since cats can choose to snuggle close like an aggressively cuddly baby blanket. Shyam A. Ever since we started using our Cubo, we have been so relaxed in our lives! Our baby has started to roll over and Cubo's cry detection and the roll over alerts have helped us so many times! We are now able to act whenever we get alerts and Cubo has prevented our baby from getting into any difficult situations. The 1080p HD night vision video and the color video are super crisp. Lily M. I am very glad that I have invested in Cubo AI. Because of the alerts I do not need to be glued to the baby monitor all the time, giving me my sleep and peace of mind back! I like that Cubo AI provides different stand options and the camera is easily detachable and connects to the wifi easily. Benedict N. It's nice to know that we'll receive notifications if she's crying or if the temperature or humidity is outside of the ranges we set, so that we can turn on the AC or open some windows for her. We really like that there is no red light to distract her in the dark like all of the other cameras out there. The customer service has been amazing. If there is a problem you can easily initiate a ticket within the app and they respond very quickly. Leo C. Unboxing and setup only took me about 15 minutes. After I played with the app for 5 minutes, I discovered the share feature to allow me to give access to my wife and other family members. That night, I got feedback from people living in other states or even other countries, commenting on the clear video feed - even in the dark! Everyone thought the auto captured pictures were also a nice touch. Overall, Cubo is a really great baby monitor that I would definitely recommend, not only as an engineer, but also a newbie parent. Scotty W. After I looked into the specs and design and compared it to other monitors on the market. It didn't take me long at all to realize that the creators of Cubo had thought about every detail including the much hyped about design, which the baby will love. While the other AI features work extremely well, the feature we like most is the night light. Being able to switch this on remotely from our phones makes sure we get to baby without tripping over. Martin H. Just getting to grips with it before the little man arrives! But great piece of kit! Josh H. Awesome monitor. Can not fault it and I'm sure more features will be added Torrey S. My husband works out of town 2 or 3 weeks out of the month, so the ability to download the app and login/access live feed anytime is a blessing! Oh, and the two way audio... has us swooning! Babies grow so fast, and parents love to watch their babies sleep...now my husband doesn't miss out on these precious moments and he can say goodnight while she's laying in her crib! Wendy W. Cubo AI Smart Baby Monitor truly made my new motherhood easier. Am very thankful to have found Cubo AI and be able to use it as a pilot user... So far, no complaints or major breakdowns.. I can say the team is doing a great job to maintain Cubo AI to be stable. Caroline M. This monitor is awesome!!!! It came the weekend after we came home with our baby. It's incredibly convenient, using its nightlight instead of having to turn on a light or my phone to check on her. It's taken great pictures & is incredibly reliable. Highly recommend it!!! Chris G. I can't recommend this monitor enough. The quality from the build through to the camera image quality is fantastic and the features are so well thought out. I know also as time goes on it will keep improving with updates. The whole Cubo team have been fantastic with customer support and I'm so glad I've backed such a great team. Anyone in the market for a baby monitor would be mad not to get Cubo. ⭐️⭐️⭐️⭐️ Kimmi S. Cubo is amazing! Thanks to covered face alerts my anxiety is at ease. I love being able to check on my sweet baby during sleep time- no matter where I am-especially with the playback feature! The built in night light is perfect. I LOVE that Cubo captures moments and sweet pictures. I will never try another monitor! Thank you Cubo!! Jaidee S. We love the Cubo especially being able to capture natural moments of our daughter growing up so fast. The moments of relaxation by having a camera to watch her from a distance. Connecting her with her grandparents in London, Uk and the can see her whatever time they wish. She loves looking at the bird she loves waving at it and smiling when ever she wakes up and see's it we have the proof in the Cubo recordings. There are tiny issues but Cubo are quick to find out and respond to you. Thanks team Cubo you definitely have Sage as a ambassador of your brand! If only she can talk Cubo Ai Smart Baby Monitor",
    "Cart ( 0 ) You may also need CuboAi Sleep Sensor Pad $129 CuboAi Smart Temp $69 Subtotal $0 Cart ( 0 ) You may also need Sales End in 0 Days 0 Hrs 0 Mins 0 Secs Fall into Savings with CuboAi. Save Big on Baby Monitors Today! Cubo Ai Press Mentions It's not just parents that can't stop talking about Cubo Ai! See what reviewers say about us here: Best Baby Monitors to Keep a Watchful Eye on Your Little One (2022) Most Secure Baby Monitor – Cubo Ai Plus \" The Cubo AI is an absolute stand-out when it comes to security. It's cybersecurity-certified by the Cellular Telecommunications Industry Association (CTIA), giving you peace of mind that your data is just as safe and secure as your sleeping baby. Strong features like real-time alerts, razor-sharp HD images and built-in sleep-analytics tracking make this one of our favorite top-rated baby monitors on the market.\" The Best Baby MonitorsTo Give You Peace Of Mind Through The Night (2022) Best Baby Monitor for Three Rooms – Cubo Ai Plus \"The smart baby monitor category has become increasingly crowded with solid options, and the Cubo Ai is at the top of the list. Like others, it has extensive sleep analytics, but a unique feature is the covered face and rollover alert, which means you'll be notified immediately if your baby's face is covered or they're lying face down. Parents rave about Cubo's daily reports, high definition picture clarity for both day and night, night light, two-way audio and temperature and humidity detection. (And we're partial to the cute bird shape.) Even better, if you've got multiple children or just want to monitor several rooms: You can pair up to five cameras to one account, switch between feeds and receive alerts from multiple cameras on the same mobile device.\" The Best Baby Monitors to Buy (2021) Posterity & Peace of Mind – Cubo Ai Plus \"As its name suggests, the Cubo Ai monitors your baby with more than just a video feed: It uses artificial intelligence to alert you when your baby rolls over or has their face covered. The camera is bird-shaped, with various cheeps and chirps when the device boots up or pairs with your Wi-Fi, and the whole aesthetic gives the product a bespoke feel. This monitor would blend right into a well-designed nursery, nixing the whole surveillance vibe that most cameras bring. Where the Cubo Ai really stands out is in its photo and video capture. The app will automatically save photos to your \"Moments Wall\" every once in a while, and you can manually save your own photos or videos, too. And with 18-hour video playback, you can scroll back in time to see what happened at any point in the night.\" The Best Baby Products for New Parents of 2021 Best overall – Cubo Ai Plus \"While above-crib monitors aren't necessarily revolutionary, the Cubo's video quality is: The 1080p HD camera provides flawless, jaw-dropping clarity—including exceptional night vision quality—that was superior to any other camera we tried, bar none.\" The Cubo AI baby monitor is a godsend for parents \"While any video baby monitor will allow you to hear the baby, the camera inside the Cubo actually knows what it's seeing. Using face detection, it can detect if the baby's face is covered or if the baby rolled over, sending an alert to the smartphone that, in keeping with the design of the camera itself, also sounds like a bird.\" The best baby monitors in 2020 \"The Cubo Ai Plus […] is designed to give you support from the newborn stage up until your child is five years old and beyond should you wish.\" \"What makes this baby monitor stand out from the crowd however is its 'danger zone' detection, which comes in useful when you have a curious toddler. This means you can set up a zone in your house – be it the kitchen or stairs – and you will get alerted on your smartphone when your child enters that area.\" Best Smart baby Monitor for Baby's Comfort Says Motherly's co-founder Liz Tenety: \"We also appreciate the temperature readings that help me know if my little one is too hot or just right in his crib—a balance that can be hard to get right, especially as seasons change. The easy app integration makes it simple for you to check baby with your phone without worrying that you'll be out of range. \" Room Ideas that are Cute Enough to Copy \"This Cubo AI Plus camera keeps your baby safe and looks right at home with this bohemian nursery. From the simple, yet whimsical design, to the wood grain detailing, it's the most important addition you'll make.\" The Best Baby Shower Gifts to Buy Now \"There's two way audio, built in lullabies, HD camera, not to mention sleep tracker, humidity and temperature alerts. All synced up and controlled with an app on your phone. Just look at the video . It's extravagant but a game changer. And it looks pretty cute too…\" The Best Baby Monitors Track Every Cry, Snore, And Heartbeat \"Even more next level is the Cubo, which alerts you if your baby's face is covered. Plus, parents can get a rollover alert if your baby gets stuck while, yes, rolling over. It has HD 1080p video, cry detection technology, and video capture. And one bonus is that unlike other monitors, this camera has no distracting light when it's on.\" A smart baby monitor with artificial intelligence to keep you infant safe and sound 24/7. \"In of camera performance, we found Cubo AI smart baby monitor outperformed Nanit's camera in of picture quality. Cubo AI's picture was clearer and more vibrant.\" Cubo AI Sleep Safety Baby Monitor alerts you if your child's face is covered \"You know that \"Back Is Best,\" but it can be hard to ensure your baby stays on their back. And they may not be able to roll over both ways yet. With this smart monitor, you'll know if your baby rolls over. Cubo helps you feel more confident that your baby is sleeping healthily and comfortably. \" The Best Baby Monitors for 2021 Best overall – Cubo Ai Plus \"There's a night light on the top and a built-in speaker at the back for soothing lullabies and two-way audio. And speaking of audio, the sound is crystal-clear. As is the HD image quality, both in the day and night.\" \"The temperature and humidity sensor dongle clips into the power port, which our tester found to be pretty accurate. All in all, this is a solid choice for parents who want crisp video and sound, and to monitor their baby's sleeping habits.\" \"This multi-award winning smart monitor can not only work as a high-tech crib cam with a whole host of incredible smart functions (covered face and roll-over alerts for example), but its multiple stand options mean it can be easily set up in any other room and will notify you if your crawling baby or toddler is entering somewhere they shouldn't be (you can pre-set 'danger zones' ).\" - This little baby monitor is taking reviewers by storm. With the game-changing Face Covered detection and thoughtful additions, people can't stop talking about Cubo Ai! Take yours home today Cubo Ai Press Mentions It's not just parents that can't stop talking about Cubo Ai! See what reviewers say about us here: Best Baby Monitors to Keep a Watchful Eye on Your Little One (2022) Most Secure Baby Monitor – Cubo Ai Plus \" The Cubo AI is an absolute stand-out when it comes to security. It's cybersecurity-certified by the Cellular Telecommunications Industry Association (CTIA), giving you peace of mind that your data is just as safe and secure as your sleeping baby. Strong features like real-time alerts, razor-sharp HD images and built-in sleep-analytics tracking make this one of our favorite top-rated baby monitors on the market.\" The Best Baby MonitorsTo Give You Peace Of Mind Through The Night (2022) Best Baby Monitor for Three Rooms – Cubo Ai Plus \"The smart baby monitor category has become increasingly crowded with solid options, and the Cubo Ai is at the top of the list. Like others, it has extensive sleep analytics, but a unique feature is the covered face and rollover alert, which means you'll be notified immediately if your baby's face is covered or they're lying face down. Parents rave about Cubo's daily reports, high definition picture clarity for both day and night, night light, two-way audio and temperature and humidity detection. (And we're partial to the cute bird shape.) Even better, if you've got multiple children or just want to monitor several rooms: You can pair up to five cameras to one account, switch between feeds and receive alerts from multiple cameras on the same mobile device.\" The Best Baby Monitors to Buy (2021) Posterity & Peace of Mind – Cubo Ai Plus \"As its name suggests, the Cubo Ai monitors your baby with more than just a video feed: It uses artificial intelligence to alert you when your baby rolls over or has their face covered. The camera is bird-shaped, with various cheeps and chirps when the device boots up or pairs with your Wi-Fi, and the whole aesthetic gives the product a bespoke feel. This monitor would blend right into a well-designed nursery, nixing the whole surveillance vibe that most cameras bring. Where the Cubo Ai really stands out is in its photo and video capture. The app will automatically save photos to your \"Moments Wall\" every once in a while, and you can manually save your own photos or videos, too. And with 18-hour video playback, you can scroll back in time to see what happened at any point in the night.\" The Best Baby Products for New Parents of 2021 Best overall – Cubo Ai Plus \"While above-crib monitors aren't necessarily revolutionary, the Cubo's video quality is: The 1080p HD camera provides flawless, jaw-dropping clarity—including exceptional night vision quality—that was superior to any other camera we tried, bar none.\" The Cubo AI baby monitor is a godsend for parents \"While any video baby monitor will allow you to hear the baby, the camera inside the Cubo actually knows what it's seeing. Using face detection, it can detect if the baby's face is covered or if the baby rolled over, sending an alert to the smartphone that, in keeping with the design of the camera itself, also sounds like a bird.\" The best baby monitors in 2020 \"The Cubo Ai Plus […] is designed to give you support from the newborn stage up until your child is five years old and beyond should you wish.\" \"What makes this baby monitor stand out from the crowd however is its 'danger zone' detection, which comes in useful when you have a curious toddler. This means you can set up a zone in your house – be it the kitchen or stairs – and you will get alerted on your smartphone when your child enters that area.\" Best Smart baby Monitor for Baby's Comfort Says Motherly's co-founder Liz Tenety: \"We also appreciate the temperature readings that help me know if my little one is too hot or just right in his crib—a balance that can be hard to get right, especially as seasons change. The easy app integration makes it simple for you to check baby with your phone without worrying that you'll be out of range. \" Room Ideas that are Cute Enough to Copy \"This Cubo AI Plus camera keeps your baby safe and looks right at home with this bohemian nursery. From the simple, yet whimsical design, to the wood grain detailing, it's the most important addition you'll make.\" The Best Baby Shower Gifts to Buy Now \"There's two way audio, built in lullabies, HD camera, not to mention sleep tracker, humidity and temperature alerts. All synced up and controlled with an app on your phone. Just look at the video . It's extravagant but a game changer. And it looks pretty cute too…\" The Best Baby Monitors Track Every Cry, Snore, And Heartbeat \"Even more next level is the Cubo, which alerts you if your baby's face is covered. Plus, parents can get a rollover alert if your baby gets stuck while, yes, rolling over. It has HD 1080p video, cry detection technology, and video capture. And one bonus is that unlike other monitors, this camera has no distracting light when it's on.\" A smart baby monitor with artificial intelligence to keep you infant safe and sound 24/7. \"In of camera performance, we found Cubo AI smart baby monitor outperformed Nanit's camera in of picture quality. Cubo AI's picture was clearer and more vibrant.\" Cubo AI Sleep Safety Baby Monitor alerts you if your child's face is covered \"You know that \"Back Is Best,\" but it can be hard to ensure your baby stays on their back. And they may not be able to roll over both ways yet. With this smart monitor, you'll know if your baby rolls over. Cubo helps you feel more confident that your baby is sleeping healthily and comfortably. \" The Best Baby Monitors for 2021 Best overall – Cubo Ai Plus \"There's a night light on the top and a built-in speaker at the back for soothing lullabies and two-way audio. And speaking of audio, the sound is crystal-clear. As is the HD image quality, both in the day and night.\" \"The temperature and humidity sensor dongle clips into the power port, which our tester found to be pretty accurate. All in all, this is a solid choice for parents who want crisp video and sound, and to monitor their baby's sleeping habits.\" \"This multi-award winning smart monitor can not only work as a high-tech crib cam with a whole host of incredible smart functions (covered face and roll-over alerts for example), but its multiple stand options mean it can be easily set up in any other room and will notify you if your crawling baby or toddler is entering somewhere they shouldn't be (you can pre-set 'danger zones' ).\" - This little baby monitor is taking reviewers by storm. With the game-changing Face Covered detection and thoughtful additions, people can't stop talking about Cubo Ai! Take yours home today Cubo Ai Press Mentions It's not just parents that can't stop talking about Cubo Ai! See what reviewers say about us here: Best Baby Monitors to Keep a Watchful Eye on Your Little One (2022) Most Secure Baby Monitor – Cubo Ai Plus The Best Baby MonitorsTo Give You Peace Of Mind Through The Night (2022) Best Baby Monitor for Three Rooms – Cubo Ai Plus The Best Baby Monitors to Buy (2021) Posterity & Peace of Mind – Cubo Ai Plus The Best Baby Products for New Parents of 2021 Best overall – Cubo Ai Plus \"While above-crib monitors aren't necessarily revolutionary, the Cubo's video quality is: The 1080p HD camera provides flawless, jaw-dropping clarity—including exceptional night vision quality—that was superior to any other camera we tried, bar none.\" The Cubo AI baby monitor is a godsend for parents \"While any video baby monitor will allow you to hear the baby, the camera inside the Cubo actually knows what it's seeing. Using face detection, it can detect if the baby's face is covered or if the baby rolled over, sending an alert to the smartphone that, in keeping with the design of the camera itself, also sounds like a bird.\" The best baby monitors in 2020 Best Smart baby Monitor for Baby's Comfort Says Motherly's co-founder Liz Tenety: \"We also appreciate the temperature readings that help me know if my little one is too hot or just right in his crib—a balance that can be hard to get right, especially as seasons change. The easy app integration makes it simple for you to check baby with your phone without worrying that you'll be out of range. \" Room Ideas that are Cute Enough to Copy \"This Cubo AI Plus camera keeps your baby safe and looks right at home with this bohemian nursery. From the simple, yet whimsical design, to the wood grain detailing, it's the most important addition you'll make.\" The Best Baby Shower Gifts to Buy Now \"There's two way audio, built in lullabies, HD camera, not to mention sleep tracker, humidity and temperature alerts. All synced up and controlled with an app on your phone. Just look at the video . It's extravagant but a game changer. And it looks pretty cute too…\" The Best Baby Monitors Track Every Cry, Snore, And Heartbeat \"Even more next level is the Cubo, which alerts you if your baby's face is covered. Plus, parents can get a rollover alert if your baby gets stuck while, yes, rolling over. It has HD 1080p video, cry detection technology, and video capture. And one bonus is that unlike other monitors, this camera has no distracting light when it's on.\" A smart baby monitor with artificial intelligence to keep you infant safe and sound 24/7. \"In of camera performance, we found Cubo AI smart baby monitor outperformed Nanit's camera in of picture quality. Cubo AI's picture was clearer and more vibrant.\" Cubo AI Sleep Safety Baby Monitor alerts you if your child's face is covered \"You know that \"Back Is Best,\" but it can be hard to ensure your baby stays on their back. And they may not be able to roll over both ways yet. With this smart monitor, you'll know if your baby rolls over. Cubo helps you feel more confident that your baby is sleeping healthily and comfortably. \" The Best Baby Monitors for 2021 Best overall – Cubo Ai Plus \"There's a night light on the top and a built-in speaker at the back for soothing lullabies and two-way audio. And speaking of audio, the sound is crystal-clear. As is the HD image quality, both in the day and night.\" \"The temperature and humidity sensor dongle clips into the power port, which our tester found to be pretty accurate. All in all, this is a solid choice for parents who want crisp video and sound, and to monitor their baby's sleeping habits.\" Choosing a selection results in a full page refresh. Opens in a new window."
  ]
}