{
  "company": "vaultvision.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 3
    }
  },
  "sample_docs": [
    "About Vault Contracts - Mansfield Burglar Alarm Company As an award-winning SSAIB (UKAS) accredited company with proven technical and management expertise, our fully screened staff in both engineering and management are based out of our commercial units in Mansfield. We currently support over 3,000 contracted customers which includes our very first domestic customer from 1989 up to our largest blue chip company site covering over 12 acres. Since 1989 we have been installing domestic alarm systems and commercial electronic security systems throughout Nottinghamshire, Derbyshire & South Yorkshire; all meeting Police, Inspectorate & Insurance standards. Our company has been managed over the years to sit above the small intruder alarm installer market. Typically, the \"man in a van\" type of company cannot meet the required standards required by Police & insurance companies. They tend to be under qualified with inadequate insurance cover as only inspectorate approved companies can insure against the industry risks. We remain below the larger national companies who struggle with individual and personal service issues due to their overall size. Quotations meeting EN: 50131 & PD: 6662 are free of charge with no obligation and include the \"Risk Assessment\" required to grade the system prior to producing the System Design Proposal for your consideration. All installations are carried out by our own engineers during normal office hours in a fast and friendly manner with systems issued with a Certificate of Compliance upon completion. Vault Contracts UKAS accreditations © Vault Contracts Ltd | Mansfield Business Centre, Ashfield Avenue, Mansfield, Nottinghamshire. NG18 2AE Registered in England & Wales Company No: 918 416221 | Vat No: 6293391 | SSAIB / UKAS Reg: Derby 017",
    "Alarm Systems | Burglar Alarms | Intruder Alarms Domestic Burglar Alarm Systems For over 21 years our security systems have provided protection against burglary by offering the correct balance between the best possible detection with ease of operation, every installation designed and recognised by Police and Insurance Companies. Our latest system ' Vaultsecure™ ' has been designed for a fast flexible fully wire free installation, unobtrusive and ultra reliable without the normal lifting of carpets and movement of furniture. The system can be easily expanded up to 32 zones if required, this normally enough for the largest property and includes a wide range of detection ranging from pet-tolerant passive infra reds (PIRs), door contacts, shock (Seismic) detection for windows / doors, panic attack (double push) buttons to optical smoke, carbon monoxide and flood detection. Different Intruder Alarm System types are available dependent on the site risk, ranging from the\" Local Alarm System\" which is nothing more than a external sounder alerting neighbours to a full alarm condition (but we need to ask the question \"does anyone take notice these days\"?) to our unique Radio Link signalling system direct to key holders or optional Police Response. Some companies will advise you to install a system complete with voice dialler utilising your telephone line, but again dependent on the risk, could it be easily overcome by a burglar cutting the telephone cables at the property or street or even dialling your telephone number and jamming the line? Our systems normally utilise a low cost secure radio link with broadband or telephone line back-up direct to key holders up to the higher risk sites where our NACOSS Alarm Receiving Centre first confirm the activation prior to dispatching a Level One Police Response. This includes signalling via both a GSM radio link with broadband or telephone line back up for a Police or Fire Brigade Response. The benefit of this type of system is if one signalling path is compromised by a thief the signal is immediately sent to the (ARC) by the other signalling path. Technical false alarms are now a thing of the past with \"Vaultsecure™\" as all systems are now embedded with SIM card interfaces allowing true 24hr remote diagnostics and support through or dedicated support server. The fully managed secure GSM connectivity to our customers allows our technical support staff immediate access to our installed systems throughout the UK. Key holders may control the system and receive tailored information through any text messaging device such as a mobile phone or PDA. This service allows users to: Arm or Disarm the system Bypass specific zone areas Receive a simple text message when the kids are home from school or an elderly relative hasn't moved over a predetermined time window. Request system status (ideal when away on holiday) Monitor mains power failures Remotely control heating and CCTV As an approved company we are required to meet the strict criteria laid down by ACPO (Association of Chief Police Officers). This is not as daunting as is may seem as the both the Police and ourselves are simply filtering out any false alarm signals prior to a \"Level One Police Response\" being actioned by confirming the alarm activation first. On installation completion, your system will be allocated with a Police Unique Reference Number (URN) which is the information required to dispatch the Police Response Officers to any confirmed alarm activation. © Vault Contracts Ltd | Mansfield Business Centre, Ashfield Avenue, Mansfield, Nottinghamshire. NG18 2AE Registered in England & Wales Company No: 918 416221 | Vat No: 6293391 | SSAIB / UKAS Reg: Derby 017",
    "Preventative Maintenance | System Takeovers Service Visits | Preventative Maintenance (Meeting EN: 50131) By the very nature of Intruder alarm systems, annual preventative maintenance should be carried out by an Inspectorate approved alarm company. This is a must in order to meet insurance companies strict & conditions. With over 3,000 systems and a retention rate of over 90% our Inspectorate award winning Annual Preventative Contract Database proves our support and costs. Should you be looking to move away from your current alarm company for whatever reason or just require a service visit with our support, we offer cost effective system takeover options. There are a number of reasons customers wish to move from their original alarm installers, typically some firms are too large to deliver the personal touch promised through to the one man band who cannot cope with the peaks and troughs our business deals with from time to time. Take over method (meeting EN: 50131) An appointment agreed will allow our surveyor to establish visually if the system meets the required industry level. Supply a written quotation requesting the engineering code and any existing paperwork relating to the installation in order to re-commission the system. Our Annual Preventative Maintenance Contract will be offered to you together with our working schedule Contract Acceptance, this required to proceed. Our engineer will arrive on site for a pre-booked appointment in order to thoroughly inspect, test and record the system components and advise of any corrective maintenance recommendations including costs required (you can choose to carry out the recommendations or not). Our database is updated with your system details and keyholders, and a Certificate of Compliance is issued for your Insurance Company. Full no-obligation details are available by calling our support office on 08456 005 009 © Vault Contracts Ltd | Mansfield Business Centre, Ashfield Avenue, Mansfield, Nottinghamshire. NG18 2AE Registered in England & Wales Company No: 918 416221 | Vat No: 6293391 | SSAIB / UKAS Reg: Derby 017",
    "Integrations PLATFORMS APPS FULLY INTEGRATED WITH WEBFLOW Add Authentication to Webflow Easily Instantly add memberships, user signups and logins, and CMS lists based on user. Webflow Marketplace Integration Direct integration and automatic configuration are available from the Vault Vision application on the Webflow Marketplace Simple Authentication Components It has never been easier to add authentication components like auth buttons [Login, Logout, Signup, User Profile], user labels [Email, Name], forms that save user data into the CMS, custom 'Design Templates' based on an authenticated user and their specific CMS data Powerful Webflow CMS Flexiblity and Customization Our Webflow HTML and JavaScript, and consider upgrading to a web browser that supports HTML5 video Our Customers Setting the highest standards for easy, fast & secure authentication Working with our customers makes it possible to have the widest range of authentication methods that gives application end users the best security and user experience for their authentication needs. \"I could not wait to get on the Vault Vision Authentication Platform. The passwordless option makes it easy for me and my business to provide customers a better login experience.\" Efi Ben Dor, CEO, saveondev.com Direct integration and automatic configuration are available from the Vault Vision application on the Webflow Marketplace It has never been easier to add authentication components like auth buttons [Login, Logout, Signup, User Profile], user labels [Email, Name], forms that save user data into the CMS, custom 'Design Templates' based on an authenticated user and their specific CMS data Powerful Webflow CMS Flexiblity and Customization Our Webflow HTML and JavaScript, and consider upgrading to a web browser that supports HTML5 video Working with our customers makes it possible to have the widest range of authentication methods that gives application end users the best security and user experience for their authentication needs. Tel: 480 269 6809"
  ]
}