{
  "company": "vbrick.com",
  "dominant_topics": [
    2,
    18
  ],
  "topic_counts": {
    "2": 2,
    "18": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "18": "evidence, digital evidence, data, case, attorneys"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.625,
    "framing_market": 0.375,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "2": 2,
      "18": 1
    }
  },
  "sample_docs": [
    "Positioning VBrick and MPEG-4 FAQ What is the size of the market? Who are the major players in the market today? What are the market segments for video streaming? What is VBrick's focus? Who are the direct competitors for VBrick MPEG-4 products? Who are other MPEG-4 vendors and how does VBrick compete with them? What are the primary applications for VBrick's MPEG-4 products? How will VBrick compete with Microsoft who offers Windows Media for free? Windows Media Player is already installed. Why shouldn't I just use it? How does VBrick's StreamPlayer compare to the well-known Real Player, Apple Quicktime, and Microsoft Players? How does VBrick's MPEG-4 compare with Real Networks? Both Microsoft and Real offer more than 'streaming', they provide integrated \"URL Flips\" and PowerPoint presentations mixed with the video. How does VBrick compete with this? What are the newsgroups and technology experts saying about MPEG-4 and Microsoft? What would you say are the top two characteristics or features that VBrick's MPEG-4 product has that makes it different from the competitors? Other MPEG-4 vendors support many profiles, including \"simple\", \"advanced simple\", \"H.264\" and others. Why should my customers do without these if VBrick only offers \"simple profile\"? What are the Win Themes? Microsoft, Real, Apple, Sorenson, and so many others claim 'high quality', and I've seen really good video at low rates. How will VBrick's MPEG-4 quality compare? Competitors offer multi-rate encoding that allow one product to deliver streams at different rates to different audiences. What is VBrick's position? Does VBrick have a strategy for delivery of video over wireless? What are the main applications? When should MPEG-4 be used vs. MPEG-2 or MPEG-1? Why is a VBrick appliance superior to a PC with software? How should I position VBrick's MPEG-4 product in the security & monitoring and \"Homeland Security\" market? What are the main differences between what VBrick offered in the past, and the new capabilities? Can you provide examples of potential customers for the MPEG-4 product that would not be targets for the MPEG-1 and MPEG-4 products? What are the costs for webcasting? What are some of the key business relationships that VBrick wishes to continue or establish, especially with the MPEG-4 capabilities? The VBrick MPEG-4 capabilities introduces networking concepts that are new to me, like RTSP and RTP. What do I need to know about these? Is there an easy way to determine how much bandwidth a webcast requires? The VBrick MPEG-4 technology and products enables a new set of applications that are not addressed by MPEG-1 and MPEG-2 technology. With these new capabilities comes a new set of competitors. A technical overview of MPEG-4 can be read here . TOP What is the size of the market? Depending on who you ask and how you look at it, the market size is between US $3.5 billion and $12.1 billion. The important point is that it is big! TOP Who are the major players in the market today? Depending on the particular segment, for one-way \"streaming\" video, the market is dominated by Microsoft and Real with Apple a distant 3rd place. For \"videoconferencing\", it is Polycom and Tandberg with Tandberg now on top. For VBrick's initial MPEG-4 products, two-way video is not part of the proposition hence \"videoconferencing\" vendors are not generally competitors. However, there is 'convergence' in the entire video market space and this could rapidly change. TOP What are the market segments for video streaming? The high level market for streaming consists of several segments, and it is important not to be confused about the segment where VBrick participates which is different for the \"low bandwidth\" (MPEG-4) market and the \"high quality\" (MPEG-2) market. Segment Description Example Vendors VBrick Participation Live Video Streaming Products Sending live video over networks at Internet speeds VBrick, Real, Microsoft, Apple, \"Webcam\" solutions from Livewave, SurveyorCorp, freeware, shareware, many others Yes, with MPEG-4 Sending high quality live video over networks at true broadband speeds VBrick, Optivision, Minerva, Miranda, Optibase, others Yes, with MPEG-1 and MPEG-2 Stored Video Streaming Products Sending low bandwidth stored video files from a server Real, Microsoft, Apple Not initially for MPEG-4 Sending high quality stored video files from a server Kassena, infovalue, SeaChange, others Yes, VBVoD Video Authoring Tools Creating low bandwidth video content using editors and content creation tools Adobe, Apple, Avid, ULead, others Some. VBrick supports saving live video to disk via StreamPlayer. The saved video may be an \"input\" to content editing and creation tools. Creating high quality video content using various editors and content creation tools Adobe, Apple, Avid, ULead, others Yes, VBEdit. This is an \"accommodation\" capability, not a target market. Packaged Solutions Fixed or portable computers that implement Live or Stored proprietary video streaming from Real & Microsoft in a simplified or novel way. Basically, software that controls other systems or subsystems. Pinnacle Systems (\"Streamgenie\"), Optibase, Winnov, Telestream, many others Not as a Windows computer nor producing proprietary video (except VBXcoder does this) A VBrick appliance is a packaged solution for enterprise applications. Total system solution including encoding, decoding, video on demand, editing tools, video servers, management tools VBrick Yes for MPEG-1 and MPEG-2 today. No initially for MPEG-4. Yes in the near future as a multi-element system (VoD, SDS). Service - Live Video Live video broadcasting PowerStream, Cable & Wireless, WebX, Loudeye, Real Networks Services, Yahoo, Yes, for audio/video Service - Stored Video Hosted web server delivering stored video over the Internet Yahoo Broadcasting, Cable & Wireless, & virtually all \"web hosting\" companies offer Real or Windows streaming as an option. A very few of these offer \"live\" services (typically they hire a team to come to the client's location to 'set it up'). Not as a product. Yes for live \"Reflector\" services. TOP Where is VBrick's focus? The Enterprise Market. Competitors tend to focus on what they perceive as the \"big markets\", including Hollywood movie distribution, Pay-Per-View Internet Streaming, DVD Content Creation, and consumer markets for \"Personal Video Recorders\" and \"Time Shifting Recorders\" or content consumption. The Enterprise market can be defined as owners of their own digital networks, who also use pubic networks (the Internet) for economy, to communicate with a target audience. From a video streaming perspective, the Enterprise market tends to have a smaller target viewing audience (100's, or 1,000's) than the consumer market (100,000's or 1,000,000's). Enterprises include Corporations, Educational Institutions, Government Agencies and Departments, and other organizations with a professional staff and a need to communicate in a better, faster, or more compelling way. It is important to reiterate that \"Internet Streaming\" is a method Enterprise's use to reach their audience. This is different from an organization who's main objective is to provide video content using the Internet. The latter is a peripheral VBrick market. TOP Who are the direct competitors for VBrick MPEG-4 products? It depends: If the question is \" Who will VBrick compete with for streaming video without regard to the technology used \", the answer is Microsoft and Real, and to a lesser degree Apple. If the question is \" Who will VBrick compete with for MPEG-4 solutions only \", the answer is a new crop of smaller companies including Envivio, Excel Media, iVast, and others who produce software for PC's. If the question is \" Who will VBrick compete with for dedicated multifunctional video appliances that deliver live MPEG-4 \", then the answer is really no one known at this time. However, some vendors are taking PC's (complete with Windows OS), adding software, and offering these as \"appliances\" systems. Among these are Pinnacle, Optibase, Winnov, and others. TOP What are the primary applications for VBrick's MPEG-4 products? Live media distribution Education and training Corporate broadcasting Security & monitoring TOP How will VBrick compete with Microsoft who offers Windows Media for free? VBrick is standards-based vs. Microsoft proprietary. To many customers concerned with being locked in to one vendor, this is a very important distinction. Windows Media is not really free, as the following illustrates: Item Cost Server (mid sized) $2800 Microsoft OS* $0 to $800 Video Capture Card $100 to $1,000 Total $2900 to $4600 *Windows 2000 Server software with Window Media Server may or may not be included with purchase of the server hardware, depending on server vendor. To send Windows Media from a new server will cost at least $2900, although one could argue that customers can use existing equipment and lower the cost to virtually zero. This is not an argument VBrick can win if the following VBrick virtues are discounted. Item Microsoft VBrick Type of System Software - various server hardware Hardware - fully embedded software Purpose Designed mainly for delivery of files - live video is an afterthought Designed mainly for delivery of live video. Portability Server , not generally portable Appliance , very portable Rugged Server, fragile (\"blue screen of death\" common) Appliance, rugged (7 x 24 operation expected) Video System Not designed primarily for video Engineered for video Audio System Not designed primarily for audio - \"Soundblaster card\" needed Engineered for audio Network System Depends on NIC Engineered for networking Standards Proprietary only -- \"MPEG-4\" is wrapped in proprietary MS preventing interoperability ISMA standard -- interoperable with other vendors Target Rates 28.8K to 1 Mbps 56Kbps to 2 Mbps Principal Application Web streaming Enterprise Streaming Ease of Use Complex - IIS Server knowledge necessary Easy -- direct streaming Multicasting Yes Yes Unicasting Yes Yes Support for MPEG-1 No Yes Support for MPEG-2 No Yes Live Transcoding No Yes Simultaneous RTSP, fixed unicasting & multicasting No Yes Service Announcement Protocol Supported No Yes Built-In Profiles Yes Yes Free Player Yes, proprietary Yes, standards-based, plus streams to 3rd party players Audio/Video Inputs Via capture card, typically on the rear of the server. Fragile connections Direct connect, rugged locking connectors Latency Very high -- typically 30 seconds Very low -- typically under 2 seconds Save configuration Yes, to magnetic disk Yes, to flash memory RTSP supported Seems to only work with other Microsoft products (non standard?) Yes, tested with multiple vendors Signaling/Control \"MMS\" proprietary protocol Standard RTSP, multicast Automatic Program Guide No Yes Max number of streams 18,000 claimed. (18,000 x 100 Kbps = 1800 Gbps...is this useful??) 120 per VBrick. More than a typical enterprise WAN could handle Max Network Bandwidth Highly dependent on hardware - but MS claim absurdly very large numbers 38 Mbps Market Focus Consumers Professionals & Enterprise TOP Windows Media Player is already installed on desktops. Why shouldn't my customers just use it? They should! Windows Media Player is a familiar interface for playing audio and video. VBrick empowers it with the ability to play live MPEG-1, MPEG-2 and MPEG-4 streams via a plug-in. But you should not confuse Windows Media Player with \"Windows Media Technologies\" which is a proprietary streaming solution. StreamPlayer provides the \"front end\" for Media Player, allowing the automatic Program Guide to be displayed and launching Media Player with the VBrick plug-ins installed to view the video. Many other customers have chosen Apple Quicktime or Real's RealOne player as a \"standard\" in their company. Any of these players can be used to view the VBrick MPEG-4 video. TOP How does StreamPlayer compare to the well-known Real Player, Quicktime, and Microsoft players? StreamPlayer is a multiple format MPEG video viewer for the enterprise which automatically lists live programs. The other players require the user to enter obscure IP addresses, or requires a webmaster to post web page links, for the viewer to see video. This is an important distinction for viewing of MPEG-1 and MPEG-2, and a unique distinction for viewing MPEG-4. StreamPlayer compares favorably for it's video quality, providing built-in deblocking and deringing to produce the best possible image quality. StreamPlayer Plus includes the ability to record the MPEG-4 video to your local disk, and includes built-in file transfer capabilities so your captured video can be instantly posted on a video server. These are capabilities not provided in other viewers. Microsoft* Real Apple VBrick Live MPEG-1 No No No Yes Live MPEG-2 No No No Yes Live MPEG-4 No (Yes with VBrick plugin) No (Yes with Envivio plugin) Yes Yes Multicast Support Weak Weak Weak Strong Automatic Program Guide No No No Yes Record Capability No No No Yes Automatic Install Yes No Yes Yes Web Page Embedding Yes Yes Yes Yes Advertising Pop-ups No Yes No No Standard RTSP support No Yes Yes Yes Live Closed Captioning** No No No Yes Cost Free Free to $20 Free Free to $20 * StreamPlayer uses Media Player by empowering it with MPEG features ** For MPEG-1 and MPEG-2 StreamPlayer, as described above, is not intended to compete with other MPEG-4 compliant viewers for general Word Wide Web streaming video viewing. It delivers it's value in a multicast-enabled enterprise networks. For viewing of public webcasting, VBrick uses Apple, Real, or other compliant viewers and also offers a fee plug-in for Windows Media. TOP Both Microsoft and Real offer more than 'streaming', they provide integrated \"URL Flips\" and PowerPoint presentations mixed with the video. How does VBrick compete with this? First, we compete in markets where this is not part of the solution, including: Live media distribution Live television to the desktop VCR tape and DVD playback to the desktop Classroom video to homebound students Second, PowerPoint slide presentations and similar multimedia capabilities may be integrated into the VBrick solution using 3rd party tools. You can also provide custom applications using the VBrick SDK, as illustrated at www.videoalive.com . Third, VBrick delivers live presentations via the dual channel MPEG-4 encoder, where one channel is live video and the other channel is the multimedia presentation content. TOP What are the newsgroups and technology experts saying about MPEG-4 and Microsoft? The following is an unedited newsgroup thread from December 2002. We've not included the author's email for privacy reasons: ------------------ I'll wrap all this up in one e-mail. First, I have some h.264 CODEC tests; however, since I am under NDA I am unable to release them at this time. You can check for the latest CODEC comparisons. I will be adding a new CODEC comparison chart by using HD footage that was brought in uncompressed. The new tests will also have more bitrates and be more standard. As it is now the tests are non-technical and give a general idea only and should *not* be used for 100% CODEC comparisons (since the raw is MPEG 1 file, that's the first problem right there.) Second part: > WM comes preinstalled on 85% of the clients on the Internet. > WM auto Upgrades so those who have an old version have a new version. Not 100% true. Play Windows Media 9 content on a Windows 95 or NT box. Maybe you can do it now, but at last check you could not. The new cool CODECs will require a full player upgrade. Almost all of my clients 1 year ago were using player 6.4 on NT systems and the IT department was slowly moving to 2000 with player 6.4 still. It sucks. For some reason, and I don't know why, it's really simple to get MPEG 4 players into corporate America whereas getting them to upgrade to Windows Media 8 is like pulling teeth. Maybe it's just me. I think lead IT managers are crazy, then again, that's what makes them so fun! > WM is generally less demanding for play back than Mpeg4 of the same > quality. (not the same bitrate) Don't know if I agree with that. Maybe with the QuickTime MPEG 4 encoded material, but a Telestream encoded MPEG 4 file (simple profile) is very low bitrate and not too demanding. Remember, the MPEG 4 encoded that comes with QuickTime is *not* a professional encoder. I can get some very pretty looking pictures out of a pro MPEG 4 encoder. Even the Sorenson Squeeze MPEG 4 encoder is better than the QuickTime encoder. I wonder if that's why MS always seems to compare WM 9 content to a QT MPEG 4 encoded clip? Hmmmmmmm.... > Mpeg4 currently has so many incompatible dialects that even if 50% of > content was Mpeg4 only 35% of it would be playable on any one player. > Or less if they pick the wrong dialect. Depends. Simple profile plays on every player I throw it at. Advanced simple is a different story. You're right though, they really, need to work this out. I think Envivio is adding to the confusion. They have their own interactive stuff that plugs in to their CODEC. Standards... all I want is for everyone to follow the standards! > WM is not for editing, that is why there are so few tools for it. > Mpeg4 > shouldn't be for editing so the people who are making tools for it are > working off hype, not reason. Agreed. The tools I refer to are stand alone encoders/decoders, teleconferencing boxes (actually, the MPEG teleconferencing solutions are cheap, high quality and have less than .3 second lag. They are COOL), automated encoding software, interactive encoding solutions, security camera applications, etc. I don't have any MPEg 4 editing tools minus what I have for WM. > Because it has a pretty logo. And that logo is associatied with things > like Media Center PC's, Digital Cinema, DRM, and any media that has a > valid revenue stream. Don't know. My clients are not married to MS. In fact, many of them are pissed at MS. MPEG 4 is an easy sell. Cross platform, cross player, cross browser, cross devices. That logo gets me nothing anymore (it did a year ago, so I'm not complaining). > Gone are the days when your stock is valued on > how many people have heard of you and your .com. The new market is all > about how far in the black you can run. Agreed. > If you use Mpeg4 you better be > doing a lot of Product placement, and comercials because your content > might as well be free. Mpeg4 is great if you are Sprint PCS and you > are > really selling your content PPM because people are using their air > time. Not to be picky, but Sprint has an unlimited bandwidth plan, so I don't think they care. I do understand your point though, and it is valid. > I like Quick Time for its Sprite Layers. I like Mpeg4 for it universal > platform. But I like WM because it gives me a means to make money off > my content. And that is why it will succeed. I agree except that I am finding that I can make more margin off of MPEG 4 *and* it's an easy sell. Gone are the days of the player wars. Gone are the days of multiple encodes. I encode once, deliver to any player on any platform, make more margin, save my customer money and have not had a single complaint. I am by no means saying that WM is dead... yet. I'm saying that I am personally making a lot of $$ with MPEG 4 today and I expect to make more in the near future. I am not married to WM, QuickTime, Real or MPEG 4. Heck, there are parts of MPEG 4 that piss me off to no end. I'm just looking to the future and I see MPEG 4 doing what MPEG 1 did, but on the web. Is it 100% here today? Not yet. Will it get here soon? In my opinion, yes. The most important part of this conversation though... Do what you need to do to make money. Stay in business. Like you said, the .com days of unlimited VC money are over. Turn profit, margin is good. For me my margin is coming from MPEG 4. If you're still making a killing with Windows Media, by all means, stay with Windows Media. BJH TOP What would you say are the top two characteristics or features that VBrick's MPEG-4 product has that makes it different from the competitors? Standards and multi-vendor interoperability vs. proprietary ( see white paper ) Appliance model (no Windows OS) vs. software for a server followed by Multifunction TOP Other MPEG-4 vendors support many profiles, including \"simple\", \"advanced simple\", \"H.264\" and others. Why should my customers do without these if VBrick only offers \"simple profile\"? They shouldn't, and they won't have to. VBrick has an excellent reputation for delivering stable, useful, production-ready products. We will offer additional capabilities and MPEG-4 profiles in the future. Other vendors tend to make announcements when they first get something almost working in their labs...sometimes even before that! And all of these are software for PC's. But more importantly, MPEG-4 simple profile is currently the most widely interoperable profile. It is unlikely the other profiles will achieve this level of interoperability for some time, and standards and interoperability is the whole point of MPEG-4! What would be the point of an implementation of a standard that is single-vendor? TOP Microsoft, Real, Apple, Sorenson, and so many others claim 'high quality', and I've seen really good video at low rates. How does the VBrick's MPEG-4 quality compare? There will always be a trade-off between proprietary and standards. Generally, proprietary will always be 'better' for a given application. This is true because one vendor, acting alone, can make improvements that other vendors cannot implement. This is not unique to the video industry...for example Cisco may tell you that their special routing technology will do some useful tricks but if you use it, you cannot interoperate with other routers or switches in your network. For many, it is good practice to avoid proprietary whenever possible. In the case of MPEG-4, the quality of the encoding is based on proprietary techniques while still meeting the standards. This has do with the how well each vendor's approach to compression deals with motion, delay, rate control, audio/video sync, and many other factors. But the biggest cause for confusion has do with the live vs. multiple-pass encoding. You can indeed take a 10-minute video, and spend many hours compressing it to a file on your hard disk. The result of such \"multiple pass encoding\" can be excellent, and this is what is shown at trade shows and customer demos. For a fair evaluation of VBrick's MPEG-4 vs. any other solution, you must conduct live, real time, low delay encoding and decoding. Given this condition, VBrick's MPEG-4 is equal to or superior to any other MPEG-4 encoder today. When you compare MPEG-4 to Real, Microsoft or other proprietary encoder, the proprietary solutions may be judged superior in video quality. However, the difference is quality is apparent only to the most careful viewer and only on a side-by-side comparison. But it is not correct to compare \"MPEG-4\" to anything! \"MPEG-4\" defines many profiles and layers which are different for each application. VBrick initially supports simple profile (the most widely supported and interoperable profile). Other profiles, such as advanced simple, and H.264, will provide even higher quality at a given bit rate. TOP Competitors offer multi-rate encoding that allow one product to deliver streams at different rates to different audiences. What is VBrick's position? Multi-rate encoding, as promoted by Microsoft and Real doesn't work well and is rarely used. Among the issues are 1) client viewers get confused when they are on a corporate LAN, 2) an error in the stream affects everyone and 3) frame sizes must be the same for all videos. One VBrick appliance can be configured two deliver to streams at different encoding rates. With this superior approach, each stream is truly independent, and clients can simply choose the stream that is best for their connection speed. In addition, each stream can be simultaneously delivered via both RTSP unicast, multicast, and directed unicast. This approach provides the ultimate in reliability and flexibility in a system that always works. TOP Does VBrick have a strategy for delivery of video over wireless? \"Wireless\" is presumed to be wireless delivery of IP packets over 802.11b, 802.11a, microwave, satellite, optical laser, or cell phones. VBrick's MPEG-1 and MPEG-2 products are regularly used over high bandwidth wireless connections today. MPEG-4, in particular delivered via RTSP unicasting, may be viewed on wireless desktops and PDA's. From a video network perspective, there is little difference between wired and wireless, except that wireless must use low bandwidth...which MPEG-4 products now provide. VBrick is not in the business delivering video to 'cell phones' at speeds of 9600 bps. To the extent a cell phone, or any device, is capable of receiving standards-compliant MPEG-4 at any supported rate (e.g. 56 Kbps and up), VBrick is a good choice for the video source. Prior to the MPEG-4 product, wireless delivery of video was limited to point-to-point connections due to the bandwidth and because multicasting over wireless is not always supported. With the MPEG-4 product, direct wireless delivery to desktops, laptops, and (future) PDA's is a target application. TOP What are the Win Themes? Simplicity Adherence to standards and multi-vendor interoperability Reliability Flexibility Low cost Reach TOP What are the main applications? MPEG4 Multicasting in an Enterprise LAN MPEG4 Unicasting in and Enterprise LAN and VPN MPEG4 Webcasting directly MPEG4 Webcasting via Reflector Service MPEG4 Hybrid Networking READ WHITE PAPER TOP When should MPEG-4 be sold vs. MPEG-2 or MPEG-1? Use MPEG-2 Use MPEG-1 Use MPEG-4 DVD Quality required X VHS Quality required X X Best possible quality below 1 Mbps X Desktop Streaming X X X Hardware Decoder with Video Output X X Set Top Box available X X Video On Demand X X Webcasting X Widest Interoperability X Multicasting not available in network X Store & Forward Video X Delivery over ATM X X Delivery over IP X X X Delivery over RS-422 (T1) X Content Editing X X Stream to VBrick StreamPlayer X X X Stream To Apple Quicktime X Stream To Real Player X Scheduled Streaming X X X Closed Captioning Supported X X Delivers Web Pages via integral server X X Customer's Video Quality Sensitivity High Medium Low Customer's Bandwidth Sensitivity Low Medium High Customer's Cost Sensitivity Low High Medium TOP How does VBrick's MPEG-4 compare with Real Networks? Many people find the Real Networks system to be annoying. The Real Player is riddled with \"pop ups\" and advertising, and a propensity to \"take over your desktop\". Item Cost Server (mid sized) $2800 Microsoft OS* $0 to $800 Video Capture Card $100 to $1,000 Helix Server Software $0 to $5,879 Player $0 to $19.95 to $5.95/month each Total $2900 to $10,479 Item Real VBrick Type of System Software - various server hardware Hardware - fully embedded software Purpose Designed mainly for delivery of files - live video is an afterthought. Designed mainly for delivery of live video. Portability Server , not generally portable Appliance , very portable Rugged Server, fragile (\"blue screen of death\" common) Appliance, rugged (7 x 24 operation expected) Video System Software designed primarily for audio and video, but depends on the host operating system. Engineered for video Audio System Software designed primarily for audio and video - \"Soundblaster card\" needed Engineered for audio Network System Depends on NIC Engineered for networking Standards Helix Server supports multiple standards, including -- \"MPEG-4\". Also supports Microsoft and Real proprietary modes ISMA standard -- interoperable with other vendors Target Rates 28.8K to 1 Mbps 56Kbps to 2 Mbps Principal Application Web streaming Enterprise Streaming Ease of Use Complex - IIS, Unix, or other server OS knowledge necessary Easy -- direct streaming Multicasting Yes Yes Unicasting Yes Yes Support for MPEG-1 No encoding Yes - Real promotes VBrick 3200 for MPEG-1 encoding Yes Support for MPEG-2 No encoding (yes for file, program stream only) Yes Live Transcoding No Yes Simultaneous RTSP, fixed unicasting & multicasting Yes Yes Service Announcement Protocol Supported No Yes Built-In Profiles Yes Yes Free Player Yes, proprietary Yes, standards-based, plus streams to 3rd party players Audio/Video Inputs Via capture card, typically on the rear of the server. Fragile connections Direct connect, rugged locking connectors Latency Very high -- typically 30 seconds Very low -- typically under 2 seconds Save configuration Yes, to magnetic disk Yes, to flash memory RTSP supported Yes, Helix Server Yes, tested with multiple vendors Signaling/Control Standard, RTSP Standard RTSP, multicast Automatic Program Guide No Yes Max number of streams Depends on host hardware, but the software does not prevent thousands of streams. \"Free\" Helix server limited to 100 streams. 120 per VBrick. More than a typical enterprise WAN could handle Max Network Bandwidth Highly dependent on hardware - but MS claim absurdly very large numbers 38 Mbps Market Focus Consumers Professionals & Enterprise TOP Why is a VBrick appliance superior to a PC with software? It depends on what you want to do. If you want to encode a video to disk, create 'content', author or manipulate video, a PC with software is an excellent solution (however, there are dedicated devices that serves this market too). If you want to stream live video, an appliance is superior for several reasons. First, customers will not have to suffer the \"blue screen of death\" reliability issues. Second, the use of a PC for streaming is often false economy...one might think they are going to do multiple things with the computer while the reality is that it must become dedicated for streaming only (what do you think will happen to your stream if you suddenly start editing a Word document on that same computer?). Third, an appliance is quite rugged and portable, allowing it to be placed virtually anywhere. Finally, there are various 'soft' issues that a VBrick appliance addresses, such as very quiet operation (PC's usually have very noisy fans), easy installation, easy use, the fact that you cannot accidentally load some software that breaks the streaming capabilities, robustness and reliability, and its inherent resistance to computer viruses, worms, and bugs. For customers with strong feelings that they want a PC software solution, the \"appliance vs. PC\" debate is not one VBrick is likely to win. Key point: Although a VBrick does far more than a \"video capture card\", for certain applications and for customers familiar with Osprey or Winnov cards, VBrick can be positioned as a \"Network Attached Video Capture Card for MPEG-4\". For streaming applications, the whole point is for the video to go from the capture card to the Ethernet -- and one can argue that the PC just \"gets in the way\". This point is less true if the application is for offline content creation. TOP How should I position VBrick's MPEG-4 product in the security & monitoring and \"Homeland Security\" market? There are many new \"Network Cameras\", \"Webcams\", and similar products targeting the security market. VBrick does not currently participate in the \"camera\" market. VBrick should be used when: There are existing cameras that need to be networked The customer is partial to a certain type of camera, long lenses, etc. hence integrated cameras are not considered The application calls for viewing over low bandwidth connections, including wireless Low bandwidth MPEG-4 video is used for monitoring -- and high bandwidth MPEG-2 is used to record those security events The video will be viewed on PC desktops using standards Audio is desired or required VBrick reliability is required Examples of Network Camera vendors and security systems (new vendors entering the market quickly): Vendor Comments Axis Focus on low frame rate \"webcam\" video MPEG-2 solution poor quality No audio Good system solution for secuirty IndigoVision jpeg, low frame rate \"VB6000\" name Visual Security Focus on low frame rate jpeg \"webcam\" video No audio Comins Loronix Security Systems D-Link Security web cams Image capture No audio Not really 'video' $300 price NetPower icantek Korean Company Focus on low frame rate \"webcam\" and streaming video Includes audio (some models) As an additional observation about \"Network Cameras\" vs. a VBrick, for applications that calls for a remote control of the camera (pan/tilt/zoom), these devices are often a poor choice. TOP Who are other MPEG-4 vendors and how does VBrick compete with them? The market for MPEG-4 products is young. Other vendors may be more friend than foe (\"All the boats rise when the tide comes in\"). For the most part, the \"MPEG-4 Market\" has many vendors who wish to win the hearts and minds of content producers. MPEG-4 has capabilities that go much deeper than \"encoding\" and \"compression\", and these vendors wish to capture some portion of the content creation revenue chain, not necessarily the \"streaming and delivery\" chain, which is were VBrick lives. Nevertheless, young vendors are quite hungry and will attempt to compete with VBrick by promoting PC's with video capture cards vs. the VBrick appliance. Many of these same vendors will attempt to equip as many VBrick competitors as they can in order to realize royalty revenues. As the following chart illustrates, there are very few companies delivering real solutions today. Vendor Description VBrick Comments Apple PC/MAC w/ capture card. Quicktime player. Darwin server. Cost ~$3,000. Apple has been a long time MPEG-4 proponent. Not an appliance. Darwin server is not supported by Apple (Open Source License) Sigma Hardware decoders for PC's that do MPEG-1,2,4. Chip maker for set top boxes. Free MPEG-4 encoding software to promote sales of their MPEG-4 decoders. iVast Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufactures Not an appliance Depends on Microsoft Focus on off-line content creation Envivio Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufacturers. Provides the \"plug-in\" for Real Networks player to enable MPEG-4 decoding. PC with s/w suite ~ $3,000; full suite solution ~ $20,000 Not an appliance Depends on Microsoft Focus on off-line content creation MediaExcel Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufactures Not an appliance Depends on Microsoft Seems more able to provide real-time services (transcoding) than other. Thompson BitBand Another PC with software piled on Optibase MGW chassis + encoder card = aprox. $10,000 PCI cards configured in a Windows Server Nextreaming Network Appliance On2 ViewCast Niagara - PC portable - $20,000 TOP TOP What are the main differences between what VBrick has offered in the past, verses the new capabilities of the MPEG-4 product? In the past, VBrick focused almost exclusively on multicasting of video. This is true because even a few high bandwidth sources requires a lot of bandwidth, but multicasting makes it possible to deliver high bandwidth video everywhere. This was also true because the standards did not provide for low rate streaming. With the MPEG-4 low bandwidth technology, it is very reasonable for video to be sent via unicast, thereby eliminating the full dependency on customers having multicasting fully enabled in their networks. The other difference is that VBrick has carefully positioned its products for use in internets and intranets, but not for use on \"THE Internet\". MPEG-4 targets Internet use. TOP Can you provide examples of potential customers for the MPEG-4 product that would not be strong targets for the MPEG-1 and MPEG-4 products? There are dependencies for the choice of MPEG-4 vs. MPEG-2. In many cases, MPEG-2 would be a better choice than MPEG-4. However, the following are examples where the dependencies eliminated by the MPEG-4 product make it an ideal candidate: Customer Example New Application Example Religious Organizations Webcasting the weekly sermon to viewers in their homes via the Internet Public Schools Webcasting live classroom video to homebound students Corporate Sales Conducting live product launches to worldwide sales force via secure corporate VPN Military Distributing live video over tactical field networks Local Governments Webcasting live city council meetings on the Internet State Government Broadcasting live meetings to other state agencies over the wide area state network Law Enforcement Transmitting live video over wireless connections between mobile units Customer Service Send live video to customers to provide support and information TOP What are the costs for webcasting? Currently, the average cost of a single webcast from service providers can range between $30,000 and $100,000 (Source: D.C. Denison, The Boston Globe , 03/04/02). VBrick reduces the cost to zero if the customer has the bandwidth, and further reduces it to a low ($300 typical) monthly cost if external \"Reflector\" services are used. TOP What are some of the key business relationships that VBrick wishes to continue or establish, especially with the MPEG-4 capabilities? The relationships fall into several categories: Category Description Reason Examples Bandwidth Service Providers An organization that provides bandwidth services to their customers Service providers are looking for ways to generate additional revenue through increased use of their networks. Cable & Wireless, British Telecom, AT&T, Sprint Network Equipment Vendors An organization that produces switches, routers, and similar network equipment. Equipment vendors need video products to both show off their equipment and to generate increased demand. Extreme Networks, Foundry, Cisco Streaming Media Hosting Companies An organization that provides value-added streaming media services. Streaming media is their business, and they do not want to be left behind my advances in MPEG-4 streaming. PowerStream, Cable & Wireless, Yahoo Broadcast, Perfect Stream, many small companies Advertising Agencies An organization that produces videos for client advertising Agencies are looking for unique and innovative ways to deliver messages to consumers. A/V Integrators An organization that assembles and sells systems that deliver audio/visual content. Video is their business and they need new products to help drive their business. Network Integrators An organization that assembles and sells network infrastructure equipment. Video is a new revenue-generating capability Content Aggregators An organization the obtains the rights to distribute live video feeds from multiple sources. Digital video streaming, especially in enterprise networks such as a college campus, is a new source of revenue. Direct-TV, \"Multiple System Operators\" (MSO's), AT&T Broadband, Cox Cable, Independents The VBrick MPEG-4 capabilities introduces networking concepts that are new to me, like RTSP and RTP. What do I need to know about these? These are rather conventional networking standards. For a high level review of the networking terminology, click here . TOP Is there an easy way to calculate how much bandwidth a webcast requires? Yes, . TOP The VBrick MPEG-4 technology and products enables a new set of applications that are not addressed by MPEG-1 and MPEG-2 technology. With these new capabilities comes a new set of competitors. A technical overview of MPEG-4 can be read here . TOP What is the size of the market? Depending on who you ask and how you look at it, the market size is between US $3.5 billion and $12.1 billion. The important point is that it is big! TOP Who are the major players in the market today? Depending on the particular segment, for one-way \"streaming\" video, the market is dominated by Microsoft and Real with Apple a distant 3rd place. For \"videoconferencing\", it is Polycom and Tandberg with Tandberg now on top. For VBrick's initial MPEG-4 products, two-way video is not part of the proposition hence \"videoconferencing\" vendors are not generally competitors. However, there is 'convergence' in the entire video market space and this could rapidly change. TOP What are the market segments for video streaming? The high level market for streaming consists of several segments, and it is important not to be confused about the segment where VBrick participates which is different for the \"low bandwidth\" (MPEG-4) market and the \"high quality\" (MPEG-2) market. Segment Description Example Vendors VBrick Participation Live Video Streaming Products Sending live video over networks at Internet speeds VBrick, Real, Microsoft, Apple, \"Webcam\" solutions from Livewave, SurveyorCorp, freeware, shareware, many others Yes, with MPEG-4 Sending high quality live video over networks at true broadband speeds VBrick, Optivision, Minerva, Miranda, Optibase, others Yes, with MPEG-1 and MPEG-2 Stored Video Streaming Products Sending low bandwidth stored video files from a server Real, Microsoft, Apple Not initially for MPEG-4 Sending high quality stored video files from a server Kassena, infovalue, SeaChange, others Yes, VBVoD Video Authoring Tools Creating low bandwidth video content using editors and content creation tools Adobe, Apple, Avid, ULead, others Some. VBrick supports saving live video to disk via StreamPlayer. The saved video may be an \"input\" to content editing and creation tools. Creating high quality video content using various editors and content creation tools Adobe, Apple, Avid, ULead, others Yes, VBEdit. This is an \"accommodation\" capability, not a target market. Packaged Solutions Fixed or portable computers that implement Live or Stored proprietary video streaming from Real & Microsoft in a simplified or novel way. Basically, software that controls other systems or subsystems. Pinnacle Systems (\"Streamgenie\"), Optibase, Winnov, Telestream, many others Not as a Windows computer nor producing proprietary video (except VBXcoder does this) A VBrick appliance is a packaged solution for enterprise applications. Total system solution including encoding, decoding, video on demand, editing tools, video servers, management tools VBrick Yes for MPEG-1 and MPEG-2 today. No initially for MPEG-4. Yes in the near future as a multi-element system (VoD, SDS). Service - Live Video Live video broadcasting PowerStream, Cable & Wireless, WebX, Loudeye, Real Networks Services, Yahoo, Yes, for audio/video Service - Stored Video Hosted web server delivering stored video over the Internet Yahoo Broadcasting, Cable & Wireless, & virtually all \"web hosting\" companies offer Real or Windows streaming as an option. A very few of these offer \"live\" services (typically they hire a team to come to the client's location to 'set it up'). Not as a product. Yes for live \"Reflector\" services. TOP Where is VBrick's focus? The Enterprise Market. Competitors tend to focus on what they perceive as the \"big markets\", including Hollywood movie distribution, Pay-Per-View Internet Streaming, DVD Content Creation, and consumer markets for \"Personal Video Recorders\" and \"Time Shifting Recorders\" or content consumption. The Enterprise market can be defined as owners of their own digital networks, who also use pubic networks (the Internet) for economy, to communicate with a target audience. From a video streaming perspective, the Enterprise market tends to have a smaller target viewing audience (100's, or 1,000's) than the consumer market (100,000's or 1,000,000's). Enterprises include Corporations, Educational Institutions, Government Agencies and Departments, and other organizations with a professional staff and a need to communicate in a better, faster, or more compelling way. It is important to reiterate that \"Internet Streaming\" is a method Enterprise's use to reach their audience. This is different from an organization who's main objective is to provide video content using the Internet. The latter is a peripheral VBrick market. TOP Who are the direct competitors for VBrick MPEG-4 products? It depends: If the question is \" Who will VBrick compete with for streaming video without regard to the technology used \", the answer is Microsoft and Real, and to a lesser degree Apple. If the question is \" Who will VBrick compete with for MPEG-4 solutions only \", the answer is a new crop of smaller companies including Envivio, Excel Media, iVast, and others who produce software for PC's. If the question is \" Who will VBrick compete with for dedicated multifunctional video appliances that deliver live MPEG-4 \", then the answer is really no one known at this time. However, some vendors are taking PC's (complete with Windows OS), adding software, and offering these as \"appliances\" systems. Among these are Pinnacle, Optibase, Winnov, and others. TOP What are the primary applications for VBrick's MPEG-4 products? Live media distribution Education and training Corporate broadcasting Security & monitoring TOP How will VBrick compete with Microsoft who offers Windows Media for free? VBrick is standards-based vs. Microsoft proprietary. To many customers concerned with being locked in to one vendor, this is a very important distinction. Windows Media is not really free, as the following illustrates: Item Cost Server (mid sized) $2800 Microsoft OS* $0 to $800 Video Capture Card $100 to $1,000 Total $2900 to $4600 *Windows 2000 Server software with Window Media Server may or may not be included with purchase of the server hardware, depending on server vendor. To send Windows Media from a new server will cost at least $2900, although one could argue that customers can use existing equipment and lower the cost to virtually zero. This is not an argument VBrick can win if the following VBrick virtues are discounted. Item Microsoft VBrick Type of System Software - various server hardware Hardware - fully embedded software Purpose Designed mainly for delivery of files - live video is an afterthought Designed mainly for delivery of live video. Portability Server , not generally portable Appliance , very portable Rugged Server, fragile (\"blue screen of death\" common) Appliance, rugged (7 x 24 operation expected) Video System Not designed primarily for video Engineered for video Audio System Not designed primarily for audio - \"Soundblaster card\" needed Engineered for audio Network System Depends on NIC Engineered for networking Standards Proprietary only -- \"MPEG-4\" is wrapped in proprietary MS preventing interoperability ISMA standard -- interoperable with other vendors Target Rates 28.8K to 1 Mbps 56Kbps to 2 Mbps Principal Application Web streaming Enterprise Streaming Ease of Use Complex - IIS Server knowledge necessary Easy -- direct streaming Multicasting Yes Yes Unicasting Yes Yes Support for MPEG-1 No Yes Support for MPEG-2 No Yes Live Transcoding No Yes Simultaneous RTSP, fixed unicasting & multicasting No Yes Service Announcement Protocol Supported No Yes Built-In Profiles Yes Yes Free Player Yes, proprietary Yes, standards-based, plus streams to 3rd party players Audio/Video Inputs Via capture card, typically on the rear of the server. Fragile connections Direct connect, rugged locking connectors Latency Very high -- typically 30 seconds Very low -- typically under 2 seconds Save configuration Yes, to magnetic disk Yes, to flash memory RTSP supported Seems to only work with other Microsoft products (non standard?) Yes, tested with multiple vendors Signaling/Control \"MMS\" proprietary protocol Standard RTSP, multicast Automatic Program Guide No Yes Max number of streams 18,000 claimed. (18,000 x 100 Kbps = 1800 Gbps...is this useful??) 120 per VBrick. More than a typical enterprise WAN could handle Max Network Bandwidth Highly dependent on hardware - but MS claim absurdly very large numbers 38 Mbps Market Focus Consumers Professionals & Enterprise TOP Windows Media Player is already installed on desktops. Why shouldn't my customers just use it? They should! Windows Media Player is a familiar interface for playing audio and video. VBrick empowers it with the ability to play live MPEG-1, MPEG-2 and MPEG-4 streams via a plug-in. But you should not confuse Windows Media Player with \"Windows Media Technologies\" which is a proprietary streaming solution. StreamPlayer provides the \"front end\" for Media Player, allowing the automatic Program Guide to be displayed and launching Media Player with the VBrick plug-ins installed to view the video. Many other customers have chosen Apple Quicktime or Real's RealOne player as a \"standard\" in their company. Any of these players can be used to view the VBrick MPEG-4 video. TOP How does StreamPlayer compare to the well-known Real Player, Quicktime, and Microsoft players? StreamPlayer is a multiple format MPEG video viewer for the enterprise which automatically lists live programs. The other players require the user to enter obscure IP addresses, or requires a webmaster to post web page links, for the viewer to see video. This is an important distinction for viewing of MPEG-1 and MPEG-2, and a unique distinction for viewing MPEG-4. StreamPlayer compares favorably for it's video quality, providing built-in deblocking and deringing to produce the best possible image quality. StreamPlayer Plus includes the ability to record the MPEG-4 video to your local disk, and includes built-in file transfer capabilities so your captured video can be instantly posted on a video server. These are capabilities not provided in other viewers. Microsoft* Real Apple VBrick Live MPEG-1 No No No Yes Live MPEG-2 No No No Yes Live MPEG-4 No (Yes with VBrick plugin) No (Yes with Envivio plugin) Yes Yes Multicast Support Weak Weak Weak Strong Automatic Program Guide No No No Yes Record Capability No No No Yes Automatic Install Yes No Yes Yes Web Page Embedding Yes Yes Yes Yes Advertising Pop-ups No Yes No No Standard RTSP support No Yes Yes Yes Live Closed Captioning** No No No Yes Cost Free Free to $20 Free Free to $20 * StreamPlayer uses Media Player by empowering it with MPEG features ** For MPEG-1 and MPEG-2 StreamPlayer, as described above, is not intended to compete with other MPEG-4 compliant viewers for general Word Wide Web streaming video viewing. It delivers it's value in a multicast-enabled enterprise networks. For viewing of public webcasting, VBrick uses Apple, Real, or other compliant viewers and also offers a fee plug-in for Windows Media. TOP Both Microsoft and Real offer more than 'streaming', they provide integrated \"URL Flips\" and PowerPoint presentations mixed with the video. How does VBrick compete with this? First, we compete in markets where this is not part of the solution, including: Live media distribution Live television to the desktop VCR tape and DVD playback to the desktop Classroom video to homebound students Second, PowerPoint slide presentations and similar multimedia capabilities may be integrated into the VBrick solution using 3rd party tools. You can also provide custom applications using the VBrick SDK, as illustrated at www.videoalive.com . Third, VBrick delivers live presentations via the dual channel MPEG-4 encoder, where one channel is live video and the other channel is the multimedia presentation content. TOP What are the newsgroups and technology experts saying about MPEG-4 and Microsoft? The following is an unedited newsgroup thread from December 2002. We've not included the author's email for privacy reasons: ------------------ I'll wrap all this up in one e-mail. First, I have some h.264 CODEC tests; however, since I am under NDA I am unable to release them at this time. You can check for the latest CODEC comparisons. I will be adding a new CODEC comparison chart by using HD footage that was brought in uncompressed. The new tests will also have more bitrates and be more standard. As it is now the tests are non-technical and give a general idea only and should *not* be used for 100% CODEC comparisons (since the raw is MPEG 1 file, that's the first problem right there.) Second part: > WM comes preinstalled on 85% of the clients on the Internet. > WM auto Upgrades so those who have an old version have a new version. Not 100% true. Play Windows Media 9 content on a Windows 95 or NT box. Maybe you can do it now, but at last check you could not. The new cool CODECs will require a full player upgrade. Almost all of my clients 1 year ago were using player 6.4 on NT systems and the IT department was slowly moving to 2000 with player 6.4 still. It sucks. For some reason, and I don't know why, it's really simple to get MPEG 4 players into corporate America whereas getting them to upgrade to Windows Media 8 is like pulling teeth. Maybe it's just me. I think lead IT managers are crazy, then again, that's what makes them so fun! > WM is generally less demanding for play back than Mpeg4 of the same > quality. (not the same bitrate) Don't know if I agree with that. Maybe with the QuickTime MPEG 4 encoded material, but a Telestream encoded MPEG 4 file (simple profile) is very low bitrate and not too demanding. Remember, the MPEG 4 encoded that comes with QuickTime is *not* a professional encoder. I can get some very pretty looking pictures out of a pro MPEG 4 encoder. Even the Sorenson Squeeze MPEG 4 encoder is better than the QuickTime encoder. I wonder if that's why MS always seems to compare WM 9 content to a QT MPEG 4 encoded clip? Hmmmmmmm.... > Mpeg4 currently has so many incompatible dialects that even if 50% of > content was Mpeg4 only 35% of it would be playable on any one player. > Or less if they pick the wrong dialect. Depends. Simple profile plays on every player I throw it at. Advanced simple is a different story. You're right though, they really, need to work this out. I think Envivio is adding to the confusion. They have their own interactive stuff that plugs in to their CODEC. Standards... all I want is for everyone to follow the standards! > WM is not for editing, that is why there are so few tools for it. > Mpeg4 > shouldn't be for editing so the people who are making tools for it are > working off hype, not reason. Agreed. The tools I refer to are stand alone encoders/decoders, teleconferencing boxes (actually, the MPEG teleconferencing solutions are cheap, high quality and have less than .3 second lag. They are COOL), automated encoding software, interactive encoding solutions, security camera applications, etc. I don't have any MPEg 4 editing tools minus what I have for WM. > Because it has a pretty logo. And that logo is associatied with things > like Media Center PC's, Digital Cinema, DRM, and any media that has a > valid revenue stream. Don't know. My clients are not married to MS. In fact, many of them are pissed at MS. MPEG 4 is an easy sell. Cross platform, cross player, cross browser, cross devices. That logo gets me nothing anymore (it did a year ago, so I'm not complaining). > Gone are the days when your stock is valued on > how many people have heard of you and your .com. The new market is all > about how far in the black you can run. Agreed. > If you use Mpeg4 you better be > doing a lot of Product placement, and comercials because your content > might as well be free. Mpeg4 is great if you are Sprint PCS and you > are > really selling your content PPM because people are using their air > time. Not to be picky, but Sprint has an unlimited bandwidth plan, so I don't think they care. I do understand your point though, and it is valid. > I like Quick Time for its Sprite Layers. I like Mpeg4 for it universal > platform. But I like WM because it gives me a means to make money off > my content. And that is why it will succeed. I agree except that I am finding that I can make more margin off of MPEG 4 *and* it's an easy sell. Gone are the days of the player wars. Gone are the days of multiple encodes. I encode once, deliver to any player on any platform, make more margin, save my customer money and have not had a single complaint. I am by no means saying that WM is dead... yet. I'm saying that I am personally making a lot of $$ with MPEG 4 today and I expect to make more in the near future. I am not married to WM, QuickTime, Real or MPEG 4. Heck, there are parts of MPEG 4 that piss me off to no end. I'm just looking to the future and I see MPEG 4 doing what MPEG 1 did, but on the web. Is it 100% here today? Not yet. Will it get here soon? In my opinion, yes. The most important part of this conversation though... Do what you need to do to make money. Stay in business. Like you said, the .com days of unlimited VC money are over. Turn profit, margin is good. For me my margin is coming from MPEG 4. If you're still making a killing with Windows Media, by all means, stay with Windows Media. BJH TOP What would you say are the top two characteristics or features that VBrick's MPEG-4 product has that makes it different from the competitors? Standards and multi-vendor interoperability vs. proprietary ( see white paper ) Appliance model (no Windows OS) vs. software for a server followed by Multifunction TOP Other MPEG-4 vendors support many profiles, including \"simple\", \"advanced simple\", \"H.264\" and others. Why should my customers do without these if VBrick only offers \"simple profile\"? They shouldn't, and they won't have to. VBrick has an excellent reputation for delivering stable, useful, production-ready products. We will offer additional capabilities and MPEG-4 profiles in the future. Other vendors tend to make announcements when they first get something almost working in their labs...sometimes even before that! And all of these are software for PC's. But more importantly, MPEG-4 simple profile is currently the most widely interoperable profile. It is unlikely the other profiles will achieve this level of interoperability for some time, and standards and interoperability is the whole point of MPEG-4! What would be the point of an implementation of a standard that is single-vendor? TOP Microsoft, Real, Apple, Sorenson, and so many others claim 'high quality', and I've seen really good video at low rates. How does the VBrick's MPEG-4 quality compare? There will always be a trade-off between proprietary and standards. Generally, proprietary will always be 'better' for a given application. This is true because one vendor, acting alone, can make improvements that other vendors cannot implement. This is not unique to the video industry...for example Cisco may tell you that their special routing technology will do some useful tricks but if you use it, you cannot interoperate with other routers or switches in your network. For many, it is good practice to avoid proprietary whenever possible. In the case of MPEG-4, the quality of the encoding is based on proprietary techniques while still meeting the standards. This has do with the how well each vendor's approach to compression deals with motion, delay, rate control, audio/video sync, and many other factors. But the biggest cause for confusion has do with the live vs. multiple-pass encoding. You can indeed take a 10-minute video, and spend many hours compressing it to a file on your hard disk. The result of such \"multiple pass encoding\" can be excellent, and this is what is shown at trade shows and customer demos. For a fair evaluation of VBrick's MPEG-4 vs. any other solution, you must conduct live, real time, low delay encoding and decoding. Given this condition, VBrick's MPEG-4 is equal to or superior to any other MPEG-4 encoder today. When you compare MPEG-4 to Real, Microsoft or other proprietary encoder, the proprietary solutions may be judged superior in video quality. However, the difference is quality is apparent only to the most careful viewer and only on a side-by-side comparison. But it is not correct to compare \"MPEG-4\" to anything! \"MPEG-4\" defines many profiles and layers which are different for each application. VBrick initially supports simple profile (the most widely supported and interoperable profile). Other profiles, such as advanced simple, and H.264, will provide even higher quality at a given bit rate. TOP Competitors offer multi-rate encoding that allow one product to deliver streams at different rates to different audiences. What is VBrick's position? Multi-rate encoding, as promoted by Microsoft and Real doesn't work well and is rarely used. Among the issues are 1) client viewers get confused when they are on a corporate LAN, 2) an error in the stream affects everyone and 3) frame sizes must be the same for all videos. One VBrick appliance can be configured two deliver to streams at different encoding rates. With this superior approach, each stream is truly independent, and clients can simply choose the stream that is best for their connection speed. In addition, each stream can be simultaneously delivered via both RTSP unicast, multicast, and directed unicast. This approach provides the ultimate in reliability and flexibility in a system that always works. TOP Does VBrick have a strategy for delivery of video over wireless? \"Wireless\" is presumed to be wireless delivery of IP packets over 802.11b, 802.11a, microwave, satellite, optical laser, or cell phones. VBrick's MPEG-1 and MPEG-2 products are regularly used over high bandwidth wireless connections today. MPEG-4, in particular delivered via RTSP unicasting, may be viewed on wireless desktops and PDA's. From a video network perspective, there is little difference between wired and wireless, except that wireless must use low bandwidth...which MPEG-4 products now provide. VBrick is not in the business delivering video to 'cell phones' at speeds of 9600 bps. To the extent a cell phone, or any device, is capable of receiving standards-compliant MPEG-4 at any supported rate (e.g. 56 Kbps and up), VBrick is a good choice for the video source. Prior to the MPEG-4 product, wireless delivery of video was limited to point-to-point connections due to the bandwidth and because multicasting over wireless is not always supported. With the MPEG-4 product, direct wireless delivery to desktops, laptops, and (future) PDA's is a target application. TOP What are the Win Themes? Simplicity Adherence to standards and multi-vendor interoperability Reliability Flexibility Low cost Reach TOP What are the main applications? MPEG4 Multicasting in an Enterprise LAN MPEG4 Unicasting in and Enterprise LAN and VPN MPEG4 Webcasting directly MPEG4 Webcasting via Reflector Service MPEG4 Hybrid Networking READ WHITE PAPER TOP When should MPEG-4 be sold vs. MPEG-2 or MPEG-1? Use MPEG-2 Use MPEG-1 Use MPEG-4 DVD Quality required X VHS Quality required X X Best possible quality below 1 Mbps X Desktop Streaming X X X Hardware Decoder with Video Output X X Set Top Box available X X Video On Demand X X Webcasting X Widest Interoperability X Multicasting not available in network X Store & Forward Video X Delivery over ATM X X Delivery over IP X X X Delivery over RS-422 (T1) X Content Editing X X Stream to VBrick StreamPlayer X X X Stream To Apple Quicktime X Stream To Real Player X Scheduled Streaming X X X Closed Captioning Supported X X Delivers Web Pages via integral server X X Customer's Video Quality Sensitivity High Medium Low Customer's Bandwidth Sensitivity Low Medium High Customer's Cost Sensitivity Low High Medium TOP How does VBrick's MPEG-4 compare with Real Networks? Many people find the Real Networks system to be annoying. The Real Player is riddled with \"pop ups\" and advertising, and a propensity to \"take over your desktop\". Item Cost Server (mid sized) $2800 Microsoft OS* $0 to $800 Video Capture Card $100 to $1,000 Helix Server Software $0 to $5,879 Player $0 to $19.95 to $5.95/month each Total $2900 to $10,479 Item Real VBrick Type of System Software - various server hardware Hardware - fully embedded software Purpose Designed mainly for delivery of files - live video is an afterthought. Designed mainly for delivery of live video. Portability Server , not generally portable Appliance , very portable Rugged Server, fragile (\"blue screen of death\" common) Appliance, rugged (7 x 24 operation expected) Video System Software designed primarily for audio and video, but depends on the host operating system. Engineered for video Audio System Software designed primarily for audio and video - \"Soundblaster card\" needed Engineered for audio Network System Depends on NIC Engineered for networking Standards Helix Server supports multiple standards, including -- \"MPEG-4\". Also supports Microsoft and Real proprietary modes ISMA standard -- interoperable with other vendors Target Rates 28.8K to 1 Mbps 56Kbps to 2 Mbps Principal Application Web streaming Enterprise Streaming Ease of Use Complex - IIS, Unix, or other server OS knowledge necessary Easy -- direct streaming Multicasting Yes Yes Unicasting Yes Yes Support for MPEG-1 No encoding Yes - Real promotes VBrick 3200 for MPEG-1 encoding Yes Support for MPEG-2 No encoding (yes for file, program stream only) Yes Live Transcoding No Yes Simultaneous RTSP, fixed unicasting & multicasting Yes Yes Service Announcement Protocol Supported No Yes Built-In Profiles Yes Yes Free Player Yes, proprietary Yes, standards-based, plus streams to 3rd party players Audio/Video Inputs Via capture card, typically on the rear of the server. Fragile connections Direct connect, rugged locking connectors Latency Very high -- typically 30 seconds Very low -- typically under 2 seconds Save configuration Yes, to magnetic disk Yes, to flash memory RTSP supported Yes, Helix Server Yes, tested with multiple vendors Signaling/Control Standard, RTSP Standard RTSP, multicast Automatic Program Guide No Yes Max number of streams Depends on host hardware, but the software does not prevent thousands of streams. \"Free\" Helix server limited to 100 streams. 120 per VBrick. More than a typical enterprise WAN could handle Max Network Bandwidth Highly dependent on hardware - but MS claim absurdly very large numbers 38 Mbps Market Focus Consumers Professionals & Enterprise TOP Why is a VBrick appliance superior to a PC with software? It depends on what you want to do. If you want to encode a video to disk, create 'content', author or manipulate video, a PC with software is an excellent solution (however, there are dedicated devices that serves this market too). If you want to stream live video, an appliance is superior for several reasons. First, customers will not have to suffer the \"blue screen of death\" reliability issues. Second, the use of a PC for streaming is often false economy...one might think they are going to do multiple things with the computer while the reality is that it must become dedicated for streaming only (what do you think will happen to your stream if you suddenly start editing a Word document on that same computer?). Third, an appliance is quite rugged and portable, allowing it to be placed virtually anywhere. Finally, there are various 'soft' issues that a VBrick appliance addresses, such as very quiet operation (PC's usually have very noisy fans), easy installation, easy use, the fact that you cannot accidentally load some software that breaks the streaming capabilities, robustness and reliability, and its inherent resistance to computer viruses, worms, and bugs. For customers with strong feelings that they want a PC software solution, the \"appliance vs. PC\" debate is not one VBrick is likely to win. Key point: Although a VBrick does far more than a \"video capture card\", for certain applications and for customers familiar with Osprey or Winnov cards, VBrick can be positioned as a \"Network Attached Video Capture Card for MPEG-4\". For streaming applications, the whole point is for the video to go from the capture card to the Ethernet -- and one can argue that the PC just \"gets in the way\". This point is less true if the application is for offline content creation. TOP How should I position VBrick's MPEG-4 product in the security & monitoring and \"Homeland Security\" market? There are many new \"Network Cameras\", \"Webcams\", and similar products targeting the security market. VBrick does not currently participate in the \"camera\" market. VBrick should be used when: There are existing cameras that need to be networked The customer is partial to a certain type of camera, long lenses, etc. hence integrated cameras are not considered The application calls for viewing over low bandwidth connections, including wireless Low bandwidth MPEG-4 video is used for monitoring -- and high bandwidth MPEG-2 is used to record those security events The video will be viewed on PC desktops using standards Audio is desired or required VBrick reliability is required Examples of Network Camera vendors and security systems (new vendors entering the market quickly): Vendor Comments Axis Focus on low frame rate \"webcam\" video MPEG-2 solution poor quality No audio Good system solution for secuirty IndigoVision jpeg, low frame rate \"VB6000\" name Visual Security Focus on low frame rate jpeg \"webcam\" video No audio Comins Loronix Security Systems D-Link Security web cams Image capture No audio Not really 'video' $300 price NetPower icantek Korean Company Focus on low frame rate \"webcam\" and streaming video Includes audio (some models) As an additional observation about \"Network Cameras\" vs. a VBrick, for applications that calls for a remote control of the camera (pan/tilt/zoom), these devices are often a poor choice. TOP Who are other MPEG-4 vendors and how does VBrick compete with them? The market for MPEG-4 products is young. Other vendors may be more friend than foe (\"All the boats rise when the tide comes in\"). For the most part, the \"MPEG-4 Market\" has many vendors who wish to win the hearts and minds of content producers. MPEG-4 has capabilities that go much deeper than \"encoding\" and \"compression\", and these vendors wish to capture some portion of the content creation revenue chain, not necessarily the \"streaming and delivery\" chain, which is were VBrick lives. Nevertheless, young vendors are quite hungry and will attempt to compete with VBrick by promoting PC's with video capture cards vs. the VBrick appliance. Many of these same vendors will attempt to equip as many VBrick competitors as they can in order to realize royalty revenues. As the following chart illustrates, there are very few companies delivering real solutions today. Vendor Description VBrick Comments Apple PC/MAC w/ capture card. Quicktime player. Darwin server. Cost ~$3,000. Apple has been a long time MPEG-4 proponent. Not an appliance. Darwin server is not supported by Apple (Open Source License) Sigma Hardware decoders for PC's that do MPEG-1,2,4. Chip maker for set top boxes. Free MPEG-4 encoding software to promote sales of their MPEG-4 decoders. iVast Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufactures Not an appliance Depends on Microsoft Focus on off-line content creation Envivio Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufacturers. Provides the \"plug-in\" for Real Networks player to enable MPEG-4 decoding. PC with s/w suite ~ $3,000; full suite solution ~ $20,000 Not an appliance Depends on Microsoft Focus on off-line content creation MediaExcel Software products for servers. Basic MPEG-4 algorithm development. Tool sets for 3rd party product manufactures Not an appliance Depends on Microsoft Seems more able to provide real-time services (transcoding) than other. Thompson BitBand Another PC with software piled on Optibase MGW chassis + encoder card = aprox. $10,000 PCI cards configured in a Windows Server Nextreaming Network Appliance On2 ViewCast Niagara - PC portable - $20,000 TOP TOP What are the main differences between what VBrick has offered in the past, verses the new capabilities of the MPEG-4 product? In the past, VBrick focused almost exclusively on multicasting of video. This is true because even a few high bandwidth sources requires a lot of bandwidth, but multicasting makes it possible to deliver high bandwidth video everywhere. This was also true because the standards did not provide for low rate streaming. With the MPEG-4 low bandwidth technology, it is very reasonable for video to be sent via unicast, thereby eliminating the full dependency on customers having multicasting fully enabled in their networks. The other difference is that VBrick has carefully positioned its products for use in internets and intranets, but not for use on \"THE Internet\". MPEG-4 targets Internet use. TOP Can you provide examples of potential customers for the MPEG-4 product that would not be strong targets for the MPEG-1 and MPEG-4 products? There are dependencies for the choice of MPEG-4 vs. MPEG-2. In many cases, MPEG-2 would be a better choice than MPEG-4. However, the following are examples where the dependencies eliminated by the MPEG-4 product make it an ideal candidate: Customer Example New Application Example Religious Organizations Webcasting the weekly sermon to viewers in their homes via the Internet Public Schools Webcasting live classroom video to homebound students Corporate Sales Conducting live product launches to worldwide sales force via secure corporate VPN Military Distributing live video over tactical field networks Local Governments Webcasting live city council meetings on the Internet State Government Broadcasting live meetings to other state agencies over the wide area state network Law Enforcement Transmitting live video over wireless connections between mobile units Customer Service Send live video to customers to provide support and information TOP What are the costs for webcasting? Currently, the average cost of a single webcast from service providers can range between $30,000 and $100,000 (Source: D.C. Denison, The Boston Globe , 03/04/02). VBrick reduces the cost to zero if the customer has the bandwidth, and further reduces it to a low ($300 typical) monthly cost if external \"Reflector\" services are used. TOP What are some of the key business relationships that VBrick wishes to continue or establish, especially with the MPEG-4 capabilities? The relationships fall into several categories: Category Description Reason Examples Bandwidth Service Providers An organization that provides bandwidth services to their customers Service providers are looking for ways to generate additional revenue through increased use of their networks. Cable & Wireless, British Telecom, AT&T, Sprint Network Equipment Vendors An organization that produces switches, routers, and similar network equipment. Equipment vendors need video products to both show off their equipment and to generate increased demand. Extreme Networks, Foundry, Cisco Streaming Media Hosting Companies An organization that provides value-added streaming media services. Streaming media is their business, and they do not want to be left behind my advances in MPEG-4 streaming. PowerStream, Cable & Wireless, Yahoo Broadcast, Perfect Stream, many small companies Advertising Agencies An organization that produces videos for client advertising Agencies are looking for unique and innovative ways to deliver messages to consumers. A/V Integrators An organization that assembles and sells systems that deliver audio/visual content. Video is their business and they need new products to help drive their business. Network Integrators An organization that assembles and sells network infrastructure equipment. Video is a new revenue-generating capability Content Aggregators An organization the obtains the rights to distribute live video feeds from multiple sources. Digital video streaming, especially in enterprise networks such as a college campus, is a new source of revenue. Direct-TV, \"Multiple System Operators\" (MSO's), AT&T Broadband, Cox Cable, Independents The VBrick MPEG-4 capabilities introduces networking concepts that are new to me, like RTSP and RTP. What do I need to know about these? These are rather conventional networking standards. For a high level review of the networking terminology, click here . TOP Is there an easy way to calculate how much bandwidth a webcast requires? Yes, . What is the size of the market? Depending on who you ask and how you look at it, the market size is between US $3.5 billion and $12.1 billion. The important point is that it is big! Who are the major players in the market today? Depending on the particular segment, for one-way \"streaming\" video, the market is dominated by Microsoft and Real with Apple a distant 3rd place. For \"videoconferencing\", it is Polycom and Tandberg with Tandberg now on top. For VBrick's initial MPEG-4 products, two-way video is not part of the proposition hence \"videoconferencing\" vendors are not generally competitors. However, there is 'convergence' in the entire video market space and this could rapidly change. What are the market segments for video streaming? The high level market for streaming consists of several segments, and it is important not to be confused about the segment where VBrick participates which is different for the \"low bandwidth\" (MPEG-4) market and the \"high quality\" (MPEG-2) market. A VBrick appliance is a packaged solution for enterprise applications. No initially for MPEG-4. Yes in the near future as a multi-element system (VoD, SDS). A very few of these offer \"live\" services (typically they hire a team to come to the client's location to 'set it up'). Yes for live \"Reflector\" services. Where is VBrick's focus? The Enterprise Market. Competitors tend to focus on what they perceive as the \"big markets\", including Hollywood movie distribution, Pay-Per-View Internet Streaming, DVD Content Creation, and consumer markets for \"Personal Video Recorders\" and \"Time Shifting Recorders\" or content consumption. The Enterprise market can be defined as owners of their own digital networks, who also use pubic networks (the Internet) for economy, to communicate with a target audience. From a video streaming perspective, the Enterprise market tends to have a smaller target viewing audience (100's, or 1,000's) than the consumer market (100,000's or 1,000,000's). Enterprises include Corporations, Educational Institutions, Government Agencies and Departments, and other organizations with a professional staff and a need to communicate in a better, faster, or more compelling way. It is important to reiterate that \"Internet Streaming\" is a method Enterprise's use to reach their audience. This is different from an organization who's main objective is to provide video content using the Internet. The latter is a peripheral VBrick market. Who are the direct competitors for VBrick MPEG-4 products? If the question is \" Who will VBrick compete with for streaming video without regard to the technology used \", the answer is Microsoft and Real, and to a lesser degree Apple. If the question is \" Who will VBrick compete with for MPEG-4 solutions only \", the answer is a new crop of smaller companies including Envivio, Excel Media, iVast, and others who produce software for PC's. If the question is \" Who will VBrick compete with for dedicated multifunctional video appliances that deliver live MPEG-4 \", then the answer is really no one known at this time. However, some vendors are taking PC's (complete with Windows OS), adding software, and offering these as \"appliances\" systems. Among these are Pinnacle, Optibase, Winnov, and others. What are the primary applications for VBrick's MPEG-4 products? How will VBrick compete with Microsoft who offers Windows Media for free? VBrick is standards-based vs. Microsoft proprietary. To many customers concerned with being locked in to one vendor, this is a very important distinction. Windows Media is not really free, as the following illustrates: *Windows 2000 Server software with Window Media Server may or may not be included with purchase of the server hardware, depending on server vendor. To send Windows Media from a new server will cost at least $2900, although one could argue that customers can use existing equipment and lower the cost to virtually zero. This is not an argument VBrick can win if the following VBrick virtues are discounted. Windows Media Player is already installed on desktops. Why shouldn't my customers just use it? They should! Windows Media Player is a familiar interface for playing audio and video. VBrick empowers it with the ability to play live MPEG-1, MPEG-2 and MPEG-4 streams via a plug-in. But you should not confuse Windows Media Player with \"Windows Media Technologies\" which is a proprietary streaming solution. StreamPlayer provides the \"front end\" for Media Player, allowing the automatic Program Guide to be displayed and launching Media Player with the VBrick plug-ins installed to view the video. Many other customers have chosen Apple Quicktime or Real's RealOne player as a \"standard\" in their company. Any of these players can be used to view the VBrick MPEG-4 video. How does StreamPlayer compare to the well-known Real Player, Quicktime, and Microsoft players? StreamPlayer is a multiple format MPEG video viewer for the enterprise which automatically lists live programs. The other players require the user to enter obscure IP addresses, or requires a webmaster to post web page links, for the viewer to see video. This is an important distinction for viewing of MPEG-1 and MPEG-2, and a unique distinction for viewing MPEG-4. StreamPlayer compares favorably for it's video quality, providing built-in deblocking and deringing to produce the best possible image quality. StreamPlayer Plus includes the ability to record the MPEG-4 video to your local disk, and includes built-in file transfer capabilities so your captured video can be instantly posted on a video server. These are capabilities not provided in other viewers. * StreamPlayer uses Media Player by empowering it with MPEG features ** For MPEG-1 and MPEG-2 StreamPlayer, as described above, is not intended to compete with other MPEG-4 compliant viewers for general Word Wide Web streaming video viewing. It delivers it's value in a multicast-enabled enterprise networks. For viewing of public webcasting, VBrick uses Apple, Real, or other compliant viewers and also offers a fee plug-in for Windows Media. TOP Both Microsoft and Real offer more than 'streaming', they provide integrated \"URL Flips\" and PowerPoint presentations mixed with the video. How does VBrick compete with this? First, we compete in markets where this is not part of the solution, including: Live media distribution Live television to the desktop VCR tape and DVD playback to the desktop Classroom video to homebound students Second, PowerPoint slide presentations and similar multimedia capabilities may be integrated into the VBrick solution using 3rd party tools. You can also provide custom applications using the VBrick SDK, as illustrated at www.videoalive.com . Third, VBrick delivers live presentations via the dual channel MPEG-4 encoder, where one channel is live video and the other channel is the multimedia presentation content. TOP What are the newsgroups and technology experts saying about MPEG-4 and Microsoft? The following is an unedited newsgroup thread from December 2002. We've not included the author's email for privacy reasons: ------------------ I'll wrap all this up in one e-mail. First, I have some h.264 CODEC tests; however, since I am under NDA I am unable to release them at this time. You can check for the latest CODEC comparisons. I will be adding a new CODEC comparison chart by using HD footage that was brought in uncompressed. The new tests will also have more bitrates and be more standard. As it is now the tests are non-technical and give a general idea only and should *not* be used for 100% CODEC comparisons (since the raw is MPEG 1 file, that's the first problem right there.) Second part: > WM comes preinstalled on 85% of the clients on the Internet. > WM auto Upgrades so those who have an old version have a new version. Not 100% true. Play Windows Media 9 content on a Windows 95 or NT box. Maybe you can do it now, but at last check you could not. The new cool CODECs will require a full player upgrade. Almost all of my clients 1 year ago were using player 6.4 on NT systems and the IT department was slowly moving to 2000 with player 6.4 still. It sucks. For some reason, and I don't know why, it's really simple to get MPEG 4 players into corporate America whereas getting them to upgrade to Windows Media 8 is like pulling teeth. Maybe it's just me. I think lead IT managers are crazy, then again, that's what makes them so fun! > WM is generally less demanding for play back than Mpeg4 of the same > quality. (not the same bitrate) Don't know if I agree with that. Maybe with the QuickTime MPEG 4 encoded material, but a Telestream encoded MPEG 4 file (simple profile) is very low bitrate and not too demanding. Remember, the MPEG 4 encoded that comes with QuickTime is *not* a professional encoder. I can get some very pretty looking pictures out of a pro MPEG 4 encoder. Even the Sorenson Squeeze MPEG 4 encoder is better than the QuickTime encoder. I wonder if that's why MS always seems to compare WM 9 content to a QT MPEG 4 encoded clip? Hmmmmmmm.... > Mpeg4 currently has so many incompatible dialects that even if 50% of > content was Mpeg4 only 35% of it would be playable on any one player. > Or less if they pick the wrong dialect. Depends. Simple profile plays on every player I throw it at. Advanced simple is a different story. You're right though, they really, need to work this out. I think Envivio is adding to the confusion. They have their own interactive stuff that plugs in to their CODEC. Standards... all I want is for everyone to follow the standards! > WM is not for editing, that is why there are so few tools for it. > Mpeg4 > shouldn't be for editing so the people who are making tools for it are > working off hype, not reason. Agreed. The tools I refer to are stand alone encoders/decoders, teleconferencing boxes (actually, the MPEG teleconferencing solutions are cheap, high quality and have less than .3 second lag. They are COOL), automated encoding software, interactive encoding solutions, security camera applications, etc. I don't have any MPEg 4 editing tools minus what I have for WM. > Because it has a pretty logo. And that logo is associatied with things > like Media Center PC's, Digital Cinema, DRM, and any media that has a > valid revenue stream. Don't know. My clients are not married to MS. In fact, many of them are pissed at MS. MPEG 4 is an easy sell. Cross platform, cross player, cross browser, cross devices. That logo gets me nothing anymore (it did a year ago, so I'm not complaining). > Gone are the days when your stock is valued on > how many people have heard of you and your .com. The new market is all > about how far in the black you can run. Agreed. > If you use Mpeg4 you better be > doing a lot of Product placement, and comercials because your content > might as well be free. Mpeg4 is great if you are Sprint PCS and you > are > really selling your content PPM because people are using their air > time. Not to be picky, but Sprint has an unlimited bandwidth plan, so I don't think they care. I do understand your point though, and it is valid. > I like Quick Time for its Sprite Layers. I like Mpeg4 for it universal > platform. But I like WM because it gives me a means to make money off > my content. And that is why it will succeed. I agree except that I am finding that I can make more margin off of MPEG 4 *and* it's an easy sell. Gone are the days of the player wars. Gone are the days of multiple encodes. I encode once, deliver to any player on any platform, make more margin, save my customer money and have not had a single complaint. I am by no means saying that WM is dead... yet. I'm saying that I am personally making a lot of $$ with MPEG 4 today and I expect to make more in the near future. I am not married to WM, QuickTime, Real or MPEG 4. Heck, there are parts of MPEG 4 that piss me off to no end. I'm just looking to the future and I see MPEG 4 doing what MPEG 1 did, but on the web. Is it 100% here today? Not yet. Will it get here soon? In my opinion, yes. The most important part of this conversation though... Do what you need to do to make money. Stay in business. Like you said, the .com days of unlimited VC money are over. Turn profit, margin is good. For me my margin is coming from MPEG 4. If you're still making a killing with Windows Media, by all means, stay with Windows Media. BJH TOP What would you say are the top two characteristics or features that VBrick's MPEG-4 product has that makes it different from the competitors? Standards and multi-vendor interoperability vs. proprietary ( see white paper ) Appliance model (no Windows OS) vs. software for a server followed by Multifunction TOP Other MPEG-4 vendors support many profiles, including \"simple\", \"advanced simple\", \"H.264\" and others. Why should my customers do without these if VBrick only offers \"simple profile\"? They shouldn't, and they won't have to. VBrick has an excellent reputation for delivering stable, useful, production-ready products. We will offer additional capabilities and MPEG-4 profiles in the future. Other vendors tend to make announcements when they first get something almost working in their labs...sometimes even before that! And all of these are software for PC's. But more importantly, MPEG-4 simple profile is currently the most widely interoperable profile. It is unlikely the other profiles will achieve this level of interoperability for some time, and standards and interoperability is the whole point of MPEG-4! What would be the point of an implementation of a standard that is single-vendor? TOP Microsoft, Real, Apple, Sorenson, and so many others claim 'high quality', and I've seen really good video at low rates. How does the VBrick's MPEG-4 quality compare? There will always be a trade-off between proprietary and standards. Generally, proprietary will always be 'better' for a given application. This is true because one vendor, acting alone, can make improvements that other vendors cannot implement. This is not unique to the video industry...for example Cisco may tell you that their special routing technology will do some useful tricks but if you use it, you cannot interoperate with other routers or switches in your network. For many, it is good practice to avoid proprietary whenever possible. In the case of MPEG-4, the quality of the encoding is based on proprietary techniques while still meeting the standards. This has do with the how well each vendor's approach to compression deals with motion, delay, rate control, audio/video sync, and many other factors. But the biggest cause for confusion has do with the live vs. multiple-pass encoding. You can indeed take a 10-minute video, and spend many hours compressing it to a file on your hard disk. The result of such \"multiple pass encoding\" can be excellent, and this is what is shown at trade shows and customer demos. For a fair evaluation of VBrick's MPEG-4 vs. any other solution, you must conduct live, real time, low delay encoding and decoding. Given this condition, VBrick's MPEG-4 is equal to or superior to any other MPEG-4 encoder today. When you compare MPEG-4 to Real, Microsoft or other proprietary encoder, the proprietary solutions may be judged superior in video quality. However, the difference is quality is apparent only to the most careful viewer and only on a side-by-side comparison. But it is not correct to compare \"MPEG-4\" to anything! \"MPEG-4\" defines many profiles and layers which are different for each application. VBrick initially supports simple profile (the most widely supported and interoperable profile). Other profiles, such as advanced simple, and H.264, will provide even higher quality at a given bit rate. TOP Competitors offer multi-rate encoding that allow one product to deliver streams at different rates to different audiences. What is VBrick's position? Multi-rate encoding, as promoted by Microsoft and Real doesn't work well and is rarely used. Among the issues are 1) client viewers get confused when they are on a corporate LAN, 2) an error in the stream affects everyone and 3) frame sizes must be the same for all videos. One VBrick appliance can be configured two deliver to streams at different encoding rates. With this superior approach, each stream is truly independent, and clients can simply choose the stream that is best for their connection speed. In addition, each stream can be simultaneously delivered via both RTSP unicast, multicast, and directed unicast. This approach provides the ultimate in reliability and flexibility in a system that always works. TOP Does VBrick have a strategy for delivery of video over wireless? \"Wireless\" is presumed to be wireless delivery of IP packets over 802.11b, 802.11a, microwave, satellite, optical laser, or cell phones. VBrick's MPEG-1 and MPEG-2 products are regularly used over high bandwidth wireless connections today. MPEG-4, in particular delivered via RTSP unicasting, may be viewed on wireless desktops and PDA's. From a video network perspective, there is little difference between wired and wireless, except that wireless must use low bandwidth...which MPEG-4 products now provide. VBrick is not in the business delivering video to 'cell phones' at speeds of 9600 bps. To the extent a cell phone, or any device, is capable of receiving standards-compliant MPEG-4 at any supported rate (e.g. 56 Kbps and up), VBrick is a good choice for the video source. Prior to the MPEG-4 product, wireless delivery of video was limited to point-to-point connections due to the bandwidth and because multicasting over wireless is not always supported. With the MPEG-4 product, direct wireless delivery to desktops, laptops, and (future) PDA's is a target application. TOP What are the Win Themes? Simplicity Adherence to standards and multi-vendor interoperability Reliability Flexibility Low cost Reach TOP What are the main applications? MPEG4 Multicasting in an Enterprise LAN MPEG4 Unicasting in and Enterprise LAN and VPN MPEG4 Webcasting directly MPEG4 Webcasting via Reflector Service MPEG4 Hybrid Networking READ WHITE PAPER TOP When should MPEG-4 be sold vs. MPEG-2 or MPEG-1? Use MPEG-2 Use MPEG-1 Use MPEG-4 DVD Quality required X VHS Quality required X X Best possible quality below 1 Mbps X Desktop Streaming X X X Hardware Decoder with Video Output X X Set Top Box available X X Video On Demand X X Webcasting X Widest Interoperability X Multicasting not available in network X Store & Forward Video X Delivery over ATM X X Delivery over IP X X X Delivery over RS-422 (T1) X Content Editing X X Stream to VBrick StreamPlayer X X X Stream To Apple Quicktime X Stream To Real Player X Scheduled Streaming X X X Closed Captioning Supported X X Delivers Web Pages via integral server X X Customer's Video Quality Sensitivity High Medium Low Customer's Bandwidth Sensitivity Low Medium High Customer's Cost Sensitivity Low High Medium TOP How does VBrick's MPEG-4 compare with Real Networks? Many people find the Real Networks system to be annoying. The Real Player is riddled with \"pop ups\" and advertising, and a propensity to \"take over your desktop\". Item Cost Server (mid sized) $2800 Microsoft OS* $0 to $800 Video Capture Card $100 to $1,000 Helix Server Software $0 to $5,879 Player $0 to $19.95 to $5.95/month each Total $2900 to $10,479 Item Real VBrick Type of System Software - various server hardware Hardware - fully embedded software Purpose Designed mainly for delivery of files - live video is an afterthought. Designed mainly for delivery of live video. Portability Server , not generally portable Appliance , very portable Rugged Server, fragile (\"blue screen of death\" common) Appliance, rugged (7 x 24 operation expected) Video System Software designed primarily for audio and video, but depends on the host operating system. Engineered for video Audio System Software designed primarily for audio and video - \"Soundblaster card\" needed Engineered for audio Network System Depends on NIC Engineered for networking Standards Helix Server supports multiple standards, including -- \"MPEG-4\". Also supports Microsoft and Real proprietary modes ISMA standard -- interoperable with other vendors Target Rates 28.8K to 1 Mbps 56Kbps to 2 Mbps Principal Application Web streaming Enterprise Streaming Ease of Use Complex - IIS, Unix, or other server OS knowledge necessary Easy -- direct streaming Multicasting Yes Yes Unicasting Yes Yes Support for MPEG-1 No encoding Yes - Real promotes VBrick 3200 for MPEG-1 encoding Yes Support for MPEG-2 No encoding (yes for file, program stream only) Yes Live Transcoding No Yes Simultaneous RTSP, fixed unicasting & multicasting Yes Yes Service Announcement Protocol Supported No Yes Built-In Profiles Yes Yes Free Player Yes, proprietary Yes, standards-based, plus streams to 3rd party players Audio/Video Inputs Via capture card, typically on the rear of the server. Fragile connections Direct connect, rugged locking connectors Latency Very high -- typically 30 seconds Very low -- typically under 2 seconds Save configuration Yes, to magnetic disk Yes, to flash memory RTSP supported Yes, Helix Server Yes, tested with multiple vendors Signaling/Control Standard, RTSP Standard RTSP, multicast Automatic Program Guide No Yes Max number of streams Depends on host hardware, but the software does not prevent thousands of streams. \"Free\" Helix server limited to 100 streams. 120 per VBrick. More than a typical enterprise WAN could handle Max Network Bandwidth Highly dependent on hardware - but MS claim absurdly very large numbers 38 Mbps Market Focus Consumers Professionals & Enterprise TOP Why is a VBrick appliance superior to a PC with software? It depends on what you want to do. If you want to encode a video to disk, create 'content', author or manipulate video, a PC with software is an excellent solution (however, there are dedicated devices that serves this market too). If you want to stream live video, an appliance is superior for several reasons. First, customers will not have to suffer the \"blue screen of death\" reliability issues. Second, the use of a PC for streaming is often false economy...one might think they are going to do multiple things with the computer while the reality is that it must become dedicated for streaming only (what do you think will happen to your stream if you suddenly start editing a Word document on that same computer?). Third, an appliance is quite rugged and portable, allowing it to be placed virtually anywhere. Finally, there are various 'soft' issues that a VBrick appliance addresses, such as very quiet operation (PC's usually have very noisy fans), easy installation, easy use, the fact that you cannot accidentally load some software that breaks the streaming capabilities, robustness and reliability, and its inherent resistance to computer viruses, worms, and bugs. For customers with strong feelings that they want a PC software solution, the \"appliance vs. PC\" debate is not one VBrick is likely to win. Key point: Although a VBrick does far more than a \"video capture card\", for certain applications and for customers familiar with Osprey or Winnov cards, VBrick can be positioned as a \"Network Attached Video Capture Card for MPEG-4\". For streaming applications, the whole point is for the video to go from the capture card to the Ethernet -- and one can argue that the PC just \"gets in the way\". This point is less true if the application is for offline content creation. TOP How should I position VBrick's MPEG-4 product in the security & monitoring and \"Homeland Security\" market? There are many new \"Network Cameras\", \"Webcams\", and similar products targeting the security market. VBrick does not currently participate in the \"camera\" market. VBrick should be used when: There are existing cameras that need to be networked The customer is partial to a certain type of camera, long lenses, etc. hence integrated cameras are not considered The application calls for viewing over low bandwidth connections, including wireless Low bandwidth MPEG-4 video is used for monitoring -- and high bandwidth MPEG-2 is used to record those security events The video will be viewed on PC desktops using standards Audio is desired or required VBrick reliability is required Examples of Network Camera vendors and security systems (new vendors entering the market quickly): Vendor Comments Axis Focus on low frame rate \"webcam\" video MPEG-2 solution poor quality No audio Good system solution for secuirty IndigoVision jpeg, low frame rate \"VB6000\" name Visual Security Focus on low frame rate jpeg \"webcam\" video No audio Comins Loronix Security Systems D-Link Security web cams Image capture No audio Not really 'video' $300 price NetPower icantek Korean Company Focus on low frame rate \"webcam\" and streaming video Includes audio (some models) As an additional observation about \"Network Cameras\" vs. a VBrick, for applications that calls for a remote control of the camera (pan/tilt/zoom), these devices are often a poor choice. TOP Who are other MPEG-4 vendors and how does VBrick compete with them? The market for MPEG-4 products is young. Other vendors may be more friend than foe (\"All the boats rise when the tide comes in\"). For the most part, the \"MPEG-4 Market\" has many vendors who wish to win the hearts and minds of content producers. MPEG-4 has capabilities that go much deeper than \"encoding\" and \"compression\", and these vendors wish to capture some portion of the content creation revenue chain, not necessarily the \"streaming and delivery\" chain, which is were VBrick lives. Nevertheless, young vendors are quite hungry and will attempt to compete with VBrick by promoting PC's with video capture cards vs. the VBrick appliance. Many of these same vendors will attempt to equip as many VBrick competitors as they can in order to realize royalty revenues. As the following chart illustrates, there are very few companies delivering real solutions today. Vendor Description StreamPlayer, as described above, is not intended to compete with other MPEG-4 compliant viewers for general Word Wide Web streaming video viewing. It delivers it's value in a multicast-enabled enterprise networks. For viewing of public webcasting, VBrick uses Apple, Real, or other compliant viewers and also offers a fee plug-in for Windows Media. Both Microsoft and Real offer more than 'streaming', they provide integrated \"URL Flips\" and PowerPoint presentations mixed with the video. How does VBrick compete with this? First, we compete in markets where this is not part of the solution, including: Live television to the desktop VCR tape and DVD playback to the desktop Classroom video to homebound students Second, PowerPoint slide presentations and similar multimedia capabilities may be integrated into the VBrick solution using 3rd party tools. You can also provide custom applications using the VBrick SDK, as illustrated at www.videoalive.com . Third, VBrick delivers live presentations via the dual channel MPEG-4 encoder, where one channel is live video and the other channel is the multimedia presentation content. What are the newsgroups and technology experts saying about MPEG-4 and Microsoft? The following is an unedited newsgroup thread from December 2002. We've not included the author's email for privacy reasons: What would you say are the top two characteristics or features that VBrick's MPEG-4 product has that makes it different from the competitors? Standards and multi-vendor interoperability vs. proprietary ( see white paper ) Appliance model (no Windows OS) vs. software for a server Other MPEG-4 vendors support many profiles, including \"simple\", \"advanced simple\", \"H.264\" and others. Why should my customers do without these if VBrick only offers \"simple profile\"? They shouldn't, and they won't have to. VBrick has an excellent reputation for delivering stable, useful, production-ready products. We will offer additional capabilities and MPEG-4 profiles in the future. Other vendors tend to make announcements when they first get something almost working in their labs...sometimes even before that! And all of these are software for PC's. But more importantly, MPEG-4 simple profile is currently the most widely interoperable profile. It is unlikely the other profiles will achieve this level of interoperability for some time, and standards and interoperability is the whole point of MPEG-4! What would be the point of an implementation of a standard that is single-vendor? Microsoft, Real, Apple, Sorenson, and so many others claim 'high quality', and I've seen really good video at low rates. How does the VBrick's MPEG-4 quality compare? There will always be a trade-off between proprietary and standards. Generally, proprietary will always be 'better' for a given application. This is true because one vendor, acting alone, can make improvements that other vendors cannot implement. This is not unique to the video industry...for example Cisco may tell you that their special routing technology will do some useful tricks but if you use it, you cannot interoperate with other routers or switches in your network. For many, it is good practice to avoid proprietary whenever possible. In the case of MPEG-4, the quality of the encoding is based on proprietary techniques while still meeting the standards. This has do with the how well each vendor's approach to compression deals with motion, delay, rate control, audio/video sync, and many other factors. But the biggest cause for confusion has do with the live vs. multiple-pass encoding. You can indeed take a 10-minute video, and spend many hours compressing it to a file on your hard disk. The result of such \"multiple pass encoding\" can be excellent, and this is what is shown at trade shows and customer demos. For a fair evaluation of VBrick's MPEG-4 vs. any other solution, you must conduct live, real time, low delay encoding and decoding. Given this condition, VBrick's MPEG-4 is equal to or superior to any other MPEG-4 encoder today. When you compare MPEG-4 to Real, Microsoft or other proprietary encoder, the proprietary solutions may be judged superior in video quality. However, the difference is quality is apparent only to the most careful viewer and only on a side-by-side comparison. But it is not correct to compare \"MPEG-4\" to anything! \"MPEG-4\" defines many profiles and layers which are different for each application. VBrick initially supports simple profile (the most widely supported and interoperable profile). Other profiles, such as advanced simple, and H.264, will provide even higher quality at a given bit rate. Competitors offer multi-rate encoding that allow one product to deliver streams at different rates to different audiences. What is VBrick's position? Multi-rate encoding, as promoted by Microsoft and Real doesn't work well and is rarely used. Among the issues are 1) client viewers get confused when they are on a corporate LAN, 2) an error in the stream affects everyone and 3) frame sizes must be the same for all videos. One VBrick appliance can be configured two deliver to streams at different encoding rates. With this superior approach, each stream is truly independent, and clients can simply choose the stream that is best for their connection speed. In addition, each stream can be simultaneously delivered via both RTSP unicast, multicast, and directed unicast. This approach provides the ultimate in reliability and flexibility in a system that always works. Does VBrick have a strategy for delivery of video over wireless? \"Wireless\" is presumed to be wireless delivery of IP packets over 802.11b, 802.11a, microwave, satellite, optical laser, or cell phones. VBrick's MPEG-1 and MPEG-2 products are regularly used over high bandwidth wireless connections today. MPEG-4, in particular delivered via RTSP unicasting, may be viewed on wireless desktops and PDA's. From a video network perspective, there is little difference between wired and wireless, except that wireless must use low bandwidth...which MPEG-4 products now provide. VBrick is not in the business delivering video to 'cell phones' at speeds of 9600 bps. To the extent a cell phone, or any device, is capable of receiving standards-compliant MPEG-4 at any supported rate (e.g. 56 Kbps and up), VBrick is a good choice for the video source. Prior to the MPEG-4 product, wireless delivery of video was limited to point-to-point connections due to the bandwidth and because multicasting over wireless is not always supported. With the MPEG-4 product, direct wireless delivery to desktops, laptops, and (future) PDA's is a target application. What are the Win Themes? Adherence to standards and multi-vendor interoperability What are the main applications? MPEG4 Multicasting in an Enterprise LAN MPEG4 Unicasting in and Enterprise LAN and VPN MPEG4 Webcasting via Reflector Service When should MPEG-4 be sold vs. MPEG-2 or MPEG-1? How does VBrick's MPEG-4 compare with Real Networks? Many people find the Real Networks system to be annoying. The Real Player is riddled with \"pop ups\" and advertising, and a propensity to \"take over your desktop\". Yes - Real promotes VBrick 3200 for MPEG-1 encoding Why is a VBrick appliance superior to a PC with software? It depends on what you want to do. If you want to encode a video to disk, create 'content', author or manipulate video, a PC with software is an excellent solution (however, there are dedicated devices that serves this market too). If you want to stream live video, an appliance is superior for several reasons. First, customers will not have to suffer the \"blue screen of death\" reliability issues. Second, the use of a PC for streaming is often false economy...one might think they are going to do multiple things with the computer while the reality is that it must become dedicated for streaming only (what do you think will happen to your stream if you suddenly start editing a Word document on that same computer?). Third, an appliance is quite rugged and portable, allowing it to be placed virtually anywhere. Finally, there are various 'soft' issues that a VBrick appliance addresses, such as very quiet operation (PC's usually have very noisy fans), easy installation, easy use, the fact that you cannot accidentally load some software that breaks the streaming capabilities, robustness and reliability, and its inherent resistance to computer viruses, worms, and bugs. For customers with strong feelings that they want a PC software solution, the \"appliance vs. PC\" debate is not one VBrick is likely to win. Key point: Although a VBrick does far more than a \"video capture card\", for certain applications and for customers familiar with Osprey or Winnov cards, VBrick can be positioned as a \"Network Attached Video Capture Card for MPEG-4\". For streaming applications, the whole point is for the video to go from the capture card to the Ethernet -- and one can argue that the PC just \"gets in the way\". This point is less true if the application is for offline content creation. How should I position VBrick's MPEG-4 product in the security & monitoring and \"Homeland Security\" market? There are many new \"Network Cameras\", \"Webcams\", and similar products targeting the security market. VBrick does not currently participate in the \"camera\" market. VBrick should be used when: There are existing cameras that need to be networked The customer is partial to a certain type of camera, long lenses, etc. hence integrated cameras are not considered The application calls for viewing over low bandwidth connections, including wireless Low bandwidth MPEG-4 video is used for monitoring -- and high bandwidth MPEG-2 is used to record those security events The video will be viewed on PC desktops using standards Audio is desired or required VBrick reliability is required Examples of Network Camera vendors and security systems (new vendors entering the market quickly): Focus on low frame rate \"webcam\" video MPEG-2 solution poor quality Good system solution for secuirty jpeg, low frame rate Focus on low frame rate jpeg \"webcam\" video Focus on low frame rate \"webcam\" and streaming video Includes audio (some models) As an additional observation about \"Network Cameras\" vs. a VBrick, for applications that calls for a remote control of the camera (pan/tilt/zoom), these devices are often a poor choice. Who are other MPEG-4 vendors and how does VBrick compete with them? The market for MPEG-4 products is young. Other vendors may be more friend than foe (\"All the boats rise when the tide comes in\"). For the most part, the \"MPEG-4 Market\" has many vendors who wish to win the hearts and minds of content producers. MPEG-4 has capabilities that go much deeper than \"encoding\" and \"compression\", and these vendors wish to capture some portion of the content creation revenue chain, not necessarily the \"streaming and delivery\" chain, which is were VBrick lives. Nevertheless, young vendors are quite hungry and will attempt to compete with VBrick by promoting PC's with video capture cards vs. the VBrick appliance. Many of these same vendors will attempt to equip as many VBrick competitors as they can in order to realize royalty revenues. As the following chart illustrates, there are very few companies delivering real solutions today. Apple has been a long time MPEG-4 proponent. Darwin server is not supported by Apple (Open Source License) Focus on off-line content creation PC with s/w suite ~ $3,000; full suite solution ~ $20,000 Focus on off-line content creation Seems more able to provide real-time services (transcoding) than other. What are the main differences between what VBrick has offered in the past, verses the new capabilities of the MPEG-4 product? In the past, VBrick focused almost exclusively on multicasting of video. This is true because even a few high bandwidth sources requires a lot of bandwidth, but multicasting makes it possible to deliver high bandwidth video everywhere. This was also true because the standards did not provide for low rate streaming. With the MPEG-4 low bandwidth technology, it is very reasonable for video to be sent via unicast, thereby eliminating the full dependency on customers having multicasting fully enabled in their networks. The other difference is that VBrick has carefully positioned its products for use in internets and intranets, but not for use on \"THE Internet\". MPEG-4 targets Internet use. Can you provide examples of potential customers for the MPEG-4 product that would not be strong targets for the MPEG-1 and MPEG-4 products? There are dependencies for the choice of MPEG-4 vs. MPEG-2. In many cases, MPEG-2 would be a better choice than MPEG-4. However, the following are examples where the dependencies eliminated by the MPEG-4 product make it an ideal candidate: What are the costs for webcasting? Currently, the average cost of a single webcast from service providers can range between $30,000 and $100,000 (Source: D.C. Denison, The Boston Globe , 03/04/02). VBrick reduces the cost to zero if the customer has the bandwidth, and further reduces it to a low ($300 typical) monthly cost if external \"Reflector\" services are used. What are some of the key business relationships that VBrick wishes to continue or establish, especially with the MPEG-4 capabilities? The relationships fall into several categories: The VBrick MPEG-4 capabilities introduces networking concepts that are new to me, like RTSP and RTP. What do I need to know about these? These are rather conventional networking standards. For a high level review of the networking terminology, click here . Is there an easy way to calculate how much bandwidth a webcast requires?",
    "Case Studies Naval Air Warfare Center NAVAIR conducts various weapons tests at the China Lake base and they needed a high quality, low cost application for monitoring missile tests. California Dept. of Transportation Caltrans is using VBrick solutions to monitor and manage highway traffic on their statewide network. News Articles VBricks in iraq Distributing news and entertainment to US troops via desktop video. VBrick Systems Named a Red Herring Top 100 Company Network video appliance leader recognized by Red Herring Editors for innovation and business strategy. Customers US Air Force Florida DOT City of Monterey Press Releases US Air Force Deploys Digital Video Worldwide with VBrick Solutions Networked video allows Florida DOT and the City of Orlando to react quickly to traffic congestion. US Air Force Florida DOT City of Monterey What it is Court arraignments have not typically been remote before. They generally require the accused to appear in person before the court, which can take more time for traveling to the courtroom and waiting to see the judge than for the arraignment itself. What it can be But imagine having a network-based video solution that allows you to: Arraign the arrested from their holding cell, using our MPEG encoders/decoders for a much more efficient process. Arraign the arrested from their holding cell, using our MPEG encoders/decoders for a much more efficient process. What it can do for you The benefits of remote court arraignment stretch beyond making this court procedure more simple and secure. Reduce the wait time between arrest and arraignment  The court dockets can become extremely crowded at times. Remote court arraignment can ease the bottleneck by streamlining the arraignment process. No time is wasted even in clearing the court after one arraignment and waiting for the next to be ushered in. Lower costs  if you don't need multiple guards to escort each arrested person to and from the arraignment, much less wait outside the courtroom as the schedule inevitably starts to fall behind, then you can reduce your staffingand put that courtroom to other use. Reduce the wait time between arrest and arraignment  The court dockets can become extremely crowded at times. Remote court arraignment can ease the bottleneck by streamlining the arraignment process. No time is wasted even in clearing the court after one arraignment and waiting for the next to be ushered in. Lower costs  if you don't need multiple guards to escort each arrested person to and from the arraignment, much less wait outside the courtroom as the schedule inevitably starts to fall behind, then you can reduce your staffingand put that courtroom to other use.",
    "Engineered for enterprise video Vbrick enables organizations to leverage the power of video to engage audiences with live video, to empower with on-demand video and to transform video content management and distribution business processes and capabilities. Streaming and on-demand video solutions for every use Human Resources & Training When you need to record and distribute CEO updates or live stream town hall events to thousands across the globe, Rev makes it easy. Human Resources & Training Human Resources & Training Retain and engage employees with a secure enterprise video library that can establish company culture, accelerate onboarding, or help them learn new skills. Rev enables marketing to leverage video to engage and connect with prospects and customers. Rev empowers sales with video to persuade prospects and win customers. Bandwidth limitations and fear of network weaknesses are a key restraint to deploying enterprise video. Designed as a single solution and optimized for common pain points, Rev enables IT to deliver excellent video experiences without redesigning architecture. Join these video innovators The Power of Rev Transform video from any source so anyone, anywhere can innovate. Transform video from any source so anyone, anywhere can innovate. Unify all video assets to easily organize, secure and share them at scale. Unify all video assets to easily organize, secure and share them at scale. Broaden the reach of video and empower users where they live. Broaden the reach of video and empower users where they live. The Rev Platform provides best-in-class security , seamless integration , comprehensive analytics , and data enrichment to raise your video IQ. THE PROOF IS IN THE NUMBERS Patents for Video Technology"
  ]
}