{
  "company": "veratad.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.6666666666666666,
    "framing_surveillance": 0.0,
    "framing_market": 0.3333333333333333,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Red Flag Rules Compliance Compliance Solutions We make it easy to comply with the AUGUST 1, 2009 DEADLINE! ... We make it easy to comply with the AUGUST 1, 2009 DEADLINE! ... Identity Verification Veratad's IDMatch SM and IDMatch+PLUS SM Identity Verification and Authentication solutions offered with our patent pending Privacy Tools. ... Age Verification Veratad's AgeMatch SM A ge verification and address validation solutions are protecting our most precious asset...our children. ... Veratad's IDMatch SM and IDMatch+PLUS SM Identity Verification and Authentication solutions offered with our patent pending Privacy Tools. ... Veratad's AgeMatch SM A ge verification and address validation solutions are protecting our most precious asset...our children. ... Veratad Technologies, LLC SM is a world class provider of real-time online Identity Verification, Age Verification and Knowledge Based Authentication Solutions. Veratad solutions do not require the entry of the Social Security Number to verify. At the center of Veratad's success is our state-of-the-art IDresponse ® Privacy Processing Platform which delivers Veratad's AgeMatch SM our Age Verify solution, IDMatch SM and IDMatch+PLUS SM our ID Verification solutions. We also provide a wide range of proprietary unique data resources and a NEW reduced entry option. Prepare for your Red Flag Rules Program with Veratad. Industries We Serve Red Flag Compliance Wireless/Mobile Device Fraud Prevention Age Restricted Commerce Financial and Banking Payment Processors Veratad Technologies, LLC SM | of Use | of Use",
    "Solutions Industries Methods About us See live demo They Work With Us Rapid integration, engineer involvement optional Integrate and deploy only the best providers in the IDV tech industry via a single API or SDK Create Token 1 veratadModal = new veratad.modal({ 2 token : \"8dfe0180-5389-46d4-a28c-b74061d8e7c3\" , 3 }); Language or... Try API Integration Integrate with Solution Providers Bringing together the World's most disruptive IDV Tech Customer Identity Verification Solutions IDV Tech is constantly evolving, keep up with what's new without making changes to your process Age Verification Prevent unauthorized access to age-restricted merchandise and content. Customer Onboarding Secure, seamless customer onboarding with Veratad's identity verification solutions. Business Verification Build trust with business partners and enhance \"Know Your Business†KYB Compliance. Regulatory Compliance Protect your valuable reputation and avoid costly government-imposed fines and penalties. Fraud Prevention Stop online fraud and on-board more good customers. Identity Verification Verify customer identity for over 5 billion people worldwide. Achieved advanced security and compliance ISO 27001 Certified SOC 2 Type 2 Certified AICPA SOC Certified REGTECH 100 Winner Cybersecurity Winner Age Check Certified Protect Your Business Without Burdening Your Customers How can companies that do business online protect themselves from fraud, liability and regulatory penalties—without getting in their customers' way? By using Veratad's IDresponse and Veratad VX SM Orchestration Platforms. With flexible verification tools, leverage the customer information you're already collecting and supplement with document capture and biometrics to identify and verify your customers' identities in real-time. Protection goes up, while customer friction goes down. Download Solution Overview How Veratad VX Works Our platforms offer exclusive instant access to the world's premier identity data and service providers. You can effortlessly design, test, and scale verification workflows without any coding. Identity Data Verification + Protect Your Business Without Burdening Your Customers Compare individual customer information against billions of records from top data sources worldwide in real-time. ID Document Verification + Automate collection and verification of driver's license, passport, and other ID documents. Smart Two-Factor Authentication + Go beyond \"something you know and something you have†to include assurance that the \"what you have†actually belongs to your customer. Biometrics + Check that your customer is who they say they are and verify that their ID document is a match using liveness and facial match technologies. Knowledge-Based Authentication + Verify customers are who they say they are using multiple choice questions as an added layer of security. Reusable Digital Identity Verification + Streamline and secure the customer onboarding process by leveraging reusable digital identity credentials. IDresponse Platform IDresponse provides the right mix of global databases, document verification, KBA, 2FA and more, to deliver the solution you need in a single API. This secure platform provides all the reliability, scalability, and flexibility your business needs to start verifying. Expert Support Veratad's implementation team guides you through setup to follow industry best practices for identity verification solutions and escalations. Frictionless User Experience Comply with strict KYC regulations while preventing money laundering and removing onboarding friction. Global Coverage IDresponse has verified over 100 million individuals worldwide. Custom Approval Rules Create your own verification rules based on your company's needs, risk tolerance or regional regulations. Verification Escalation Automate additional verification steps or build out a manual escalation process. Start Verifying Your Customers Request your personalized demo today! Request a Demo 100M+ Individuals Verified 5B+ Citizens Worldwide They Work With Us Rapid integration, engineer involvement optional Integrate and deploy only the best providers in the IDV tech industry via a single API or SDK Integrate with Solution Providers Bringing together the World's most disruptive IDV Tech Customer Identity Verification Solutions IDV Tech is constantly evolving, keep up with what's new without making changes to your process Prevent unauthorized access to age-restricted merchandise and content. Secure, seamless customer onboarding with Veratad's identity verification solutions. Build trust with business partners and enhance \"Know Your Business†KYB Compliance. Protect your valuable reputation and avoid costly government-imposed fines and penalties. Stop online fraud and on-board more good customers. Verify customer identity for over 5 billion people worldwide. Achieved advanced security and compliance SOC 2 Type 2 Certified Protect Your Business Without Burdening Your Customers How can companies that do business online protect themselves from fraud, liability and regulatory penalties—without getting in their customers' way? By using Veratad's IDresponse and Veratad VX SM Orchestration Platforms. With flexible verification tools, leverage the customer information you're already collecting and supplement with document capture and biometrics to identify and verify your customers' identities in real-time. Protection goes up, while customer friction goes down. How Veratad VX Works Our platforms offer exclusive instant access to the world's premier identity data and service providers. You can effortlessly design, test, and scale verification workflows without any coding. Protect Your Business Without Burdening Your Customers Compare individual customer information against billions of records from top data sources worldwide in real-time. Automate collection and verification of driver's license, passport, and other ID documents. Go beyond \"something you know and something you have†to include assurance that the \"what you have†actually belongs to your customer. Check that your customer is who they say they are and verify that their ID document is a match using liveness and facial match technologies. Verify customers are who they say they are using multiple choice questions as an added layer of security. Reusable Digital Identity Verification Streamline and secure the customer onboarding process by leveraging reusable digital identity credentials. IDresponse provides the right mix of global databases, document verification, KBA, 2FA and more, to deliver the solution you need in a single API. This secure platform provides all the reliability, scalability, and flexibility your business needs to start verifying. Veratad's implementation team guides you through setup to follow industry best practices for identity verification solutions and escalations. Comply with strict KYC regulations while preventing money laundering and removing onboarding friction. IDresponse has verified over 100 million individuals worldwide. Create your own verification rules based on your company's needs, risk tolerance or regional regulations. Automate additional verification steps or build out a manual escalation process. Start Verifying Your Customers Request your personalized demo today! Veratad Technologies, LLC 500 Frank W. Burr Boulevard Teaneck, New Jersey 07666"
  ]
}