{
  "company": "videmo.de",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 14
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 14
    }
  },
  "sample_docs": [
    "Videmo - New standard in video analysis. Solutions Our solutions at a glance Security Manufacturers and integrators Retail and Market Research Our solutions at a glance Retail and Market Research Products Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration English Pick Language Deutsch English Welcome to Videmo New standards in video analysis Discover a wholly new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. More information Welcome to Videmo New standards in video analysis Discover a wholly new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. More information New standards in video analysis Discover a wholly new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. Security and Law Enforcement View large volumes of video footage, review events with our retrospective search, or upgrade your access control solution with facial recognition. Manufacturers and integrators Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! Retail and Market Research Do you know your customers? Collect marketing-relevant data such as age, gender, dwell time and duration of eye contact and maximize your turnover at the POS. Security and Law Enforcement View large volumes of video footage, review events with our retrospective search, or upgrade your access control solution with facial recognition. Manufacturers and integrators Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! Retail and Market Research Do you know your customers? Collect marketing-relevant data such as age, gender, dwell time and duration of eye contact and maximize your turnover at the POS. Security and Law Enforcement View large volumes of video footage, review events with our retrospective search, or upgrade your access control solution with facial recognition. Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! Retail and Market Research Do you know your customers? Collect marketing-relevant data such as age, gender, dwell time and duration of eye contact and maximize your turnover at the POS. Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Videmo 360 API With its open programming interface (API), Videmo 360 provides all of its functionality to software developers. This makes it easy to integrate Videmo 360 into an existing infrastructure, to initiate requests from third-party systems and to implement complex processes programmatically. Videmo SDK Videmo SDK is our offering for software and hardware manufacturers who require a deep integration of facial recognition features into their own product. The SDK combines our facial recognition technology with image acquisition functions, providing a software library for C/C++ programmers. Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Videos, photos, cameras - process various data sources with a single software and search for people across media. Videmo 360 API With its open programming interface (API), Videmo 360 provides all of its functionality to software developers. This makes it easy to integrate Videmo 360 into an existing infrastructure, to initiate requests from third-party systems and to implement complex processes programmatically. Videmo SDK Videmo SDK is our offering for software and hardware manufacturers who require a deep integration of facial recognition features into their own product. The SDK combines our facial recognition technology with image acquisition functions, providing a software library for C/C++ programmers. With its open programming interface (API), Videmo 360 provides all of its functionality to software developers. This makes it easy to integrate Videmo 360 into an existing infrastructure, to initiate requests from third-party systems and to implement complex processes programmatically. Videmo SDK is our offering for software and hardware manufacturers who require a deep integration of facial recognition features into their own product. The SDK combines our facial recognition technology with image acquisition functions, providing a software library for C/C++ programmers. At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition. Company profile At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition. Company profile At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition.",
    "Videmo - New standard in video analysis. Solutions Our solutions at a glance Law Enforcement Security Manufacturers and integrators Our solutions at a glance Products Video Analysis made easy Videmo 360 Face recognition redefined Video Analysis made easy Videmo 360 Face recognition redefined English Pick Language Deutsch English Welcome to Videmo New standards in video analysis Discover a whole new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. More information Welcome to Videmo New standards in video analysis Discover a whole new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. More information New standards in video analysis Discover a whole new way of analyzing your video content. State-of-the-art facial recognition technology as simple and flexible as never before. Law Enforcement An ever growing body of footage needs to be analyzed forensically in order to gather evidence. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Security Real-time alerts from any number of cameras. Retrospective search in recordings and other kinds of footage. All in one with Videmo 360. Manufacturers and integrators Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! Law Enforcement An ever growing body of footage needs to be analyzed forensically in order to gather evidence. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Security Real-time alerts from any number of cameras. Retrospective search in recordings and other kinds of footage. All in one with Videmo 360. Manufacturers and integrators Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! An ever growing body of footage needs to be analyzed forensically in order to gather evidence. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Real-time alerts from any number of cameras. Retrospective search in recordings and other kinds of footage. All in one with Videmo 360. Looking for a way to integrate facial recognition into your systems? With our flexible interface you can extend your own solutions with new features in no time! Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Intuitive user interface With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. With a simple and modern user interface, you can quickly get an overview of the content of your videos and start search queries with a single click. Multi-user ready Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. Use a single workstation or a distributed installation: Videmo 360 is scalable and fits your requirements with its flexible client-server architecture. All-in-one solution Videos, photos, cameras - process various data sources with a single software and search for people across media. Videos, photos, cameras - process various data sources with a single software and search for people across media. At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition. Company profile At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition. Company profile At home in the technology region Karlsruhe We are an innovative company in the field of automatic video analysis. Since our foundation we have been developing state-of-the-art solutions for facial recognition.",
    "Videmo - New standard in video analysis. Solutions Our solutions at a glance Law Enforcement Security Manufacturers and integrators Our solutions at a glance Products Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration English Pick Language Deutsch English Solutions Law Enforcement Law enforcement authorities are confronted with an ever growing body of footage that needs to be analyzed forensically. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Videmo 360 is just that. Solutions Law Enforcement Law enforcement authorities are confronted with an ever growing body of footage that needs to be analyzed forensically. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Videmo 360 is just that. Law enforcement authorities are confronted with an ever growing body of footage that needs to be analyzed forensically. The sheer amount of data calls for intelligent tools helping human operators to achieve their goals. Videmo 360 is just that. Get an overview Quickly review all incoming footage. Use the filtering event list to see all people and objects at a glance. Skip files and time periods that do not contain relevant targets. Search and find Find individual persons or persons matching a witness description. Search for all cars, trucks, bicycles, backpacks, etc. or search for individual license plates. Investigate and identify Investigate events by retrospective search and export the findings for documentation purposes. Make use of our dynamic query identities, which can be created with a single click. Keep your data secure Videmo 360 runs on your hardware and your hardware only (on-premises), no internet connection required. This is how you can be sure that there will be no unauthorized access to your sensitive footage. Get an overview Quickly review all incoming footage. Use the filtering event list to see all people and objects at a glance. Skip files and time periods that do not contain relevant targets. Search and find Find individual persons or persons matching a witness description. Search for all cars, trucks, bicycles, backpacks, etc. or search for individual license plates. Investigate and identify Investigate events by retrospective search and export the findings for documentation purposes. Make use of our dynamic query identities, which can be created with a single click. Keep your data secure Videmo 360 runs on your hardware and your hardware only (on-premises), no internet connection required. This is how you can be sure that there will be no unauthorized access to your sensitive footage. Get an overview Quickly review all incoming footage. Use the filtering event list to see all people and objects at a glance. Skip files and time periods that do not contain relevant targets. Quickly review all incoming footage. Use the filtering event list to see all people and objects at a glance. Skip files and time periods that do not contain relevant targets. Search and find Find individual persons or persons matching a witness description. Search for all cars, trucks, bicycles, backpacks, etc. or search for individual license plates. Find individual persons or persons matching a witness description. Search for all cars, trucks, bicycles, backpacks, etc. or search for individual license plates. Investigate and identify Investigate events by retrospective search and export the findings for documentation purposes. Make use of our dynamic query identities, which can be created with a single click. Investigate events by retrospective search and export the findings for documentation purposes. Make use of our dynamic query identities, which can be created with a single click. Keep your data secure Videmo 360 runs on your hardware and your hardware only (on-premises), no internet connection required. This is how you can be sure that there will be no unauthorized access to your sensitive footage. Keep your data secure Videmo 360 runs on your hardware and your hardware only (on-premises), no internet connection required. This is how you can be sure that there will be no unauthorized access to your sensitive footage.",
    "Videmo - New standard in video analysis. Solutions Our solutions at a glance Security Manufacturers and integrators Retail and Market Research Our solutions at a glance Retail and Market Research Products Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration English Pick Language Deutsch English Who we are We are Videmo At home in the technology region Karlsruhe. We are an innovative company in the field of automatic video analysis. Over the years we have grown to become one of the leading providers of facial recognition solutions in the security space. Contact us Technical expertise Our clients not only trust in our scientific and technical expertise in video analytics, but also in our long-standing experience in developing solutions for specific, difficult use-cases. State-of-the-art solutions Our motivation is to implement state-of-the-art image analysis technology into viable new solutions, creating added value for our customers. To achieve this goal, we work closely with users and integrators. Long-standing experience Our long-standing experience, our skilled team, the intensive exchange with the Karlsruhe Institute of Technology and the cooperation with its Institute of Anthropomatics and Robotics make us a source of inspiration for our partners and a competent provider of solutions and services in this field. Who we are We are Videmo At home in the technology region Karlsruhe. We are an innovative company in the field of automatic video analysis. Over the years we have grown to become one of the leading providers of facial recognition solutions in the security space. Contact us At home in the technology region Karlsruhe. We are an innovative company in the field of automatic video analysis. Over the years we have grown to become one of the leading providers of facial recognition solutions in the security space. Technical expertise Our clients not only trust in our scientific and technical expertise in video analytics, but also in our long-standing experience in developing solutions for specific, difficult use-cases. State-of-the-art solutions Our motivation is to implement state-of-the-art image analysis technology into viable new solutions, creating added value for our customers. To achieve this goal, we work closely with users and integrators. Long-standing experience Our long-standing experience, our skilled team, the intensive exchange with the Karlsruhe Institute of Technology and the cooperation with its Institute of Anthropomatics and Robotics make us a source of inspiration for our partners and a competent provider of solutions and services in this field. Technical expertise Our clients not only trust in our scientific and technical expertise in video analytics, but also in our long-standing experience in developing solutions for specific, difficult use-cases. Our clients not only trust in our scientific and technical expertise in video analytics, but also in our long-standing experience in developing solutions for specific, difficult use-cases. State-of-the-art solutions Our motivation is to implement state-of-the-art image analysis technology into viable new solutions, creating added value for our customers. To achieve this goal, we work closely with users and integrators. Our motivation is to implement state-of-the-art image analysis technology into viable new solutions, creating added value for our customers. To achieve this goal, we work closely with users and integrators. Long-standing experience Our long-standing experience, our skilled team, the intensive exchange with the Karlsruhe Institute of Technology and the cooperation with its Institute of Anthropomatics and Robotics make us a source of inspiration for our partners and a competent provider of solutions and services in this field. Our long-standing experience, our skilled team, the intensive exchange with the Karlsruhe Institute of Technology and the cooperation with its Institute of Anthropomatics and Robotics make us a source of inspiration for our partners and a competent provider of solutions and services in this field. PAKoS: Personalized Adaptive Cooperative Systems for Automated Vehicles. Funded by the Federal Ministry of Education and Research (BMBF). Project period: 2017-2019 PERFORMANCE: Cooperative system platform for video upload, evaluation, semi-automated analysis and archiving. Project period: 2016-2019 MobilePass: A secure, modular and distributed mobile border control solution for European land border crossing points. Project period: 2014-2016 PAKoS: Personalized Adaptive Cooperative Systems for Automated Vehicles. Funded by the Federal Ministry of Education and Research (BMBF). Project period: 2017-2019 PERFORMANCE: Cooperative system platform for video upload, evaluation, semi-automated analysis and archiving. Project period: 2016-2019 MobilePass: A secure, modular and distributed mobile border control solution for European land border crossing points. Project period: 2014-2016 PAKoS: Personalized Adaptive Cooperative Systems for Automated Vehicles. Funded by the Federal Ministry of Education and Research (BMBF). Project period: 2017-2019 PAKoS: Personalized Adaptive Cooperative Systems for Automated Vehicles. Funded by the Federal Ministry of Education and Research (BMBF). Project period: 2017-2019 PERFORMANCE: Cooperative system platform for video upload, evaluation, semi-automated analysis and archiving. Project period: 2016-2019 PERFORMANCE: Cooperative system platform for video upload, evaluation, semi-automated analysis and archiving. Project period: 2016-2019 MobilePass: A secure, modular and distributed mobile border control solution for European land border crossing points. Project period: 2014-2016 MobilePass: A secure, modular and distributed mobile border control solution for European land border crossing points. Project period: 2014-2016",
    "Videmo - New standard in video analysis. Solutions Our solutions at a glance Security Manufacturers and integrators Retail and Market Research Our solutions at a glance Retail and Market Research Products Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration Video Analysis made easy Videmo 360 Face recognition redefined Videmo SDK Simple and easy integration English Pick Language Deutsch English Imprint Videmo Intelligente Videoanalyse GmbH & Co. KG Geschäftsführung Ines Stiefelhagen Emmy-Noether-Str. 11 76131 Karlsruhe Germany E-Mail: info@videmo.de Telefon: +49 721 62710135 Fax: +49 721 7831237 Registernummer: HRA 701578, Handelsregister Mannheim Umsatzsteuer-Identifikationsnummer: DE259967042 Persönlich haftende Gesellschafterin: Videmo Verwaltung GmbH Registernummer: HRB 703968, Handelsregister Mannheim Privacy Data protection The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this . The use of our website is usually possible without providing personal information. As far as on our sides personal data (for example name, address or E-Mail addresses) are raised, this takes place, as far as possible, always on voluntary basis. These data will not be disclosed to third parties without your explicit consent. Please note that data transmission over the Internet (for example, when communicating by e-mail) may have security vulnerabilities. A complete protection of the data from access by third parties is not possible. Cookies The internet pages partly use so-called cookies. Cookies do not harm your computer and do not contain viruses. Cookies help us to make our offer more user-friendly, effective and safer. Cookies are small text files that are stored on your computer and stored by your browser. Most of the cookies we use are so-called \"session cookies\". They are automatically deleted after your visit. Other cookies remain stored on your device until you delete them. These cookies allow us to recognize your browser on your next visit. You can set your browser so that you are informed about the setting of cookies and allow only in individual cases, exclude the acceptance of cookies for certain cases or generally and activate the automatic deletion of cookies when closing the browser. Disabling cookies may limit the functionality of this website. Server log files The provider of the pages automatically collects and stores information in so-called Server log files that your browser automatically sends to us. These are: Browser type and browser version Used operating system Referrer URL Host name of the accessing computer Time of the server request These data can not be assigned to specific persons. There is no merge of this data with other data sources. We reserve the right to check this data retrospectively, if we become aware of specific indications for illegal use. Contact form If you send us inquiries via the contact form, your details from the inquiry form, including the contact details you provided there, will be stored in order to process the request and in case of follow-up questions. We will not share this information without your consent. Newsletter data If you wish to receive the newsletter offered on the website, we require an e-mail address from you, as well as information that allows us to verify that you are the owner of the e-mail address provided and that you agree to receive the newsletter. Further data is not collected. We use this data exclusively for the delivery of the requested information and do not pass it on to third parties. You can revoke your consent to the storage of data, the e-mail address and its use for sending the newsletter at any time, for example via the \"unsubscribe\" link in the newsletter. Right to information, cancellation, blocking At any time you have the right to free information about your stored personal data, their origin and recipient and the purpose of the data processing as well as a right to correction, blocking or deletion of this data. For further information on personal data, please contact us at any time at the address given in the imprint. Source: https://www.e-recht24.de/musterdatenschutzerklaerung.html Videmo Intelligente Videoanalyse GmbH & Co. KG Geschäftsführung Ines Stiefelhagen Emmy-Noether-Str. 11 76131 Karlsruhe Germany E-Mail: info@videmo.de Telefon: +49 721 62710135 Fax: +49 721 7831237 Registernummer: HRA 701578, Handelsregister Mannheim Umsatzsteuer-Identifikationsnummer: DE259967042 Persönlich haftende Gesellschafterin: Videmo Verwaltung GmbH Registernummer: HRB 703968, Handelsregister Mannheim Videmo Intelligente Videoanalyse GmbH & Co. KG Geschäftsführung Ines Stiefelhagen Emmy-Noether-Str. 11 76131 Karlsruhe Germany E-Mail: info@videmo.de Telefon: +49 721 62710135 Fax: +49 721 7831237 Registernummer: HRA 701578, Handelsregister Mannheim Umsatzsteuer-Identifikationsnummer: DE259967042 Persönlich haftende Gesellschafterin: Videmo Verwaltung GmbH Registernummer: HRB 703968, Handelsregister Mannheim Data protection The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this . The use of our website is usually possible without providing personal information. As far as on our sides personal data (for example name, address or E-Mail addresses) are raised, this takes place, as far as possible, always on voluntary basis. These data will not be disclosed to third parties without your explicit consent. Please note that data transmission over the Internet (for example, when communicating by e-mail) may have security vulnerabilities. A complete protection of the data from access by third parties is not possible. The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this . The use of our website is usually possible without providing personal information. As far as on our sides personal data (for example name, address or E-Mail addresses) are raised, this takes place, as far as possible, always on voluntary basis. These data will not be disclosed to third parties without your explicit consent. Please note that data transmission over the Internet (for example, when communicating by e-mail) may have security vulnerabilities. A complete protection of the data from access by third parties is not possible. Cookies The internet pages partly use so-called cookies. Cookies do not harm your computer and do not contain viruses. Cookies help us to make our offer more user-friendly, effective and safer. Cookies are small text files that are stored on your computer and stored by your browser. Most of the cookies we use are so-called \"session cookies\". They are automatically deleted after your visit. Other cookies remain stored on your device until you delete them. These cookies allow us to recognize your browser on your next visit. You can set your browser so that you are informed about the setting of cookies and allow only in individual cases, exclude the acceptance of cookies for certain cases or generally and activate the automatic deletion of cookies when closing the browser. Disabling cookies may limit the functionality of this website. The internet pages partly use so-called cookies. Cookies do not harm your computer and do not contain viruses. Cookies help us to make our offer more user-friendly, effective and safer. Cookies are small text files that are stored on your computer and stored by your browser. Most of the cookies we use are so-called \"session cookies\". They are automatically deleted after your visit. Other cookies remain stored on your device until you delete them. These cookies allow us to recognize your browser on your next visit. You can set your browser so that you are informed about the setting of cookies and allow only in individual cases, exclude the acceptance of cookies for certain cases or generally and activate the automatic deletion of cookies when closing the browser. Disabling cookies may limit the functionality of this website. Server log files The provider of the pages automatically collects and stores information in so-called Server log files that your browser automatically sends to us. These are: Browser type and browser version Used operating system Referrer URL Host name of the accessing computer Time of the server request These data can not be assigned to specific persons. There is no merge of this data with other data sources. We reserve the right to check this data retrospectively, if we become aware of specific indications for illegal use. The provider of the pages automatically collects and stores information in so-called Server log files that your browser automatically sends to us. These are: Browser type and browser version Host name of the accessing computer Time of the server request These data can not be assigned to specific persons. There is no merge of this data with other data sources. We reserve the right to check this data retrospectively, if we become aware of specific indications for illegal use. Contact form If you send us inquiries via the contact form, your details from the inquiry form, including the contact details you provided there, will be stored in order to process the request and in case of follow-up questions. We will not share this information without your consent. If you send us inquiries via the contact form, your details from the inquiry form, including the contact details you provided there, will be stored in order to process the request and in case of follow-up questions. We will not share this information without your consent. Newsletter data If you wish to receive the newsletter offered on the website, we require an e-mail address from you, as well as information that allows us to verify that you are the owner of the e-mail address provided and that you agree to receive the newsletter. Further data is not collected. We use this data exclusively for the delivery of the requested information and do not pass it on to third parties. You can revoke your consent to the storage of data, the e-mail address and its use for sending the newsletter at any time, for example via the \"unsubscribe\" link in the newsletter. If you wish to receive the newsletter offered on the website, we require an e-mail address from you, as well as information that allows us to verify that you are the owner of the e-mail address provided and that you agree to receive the newsletter. Further data is not collected. We use this data exclusively for the delivery of the requested information and do not pass it on to third parties. You can revoke your consent to the storage of data, the e-mail address and its use for sending the newsletter at any time, for example via the \"unsubscribe\" link in the newsletter. Right to information, cancellation, blocking At any time you have the right to free information about your stored personal data, their origin and recipient and the purpose of the data processing as well as a right to correction, blocking or deletion of this data. For further information on personal data, please contact us at any time at the address given in the imprint. Source: https://www.e-recht24.de/musterdatenschutzerklaerung.html Right to information, cancellation, blocking At any time you have the right to free information about your stored personal data, their origin and recipient and the purpose of the data processing as well as a right to correction, blocking or deletion of this data. For further information on personal data, please contact us at any time at the address given in the imprint."
  ]
}