{
  "company": "visagetechnologies.com",
  "dominant_topics": [
    14,
    1,
    3
  ],
  "topic_counts": {
    "14": 1,
    "1": 1,
    "3": 1
  },
  "topic_descriptions": {
    "14": "authored, minivision, minivision technology, panasonic, singapore",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.0833333333333333,
    "framing_surveillance": 0.4166666666666667,
    "framing_market": 0.5,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "1": 1,
      "3": 1,
      "14": 1
    }
  },
  "sample_docs": [
    "Neuroscientists and biologists have investigated zebrafish for quite a while, since they have much more in common than meets the eye. There is, of course, one obvious difference: they move in three dimensions while swimming. Therefore, it was interesting to track fish to collect information about the third dimension of depth, which is usually missing from camera tracking. Usually we do not track in 3D since there are computing and technological limitations (two synchronized cameras, calibration of the testing arena), but researchers have proposed 3D tracking to understand better their trajectories and neurological background. To about zebrafish and similar organisms can help us about human brain phenotypes, which could be useful in neuropsychiatric research. Zebrafish also provide low-cost technologies, which can be implemented quickly. A group of researchers have introduced a new automated method for generating 3D (X, Y, Z) swim trajectories in adult zebrafish ( Danio rerio ) to improve their neurophenotyping. They have used the tracking software to enhance the efficient high-throughput 3D analyses of behavioural responses of different zebrafish. This approach illustrates the value od 3D swim path reconstructions to identify experimentally-evoked phenotypic profiles. This is also useful for drug testing, since this method is highly sensitive to various classes of psychotropic drugs, such as selected psychostimulant and hallucinogenic agents. Zebrafish tracking Back then in 2010 researchers from the University of Leiden investigated the pattern of exploratory behaviors in adult zebrafish when exposed to an unfamiliar environment. They reported that zebrafish display anxiety-like behaviors including dark-avoidance and thigmotaxis (the movement of an organism either towards or away from the stimulus of physical contact). To continue, they have tracked the fish to conclude that they, upon exposure to a novel environment in the first two minutes – they display preference for the outer one of the testing apparatus, where they seek escape via the transparent wall, and exhibit high locomotor activity and high swimming speed. The next finding was that thigmotaxis. hyperactivity, and swimming speed decrease over time. The last result was that the prior history of stress attenuates the natural tendency to engage in dark-avoidance behavior and thigmotaxis. These findings taken together that novel environment can elicit anxiety-like behavior in zebrafish, which is consistent with previous finding in rodents, and provides an insight into neuroscientific background of such manifestations. In 2012 researchers from the University of San Diego have examined depth preference in adult zebrafish too. They used a modified visual cliff apparatus, which could be arranged so that the distance from the water surface and distance from the substrate could be independently manipulated. In one condition subjects showed a powerful preference for the deeper side – when two sides of the apparatus genuinely differed in depth. In the other one the both sides of the tank were set to the same depth using a glass insert, and one side appeared deeper because of the gravel substrate just below the glass floor on one side, and far below the glass floor on the other (like the visual cliff). In this case zebrafish preferred the side that appeared deeper, unlike the terrestrial animals that tend to avoid it. It appeared that the escape from the surface, rather than approach to the substrate, motivated the diving response in zebrafish. _______________ References: Blaser, R.E. and Goldsteinholm, K. (2012): \"Depth preference in zebrafish, Danio rerio: control by surface and substrate cues\" , in: Animal Behaviour , 83(4), 953-959. Stewart et al. (2015): \"A novel 3D method of locomotor analysis in adult zebrafish: Implications for automated detection of CNS drug-evoked phenotypes\" , in: Journal of Neuroscience Methods 255: 66–74. Champagne, D.L. et al. (2010): \"Translating rodent behavioral repertoire to zebrafish (Danio rerio): Relevance for stress research\" , in: Behavioural Brain Research 214: 332-342. Download Premium WordPress Themes Free Premium WordPress Themes Download Premium WordPress Themes Download Download Best WordPress Themes Free Download free download udemy paid course download micromax firmware Premium WordPress Themes Download ZG93bmxvYWQgbHluZGEgY291cnNlIGZyZWU= TAGS animal tracking computer vision machine learning object tracking Neuroscientists and biologists have investigated zebrafish for quite a while, since they have much more in common than meets the eye. There is, of course, one obvious difference: they move in three dimensions while swimming. Therefore, it was interesting to track fish to collect information about the third dimension of depth, which is usually missing from camera tracking. Usually we do not track in 3D since there are computing and technological limitations (two synchronized cameras, calibration of the testing arena), but researchers have proposed 3D tracking to understand better their trajectories and neurological background. To about zebrafish and similar organisms can help us about human brain phenotypes, which could be useful in neuropsychiatric research. Zebrafish also provide low-cost technologies, which can be implemented quickly. A group of researchers have introduced a new automated method for generating 3D (X, Y, Z) swim trajectories in adult zebrafish ( Danio rerio ) to improve their neurophenotyping. They have used the tracking software to enhance the efficient high-throughput 3D analyses of behavioural responses of different zebrafish. This approach illustrates the value od 3D swim path reconstructions to identify experimentally-evoked phenotypic profiles. This is also useful for drug testing, since this method is highly sensitive to various classes of psychotropic drugs, such as selected psychostimulant and hallucinogenic agents. Zebrafish tracking Back then in 2010 researchers from the University of Leiden investigated the pattern of exploratory behaviors in adult zebrafish when exposed to an unfamiliar environment. They reported that zebrafish display anxiety-like behaviors including dark-avoidance and thigmotaxis (the movement of an organism either towards or away from the stimulus of physical contact). To continue, they have tracked the fish to conclude that they, upon exposure to a novel environment in the first two minutes – they display preference for the outer one of the testing apparatus, where they seek escape via the transparent wall, and exhibit high locomotor activity and high swimming speed. The next finding was that thigmotaxis. hyperactivity, and swimming speed decrease over time. The last result was that the prior history of stress attenuates the natural tendency to engage in dark-avoidance behavior and thigmotaxis. These findings taken together that novel environment can elicit anxiety-like behavior in zebrafish, which is consistent with previous finding in rodents, and provides an insight into neuroscientific background of such manifestations. In 2012 researchers from the University of San Diego have examined depth preference in adult zebrafish too. They used a modified visual cliff apparatus, which could be arranged so that the distance from the water surface and distance from the substrate could be independently manipulated. In one condition subjects showed a powerful preference for the deeper side – when two sides of the apparatus genuinely differed in depth. In the other one the both sides of the tank were set to the same depth using a glass insert, and one side appeared deeper because of the gravel substrate just below the glass floor on one side, and far below the glass floor on the other (like the visual cliff). In this case zebrafish preferred the side that appeared deeper, unlike the terrestrial animals that tend to avoid it. It appeared that the escape from the surface, rather than approach to the substrate, motivated the diving response in zebrafish. _______________ References: Blaser, R.E. and Goldsteinholm, K. (2012): \"Depth preference in zebrafish, Danio rerio: control by surface and substrate cues\" , in: Animal Behaviour , 83(4), 953-959. Stewart et al. (2015): \"A novel 3D method of locomotor analysis in adult zebrafish: Implications for automated detection of CNS drug-evoked phenotypes\" , in: Journal of Neuroscience Methods 255: 66–74. Champagne, D.L. et al. (2010): \"Translating rodent behavioral repertoire to zebrafish (Danio rerio): Relevance for stress research\" , in: Behavioural Brain Research 214: 332-342. Download Premium WordPress Themes Free Premium WordPress Themes Download Premium WordPress Themes Download Download Best WordPress Themes Free Download free download udemy paid course download micromax firmware Premium WordPress Themes Download ZG93bmxvYWQgbHluZGEgY291cnNlIGZyZWU= TAGS animal tracking computer vision machine learning object tracking Neuroscientists and biologists have investigated zebrafish for quite a while, since they have much more in common than meets the eye. There is, of course, one obvious difference: they move in three dimensions while swimming. Therefore, it was interesting to track fish to collect information about the third dimension of depth, which is usually missing from camera tracking. Usually we do not track in 3D since there are computing and technological limitations (two synchronized cameras, calibration of the testing arena), but researchers have proposed 3D tracking to understand better their trajectories and neurological background. To about zebrafish and similar organisms can help us about human brain phenotypes, which could be useful in neuropsychiatric research. Zebrafish also provide low-cost technologies, which can be implemented quickly. A group of researchers have introduced a new automated method for generating 3D (X, Y, Z) swim trajectories in adult zebrafish ( Danio rerio ) to improve their neurophenotyping. They have used the tracking software to enhance the efficient high-throughput 3D analyses of behavioural responses of different zebrafish. This approach illustrates the value od 3D swim path reconstructions to identify experimentally-evoked phenotypic profiles. This is also useful for drug testing, since this method is highly sensitive to various classes of psychotropic drugs, such as selected psychostimulant and hallucinogenic agents. Back then in 2010 researchers from the University of Leiden investigated the pattern of exploratory behaviors in adult zebrafish when exposed to an unfamiliar environment. They reported that zebrafish display anxiety-like behaviors including dark-avoidance and thigmotaxis (the movement of an organism either towards or away from the stimulus of physical contact). To continue, they have tracked the fish to conclude that they, upon exposure to a novel environment in the first two minutes – they display preference for the outer one of the testing apparatus, where they seek escape via the transparent wall, and exhibit high locomotor activity and high swimming speed. The next finding was that thigmotaxis. hyperactivity, and swimming speed decrease over time. The last result was that the prior history of stress attenuates the natural tendency to engage in dark-avoidance behavior and thigmotaxis. These findings taken together that novel environment can elicit anxiety-like behavior in zebrafish, which is consistent with previous finding in rodents, and provides an insight into neuroscientific background of such manifestations. In 2012 researchers from the University of San Diego have examined depth preference in adult zebrafish too. They used a modified visual cliff apparatus, which could be arranged so that the distance from the water surface and distance from the substrate could be independently manipulated. In one condition subjects showed a powerful preference for the deeper side – when two sides of the apparatus genuinely differed in depth. In the other one the both sides of the tank were set to the same depth using a glass insert, and one side appeared deeper because of the gravel substrate just below the glass floor on one side, and far below the glass floor on the other (like the visual cliff). In this case zebrafish preferred the side that appeared deeper, unlike the terrestrial animals that tend to avoid it. It appeared that the escape from the surface, rather than approach to the substrate, motivated the diving response in zebrafish. Blaser, R.E. and Goldsteinholm, K. (2012): \"Depth preference in zebrafish, Danio rerio: control by surface and substrate cues\" , in: Animal Behaviour , 83(4), 953-959. Stewart et al. (2015): \"A novel 3D method of locomotor analysis in adult zebrafish: Implications for automated detection of CNS drug-evoked phenotypes\" , in: Journal of Neuroscience Methods 255: 66–74. Champagne, D.L. et al. (2010): \"Translating rodent behavioral repertoire to zebrafish (Danio rerio): Relevance for stress research\" , in: Behavioural Brain Research 214: 332-342. Related articles From Skynet to robots on Mars: computer vision overview Learning new tricks from old dogs: canine gaze tracking Automotive AI: Utilizing artificial intelligence in cars What dress goes with these shoes? Ask a computer! From a fresh graduate to a professional: Starting… Related articles From Skynet to robots on Mars: computer vision overview Learning new tricks from old dogs: canine gaze tracking Automotive AI: Utilizing artificial intelligence in cars What dress goes with these shoes? Ask a computer! From a fresh graduate to a professional: Starting… From Skynet to robots on Mars: computer vision overview Learning new tricks from old dogs: canine gaze tracking Automotive AI: Utilizing artificial intelligence in cars What dress goes with these shoes? Ask a computer! From a fresh graduate to a professional: Starting…",
    "Face Tracking FaceTrack detects and tracks one or more human faces within an image or video in real time. Use it to monitor changes in facial expressions, follow gaze direction, determine pupil coordinates, and more. Face Tracking FaceTrack detects and tracks one or more human faces within an image or video in real time. Use it to monitor changes in facial expressions, follow gaze direction, determine pupil coordinates, and more. FaceTrack detects and tracks one or more human faces within an image or video in real time. Use it to monitor changes in facial expressions, follow gaze direction, determine pupil coordinates, and more. Face Analysis Determine age, gender and emotions of people on camera feed or images. Develop solutions that can customize content based on users' data and current mood or simply gather valuable information from your target groups. MALE. Age 31 Anger Disgust Fear Happiness Sadness Surprise Neutral Face Analysis Determine age, gender and emotions of people on camera feed or images. Develop solutions that can customize content based on users' data and current mood or simply gather valuable information from your target groups. Determine age, gender and emotions of people on camera feed or images. Develop solutions that can customize content based on users' data and current mood or simply gather valuable information from your target groups. Face Recognition Build scalable face recognition solution that provide quick and accurate results for surveillance, identification and identity verification. Built-in liveness detection ensures reliable protection against spoofing. Face Recognition Build scalable face recognition solution that provide quick and accurate results for surveillance, identification and identity verification. Built-in liveness detection ensures reliable protection against spoofing. Build scalable face recognition solution that provide quick and accurate results for surveillance, identification and identity verification. Built-in liveness detection ensures reliable protection against spoofing. Built to deliver quality Lightweight & fast Works online & offline Fully customizable Privacy-first Built to deliver quality Available for all major platforms and embedded systems Windows iOS Mac OS X HTML5 Android Xilinx RedHat Ubuntu Raspberry Pi Available for all major platforms and embedded systems Lightweight, fast and precise algorithms for smarter solutions. 3D face masking Transform your users into anything they can possibly imagine Transform your users into anything they can possibly imagine Biometrics Ensure bulletproof ID verification and authentication Ensure bulletproof ID verification and authentication Jewelry try-on Grow online sales by letting customers try on your products virtually Grow online sales by letting customers try on your products virtually Eyewear try-on Let customers try out glasses and contact lenses online Let customers try out glasses and contact lenses online Virtual Makeup Bring your beauty products where your customers are Bring your beauty products where your customers are Driver monitoring Provide safe and comfortable in-cabin experiences. Provide safe and comfortable in-cabin experiences. Get a turnkey solution with custom development visage|SDK comes with a broad range of parameters that can be easily configured to meet your needs. However, more specific use cases still require special attention. Let our team take care of this for you. We provide custom development services that can help you get the most out of our technology in the least time. Years of experience in computer vision In-house development and testing Transparent road maps and process Direct communication with Team Leader Get a turnkey solution with custom development visage|SDK comes with a broad range of parameters that can be easily configured to meet your needs. However, more specific use cases still require special attention. Let our team take care of this for you. We provide custom development services that can help you get the most out of our technology in the least time. Years of experience in computer vision In-house development and testing Transparent road maps and process Direct communication with Team Leader FEATURED CASE STUDIES PROTECT: Biometric border control improves security and eliminates queues Microblink uses liveness detection for secure ID verification YULU: Revolutionizing childrens' toys with face tracking actiMirror: Smart mirror experience for children PROTECT: Biometric border control improves security and eliminates queues PROTECT: Biometric border control improves security and eliminates queues Microblink uses liveness detection for secure ID verification Microblink uses liveness detection for secure ID verification YULU: Revolutionizing childrens' toys with face tracking YULU: Revolutionizing childrens' toys with face tracking actiMirror: Smart mirror experience for children actiMirror: Smart mirror experience for children READY TO GET STARTED? CONTACT SALES VIEW DEMO READY TO GET STARTED?",
    "Bringing AI from concept to reality Consulting and engineering services with 20+ years of excellence 23 years | 300 clients | 200 AI experts Get in touch Bringing AI from concept to reality Consulting and engineering services with 20+ years of excellence 23 years | 300 clients | 200 AI experts 23 years | 300 clients | 200 AI experts Building AI-driven products for leading companies. Building AI-driven products for leading companies. 20+ years of experience, working for you Partner with us for custom AI solutions Our team specializes in developing custom edge AI solutions, optimized for high accuracy and low latency, providing full support from development to deployment. Planning and data We specialize in planning and executing AI-driven projects – from providing technology and architecture design, to streamlined prototyping, project management and data management. Technologies and software With 20+ years of experience in computer vision, machine learning, and AI projects, our team efficiently handles complex, endâ€toâ€end projects, delivering efficient, tailored solutions for your business. Hardware and platforms Utilizing advanced hardware, platforms, and expertise in a wide range of cameras, sensors, and operating systems, we develop AI-driven solutions focused on Edge AI and embedded systems. Partner with us for custom AI solutions Our team specializes in developing custom edge AI solutions, optimized for high accuracy and low latency, providing full support from development to deployment. Planning and data We specialize in planning and executing AI-driven projects – from providing technology and architecture design, to streamlined prototyping, project management and data management. We specialize in planning and executing AI-driven projects – from providing technology and architecture design, to streamlined prototyping, project management and data management. Technologies and software With 20+ years of experience in computer vision, machine learning, and AI projects, our team efficiently handles complex, endâ€toâ€end projects, delivering efficient, tailored solutions for your business. With 20+ years of experience in computer vision, machine learning, and AI projects, our team efficiently handles complex, endâ€toâ€end projects, delivering efficient, tailored solutions for your business. Hardware and platforms Utilizing advanced hardware, platforms, and expertise in a wide range of cameras, sensors, and operating systems, we develop AI-driven solutions focused on Edge AI and embedded systems. Utilizing advanced hardware, platforms, and expertise in a wide range of cameras, sensors, and operating systems, we develop AI-driven solutions focused on Edge AI and embedded systems. Efficient AI solutions across industries Some of our projects R&D in the automotive industry: Partnership with Qualcomm Embedded vision for driver safety on Ambarella CV25 Social robots designed to enhance human-machine interactions Biometric-based identification system for border control Real-time, non-invasive body temperature screening for crowded areas The world's most realistic autonomous digital human Monitoring health and emotions with Transdermal Optical Imaging Liveness detection for secure ID verification and fraud prevention Some of our projects R&D in the automotive industry: Partnership with Qualcomm Embedded vision for driver safety on Ambarella CV25 Social robots designed to enhance human-machine interactions Biometric-based identification system for border control Real-time, non-invasive body temperature screening for crowded areas The world's most realistic autonomous digital human Monitoring health and emotions with Transdermal Optical Imaging Liveness detection for secure ID verification and fraud prevention Innovating since 2002 Founded more than two decades ago by computer vision scientists, we have built a reputation for trust and excellence in AI innovation. Partnering with us ensures your project is guided by expertise, reliability, and precision. 23 23 8 0 Years of experience Hands-on experience on edge AI projects across industries. 300 300 8 0 Clients worldwide From small startups and academic institutions to large multinations. 200 200 8 0 AI experts Team of AI specialists and PhD scientists driving innovation. 2 2 8 0 Proprietary SDKs Customizable tech for faceâ€related computer vision applications. Founded more than two decades ago by computer vision scientists, we have built a reputation for trust and excellence in AI innovation. Partnering with us ensures your project is guided by expertise, reliability, and precision. 23 23 8 0 Years of experience Hands-on experience on edge AI projects across industries. 23 23 8 0 Hands-on experience on edge AI projects across industries. 300 300 8 0 Clients worldwide From small startups and academic institutions to large multinations. 300 300 8 0 From small startups and academic institutions to large multinations. 200 200 8 0 AI experts Team of AI specialists and PhD scientists driving innovation. 200 200 8 0 Team of AI specialists and PhD scientists driving innovation. 2 2 8 0 Proprietary SDKs Customizable tech for faceâ€related computer vision applications. 2 2 8 0 Customizable tech for faceâ€related computer vision applications. Explore our product portfolio Proprietary face-related computer vision Our proprietary technology is used by 300+ clients worldwide to improve user experiences, increase safety, grow businesses, and more. FaceTrack Track faces, gaze, facial expressions FaceAnalysis Estimate emotions, age and gender FaceRecognition Identify and verify faces Proprietary face-related computer vision Our proprietary technology is used by 300+ clients worldwide to improve user experiences, increase safety, grow businesses, and more. Our proprietary technology is used by 300+ clients worldwide to improve user experiences, increase safety, grow businesses, and more. Track faces, gaze, facial expressions Estimate emotions, age and gender Identify and verify faces Available for all major platforms and embedded systems Available for all major platforms and embedded systems World-class R&D, on demand Contact us World-class R&D, on demand"
  ]
}