{
  "company": "visiomatch.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 17,
    "0": 11
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.218397997496871,
    "framing_surveillance": 0.0037546933667083,
    "framing_market": 0.7778473091364205,
    "num_docs": 28
  },
  "topic_timeline": {
    "20": {
      "-1": 17,
      "0": 11
    }
  },
  "sample_docs": [
    "\"We aim to be the leader in the commercial deployment of short and long range, 2-D and 3-D, mobile facial recognition technologies\" Team Saliba Sassine, PhD Giancarlo (John) Meazzo, M.A. Gregory Steinthal, M.S. Samantha Tough, LL.B. Giancarlo (John) Meazzo, M.A. VisioMatch Systems Pty Ltd ​ is an Australian proprietary company operating globally with the exception of North and South America. VisioMatch Systems USA Inc.: the U.S. subsidiary is a \"C corporation†registered in the State of Nevada and operating in the American continents (i.e. USA and Canada in North America, Argentina in South America). VisioMatch© Systems Pty Ltd has the distribution rights in Australia, New Zealand and other countries in the Asian continent. VisioMatch© Systems USA, Inc. has the distribution rights in North America (i.e. USA and Canada) and South America (i.e. Argentina). VisioMatch© Systems has partnered with StereoVision Imaging Inc. through a worldwide exclusive licensing agreement to offer world class leading edge real-time facial recognition technology into the commercial market. StereoVision Imaging , a defense contractor, has been endorsed, sponsored and validated by the U.S. government in the development of its patented stand-off biometric capabilities to support U.S. military and law enforcement in efforts to combat terrorism and irregular adversaries. StereoVision Imaging will remain VisioMatch© Systems research and development center. Together the 2 companies develop and commercialize the most advanced available mobile facial recognition technology worldwide. The Company aims to roll out non-military smartphone commercial applications of its real-time identification technology via sub-licenses, joint ventures and strategic alliances in its target market segments. Few years ago, in one episode of his science TV documentary \"Brave New World\", Professor Stephen Hawking investigated the core technology developed by the technological partner StereoVision Imaging, which has been developed to provide real-time identity verification. Copyright Â .",
    "Biometric Authentication Introducing our advanced Facial Recognition Authentication System , a game-changer in secure and effortless access to devices, applications, and online platforms. Say goodbye to the hassle of usernames and passwords; with our system, your face is all you need (both your username and your password). Here's why you'll love it: Instant Onboarding: Create an account with just your face in seconds—faster than logging in with Google or Apple. One-Click Access: Get verified instantly instantly (in one click), offering unimaginable convenience and speed. Works Everywhere: Our technology is designed for both web and mobile applications, ensuring everyone can use it. Top-Notch Security: Your biometric data is encrypted and protected, with advanced features to prevent unauthorized access. User Friendly: Easy to use for everyone, making security feel effortless and natural. Scalable Solution: Perfect for businesses of all sizes, ready to grow with your security needs. info Our system revolutionizes access by making it secure, fast, and straightforward. Ready for a hassle-free digital experience? Contact us to about how our Facial Recognition Authentication System can transform how you interact with your digital world. Biometric Authentication Introducing our advanced Facial Recognition Authentication System , a game-changer in secure and effortless access to devices, applications, and online platforms. Say goodbye to the hassle of usernames and passwords; with our system, your face is all you need (both your username and your password). Here's why you'll love it: Instant Onboarding: Create an account with just your face in seconds—faster than logging in with Google or Apple. One-Click Access: Get verified instantly instantly (in one click), offering unimaginable convenience and speed. Works Everywhere: Our technology is designed for both web and mobile applications, ensuring everyone can use it. Top-Notch Security: Your biometric data is encrypted and protected, with advanced features to prevent unauthorized access. User Friendly: Easy to use for everyone, making security feel effortless and natural. Scalable Solution: Perfect for businesses of all sizes, ready to grow with your security needs. info Our system revolutionizes access by making it secure, fast, and straightforward. Ready for a hassle-free digital experience? Contact us to about how our Facial Recognition Authentication System can transform how you interact with your digital world. Introducing our advanced Facial Recognition Authentication System , a game-changer in secure and effortless access to devices, applications, and online platforms. Say goodbye to the hassle of usernames and passwords; with our system, your face is all you need (both your username and your password). Here's why you'll love it: Instant Onboarding: Create an account with just your face in seconds—faster than logging in with Google or Apple. One-Click Access: Get verified instantly instantly (in one click), offering unimaginable convenience and speed. Works Everywhere: Our technology is designed for both web and mobile applications, ensuring everyone can use it. Top-Notch Security: Your biometric data is encrypted and protected, with advanced features to prevent unauthorized access. User Friendly: Easy to use for everyone, making security feel effortless and natural. Scalable Solution: Perfect for businesses of all sizes, ready to grow with your security needs. Our system revolutionizes access by making it secure, fast, and straightforward. Ready for a hassle-free digital experience? Contact us to about how our Facial Recognition Authentication System can transform how you interact with your digital world.",
    "\"We aim to be the leader in the commercial deployment of short and long range, 2-D and 3-D, mobile facial recognition technologies\" Team Saliba Sassine, PhD Giancarlo (John) Meazzo, M.A. Gregory Steinthal, M.S. Samantha Tough, LL.B. Giancarlo (John) Meazzo, M.A. VisioMatch© Systems is offering investment opportunities in both the Australian and the USA company. For a prospectus or offering memorandum please contact us: Copyright Â .",
    "Biometric 2FA Introducing Face 2FA, our innovative two-step authentication system that integrates facial recognition to offer an unmatched layer of security and a streamlined authentication process. With Face 2FA, we're taking the robustness of traditional two-factor authentication and combining it with the convenience and advanced security of facial recognition technology. Here's why Face 2FA sets a new standard for secure access: Enhanced Security: By adding facial recognition as a second factor, we significantly reduce the risk of unauthorized access, making your accounts and sensitive information more secure than ever. Simplified Authentication Process: Forget about memorizing complex passwords or keeping track of physical tokens. With Face 2FA, your face grants you access, simplifying the login process without compromising security. No need any more to share your phone number for SMS 2FA. Quick and Easy Verification: Verification happens in milliseconds. Just look at your device to complete the second step of the authentication process, making it faster and more user-friendly than traditional methods. Universal Compatibility: Designed to work seamlessly across various platforms and devices, Face 2FA ensures that every user can benefit from this advanced level of security, whether on a desktop or laptop. Privacy and Protection: We prioritize your privacy. Your facial data is encrypted and securely stored, ensuring that only you can access your account with your unique facial features. Adaptable and Scalable: Face 2FA is perfect for organizations of all sizes, providing a scalable solution that can adapt to any security requirements, offering both flexibility and reliability. Face 2FA revolutionizes two-factor authentication by combining something you know (your password) with something you are (your face), setting a new benchmark in secure access. info Live in the future of authentication with Face 2FA and ensure your digital assets are protected with our advanced security solution. Get in touch with us to discover how Face 2FA can enhance your security measures and streamline your authentication processes. Biometric 2FA Introducing Face 2FA, our innovative two-step authentication system that integrates facial recognition to offer an unmatched layer of security and a streamlined authentication process. With Face 2FA, we're taking the robustness of traditional two-factor authentication and combining it with the convenience and advanced security of facial recognition technology. Here's why Face 2FA sets a new standard for secure access: Enhanced Security: By adding facial recognition as a second factor, we significantly reduce the risk of unauthorized access, making your accounts and sensitive information more secure than ever. Simplified Authentication Process: Forget about memorizing complex passwords or keeping track of physical tokens. With Face 2FA, your face grants you access, simplifying the login process without compromising security. No need any more to share your phone number for SMS 2FA. Quick and Easy Verification: Verification happens in milliseconds. Just look at your device to complete the second step of the authentication process, making it faster and more user-friendly than traditional methods. Universal Compatibility: Designed to work seamlessly across various platforms and devices, Face 2FA ensures that every user can benefit from this advanced level of security, whether on a desktop or laptop. Privacy and Protection: We prioritize your privacy. Your facial data is encrypted and securely stored, ensuring that only you can access your account with your unique facial features. Adaptable and Scalable: Face 2FA is perfect for organizations of all sizes, providing a scalable solution that can adapt to any security requirements, offering both flexibility and reliability. Face 2FA revolutionizes two-factor authentication by combining something you know (your password) with something you are (your face), setting a new benchmark in secure access. info Live in the future of authentication with Face 2FA and ensure your digital assets are protected with our advanced security solution. Get in touch with us to discover how Face 2FA can enhance your security measures and streamline your authentication processes. Introducing Face 2FA, our innovative two-step authentication system that integrates facial recognition to offer an unmatched layer of security and a streamlined authentication process. With Face 2FA, we're taking the robustness of traditional two-factor authentication and combining it with the convenience and advanced security of facial recognition technology. Here's why Face 2FA sets a new standard for secure access: Enhanced Security: By adding facial recognition as a second factor, we significantly reduce the risk of unauthorized access, making your accounts and sensitive information more secure than ever. Simplified Authentication Process: Forget about memorizing complex passwords or keeping track of physical tokens. With Face 2FA, your face grants you access, simplifying the login process without compromising security. No need any more to share your phone number for SMS 2FA. Quick and Easy Verification: Verification happens in milliseconds. Just look at your device to complete the second step of the authentication process, making it faster and more user-friendly than traditional methods. Universal Compatibility: Designed to work seamlessly across various platforms and devices, Face 2FA ensures that every user can benefit from this advanced level of security, whether on a desktop or laptop. Privacy and Protection: We prioritize your privacy. Your facial data is encrypted and securely stored, ensuring that only you can access your account with your unique facial features. Adaptable and Scalable: Face 2FA is perfect for organizations of all sizes, providing a scalable solution that can adapt to any security requirements, offering both flexibility and reliability. Face 2FA revolutionizes two-factor authentication by combining something you know (your password) with something you are (your face), setting a new benchmark in secure access. Live in the future of authentication with Face 2FA and ensure your digital assets are protected with our advanced security solution. Get in touch with us to discover how Face 2FA can enhance your security measures and streamline your authentication processes.",
    "& Legal Information Data Collection and Use ​ At VisioMatch , we collect data essential for providing our facial recognition services. This includes facial images and, where necessary, associated personal data for identification purposes. The data is used strictly for the services requested, such as identity verification, security checks, or media analytics. Data Security ​ We employ state-of-the-art encryption and security measures to protect all data in our possession. Our commitment to data security means your information is safeguarded against unauthorized access and breaches. Data Retention: Data is retained only as long as necessary to provide the services requested or to comply with legal obligations. We regularly review our data retention policies to ensure compliance with privacy laws and industry best practices. Data Sharing and Disclosure ​ VisioMatch does not sell or rent personal data to third parties. Data may be shared with partners or third parties only when necessary to provide our services or when legally required. Access and Control ​ Users have the right to access their personal data, request corrections, or ask for deletion, subject to certain exceptions. We provide mechanisms for users to control their data, including options to opt-out of certain uses of their information. For any privacy-related inquiries or concerns, users can contact us directly. We are committed to addressing all questions and resolving any issues promptly. Legal Compliance: Adherence to Laws and Regulations ​ VisioMatch complies with all applicable laws and regulations concerning data protection and privacy. This includes GDPR in the European Union and other regional data protection laws. We continually monitor legal developments to ensure our policies and practices remain compliant. Our may be updated periodically to reflect changes in our practices or legal requirements. Users will be notified of significant changes through our website or direct communication. Contact Information: For any legal or inquiries, users can contact us via legal@visiomatch.com . Data Handling and Data Collection and Use Data Security Data Sharing and Disclosure User Rights and Privacy Choices Access and Control Privacy Inquiries Adherence to Laws and Regulations Updates to & Legal Information Data Collection and Use ​ At VisioMatch , we collect data essential for providing our facial recognition services. This includes facial images and, where necessary, associated personal data for identification purposes. The data is used strictly for the services requested, such as identity verification, security checks, or media analytics. Data Security ​ We employ state-of-the-art encryption and security measures to protect all data in our possession. Our commitment to data security means your information is safeguarded against unauthorized access and breaches. Data Retention: Data is retained only as long as necessary to provide the services requested or to comply with legal obligations. We regularly review our data retention policies to ensure compliance with privacy laws and industry best practices. Data Sharing and Disclosure ​ VisioMatch does not sell or rent personal data to third parties. Data may be shared with partners or third parties only when necessary to provide our services or when legally required. Access and Control ​ Users have the right to access their personal data, request corrections, or ask for deletion, subject to certain exceptions. We provide mechanisms for users to control their data, including options to opt-out of certain uses of their information. For any privacy-related inquiries or concerns, users can contact us directly. We are committed to addressing all questions and resolving any issues promptly. Legal Compliance: Adherence to Laws and Regulations ​ VisioMatch complies with all applicable laws and regulations concerning data protection and privacy. This includes GDPR in the European Union and other regional data protection laws. We continually monitor legal developments to ensure our policies and practices remain compliant. Our may be updated periodically to reflect changes in our practices or legal requirements. Users will be notified of significant changes through our website or direct communication. Contact Information: For any legal or inquiries, users can contact us via legal@visiomatch.com . & Legal Information Data Collection and Use ​ At VisioMatch , we collect data essential for providing our facial recognition services. This includes facial images and, where necessary, associated personal data for identification purposes. The data is used strictly for the services requested, such as identity verification, security checks, or media analytics. We employ state-of-the-art encryption and security measures to protect all data in our possession. Our commitment to data security means your information is safeguarded against unauthorized access and breaches. Data Retention: Data is retained only as long as necessary to provide the services requested or to comply with legal obligations. We regularly review our data retention policies to ensure compliance with privacy laws and industry best practices. Data Sharing and Disclosure ​ VisioMatch does not sell or rent personal data to third parties. Data may be shared with partners or third parties only when necessary to provide our services or when legally required. Access and Control ​ Users have the right to access their personal data, request corrections, or ask for deletion, subject to certain exceptions. We provide mechanisms for users to control their data, including options to opt-out of certain uses of their information. For any privacy-related inquiries or concerns, users can contact us directly. We are committed to addressing all questions and resolving any issues promptly. Legal Compliance: Adherence to Laws and Regulations ​ VisioMatch complies with all applicable laws and regulations concerning data protection and privacy. This includes GDPR in the European Union and other regional data protection laws. We continually monitor legal developments to ensure our policies and practices remain compliant. Our may be updated periodically to reflect changes in our practices or legal requirements. Users will be notified of significant changes through our website or direct communication. Contact Information: For any legal or inquiries, users can contact us via legal@visiomatch.com . Data Handling and Data Collection and Use Data Security Data Sharing and Disclosure Data Collection and Use Data Sharing and Disclosure User Rights and Privacy Choices Access and Control Privacy Inquiries Adherence to Laws and Regulations Adherence to Laws and Regulations Updates to"
  ]
}