{
  "company": "vnpt.com.vn",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 10
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 10
    }
  },
  "sample_docs": [
    "Plan. No: 241/KH-LT, dated May 31, 2001 of The Department General of Posts and Telecommunications,Vietnam National Union of Posts and Telecoms Workers, and The Vietnam Posts and Telecommunications Corporation Activities to commemorate the 55 th founding anniversary of the Vietnam National Union of Post and Telecoms Workers (VNUPTW) (1947 - 2002). In implementing Directive No 04/CT-BCS dated May 08, 2001 of the Party Secretariat of DGPT on \"celebration activities of the 55th anniversary of VNUPTW\" (August 30, 1947 - August 30, 2002), leaders of the Department General of Posts and Telecommunications (DGPT), the Vietnam Posts and Telecommunications Corporation (VNPT), and the Standing Committee of VNUPTW have agreed to carry out the following activities: * Giving more intensive education on the tradition of the sector and of the country in order to increase awareness and responsibility of all staff, creating radical changes in their mind and action so that they can fulfil any assignment and plan; Enhancing and improving campaigns, emulation movements and revolutionary acts for the successful implementation of the Resolution of the 9th Party Congress. * Attaching internal activities to local and social ones in order to give people better understanding of the sector, to gain more prestige as well as to make good use of outside support to create favourable conditions for the sector to accelerate. * All celebration activities must reflect the sector's general plan and VNUPTW's celebration; mainly organized at member units. * Being practical and effective, trying to avoid formalism 1. Professional leaders and Trade Unions of all levels in co-ordination with the Party committee are to organize new propaganda and political activities for staff from the beginning of 20002 . The content focuses on such important topics as follows: * Enforcing propaganda activities related to the country, the sector, the role-models and the good people and good works within the sector. * Providing staff with further education on Vietnamese tradition country and people, the 57 year history of the P&T sector and 55 year of developing staff and VNUPTW. Issuing a special postage stamp set in commemoration of the 55th anniversary of VNUPTW. By education and propaganda, ensuring staff's concertedness and full awareness of the sector's major plans such as: * The split of Post from Telecoms. * Preparation for competition and integration. * Improvement of productivity and quality in business, utilities service and management works. 2. Organizing ebullient revolutionary movements in the entire sector, focusing on tasks and goals set for 2002 and the 2001 - 2005 five years plan such as: * Continuously strengthening the implementation of the 5 campaigns, reviewing the last 5 years of implementation of the 5 campaigns and proposing suitable solutions for the new process. * Applying measures to renovate management and P&T business in cities and provinces. * Encouraging staff to outline and realize in to effect implementation programs of the 9 th Party Congress's Resolution as well as the sector's detailed integration program. 3. Building a qualified P&T staff contingent, satisfying integration and development requirements, focusing on: * Pushing up the movement of \"Good teaching, good learning, building a healthy training environment against negative problems\" * Organising P&T civilization contests among the entire staff. * Reviewing the three year implementation of Resolution \"P&T female staff heading to the 21 st century\". Applying measures to improve capability of the unit in charge of \"For the development of P&T Women\". 4. Taking care of material and spiritual lives of all staff. * Effectively implementing salary and income distribution. renovation. * Reviewing the 12 year history of the sector's social funds (1990 – 2002). * Organizing cultural and sports events for its member units. * Carrying out humanity activities such as: visiting, caring, supporting and giving presents for the sector's privileged beneficiaries . 5. Enhancing strong development of Trade Union. * Issuing VNUPTW's regulations on Trade Union's activities in integration and development process. * Reviewing the 5 years of Trade Unions working in groups; designing new activities plans for the new process. 1. Professional leaders and the standing committee of provincial and municipal's P&T Trade Unions and member units should design their own implementation programmes on Directive No. 04/BCS dated May 8, 2001, this joint plan and VNUPTW's celebration proposal. 2. VNUPTW and its members should establish organizing boards at their level, inviting the sector's leaders and specialised leaders to take part in the organizing board and to co-operate in guiding the celebratory activities. 3. Carrying out the plan to celebrate at member units, creating an enthusiasm among staff and trying to surpass the 2002 plan. 4. Organizing the 55 th anniversary of VNUPTW meeting at member units offices and in group by the end of August, 2002. 1. Chiefs of Offices, Departments and Divisions, an Directors of Information Centers under DGPT, VNPT, and VNUPTW in their function must be working with leaders of DGPT, VNPT, and the standing committee of VNUPTW to implement successfully. 2. Specialized leaders and Chairmen of Trade Unions of member units are responsible for ozganizing the plan most successfully. Their implementation plans must be sent to the sector and VNUPTW's leaders in October, 2001.",
    "Vietnam National Union of Post and Telecoms Workers Being the professional trade union economic and financial manager within the P&T sector in line with Party and State regulations and VNUPTW charter Studying to propose solutions related to VNUPTW's economics and finance in accordance with Party directions and lines, State policies, laws and regimes, directions and resolutions of the Vietnam General Confederation of Labor, as well as of Standing Committee of VNUPTW Being the counsellor to the Standing Committee of VNUPTW in instructing the implementation of financial work within the P&T sector Proposing and actively taking part in and carrying out the sector's financial work in co-operation with the Vietnam General Confederation of Labor 1. Mapping out and submitting the annual directions, objectives, and plans and programs to the Standing Committee of VNUPTW for approval 2. Carrying out feminine affairs within the sector: a. Outlining the financial decentralization regime, and the deduction method applicable to P&T units in line with relevant regulations, timely and consistently in the entire sector b. Generalizing and making the financial balance sheet of VNUPTW to submit to the Vietnam General Confederation of Labor meeting content and time standards c. Creating sources, managing and allocating funding to serve activities of all VNUPTW activities at all levels d. Providing accounting guidelines for VNUPTW members to properly abide by trade union financial collection and spending provided by the Vietnam General Confederation of Labor e. Being the manager of sources of funds raised by P&T staff; co-operating with other relevant bodies to evaluate and submit the quarterly and yearly cost estimate and balance sheet of units that are assigned by the Standing Committee of VNUPTW to directly manage and use these sources 3. Speeding up, examining, generalizing and summing up the economic and financial situation according to the approved plans 4. Organizing professional training courses in trade union economics and finance according to the approved plans 5. Reporting accurate, adequate and update information for the Standing Committee of VNUPTW to work with the Vietnam General Confederation of Labor in the field of trade union finance 6. Helping the leaders of VNUPTW in managing sources of funds, carrying out financial collection and spending serving activities of VNUPTW activities 3. Range of competence Authorized by the Standing Committee of VNUPTW to sign professional guiding documents on trade union finance Authorized by the Standing Committee of VNUPTW to examine and supervise trade union economic and financial activities at all levels within VNUPTW Allowed to make spending decisions as decentralized to serve VNUPTW activities The chief of the department has the range of competence and duties of the chief accountant of VNUPTW in accordance with guidance and regulations of the Vietnam General Confederation of Labor and the Ordinance n Accounting and Statistics of the State The department is under the direct and comprehensive direction of the Standing Committee of VNUPTW and abides by regulations of the leaders of VNUPTW Establishing professional guiding relations with functional departments of the Vietnam General Confederation of Labor Establishing equal relations with functional departments and divisions of DGPT, VNPT and local labor unions related to trade union financial activities Establishing co-operative relations with departments, offices, groups and centers under VNUPTW Establishing relations with accountants of trade unions as well as the standing committees at all levels according to the assigned functions and duties The department is managed by a chief who is aided by members. The chief is responsible to the Standing Committee of VNUPTW for the performance results of the department. Home | Profile | History | Legal | Activities | News | Vietnam National Union of Post and Telecoms Workers 30 Hang Chuoi St., Hai Ba Trung Dist., Ha Noi Tel: +84-4-9713514 Fax: +84-4-9720236",
    "Vietnam National Union of Post and Telecoms Workers Being the manager in labor, wage, work hygiene and safety, and social policies work within the system of VNUPTW in line with Party and State regulations and VNUPTW's charter Studying to propose solutions and applying these solutions related to labor, wage, work hygiene and safety, and social policies work within the system of VNUPTW in accordance with Party directions and lines, State policies, laws and regimes, directions and resolutions of the Vietnam General Confederation of Labor, as well as of Standing Committee of VNUPTW, DGPT and VNPT Actively proposing to the Standing Committee of VNUPTW in the fields of labor, wage, work hygiene and safety, and social policies; proposing new directions in line with development situation and the laws Proposing and actively co-operating with other relevant bodies to carry out labor, wage, work hygiene and safety, and social policies work within the system of VNUPTW and at VNUPTW organization 1. Mapping out and submitting its annual directions, objectives, plans and working agenda to the Standing Committee of VNUPTW for approval 2. Carrying out work related to labor, wage, work hygiene and safety, and social policies: a. Co-operating with specialized units to apply policies and regimes related to labor, wage, work hygiene and safety and social insurance of the sector and the State regarding the P&T sector b. Co-operating with specialized units to organize a scientific work style, and to define work norms, wage unit, income allocation regime, regulations on the management and use of social welfare funds, and work safety and hygiene regulations in the P&T sector c. Providing guidance to, instructing and supervising the observation of labor unions at all levels regarding labor, wage, work safety and hygiene, medical insurance and social policies related to the legitimate rights of laborers d. Discovering and proposing to the Vietnam General Confederation of Labor and the P&T sector illogical points in labor, wage, work safety and hygiene, and medical insurance policies for necessary amendments and supplements e. Settling staff's inquiries and complaints related to labor, wage, work safety and hygiene, medical insurance and social policies f. Providing guidance to labor unions at all levels in negotiating and signing common work agreements and work contracts between the employer and employees; implementing the signed documents most effectively g. Encouraging P&T staff to take part in the compilation of and to observe all regimes and policies related to labor, wage, work safety and hygiene, medical insurance and social policies Speeding up, examining, generalizing and summing up the results of labor, wage, work safety and hygiene, medical insurance and social policies work according to the approved plans and programs Studying, proposing and implementing social policies of the P&T sector Proposing, registering and carrying out scientific research theses which are approved and others assigned by the Standing Committee of VNUPTW Co-operating with other bodies to organize professional training courses in labor, wage, work safety and hygiene, medical insurance and social policies work department members and for labor union staff at all levels within the P&T sector Examining and supervising social insurance activities of labor unions Taking part in, contributing to and implementing labor, wage, work safety and hygiene, medical insurance and social policies of the staff of VNUPTW Reporting accurate, adequate and update information on personnel to the Standing Committee of VNUPTW to work with the sector and the Vietnam General Confederation of Labor in the fields of labor, wage, work safety and hygiene, medical insurance and social policies. 3. Range of competence Authorized by the Standing Committee of VNUPTW to sign professional guiding documents related to labor, wage, work safety and hygiene, medical insurance and social policies. Authorized by the Standing Committee of VNUPTW to examine and supervise activities related to labor, wage, work safety and hygiene, medical insurance and social policies of labor unions at all levels in the P&T sector The department is under the direct and comprehensive direction of the Standing Committee of VNUPTW and abides by regulations of the leaders of VNUPTW Establishing professional guiding relations with functional departments of the Vietnam General Confederation of Labor and the Ministry of Labor, War Invalids and Social Affairs Establishing equal relations with functional departments and divisions of the Vietnam General Confederation of Labor, and local labor unions labor, wage, work safety and hygiene, medical insurance and social policies Establishing co-operative relations with departments, offices, groups and centers under VNUPTW in related activities Establishing relations with coordinators and the standing committee of local labor unions and the standing committee of local labor unions at all levels according to the assigned functions and duties The department is managed by a chief who is aided by department members. The chief is responsible to the Standing Committee of VNUPTW for the performance results of the department . Home | Profile | History | Legal | Activities | News | Vietnam National Union of Post and Telecoms Workers 30 Hang Chuoi St., Hai Ba Trung Dist., Ha Noi Tel: +84-4-9713514 Fax: +84-4-9720236",
    "Vietnam National Union of Post and Telecoms Workers - Collecting and processing information serving the instruction management of the Standing Committee of VNUPTW, insuring consistent activities - Organizing and instructing the implementation of duties assigned by the Standing Committee of VNUPTW - Performing basic administration work - Studying, being well verse in Party directions and policies as well as State regime, policies and laws; resolutions and policies of the Vietnam General Confederation of Labor, the Standing Committee of VNUPTW, the Party Secretariat of the Department General of Posts and Telecommunications (DGPT), DGPT and the Vietnam Posts and Telecommunications Corporation (VNPT), serving the regular instruction of the Standing Committee of VNUPTW. - In co-operation with other departments, helping the Standing Committee of VNUPTW keep an eye on the observation of directions and resolutions of the Standing Committee of VNUPTW; preparing all documents serving periodical and irregular meetings of the Standing Committee of VNUPTW. - Collecting and processing information serving the instruction of the Standing Committee of VNUPTW and office leaders; regularly, periodically and irregularly reporting on the implementation of labor campaigns and union activities. - Mapping out the working agenda for the Standing Committee of VNUPTW; preparing for the organization of meetings of the Standing Committee of VNUPTW as well as seminars and summarizing meetings. - Collecting and submitting to the Standing Committee of VNUPTW and office leaders all documents prepared by subsidiary departments, groups and centers, ensuring the quality, time limit and legal status of these documents. - Proposing programs and plans, and organizing the establishment of work relations between VNUPTW and the Vietnam General Confederation of Labor, as well as relevant co-operation with DGPT, VNPT and mass organizations of the same level. - Organizing the archives work in accordance with relevant regulations, ensuring speed, accuracy and scientology; strictly managing the stamp of the organization. - Performing administration management, security and environment protection, property and material facilities management to ensure normal activities for the Standing Committee of VNUPTW and the staff; helping office leaders in co-operating with the Standing Committee of VNUPTW to organize activities serving staff's life. - Proposing the registration and organizing the study of scientific research theses approved and assigned by the Standing Committee of VNUPTW. - Entertaining visitors, reporting to leaders and relevant departments, groups and centers visitors' requirements and working agenda for the convenience of leaders, departments, groups and centers. 3. Range of competence - As assigned by the Standing Committee of VNUPTW, signing administrative papers and other documents within its range of competence - Sorting incoming documents according to the requirement of the chairman or deputy chairman or others as assigned - Spending on regular needs according to set regulations and plans - Assigning cars serving working trips - The VNUPTW Office is under the direct and comprehensive instruction of the Standing Committee of VNUPTW, and abides by regulations of the leaders of VNUPTW. - Establishing the professional guiding relation with the Office of the Vietnam Confederation of Labor. - Establishing equal relations with the offices of DGPT and VNPT. - Establishing co-operative relations with departments, groups and centers under VNUPTW in relevant activities - Establishing relations with other agencies outside the P&T sector and local agencies - Establishing relations with local P&T labor unions according to the duties and functions assigned The office is run by the chief officer, who is aided by deputy chief officers and experts. The chief officer is responsible to the Standing Committee of VNUPTW for the operation results of the office Home | Profile | History | Legal | Activities | News | Vietnam National Union of Post and Telecoms Workers 30 Hang Chuoi St., Hai Ba Trung Dist., Ha Noi Tel: +84-4-9713514 Fax: +84-4-9720236",
    "Vietnam National Union of Post and Telecoms Workers Managing the organization and operations of the Trade Union Board of Inspection and people's inspectors at all levels within the system of VNUPTW Acting as the counsellor to the Standing Committee of VNUPTW in providing instructions related to trade union examination and people's inspection activities Managing, settling and co-operating with other relevant bodies to deal with complaints and denouncements of trade union members to VNUPTW organizations Studying and proposing solutions to manage, supervise and examine trade union examination and people's inspection activities, and dealing with complaints and denouncements within the P&T sector as well as at the VNUPTW bodies Mapping out and submitting its annual directions, objectives, plans and activity agenda to the Standing Committee of VNUPTW for approval Supervising and speeding up the VNUPTW Board of Inspection's duty completion in accordance with Vietnam General Confederation of Labor's charter Co-operating with and providing professional guidance to boards of inspection at all levels within the system of VNUPTW Receiving visitors, and handling complaints and denouncements of trade union members and laborers related to trade unions organizations; Co-operating with departments of VNUPTW, other functional departments of specialized organizations and the State to settle complaints and denouncements of trade union members and laborers in the P&T sector Providing guidance, supervising and speeding up the fight against corruption, smuggling and people's inspection performance within the system of VNUPTW Generalizing and summing up the performance results of trade union examination, people's inspection, the fight against corruption and smuggling, and the settlement of complaints and denouncements according to the approved programs and plans Collecting accurate, adequate and update information to enable the Standing Committee of VNUPTW to co-operate with the Vietnam General Confederation of Labor, DGPT and VNPT in performing trade union examination, people's inspection, the fight against corruption and smuggling, and the settlement of complaints and denouncements of citizens Being responsible for the participation in, contribution to and implementation of trade union examination, people's inspection, the fight against corruption and smuggling, and the settlement of complaints and denouncements at the VNUPTW organization 3. Range of competence Authorized by the Standing Committee of VNUPTW to examine, supervise and instruct trade unions at all levels regarding trade union examination, people's inspection, the fight against corruption and smuggling, and the settlement of complaints and denouncements Authorized by the Standing Committee of VNUPTW to speed up other departments within VNUPTW in performing their duties in trade union examination, people's inspection, the fight against corruption and smuggling, and the settlement of complaints and denouncements Signing, on behalf of the Standing Committee of VNUPTW, professional guiding documents governing people's inspection and settlement of complaints and denouncements in capacity of the leading expert The leading expert in charge of inspection and settlement of complaints and denouncements is under the direct and comprehensive direction of the Standing Committee of VNUPTW (chairman and deputy chairmen), and regulations of leaders of VNUPTW Establishing equal relations with functional departments and divisions of DGPT, VNPT, State bodies and socio-political organizations related to the board's functions and duties Establishing relations with departments, offices, groups and centers under VNUPTW within its range of activities Establishing relations with trade unions at all levels within the system of VNUPTW according to the assigned functions and duties . Home | Profile | History | Legal | Activities | News | Vietnam National Union of Post and Telecoms Workers 30 Hang Chuoi St., Hai Ba Trung Dist., Ha Noi Tel: +84-4-9713514 Fax: +84-4-9720236"
  ]
}