{
  "company": "waldophotos.com",
  "dominant_topics": [
    1,
    0
  ],
  "topic_counts": {
    "1": 6,
    "0": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.6153846153846154,
    "framing_surveillance": 0.2307692307692307,
    "framing_market": 0.1538461538461538,
    "num_docs": 7
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "1": 6
    }
  },
  "sample_docs": [
    "Goodbye photo-hoarding guilt Waldo delivers photos of everyone to everyone, right on their phones. The old way The Waldo Way The perfect photo-sharing tool for all the amazing moments you capture at the… Basketball game School play Gymnastics meet Homecoming parade The features you'll love 😠Your beautiful pics. Delivered. Your photos are delivered via mobile to each person found in them. Powered by Facial Recognition Those you photograph submit a selfie and get notified every time they appear in your photos. Easy inviting, sharing & Printing Secure in-app inviting to private photo streams. And simplified print ordering. This is how it works For photographers For photoseekers Upload to Waldo Easy drag & drop, browse or mobile upload to the Waldo cloud. Share code (or Waldo handle) Provide those you photograph an album code or your Waldo handle. Waldo matches & delivers Each person found in your album receives a text alert with their photos. Are you a Pro? Set your prices for individual photos, subscriptions and prints. Text in your album's Join Code Text Waldo your album code or photographer's Waldo handle to 735-343. Upload a selfie Snap a selfie for Waldo to use. Sit back, relax and Live the Moment Get all of the photos you're found in delivered via text alerts! Download the Waldo app Download the FREE Waldo app and invite family members to your photo stream. When Waldo finds your photos they'll get app alerts to view them just like you! Intelligent. Mobile. Secure. Take your photography to the next level with AI powered mobile delivery. Share your work with those who will cherish it forever. Start for FREE See all features Effortless photo delivery Waldo sends a text alert or app notification to the people in your photos anytime they appear in your albums. FaceBlocker: patented photo protection Say goodbye to screen captures and hello to advanced technology that drives individual photo sales and downloads. A FREE web gallery Take advantage of a beautiful web gallery for your albums. Perfect for those who want to view your photos without Waldo-fying their photo delivery. Don't just take it from us Try the platform for yourself and start sharing your photos with the world. Start for FREE See all features Still have questions? Contact Eric at + 1 512 222 3129 or reach out to him at sales@waldophotos.com ERIC KATZ Sales Inquiries Goodbye photo-hoarding guilt Waldo delivers photos of everyone to everyone, right on their phones. The old way The Waldo Way Waldo delivers photos of everyone to everyone, right on their phones. The perfect photo-sharing tool for all the amazing moments you capture at the… Basketball game School play Gymnastics meet Homecoming parade The features you'll love 😠Your beautiful pics. Delivered. Your photos are delivered via mobile to each person found in them. Powered by Facial Recognition Those you photograph submit a selfie and get notified every time they appear in your photos. Easy inviting, sharing & Printing Secure in-app inviting to private photo streams. And simplified print ordering. This is how it works For photographers For photoseekers Upload to Waldo Easy drag & drop, browse or mobile upload to the Waldo cloud. Share code (or Waldo handle) Provide those you photograph an album code or your Waldo handle. Waldo matches & delivers Each person found in your album receives a text alert with their photos. Are you a Pro? Set your prices for individual photos, subscriptions and prints. Text in your album's Join Code Text Waldo your album code or photographer's Waldo handle to 735-343. Upload a selfie Snap a selfie for Waldo to use. Sit back, relax and Live the Moment Get all of the photos you're found in delivered via text alerts! Download the Waldo app Download the FREE Waldo app and invite family members to your photo stream. When Waldo finds your photos they'll get app alerts to view them just like you! Intelligent. Mobile. Secure. Take your photography to the next level with AI powered mobile delivery. Share your work with those who will cherish it forever. Start for FREE See all features Effortless photo delivery Waldo sends a text alert or app notification to the people in your photos anytime they appear in your albums. FaceBlocker: patented photo protection Say goodbye to screen captures and hello to advanced technology that drives individual photo sales and downloads. A FREE web gallery Take advantage of a beautiful web gallery for your albums. Perfect for those who want to view your photos without Waldo-fying their photo delivery. The perfect photo-sharing tool for all the amazing moments you capture at the… The features you'll love 😠Your beautiful pics. Delivered. Your photos are delivered via mobile to each person found in them. Powered by Facial Recognition Those you photograph submit a selfie and get notified every time they appear in your photos. Easy inviting, sharing & Printing Secure in-app inviting to private photo streams. And simplified print ordering. This is how it works Upload to Waldo Easy drag & drop, browse or mobile upload to the Waldo cloud. Easy drag & drop, browse or mobile upload to the Waldo cloud. Share code (or Waldo handle) Provide those you photograph an album code or your Waldo handle. Share code (or Waldo handle) Provide those you photograph an album code or your Waldo handle. Waldo matches & delivers Each person found in your album receives a text alert with their photos. Waldo matches & delivers Each person found in your album receives a text alert with their photos. Are you a Pro? Set your prices for individual photos, subscriptions and prints. Are you a Pro? Set your prices for individual photos, subscriptions and prints. Text in your album's Join Code Text Waldo your album code or photographer's Waldo handle to 735-343. Text in your album's Join Code Text Waldo your album code or photographer's Waldo handle to 735-343. Upload a selfie Snap a selfie for Waldo to use. Snap a selfie for Waldo to use. Sit back, relax and Live the Moment Get all of the photos you're found in delivered via text alerts! Sit back, relax and Live the Moment Get all of the photos you're found in delivered via text alerts! Download the Waldo app Download the FREE Waldo app and invite family members to your photo stream. When Waldo finds your photos they'll get app alerts to view them just like you! Download the Waldo app Download the FREE Waldo app and invite family members to your photo stream. When Waldo finds your photos they'll get app alerts to view them just like you! Take your photography to the next level with AI powered mobile delivery. Share your work with those who will cherish it forever. Waldo sends a text alert or app notification to the people in your photos anytime they appear in your albums. FaceBlocker: patented photo protection Say goodbye to screen captures and hello to advanced technology that drives individual photo sales and downloads. A FREE web gallery Take advantage of a beautiful web gallery for your albums. Perfect for those who want to view your photos without Waldo-fying their photo delivery. Don't just take it from us Try the platform for yourself and start sharing your photos with the world. Start for FREE See all features Don't just take it from us Try the platform for yourself and start sharing your photos with the world. Still have questions? Contact Eric at + 1 512 222 3129 or reach out to him at sales@waldophotos.com ERIC KATZ Sales Inquiries Contact Eric at + 1 512 222 3129 or reach out to him at sales@waldophotos.com Contact Eric at + 1 512 222 3129 or reach out to him at sales@waldophotos.com",
    "A secure & smart photo management platform for schools, powered by facial recognition. The time has come to say goodbye to: Parents frantically photographing school events instead of living and enjoying the moment. 98% of photos taken never being seen by those in them. Yearbook staff drowning in disorganized photos and a lack of time to curate. Photos taken by outside photographers published to online galleries with no security. Antiquated \"Picture Days\" full of lost forms, lost checks and crumpled proofs. Why Schools â¤ï¸ Waldo Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and class-friendly. Powered by Facial Recognition Parents submit selfies of your students and get notified every time they appear in any of your photos. Convenience Your photographers upload pics to one place. Waldo finds faces and delivers photos to the parents of the students in them. Parents can view, download, and print photos all in one friendly app. Get Waldo for Schools Know of a school that could benefit from Waldo? Refer us to them ! Do not publish As soon as photos are uploaded, Waldo removes any photos of any student who should be protected or not published. For certain eyes only With unique album codes and mobile pin code validation, Waldo enables you to collect and share all your photos in a secure environment. Easy yearbook curation Facial recognition powered dashboard enables you to view analytics and pick favorites for each student to plan photo coverage and curate yearbook. Contact one of our School specialists Fundraising, the Waldo way Each paid subscription can have 50% of the revenue go directly back to the school and into the classrooms. Photo fun for the whole family. Grandma too! Parents can invite up to 6 family members to the photo stream, which means connecting more grandparents (and alumni!) to your school events and fundraising. A secure & smart photo management platform for schools, powered by facial recognition. The time has come to say goodbye to: Parents frantically photographing school events instead of living and enjoying the moment. 98% of photos taken never being seen by those in them. Yearbook staff drowning in disorganized photos and a lack of time to curate. Photos taken by outside photographers published to online galleries with no security. Antiquated \"Picture Days\" full of lost forms, lost checks and crumpled proofs. Why Schools â¤ï¸ Waldo Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and class-friendly. Powered by Facial Recognition Parents submit selfies of your students and get notified every time they appear in any of your photos. Convenience Your photographers upload pics to one place. Waldo finds faces and delivers photos to the parents of the students in them. Parents can view, download, and print photos all in one friendly app. Get Waldo for Schools Know of a school that could benefit from Waldo? Refer us to them ! Do not publish As soon as photos are uploaded, Waldo removes any photos of any student who should be protected or not published. For certain eyes only With unique album codes and mobile pin code validation, Waldo enables you to collect and share all your photos in a secure environment. Easy yearbook curation Facial recognition powered dashboard enables you to view analytics and pick favorites for each student to plan photo coverage and curate yearbook. Contact one of our School specialists Fundraising, the Waldo way Each paid subscription can have 50% of the revenue go directly back to the school and into the classrooms. Photo fun for the whole family. Grandma too! Parents can invite up to 6 family members to the photo stream, which means connecting more grandparents (and alumni!) to your school events and fundraising. A secure & smart photo management platform for schools, powered by facial recognition. The time has come to say goodbye to: Parents frantically photographing school events instead of living and enjoying the moment. 98% of photos taken never being seen by those in them. Yearbook staff drowning in disorganized photos and a lack of time to curate. Photos taken by outside photographers published to online galleries with no security. Antiquated \"Picture Days\" full of lost forms, lost checks and crumpled proofs. A secure & smart photo management platform for schools, powered by facial recognition. The time has come to say goodbye to: Parents frantically photographing school events instead of living and enjoying the moment. Parents frantically photographing school events instead of living and enjoying the moment. 98% of photos taken never being seen by those in them. 98% of photos taken never being seen by those in them. Yearbook staff drowning in disorganized photos and a lack of time to curate. Yearbook staff drowning in disorganized photos and a lack of time to curate. Photos taken by outside photographers published to online galleries with no security. Photos taken by outside photographers published to online galleries with no security. Antiquated \"Picture Days\" full of lost forms, lost checks and crumpled proofs. Antiquated \"Picture Days\" full of lost forms, lost checks and crumpled proofs. Why Schools â¤ï¸ Waldo Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and class-friendly. Powered by Facial Recognition Parents submit selfies of your students and get notified every time they appear in any of your photos. Convenience Your photographers upload pics to one place. Waldo finds faces and delivers photos to the parents of the students in them. Parents can view, download, and print photos all in one friendly app. Get Waldo for Schools Why Schools â¤ï¸ Waldo Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and class-friendly. Powered by Facial Recognition Parents submit selfies of your students and get notified every time they appear in any of your photos. Your photographers upload pics to one place. Waldo finds faces and delivers photos to the parents of the students in them. Parents can view, download, and print photos all in one friendly app. Know of a school that could benefit from Waldo? Refer us to them ! Know of a school that could benefit from Waldo? Refer us to them ! Know of a school that could benefit from Waldo? Refer us to them ! Do not publish As soon as photos are uploaded, Waldo removes any photos of any student who should be protected or not published. As soon as photos are uploaded, Waldo removes any photos of any student who should be protected or not published. For certain eyes only With unique album codes and mobile pin code validation, Waldo enables you to collect and share all your photos in a secure environment. For certain eyes only With unique album codes and mobile pin code validation, Waldo enables you to collect and share all your photos in a secure environment. Easy yearbook curation Facial recognition powered dashboard enables you to view analytics and pick favorites for each student to plan photo coverage and curate yearbook. Facial recognition powered dashboard enables you to view analytics and pick favorites for each student to plan photo coverage and curate yearbook. Contact one of our School specialists Contact one of our School specialists Fundraising, the Waldo way Each paid subscription can have 50% of the revenue go directly back to the school and into the classrooms. Photo fun for the whole family. Grandma too! Parents can invite up to 6 family members to the photo stream, which means connecting more grandparents (and alumni!) to your school events and fundraising. Fundraising, the Waldo way Each paid subscription can have 50% of the revenue go directly back to the school and into the classrooms. Photo fun for the whole family. Grandma too! Parents can invite up to 6 family members to the photo stream, which means connecting more grandparents (and alumni!) to your school events and fundraising.",
    "Summer camp photo software that delivers Waldo has come to camp, and he's packed his amazing photo technology in his trunk. Using facial recognition, Waldo finds photos of each camper and delivers them via text message to their families as soon as the photos are uploaded to the camp album. Your campers are living the moment. You should be, too. No more worried parent phone calls, wondering if their child is having a good time. No more haphazard photo coverage. Just pure delight, delivered directly to your families' phones. Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and camp-friendly. Powered by facial recognition Your families submit a selfie of your camper and get notified every time they appear in your photos. In-app branding filters Make it easy for your camp families to share their camper's photos with your branding with options to include your logo on photo downloads, social shares, and more. Get Waldo for Camps Know of a camp that could benefit from Waldo? Refer us to them ! Do not publish Have campers who should not be photographed or published? Waldo runs matching to ensure any photos of a protected camper are pulled from gallery and not published. For certain eyes only Give parents the option to view the photos free in a web gallery. Protected by a password and optional pin code phone verification, the album allows parents to view, download, share directly to Facebook, order prints, and more. And it allows you, the camp, to add branding and optional pricing for hi-res downloads. Customer success dashboard Waldo gives you the photo sharing control. Your photographers or staff can upload all photos, then curate. Or curate, then upload. You can choose to deliver pics as soon as they're uploaded, or wait until the time is right. Contact one of our Camp specialists Fundraising, the Waldo way Camps who jump on the Waldo platform get the added option of an incredible fundraising model that sends 50% of all photo profits back to camps for scholarships or fundraising projects of your choice. Read about how Waldo helped raise $75k for one Texas summer camp Read the article → Free webinar 10 tips to improve your camp photography Hosted by Katherine Spencer, a former camp photographer. Learn how your summer camp can improve coverage, cut down on parent phone calls and emails, and better capture all the fun and values at your camp. Watch the Webinar → \" The Waldo team is responsive, customer-focused and fun. Most importantly, the Waldo fundraising model helped us reach our goal of $75,000 for our \"Bless a Coach†fund … we are so excited to send those \"blessings†to our Coaches (counselors), which goes toward their college expenses \" Alice Mayer - Director of Marketing at T Bar M Camps Summer camp photo software that delivers Waldo has come to camp, and he's packed his amazing photo technology in his trunk. Using facial recognition, Waldo finds photos of each camper and delivers them via text message to their families as soon as the photos are uploaded to the camp album. Your campers are living the moment. You should be, too. No more worried parent phone calls, wondering if their child is having a good time. No more haphazard photo coverage. Just pure delight, delivered directly to your families' phones. Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and camp-friendly. Powered by facial recognition Your families submit a selfie of your camper and get notified every time they appear in your photos. In-app branding filters Make it easy for your camp families to share their camper's photos with your branding with options to include your logo on photo downloads, social shares, and more. Get Waldo for Camps Know of a camp that could benefit from Waldo? Refer us to them ! Do not publish Have campers who should not be photographed or published? Waldo runs matching to ensure any photos of a protected camper are pulled from gallery and not published. For certain eyes only Give parents the option to view the photos free in a web gallery. Protected by a password and optional pin code phone verification, the album allows parents to view, download, share directly to Facebook, order prints, and more. And it allows you, the camp, to add branding and optional pricing for hi-res downloads. Customer success dashboard Waldo gives you the photo sharing control. Your photographers or staff can upload all photos, then curate. Or curate, then upload. You can choose to deliver pics as soon as they're uploaded, or wait until the time is right. Contact one of our Camp specialists Fundraising, the Waldo way Camps who jump on the Waldo platform get the added option of an incredible fundraising model that sends 50% of all photo profits back to camps for scholarships or fundraising projects of your choice. Read about how Waldo helped raise $75k for one Texas summer camp Read the article → Free webinar 10 tips to improve your camp photography Hosted by Katherine Spencer, a former camp photographer. Learn how your summer camp can improve coverage, cut down on parent phone calls and emails, and better capture all the fun and values at your camp. Watch the Webinar → \" The Waldo team is responsive, customer-focused and fun. Most importantly, the Waldo fundraising model helped us reach our goal of $75,000 for our \"Bless a Coach†fund … we are so excited to send those \"blessings†to our Coaches (counselors), which goes toward their college expenses \" Alice Mayer - Director of Marketing at T Bar M Camps Summer camp photo software that delivers Waldo has come to camp, and he's packed his amazing photo technology in his trunk. Using facial recognition, Waldo finds photos of each camper and delivers them via text message to their families as soon as the photos are uploaded to the camp album. Your campers are living the moment. You should be, too. No more worried parent phone calls, wondering if their child is having a good time. No more haphazard photo coverage. Just pure delight, delivered directly to your families' phones. Summer camp photo software that delivers Waldo has come to camp, and he's packed his amazing photo technology in his trunk. Using facial recognition, Waldo finds photos of each camper and delivers them via text message to their families as soon as the photos are uploaded to the camp album. Your campers are living the moment. You should be, too. No more worried parent phone calls, wondering if their child is having a good time. No more haphazard photo coverage. Just pure delight, delivered directly to your families' phones. Waldo has come to camp, and he's packed his amazing photo technology in his trunk. Using facial recognition, Waldo finds photos of each camper and delivers them via text message to their families as soon as the photos are uploaded to the camp album. Your campers are living the moment. You should be, too. No more worried parent phone calls, wondering if their child is having a good time. No more haphazard photo coverage. Just pure delight, delivered directly to your families' phones. Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and camp-friendly. Powered by facial recognition Your families submit a selfie of your camper and get notified every time they appear in your photos. In-app branding filters Make it easy for your camp families to share their camper's photos with your branding with options to include your logo on photo downloads, social shares, and more. Get Waldo for Camps Fun and friendly photo alerts Every time photos are matched, Waldo sends a fun text message or notification, keeping the photo delivery fun, conversational, and camp-friendly. Powered by facial recognition Your families submit a selfie of your camper and get notified every time they appear in your photos. Make it easy for your camp families to share their camper's photos with your branding with options to include your logo on photo downloads, social shares, and more. Know of a camp that could benefit from Waldo? Refer us to them ! Know of a camp that could benefit from Waldo? Refer us to them ! Know of a camp that could benefit from Waldo? Refer us to them ! Do not publish Have campers who should not be photographed or published? Waldo runs matching to ensure any photos of a protected camper are pulled from gallery and not published. Have campers who should not be photographed or published? Waldo runs matching to ensure any photos of a protected camper are pulled from gallery and not published. For certain eyes only Give parents the option to view the photos free in a web gallery. Protected by a password and optional pin code phone verification, the album allows parents to view, download, share directly to Facebook, order prints, and more. And it allows you, the camp, to add branding and optional pricing for hi-res downloads. For certain eyes only Give parents the option to view the photos free in a web gallery. Protected by a password and optional pin code phone verification, the album allows parents to view, download, share directly to Facebook, order prints, and more. And it allows you, the camp, to add branding and optional pricing for hi-res downloads. Customer success dashboard Waldo gives you the photo sharing control. Your photographers or staff can upload all photos, then curate. Or curate, then upload. You can choose to deliver pics as soon as they're uploaded, or wait until the time is right. Waldo gives you the photo sharing control. Your photographers or staff can upload all photos, then curate. Or curate, then upload. You can choose to deliver pics as soon as they're uploaded, or wait until the time is right. Contact one of our Camp specialists Contact one of our Camp specialists Fundraising, the Waldo way Camps who jump on the Waldo platform get the added option of an incredible fundraising model that sends 50% of all photo profits back to camps for scholarships or fundraising projects of your choice. Read about how Waldo helped raise $75k for one Texas summer camp Read the article → Free webinar 10 tips to improve your camp photography Hosted by Katherine Spencer, a former camp photographer. Learn how your summer camp can improve coverage, cut down on parent phone calls and emails, and better capture all the fun and values at your camp. Watch the Webinar → Fundraising, the Waldo way Camps who jump on the Waldo platform get the added option of an incredible fundraising model that sends 50% of all photo profits back to camps for scholarships or fundraising projects of your choice. Read about how Waldo helped raise $75k for one Texas summer camp 10 tips to improve your camp photography Hosted by Katherine Spencer, a former camp photographer. Learn how your summer camp can improve coverage, cut down on parent phone calls and emails, and better capture all the fun and values at your camp. \" The Waldo team is responsive, customer-focused and fun. Most importantly, the Waldo fundraising model helped us reach our goal of $75,000 for our \"Bless a Coach†fund … we are so excited to send those \"blessings†to our Coaches (counselors), which goes toward their college expenses \" Alice Mayer - Director of Marketing at T Bar M Camps \" The Waldo team is responsive, customer-focused and fun. Most importantly, the Waldo fundraising model helped us reach our goal of $75,000 for our \"Bless a Coach†fund … we are so excited to send those \"blessings†to our Coaches (counselors), which goes toward their college expenses \"",
    "Who is Waldo? Waldo is a photo-finding phenom. With Waldo, every photo of you and your family, taken by Waldo-fied photographers, is delivered to your smartphone. Whether you're at your daughter's tennis match, missing your kids at summer camp, on family vacation at a beach resort, or at your cousin's wedding, Waldo finds all your family's photos and delivers them to you . Drop the selfie stick, put your phone in your pocket and Live the Moment! The days of wishing you could have gotten that incredible photo from an amazing photographer are now a reality. Welcome to the future. Welcome to Waldo. Follow me Customers â¤ï¸ Waldo Waldo brings AI and a mobile photo delivery platform to summer camps , pro & amateur photographers , schools , youth sports, resorts and weddings and events . Using proprietary technologies that combine facial & object recognition, GPS, and real-time cloud delivery with the convenience of a text-based interface, Waldo enables photos to flow from the photographer to the photographed, as seamlessly as they should. \" I love Waldo because it's so simple. Not having to scroll through hundreds of photos to find the few you're interested in is a total game changer! \" VANESSA BRADY Camper Mom Waldo in the press Folks are talking about us! Come work with us Help us revolutionize mobile photo delivery and work on exciting projects with talented people. See open positions Who is Waldo? Waldo is a photo-finding phenom. With Waldo, every photo of you and your family, taken by Waldo-fied photographers, is delivered to your smartphone. Whether you're at your daughter's tennis match, missing your kids at summer camp, on family vacation at a beach resort, or at your cousin's wedding, Waldo finds all your family's photos and delivers them to you . Drop the selfie stick, put your phone in your pocket and Live the Moment! The days of wishing you could have gotten that incredible photo from an amazing photographer are now a reality. Welcome to the future. Welcome to Waldo. Follow me Customers â¤ï¸ Waldo Waldo brings AI and a mobile photo delivery platform to summer camps , pro & amateur photographers , schools , youth sports, resorts and weddings and events . Using proprietary technologies that combine facial & object recognition, GPS, and real-time cloud delivery with the convenience of a text-based interface, Waldo enables photos to flow from the photographer to the photographed, as seamlessly as they should. \" I love Waldo because it's so simple. Not having to scroll through hundreds of photos to find the few you're interested in is a total game changer! \" VANESSA BRADY Camper Mom Waldo in the press Folks are talking about us! Come work with us Help us revolutionize mobile photo delivery and work on exciting projects with talented people. See open positions Who is Waldo? Waldo is a photo-finding phenom. With Waldo, every photo of you and your family, taken by Waldo-fied photographers, is delivered to your smartphone. Whether you're at your daughter's tennis match, missing your kids at summer camp, on family vacation at a beach resort, or at your cousin's wedding, Waldo finds all your family's photos and delivers them to you . Drop the selfie stick, put your phone in your pocket and Live the Moment! The days of wishing you could have gotten that incredible photo from an amazing photographer are now a reality. Welcome to the future. Welcome to Waldo. Follow me Waldo is a photo-finding phenom. With Waldo, every photo of you and your family, taken by Waldo-fied photographers, is delivered to your smartphone. Whether you're at your daughter's tennis match, missing your kids at summer camp, on family vacation at a beach resort, or at your cousin's wedding, Waldo finds all your family's photos and delivers them to you . Drop the selfie stick, put your phone in your pocket and Live the Moment! The days of wishing you could have gotten that incredible photo from an amazing photographer are now a reality. Welcome to the future. Welcome to Waldo. Waldo brings AI and a mobile photo delivery platform to summer camps , pro & amateur photographers , schools , youth sports, resorts and weddings and events . Using proprietary technologies that combine facial & object recognition, GPS, and real-time cloud delivery with the convenience of a text-based interface, Waldo enables photos to flow from the photographer to the photographed, as seamlessly as they should. Waldo brings AI and a mobile photo delivery platform to summer camps , pro & amateur photographers , schools , youth sports, resorts and weddings and events . Using proprietary technologies that combine facial & object recognition, GPS, and real-time cloud delivery with the convenience of a text-based interface, Waldo enables photos to flow from the photographer to the photographed, as seamlessly as they should. \" I love Waldo because it's so simple. Not having to scroll through hundreds of photos to find the few you're interested in is a total game changer! \" VANESSA BRADY Camper Mom \" I love Waldo because it's so simple. Not having to scroll through hundreds of photos to find the few you're interested in is a total game changer! \" Waldo in the press Folks are talking about us! Waldo in the press Folks are talking about us! Come work with us Help us revolutionize mobile photo delivery and work on exciting projects with talented people. See open positions Come work with us Help us revolutionize mobile photo delivery and work on exciting projects with talented people.",
    "© Waldo 2017, Supercharge your event photography. The days of your attendees wading through huge event albums to find their photo needles in the haystack are over. Waldo uses facial recognition to deliver photos of each attendee to each attendee – right on their phones! The perfect party favor for any event Amps up the photo fun with crowdsourced photos When option is enabled, the free app allows your event attendees to upload and share all their pics, too. Generates buzz for your event Delivering photos in real time allows your guests to share easily and often, all with your branding and event hashtags. Guests submit a selfie to get all their photos! Anytime a new photo is uploaded in which they appear, they'll get notified! Join hundreds of events and photographers who use Waldo to supercharge their photography. \"We witnessed the power of their technology firsthand and saw the reactions from users. A pretty common response? ' Whoa, this is incredible !'\" Kristopher Potrafka, Founder and CEO, Music Firsthand Amplify your event, company or photographer brand With brand filters to overlay your photos and auto-populated hashtags for social shares, you can amplify your brand quickly and efficiently. Waldo sends a text message or app notification any time a photo of an attendee is found. Engage your attendees with the pics they want to see Looking to Waldo-fy a wedding? Visit WaldoWed , we've got your wedding gallery covered! Great for corporate events, galas, conferences and parties! Easy text onboarding for guests with a personalized join code Matching photo alerts delivered via Push Notifications or text messages Custom brand photo filters (optional) Auto-populated hashtags for in-app social posts Crowdsources photos from attendees (optional) Chat with a Waldo events specialist FEATURES ABOUT BLOG CONTACT"
  ]
}