{
  "company": "wct-inc.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 8
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.775,
    "framing_surveillance": 0.075,
    "framing_market": 0.15,
    "num_docs": 8
  },
  "topic_timeline": {
    "20": {
      "0": 8
    }
  },
  "sample_docs": [
    "We respect the privacy of every individual who visits our website Information about you When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. Children's Privacy This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information Sharing & Transfers We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). Transmission We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. Mobile Information sharing WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information. We respect the privacy of every individual who visits our website Information about you When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. Children's Privacy This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information Sharing & Transfers We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). Transmission We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. Mobile Information sharing WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information. We respect the privacy of every individual who visits our website When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information.",
    "North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface.",
    "World Compliance Technologies takes the decades of experience in understanding security, compliance and risk management, and builds on the core products to enhance its suite of solutions to be comprehensive in Identity & Security, global trade and enablement of the trade compliance portal in the international markets. With a presence in the US, Europe, the Middle East and Asia Pacific, we specialize in security solutions and identity management. With a strong focus on go to market, real time solutions based on proven research and development, WCT delivers efficient, comprehensive and cost-effective solutions in the industry. Our Mission: to be the leader in providing identity and security solutions Our Solutions: empower businesses with the right tools to identify, verify and pre-authorize individuals Our Clients: operate confidently with the highest standards of ethical business practice corporate information CEO's Message Our Approach Industries World Compliance Technologies takes the decades of experience in understanding security, compliance and risk management, and builds on the core products to enhance its suite of solutions to be comprehensive in Identity & Security, global trade and enablement of the trade compliance portal in the international markets. With a presence in the US, Europe, the Middle East and Asia Pacific, we specialize in security solutions and identity management. With a strong focus on go to market, real time solutions based on proven research and development, WCT delivers efficient, comprehensive and cost-effective solutions in the industry. Our Mission: to be the leader in providing identity and security solutions Our Solutions: empower businesses with the right tools to identify, verify and pre-authorize individuals Our Clients: operate confidently with the highest standards of ethical business practice World Compliance Technologies takes the decades of experience in understanding security, compliance and risk management, and builds on the core products to enhance its suite of solutions to be comprehensive in Identity & Security, global trade and enablement of the trade compliance portal in the international markets. With a presence in the US, Europe, the Middle East and Asia Pacific, we specialize in security solutions and identity management. With a strong focus on go to market, real time solutions based on proven research and development, WCT delivers efficient, comprehensive and cost-effective solutions in the industry. Our Mission: to be the leader in providing identity and security solutions Our Solutions: empower businesses with the right tools to identify, verify and pre-authorize individuals Our Clients: operate confidently with the highest standards of ethical business practice World Compliance Technologies takes the decades of experience in understanding security, compliance and risk management, and builds on the core products to enhance its suite of solutions to be comprehensive in Identity & Security, global trade and enablement of the trade compliance portal in the international markets. With a presence in the US, Europe, the Middle East and Asia Pacific, we specialize in security solutions and identity management. With a strong focus on go to market, real time solutions based on proven research and development, WCT delivers efficient, comprehensive and cost-effective solutions in the industry. Our Mission: to be the leader in providing identity and security solutions Our Solutions: empower businesses with the right tools to identify, verify and pre-authorize individuals Our Clients: operate confidently with the highest standards of ethical business practice CEO's Message Our Approach Industries",
    "All modern organizations need to protect their physical and IP assets. Ensuring the safety of employees and controlling the movement of people (internal and external) with a predefined protocol is a must nowadays. The first step towards securing an organization is getting rid of disintegrated, out-dated technologies. Similarly, upgrading to future-ready technologies, that ensure zero errors, is equally important. Our Solutions ACCESS MANAGEMENT TIME & ATTENDENCE EASE VISITOR Visitor Management Integrated All modern organizations need to protect their physical and IP assets. Ensuring the safety of employees and controlling the movement of people (internal and external) with a predefined protocol is a must nowadays. The first step towards securing an organization is getting rid of disintegrated, out-dated technologies. Similarly, upgrading to future-ready technologies, that ensure zero errors, is equally important. All modern organizations need to protect their physical and IP assets. Ensuring the safety of employees and controlling the movement of people (internal and external) with a predefined protocol is a must nowadays. The first step towards securing an organization is getting rid of disintegrated, out-dated technologies. Similarly, upgrading to future-ready technologies, that ensure zero errors, is equally important. All modern organizations need to protect their physical and IP assets. Ensuring the safety of employees and controlling the movement of people (internal and external) with a predefined protocol is a must nowadays. The first step towards securing an organization is getting rid of disintegrated, out-dated technologies. Similarly, upgrading to future-ready technologies, that ensure zero errors, is equally important. ACCESS MANAGEMENT TIME & ATTENDENCE EASE VISITOR Visitor Management Integrated",
    "WCT-inc.com of Use This Web site is operated by WCT Services, Inc (\"WCTâ€). Throughout the site, the \"we,†\"us†and \"our†refer to WCT. WCT offers this Web site, including all information, tools and services available from this site, to you, the user, conditioned upon your acceptance of all the , conditions, policies and notices stated here. Your use of this site constitutes your agreement to these of Use. Accuracy, Completeness and Timeliness of Information on This Site WCT is not responsible if information made available on this site is not accurate, complete or current. The material on this site is provided for general information only and should not be relied upon or used as the sole basis for making decisions without consulting primary, more accurate, more complete or more timely sources of information. Any reliance on the material on this site is at your own risk. This site may contain certain historical information. Historical information necessarily is not current and is provided for your reference only. We reserve the right to modify the contents of this site at any time, but we have no obligation to update any information on the site. You agree that it is your responsibility to monitor changes to the site. Use of Materials on the Site All content on this site (including, without limitation, text, design, graphics, logos, icons, images, audio clips, downloads, interfaces, code and software, as well as the selection and arrangement thereof), is the exclusive property of and owned by WCT, its licensors or its content providers and is protected by copyright, trademark and other applicable laws. You may access, copy, download and print the material contained on the site for your personal and non-commercial use, provided you do not modify or delete any copyright, trademark or other proprietary notice that appears on the material you access, copy, download or print. Any other use of content on the site, including but not limited to the modification, distribution, transmission, performance, broadcast, publication, uploading, licensing, reverse engineering, transfer or sale of, or the creation of derivative works from, any material, information, software, products or services obtained from the site, or use of the site for purposes competitive to WCT, is expressly prohibited. You agree to abide by all additional restrictions displayed on the site as it may be updated from time to time. WCT reserves the right to refuse or cancel any person's registration for this site, remove any person from this site or prohibit any person from using this site for any reason whatsoever. WCT, or its licensors or content providers, retain full and complete title to the material provided on the site, including all associated intellectual property rights, and provide this material to you under a license that is revocable at any time in WCT's sole discretion. WCT neither warrants nor represents that your use of materials on this site will not infringe rights of third parties not affiliated with WCT. You may not use contact information provided on the site for unauthorized purposes, including marketing. You may not use any hardware or software intended to damage or interfere with the proper working of the site or to surreptitiously intercept any system, data or personal information from the site. You agree not to interrupt or attempt to interrupt the operation of the site in any way. WCT reserves the right, in its sole discretion, to limit or terminate your access to or use of the site at any time without notice. Termination of your access or use will not waive or affect any other right or relief to which WCT may be entitled at law or in equity. Materials You Submit You acknowledge that you are responsible for any material you may submit via the site, including the legality, reliability, appropriateness, originality and copyright of any such material. You may not upload to, distribute or otherwise publish through this site any content that (i) is confidential, proprietary, false, fraudulent, libelous, defamatory, obscene, threatening, invasive of privacy or publicity rights, infringing on intellectual property rights, abusive, illegal or otherwise objectionable; (ii) may constitute or encourage a criminal offense, violate the rights of any party or otherwise give rise to liability or violate any law; or (iii) may contain software viruses, political campaigning, chain letters, mass mailings, or any form of \"spam.†You may not use a false email address or other identifying information, impersonate any person or entity or otherwise mislead as to the origin of any content. You may not upload commercial content onto the site. If you do submit material, and unless we indicate otherwise, you grant WCT and its affiliates an unrestricted, nonexclusive, royalty-free, perpetual, irrevocable and fully sublicensable right to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute and display such material throughout the world in any media. You further agree that WCT is free to use any ideas, concepts, know-how that you or individuals acting on your behalf provide to WCT. You grant WCT and its affiliates the right to use the name you submit in connection with such material, if they so choose. All personal information provided via this site will be handled in accordance with the site's online . You represent and warrant that you own or otherwise control all the rights to the content you post; that the content is accurate; that use of the content you supply does not violate any provision herein and will not cause injury to any person or entity; and that you will indemnify WCT for all claims resulting from content you supply. Conduct on the Site Some features that may be available on this site require registration. By registering at and in consideration of your use of the site you agree to provide true, accurate, current and complete information about yourself. Some features on this site require use of a password. You are responsible for protecting your password. You agree that you will be responsible for any and all statements made, and acts or omissions that occur, through the use of your password. If you have any reason to believe or become aware of any loss, theft or unauthorized use of your password, notify WCT immediately. WCT may assume that any communications WCT receives under your password have been made by you unless WCT receives notice otherwise. You or third parties acting on your behalf are not allowed to frame this site or use our proprietary marks as meta tags, without our written consent. These marks include, but are not limited to, World Compliance Technologies, WCT, WCT Services, Inc., WCT International and. You may not use frames or utilize framing techniques or technology to enclose any content included on the site without WCT's express written consent. Further, you may not utilize any site content in any meta tags or any other \"hidden text†techniques or technologies without WCT's express written consent. Links This site may contain links to other Web sites, some of which are operated by WCT or its affiliates and others of which are operated by third parties. These links are provided as a convenience to you and as an additional avenue of access to the information contained therein. We have not necessarily reviewed all the information on those other sites and are not responsible for the content of those or any other sites or any products or services that may be offered through those or any other sites. Inclusion of links to other sites should not be viewed as an endorsement of the content of linked sites. Different may apply to your use of any linked sites. WCT is not responsible for any losses, damages or other liabilities incurred as a result of your use of any linked sites. Trademarks and Copyrights Trademarks, logos and service marks displayed on this site are registered and unregistered trademarks of World Compliance Technologies, WCT Services, Inc. and WCT International, its licensors or content providers, or other third parties. All of these trademarks, logos and service marks are the property of their respective owners. Nothing on this site shall be construed as granting, by implication, estoppel, or otherwise, any license or right to use any trademark, logo or service mark displayed on the site without the owner's prior written permission, except as otherwise described herein. WCT reserves all rights not expressly granted in and to the site and its content. This site and all of its content, including but not limited to text, design, graphics, interfaces and code, and the selection and arrangement thereof, is protected as a compilation under the copyright laws of the United States and other countries. Infringement Notice We respect the intellectual property rights of others and request that you do the same. You are hereby informed that WCT has adopted and reasonably implemented a policy that provides for the termination in appropriate circumstances of subscribers and account holders of WCT's system or network who are repeat copyright infringers. If you believe your copyright or the copyright of a person on whose behalf you are authorized to act has been infringed, you may notify us with valid information and proof of such infringement to – Media.Relations@WCT-inc.com To be effective, your notification must (i) be in writing, (ii) be provided to our office, and (iii) include substantially the following: A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site; Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit the service provider to locate the material; Information reasonably sufficient to permit the service provider to contact the complaining party, such as an address, telephone number, and, if available, an electronic mail address at which the complaining party may be contacted; A statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and A statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. WCT is under no obligation to post, forward, transmit, distribute or otherwise provide any material available on this site, including material you provide to us, and so we have an absolute right to remove any material from the site in our sole discretion at any time. DISCLAIMERS YOUR USE OF THIS SITE IS AT YOUR SOLE RISK. THE SITE IS PROVIDED ON AN \"AS IS†AND \"AS AVAILABLE†BASIS. WE RESERVE THE RIGHT TO RESTRICT OR TERMINATE YOUR ACCESS TO THE SITE OR ANY FEATURE OR PART THEREOF AT ANY TIME. WCT EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND ANY WARRANTIES THAT MATERIALS ON THE SITE ARE NONINFRINGING, AS WELL AS WARRANTIES IMPLIED FROM A COURSE OF PERFORMANCE OR COURSE OF DEALING; THAT ACCESS TO THE SITE WILL BE UNINTERRUPTED OR ERROR-FREE; THAT THE SITE WILL BE SECURE; THAT THE SITE OR THE SERVER THAT MAKES THE SITE AVAILABLE WILL BE VIRUS-FREE; OR THAT INFORMATION ON THE SITE WILL BE COMPLETE, ACCURATE OR TIMELY. IF YOU DOWNLOAD ANY MATERIALS FROM THIS SITE, YOU DO SO AT YOUR OWN DISCRETION AND RISK. YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OF ANY SUCH MATERIALS. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM GE OR THROUGH OR FROM THE SITE SHALL CREATE ANY WARRANTY OF ANY KIND. GE DOES NOT MAKE ANY WARRANTIES OR REPRESENTATIONS REGARDING THE USE OF THE MATERIALS ON THIS SITE IN OF THEIR COMPLETENESS, CORRECTNESS, ACCURACY, ADEQUACY, USEFULNESS, TIMELINESS, RELIABILITY OR OTHERWISE. IN CERTAIN JURISDICTIONS, THE LAW MAY NOT PERMIT THE DISCLAIMER OF WARRANTIES, SO THE ABOVE DISCLAIMER MAY NOT APPLY TO YOU. LIMITATION OF LIABILITY YOU ACKNOWLEDGE AND AGREE THAT YOU ASSUME FULL RESPONSIBILITY FOR YOUR USE OF THE SITE. YOU ACKNOWLEDGE AND AGREE THAT ANY INFORMATION YOU SEND OR RECEIVE DURING YOUR USE OF THE SITE MAY NOT BE SECURE AND MAY BE INTERCEPTED BY UNAUTHORIZED PARTIES. YOU ACKNOWLEDGE AND AGREE THAT YOUR USE OF THE SITE IS AT YOUR OWN RISK AND THAT THE SITE IS MADE AVAILABLE TO YOU AT NO CHARGE. RECOGNIZING SUCH, YOU ACKNOWLEDGE AND AGREE THAT, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER GE NOR ITS AFFILIATES, SUPPLIERS OR THIRD PARTY CONTENT PROVIDERS WILL BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, EXEMPLARY, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR OTHER DAMAGES ARISING OUT OF OR IN ANY WAY RELATED TO THE SITE, OR ANY OTHER SITE YOU ACCESS THROUGH A LINK FROM THIS SITE OR FROM ANY ACTIONS WE TAKE OR FAIL TO TAKE AS A RESULT OF COMMUNICATIONS YOU SEND TO US, OR THE DELAY OR INABILITY TO USE THE SITE, OR FOR ANY INFORMATION, PRODUCTS OR SERVICES ADVERTISED IN OR OBTAINED THROUGH THE SITE, WCT'S REMOVAL OR DELETION OF ANY MATERIALS SUBMITTED OR POSTED ON ITS SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE SITE, WHETHER BASED ON CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE, EVEN IF WCT, ITS AFFILIATES OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. THIS DISCLAIMER APPLIES, WITHOUT LIMITATION, TO ANY DAMAGES OR INJURY ARISING FROM ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECTS, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUSES, FILE CORRUPTION, COMMUNICATION-LINE FAILURE, NETWORK OR SYSTEM OUTAGE, YOUR LOSS OF PROFITS, OR THEFT, DESTRUCTION, UNAUTHORIZED ACCESS TO, ALTERATION OF, LOSS OR USE OF ANY RECORD OR DATA, AND ANY OTHER TANGIBLE OR INTANGIBLE LOSS. YOU SPECIFICALLY ACKNOWLEDGE AND AGREE THAT NEITHER GE NOR ITS SUPPLIERS SHALL BE LIABLE FOR ANY DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF ANY USER OF THE SITE. YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY OF THE ABOVE CLAIMS OR ANY DISPUTE WITH WCT IS TO DISCONTINUE YOUR USE OF THE SITE. YOU AND WCT AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SITE MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES OR THE CAUSE OF ACTION IS PERMANENTLY BARRED. BECAUSE SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, OR THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, ALL OR A PORTION OF THE ABOVE LIMITATION MAY NOT APPLY TO YOU. Indemnification You agree to indemnify, defend and hold harmless WCT and its affiliates and their officers, directors, employees, contractors, agents, licensors, service providers, subcontractors and suppliers from and against any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from your use of the site and any violation of these of Use. If you cause a technical disruption of the site or the systems transmitting the site to you or others, you agree to be responsible for any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from that disruption. WCT reserves the right, at its own expense, to assume exclusive defense and control of any matter otherwise subject to indemnification by you and, in such case, you agree to cooperate with WCT in the defense of such matter. Jurisdiction and Applicable Law The laws of the State of Maryland govern these of Use and your use of the site, and you irrevocably consent to the jurisdiction of the courts located in the State of Maryland for any action arising out of or relating to these of Use. We recognize that it is possible for you to obtain access to this site from any jurisdiction in the world, but we have no practical ability to prevent such access. This site has been designed to comply with the laws of the State Maryland and of the United States. If any material on this site, or your use of the site, is contrary to the laws of the place where you are when you access it, the site is not intended for you, and we ask you not to use the site. You are responsible for informing yourself of the laws of your jurisdiction and complying with them. Changes to These of Use WCT reserves the right, at its sole discretion, to change, modify, add or remove any portion of these of Use, in whole or in part, at any time, by posting revised on the site. It is your responsibility to check periodically for any changes we make to the of Use. Your continued use of the site after any changes to the of Use or other policies means you accept the changes. In the event we make material changes to the of Use, notice of the changes will be posted on the homepage of this Web site and the revised will take effect thirty days after their publication on the site. Entire Agreement and Admissibility This agreement and any policies or operating rules posted on this site constitute the entire agreement and understanding between you and WCT with respect to the subject matter thereof and supersede all prior or contemporaneous communications and proposals, whether oral or written, between the parties with respect to such subject matter. A printed version of these of Use shall be admissible in judicial or administrative proceedings based on or relating to use of the site to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. Severability If any provision of this agreement is unlawful, void or unenforceable, the remaining provisions of the agreement will remain in place. How to Contact Us? If you have any questions or comments about these of Use or this site, please contact us by emailing us at: trademark.query@wct-inc.com Thank you for visiting our site. WCT-inc.com of Use This Web site is operated by WCT Services, Inc (\"WCTâ€). Throughout the site, the \"we,†\"us†and \"our†refer to WCT. WCT offers this Web site, including all information, tools and services available from this site, to you, the user, conditioned upon your acceptance of all the , conditions, policies and notices stated here. Your use of this site constitutes your agreement to these of Use. Accuracy, Completeness and Timeliness of Information on This Site WCT is not responsible if information made available on this site is not accurate, complete or current. The material on this site is provided for general information only and should not be relied upon or used as the sole basis for making decisions without consulting primary, more accurate, more complete or more timely sources of information. Any reliance on the material on this site is at your own risk. This site may contain certain historical information. Historical information necessarily is not current and is provided for your reference only. We reserve the right to modify the contents of this site at any time, but we have no obligation to update any information on the site. You agree that it is your responsibility to monitor changes to the site. Use of Materials on the Site All content on this site (including, without limitation, text, design, graphics, logos, icons, images, audio clips, downloads, interfaces, code and software, as well as the selection and arrangement thereof), is the exclusive property of and owned by WCT, its licensors or its content providers and is protected by copyright, trademark and other applicable laws. You may access, copy, download and print the material contained on the site for your personal and non-commercial use, provided you do not modify or delete any copyright, trademark or other proprietary notice that appears on the material you access, copy, download or print. Any other use of content on the site, including but not limited to the modification, distribution, transmission, performance, broadcast, publication, uploading, licensing, reverse engineering, transfer or sale of, or the creation of derivative works from, any material, information, software, products or services obtained from the site, or use of the site for purposes competitive to WCT, is expressly prohibited. You agree to abide by all additional restrictions displayed on the site as it may be updated from time to time. WCT reserves the right to refuse or cancel any person's registration for this site, remove any person from this site or prohibit any person from using this site for any reason whatsoever. WCT, or its licensors or content providers, retain full and complete title to the material provided on the site, including all associated intellectual property rights, and provide this material to you under a license that is revocable at any time in WCT's sole discretion. WCT neither warrants nor represents that your use of materials on this site will not infringe rights of third parties not affiliated with WCT. You may not use contact information provided on the site for unauthorized purposes, including marketing. You may not use any hardware or software intended to damage or interfere with the proper working of the site or to surreptitiously intercept any system, data or personal information from the site. You agree not to interrupt or attempt to interrupt the operation of the site in any way. WCT reserves the right, in its sole discretion, to limit or terminate your access to or use of the site at any time without notice. Termination of your access or use will not waive or affect any other right or relief to which WCT may be entitled at law or in equity. Materials You Submit You acknowledge that you are responsible for any material you may submit via the site, including the legality, reliability, appropriateness, originality and copyright of any such material. You may not upload to, distribute or otherwise publish through this site any content that (i) is confidential, proprietary, false, fraudulent, libelous, defamatory, obscene, threatening, invasive of privacy or publicity rights, infringing on intellectual property rights, abusive, illegal or otherwise objectionable; (ii) may constitute or encourage a criminal offense, violate the rights of any party or otherwise give rise to liability or violate any law; or (iii) may contain software viruses, political campaigning, chain letters, mass mailings, or any form of \"spam.†You may not use a false email address or other identifying information, impersonate any person or entity or otherwise mislead as to the origin of any content. You may not upload commercial content onto the site. If you do submit material, and unless we indicate otherwise, you grant WCT and its affiliates an unrestricted, nonexclusive, royalty-free, perpetual, irrevocable and fully sublicensable right to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute and display such material throughout the world in any media. You further agree that WCT is free to use any ideas, concepts, know-how that you or individuals acting on your behalf provide to WCT. You grant WCT and its affiliates the right to use the name you submit in connection with such material, if they so choose. All personal information provided via this site will be handled in accordance with the site's online . You represent and warrant that you own or otherwise control all the rights to the content you post; that the content is accurate; that use of the content you supply does not violate any provision herein and will not cause injury to any person or entity; and that you will indemnify WCT for all claims resulting from content you supply. Conduct on the Site Some features that may be available on this site require registration. By registering at and in consideration of your use of the site you agree to provide true, accurate, current and complete information about yourself. Some features on this site require use of a password. You are responsible for protecting your password. You agree that you will be responsible for any and all statements made, and acts or omissions that occur, through the use of your password. If you have any reason to believe or become aware of any loss, theft or unauthorized use of your password, notify WCT immediately. WCT may assume that any communications WCT receives under your password have been made by you unless WCT receives notice otherwise. You or third parties acting on your behalf are not allowed to frame this site or use our proprietary marks as meta tags, without our written consent. These marks include, but are not limited to, World Compliance Technologies, WCT, WCT Services, Inc., WCT International and. You may not use frames or utilize framing techniques or technology to enclose any content included on the site without WCT's express written consent. Further, you may not utilize any site content in any meta tags or any other \"hidden text†techniques or technologies without WCT's express written consent. Links This site may contain links to other Web sites, some of which are operated by WCT or its affiliates and others of which are operated by third parties. These links are provided as a convenience to you and as an additional avenue of access to the information contained therein. We have not necessarily reviewed all the information on those other sites and are not responsible for the content of those or any other sites or any products or services that may be offered through those or any other sites. Inclusion of links to other sites should not be viewed as an endorsement of the content of linked sites. Different may apply to your use of any linked sites. WCT is not responsible for any losses, damages or other liabilities incurred as a result of your use of any linked sites. Trademarks and Copyrights Trademarks, logos and service marks displayed on this site are registered and unregistered trademarks of World Compliance Technologies, WCT Services, Inc. and WCT International, its licensors or content providers, or other third parties. All of these trademarks, logos and service marks are the property of their respective owners. Nothing on this site shall be construed as granting, by implication, estoppel, or otherwise, any license or right to use any trademark, logo or service mark displayed on the site without the owner's prior written permission, except as otherwise described herein. WCT reserves all rights not expressly granted in and to the site and its content. This site and all of its content, including but not limited to text, design, graphics, interfaces and code, and the selection and arrangement thereof, is protected as a compilation under the copyright laws of the United States and other countries. Infringement Notice We respect the intellectual property rights of others and request that you do the same. You are hereby informed that WCT has adopted and reasonably implemented a policy that provides for the termination in appropriate circumstances of subscribers and account holders of WCT's system or network who are repeat copyright infringers. If you believe your copyright or the copyright of a person on whose behalf you are authorized to act has been infringed, you may notify us with valid information and proof of such infringement to – Media.Relations@WCT-inc.com To be effective, your notification must (i) be in writing, (ii) be provided to our office, and (iii) include substantially the following: A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site; Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit the service provider to locate the material; Information reasonably sufficient to permit the service provider to contact the complaining party, such as an address, telephone number, and, if available, an electronic mail address at which the complaining party may be contacted; A statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and A statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. WCT is under no obligation to post, forward, transmit, distribute or otherwise provide any material available on this site, including material you provide to us, and so we have an absolute right to remove any material from the site in our sole discretion at any time. DISCLAIMERS YOUR USE OF THIS SITE IS AT YOUR SOLE RISK. THE SITE IS PROVIDED ON AN \"AS IS†AND \"AS AVAILABLE†BASIS. WE RESERVE THE RIGHT TO RESTRICT OR TERMINATE YOUR ACCESS TO THE SITE OR ANY FEATURE OR PART THEREOF AT ANY TIME. WCT EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND ANY WARRANTIES THAT MATERIALS ON THE SITE ARE NONINFRINGING, AS WELL AS WARRANTIES IMPLIED FROM A COURSE OF PERFORMANCE OR COURSE OF DEALING; THAT ACCESS TO THE SITE WILL BE UNINTERRUPTED OR ERROR-FREE; THAT THE SITE WILL BE SECURE; THAT THE SITE OR THE SERVER THAT MAKES THE SITE AVAILABLE WILL BE VIRUS-FREE; OR THAT INFORMATION ON THE SITE WILL BE COMPLETE, ACCURATE OR TIMELY. IF YOU DOWNLOAD ANY MATERIALS FROM THIS SITE, YOU DO SO AT YOUR OWN DISCRETION AND RISK. YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OF ANY SUCH MATERIALS. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM GE OR THROUGH OR FROM THE SITE SHALL CREATE ANY WARRANTY OF ANY KIND. GE DOES NOT MAKE ANY WARRANTIES OR REPRESENTATIONS REGARDING THE USE OF THE MATERIALS ON THIS SITE IN OF THEIR COMPLETENESS, CORRECTNESS, ACCURACY, ADEQUACY, USEFULNESS, TIMELINESS, RELIABILITY OR OTHERWISE. IN CERTAIN JURISDICTIONS, THE LAW MAY NOT PERMIT THE DISCLAIMER OF WARRANTIES, SO THE ABOVE DISCLAIMER MAY NOT APPLY TO YOU. LIMITATION OF LIABILITY YOU ACKNOWLEDGE AND AGREE THAT YOU ASSUME FULL RESPONSIBILITY FOR YOUR USE OF THE SITE. YOU ACKNOWLEDGE AND AGREE THAT ANY INFORMATION YOU SEND OR RECEIVE DURING YOUR USE OF THE SITE MAY NOT BE SECURE AND MAY BE INTERCEPTED BY UNAUTHORIZED PARTIES. YOU ACKNOWLEDGE AND AGREE THAT YOUR USE OF THE SITE IS AT YOUR OWN RISK AND THAT THE SITE IS MADE AVAILABLE TO YOU AT NO CHARGE. RECOGNIZING SUCH, YOU ACKNOWLEDGE AND AGREE THAT, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER GE NOR ITS AFFILIATES, SUPPLIERS OR THIRD PARTY CONTENT PROVIDERS WILL BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, EXEMPLARY, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR OTHER DAMAGES ARISING OUT OF OR IN ANY WAY RELATED TO THE SITE, OR ANY OTHER SITE YOU ACCESS THROUGH A LINK FROM THIS SITE OR FROM ANY ACTIONS WE TAKE OR FAIL TO TAKE AS A RESULT OF COMMUNICATIONS YOU SEND TO US, OR THE DELAY OR INABILITY TO USE THE SITE, OR FOR ANY INFORMATION, PRODUCTS OR SERVICES ADVERTISED IN OR OBTAINED THROUGH THE SITE, WCT'S REMOVAL OR DELETION OF ANY MATERIALS SUBMITTED OR POSTED ON ITS SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE SITE, WHETHER BASED ON CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE, EVEN IF WCT, ITS AFFILIATES OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. THIS DISCLAIMER APPLIES, WITHOUT LIMITATION, TO ANY DAMAGES OR INJURY ARISING FROM ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECTS, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUSES, FILE CORRUPTION, COMMUNICATION-LINE FAILURE, NETWORK OR SYSTEM OUTAGE, YOUR LOSS OF PROFITS, OR THEFT, DESTRUCTION, UNAUTHORIZED ACCESS TO, ALTERATION OF, LOSS OR USE OF ANY RECORD OR DATA, AND ANY OTHER TANGIBLE OR INTANGIBLE LOSS. YOU SPECIFICALLY ACKNOWLEDGE AND AGREE THAT NEITHER GE NOR ITS SUPPLIERS SHALL BE LIABLE FOR ANY DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF ANY USER OF THE SITE. YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY OF THE ABOVE CLAIMS OR ANY DISPUTE WITH WCT IS TO DISCONTINUE YOUR USE OF THE SITE. YOU AND WCT AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SITE MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES OR THE CAUSE OF ACTION IS PERMANENTLY BARRED. BECAUSE SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, OR THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, ALL OR A PORTION OF THE ABOVE LIMITATION MAY NOT APPLY TO YOU. Indemnification You agree to indemnify, defend and hold harmless WCT and its affiliates and their officers, directors, employees, contractors, agents, licensors, service providers, subcontractors and suppliers from and against any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from your use of the site and any violation of these of Use. If you cause a technical disruption of the site or the systems transmitting the site to you or others, you agree to be responsible for any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from that disruption. WCT reserves the right, at its own expense, to assume exclusive defense and control of any matter otherwise subject to indemnification by you and, in such case, you agree to cooperate with WCT in the defense of such matter. Jurisdiction and Applicable Law The laws of the State of Maryland govern these of Use and your use of the site, and you irrevocably consent to the jurisdiction of the courts located in the State of Maryland for any action arising out of or relating to these of Use. We recognize that it is possible for you to obtain access to this site from any jurisdiction in the world, but we have no practical ability to prevent such access. This site has been designed to comply with the laws of the State Maryland and of the United States. If any material on this site, or your use of the site, is contrary to the laws of the place where you are when you access it, the site is not intended for you, and we ask you not to use the site. You are responsible for informing yourself of the laws of your jurisdiction and complying with them. Changes to These of Use WCT reserves the right, at its sole discretion, to change, modify, add or remove any portion of these of Use, in whole or in part, at any time, by posting revised on the site. It is your responsibility to check periodically for any changes we make to the of Use. Your continued use of the site after any changes to the of Use or other policies means you accept the changes. In the event we make material changes to the of Use, notice of the changes will be posted on the homepage of this Web site and the revised will take effect thirty days after their publication on the site. Entire Agreement and Admissibility This agreement and any policies or operating rules posted on this site constitute the entire agreement and understanding between you and WCT with respect to the subject matter thereof and supersede all prior or contemporaneous communications and proposals, whether oral or written, between the parties with respect to such subject matter. A printed version of these of Use shall be admissible in judicial or administrative proceedings based on or relating to use of the site to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. Severability If any provision of this agreement is unlawful, void or unenforceable, the remaining provisions of the agreement will remain in place. How to Contact Us? If you have any questions or comments about these of Use or this site, please contact us by emailing us at: trademark.query@wct-inc.com Thank you for visiting our site. WCT-inc.com of Use This Web site is operated by WCT Services, Inc (\"WCTâ€). Throughout the site, the \"we,†\"us†and \"our†refer to WCT. WCT offers this Web site, including all information, tools and services available from this site, to you, the user, conditioned upon your acceptance of all the , conditions, policies and notices stated here. Your use of this site constitutes your agreement to these of Use. Accuracy, Completeness and Timeliness of Information on This Site WCT is not responsible if information made available on this site is not accurate, complete or current. The material on this site is provided for general information only and should not be relied upon or used as the sole basis for making decisions without consulting primary, more accurate, more complete or more timely sources of information. Any reliance on the material on this site is at your own risk. This site may contain certain historical information. Historical information necessarily is not current and is provided for your reference only. We reserve the right to modify the contents of this site at any time, but we have no obligation to update any information on the site. You agree that it is your responsibility to monitor changes to the site. Use of Materials on the Site All content on this site (including, without limitation, text, design, graphics, logos, icons, images, audio clips, downloads, interfaces, code and software, as well as the selection and arrangement thereof), is the exclusive property of and owned by WCT, its licensors or its content providers and is protected by copyright, trademark and other applicable laws. You may access, copy, download and print the material contained on the site for your personal and non-commercial use, provided you do not modify or delete any copyright, trademark or other proprietary notice that appears on the material you access, copy, download or print. Any other use of content on the site, including but not limited to the modification, distribution, transmission, performance, broadcast, publication, uploading, licensing, reverse engineering, transfer or sale of, or the creation of derivative works from, any material, information, software, products or services obtained from the site, or use of the site for purposes competitive to WCT, is expressly prohibited. You agree to abide by all additional restrictions displayed on the site as it may be updated from time to time. WCT reserves the right to refuse or cancel any person's registration for this site, remove any person from this site or prohibit any person from using this site for any reason whatsoever. WCT, or its licensors or content providers, retain full and complete title to the material provided on the site, including all associated intellectual property rights, and provide this material to you under a license that is revocable at any time in WCT's sole discretion. WCT neither warrants nor represents that your use of materials on this site will not infringe rights of third parties not affiliated with WCT. You may not use contact information provided on the site for unauthorized purposes, including marketing. You may not use any hardware or software intended to damage or interfere with the proper working of the site or to surreptitiously intercept any system, data or personal information from the site. You agree not to interrupt or attempt to interrupt the operation of the site in any way. WCT reserves the right, in its sole discretion, to limit or terminate your access to or use of the site at any time without notice. Termination of your access or use will not waive or affect any other right or relief to which WCT may be entitled at law or in equity. You acknowledge that you are responsible for any material you may submit via the site, including the legality, reliability, appropriateness, originality and copyright of any such material. You may not upload to, distribute or otherwise publish through this site any content that (i) is confidential, proprietary, false, fraudulent, libelous, defamatory, obscene, threatening, invasive of privacy or publicity rights, infringing on intellectual property rights, abusive, illegal or otherwise objectionable; (ii) may constitute or encourage a criminal offense, violate the rights of any party or otherwise give rise to liability or violate any law; or (iii) may contain software viruses, political campaigning, chain letters, mass mailings, or any form of \"spam.†You may not use a false email address or other identifying information, impersonate any person or entity or otherwise mislead as to the origin of any content. You may not upload commercial content onto the site. If you do submit material, and unless we indicate otherwise, you grant WCT and its affiliates an unrestricted, nonexclusive, royalty-free, perpetual, irrevocable and fully sublicensable right to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute and display such material throughout the world in any media. You further agree that WCT is free to use any ideas, concepts, know-how that you or individuals acting on your behalf provide to WCT. You grant WCT and its affiliates the right to use the name you submit in connection with such material, if they so choose. All personal information provided via this site will be handled in accordance with the site's online . You represent and warrant that you own or otherwise control all the rights to the content you post; that the content is accurate; that use of the content you supply does not violate any provision herein and will not cause injury to any person or entity; and that you will indemnify WCT for all claims resulting from content you supply. Conduct on the Site Some features that may be available on this site require registration. By registering at and in consideration of your use of the site you agree to provide true, accurate, current and complete information about yourself. Some features on this site require use of a password. You are responsible for protecting your password. You agree that you will be responsible for any and all statements made, and acts or omissions that occur, through the use of your password. If you have any reason to believe or become aware of any loss, theft or unauthorized use of your password, notify WCT immediately. WCT may assume that any communications WCT receives under your password have been made by you unless WCT receives notice otherwise. You or third parties acting on your behalf are not allowed to frame this site or use our proprietary marks as meta tags, without our written consent. These marks include, but are not limited to, World Compliance Technologies, WCT, WCT Services, Inc., WCT International and. You may not use frames or utilize framing techniques or technology to enclose any content included on the site without WCT's express written consent. Further, you may not utilize any site content in any meta tags or any other \"hidden text†techniques or technologies without WCT's express written consent. This site may contain links to other Web sites, some of which are operated by WCT or its affiliates and others of which are operated by third parties. These links are provided as a convenience to you and as an additional avenue of access to the information contained therein. We have not necessarily reviewed all the information on those other sites and are not responsible for the content of those or any other sites or any products or services that may be offered through those or any other sites. Inclusion of links to other sites should not be viewed as an endorsement of the content of linked sites. Different may apply to your use of any linked sites. WCT is not responsible for any losses, damages or other liabilities incurred as a result of your use of any linked sites. Trademarks, logos and service marks displayed on this site are registered and unregistered trademarks of World Compliance Technologies, WCT Services, Inc. and WCT International, its licensors or content providers, or other third parties. All of these trademarks, logos and service marks are the property of their respective owners. Nothing on this site shall be construed as granting, by implication, estoppel, or otherwise, any license or right to use any trademark, logo or service mark displayed on the site without the owner's prior written permission, except as otherwise described herein. WCT reserves all rights not expressly granted in and to the site and its content. This site and all of its content, including but not limited to text, design, graphics, interfaces and code, and the selection and arrangement thereof, is protected as a compilation under the copyright laws of the United States and other countries. We respect the intellectual property rights of others and request that you do the same. You are hereby informed that WCT has adopted and reasonably implemented a policy that provides for the termination in appropriate circumstances of subscribers and account holders of WCT's system or network who are repeat copyright infringers. If you believe your copyright or the copyright of a person on whose behalf you are authorized to act has been infringed, you may notify us with valid information and proof of such infringement to – Media.Relations@WCT-inc.com To be effective, your notification must (i) be in writing, (ii) be provided to our office, and (iii) include substantially the following: A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site; Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit the service provider to locate the material; Information reasonably sufficient to permit the service provider to contact the complaining party, such as an address, telephone number, and, if available, an electronic mail address at which the complaining party may be contacted; A statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and A statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. WCT is under no obligation to post, forward, transmit, distribute or otherwise provide any material available on this site, including material you provide to us, and so we have an absolute right to remove any material from the site in our sole discretion at any time. YOUR USE OF THIS SITE IS AT YOUR SOLE RISK. THE SITE IS PROVIDED ON AN \"AS IS†AND \"AS AVAILABLE†BASIS. WE RESERVE THE RIGHT TO RESTRICT OR TERMINATE YOUR ACCESS TO THE SITE OR ANY FEATURE OR PART THEREOF AT ANY TIME. WCT EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND ANY WARRANTIES THAT MATERIALS ON THE SITE ARE NONINFRINGING, AS WELL AS WARRANTIES IMPLIED FROM A COURSE OF PERFORMANCE OR COURSE OF DEALING; THAT ACCESS TO THE SITE WILL BE UNINTERRUPTED OR ERROR-FREE; THAT THE SITE WILL BE SECURE; THAT THE SITE OR THE SERVER THAT MAKES THE SITE AVAILABLE WILL BE VIRUS-FREE; OR THAT INFORMATION ON THE SITE WILL BE COMPLETE, ACCURATE OR TIMELY. IF YOU DOWNLOAD ANY MATERIALS FROM THIS SITE, YOU DO SO AT YOUR OWN DISCRETION AND RISK. YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OF ANY SUCH MATERIALS. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM GE OR THROUGH OR FROM THE SITE SHALL CREATE ANY WARRANTY OF ANY KIND. GE DOES NOT MAKE ANY WARRANTIES OR REPRESENTATIONS REGARDING THE USE OF THE MATERIALS ON THIS SITE IN OF THEIR COMPLETENESS, CORRECTNESS, ACCURACY, ADEQUACY, USEFULNESS, TIMELINESS, RELIABILITY OR OTHERWISE. IN CERTAIN JURISDICTIONS, THE LAW MAY NOT PERMIT THE DISCLAIMER OF WARRANTIES, SO THE ABOVE DISCLAIMER MAY NOT APPLY TO YOU. YOU ACKNOWLEDGE AND AGREE THAT YOU ASSUME FULL RESPONSIBILITY FOR YOUR USE OF THE SITE. YOU ACKNOWLEDGE AND AGREE THAT ANY INFORMATION YOU SEND OR RECEIVE DURING YOUR USE OF THE SITE MAY NOT BE SECURE AND MAY BE INTERCEPTED BY UNAUTHORIZED PARTIES. YOU ACKNOWLEDGE AND AGREE THAT YOUR USE OF THE SITE IS AT YOUR OWN RISK AND THAT THE SITE IS MADE AVAILABLE TO YOU AT NO CHARGE. RECOGNIZING SUCH, YOU ACKNOWLEDGE AND AGREE THAT, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER GE NOR ITS AFFILIATES, SUPPLIERS OR THIRD PARTY CONTENT PROVIDERS WILL BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, EXEMPLARY, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR OTHER DAMAGES ARISING OUT OF OR IN ANY WAY RELATED TO THE SITE, OR ANY OTHER SITE YOU ACCESS THROUGH A LINK FROM THIS SITE OR FROM ANY ACTIONS WE TAKE OR FAIL TO TAKE AS A RESULT OF COMMUNICATIONS YOU SEND TO US, OR THE DELAY OR INABILITY TO USE THE SITE, OR FOR ANY INFORMATION, PRODUCTS OR SERVICES ADVERTISED IN OR OBTAINED THROUGH THE SITE, WCT'S REMOVAL OR DELETION OF ANY MATERIALS SUBMITTED OR POSTED ON ITS SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE SITE, WHETHER BASED ON CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE, EVEN IF WCT, ITS AFFILIATES OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. THIS DISCLAIMER APPLIES, WITHOUT LIMITATION, TO ANY DAMAGES OR INJURY ARISING FROM ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECTS, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUSES, FILE CORRUPTION, COMMUNICATION-LINE FAILURE, NETWORK OR SYSTEM OUTAGE, YOUR LOSS OF PROFITS, OR THEFT, DESTRUCTION, UNAUTHORIZED ACCESS TO, ALTERATION OF, LOSS OR USE OF ANY RECORD OR DATA, AND ANY OTHER TANGIBLE OR INTANGIBLE LOSS. YOU SPECIFICALLY ACKNOWLEDGE AND AGREE THAT NEITHER GE NOR ITS SUPPLIERS SHALL BE LIABLE FOR ANY DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF ANY USER OF THE SITE. YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY OF THE ABOVE CLAIMS OR ANY DISPUTE WITH WCT IS TO DISCONTINUE YOUR USE OF THE SITE. YOU AND WCT AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SITE MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES OR THE CAUSE OF ACTION IS PERMANENTLY BARRED. BECAUSE SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, OR THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, ALL OR A PORTION OF THE ABOVE LIMITATION MAY NOT APPLY TO YOU. You agree to indemnify, defend and hold harmless WCT and its affiliates and their officers, directors, employees, contractors, agents, licensors, service providers, subcontractors and suppliers from and against any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from your use of the site and any violation of these of Use. If you cause a technical disruption of the site or the systems transmitting the site to you or others, you agree to be responsible for any and all losses, liabilities, expenses, damages and costs, including reasonable attorneys' fees and court costs, arising or resulting from that disruption. WCT reserves the right, at its own expense, to assume exclusive defense and control of any matter otherwise subject to indemnification by you and, in such case, you agree to cooperate with WCT in the defense of such matter. Jurisdiction and Applicable Law The laws of the State of Maryland govern these of Use and your use of the site, and you irrevocably consent to the jurisdiction of the courts located in the State of Maryland for any action arising out of or relating to these of Use. We recognize that it is possible for you to obtain access to this site from any jurisdiction in the world, but we have no practical ability to prevent such access. This site has been designed to comply with the laws of the State Maryland and of the United States. If any material on this site, or your use of the site, is contrary to the laws of the place where you are when you access it, the site is not intended for you, and we ask you not to use the site. You are responsible for informing yourself of the laws of your jurisdiction and complying with them. Changes to These of Use WCT reserves the right, at its sole discretion, to change, modify, add or remove any portion of these of Use, in whole or in part, at any time, by posting revised on the site. It is your responsibility to check periodically for any changes we make to the of Use. Your continued use of the site after any changes to the of Use or other policies means you accept the changes. In the event we make material changes to the of Use, notice of the changes will be posted on the homepage of this Web site and the revised will take effect thirty days after their publication on the site. Entire Agreement and Admissibility This agreement and any policies or operating rules posted on this site constitute the entire agreement and understanding between you and WCT with respect to the subject matter thereof and supersede all prior or contemporaneous communications and proposals, whether oral or written, between the parties with respect to such subject matter. A printed version of these of Use shall be admissible in judicial or administrative proceedings based on or relating to use of the site to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. If any provision of this agreement is unlawful, void or unenforceable, the remaining provisions of the agreement will remain in place. How to Contact Us? If you have any questions or comments about these of Use or this site, please contact us by emailing us at: trademark.query@wct-inc.com Thank you for visiting our site."
  ]
}