{
  "company": "wct-inc.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 41,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.931297709923664,
    "framing_surveillance": 0.0229007633587786,
    "framing_market": 0.0458015267175572,
    "num_docs": 43
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 41
    }
  },
  "sample_docs": [
    "We respect the privacy of every individual who visits our website Information about you When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. Children's Privacy This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information Sharing & Transfers We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). Transmission We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. Mobile Information sharing WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information. We respect the privacy of every individual who visits our website Information about you When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. Children's Privacy This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information Sharing & Transfers We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). Transmission We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. Mobile Information sharing WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information. We respect the privacy of every individual who visits our website When you visit certain areas of our website we may ask you for information about yourself. We may need to know your name, address, and email address to provide you with information or to reply to your queries. We will not collect any personal information about you without your consent. Our use of this information Other than as required by law, or as set out in this privacy statement, we will not disclose information about you to any third party without your permission. Collection of personal information We collect no personally identifiable information about you when you visit our site unless you choose to provide that information to us. You may choose to provide personal information (for example your name, address, telephone number and email address) on this or other WCT websites, however not providing this may result in reduced functionality. WCT's usage of this information will be consistent with this Policy or the policy associated with the applicable WCT site. WCT does collect personal identifiable information with your consent, except those required by its website and data delivery systems to provision you information as you have requested or queried upon. This website is not directed to children under the age of thirteen and we do not knowingly collect personal information from children under the age of thirteen on this site or other WCT sites. If we become aware that we have inadvertently received personal information from a visitor under the age of thirteen, we will delete the information from our records. Use of Cookies and Similar Technologies Like most websites and companies we use cookies on our websites. We collect certain aggregate and non-personal information through a variety of technologies when you visit this website. Aggregate and non-personal information does not relate to a single identifiable visitor. It tells us such things as how many users visited our site and the pages accessed. By collecting this information, we learn how to best tailor our website to our visitors. Unless you disable such technologies, by using our website and online services, you agree that we can place these types of cookies and related technologies on your device. We explain below how you can manage your choices and opt-out of the collection of such aggregate information. Essential Cookies: Some cookies serve an essential function and the websites cannot work properly without them. Where such essential cookies are used, they cannot be disabled. Browser and Flash Cookies: Other cookies serve a functional purpose and improve the user experience of the websites. We use browser and Flash cookies to tell us, for example, whether you've visited us before, and to help us identify site features in which you may have the greatest interest. Browser and Flash cookies may enhance your online experience by saving your preferences while you are visiting a particular site so that you do not need to reset them each time you visit the website. Neither Browser nor Flash cookies can identify you as an individual. You can decline any Browser cookie through your browser however, without Browser cookies you may not be able to take full advantage of all our website features. Similar to Browser cookies, you may not be able to take full advantage of all website features once you have disabled Flash cookies. Web Beacons: Some types of cookies collect aggregate information which help us to improve our websites by providing information, for example, on loading errors and the most visited webpages. Certain pages on our site may contain web beacons (also known as Internet tags, pixel tags and clear GIFs). WCT uses web beacons to help display content to visitors and to generate statistics regarding web traffic and trends. Web beacons cannot identify you as an individual. Use of Personal Information We do not encourage or collect specific personal information; any information so collected in the course of operations may be used for the following purposes: Provide, administer and communicate with you about products, services, events, surveys and promotions by WCT or our affiliates (including by sending you marketing communications); Process, evaluate and respond to your requests, inquiries and applications; Create, administer and communicate with you about your account (including any purchases and payments); Provide investor services; Verify your identity to ensure security for the other purposes listed here; Evaluate your interest in employment and contact you regarding possible employment; Operate, evaluate and improve our business (including developing new products and services; managing our communications; performing market research; determining and managing the effectiveness of our advertising and marketing; analyzing our products, services and websites; administering our websites; and performing accounting, auditing, billing, reconciliation and collection activities); Protect against and prevent fraud, unauthorized transactions, claims and other liabilities, and manage risk exposure and quality; Conduct investigations and comply and enforce applicable legal requirements or, industry standards and our policies and , such as this and other WCT sites' of use; and Ensure the safety of WCT network services, information resources and employees. We also may use personal information for other additional purposes. We will identify these additional purposes at the time of collection. Sharing and Transferring of Your Personal Information We do not sell or otherwise disclose personal information about our website visitors outside WCT and its affiliates, except as described here. We may share information provided by our visitors to this and other WCT sites with service providers we have retained to perform services on our behalf. These service providers are contractually restricted from using or disclosing the information except as necessary to perform services on our behalf or to comply with legal requirements. We may disclose information about you (i) if we are required to do so by law or legal process, (ii) to law enforcement authorities or other government officials as required to comply with a legitimate legal request, or (iii) when we believe disclosure is necessary to prevent physical harm or financial loss, or in connection with an investigation of suspected or actual illegal activity. • We reserve the right to transfer any information we have about you in the event we sell or transfer all or a portion of our business or assets (including through bankruptcy). We may transmit the personal information we collect on this site or other WCT sites to other countries where we do business, including for websites accessed in the European Union, to the US, but we will do so only for the purposes described herein. How We Protect Your Information? At WCT, our goal is to protect your personal information submitted to us through our sites. We maintain administrative, technical and physical safeguards to protect against unauthorized disclosure, use, alteration or destruction of the personal information you provide on this and other WCT websites. We also employ reasonable technologies to help keep the personal information you provide on this site secure. You may choose to opt out- or specifically request deletion of your data held with WCT, specifically identifying what elements you would like deleted, and WCT shall take necessary action as its practicable to do so. Based on the nature or the request, and in order to prevent misuse- WCT may choose to request a verification/ identification of the request and any related undertakings as required by its operating policy. Changes to This This may be updated periodically and without prior notice to you to reflect changes in our online information practices. When changes are made to this Policy it will be posted to the website and the \"last updated†date at the top of this policy will be revised. We also encourage users to periodically check this Policy to understand how WCT protects and uses your information. Links to Other Sites We provide links to other websites for your convenience and information. These sites may have their own privacy statements or policies in place, which we recommend you review if you visit any linked websites. We are not responsible for the content of linked sites or any use of the sites. How to Contact Us and Update Your Personal Information If you have any questions or comments about this , please contact us by emailing- customer.care@wct-inc.com Mobile Information We Collect Personally identifiable information (e.g. Name, email address) we collect consists only of what you share with us. For example, certain products may ask for this type of information so that we may contact you by phone or email at your request. You choose what, how, and when you want to share. If you use any location-enabled products, you may be sending us location information. WCT does not store or use this information other than to provide the service you requested. For example, a mobile product may use GPS data to find a nearby restaurant you requested. Location-enabled features are opt-in and you have control over your participation and can turn these services off at any time. Web-enabled mobile applications may use cookies or web beacons and other methods to customize your browsing experience. Please see WCT's web for more information. Some mobile applications will utilize Google Analytics (or similar tool) to help us better serve our customers through improved products, services, and revisions to the mobile applications. This collected information will not identify you to WCT. It may, however, let us know anonymously, which services and features you are using the most within the application, as well as device type and hardware features, country and language of download. Use of 3rd party services such as social sharing sites (e.g., Facebook & Twitter) is governed by the privacy practices of those services. WCT does not capture or store your login information or other personally identifiable information for these services; however session info or cookies may be stored. Mobile How We Use Collected Information We use the information to personalize your experience with the application and to improve your overall experience including the development of new products, services, and features. We also use the information to provide customer support, and when applicable, register and administer your account. Additionally, we may use the information you provide to contact you about updates to our service. Information you provide may be used to fulfill the service(s) or carry out the transaction(s) you have requested or authorized. For example, if you authorize a purchase through a mobile eCommerce application, we will use provided information to ship and bill you. WCT does not share any collected information with 3rd parties with the following exceptions: WCT may provide some personal data to third-party partners that are providing services essential to your mobile user experience. All requests are sent through your mobile carrier's network and your carrier may have access to it. Consult your carrier's privacy policies for additional information. Certain mobile products and services and manufacturers allow you to interact and share your information with others. For example, you may want to Tweet or post to your Facebook page content from an WCT mobile application. Consult your mobile device manufacturer, or mobile product or application developer's privacy policies for additional information.",
    "Email us Twitter Google+ Overview Harnessing technology and human potential Overview Harnessing technology and human potential Harnessing technology and human potential © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners. © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners.",
    "Email us Twitter Google+ Search Results for: {search_term_string} Search Results for: {search_term_string} Search Results for: {search_term_string} About World Compliance Technologies WCT's software suite automates people identification, process automation and enforcement of security and regulatory policies critical to the safe and successful operating of your business. Read More Product Range Identity & security management is fast becoming of the utmost importance across different sectors. With high levels of identity forgery occurring throughout the world, identifying individuals accurately can reduce losses incurred. Read More About World Compliance Technologies WCT's software suite automates people identification, process automation and enforcement of security and regulatory policies critical to the safe and successful operating of your business. Identity & security management is fast becoming of the utmost importance across different sectors. With high levels of identity forgery occurring throughout the world, identifying individuals accurately can reduce losses incurred. © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners. © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners.",
    "Email us Twitter Google+ About World Compliance Technologies WCT's software suite automates people identification, process automation and enforcement of security and regulatory policies critical to the safe and successful operating of your business. Read More Product Range Identity & security management is fast becoming of the utmost importance across different sectors. With high levels of identity forgery occurring throughout the world, identifying individuals accurately can reduce losses incurred. Read More About World Compliance Technologies WCT's software suite automates people identification, process automation and enforcement of security and regulatory policies critical to the safe and successful operating of your business. Identity & security management is fast becoming of the utmost importance across different sectors. With high levels of identity forgery occurring throughout the world, identifying individuals accurately can reduce losses incurred. © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners. © World Compliance Technologies, 2018 | . | | | Sitemap Disclaimer: Images and contents of the site are for communication purposes. Any copyrights and proprietary information belongs to the respective owners.",
    "North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface. North Springs Improvement District (NSID) offers Wastewater Collection, Water Treatment process, and Stormwater Management to approximately 40,000 residents of the City of Coral Springs and the Parkland City. Security Problems Faced by NSID: Due to increasing security threats and problems to its customer service employees, NSID currently took the help of police to secure its water treatment facility's entrance during the working hours of its operations. To get a practical solution and enhance the security measures to its water treatment plant and the building, as well as monitor its employees while working on the site continually, NSID approached WCT to propose a feasible solution. NSID wanted future-ready technology with state of the art design to enhance the security of external and internal entrance doors of the main building without any magnetic door lock system. The two external doors are using a keypad for secure access control as of now. NSID management provided just one code to access for all users. Proposed Solution by WCT: WCT, a leading IT managed service provider, took this project as a challenge and suggested a robust Facial Biometric Access Control at the external and internal entry doors along with Time and Attendance as discussed with NSID. Feature-rich time and attendance applications featuring biometric technologies and fingerprint verification sensors are integrated into the entry door, optimizing time and attendance management software to track control over a range of access points and duty roster arrangements. This generates an audit log of every access attempt made. WCT proposed a solution for internal doors which doesn't have a magnetic door lock protection is by installing a magnetic door lock, Exit switch, and wiring to secure access. Biometric authentication tools use physical features like face, fingerprint, or voice recognition, to enhance the security and effectiveness of verification processes to restrict & control access to a granular level. Facial recognition, an incredibly powerful tool, helps to create an advantageous touch-free experience by using face recognition in access control and time monitoring. The usage of matured facial recognition algorithm security at the doorway offers improved protections and efficiencies for access management and time tracking, making tools simpler than ever to incorporate! As the technology grows, facial recognition technology can be linked to a temperature sensor for contactless temperature measurement to detect possible threats while calculating the body temperature of the subject while simultaneously recognizing the face and name. About SafeHand Solution for NSID – How it Works SafeHand is a leading-edge Security & Identity Management solution for advanced enterprise applications. It is now an easy task to assign entry privileges, door control, and entry and exit management. SafeHand uses its biometric characteristics and features to provide control access and a time and attendance system. The biometric capabilities include face recognition and finger vein detection, RFID technology. SafeHand is specifically a database that may contain a person's biographic and biometric details. The solution can be used either on-site or through the cloud, which is an appropriate option for multiple locations with mainly Facial Recognition. The solution comes with a tightly integrated visitor management system. In the Enrolment Process, the employee gets enrolled with SafeHand solution and registers the image of an employees' face into the SafeHand solution database for Access Control. Data may be uploaded in bulk, too. In the Time & Attendance process, SafeHand will handle and track the access control of NSID's employees. This software is built into the SafeHand system for data collection and provides management reports. The Cloud-based system, SafeHand, ensures features and functionality to get accessed from a web-based interface."
  ]
}