{
  "company": "www.hidohealth.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Effective Date of this : May 25, 2019 This is for users of the website only. If you are an enrolled HiDO user, you can review our product related with the materials you received during the enrollment process. Your privacy is important to us. HiDO Technologies Inc. (d/b/a HiDO) (referred to herein as \"HiDO,\" \"we,\" \"us,\" \"our\") appreciates your interest in our website, www.myhido.com (the \"Site\"). Our Site is designed to provide access to online information about HiDO and our inhaler sensor system. In connection with providing this information and service, there are times when we may ask for or collect information from you, either in the form of anonymous data or personally identifiable information. As part of our commitment to honoring your privacy, this explains the approach we take in protecting and using the information that we gather from you on our Site. By using the Site, you consent to this . If you choose to visit our Site, your visit and any disputes over privacy are subject to this . We reserve the right to change this at any time without notice except as otherwise provided here. Please check back periodically to see if our has been updated. If we make material changes to this , we will notify you by updating this , posting notice of the change on our home page and/or sending you email notification. Your continued use of the Site constitutes your agreement to the of this and any future versions of this . Who is In Charge: HiDO, with an email address of Charles is considered the \"data controller\" with regard to the processing of personal data in the context of the Services. HiDO has appointed a representative in the EU: [Hogan Lovells LLP (Paris), which may be contacted at the following address: 17, avenue Matignon; CS 30027; 75378 Paris cedex 08, France. Types of Information We Collect User Provided Information: When you choose to submit personally identifiable information to our Site (including name, telephone number, mailing address and email address), your information is used only for the specific purpose for which it was submitted, unless you consent otherwise or as required by law. In many cases, you choose the amount of information you supply. There may be instances where some of the information that we ask you to provide is identified as mandatory and some as voluntary. In such cases, if you do not provide mandatory personal information with respect to a particular activity, you will not be able to engage in that activity. We may collect personally identifiable information when you: Inquire about our products and services; Ask that we contact you; Subscribe to our mailing list; Register for a webinar; or Complete voluntary customer service surveys. We maintain the data that you provide us in a secure database. To best serve you, we may combine this information with data that is publicly available and data that we receive from other reputable sources. Log Files: Our servers automatically record certain information (e.g., web request, Internet Protocol (\"IP\") address, browser type, browser language, URLs, etc) that your web browser sends whenever you visit our Site. Log files will be maintained and/or deleted as per our Data Retention Policy. Use and Storage of Your Personal Information HiDO will use your information as described in this . Analytics: When someone visits the Site, our web servers automatically gather information that allows the Site to communicate with the user's computer during the visit. We also may use any of the following information: the number of visits to the Site, which parts of the Site users select, IP address (the Internet address assigned to your computer from your Internet Service Provider), domain type, browser type (e.g., Internet Explorer) and date and time of day. We use this information for statistical purposes that help us design and administer the Site. Those types of information do not disclose personally identifiable information that would permit us to identify or locate individual visitors. Research: We may conduct demographic or other research about our users to determine how users engage with our Site. Retention of User Provided Information: Your personal information is only stored within our servers for as long as necessary. Data that is no longer necessary is destroyed per the retention schedule in our Data Retention Policy. You have the right to request that your personal data be deleted at any time. To do so, contact Charles Security Measures: We will take reasonable measures which we believe are appropriate to protect your information from loss, misuse, alteration or destruction, and, where possible, will ask that any third parties to whom we may transfer your information take comparable steps to protect that security. Although we will use all reasonable efforts to safeguard the confidentiality of any visitor information collected, we shall have no liability for disclosure of any visitor information obtained due to errors in transmission or the unauthorized acts of third parties. Email is not a secure form of communication. Please do not send us any personal information via email. Please note, sending information over the Internet or over mobile networks is not completely secure. Although we will do our best to protect your personal information, we cannot guarantee the security of your data transmitted to and from the Site or over mobile networks; any transmission of information is at your own risk. Communications with HiDO Communications from HiDO: As a Site user, you will be asked if you want to receive marketing materials from HiDO and its Business Partners (defined below). If you opt-in we will send you marketing materials. From time to time, we may also send you offers for similar products and services from HiDO, special premiums, or special offers from our Business Partners. We do not share your personally identifiable information with any third parties in connection with these communications. You can decline these communications at any time by simply following the \"unsubscribe\" link at the bottom of each communication. Mandatory Communications: Even if you have opted out of email communications, we reserve the right to communicate with you from time to time about important administrative, policy, legal, and financial matters that affect your use of the Site. These communications are mandatory. Third Parties and HiDO Third-Party Information Sharing: We reserve the right to share your information with third-party companies we may use to perform other service functions for us. However, at all times, we will control and be responsible for the use of your information and will ensure that sufficient contractual mechanisms are in place to ensure that the information remains secure. We do not share equipment or databases with these companies. Additionally, any company we use for these reasons will not share, sell, or distribute your information, or otherwise use your information except to provide us services. Disclosure of Third Party information: You are entitled to request certain information shared with third parties for their direct marketing purposes. To do so, contact Charles Within 30 days of receiving such a request, we will provide a list of the categories of personal information disclosed to third parties for such third parties' direct marketing purposes during the immediately preceding calendar year, along with the names and addresses of these third parties. A request may be made no more than once per calendar year and we are not required to respond to requests made by means other than through the e-mail address above. Business Partners: We may provide information about how our users collectively use our Site to our customers, advertisers, sponsors, and other companies with which we do business (\"Business Partners\"). This data does not include any personally identifiable information about you. Sale of HiDO or its Assets: In the event that HiDO or our assets or stock are ever sold, acquired, merged, liquidated, reorganized, or otherwise transferred, we reserve the right to transfer our user databases together with any personally identifiable information contained in them, to a third-party acquiring our assets. In the event we do so, we will place a prominent notice of the sale on the homepage of our Site, with links to information about how you can change your privacy preferences. Additional Disclosures Children: The Site is not intended for children under the age of 13 (Note that my.propllerhealth.com may be used by children under 13). We do not knowingly collect personal information from anyone under the age of 13 from our site. Since information regarding children under the age of 13 is not collected, we do not knowingly distribute personal information regarding children under the age of 13 from our site. Disclosure Exceptions: We reserve the right to disclose your personal information to appropriate third parties if we are required to do so by law or we reasonably believe that such action is necessary: To comply with legal process such as a search warrant, subpoena or court order; To protect HiDOs' rights and property; To investigate reports of users sending material using a false e-mail address or users sending harassing, threatening, or abusive messages; To protect against misuse or unauthorized use of our Site, products, or services; or During emergencies, such as when we believe someone's physical safety is at risk. Other Websites: This only applies to the Site. Please be aware that our Site and email communications may contain links to other websites or webpages that are owned and operated by our customers or other third parties. The information practices of websites linked to our Site are not covered by this and, therefore, we are not responsible for the content or privacy policies of websites to which our Site links. We encourage you to review the privacy policies of the third-party websites to understand their privacy practices. Effective Date of this : May 25, 2019 This is for users of the website only. If you are an enrolled HiDO user, you can review our product related with the materials you received during the enrollment process. Your privacy is important to us. HiDO Technologies Inc. (d/b/a HiDO) (referred to herein as \"HiDO,\" \"we,\" \"us,\" \"our\") appreciates your interest in our website, www.myhido.com (the \"Site\"). Our Site is designed to provide access to online information about HiDO and our inhaler sensor system. In connection with providing this information and service, there are times when we may ask for or collect information from you, either in the form of anonymous data or personally identifiable information. As part of our commitment to honoring your privacy, this explains the approach we take in protecting and using the information that we gather from you on our Site. By using the Site, you consent to this . If you choose to visit our Site, your visit and any disputes over privacy are subject to this . We reserve the right to change this at any time without notice except as otherwise provided here. Please check back periodically to see if our has been updated. If we make material changes to this , we will notify you by updating this , posting notice of the change on our home page and/or sending you email notification. Your continued use of the Site constitutes your agreement to the of this and any future versions of this . HiDO, with an email address of Charles is considered the \"data controller\" with regard to the processing of personal data in the context of the Services. HiDO has appointed a representative in the EU: [Hogan Lovells LLP (Paris), which may be contacted at the following address: 17, avenue Matignon; CS 30027; 75378 Paris cedex 08, France. User Provided Information: When you choose to submit personally identifiable information to our Site (including name, telephone number, mailing address and email address), your information is used only for the specific purpose for which it was submitted, unless you consent otherwise or as required by law. In many cases, you choose the amount of information you supply. There may be instances where some of the information that we ask you to provide is identified as mandatory and some as voluntary. In such cases, if you do not provide mandatory personal information with respect to a particular activity, you will not be able to engage in that activity. We may collect personally identifiable information when you: Inquire about our products and services; Ask that we contact you; Subscribe to our mailing list; Register for a webinar; or Complete voluntary customer service surveys. We maintain the data that you provide us in a secure database. To best serve you, we may combine this information with data that is publicly available and data that we receive from other reputable sources. Log Files: Our servers automatically record certain information (e.g., web request, Internet Protocol (\"IP\") address, browser type, browser language, URLs, etc) that your web browser sends whenever you visit our Site. Log files will be maintained and/or deleted as per our Data Retention Policy. HiDO will use your information as described in this . Analytics: When someone visits the Site, our web servers automatically gather information that allows the Site to communicate with the user's computer during the visit. We also may use any of the following information: the number of visits to the Site, which parts of the Site users select, IP address (the Internet address assigned to your computer from your Internet Service Provider), domain type, browser type (e.g., Internet Explorer) and date and time of day. We use this information for statistical purposes that help us design and administer the Site. Those types of information do not disclose personally identifiable information that would permit us to identify or locate individual visitors. Research: We may conduct demographic or other research about our users to determine how users engage with our Site. Retention of User Provided Information: Your personal information is only stored within our servers for as long as necessary. Data that is no longer necessary is destroyed per the retention schedule in our Data Retention Policy. You have the right to request that your personal data be deleted at any time. To do so, contact Charles Security Measures: We will take reasonable measures which we believe are appropriate to protect your information from loss, misuse, alteration or destruction, and, where possible, will ask that any third parties to whom we may transfer your information take comparable steps to protect that security. Although we will use all reasonable efforts to safeguard the confidentiality of any visitor information collected, we shall have no liability for disclosure of any visitor information obtained due to errors in transmission or the unauthorized acts of third parties. Email is not a secure form of communication. Please do not send us any personal information via email. Please note, sending information over the Internet or over mobile networks is not completely secure. Although we will do our best to protect your personal information, we cannot guarantee the security of your data transmitted to and from the Site or over mobile networks; any transmission of information is at your own risk. Communications from HiDO: As a Site user, you will be asked if you want to receive marketing materials from HiDO and its Business Partners (defined below). If you opt-in we will send you marketing materials. From time to time, we may also send you offers for similar products and services from HiDO, special premiums, or special offers from our Business Partners. We do not share your personally identifiable information with any third parties in connection with these communications. You can decline these communications at any time by simply following the \"unsubscribe\" link at the bottom of each communication. Mandatory Communications: Even if you have opted out of email communications, we reserve the right to communicate with you from time to time about important administrative, policy, legal, and financial matters that affect your use of the Site. These communications are mandatory. Third-Party Information Sharing: We reserve the right to share your information with third-party companies we may use to perform other service functions for us. However, at all times, we will control and be responsible for the use of your information and will ensure that sufficient contractual mechanisms are in place to ensure that the information remains secure. We do not share equipment or databases with these companies. Additionally, any company we use for these reasons will not share, sell, or distribute your information, or otherwise use your information except to provide us services. Disclosure of Third Party information: You are entitled to request certain information shared with third parties for their direct marketing purposes. To do so, contact Charles Within 30 days of receiving such a request, we will provide a list of the categories of personal information disclosed to third parties for such third parties' direct marketing purposes during the immediately preceding calendar year, along with the names and addresses of these third parties. A request may be made no more than once per calendar year and we are not required to respond to requests made by means other than through the e-mail address above. Business Partners: We may provide information about how our users collectively use our Site to our customers, advertisers, sponsors, and other companies with which we do business (\"Business Partners\"). This data does not include any personally identifiable information about you. Sale of HiDO or its Assets: In the event that HiDO or our assets or stock are ever sold, acquired, merged, liquidated, reorganized, or otherwise transferred, we reserve the right to transfer our user databases together with any personally identifiable information contained in them, to a third-party acquiring our assets. In the event we do so, we will place a prominent notice of the sale on the homepage of our Site, with links to information about how you can change your privacy preferences. Children: The Site is not intended for children under the age of 13 (Note that my.propllerhealth.com may be used by children under 13). We do not knowingly collect personal information from anyone under the age of 13 from our site. Since information regarding children under the age of 13 is not collected, we do not knowingly distribute personal information regarding children under the age of 13 from our site. We reserve the right to disclose your personal information to appropriate third parties if we are required to do so by law or we reasonably believe that such action is necessary: To comply with legal process such as a search warrant, subpoena or court order; To protect HiDOs' rights and property; To investigate reports of users sending material using a false e-mail address or users sending harassing, threatening, or abusive messages; To protect against misuse or unauthorized use of our Site, products, or services; or During emergencies, such as when we believe someone's physical safety is at risk. Other Websites: This only applies to the Site. Please be aware that our Site and email communications may contain links to other websites or webpages that are owned and operated by our customers or other third parties. The information practices of websites linked to our Site are not covered by this and, therefore, we are not responsible for the content or privacy policies of websites to which our Site links. We encourage you to review the privacy policies of the third-party websites to understand their privacy practices."
  ]
}