{
  "company": "www.biometricsolution.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 40,
    "-1": 7
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 40
    }
  },
  "sample_docs": [
    "Food Service Solutions, Inc. FSS POS itive ID System III \"Simple, reliable and affordable\" How 'shrink-wrap' cafeteria software, centralized database, TCP-IP technology, off the shelf hardware, and Biometric options seamlessly combine to \"feed more kids\" How 'shrink-wrap' cafeteria software, centralized database, TCP-IP technology, off the shelf hardware, and Biometric options seamlessly combine to \"feed more kids\" Cafeteria Point of Sale Software For K-12 schools, college/university, corporate, health care, military cafeterias, and more! Cafeteria Point of Sale Software For K-12 schools, college/university, corporate, health care, military cafeterias, and more! Allows students to purchase their meals with pre-paid debit accounts Centralized database is easy to manage and very convenient - \"that's how it should work\" TCP-IP client-server application for Wide Area Network - \"your IT department will love it\" E-mail parents for low account balances-\"save reams of paper and tons of time\" \"Smart Terminal Technology - \"the line never stops\" Uses standard PC hardware Open Database Compliant (ODBC) ID options include cards, PINs, or Biometrics School lunch software provides for debit account - increases participation & revenue Parents can pre-pay online and view transaction history with FSS EZPAY State & Federal reports - \"real time - by day, by school, by district - complete control\" Ask about our \"wireless\" or even \"cashier-less\" solutions Biometric Scanning The industry standard from FSS No PIN number to forget! No ID Card to lose! Standard CAT-5 network connection - just plug it in Highest perception of \"confidentiality\" - Increase participation! Expands to library access, event admission and time & attendance - \"one solution - multiple applications\" Standard CAT-5 network connection - just plug it in Highest perception of \"confidentiality\" - Increase participation! Expands to library access, event admission and time & attendance - \"one solution - multiple applications\" FSS F.O.R.M.S. Comprehensive Free or Reduced Meal Software Centralized database - enter data anywhere in the district Simplified F&R forms processing - OMR scanning option Automatic eligibility calculation - updates POS in real time Imports direct certifications and your student database Recognizes all like phone # or address - increases F&R eligibility and E-RATE Preview FS S F.O.R.M.S. on line - it really is this easy! FOODCO™ Back Office Software System A proven food service management software for institutional food service since 1984 Perpetual or Physical Inventory Control Meal planning - electronic production sheets offer standardized recipes Procurement control with interfaces to Sysco, US Foodservice and more for bids and invoicing Cost per meal served, total cost of meal, waste and leftover tracking Receiving, transfer, requisition, credit and rebate tracking Central kitchen/central office control Discover how to save both time and money in your food service operation. Ask about our lease to own program! today for more information Dealer inquiries welcome About Us | Products | Contact Us | News | Support About Us | Products | Contact Us | News | Support CLICK HERE CLICK HERE College / University POSitive ID Access Restaurant Software FOODCO FOODCO™back office software for Institutional Food Service Overview Inventory Purchasing Recipes Receiving Menu Plan Menu Forecast Event Results Graphs Reporting The more you look... the better FOODCO looks FOODCO™back office software for Institutional Food Service Overview Inventory Purchasing Recipes Receiving Menu Plan Menu Forecast Event Results Graphs Reporting The more you look... the better FOODCO looks The more you look... the better FOODCO looks \"we feed more kids\" 1-800-425-1425 Fingerprint Technology Speeds Lunch Lines Finally, an affordable prepayment process-with parental control views and options FSS-EZPAY Discover how school districts earn tens/hundreds of thousands of dollars in additional State/Federal Funding",
    "FSS is an industry leader in the production and implementation of biometric identification. We were the first to successfully introduce biometrics into our nation's lunch rooms. Today, FSS™ Secure-ID systems are being used nationwide in a variety of organizations, including the health care, education, convenience, hospitality, age sensitive, government, & membership identification industries. What can FSS do for you? We specialize in biometrics, biometric identification reader products, id scanner products and many other biometric devices in order to find solutions to your everyday problems concerning age sensitive purchases, healthcare, memberships and more. We are dedicated to bringing you the very best in security & efficiency with our line of identification scanners and readers, fingerprint scanners and more. Our FSS Secure-ID systems will save you time & money, as well as the hassles involved with Identification cards & PIN number systems. vea este sitio en espaol",
    "FSS is an industry leader in the production and implementation of biometric identification. We were the first to successfully introduce biometrics into our nation's lunch rooms. Today, FSS™ Secure-ID systems are being used nationwide in a variety of organizations, including the health care, education, convenience, hospitality, age sensitive, government, & membership identification industries. What can FSS do for you? We specialize in finding solutions to your everyday problems through the integration of biometrics & other modern technologies. We are dedicated to bringing you the very best in security & efficiency. Our FSS™ Secure-ID systems will save you time & money, as well as the hassles involved with ID cards & PIN number systems. Here at FSS, we stand ready to earn your business. vea este sitio en espaol Modern clubs are beginning to incorporate VIP/Membership Access systems into their security counters in order to speed up the intake of those customers who would rather not wait in line. With our versatile biometric membership identification suite, you can upgrade your queuing efficiency & improve customer enrollment. Show your VIP's your appreciation -- find out more about our biometric VIP/Membership Access systems. Our systems easily sync with existing time clock system software & allowing them to be used in any environment where members are checking in & out. Our FSS™ Secure-ID biometric access systems are ideal for bank managers who want to be assured that only employees with clearance are allowed behind the counter. These systems are just as beneficial to busy businessmen who are often away from the office & want to be certain that employees are checking in and out on time. Find out more about how our finger scanning biometric systems can be used to solve your membership identification problems. The health care industry is full of headaches that can easily be aided by the biometric medication our FSS™ Secure-ID systems offer. Our systems can easily be integrated alongside with your existing medical records software. Your patients' electronic medical records can be accessed with a simple touch of a finger. Uses for our products include: patient identification, patient check-in systems, electronic medical record (EMR) software integration, & more. FSS wrote the book on cafeteria-based POS biometrics. For the past 20+ or so years, school lunch systems have utilized electronic card readers & PIN numbers for their point-of-sale (POS) transactions. In this day and age, FSS biometric finger scanners are being used in K-12 & college/university lunch rooms across the country & saving those schools substantial amounts of time & money. Our BioWedge solution easily integrates with existing Windows-based point of sale software. Just plug it in! FSS has a complete software solutions suite for K-12 school lunch point-of-sale systems, college and university meal plans, health care cafeterias, long term care facilities and corporate cafeterias. In addition to point-of-sale solutions, FSS provides USDA K-12 free and reduced processing, on line parental account access, and payment processing. Are you sure that customer is of age? His ID card says he is, but what if he is carrying a fake ID? FSS™ Secure-ID Age Sensitive systems can free you of worries & allow you and your staff to stop the guessing game. Our focus is on the development of biometric age and ID verification systems, and creating them to easily integrate with existing ID check software. The fines and penalties associated with serving minors can be horrendous, but pale in comparison to the potential tragedies that can result from underage consumption. to about ways to protect yourselves, as well as the lives of your potential customers. Our FSS convenience suite is perfect for streamlining routine customer identification processes. We ID programs are being enforced across the country, requiring counter attendants to ask for identification every time a customer makes an alcohol or tobacco purchase. Once enrolled using our biometric FSS™ Secure-ID system, return customers can verify their date of birth with just a touch of a finger. The system is capable of capturing how often customers make purchases, the goods they purchase, the time and date of transactions, & much more. Check-cashing services find that the convenience & accuracy of our systems make them well worth the investment. These businesses are dependant on repeat customers, and repeat customers require excellent customer service. If a regular customer were to forget to bring along his ID, and your employees are required to deny him service, there is a good chance you will lose that customers' business indefinitely. We all know it is easier & cheaper to retain customers than to generate them. Find our more about how our FSS™ Secure-ID systems can help you hang on to your customers & increase enrollment. Customer identification is as the heart of hospitality management. Existing systems for managing & identifying customers can be enhanced & streamlined with the integration of FSS™ Secure-ID technology. Whether it is be age identification, VIP registration, POS customer ID, identification for the purpose of enrollment into a child care management/daycare management system, or simply identifying returning customers, our hospitality software suite offers something for everyone. FSS™ Secure-ID systems are perfect for use in: hotels, casinos, bars, lodges, athletic clubs, dance clubs, rental establishments, YMCAs, & more. Government-associated industries are constantly looking for the latest & greatest in technology to help increase security & streamline complicated identification processes. Our products seamlessly integrate into existing jail & prison management, inmate visitation, and visitor management software systems. FSS has also developed a wide rage of identification-related products for use in the government sector, including: enrollee identification, visitor tracking, inmate visitor tracking, homeless tracking, time clock monitoring, & more.",
    "FSS™ Secure-ID Inmate Visitation How can importing visitors into the system streamline the visitation process? Benefits of FSS™ Secure-ID Inmate Visitation • Fast initial registration • Super-secure, & lightning quick member check-in • No waiting in line • Print professional looking, customized badges by visitor type • Scalable from a single system to a network of hundreds • Multiple, programmable, on-screen security alerts FSS™ Secure-ID Handheld ID Reader FSS™ Secure-ID Age Verification FSS™ Secure-ID Check Cashing FSS™ Secure-ID Child Pick-Up FSS™ Secure-ID Visitor Tracking FSS™ Secure-ID Patient Check-In FSS™ Secure-ID Homeless Tracking FSS™ Secure-ID Time IN/OUT FSS™ Secure-ID VIP Line",
    "My name is Mitch Johns and I am president and CEO of FSS, Inc., where we have been developing & implementing biometric solutions since 1999. We pioneered and successfully implemented the first-ever biometric ID and pay-system for public and private K-12 schools across the country. FSS, Inc. has received world-wide press coverage for our use of biometrics in allowing students to access their school lunch accounts with only a fingertip. Recently, a front page story on FSS in the Philadelphia Inquirer quickly became an AP wire story. In subsequent weeks USA Today, FOX News, Paul Harvey and even the BBC covered our breakthroughs in biometric technology. Until a few years ago our focus was solely on the educational market, but times have changed. We have expanded our services - finding solutions to problems across a number of markets. I invite you to search this site to find out how FSS SEcure-ID systems can work for you! With the use of our biometric devices and fingerprint software, modern clubs can begin to incorporate VIP / Membership Access systems into their security counters in order to speed up the intake of those customers who would rather not wait in line. With our versatile biometric membership identification suite, you can upgrade your queuing efficiency & improve customer enrollment. Show your VIP's your appreciation -- find out more about our biometric VIP / Membership Access identification systems. Our biometric identification systems easily sync with existing time clock system software & allowing them to be used in any environment where members are checking in & out. Our biometric Secure-ID scanner access systems are ideal for bank managers who want to be assured that only employees with clearance are allowed behind the counter. These biometric identification systems are just as beneficial to busy businessmen who are often away from the office & want to be certain that employees are checking in and out on time. Find out more about how our biometric fingerprint and thumb print scanner systems, as well as fingerprint software can be used to solve your membership identification problems. Gyms • Spas • Health Clubs • Massage Parlors • Night Clubs • YMCA • Bars • Movie Stores • Beauty Salons • Many More!! The healthcare industry is full of headaches that can easily be aided by the biometric medication identification system. Our biometric Secure-ID scanner systems can easily be integrated alongside with your existing medical records software. Your patients' electronic medical records can be accessed with a simple scan of a fingerprint or thumb print. Uses for our biometric devices and software products include: patient identification, patient check-in systems, electronic medical record (EMR) software integration, & more. Hospitals • Chiropractors • Blood Donation Centers • Health Clubs • Wellness Centers • Dentists • Allergists • Many More!! FSS wrote the book on cafeteria-based POS biometric devices. For the past 20+ or so years, school lunch systems have utilized electronic ID card scanner devices & PIN numbers for their point-of-sale (POS) transactions. In this day and age, FSS biometric fingerprint and thumb print scanners are being used in K-12 & college/university lunch rooms across the country & saving those schools substantial amounts of time & money. Our BioWedge fingerprint and thumb print scanners easily integrate with existing Windows-based point of sale software. Just plug it in! FSS has a complete biometric ID software and biometric identification solutions suite for K-12 school lunch point-of-sale systems, college and university meal plans, health care cafeterias, long term care facilities and corporate cafeterias. In addition to point-of-sale solutions, FSS provides USDA K-12 free and reduced processing, on line parental account access, and payment processing. Colleges • High Schools • Middle Schools • Elementary Schools • Kindergartens • Pre-Schools • Day Cares • Many More!! With our biometric ID scanner devices and identification software, you can be sure that your customer is of age. His identification card says he is, but what if he is carrying a fake ID? FSS™ Biometric Secure-ID Age Sensitive systems can free you of worries & allow you and your staff to stop the guessing game. Our focus is on the development of biometric age and ID verification scanner systems, and creating them to easily integrate with existing ID check software. The fines and penalties associated with serving minors can be horrendous, but pale in comparison to the potential tragedies that can result from underage consumption. to about ways to protect yourselves with biometric identification software and ID scanners, as well as the lives of your potential customers. . Bars Nightclubs Liquor Stores Convenience Stores Distributors Record Stores Gentlemen's Clubs Many More!! Our FSS biometric fingerprint, thumb print and other biometric devices used with our convenience suite are perfect for streamlining routine customer identification processes. We ID programs are being enforced across the country, requiring counter attendants to ask for identification every time a customer makes an alcohol or tobacco purchase. Once enrolled using our biometric FSS™ Secure-ID system, returning customers can verify their date of birth with just a touch of a finger or thumb with our fingerprint or thumb print scanner products. The biometric identification system is capable of capturing how often customers make purchases, the goods they purchase, the time and date of transactions, & much more. Check-cashing services find that the convenience & our biometric fingerprint and thumb print identification scanner systems make them well worth the investment. These businesses are dependent on repeat customers, and repeat customers require excellent customer service. If a regular customer were to forget to bring along his ID, and your employees are required to deny him service, there is a good chance you will lose that customers' business indefinitely. We all know it is easier & cheaper to retain customers than to generate them. Find out more about how our FSS™ Biometric Secure-ID systems can help you hang on to your customers & increase enrollment. Grocery Stores Convenience Stores Check Cashing Facilities Kiosks Department Stores Many More!! Customer identification is as the heart of hospitality management. Existing systems for managing & identifying customers can be enhanced & streamlined with the integration of FSS™ Biometric Secure-ID technology. Whether it is be age identification, VIP registration, POS customer ID, identification for the purpose of enrollment into a child care management / daycare management system, or simply identifying returning customers, our biometric identification hospitality software suite along with our fingerprint and thumb print scanner devices offer something for everyone. FSS™ Biometric Secure-ID systems are perfect for use in: hotels, casinos, bars, lodges, athletic clubs, dance clubs, rental establishments, YMCAs, & more. Hotels Casinos Bars Lodges Athletic Clubs Dance Clubs Rental Establishments Restaurants Many More!! Government-associated industries are constantly looking for the latest & greatest in technology to help increase security & streamline complicated identification processes. biometric identification fingerprint and thumb print scanner devices seamlessly integrate into existing jail & prison management, inmate visitation, and visitor management software systems. FSS has also developed a wide range of identification-related biometric devices, fingerprint software as well as other products for use in the government sector, including: enrollee identification, visitor tracking, inmate visitor tracking, homeless tracking, time clock monitoring, & more. Government Offices Jails Many More!!"
  ]
}