{
  "company": "www.certifyhealth.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 6,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.6451612903225806,
    "framing_surveillance": 0.0,
    "framing_market": 0.3548387096774194,
    "num_docs": 7
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 6
    }
  },
  "sample_docs": [
    "Your Training and Certification Partner CertifyLIVE offers an affordable and efficient way for organizations to deploy online training and certification to staff, sales force, distributors or customers using text, voice, video and Flash-based training materials. Course materials can be customized and adapted to each organization's needs, and administered to a worldwide audience in any language. CertifyLIVE helps organizations keep in compliance in an ever-changing legal and regulatory environment by helping to educate, train and validate each individual on any new changes. CertifyLIVE may also be used to ensure that an organization's staff and affiliates are always up to date on the latest innovations and product offerings. Organizations can seamlessly integrate CertifyLIVE training into their corporate websites, maintaining privacy and security of the trainees' identification and personal information. CertifyLIVE interfaces with an organization's database to report and record the trainee's results. Organizations may view and assess the statistics of their training and certification efforts at any time during and after training is deployed. CertifyLIVE provides training and certification solutions for nearly all industries. Read more Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Read more (C) Copyright 2010 CertifyLIVE. .",
    "CertifyLIVE was founded in 2009, and is headquartered in Provo, Utah. While CertifyLIVE provides training and compliance solutions across all industries, it is primarily focused on meeting the needs of direct sales companies. CertifyLIVE provides training and certification solutions for nearly all industries. Read more Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Read more (C) Copyright 2010 CertifyLIVE. .",
    "CertifyLIVE, LLC 3651 North 100 East , Suite 300 Provo , Utah 84604 CertifyLIVE provides training and certification solutions for nearly all industries. Read more Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Read more (C) Copyright 2010 CertifyLIVE. .",
    "Basic Training and Certification We assist distributors in direct sales companies achieve their financial goals by helping them understand and follow fundamental business, legal, and ethical principles. Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Accordingly, we work with individual companies to provide customized training modules on everything from industry-specific rules to company-specific compliance matters such as how a distributor should market a company's products or how a distributor may legally use its company's logos, trademarks, websites, or other intellectual property. Enhanced Business and Sales Training In addition to our certification and compliance products, we work with companies to create customized training centers that can deliver training modules (24/7) on topics such as sales, business development, marketing, finance, management, and virtually any other relevant topic. Online training is an excellent way to help lead, teach, and motivate distributors to achieve their business objectives and financial goals in a cost effective manner. DIstributors can access these courses immediately after signing up with a company; thus, helping them to hit the ground running. We ensure our applications will seamlessly integrate with a company's IT systems. We also understand the need for privacy and security. Thus, we have created robust security systems, and our systems are designed to deliver training in a manner that can be kept completely confidential, even from us. This allows companies to protect their most valuable asset - their people. CertifyLIVE provides training and certification solutions for nearly all industries. Read more Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Read more (C) Copyright 2010 CertifyLIVE. .",
    "Founders and Executive Team Jeffrey Heath, CPA, President Mr. Heath received a combined Bachelor of Science and Masters Degree in Accounting from Brigham Young University. He began his career in public accounting with Deloitte & Touche in Las Vegas and is licensed as a Certified Public Accountant. After leaving Deloitte & Touche, he served as the Chief Financial Officer of a manufacturing company with operations in the United States, Canada, and South America. In 2002, Mr. Heath became a founding partner of Heath-Jaynes, LLC, a Certified Public Accounting firm that specializes in business consulting and tax services for clients throughout the mountain west. Mr. Heath's business interests are varied, and he has built several successful businesses throughout his career. Keith Anderson, Ph.D., V.P. Technology Mr. Anderson has been instrumental in founding, developing, and managing startup companies, including Anderson Research, KBBS, CyData, ViewPoint, AirSwitch/SwitchPoint, and CarbonPhysics/STEP. Mr. Anderson has over 20 years experience in information technologies development and management, including, LAN, WAN, SAN, desktop support and maintenance, web site development, cryptology, parallel processing, network security, database synchronization and fault tolerance. He is experienced in all common programming languages and platforms, including client-server, networking, telecommunications, data interfacing, embedded systems and multiple platform machine level development. Matthew Wride, J.D., V.P. Compliance Mr. Wride is a shareholder with the law firm of Kirton & McConkie. Mr. Wride earned a Bachelor's degree from Brigham Young University. He received his law degrees from Willamette University College of Law and the University of Washington. Prior to entering into private law practice, he was a consultant for Deloitte & Touche in Seattle and Salt Lake City. CertifyLIVE provides training and certification solutions for nearly all industries. Read more Our primary focus is on teaching distributors about core business and legal principles. We are also committed to helping direct sales companies create a strong internal compliance department. Read more (C) Copyright 2010 CertifyLIVE. ."
  ]
}