{
  "company": "www.ncheck.net",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 14,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.1578947368421052,
    "framing_surveillance": 0.1052631578947368,
    "framing_market": 0.7368421052631579,
    "num_docs": 15
  },
  "topic_timeline": {
    "20": {
      "-1": 14,
      "0": 1
    }
  },
  "sample_docs": [
    "An end-user Biometric System to automate attendance control Download NCheck Bio Attendance™ for your platform. For Microsoft Windows® operating system, version 7, 8 and 10. (1) Android™ 4.0 or later versions supported. (1) Get NCheck Personal ID on Google Play™. (2) (1) Trial period for both Microsoft Windows® and Android™ versions are 30 days and requires constant internet connection. (2) Requires a network connectivity with NCheck Server. For more information, please refer Fingerprint and Face support. More reliable and accurate records than legacy PIN and RFID. Easy and smart attendance reporting. Runs on standard hardware available on the market. More freedom to select hardware from the market. Cost effective and stylish. Based on record breaking fast and accurate Neurtechnology biometric algorithms, NCheck supports up to 40,000 authentications per second in normal hardware. Automatic data synchronization, offline operation support and GPS location support. Available for Windows and android devices. Face authentication is a natural and hygienic. Your employees can mark their attendance contactless using face technology. NCheck face authentication is now five time accurate than earlier. NCheck server is Windows based, and Client Software is available for both Windows and Android. No defined limitation of templates, records or users. It is highly scalable with user selection of memory and storage. It is easy to scale and upgrade. Bring Your Own Device (BYOD) Let employees to mark their attendance securely using their own android device and face authentication. Use NCheck Personal ID. Using User ID and password Using IP camera (with optional RFID support) Select face/ fingerprint templates from history or form fingerprint scanner/ camera. Add a profile picture Filter by Name, User group or Shift Add, edit or delete events You can define shifts on your own. Restrict check-in or out within specified time period Define weekly/ monthly overtime rates Users can see their attendance records and reports. Administrators can perform add, edit and delete event records. Reports for administrators can be customizable using filters. Administrative operations including users and user groups management, shifts management and event log operations. Use of employee own device No use of shared terminal, no health risk Use employee smart device and built-in cameras. No additional requirements Employee can record attendance from anywhere, no queues. DigiFace Visitor Management System DigiFace Time and Attendance DigiFace Access Control Solution",
    "NCheck Version 4.1.3 is released. 'In this public release, we have added new Rostering feature in NCheck Bio Attendance Standard version. Scheduling shift assignments to users or user groups can be done using the rostering facility. Also we have newly introduced a NCheck SDK to develop 3 rd party fingerprint scanner integration with NCheck Standard. Among other improvements following changes are applied in each version: NCheck Bio Attendance Standard - Windows Added max and min values for work hours control in shift management UI. Updated user group tab content according to rostering implementation. NCheck Bio Attendance Standard - Android Face Matching Performance Improvement Enroll users from third party scanners. Many fixes and improvements applied for both Android and Windows versions. ' NCheck Bio Attendance Standard - Windows Added max and min values for work hours control in shift management UI. Updated user group tab content according to rostering implementation. NCheck Bio Attendance Standard - Android Face Matching Performance Improvement Enroll users from third party scanners. Many fixes and improvements applied for both Android and Windows versions.",
    "Buy NCheck Looking for an attendance device? Lenovo Tab 2 with NCheck Supported Scanners Want something different? NCheck in Cloud AVAILABLE FOR Lenovo Tab 2 with NCheck Latest News NCheck Version 4.0.15 is released. May 19, 2017 Internal release Facebook Twitter Google+ LinkedIn In this version, we have done some new UI enhancements to improve end-user experience. As the most notable change, we have merged the \"Tray Application\" with NCheck control panel. For the convenience of new users, NCheck will now create a default database with empty password when the server executed for the very first time. Among other changes, we have added the ability to enable and disable admin password. There are some minor bug fixes also included with this release. NCheck Version 4.0.13 is released. April 28, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have updated the product with the latest Neurotechnology Biometric SDK (Product revision number: 16481). NCheck Version 4.0.12 is released. April 27, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed invalid user status issue when a manual check-out is added for a checked in user. Shift to user group scheduling NCheck Version 4.0.8 is released. April 07, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed client connectivity issue with server due to certificate issue Included license deactivation tool for non-trial version Validation added for external executable paths NCheck Personal ID iOS Client released. March 31, 2017 New Facebook Twitter Google+ LinkedIn We are pleased to announce our latest addition to NCheck Bio Attendance product suite, the NCheck Personal ID client for iPhones and iPads. This client app has same features like Android Personal ID client, You can download this app from iOS App Store or from iTunes . NCheck Personal ID comes with following benefits: Strong security with Employee face verification. Use of employee own device. It can restrict and control employee working location. Record include the location of attendance recording. No use of shared terminal, No health risk. Use employee smart device in built camera, No additional requirements. Employee can record attendance from anywhere, No queues. One click attendance marking – Quick and convenient. Monitoring employee attendance history – Mange work time. NCheck Version 4.0.7 is released. March 23, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed client settings caching issue. Entity framework initialization modified to accept custom connection string at runtime. Improved offline operation support. Reduced installer size by removing deprecated dependencies. NCheck Version 4.0.6 is released. March 20, 2017 Public release Facebook Twitter Google+ LinkedIn In this update, we have added a fix to deleted user names to avoid conflicts with new users. Now deleted user names will be renamed and new user names will accepted. NCheck Version 4.0.5 is released. March 17, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Improved diagnostic report for license manager. Improved camera capturing code. In android NCheck, power user settings updation bug fixed. Some small corrections made in the documentation. NCheck Version 4.0.4 is released. March 08, 2017 Public release Facebook Twitter Google+ LinkedIn In this update, we have fixed late check-in and late check-out report bugs. Also we have fixed attendance event images disappearing from event log images report. A fix done for matcher to return user matching with highest score when biometrics matched with multiple users. Personal client event logs missing address issue and productivity report exported report issues are also corrected. NCheck Version 4.0.3 is released. March 07, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have fixed server config loading delaying related issues and added temporary logs to log attached devices. NCheck Version 4.0.2 is released. March 01, 2017 Public release Facebook Twitter Google+ LinkedIn This is the first public release of NCheck 4.0 product line. This release includes all new features such as Iris support, new report types and all the bug fixes we have provided during last internal releases. In 4.0.2 version, we included support for binoculars. The documentation also updated to include the new features. These are other fixes and improvements done in this version update. Improved multimodal device support. Improved paired device functionality. Face biometric enrollment using face image. Fixed liveness check issues. See the for more details on this release. NCheck Version 4.0.1 is released. February 09, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have done following bug fixes and improvements. Fixed offline mode user list loading issue. Fixed from and to date display issues in worked hour report. Face biometric enrollment using face image. Modified late check-in and check-out reports to include only late users. Fixed Web-ui face enrollment issue form history. Enhanced event log calendar to display event logs based on in/out date, instead of shift start See the for more information on this release. NCheck Version 4.0.0 is released. January 27, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we introduce two new features to NCheck. Now \"Iris biometrics support\" is available in NCheck. And also we have added late check-in report feature. Among other features, in report scheduling, you can add schedules based on shift start or end. Also some known issues in report scheduling are also fixed. NCheck Version 3.1.15 is released. January 13, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have included RFID scanner support for NCheck. Also we have improved enrollment accuracy of face templates. NCheck Version 3.1.14 is released. December 21, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed following issues: Fixed check-out issue for overnight shifts. Enhancements to productivity report. NCheck Bio Attendance got 5 star rating on Capterra review. December 14, 2016 Facebook Twitter Google+ LinkedIn Business software discovery and review service Capterra has reviewed NCheck under attendance tracking software category. We got 5 star rating and some positive reviews there. Check out NCheck Bio Attendance on Capterra . NCheck Bio Attendance represented IFSEC Expo 2016, New Delhi. December 09, 2016 Facebook Twitter Google+ LinkedIn IFSEC Global is the pre-eminent authority on the global security and fire industry. IFSEC-India 2016, was recently held at Pragati Maidan, New Delhi, India organized by UBM India to bring product and solutions providers to the clients to meet their objectives through thought leadership, product & solution showcases and year round networking. NCheck Bio Attendance 3.1 was promoted in the IFSEC-India, 2016 expo. Download the brochure distributed at IFSEC Expo. (PDF, 1.6 MB) NCheck Version 3.1.13 is released. December 08, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have added absentee report and late check-out reports. New report scheduling feature is also added in this release. Productivity report and IP camera integration are improved. NCheck Version 3.1.12 is released. November 25, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have integrated SDK fix to solve IP camera issues. A new feature to schedule exporting report is added. Also multiple location restrictions related issues are also fixed. We have now enabled face identification start on keyboard, RFID or Barcode event. A fix has been added to disable NdmModules to prevent memory leaks. NCheck Version 3.1.11 is released. November 09, 2016 (Update provided on January 25, 2017) Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed barcode scanner id reset issue when editing user details. Also a memory leak on camera capture window was fixed. Control panel settings window resize issues in lower resolutions were also fixed now. IP camera issue related to media format change was resolved and Mobotix RFID camera support was improved. NCheck Version 3.1.10 is released. October 28, 2016 Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed documentation issues of some re-branded versions. In Web UI work hour reports, date time issue and separate password for login issues are fixed with this release. Database upgrade issues and first email sending issues are also fixed. NCheck Cloud: The cloud attendance management solution is released to public. October 19, 2016 Public release Facebook Twitter Google+ LinkedIn NCheck team is pleased to announce that the new Cloud attendance management solution with biometric time and attendance control, \"NCheck Cloud\" is released to public. NCheck Cloud, cloud biometric attendance management and control system starts with completely free without any obligation up to 5 employees. Visit cloud.ncheck.net and subscribe to free cloud attendance management system account and explore our real time cloud based time and attendance management system. NCheck Version 3.1.9 is released. October 18, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have introduced a new \"productivity report\" feature. Capability of import and export user groups and shifts is included in this release. Also we have included location bypass option for location restriction, for both users and groups. When this option is enabled, approximate distance from the location is added to event log report. India Steel selects NCheck Bio Attendance for their Vilnius Office September 30, 2016 Facebook Twitter Google+ LinkedIn India Steel has started using NCheck Bio Attendance for their Vilnius, Lithuania office to track employee attendance. NCheck Bio Attendance supports Saral Infotech S700 Android tablet September 28, 2016 Facebook Twitter Google+ LinkedIn Neurotechnology, a pioneer in biometric algorithms & software development has partnered with Saral Infotech who brings an Advanced Technology hardware product solutions on Biometric fingerprint readers, IRIS and face based Tablet PCs, Handhelds for office and field operations. Saral S700 Android tablet is one stop solution for all type of Biometric data capturing & verification. Organizations can use S700 Tablet PC with NCheck Bio Attendance for Visitor Management, Access Controls and Time & Attendance as a more cost-effective solution. NCheck Version 3.1.8 is released. September 27, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, employee auto check out option has been improved to allow employee auto check out at end of the work shift/roster. Application feedback option are also enhanced by introducing a new feature to play system beep when face is detected. A new daily backup option has also been added. New NCheck Bio Attendance windows application needs Microsoft .NET 4.6 version and provides enhanced .NET features and security. NCheck Version 3.1.7 is released. September 15, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, NCheck Bio Attendance support employee identification using barcodes. Also we have improved the liveness check and auto fix options in the web UI by fixing usage issues. NCheck Bio Attendance Android provides a new usage counter. NCheck Version 3.1.6 is released. September 1, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, new 'Dashboard' feature has been introduced for NCheck Windows. Kiosk mode administrator password confirmation UI has been improved. Now client shows the most recent event time of user. It also sorts client user list by event time. We have renamed 'time-stamp' as 'time' in reports and UI. Other improvements we have done are, Improvements to database table structure Improved report export button appearance Fixed face confidence synchronization issue Improved user list synchronization after deletion of users NCheck Version 3.1.5 is released. August 16, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have included a setting to change face template size. New help text is now included in admin login screen. In NCheck Personal ID, now check-in and check-out events prevented for disabled users. In NCheck server. the default port is now changed to 8010. NCheck Version 3.1.4 is released. August 9, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release of NCheck, we have introduced iris support for verification and identification. We improved the reporting section by replacing it with a data grid. Also a new setting to flip camera image is introduced in this version. Now you can see whether your NCheck Bio Attendance software is latest version or not from the 'about' dialog box. Press Release: New NCheck Bio Attendance 3.1 Provides Intelligent Biometric Time & Attendance Tracking July 13, 2016 Facebook Twitter Google+ LinkedIn Neurotechnology, a provider of high-precision biometric identification & artificial intelligence technologies, today announced the release of NCheck Bio Attendance 3.1, a system that provides quick and easy tracking of time and attendance using fingerprint and/or face biometrics. The incorporation of biometrics into the time and attendance task provides convenience for the user as well as a high level of error-free authentication. NCheck Bio Attendance 3.1 is suitable for use in any size organization - from corporate and government offices to schools, hospitals, event spaces and job sites. It works with... (Read more..) NCheck Version 3.1.3 is released. July 13, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release of NCheck, we have included a trial expire check. Also now users can see remaining trial time in about box. We have set the default sorting order of user list according to user name. We have done some updates to the documentation. In this version, a delay has been added to prevent accidental logins when using fingerprints for check-in. NCheck Version 3.1.2 is released. July 8, 2016 Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed connection issues of NCheck personal ID app. Also in the NCheck web UI, we have added support for HTTP caching. In this release we added support for case-insensitive login names for users. In situations where client hardware is not created by installer, now NCheck will regenerate it automatically . NCheck Version 3.1.1 is released. June 28, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we added Megamatcher SDK 9.0 support. Auto conversion of face templates into new templates is added. Also delete user functionality has been added in this release. JPEG compression and re-scaling has been implemented for captured images. We have added event log deletion confirmation message with more details. Event log table sorting has been redefined according to user groups. NCheck Version 3.0.69 is released. June 27, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have improved hardware id of devices preserving backward compatibility. Also creating multiple firewall rules for same port is prevented in this release. In web ui reports tab, \"All\" item has been added. Also sudden device removal from client issue is fixed. NCheck Version 3.0.68 is released. June 17, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we added an option for enabling and disabling password login for users. And there's a setting added for display customer banner at capture screen. We have fixed the deletion of shifts when an attached user group is deleted. The same hardware id generation issue for some range of devices is also fixed now. In this release of NCheck personal ID, we have enabled user device registration with empty passwords. NCheck Version 3.0.67 is released. June 10, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have added a setting to restrict adding a user to multiple user groups. Also we have added shift information to user and user group section of NCheck control panel. For shifts, we have added weekly and monthly overtime calculation rates. In the NCheck web interface, new re-evaluate button has been added. NCheck Version 3.0.66 is released. June 06, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed the issue of invalid user count in NCheck client user list. Report file names have been improved to include all filters used to generate them, and appended filter information to reports. Also user and event log tabs sorting issues are solved. Following changes/ fixes are applied with this release. Pass additional parameters to external executables. Optional password for NCheck web. Validate server port numbers before starting the server. Upon installation, execute database configuration wizard before running the client. Preventing UAC permission dialog appearing twice after applying server settings. NCheck Version 3.0.65 is released. May 20, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed user status not updating issue on password login. In NCheck web interface, image caching issue is resolved in this release. Check-in and check-out inconsistency when multiple clients connected is fixed. Another change is, this version saves original image as the template. For more information, please read the ChangeLog for NCheck Bio Attendance 3.0/3.1/4.0 News May 19, 2017 April 28, 2017 April 27, 2017 April 07, 2017 March 31, 2017 March 23, 2017 March 20, 2017 March 17, 2017 March 08, 2017 March 07, 2017 March 01, 2017 February 09, 2017 January 27, 2017 January 13, 2017 December 21, 2016 December 14, 2016 December 09, 2016 December 08, 2016 November 25, 2016 November 09, 2016 October 28, 2016 October 19, 2016 October 18, 2016 September 30, 2016 September 28, 2016 September 27, 2016 September 15, 2016 September 1, 2016 August 16, 2016 August 9, 2016 July 13, 2016 July 13, 2016 July 8, 2016 June 28, 2016 June 27, 2016 June 17, 2016 June 10, 2016 June 06, 2016 May 20, 2016 Subscribe to Newsletter Newsletter subscription sends you information on NCheck Bio Attendance biometric attendance control system latest updates, features enhancements and other time and attendance control system news. We respect your privacy. You can unsubscribe form mailing list at any time. Latest News NCheck Version 4.0.15 is released. May 19, 2017 Internal release Facebook Twitter Google+ LinkedIn In this version, we have done some new UI enhancements to improve end-user experience. As the most notable change, we have merged the \"Tray Application\" with NCheck control panel. For the convenience of new users, NCheck will now create a default database with empty password when the server executed for the very first time. Among other changes, we have added the ability to enable and disable admin password. There are some minor bug fixes also included with this release. NCheck Version 4.0.13 is released. April 28, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have updated the product with the latest Neurotechnology Biometric SDK (Product revision number: 16481). NCheck Version 4.0.12 is released. April 27, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed invalid user status issue when a manual check-out is added for a checked in user. Shift to user group scheduling NCheck Version 4.0.8 is released. April 07, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed client connectivity issue with server due to certificate issue Included license deactivation tool for non-trial version Validation added for external executable paths NCheck Personal ID iOS Client released. March 31, 2017 New Facebook Twitter Google+ LinkedIn We are pleased to announce our latest addition to NCheck Bio Attendance product suite, the NCheck Personal ID client for iPhones and iPads. This client app has same features like Android Personal ID client, You can download this app from iOS App Store or from iTunes . NCheck Personal ID comes with following benefits: Strong security with Employee face verification. Use of employee own device. It can restrict and control employee working location. Record include the location of attendance recording. No use of shared terminal, No health risk. Use employee smart device in built camera, No additional requirements. Employee can record attendance from anywhere, No queues. One click attendance marking – Quick and convenient. Monitoring employee attendance history – Mange work time. NCheck Version 4.0.7 is released. March 23, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Fixed client settings caching issue. Entity framework initialization modified to accept custom connection string at runtime. Improved offline operation support. Reduced installer size by removing deprecated dependencies. NCheck Version 4.0.6 is released. March 20, 2017 Public release Facebook Twitter Google+ LinkedIn In this update, we have added a fix to deleted user names to avoid conflicts with new users. Now deleted user names will be renamed and new user names will accepted. NCheck Version 4.0.5 is released. March 17, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have done following improvements and bug fixes: Improved diagnostic report for license manager. Improved camera capturing code. In android NCheck, power user settings updation bug fixed. Some small corrections made in the documentation. NCheck Version 4.0.4 is released. March 08, 2017 Public release Facebook Twitter Google+ LinkedIn In this update, we have fixed late check-in and late check-out report bugs. Also we have fixed attendance event images disappearing from event log images report. A fix done for matcher to return user matching with highest score when biometrics matched with multiple users. Personal client event logs missing address issue and productivity report exported report issues are also corrected. NCheck Version 4.0.3 is released. March 07, 2017 Internal release Facebook Twitter Google+ LinkedIn In this update, we have fixed server config loading delaying related issues and added temporary logs to log attached devices. NCheck Version 4.0.2 is released. March 01, 2017 Public release Facebook Twitter Google+ LinkedIn This is the first public release of NCheck 4.0 product line. This release includes all new features such as Iris support, new report types and all the bug fixes we have provided during last internal releases. In 4.0.2 version, we included support for binoculars. The documentation also updated to include the new features. These are other fixes and improvements done in this version update. Improved multimodal device support. Improved paired device functionality. Face biometric enrollment using face image. Fixed liveness check issues. See the for more details on this release. NCheck Version 4.0.1 is released. February 09, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have done following bug fixes and improvements. Fixed offline mode user list loading issue. Fixed from and to date display issues in worked hour report. Face biometric enrollment using face image. Modified late check-in and check-out reports to include only late users. Fixed Web-ui face enrollment issue form history. Enhanced event log calendar to display event logs based on in/out date, instead of shift start See the for more information on this release. NCheck Version 4.0.0 is released. January 27, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we introduce two new features to NCheck. Now \"Iris biometrics support\" is available in NCheck. And also we have added late check-in report feature. Among other features, in report scheduling, you can add schedules based on shift start or end. Also some known issues in report scheduling are also fixed. NCheck Version 3.1.15 is released. January 13, 2017 Internal release Facebook Twitter Google+ LinkedIn In this release, we have included RFID scanner support for NCheck. Also we have improved enrollment accuracy of face templates. NCheck Version 3.1.14 is released. December 21, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed following issues: Fixed check-out issue for overnight shifts. Enhancements to productivity report. NCheck Bio Attendance got 5 star rating on Capterra review. December 14, 2016 Facebook Twitter Google+ LinkedIn Business software discovery and review service Capterra has reviewed NCheck under attendance tracking software category. We got 5 star rating and some positive reviews there. Check out NCheck Bio Attendance on Capterra . NCheck Bio Attendance represented IFSEC Expo 2016, New Delhi. December 09, 2016 Facebook Twitter Google+ LinkedIn IFSEC Global is the pre-eminent authority on the global security and fire industry. IFSEC-India 2016, was recently held at Pragati Maidan, New Delhi, India organized by UBM India to bring product and solutions providers to the clients to meet their objectives through thought leadership, product & solution showcases and year round networking. NCheck Bio Attendance 3.1 was promoted in the IFSEC-India, 2016 expo. Download the brochure distributed at IFSEC Expo. (PDF, 1.6 MB) NCheck Version 3.1.13 is released. December 08, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have added absentee report and late check-out reports. New report scheduling feature is also added in this release. Productivity report and IP camera integration are improved. NCheck Version 3.1.12 is released. November 25, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have integrated SDK fix to solve IP camera issues. A new feature to schedule exporting report is added. Also multiple location restrictions related issues are also fixed. We have now enabled face identification start on keyboard, RFID or Barcode event. A fix has been added to disable NdmModules to prevent memory leaks. NCheck Version 3.1.11 is released. November 09, 2016 (Update provided on January 25, 2017) Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed barcode scanner id reset issue when editing user details. Also a memory leak on camera capture window was fixed. Control panel settings window resize issues in lower resolutions were also fixed now. IP camera issue related to media format change was resolved and Mobotix RFID camera support was improved. NCheck Version 3.1.10 is released. October 28, 2016 Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed documentation issues of some re-branded versions. In Web UI work hour reports, date time issue and separate password for login issues are fixed with this release. Database upgrade issues and first email sending issues are also fixed. NCheck Cloud: The cloud attendance management solution is released to public. October 19, 2016 Public release Facebook Twitter Google+ LinkedIn NCheck team is pleased to announce that the new Cloud attendance management solution with biometric time and attendance control, \"NCheck Cloud\" is released to public. NCheck Cloud, cloud biometric attendance management and control system starts with completely free without any obligation up to 5 employees. Visit cloud.ncheck.net and subscribe to free cloud attendance management system account and explore our real time cloud based time and attendance management system. NCheck Version 3.1.9 is released. October 18, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have introduced a new \"productivity report\" feature. Capability of import and export user groups and shifts is included in this release. Also we have included location bypass option for location restriction, for both users and groups. When this option is enabled, approximate distance from the location is added to event log report. India Steel selects NCheck Bio Attendance for their Vilnius Office September 30, 2016 Facebook Twitter Google+ LinkedIn India Steel has started using NCheck Bio Attendance for their Vilnius, Lithuania office to track employee attendance. NCheck Bio Attendance supports Saral Infotech S700 Android tablet September 28, 2016 Facebook Twitter Google+ LinkedIn Neurotechnology, a pioneer in biometric algorithms & software development has partnered with Saral Infotech who brings an Advanced Technology hardware product solutions on Biometric fingerprint readers, IRIS and face based Tablet PCs, Handhelds for office and field operations. Saral S700 Android tablet is one stop solution for all type of Biometric data capturing & verification. Organizations can use S700 Tablet PC with NCheck Bio Attendance for Visitor Management, Access Controls and Time & Attendance as a more cost-effective solution. NCheck Version 3.1.8 is released. September 27, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, employee auto check out option has been improved to allow employee auto check out at end of the work shift/roster. Application feedback option are also enhanced by introducing a new feature to play system beep when face is detected. A new daily backup option has also been added. New NCheck Bio Attendance windows application needs Microsoft .NET 4.6 version and provides enhanced .NET features and security. NCheck Version 3.1.7 is released. September 15, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, NCheck Bio Attendance support employee identification using barcodes. Also we have improved the liveness check and auto fix options in the web UI by fixing usage issues. NCheck Bio Attendance Android provides a new usage counter. NCheck Version 3.1.6 is released. September 1, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, new 'Dashboard' feature has been introduced for NCheck Windows. Kiosk mode administrator password confirmation UI has been improved. Now client shows the most recent event time of user. It also sorts client user list by event time. We have renamed 'time-stamp' as 'time' in reports and UI. Other improvements we have done are, Improvements to database table structure Improved report export button appearance Fixed face confidence synchronization issue Improved user list synchronization after deletion of users NCheck Version 3.1.5 is released. August 16, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have included a setting to change face template size. New help text is now included in admin login screen. In NCheck Personal ID, now check-in and check-out events prevented for disabled users. In NCheck server. the default port is now changed to 8010. NCheck Version 3.1.4 is released. August 9, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release of NCheck, we have introduced iris support for verification and identification. We improved the reporting section by replacing it with a data grid. Also a new setting to flip camera image is introduced in this version. Now you can see whether your NCheck Bio Attendance software is latest version or not from the 'about' dialog box. Press Release: New NCheck Bio Attendance 3.1 Provides Intelligent Biometric Time & Attendance Tracking July 13, 2016 Facebook Twitter Google+ LinkedIn Neurotechnology, a provider of high-precision biometric identification & artificial intelligence technologies, today announced the release of NCheck Bio Attendance 3.1, a system that provides quick and easy tracking of time and attendance using fingerprint and/or face biometrics. The incorporation of biometrics into the time and attendance task provides convenience for the user as well as a high level of error-free authentication. NCheck Bio Attendance 3.1 is suitable for use in any size organization - from corporate and government offices to schools, hospitals, event spaces and job sites. It works with... (Read more..) NCheck Version 3.1.3 is released. July 13, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release of NCheck, we have included a trial expire check. Also now users can see remaining trial time in about box. We have set the default sorting order of user list according to user name. We have done some updates to the documentation. In this version, a delay has been added to prevent accidental logins when using fingerprints for check-in. NCheck Version 3.1.2 is released. July 8, 2016 Public release Facebook Twitter Google+ LinkedIn In this release, we have fixed connection issues of NCheck personal ID app. Also in the NCheck web UI, we have added support for HTTP caching. In this release we added support for case-insensitive login names for users. In situations where client hardware is not created by installer, now NCheck will regenerate it automatically . NCheck Version 3.1.1 is released. June 28, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we added Megamatcher SDK 9.0 support. Auto conversion of face templates into new templates is added. Also delete user functionality has been added in this release. JPEG compression and re-scaling has been implemented for captured images. We have added event log deletion confirmation message with more details. Event log table sorting has been redefined according to user groups. NCheck Version 3.0.69 is released. June 27, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have improved hardware id of devices preserving backward compatibility. Also creating multiple firewall rules for same port is prevented in this release. In web ui reports tab, \"All\" item has been added. Also sudden device removal from client issue is fixed. NCheck Version 3.0.68 is released. June 17, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we added an option for enabling and disabling password login for users. And there's a setting added for display customer banner at capture screen. We have fixed the deletion of shifts when an attached user group is deleted. The same hardware id generation issue for some range of devices is also fixed now. In this release of NCheck personal ID, we have enabled user device registration with empty passwords. NCheck Version 3.0.67 is released. June 10, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have added a setting to restrict adding a user to multiple user groups. Also we have added shift information to user and user group section of NCheck control panel. For shifts, we have added weekly and monthly overtime calculation rates. In the NCheck web interface, new re-evaluate button has been added. NCheck Version 3.0.66 is released. June 06, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed the issue of invalid user count in NCheck client user list. Report file names have been improved to include all filters used to generate them, and appended filter information to reports. Also user and event log tabs sorting issues are solved. Following changes/ fixes are applied with this release. Pass additional parameters to external executables. Optional password for NCheck web. Validate server port numbers before starting the server. Upon installation, execute database configuration wizard before running the client. Preventing UAC permission dialog appearing twice after applying server settings. NCheck Version 3.0.65 is released. May 20, 2016 Internal release Facebook Twitter Google+ LinkedIn In this release, we have fixed user status not updating issue on password login. In NCheck web interface, image caching issue is resolved in this release. Check-in and check-out inconsistency when multiple clients connected is fixed. Another change is, this version saves original image as the template. For more information, please read the ChangeLog for NCheck Bio Attendance 3.0/3.1/4.0 News May 19, 2017 April 28, 2017 April 27, 2017 April 07, 2017 March 31, 2017 March 23, 2017 March 20, 2017 March 17, 2017 March 08, 2017 March 07, 2017 March 01, 2017 February 09, 2017 January 27, 2017 January 13, 2017 December 21, 2016 December 14, 2016 December 09, 2016 December 08, 2016 November 25, 2016 November 09, 2016 October 28, 2016 October 19, 2016 October 18, 2016 September 30, 2016 September 28, 2016 September 27, 2016 September 15, 2016 September 1, 2016 August 16, 2016 August 9, 2016 July 13, 2016 July 13, 2016 July 8, 2016 June 28, 2016 June 27, 2016 June 17, 2016 June 10, 2016 June 06, 2016 May 20, 2016 Fixed invalid user status issue when a manual check-out is added for a checked in user. Shift to user group scheduling Fixed client connectivity issue with server due to certificate issue Included license deactivation tool for non-trial version Validation added for external executable paths Strong security with Employee face verification. Use of employee own device. It can restrict and control employee working location. Record include the location of attendance recording. No use of shared terminal, No health risk. Use employee smart device in built camera, No additional requirements. Employee can record attendance from anywhere, No queues. One click attendance marking – Quick and convenient. Monitoring employee attendance history – Mange work time. Fixed client settings caching issue. Entity framework initialization modified to accept custom connection string at runtime. Improved offline operation support. Reduced installer size by removing deprecated dependencies. Improved diagnostic report for license manager. Improved camera capturing code. In android NCheck, power user settings updation bug fixed. Some small corrections made in the documentation. This is the first public release of NCheck 4.0 product line. This release includes all new features such as Iris support, new report types and all the bug fixes we have provided during last internal releases. In 4.0.2 version, we included support for binoculars. The documentation also updated to include the new features. These are other fixes and improvements done in this version update. Improved multimodal device support. Improved paired device functionality. Face biometric enrollment using face image. Fixed liveness check issues. See the for more details on this release. In this release, we have done following bug fixes and improvements. Fixed offline mode user list loading issue. Fixed from and to date display issues in worked hour report. Face biometric enrollment using face image. Modified late check-in and check-out reports to include only late users. Fixed Web-ui face enrollment issue form history. Enhanced event log calendar to display event logs based on in/out date, instead of shift start See the for more information on this release. Fixed check-out issue for overnight shifts. Enhancements to productivity report. IFSEC Global is the pre-eminent authority on the global security and fire industry. IFSEC-India 2016, was recently held at Pragati Maidan, New Delhi, India organized by UBM India to bring product and solutions providers to the clients to meet their objectives through thought leadership, product & solution showcases and year round networking. NCheck Bio Attendance 3.1 was promoted in the IFSEC-India, 2016 expo. Download the brochure distributed at IFSEC Expo. (PDF, 1.6 MB) Improvements to database table structure Improved report export button appearance Fixed face confidence synchronization issue Improved user list synchronization after deletion of users Pass additional parameters to external executables. Optional password for NCheck web. Validate server port numbers before starting the server. Upon installation, execute database configuration wizard before running the client. Preventing UAC permission dialog appearing twice after applying server settings. ChangeLog for NCheck Bio Attendance 3.0/3.1/4.0 Subscribe to Newsletter Newsletter subscription sends you information on NCheck Bio Attendance biometric attendance control system latest updates, features enhancements and other time and attendance control system news. We respect your privacy. You can unsubscribe form mailing list at any time. Newsletter subscription sends you information on NCheck Bio Attendance biometric attendance control system latest updates, features enhancements and other time and attendance control system news. We respect your privacy. You can unsubscribe form mailing list at any time. Install trial today and upgrade later. Free Download For Microsoft Windows® operating system, version 7, 8 and 10. (1) Android™ 4.0 or later versions. (1) Get NCheck Personal ID on Google Play™ and App Store®. (2) (1) Trial period for both Microsoft Windows® and Android™ versions are 30 days and requires constant internet connection. (2) Requires a network connectivity with NCheck Server. For more information, please refer",
    "Different use case scenarios for NCheck Bio Attendance NCheck Bio Attendance system is highly customizable and it caters wide range of customers with different requirements. NCheck Bio Attendance Standard system is Windows based application and NCheck Bio Attendance cloud is a cloud-based service. Both versions can be used for large number of employees, but we recommend to use NCheck Bio Attendance cloud for very large number (> 1000) of employees for high performance. Based on number of employees Access control with face",
    "Latest News « 1 2 3 4 5 6 7 8 » NCheck Bio Attendance represented IFSEC Expo 2016, New Delhi. December 09, 2016 IFSEC Global is the pre-eminent authority on the global security and fire industry. IFSEC-India 2016, was recently held at Pragati Maidan, New Delhi, India organized by UBM India to bring product and solutions providers to the clients to meet their objectives through thought leadership, product & solution showcases and year round networking. NCheck Bio Attendance 3.1 was promoted in the IFSEC-India, 2016 expo. Download the brochure distributed at IFSEC Expo. (PDF, 1.6 MB) Facebook Twitter Google+ NCheck Version 3.1.13 is released. December 08, 2016 Internal release In this release, we have added absentee report and late check-out reports. New report scheduling feature is also added in this release. Productivity report and IP camera integration are improved. Facebook Twitter Google+ NCheck Version 3.1.12 is released. November 25, 2016 Internal release In this release, we have integrated SDK fix to solve IP camera issues. A new feature to schedule exporting report is added. Also multiple location restrictions related issues are also fixed. We have now enabled face identification start on keyboard, RFID or Barcode event. A fix has been added to disable NdmModules to prevent memory leaks. Facebook Twitter Google+ NCheck Version 3.1.11 is released. November 09, 2016 (Update provided on January 25, 2017) Public release In this release, we have fixed barcode scanner id reset issue when editing user details. Also a memory leak on camera capture window was fixed. Control panel settings window resize issues in lower resolutions were also fixed now. IP camera issue related to media format change was resolved and Mobotix RFID camera support was improved. Facebook Twitter Google+ NCheck Version 3.1.10 is released. October 28, 2016 Public release In this release, we have fixed documentation issues of some re-branded versions. In Web UI work hour reports, date time issue and separate password for login issues are fixed with this release. Database upgrade issues and first email sending issues are also fixed. Facebook Twitter Google+ NCheck Cloud: The cloud attendance management solution is released to public. October 19, 2016 Public release NCheck team is pleased to announce that the new Cloud attendance management solution with biometric time and attendance control, \"NCheck Cloud\" is released to public. NCheck Cloud, cloud biometric attendance management and control system starts with completely free without any obligation up to 5 employees. Visit cloud.ncheck.net and subscribe to free cloud attendance management system account and explore our real time cloud based time and attendance management system. Facebook Twitter Google+ NCheck Version 3.1.9 is released. October 18, 2016 Internal release In this release, we have introduced a new \"productivity report\" feature. Capability of import and export user groups and shifts is included in this release. Also we have included location bypass option for location restriction, for both users and groups. When this option is enabled, approximate distance from the location is added to event log report. Facebook Twitter Google+ India Steel selects NCheck Bio Attendance for their Vilnius Office September 30, 2016 India Steel has started using NCheck Bio Attendance for their Vilnius, Lithuania office to track employee attendance. Facebook Twitter Google+ NCheck Bio Attendance supports Saral Infotech S700 Android tablet September 28, 2016 Neurotechnology, a pioneer in biometric algorithms & software development has partnered with Saral Infotech who brings an Advanced Technology hardware product solutions on Biometric fingerprint readers, IRIS and face based Tablet PCs, Handhelds for office and field operations. Saral S700 Android tablet is one stop solution for all type of Biometric data capturing & verification. Organizations can use S700 Tablet PC with NCheck Bio Attendance for Visitor Management, Access Controls and Time & Attendance as a more cost-effective solution. Facebook Twitter Google+ NCheck Version 3.1.8 is released. September 27, 2016 Internal release In this release, employee auto check out option has been improved to allow employee auto check out at end of the work shift/roster. Application feedback option are also enhanced by introducing a new feature to play system beep when face is detected. A new daily backup option has also been added. New NCheck Bio Attendance windows application needs Microsoft .NET 4.6 version and provides enhanced .NET features and security. Facebook Twitter Google+ ChangeLog for NCheck Bio Attendance 3.0/3.1/4.0 News December 09, 2016 December 08, 2016 November 25, 2016 November 09, 2016 October 28, 2016 October 19, 2016 October 18, 2016 September 30, 2016 September 28, 2016 September 27, 2016 For more information, please read the « 1 2 3 4 5 6 7 8 » NCheck Bio Attendance represented IFSEC Expo 2016, New Delhi. IFSEC Global is the pre-eminent authority on the global security and fire industry. IFSEC-India 2016, was recently held at Pragati Maidan, New Delhi, India organized by UBM India to bring product and solutions providers to the clients to meet their objectives through thought leadership, product & solution showcases and year round networking. NCheck Bio Attendance 3.1 was promoted in the IFSEC-India, 2016 expo. Download the brochure distributed at IFSEC Expo. (PDF, 1.6 MB) NCheck Version 3.1.13 is released. NCheck Version 3.1.12 is released. NCheck Version 3.1.11 is released. NCheck Version 3.1.10 is released. NCheck Cloud: The cloud attendance management solution is released to public. NCheck Version 3.1.9 is released. India Steel selects NCheck Bio Attendance for their Vilnius Office NCheck Bio Attendance supports Saral Infotech S700 Android tablet NCheck Version 3.1.8 is released. ChangeLog for NCheck Bio Attendance 3.0/3.1/4.0 For more information, please read the"
  ]
}