{
  "company": "www.openbiometricsinitiative.org",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 4
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.3333333333333333,
    "framing_market": 0.6666666666666666,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "1": 4
    }
  },
  "sample_docs": [
    "What is the Open Biometrics Initiative? The Open Biometrics Initiative (OBI) is an open source project and forum managed by ImageWare Systems, but available for inclusion by anyone participating in the open source community. The goal of the OBI is to advance the current state of the art and product by releasing biometrics technologies as open source for closer collaboration with the public, private, and academic sectors, and to facilitate the design and creation of new biometric technologies that currently are or will become industry standards. As a software developer, you can incorporate proven technologies that implement industry standards for identity management and biometric interoperability. As a participant in the OBI, you can help drive those standards and advance biometric identity management technologies. It is our desire to create an open community where biometric technologies can thrive, grow, and provide competitive advantage to its participants. to download for more information or support to learn how to participate Copyright ImageWare Systems, Inc.",
    "OpenEBTS now available for 32- and 64-bit Windows and Linux. A beta version for Android is also available. Read about it here. What is the Open Biometrics Initiative? The OBI is an open source project with the goal of advancing biometrics identity management standards and technologies. Click below to download source code projects that are managed within the OBI. This includes the OpenEBTS and the OpenM1 libraries. Are you interested in implementing OBI technologies within your applications or need help doing so? Read the documentation or join in the support discussions. Want to help advance biometric technologies by joining the OBI? Click below to find out how. Copyright ImageWare Systems, Inc.",
    "OpenEBTS now available for 32- and 64-bit Windows and Linux. A beta version for Android is also available. Read about it here. What is the Open Biometrics Initiative? The OBI is an open source project with the goal of advancing biometrics identity management standards and technologies. Click below to download source code projects that are managed within the OBI. This includes the OpenEBTS and the OpenM1 libraries. Are you interested in implementing OBI technologies within your applications or need help doing so? Read the documentation or join in the support discussions. Want to help advance biometric technologies by joining the OBI? Click below to find out how. Copyright ImageWare Systems, Inc.",
    "ImageWare Creates Open Source Biometrics Initiative SAN DIEGO, Apr 15, 2010 (GlobeNewswire via COMTEX) -- ImageWare Systems, Inc. (Pink Sheets:IWSY) announced today that it has created the Open Biometrics Initiative for the advancement of biometrics technologies in the open source community. The Open Biometrics Initiative (OBI) is an open source project and forum managed by ImageWare Systems, but available for inclusion by anyone participating in the open source community. The first library to be released into the Open Biometrics Initiative is OpenEBTS, an application programming interface for the management of Electronic Biometric Transmission Specification (EBTS) data. EBTS is an open specification used by government agencies for the management of biometric data. The EBTS standard was created and is managed by the National Institute of Standards and Technology (NIST), and has been adopted globally as the way biometric data is managed between software applications. OpenEBTS allows developers to quickly and easily add EBTS functionality in their applications. \"Companies such as Microsoft, Oracle and IBM have been active in promoting the open source community,\" said Jim Miller, IWS Chairman and CEO. \"The goal of the Open Biometrics Initiative sponsored by ImageWare is to advance the current state of the art and product by releasing certain elements of ImageWare's technology as open source for closer collaboration with the public, private and academic sectors while still maintaining all of our other proprietary technology. ImageWare will gain access to the open source communities contributions to advance our technology faster and cheaper than we could achieve through internal resources. In addition, as our open source user community expands, the size of the potential market which can benefit from proprietary extensions to our open source technology also expands.\" \"Open Source is a logical choice for us to work with other research groups, vendors and government agencies using biometrics. We want to facilitate the design and creation of new biometric technologies that currently are or will become industry standards,\" said David Harding, IWS Chief Technical Officer. \"There are a number of defined standards in the industry and the technologies required to support those standards are becoming commoditized. However, access to and implementation of such technologies can be cost prohibitive, which limits interoperability between products. This is a serious problem facing not only the software development industry, but the biometrics community as a whole. Open source technologies that provide specific capabilities have been proven to advance standards and interoperability as well as give software developers the ability to create powerful products and solutions that are competitively priced.\" \"With OpenEBTS, adding biometrics interoperability in software has never been easier or more cost effective,\" said Harding. \"The more software applications that incorporate the EBTS standard, the more options customers have in choosing the right technologies. It also helps vendors to create meaningful partnerships and product integrations. It is a win-win for everyone.\" The Open Biometrics Initiative, including the OpenEBTS library, is available on SourceForge.net, a popular open source project management and distribution portal, which can be found on the web at http://www.sourceforge.net keywords \"Open Biometrics Initiative\". About ImageWare Systems, Inc. ImageWare Systems, Inc. is a leading developer of identity management solutions, providing biometric, secure credential and law enforcement technologies. Scalable for worldwide deployment, the Company's biometric product line includes a multi-biometric engine that is hardware and algorithm independent, enabling the enrollment and management of unlimited population sizes. ImageWare's identification products are used to manage and issue secure credentials including national IDs, passports, driver licenses, smart cards and access control credentials. ImageWare's digital booking products provide law enforcement with integrated mug shot, fingerprint Livescan and investigative capabilities. ImageWare is headquartered in San Diego, with offices in Portland, OR, Washington DC and Canada. For more information visit www.iwsinc.com . This news release may contain forward-looking statements made pursuant to the \"safe harbor'' provisions of the Private Securities Litigation Reform Act of 1995. While these statements are meant to convey to the public the company's progress, business opportunities and growth prospects, readers are cautioned that such forward-looking statements represent management's opinion. While management believes such representation to be true and accurate based on the information available to the company, actual results may differ materially from those described. The company's operations and business prospects are always subject to risks and uncertainties. Important facts that may cause actual results to differ are set forth in the company's periodic filings with the U.S. Securities and Exchange Commission. SOURCE: ImageWare Systems Inc. CONTACT: ImageWare Systems, Inc. David Harding (503) 353-8064 Copyright ImageWare Systems, Inc."
  ]
}