{
  "company": "www.accelrobotics.com",
  "dominant_topics": [
    6
  ],
  "topic_counts": {
    "6": 11
  },
  "topic_descriptions": {
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 11
  },
  "topic_timeline": {
    "20": {
      "6": 11
    }
  },
  "sample_docs": [
    "The Future of Convenience. Delivered. The World's First Intelligent Commerce Network Convenience is evolving. Consumer expectations around the delivery of goods has rapidly evolved over the past several years, forcing companies to shrink delivery times from next-day down to as little as 30 minutes. The overwhelming demand for this service has ushered in new opportunities to transform traditional e-commerce delivery into an always-on, always-available, concept called intelligent commerce. Accel Robotics is powering the world's most efficient intelligent commerce network, combining 24/7 checkout-free shopping with ultrafast, on-demand delivery to meet consumers' rapidly evolving expectations. Traditional models of convenient commerce are inefficient. Traditional commerce models rely heavily on costly labor, legacy warehousing and inventory technologies, and environmentally damaging logistics. By deploying proprietary computer vision technology and machine learning-powered capabilities across a network of automated stores, we're transforming intelligent commerce into a modern, scalable, and environmentally sustainable business. Solutions The Ultimate in Convenience We're bringing convenience closer to consumers with a network of tech-enabled store formats. Our efficient network model revolutionizes traditional delivery economics by dramatically reducing cost per order with low Capex, faster and more accurate order fulfillment, high engagement and retention, and a distributed labor force across an entire network of stores. 01 Hub Store Hub Stores are a key component to making intelligent commerce profitable. With our AI perception and patented hardware system, we eliminate the need for traditional checkout duties, freeing employees to service ultrafast delivery to customers while in-store shoppers enjoy the convenience of checkout-free shopping. Hub stores are flexible in size, optimally suited for shoppable inventory space, and perfect for existing or new property buildouts. Designed as central distribution nodes for a networked commerce platform, Hub Stores fulfill orders to customers in the surrounding area and serve as inventory distribution centers for adjacent satellite stores. In addition, Hub stores provide an expanded selection of merchandise for delivery beyond what is available in the shoppable space. 02 Satellite Store Satellite Stores feature a modular design and smaller footprint to fit into spaces not suitable for a full walk-in experience. The Satellite shopping experience is superior to traditional vending machines with a full selection of grocery items and the ability to support natural shopping behaviors like picking up items and putting them back, and shopping for multiple items at one time. 03 Optimized Local Fulfillment Our next-generation micro-fulfillment centers (MFCs) are strategically-located sites that extend our proprietary delivery service to a broader audience of shoppers in urban centers with an expanded catalog of additional food and grocery inventory. Our MFCs operate on AR's proprietary computer vision-powered software and hardware system and set a new industry standard of performance by increasing the accuracy and speed of order fulfillment with AI-powered instantaneous inventory knowledge, space optimization, and route planning. Case Study Say Hello to Valet Market Introducing the world's first 24/7 checkout-free store with ultrafast delivery, Valet Market . Valet Market is the best way to experience the future of convenience. Valet Markets are embedded in residential communities and use our proprietary technology to provide 24/7, checkout-free access to your favorite food, drink, and daily essentials needs. Because Valet Markets are checkout-free, our store associates can offer lightning-fast Last Step™ delivery from the store to your door in a flash. Accurately Understanding the Position of People and Products in Space The core of our autonomous store technology. Accurately understanding the position of people and products in space is the key to unlocking profitable economics while maximizing customer satisfaction. Our AI platform uses advanced machine learning and edge computing to track people, products, and their interactions in a defined space. With this real-time insight, we have the capability to accurately plan inventory selection, optimize store layouts, create hyper-efficient delivery routes, and make sure our staff is tending to the most important tasks, all in an effort to give the customer the best, most hassle-free experience possible. Overhead Camera Tracking System Our system tracks the movement of people in dense, crowded shopping environments using a modular overhead camera system. Designed with privacy in mind, our system doesn't use facial recognition or any personally identifiable information. Watch Video Innovative Shelf Sensing Technology Each shelf houses cameras and various sensors to track what items have been picked up and put back, ensuring that merchandise is accurately attributed to shoppers while generating rich product-level behavioral data. Watch Video Rapid Product Onboarding Our patented Onboarding Box simplifies and accelerates the process of bringing items into automated stores. At the press of a button, our Onboarding Box captures hundreds of images in 360 degrees for AI training and in-store recognition while generating catalog-ready product images, weights, and dimensions. Store Management Platform A comprehensive suite of solutions for back-office management of automated stores. From store setup, configurations, and dynamic planograms, to store health, sales analytics, and much more. Company A World-Class Global Team Building the Future of Commerce Accel Robotics has a world-class full-stack team of over 85+ professionals specializing in computer vision, artificial intelligence, product design, systems engineering, and software development. Learn About Careers Ready to experience the future of commerce for yourself? Get in Touch The future of commerce has never been more clear. See it for yourself. San Diego Headquarters 9160 Kearny Villa Ct San Diego, California 92123 General Inquiries info@accelrobotics.com Press Inquiries press@accelrobotics.com Send Us a Message Thank you for your message. We'll get back to you shortly Close The Future of Convenience. Delivered. The Future of Convenience. Delivered. The World's First Intelligent Commerce Network Convenience is evolving. Consumer expectations around the delivery of goods has rapidly evolved over the past several years, forcing companies to shrink delivery times from next-day down to as little as 30 minutes. The overwhelming demand for this service has ushered in new opportunities to transform traditional e-commerce delivery into an always-on, always-available, concept called intelligent commerce. Accel Robotics is powering the world's most efficient intelligent commerce network, combining 24/7 checkout-free shopping with ultrafast, on-demand delivery to meet consumers' rapidly evolving expectations. Traditional models of convenient commerce are inefficient. Traditional commerce models rely heavily on costly labor, legacy warehousing and inventory technologies, and environmentally damaging logistics. By deploying proprietary computer vision technology and machine learning-powered capabilities across a network of automated stores, we're transforming intelligent commerce into a modern, scalable, and environmentally sustainable business. The World's First Intelligent Commerce Network Consumer expectations around the delivery of goods has rapidly evolved over the past several years, forcing companies to shrink delivery times from next-day down to as little as 30 minutes. The overwhelming demand for this service has ushered in new opportunities to transform traditional e-commerce delivery into an always-on, always-available, concept called intelligent commerce. Accel Robotics is powering the world's most efficient intelligent commerce network, combining 24/7 checkout-free shopping with ultrafast, on-demand delivery to meet consumers' rapidly evolving expectations. Traditional models of convenient commerce are inefficient. Traditional commerce models rely heavily on costly labor, legacy warehousing and inventory technologies, and environmentally damaging logistics. By deploying proprietary computer vision technology and machine learning-powered capabilities across a network of automated stores, we're transforming intelligent commerce into a modern, scalable, and environmentally sustainable business. Solutions The Ultimate in Convenience We're bringing convenience closer to consumers with a network of tech-enabled store formats. Our efficient network model revolutionizes traditional delivery economics by dramatically reducing cost per order with low Capex, faster and more accurate order fulfillment, high engagement and retention, and a distributed labor force across an entire network of stores. The Ultimate in Convenience We're bringing convenience closer to consumers with a network of tech-enabled store formats. Our efficient network model revolutionizes traditional delivery economics by dramatically reducing cost per order with low Capex, faster and more accurate order fulfillment, high engagement and retention, and a distributed labor force across an entire network of stores. 01 Hub Store Hub Stores are a key component to making intelligent commerce profitable. With our AI perception and patented hardware system, we eliminate the need for traditional checkout duties, freeing employees to service ultrafast delivery to customers while in-store shoppers enjoy the convenience of checkout-free shopping. Hub stores are flexible in size, optimally suited for shoppable inventory space, and perfect for existing or new property buildouts. Designed as central distribution nodes for a networked commerce platform, Hub Stores fulfill orders to customers in the surrounding area and serve as inventory distribution centers for adjacent satellite stores. In addition, Hub stores provide an expanded selection of merchandise for delivery beyond what is available in the shoppable space. Hub Stores are a key component to making intelligent commerce profitable. With our AI perception and patented hardware system, we eliminate the need for traditional checkout duties, freeing employees to service ultrafast delivery to customers while in-store shoppers enjoy the convenience of checkout-free shopping. Hub stores are flexible in size, optimally suited for shoppable inventory space, and perfect for existing or new property buildouts. Designed as central distribution nodes for a networked commerce platform, Hub Stores fulfill orders to customers in the surrounding area and serve as inventory distribution centers for adjacent satellite stores. In addition, Hub stores provide an expanded selection of merchandise for delivery beyond what is available in the shoppable space. 02 Satellite Store Satellite Stores feature a modular design and smaller footprint to fit into spaces not suitable for a full walk-in experience. The Satellite shopping experience is superior to traditional vending machines with a full selection of grocery items and the ability to support natural shopping behaviors like picking up items and putting them back, and shopping for multiple items at one time. Satellite Stores feature a modular design and smaller footprint to fit into spaces not suitable for a full walk-in experience. The Satellite shopping experience is superior to traditional vending machines with a full selection of grocery items and the ability to support natural shopping behaviors like picking up items and putting them back, and shopping for multiple items at one time. 03 Optimized Local Fulfillment Our next-generation micro-fulfillment centers (MFCs) are strategically-located sites that extend our proprietary delivery service to a broader audience of shoppers in urban centers with an expanded catalog of additional food and grocery inventory. Our MFCs operate on AR's proprietary computer vision-powered software and hardware system and set a new industry standard of performance by increasing the accuracy and speed of order fulfillment with AI-powered instantaneous inventory knowledge, space optimization, and route planning. Our next-generation micro-fulfillment centers (MFCs) are strategically-located sites that extend our proprietary delivery service to a broader audience of shoppers in urban centers with an expanded catalog of additional food and grocery inventory. Our MFCs operate on AR's proprietary computer vision-powered software and hardware system and set a new industry standard of performance by increasing the accuracy and speed of order fulfillment with AI-powered instantaneous inventory knowledge, space optimization, and route planning. Case Study Say Hello to Valet Market Introducing the world's first 24/7 checkout-free store with ultrafast delivery, Valet Market . Valet Market is the best way to experience the future of convenience. Valet Markets are embedded in residential communities and use our proprietary technology to provide 24/7, checkout-free access to your favorite food, drink, and daily essentials needs. Because Valet Markets are checkout-free, our store associates can offer lightning-fast Last Step™ delivery from the store to your door in a flash. Say Hello to Valet Market Introducing the world's first 24/7 checkout-free store with ultrafast delivery, Valet Market . Valet Market is the best way to experience the future of convenience. Valet Markets are embedded in residential communities and use our proprietary technology to provide 24/7, checkout-free access to your favorite food, drink, and daily essentials needs. Because Valet Markets are checkout-free, our store associates can offer lightning-fast Last Step™ delivery from the store to your door in a flash. Accurately Understanding the Position of People and Products in Space The core of our autonomous store technology. Accurately understanding the position of people and products in space is the key to unlocking profitable economics while maximizing customer satisfaction. Our AI platform uses advanced machine learning and edge computing to track people, products, and their interactions in a defined space. With this real-time insight, we have the capability to accurately plan inventory selection, optimize store layouts, create hyper-efficient delivery routes, and make sure our staff is tending to the most important tasks, all in an effort to give the customer the best, most hassle-free experience possible. Accurately Understanding the Position of People and Products in Space The core of our autonomous store technology. Accurately understanding the position of people and products in space is the key to unlocking profitable economics while maximizing customer satisfaction. Our AI platform uses advanced machine learning and edge computing to track people, products, and their interactions in a defined space. With this real-time insight, we have the capability to accurately plan inventory selection, optimize store layouts, create hyper-efficient delivery routes, and make sure our staff is tending to the most important tasks, all in an effort to give the customer the best, most hassle-free experience possible. Overhead Camera Tracking System Our system tracks the movement of people in dense, crowded shopping environments using a modular overhead camera system. Designed with privacy in mind, our system doesn't use facial recognition or any personally identifiable information. Watch Video Overhead Camera Tracking System Our system tracks the movement of people in dense, crowded shopping environments using a modular overhead camera system. Designed with privacy in mind, our system doesn't use facial recognition or any personally identifiable information. Innovative Shelf Sensing Technology Each shelf houses cameras and various sensors to track what items have been picked up and put back, ensuring that merchandise is accurately attributed to shoppers while generating rich product-level behavioral data. Watch Video Innovative Shelf Sensing Technology Each shelf houses cameras and various sensors to track what items have been picked up and put back, ensuring that merchandise is accurately attributed to shoppers while generating rich product-level behavioral data. Rapid Product Onboarding Our patented Onboarding Box simplifies and accelerates the process of bringing items into automated stores. At the press of a button, our Onboarding Box captures hundreds of images in 360 degrees for AI training and in-store recognition while generating catalog-ready product images, weights, and dimensions. Our patented Onboarding Box simplifies and accelerates the process of bringing items into automated stores. At the press of a button, our Onboarding Box captures hundreds of images in 360 degrees for AI training and in-store recognition while generating catalog-ready product images, weights, and dimensions. Store Management Platform A comprehensive suite of solutions for back-office management of automated stores. From store setup, configurations, and dynamic planograms, to store health, sales analytics, and much more. A comprehensive suite of solutions for back-office management of automated stores. From store setup, configurations, and dynamic planograms, to store health, sales analytics, and much more. Company A World-Class Global Team Building the Future of Commerce Accel Robotics has a world-class full-stack team of over 85+ professionals specializing in computer vision, artificial intelligence, product design, systems engineering, and software development. Learn About Careers A World-Class Global Team Building the Future of Commerce Accel Robotics has a world-class full-stack team of over 85+ professionals specializing in computer vision, artificial intelligence, product design, systems engineering, and software development. Ready to experience the future of commerce for yourself? Ready to experience the future of commerce for yourself? Get in Touch The future of commerce has never been more clear. See it for yourself. San Diego Headquarters 9160 Kearny Villa Ct San Diego, California 92123 General Inquiries info@accelrobotics.com Press Inquiries press@accelrobotics.com Send Us a Message Thank you for your message. We'll get back to you shortly Close The future of commerce has never been more clear. See it for yourself. San Diego Headquarters 9160 Kearny Villa Ct San Diego, California 92123 Send Us a Message Thank you for your message. We'll get back to you shortly Accel Robotics San Diego, CA, United States 03:21 pm Buenos Aires, Argentina 07:21 pm Tokyo, Japan 07:21 am Accel Robotics Accel Robotics",
    "Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Manager Stacy Neathery Project Manager San Diego, CA USA Tokyo Japan Buenos Aires Argentina The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement . Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Shortening the Distance Between Shoppers and Satisfaction Customers can grab what they want and go, so they can spend more time doing things they love. Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. We've partnered with leading payment providers, making identity and payments easy and secure. Get a detailed view of all your store locations with key insights to measure and increase performance. With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Manager Stacy Neathery Project Manager Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Manager Stacy Neathery Project Manager Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Get to Know the Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! Co-Founder & Business Development Hardware & Supply Chain San Diego, CA USA Tokyo Japan Buenos Aires Argentina San Diego, CA USA Tokyo Japan Buenos Aires Argentina The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close The future of commerce has never been more clear. See it for yourself. We'll get back to you shortly Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement . Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement .",
    "Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Linda Rubalcaba Hardware Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design San Diego, CA USA Tokyo Japan Buenos Aires Argentina The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement . Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Shortening the Distance Between Shoppers and Satisfaction Customers can grab what they want and go, so they can spend more time doing things they love. Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Hassle-free Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Convenient for Retailers and Operators Our frictionless commerce platform lets you run your stores with ease and confidence, improving end-to-end operations with a better bottom line. Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. We've partnered with leading payment providers, making identity and payments easy and secure. Get a detailed view of all your store locations with key insights to measure and increase performance. With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Linda Rubalcaba Hardware Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team Get to Know the Team We are always on the lookout for talented people to join our team! Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Csaba Petre Engineering Jack Quinn Science Kaylee Feigum Operations Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Armando Armijo Systems Katie Norris Merchandising Hakan Erol Engineering Jim Kuo Science Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Alec Guthrie Science Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Tarah Skogen Operations Jonatan Flores Product Design Lakan Morales Supply Chain Linda Rubalcaba Hardware Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Christopher Lai Hardware Santiago Carmuega Applications Yohei Oka Operations Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Teamwork makes the dream work A World-Class Global Team A talented team of over 60 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Get to Know the Team We are always on the lookout for talented people to join our team! Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! Co-Founder & Business Development Hardware & Supply Chain San Diego, CA USA Tokyo Japan Buenos Aires Argentina San Diego, CA USA Tokyo Japan Buenos Aires Argentina The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close The future of commerce has never been more clear. See it for yourself. We'll get back to you shortly Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement . Accel Robotics raises $30 Million in Series A Funding Led by SoftBank Group Read the Announcement .",
    "Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Friction-free Accurate Insights AR's Aura Perception and Aura Perception Engine accurately track the position and activity of people and objects in 3D space. The Aura Perception Engine uses overhead tracking and shelf-sensing technology to create rich data that produces useful insights to better understand the habits and trends that impact business. The Aura Perception and Aura Perception Engine are low-cost, low-power solutions that are ready for scale. Contact our sales team for more information . Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Graham Hardware Gui Santana Product Design Keisha Dorsey Hardware Fernanda Izquierdo Hardware Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration San Diego, CA USA Tokyo Japan Buenos Aires Argentina Open Positions We are always on the lookout for talented people to join our team! IT Help Desk Technician San Diego, CA , Full-time Systems Administrator San Diego, CA , Full-time Senior Mechanical Engineer San Diego, CA , Full-time Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! Featured In The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Shortening the Distance Between Shoppers and Satisfaction Customers can grab what they want and go, so they can spend more time doing things they love. Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. The core of AR Autonomous Store technology. Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. We've partnered with leading payment providers, making identity and payments easy and secure. Get a detailed view of all your store locations with key insights to measure and increase performance. With live inventory updates and dynamic system messaging, remote store management is a breeze. Friction-free Accurate Insights AR's Aura Perception and Aura Perception Engine accurately track the position and activity of people and objects in 3D space. The Aura Perception Engine uses overhead tracking and shelf-sensing technology to create rich data that produces useful insights to better understand the habits and trends that impact business. The Aura Perception and Aura Perception Engine are low-cost, low-power solutions that are ready for scale. Contact our sales team for more information . Friction-free Accurate Insights AR's Aura Perception and Aura Perception Engine accurately track the position and activity of people and objects in 3D space. The Aura Perception Engine uses overhead tracking and shelf-sensing technology to create rich data that produces useful insights to better understand the habits and trends that impact business. The Aura Perception and Aura Perception Engine are low-cost, low-power solutions that are ready for scale. Contact our sales team for more information . AR's Aura Perception and Aura Perception Engine accurately track the position and activity of people and objects in 3D space. The Aura Perception Engine uses overhead tracking and shelf-sensing technology to create rich data that produces useful insights to better understand the habits and trends that impact business. The Aura Perception and Aura Perception Engine are low-cost, low-power solutions that are ready for scale. Contact our sales team for more information . Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Graham Hardware Gui Santana Product Design Keisha Dorsey Hardware Fernanda Izquierdo Hardware Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Graham Hardware Gui Santana Product Design Keisha Dorsey Hardware Fernanda Izquierdo Hardware Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! Co-Founder & Business Development Hardware & Supply Chain San Diego, CA USA Tokyo Japan Buenos Aires Argentina San Diego, CA USA Tokyo Japan Buenos Aires Argentina Open Positions We are always on the lookout for talented people to join our team! IT Help Desk Technician San Diego, CA , Full-time Systems Administrator San Diego, CA , Full-time Senior Mechanical Engineer San Diego, CA , Full-time Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! We are always on the lookout for talented people to join our team! IT Help Desk Technician San Diego, CA , Full-time San Diego, CA , Full-time San Diego, CA , Full-time Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close The future of commerce has never been more clear. See it for yourself. We'll get back to you shortly",
    "Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Stacy Neathery Project Manager San Diego, CA USA Tokyo Japan Buenos Aires Argentina Featured In The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Real solutions for the real world Fast Deployments Faster Checkout Our frictionless commerce platform enables retailers to quickly deploy stores in net new environments, allowing them to extend their reach, acquire new customers, and increase revenue. Indoor. Outdoor. Any floor. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Checkout-free Shopping Shortening the Distance Between Shoppers and Satisfaction Fast and Easy Customers can grab what they want and go, so they can spend more time doing things they love. Seamless Checkout Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Anytime Extend your operating hours 24/7 and allow people to shop when it's most convenient. Shortening the Distance Between Shoppers and Satisfaction Customers can grab what they want and go, so they can spend more time doing things they love. Products are automatically tallied as they are picked up, which means there's no more waiting in line to checkout. Extend your operating hours 24/7 and allow people to shop when it's most convenient. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. Hassle-free The core of AR Autonomous Store technology. Increase Sales Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. Payments We've partnered with leading payment providers, making identity and payments easy and secure. Advanced Analytics Get a detailed view of all your store locations with key insights to measure and increase performance. Effortless Operation With live inventory updates and dynamic system messaging, remote store management is a breeze. The core of AR Autonomous Store technology. Get more from your stores and drive sales with no lines, increased throughput, and higher satisfaction. We've partnered with leading payment providers, making identity and payments easy and secure. Get a detailed view of all your store locations with key insights to measure and increase performance. With live inventory updates and dynamic system messaging, remote store management is a breeze. Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Stacy Neathery Project Manager Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. Our Team We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! CLOSE Our Team Martin Cseh Co-Founder & Business Development Marius Buibas Co-Founder & CTO Brandon Maseda Co-Founder & CEO Jack Quinn Science Gabriel Marcos Applications Rodre Santamaria Applications Ale Avagnina Applications Ashwinlal Sreelal Software Kellie Cable Operations Soheyl Yousefisahi Science Jimmy Bhaktha Software Filip Piekniewski Software Aleksander Bapst Science Matt Walker Product Katie Norris Merchandising Hakan Erol Engineering Yohei Yamamuro Hardware & Supply Chain André Jones Hardware Lucía Moreno Systems Rom Paras Systems Samir Singh Legal Dan Zajdband Applications Lindsey Hempy Finance Jose Luis Eusebio Hardware Sajid Al Mansuri Hardware Ryan Rivera Product Design Andy Sisawang Hardware Jonatan Flores Product Design Lakan Morales Supply Chain Jean Van Lier Operations Robert Oribello Hardware Mark Wildie Software Mark Graham Hardware Gui Santana Product Design Sam Destura User Research Keisha Dorsey Hardware Fernanda Izquierdo Hardware Jose Rodriguez Hardware Prashant Surana Engineering Albert Rivera Product Design Eddie Reesman Engineering Jiro Tatsuno Business Development Santiago Carmuega Applications Helen Carroll Human Resources Marcin Kosobucki Software Ray Khorsandi Science Victoria Lombard Product Design Maureen Brock System Integration Stacy Neathery Project Manager Teamwork makes the dream work A World-Class Global Team A talented team of over 80 professionals specializing in computer vision, artificial intelligence, product design, system engineering, and software development. We are developing and deploying breakthrough artificial intelligence technology in the real world. We are always on the lookout for talented people to join our team! View Open Positions Tell us why a career or internship at Accel Robotics would excite you. Send us your resume! Co-Founder & Business Development Hardware & Supply Chain San Diego, CA USA Tokyo Japan Buenos Aires Argentina San Diego, CA USA Tokyo Japan Buenos Aires Argentina The future of commerce has never been more clear. See it for yourself. Thank you! We'll get back to you shortly Close The future of commerce has never been more clear. See it for yourself. We'll get back to you shortly"
  ]
}