{
  "company": "www.nablaworks.co.jp",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 20,
    "0": 11
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4621848739495798,
    "framing_surveillance": 0.0840336134453781,
    "framing_market": 0.453781512605042,
    "num_docs": 31
  },
  "topic_timeline": {
    "20": {
      "-1": 20,
      "0": 11
    }
  },
  "sample_docs": [
    "Service Gen-AI Presenter We provide a one-stop service from realistic model creation to AI video generation. Basic Face Recognition API 開発者様å'ã'ã®é¡\"èªè¨¼APIã''ã\"æä¾›ã—ã¾ã™ 詳細ã¯ã\"ã¡ã'‰ Gen-AI Presenter We provide a one-stop service from realistic model creation to AI video generation. Gen-AI Presenter We provide a one-stop service from realistic model creation to AI video generation. We provide a one-stop service from realistic model creation to AI video generation. Basic Face Recognition API 開発者様å'ã'ã®é¡\"èªè¨¼APIã''ã\"æä¾›ã—ã¾ã™ 詳細ã¯ã\"ã¡ã'‰ Basic Face Recognition API",
    "Nabla Works Corp. Nabla Works Corp. (the \"Company\") considers the appropriate protection of personal information to be an important part of its business operations and will therefore manage customers' personal information with the utmost care in accordance with the Act on the Protection of Personal Information (Act No. 57 of 2003; the \"Personal Information Protection Act\") and relevant laws and regulations. 1. Name of the Company Nabla Works Corp. (The address and representative are here . Hereinafter referred to as \"The Company\".) ​ 2. Definitions The used in this are as defined in the Personal Information Protection Act. ​ 3. Compliance with relevant laws, regulations, and guidelines The Company will comply with the Personal Information Protection Act, relevant laws and regulations, and relevant guidelines. 4. Collection of personal information The Company will collect personal information appropriately in accordance with laws and regulations and keep personal data accurate and current to the extent reasonably necessary for the achievement of the purpose of use, and the Company will endeavor to delete it without delay when the use of such data is no longer necessary. 5. Use of personal information The Company will not use personal information beyond the extent reasonably necessary for the achievement of the purpose of use. Except for exceptional cases under the Personal Information Protection Act, the Company will not provide personal data to any third party without the data subject's consent. If entrusting all or part of the handling of personal data to a third party, the Company will exercise necessary and appropriate supervision of the contractor to ensure the secure management of personal data. 6. Security control measures for personal data The Company will implement necessary and appropriate secure management measures for each stage of acquisition, usage, storage and the like in order to prevent the leakage, loss, damage, improper use and the like of personal data. Formulation of basic policy: To ensure the proper handling of personal data, we will formulate a basic policy pertaining to \"compliance with relevant laws, regulations, guidelines, etc.\" and \"point of contact for questions and complaints\", etc. Establishment of rules for handling personal data: Rules for handling personal data will be established for each stage of acquisition, use, storage, provision, deletion/disposal, etc., including handling methods, responsible persons/persons in charge, and their duties, etc. Organizational security control measures: In addition to appointing a person responsible for the handling of personal data, the Company shall clarify the employees who handle personal data and the scope of personal data handled by such employees, and establish a system for reporting to the person responsible in the event that the Company becomes aware of facts or signs of violation of laws or handling regulations. Personnel security control measures: Regular training will be provided to employees on matters to be considered in the handling of personal data. Physical security control measures: In the areas where personal data is handled, the Company controls the entry and exit of employees, restricts the equipment and other items they may bring into the areas, and implements measures to prevent unauthorized persons from accessing personal data. Technical security control measures: Access control is implemented to limit the scope of persons in charge and the personal databases, etc. handled. In addition, we implement mechanisms to protect information systems that handle personal data from unauthorized external access or unauthorized software. Understanding the external environment: We use cloud services to provide better services to our customers, and we may handle personal data related to our customers overseas. When handling such personal data overseas, we will implement safety management measures after understanding the systems for protection of personal information in the relevant country. 7. Disclosure, correction, cessation of use of retained personal data Upon request from the data subject, the Company will disclose, correct, cease the use of, and take other such actions in regard to retained personal data as set forth by laws and regulations and as determined by the Company. 8. Company website Please refer to the Company's site policy for the use of cookies, use of information collection modules, and the like on the Company's website.. 9. Formulation and implementation of rules on the handling of personal information In order to carry out this , the Company will formulate, make officers and employees of the Company and other relevant parties fully aware of, and implement internal rules pertaining to the handling of personal information. The Company will continually maintain and make necessary improvements to such rules. ​ 10. Application and revision of this This will apply from the date it is posted to this website and may be revised without notice when required by laws and regulations and when determined necessary by the Company. The latest policy will be posted on this website. 11. Inquiries For any inquiries, comments, complaints or the like pertaining to the handling of personal information by the Company, please contact us through the inquiry form on this website. ​ ​ Purposes of Use of Customers' Personal Information Nabla Works Corp. (the \"Company\") will use personal information (meaning personal information defined in the Personal Information Protection Act, such as name, address, date of birth, phone number, and email address) of customers for the following purposes and will not use such information for other purposes unless stipulated in laws and regulations. Customers include not only people who were in the past or are currently in a contractual relationship or trading relationship with the Company, but also those who in the future may enter into a contractual relationship or trading relationship with the Company; in the case of corporations, the personnel in charge at the corporation are also included. To deliver services of the Company (the \"Services\") To compile statistical data the use of the Services To conduct questionnaires and survey, interview pertaining to the Services including services under planning To identify customers and provide authentication services To charge fees and exercise right of the Company To maintain system of the Services (the \"System\") and respond to issues of the System To respond to inquiries from customers To distribute or display the Services information (including but not limited to advertising information) and campaign information whose advertisers are companies other than the Company to customers, and measure effect To formulate plans for and provide the Services including services under planning For raffles and delivery of prizes and goods for promotional campaigns and the like To contact to customers as necessary, including but not limited to important notices about the Services To archive any purposes set out by the Service To archive any matters supplementary and related to preceding clauses Nabla Works Corp. (\"the Company\") accepts requests for notification of the purpose of use of retained personal data (Article 32, Paragraph 2 of the Personal Information Protection Law), disclosure (Article 33, Paragraph 1 of the Personal Information Protection Law), correction, addition, deletion (Article 34, Paragraph 1 of the Personal Information Protection Law), suspension of use, deletion, suspension of provision to third parties (Article 35, Paragraph 1 and 3 of the Personal Information Protection Law) and (Article 33, Paragraph 5 of the Personal Information Protection Law). Please contact us using the inquiry form on this website. ​ The Company will promptly respond to your request in accordance with laws and regulations. Please note that there may be cases in which we are unable to respond to a request for disclosure, etc., in accordance with laws and regulations. Personal information submitted by customers when requesting disclosure, etc. of retained personal data or disclosure of records of provision to third parties will be used only to the extent necessary to respond to such requests, etc., and will be retained for the necessary period of time after response is made before being disposed of in a secure manner. Published : April 1, 2024 Nabla Works Corp. Nabla Works Corp. (the \"Company\") considers the appropriate protection of personal information to be an important part of its business operations and will therefore manage customers' personal information with the utmost care in accordance with the Act on the Protection of Personal Information (Act No. 57 of 2003; the \"Personal Information Protection Act\") and relevant laws and regulations. 1. Name of the Company Nabla Works Corp. (The address and representative are here . Hereinafter referred to as \"The Company\".) ​ 2. Definitions The used in this are as defined in the Personal Information Protection Act. ​ 3. Compliance with relevant laws, regulations, and guidelines The Company will comply with the Personal Information Protection Act, relevant laws and regulations, and relevant guidelines. 4. Collection of personal information The Company will collect personal information appropriately in accordance with laws and regulations and keep personal data accurate and current to the extent reasonably necessary for the achievement of the purpose of use, and the Company will endeavor to delete it without delay when the use of such data is no longer necessary. 5. Use of personal information The Company will not use personal information beyond the extent reasonably necessary for the achievement of the purpose of use. Except for exceptional cases under the Personal Information Protection Act, the Company will not provide personal data to any third party without the data subject's consent. If entrusting all or part of the handling of personal data to a third party, the Company will exercise necessary and appropriate supervision of the contractor to ensure the secure management of personal data. 6. Security control measures for personal data The Company will implement necessary and appropriate secure management measures for each stage of acquisition, usage, storage and the like in order to prevent the leakage, loss, damage, improper use and the like of personal data. Formulation of basic policy: To ensure the proper handling of personal data, we will formulate a basic policy pertaining to \"compliance with relevant laws, regulations, guidelines, etc.\" and \"point of contact for questions and complaints\", etc. Establishment of rules for handling personal data: Rules for handling personal data will be established for each stage of acquisition, use, storage, provision, deletion/disposal, etc., including handling methods, responsible persons/persons in charge, and their duties, etc. Organizational security control measures: In addition to appointing a person responsible for the handling of personal data, the Company shall clarify the employees who handle personal data and the scope of personal data handled by such employees, and establish a system for reporting to the person responsible in the event that the Company becomes aware of facts or signs of violation of laws or handling regulations. Personnel security control measures: Regular training will be provided to employees on matters to be considered in the handling of personal data. Physical security control measures: In the areas where personal data is handled, the Company controls the entry and exit of employees, restricts the equipment and other items they may bring into the areas, and implements measures to prevent unauthorized persons from accessing personal data. Technical security control measures: Access control is implemented to limit the scope of persons in charge and the personal databases, etc. handled. In addition, we implement mechanisms to protect information systems that handle personal data from unauthorized external access or unauthorized software. Understanding the external environment: We use cloud services to provide better services to our customers, and we may handle personal data related to our customers overseas. When handling such personal data overseas, we will implement safety management measures after understanding the systems for protection of personal information in the relevant country. 7. Disclosure, correction, cessation of use of retained personal data Upon request from the data subject, the Company will disclose, correct, cease the use of, and take other such actions in regard to retained personal data as set forth by laws and regulations and as determined by the Company. 8. Company website Please refer to the Company's site policy for the use of cookies, use of information collection modules, and the like on the Company's website.. 9. Formulation and implementation of rules on the handling of personal information In order to carry out this , the Company will formulate, make officers and employees of the Company and other relevant parties fully aware of, and implement internal rules pertaining to the handling of personal information. The Company will continually maintain and make necessary improvements to such rules. ​ 10. Application and revision of this This will apply from the date it is posted to this website and may be revised without notice when required by laws and regulations and when determined necessary by the Company. The latest policy will be posted on this website. 11. Inquiries For any inquiries, comments, complaints or the like pertaining to the handling of personal information by the Company, please contact us through the inquiry form on this website. ​ ​ Purposes of Use of Customers' Personal Information Nabla Works Corp. (the \"Company\") will use personal information (meaning personal information defined in the Personal Information Protection Act, such as name, address, date of birth, phone number, and email address) of customers for the following purposes and will not use such information for other purposes unless stipulated in laws and regulations. Customers include not only people who were in the past or are currently in a contractual relationship or trading relationship with the Company, but also those who in the future may enter into a contractual relationship or trading relationship with the Company; in the case of corporations, the personnel in charge at the corporation are also included. To deliver services of the Company (the \"Services\") To compile statistical data the use of the Services To conduct questionnaires and survey, interview pertaining to the Services including services under planning To identify customers and provide authentication services To charge fees and exercise right of the Company To maintain system of the Services (the \"System\") and respond to issues of the System To respond to inquiries from customers To distribute or display the Services information (including but not limited to advertising information) and campaign information whose advertisers are companies other than the Company to customers, and measure effect To formulate plans for and provide the Services including services under planning For raffles and delivery of prizes and goods for promotional campaigns and the like To contact to customers as necessary, including but not limited to important notices about the Services To archive any purposes set out by the Service To archive any matters supplementary and related to preceding clauses Nabla Works Corp. (\"the Company\") accepts requests for notification of the purpose of use of retained personal data (Article 32, Paragraph 2 of the Personal Information Protection Law), disclosure (Article 33, Paragraph 1 of the Personal Information Protection Law), correction, addition, deletion (Article 34, Paragraph 1 of the Personal Information Protection Law), suspension of use, deletion, suspension of provision to third parties (Article 35, Paragraph 1 and 3 of the Personal Information Protection Law) and (Article 33, Paragraph 5 of the Personal Information Protection Law). Please contact us using the inquiry form on this website. ​ The Company will promptly respond to your request in accordance with laws and regulations. Please note that there may be cases in which we are unable to respond to a request for disclosure, etc., in accordance with laws and regulations. Personal information submitted by customers when requesting disclosure, etc. of retained personal data or disclosure of records of provision to third parties will be used only to the extent necessary to respond to such requests, etc., and will be retained for the necessary period of time after response is made before being disposed of in a secure manner. Published : April 1, 2024 Nabla Works Corp. Nabla Works Corp. (the \"Company\") considers the appropriate protection of personal information to be an important part of its business operations and will therefore manage customers' personal information with the utmost care in accordance with the Act on the Protection of Personal Information (Act No. 57 of 2003; the \"Personal Information Protection Act\") and relevant laws and regulations. 1. Name of the Company Nabla Works Corp. (The address and representative are here . Hereinafter referred to as \"The Company\".) ​ 2. Definitions The used in this are as defined in the Personal Information Protection Act. ​ 3. Compliance with relevant laws, regulations, and guidelines The Company will comply with the Personal Information Protection Act, relevant laws and regulations, and relevant guidelines. 4. Collection of personal information The Company will collect personal information appropriately in accordance with laws and regulations and keep personal data accurate and current to the extent reasonably necessary for the achievement of the purpose of use, and the Company will endeavor to delete it without delay when the use of such data is no longer necessary. 5. Use of personal information The Company will not use personal information beyond the extent reasonably necessary for the achievement of the purpose of use. Except for exceptional cases under the Personal Information Protection Act, the Company will not provide personal data to any third party without the data subject's consent. If entrusting all or part of the handling of personal data to a third party, the Company will exercise necessary and appropriate supervision of the contractor to ensure the secure management of personal data. 6. Security control measures for personal data The Company will implement necessary and appropriate secure management measures for each stage of acquisition, usage, storage and the like in order to prevent the leakage, loss, damage, improper use and the like of personal data. Formulation of basic policy: To ensure the proper handling of personal data, we will formulate a basic policy pertaining to \"compliance with relevant laws, regulations, guidelines, etc.\" and \"point of contact for questions and complaints\", etc. Establishment of rules for handling personal data: Rules for handling personal data will be established for each stage of acquisition, use, storage, provision, deletion/disposal, etc., including handling methods, responsible persons/persons in charge, and their duties, etc. Organizational security control measures: In addition to appointing a person responsible for the handling of personal data, the Company shall clarify the employees who handle personal data and the scope of personal data handled by such employees, and establish a system for reporting to the person responsible in the event that the Company becomes aware of facts or signs of violation of laws or handling regulations. Personnel security control measures: Regular training will be provided to employees on matters to be considered in the handling of personal data. Physical security control measures: In the areas where personal data is handled, the Company controls the entry and exit of employees, restricts the equipment and other items they may bring into the areas, and implements measures to prevent unauthorized persons from accessing personal data. Technical security control measures: Access control is implemented to limit the scope of persons in charge and the personal databases, etc. handled. In addition, we implement mechanisms to protect information systems that handle personal data from unauthorized external access or unauthorized software. Understanding the external environment: We use cloud services to provide better services to our customers, and we may handle personal data related to our customers overseas. When handling such personal data overseas, we will implement safety management measures after understanding the systems for protection of personal information in the relevant country. 7. Disclosure, correction, cessation of use of retained personal data Upon request from the data subject, the Company will disclose, correct, cease the use of, and take other such actions in regard to retained personal data as set forth by laws and regulations and as determined by the Company. 8. Company website Please refer to the Company's site policy for the use of cookies, use of information collection modules, and the like on the Company's website.. 9. Formulation and implementation of rules on the handling of personal information In order to carry out this , the Company will formulate, make officers and employees of the Company and other relevant parties fully aware of, and implement internal rules pertaining to the handling of personal information. The Company will continually maintain and make necessary improvements to such rules. ​ 10. Application and revision of this This will apply from the date it is posted to this website and may be revised without notice when required by laws and regulations and when determined necessary by the Company. The latest policy will be posted on this website. 11. Inquiries For any inquiries, comments, complaints or the like pertaining to the handling of personal information by the Company, please contact us through the inquiry form on this website. ​ ​ Purposes of Use of Customers' Personal Information Nabla Works Corp. (the \"Company\") will use personal information (meaning personal information defined in the Personal Information Protection Act, such as name, address, date of birth, phone number, and email address) of customers for the following purposes and will not use such information for other purposes unless stipulated in laws and regulations. Customers include not only people who were in the past or are currently in a contractual relationship or trading relationship with the Company, but also those who in the future may enter into a contractual relationship or trading relationship with the Company; in the case of corporations, the personnel in charge at the corporation are also included. To deliver services of the Company (the \"Services\") To compile statistical data the use of the Services To conduct questionnaires and survey, interview pertaining to the Services including services under planning To identify customers and provide authentication services To charge fees and exercise right of the Company To maintain system of the Services (the \"System\") and respond to issues of the System To respond to inquiries from customers To distribute or display the Services information (including but not limited to advertising information) and campaign information whose advertisers are companies other than the Company to customers, and measure effect To formulate plans for and provide the Services including services under planning For raffles and delivery of prizes and goods for promotional campaigns and the like To contact to customers as necessary, including but not limited to important notices about the Services To archive any purposes set out by the Service To archive any matters supplementary and related to preceding clauses Nabla Works Corp. (\"the Company\") accepts requests for notification of the purpose of use of retained personal data (Article 32, Paragraph 2 of the Personal Information Protection Law), disclosure (Article 33, Paragraph 1 of the Personal Information Protection Law), correction, addition, deletion (Article 34, Paragraph 1 of the Personal Information Protection Law), suspension of use, deletion, suspension of provision to third parties (Article 35, Paragraph 1 and 3 of the Personal Information Protection Law) and (Article 33, Paragraph 5 of the Personal Information Protection Law). Please contact us using the inquiry form on this website. ​ The Company will promptly respond to your request in accordance with laws and regulations. Please note that there may be cases in which we are unable to respond to a request for disclosure, etc., in accordance with laws and regulations. Personal information submitted by customers when requesting disclosure, etc. of retained personal data or disclosure of records of provision to third parties will be used only to the extent necessary to respond to such requests, etc., and will be retained for the necessary period of time after response is made before being disposed of in a secure manner. Published : April 1, 2024 Nabla Works Corp. Nabla Works Corp. (the \"Company\") considers the appropriate protection of personal information to be an important part of its business operations and will therefore manage customers' personal information with the utmost care in accordance with the Act on the Protection of Personal Information (Act No. 57 of 2003; the \"Personal Information Protection Act\") and relevant laws and regulations. 1. Name of the Company Nabla Works Corp. (The address and representative are here . Hereinafter referred to as \"The Company\".) 2. Definitions The used in this are as defined in the Personal Information Protection Act. 3. Compliance with relevant laws, regulations, and guidelines The Company will comply with the Personal Information Protection Act, relevant laws and regulations, and relevant guidelines. 4. Collection of personal information The Company will collect personal information appropriately in accordance with laws and regulations and keep personal data accurate and current to the extent reasonably necessary for the achievement of the purpose of use, and the Company will endeavor to delete it without delay when the use of such data is no longer necessary. 5. Use of personal information The Company will not use personal information beyond the extent reasonably necessary for the achievement of the purpose of use. Except for exceptional cases under the Personal Information Protection Act, the Company will not provide personal data to any third party without the data subject's consent. If entrusting all or part of the handling of personal data to a third party, the Company will exercise necessary and appropriate supervision of the contractor to ensure the secure management of personal data. 6. Security control measures for personal data The Company will implement necessary and appropriate secure management measures for each stage of acquisition, usage, storage and the like in order to prevent the leakage, loss, damage, improper use and the like of personal data. Formulation of basic policy: To ensure the proper handling of personal data, we will formulate a basic policy pertaining to \"compliance with relevant laws, regulations, guidelines, etc.\" and \"point of contact for questions and complaints\", etc. Formulation of basic policy: To ensure the proper handling of personal data, we will formulate a basic policy pertaining to \"compliance with relevant laws, regulations, guidelines, etc.\" and \"point of contact for questions and complaints\", etc. Establishment of rules for handling personal data: Rules for handling personal data will be established for each stage of acquisition, use, storage, provision, deletion/disposal, etc., including handling methods, responsible persons/persons in charge, and their duties, etc. Establishment of rules for handling personal data: Rules for handling personal data will be established for each stage of acquisition, use, storage, provision, deletion/disposal, etc., including handling methods, responsible persons/persons in charge, and their duties, etc. Organizational security control measures: In addition to appointing a person responsible for the handling of personal data, the Company shall clarify the employees who handle personal data and the scope of personal data handled by such employees, and establish a system for reporting to the person responsible in the event that the Company becomes aware of facts or signs of violation of laws or handling regulations. Organizational security control measures: In addition to appointing a person responsible for the handling of personal data, the Company shall clarify the employees who handle personal data and the scope of personal data handled by such employees, and establish a system for reporting to the person responsible in the event that the Company becomes aware of facts or signs of violation of laws or handling regulations. Personnel security control measures: Regular training will be provided to employees on matters to be considered in the handling of personal data. Personnel security control measures: Regular training will be provided to employees on matters to be considered in the handling of personal data. Physical security control measures: In the areas where personal data is handled, the Company controls the entry and exit of employees, restricts the equipment and other items they may bring into the areas, and implements measures to prevent unauthorized persons from accessing personal data. Physical security control measures: In the areas where personal data is handled, the Company controls the entry and exit of employees, restricts the equipment and other items they may bring into the areas, and implements measures to prevent unauthorized persons from accessing personal data. Technical security control measures: Access control is implemented to limit the scope of persons in charge and the personal databases, etc. handled. In addition, we implement mechanisms to protect information systems that handle personal data from unauthorized external access or unauthorized software. Technical security control measures: Access control is implemented to limit the scope of persons in charge and the personal databases, etc. handled. In addition, we implement mechanisms to protect information systems that handle personal data from unauthorized external access or unauthorized software. Understanding the external environment: We use cloud services to provide better services to our customers, and we may handle personal data related to our customers overseas. When handling such personal data overseas, we will implement safety management measures after understanding the systems for protection of personal information in the relevant country. Understanding the external environment: We use cloud services to provide better services to our customers, and we may handle personal data related to our customers overseas. When handling such personal data overseas, we will implement safety management measures after understanding the systems for protection of personal information in the relevant country. 7. Disclosure, correction, cessation of use of retained personal data Upon request from the data subject, the Company will disclose, correct, cease the use of, and take other such actions in regard to retained personal data as set forth by laws and regulations and as determined by the Company. 8. Company website Please refer to the Company's site policy for the use of cookies, use of information collection modules, and the like on the Company's website.. 9. Formulation and implementation of rules on the handling of personal information In order to carry out this , the Company will formulate, make officers and employees of the Company and other relevant parties fully aware of, and implement internal rules pertaining to the handling of personal information. The Company will continually maintain and make necessary improvements to such rules. 10. Application and revision of this This will apply from the date it is posted to this website and may be revised without notice when required by laws and regulations and when determined necessary by the Company. The latest policy will be posted on this website. 11. Inquiries For any inquiries, comments, complaints or the like pertaining to the handling of personal information by the Company, please contact us through the inquiry form on this website. Purposes of Use of Customers' Personal Information Nabla Works Corp. (the \"Company\") will use personal information (meaning personal information defined in the Personal Information Protection Act, such as name, address, date of birth, phone number, and email address) of customers for the following purposes and will not use such information for other purposes unless stipulated in laws and regulations. Customers include not only people who were in the past or are currently in a contractual relationship or trading relationship with the Company, but also those who in the future may enter into a contractual relationship or trading relationship with the Company; in the case of corporations, the personnel in charge at the corporation are also included. To deliver services of the Company (the \"Services\") To deliver services of the Company (the \"Services\") To compile statistical data the use of the Services To compile statistical data the use of the Services To conduct questionnaires and survey, interview pertaining to the Services including services under planning To conduct questionnaires and survey, interview pertaining to the Services including services under planning To identify customers and provide authentication services To identify customers and provide authentication services To charge fees and exercise right of the Company To charge fees and exercise right of the Company To maintain system of the Services (the \"System\") and respond to issues of the System To maintain system of the Services (the \"System\") and respond to issues of the System To respond to inquiries from customers To respond to inquiries from customers To distribute or display the Services information (including but not limited to advertising information) and campaign information whose advertisers are companies other than the Company to customers, and measure effect To distribute or display the Services information (including but not limited to advertising information) and campaign information whose advertisers are companies other than the Company to customers, and measure effect To formulate plans for and provide the Services including services under planning To formulate plans for and provide the Services including services under planning For raffles and delivery of prizes and goods for promotional campaigns and the like For raffles and delivery of prizes and goods for promotional campaigns and the like To contact to customers as necessary, including but not limited to important notices about the Services To contact to customers as necessary, including but not limited to important notices about the Services To archive any purposes set out by the Service To archive any purposes set out by the Service To archive any matters supplementary and related to preceding clauses To archive any matters supplementary and related to preceding clauses Nabla Works Corp. (\"the Company\") accepts requests for notification of the purpose of use of retained personal data (Article 32, Paragraph 2 of the Personal Information Protection Law), disclosure (Article 33, Paragraph 1 of the Personal Information Protection Law), correction, addition, deletion (Article 34, Paragraph 1 of the Personal Information Protection Law), suspension of use, deletion, suspension of provision to third parties (Article 35, Paragraph 1 and 3 of the Personal Information Protection Law) and (Article 33, Paragraph 5 of the Personal Information Protection Law). Please contact us using the inquiry form on this website. The Company will promptly respond to your request in accordance with laws and regulations. Please note that there may be cases in which we are unable to respond to a request for disclosure, etc., in accordance with laws and regulations. Personal information submitted by customers when requesting disclosure, etc. of retained personal data or disclosure of records of provision to third parties will be used only to the extent necessary to respond to such requests, etc., and will be retained for the necessary period of time after response is made before being disposed of in a secure manner. Published : April 1, 2024",
    "Product & Service AR Solution Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. Face Recognition Solution Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Video Analytics We provide solutions for staff management and analysis of customer numbers and trends in offices and stores using human detection and facial recognition technologies. Gen-AI Presenter Our Gen-AI Presenter is a service that creates videos, such as presentations, using models generated with generative AI. We provide a one-stop solution, from model creation to video generation. Nabla Vision Platform We provide a powerful and highly versatile cloud API designed for developers who need advanced video- and image-based analysis features, including facial recognition, action detection, and object recognition. AR Solution Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. AR Solution Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. Face Recognition Solution Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Face Recognition Solution Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Video Analytics We provide solutions for staff management and analysis of customer numbers and trends in offices and stores using human detection and facial recognition technologies. Video Analytics We provide solutions for staff management and analysis of customer numbers and trends in offices and stores using human detection and facial recognition technologies. We provide solutions for staff management and analysis of customer numbers and trends in offices and stores using human detection and facial recognition technologies. Gen-AI Presenter Our Gen-AI Presenter is a service that creates videos, such as presentations, using models generated with generative AI. We provide a one-stop solution, from model creation to video generation. Gen-AI Presenter Our Gen-AI Presenter is a service that creates videos, such as presentations, using models generated with generative AI. We provide a one-stop solution, from model creation to video generation. Our Gen-AI Presenter is a service that creates videos, such as presentations, using models generated with generative AI. We provide a one-stop solution, from model creation to video generation. Nabla Vision Platform We provide a powerful and highly versatile cloud API designed for developers who need advanced video- and image-based analysis features, including facial recognition, action detection, and object recognition. Nabla Vision Platform We provide a powerful and highly versatile cloud API designed for developers who need advanced video- and image-based analysis features, including facial recognition, action detection, and object recognition. We provide a powerful and highly versatile cloud API designed for developers who need advanced video- and image-based analysis features, including facial recognition, action detection, and object recognition.",
    "#Gen-AI Presenter AI University President Delivers Multilingual Welcome Speech to New International Students Shizuoka Sangyo University At the 2025 entrance ceremony of Shizuoka Sangyo University, part of the Shinshizuoka Gakuen educational group, NablaWorks' Gen-AI Presenter welcomed international students in eight languages. President Horikawa of the university was recreated as a digital human to deliver a congratulatory speech in Japanese, Chinese, Mongolian, Burmese, Nepali, Tamil, Vietnamese, and Indonesian. The AI University President's multilingual message warmly greeted the new students, showcasing the university's commitment to diversity and inclusion. View our official announcement here. https://www.nablaworks.co.jp/en/news-1/article-14 Back to List Related Product & Service AR Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. for details Face Recognition Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. for details Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us #Gen-AI Presenter AI University President Delivers Multilingual Welcome Speech to New International Students Shizuoka Sangyo University #Gen-AI Presenter AI University President Delivers Multilingual Welcome Speech to New International Students Shizuoka Sangyo University AI University President Delivers Multilingual Welcome Speech to New International Students At the 2025 entrance ceremony of Shizuoka Sangyo University, part of the Shinshizuoka Gakuen educational group, NablaWorks' Gen-AI Presenter welcomed international students in eight languages. President Horikawa of the university was recreated as a digital human to deliver a congratulatory speech in Japanese, Chinese, Mongolian, Burmese, Nepali, Tamil, Vietnamese, and Indonesian. The AI University President's multilingual message warmly greeted the new students, showcasing the university's commitment to diversity and inclusion. View our official announcement here. https://www.nablaworks.co.jp/en/news-1/article-14 Back to List At the 2025 entrance ceremony of Shizuoka Sangyo University, part of the Shinshizuoka Gakuen educational group, NablaWorks' Gen-AI Presenter welcomed international students in eight languages. President Horikawa of the university was recreated as a digital human to deliver a congratulatory speech in Japanese, Chinese, Mongolian, Burmese, Nepali, Tamil, Vietnamese, and Indonesian. The AI University President's multilingual message warmly greeted the new students, showcasing the university's commitment to diversity and inclusion. View our official announcement here. Related Product & Service AR Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. for details Face Recognition Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. for details Related Product & Service Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us Product details, quotation requests, implementation consultations, etc. Please feel free to contact us.",
    "#Gen-AI Presenter AI Bank President and Real Bank President Co-Host at New Year's Lecture The Shizuoka Bank, Ltd. At the 2025 New Year's Lecture, co-hosted by Shizuoka Bank and the Shizuoka Institute of Economic Research, NablaWorks' Gen-AI Presenter played a central role in a unique presentation. Mr. Yagi, President of Shizuoka Bank, was transformed into a digital human using our AI technology. During the event, the real and AI presidents engaged in a dynamic dialogue, offering predictions for 2025's top products. The AI President delivered the presentation not only in Japanese but also in English, Italian, and French, impressing the audience with its multilingual capabilities and interactive performance. Process for the Gen-AI Presenter Service View our official announcement here. https://www.nablaworks.co.jp/en/news-1/article-12 Back to List Related Product & Service AR Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. for details Face Recognition Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. for details Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us #Gen-AI Presenter AI Bank President and Real Bank President Co-Host at New Year's Lecture The Shizuoka Bank, Ltd. #Gen-AI Presenter AI Bank President and Real Bank President Co-Host at New Year's Lecture The Shizuoka Bank, Ltd. AI Bank President and Real Bank President Co-Host at New Year's Lecture The Shizuoka Bank, Ltd. At the 2025 New Year's Lecture, co-hosted by Shizuoka Bank and the Shizuoka Institute of Economic Research, NablaWorks' Gen-AI Presenter played a central role in a unique presentation. Mr. Yagi, President of Shizuoka Bank, was transformed into a digital human using our AI technology. During the event, the real and AI presidents engaged in a dynamic dialogue, offering predictions for 2025's top products. The AI President delivered the presentation not only in Japanese but also in English, Italian, and French, impressing the audience with its multilingual capabilities and interactive performance. Process for the Gen-AI Presenter Service View our official announcement here. https://www.nablaworks.co.jp/en/news-1/article-12 Back to List At the 2025 New Year's Lecture, co-hosted by Shizuoka Bank and the Shizuoka Institute of Economic Research, NablaWorks' Gen-AI Presenter played a central role in a unique presentation. Mr. Yagi, President of Shizuoka Bank, was transformed into a digital human using our AI technology. During the event, the real and AI presidents engaged in a dynamic dialogue, offering predictions for 2025's top products. The AI President delivered the presentation not only in Japanese but also in English, Italian, and French, impressing the audience with its multilingual capabilities and interactive performance. Process for the Gen-AI Presenter Service View our official announcement here. Related Product & Service AR Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. for details Face Recognition Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. for details Related Product & Service Using image recognition technology, it precisely captures feature points on the face and fingers to realize a variety of AR effects such as beautiful skin effects and stamps. Using high-performance face recognition as the underlying technology, we can build a variety of face recognition services from cloud servers to the edge. Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us Product details, quotation requests, implementation consultations, etc. Please feel free to contact us. Contact Us Product details, quotation requests, implementation consultations, etc. Please feel free to contact us."
  ]
}