{
  "company": "www.kairos.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 8,
    "-1": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 8
    }
  },
  "sample_docs": [
    "Kairos is building the future of identity utility, powered by state-of-the-art face biometrics and blockchain technology. By enabling individuals to rely on their natural identity, Kairos is giving back the power of identity to consumers. With best in class face recognition, Kairos is trusted by businesses across the planet, and is now democratizing access - enabling anyone to protect their anonymity and better verify blockchain transactions. NEW RELEASE! Discover the Kairos Protocol™ for Blockchain Kairos is building the future of identity utility, powered by state-of-the-art face biometrics and blockchain technology. By enabling individuals to rely on their natural identity, Kairos is giving back the power of identity to consumers. With best in class face recognition, Kairos is trusted by businesses across the planet, and is now democratizing access - enabling anyone to protect their anonymity and better verify blockchain transactions. NEW RELEASE! Discover the Kairos Protocol™ for Blockchain Kairos is building the future of identity utility, powered by state-of-the-art face biometrics and blockchain technology. By enabling individuals to rely on their natural identity, Kairos is giving back the power of identity to consumers. With best in class face recognition, Kairos is trusted by businesses across the planet, and is now democratizing access - enabling anyone to protect their anonymity and better verify blockchain transactions. Discover the Kairos Protocol™ for Blockchain",
    "Vidigami \"The advantage we found with Kairos is in the way they expose their technology, which allowed us to apply additional intelligence for maximizing recognition results.\" - Mandy Chan, Founder & CEO Vidigami revolutionizes photo management with Kairos Vidigami, a photo management tool designed exclusively for academicians, uses Kairos Face Recognition to analyze millions of photos contributed by schools. This allows the school's faculty to manage student photos and makes processes, like sourcing photos for the yearbook and personalizing marketing materials, easier. It also gives parents the accessibility to view their child's student memories. USE CASE Search, Tag & Match INDUSTRY Digital Asset Management KEY STAT More than 20MM face images processed each month Give your customers the solution they deserve Vidigami's product offering is based on their ability to tag and sort photos to be stored for customer retrieval. Manual tagging is time-consuming and not truly scalable, so they needed face recognition capable of commercial application to handle the volume of photos to be processed. Get the benefits of speed and automation at scale Vidigami selected Kairos' Face Recognition API to handle the high volume of photos contributed to their platform. Now, students are automatically recognized and tagged saving time and creating a scalable process. Our API also allows Vidigami to process as many faces as necessary, giving their customers a simplified user experience when contributing photos or searching for them. Radically improve the discoverability of your digital assets Vidigami is currently processing over 20 million images of faces each month. The volume Kairos' face detection equips Vidigami to handle allows them to offer their customers the ability to search for users, photos, and the tags associated with any group, album or photo, with ease. \"We would be delighted to see [Kairos] continue important developments that keep them in the forefront of applied human analytics for commercial applications.\" - Mandy Chan, Founder & CEO Vidigami: Entrusting Kairos with the memories of future generations Vidigami provides schools the best place for storing and sharing school memories. Designed exclusively for schools, Vidigami provides a private and secure photo management platform for easily capturing, organizing and sharing photos with all members of their community. Vidigami \"The advantage we found with Kairos is in the way they expose their technology, which allowed us to apply additional intelligence for maximizing recognition results.\" - Mandy Chan, Founder & CEO Vidigami revolutionizes photo management with Kairos Vidigami, a photo management tool designed exclusively for academicians, uses Kairos Face Recognition to analyze millions of photos contributed by schools. This allows the school's faculty to manage student photos and makes processes, like sourcing photos for the yearbook and personalizing marketing materials, easier. It also gives parents the accessibility to view their child's student memories. USE CASE Search, Tag & Match INDUSTRY Digital Asset Management KEY STAT More than 20MM face images processed each month Give your customers the solution they deserve Vidigami's product offering is based on their ability to tag and sort photos to be stored for customer retrieval. Manual tagging is time-consuming and not truly scalable, so they needed face recognition capable of commercial application to handle the volume of photos to be processed. Get the benefits of speed and automation at scale Vidigami selected Kairos' Face Recognition API to handle the high volume of photos contributed to their platform. Now, students are automatically recognized and tagged saving time and creating a scalable process. Our API also allows Vidigami to process as many faces as necessary, giving their customers a simplified user experience when contributing photos or searching for them. Radically improve the discoverability of your digital assets Vidigami is currently processing over 20 million images of faces each month. The volume Kairos' face detection equips Vidigami to handle allows them to offer their customers the ability to search for users, photos, and the tags associated with any group, album or photo, with ease. \"We would be delighted to see [Kairos] continue important developments that keep them in the forefront of applied human analytics for commercial applications.\" - Mandy Chan, Founder & CEO Vidigami: Entrusting Kairos with the memories of future generations Vidigami provides schools the best place for storing and sharing school memories. Designed exclusively for schools, Vidigami provides a private and secure photo management platform for easily capturing, organizing and sharing photos with all members of their community. \"The advantage we found with Kairos is in the way they expose their technology, which allowed us to apply additional intelligence for maximizing recognition results.\" - Mandy Chan, Founder & CEO Vidigami revolutionizes photo management with Kairos Vidigami, a photo management tool designed exclusively for academicians, uses Kairos Face Recognition to analyze millions of photos contributed by schools. This allows the school's faculty to manage student photos and makes processes, like sourcing photos for the yearbook and personalizing marketing materials, easier. It also gives parents the accessibility to view their child's student memories. Search, Tag & Match More than 20MM face images processed each month Give your customers the solution they deserve Vidigami's product offering is based on their ability to tag and sort photos to be stored for customer retrieval. Manual tagging is time-consuming and not truly scalable, so they needed face recognition capable of commercial application to handle the volume of photos to be processed. Get the benefits of speed and automation at scale Vidigami selected Kairos' Face Recognition API to handle the high volume of photos contributed to their platform. Now, students are automatically recognized and tagged saving time and creating a scalable process. Our API also allows Vidigami to process as many faces as necessary, giving their customers a simplified user experience when contributing photos or searching for them. Radically improve the discoverability of your digital assets Vidigami is currently processing over 20 million images of faces each month. The volume Kairos' face detection equips Vidigami to handle allows them to offer their customers the ability to search for users, photos, and the tags associated with any group, album or photo, with ease. \"We would be delighted to see [Kairos] continue important developments that keep them in the forefront of applied human analytics for commercial applications.\" - Mandy Chan, Founder & CEO Vidigami: Entrusting Kairos with the memories of future generations Vidigami provides schools the best place for storing and sharing school memories. Designed exclusively for schools, Vidigami provides a private and secure photo management platform for easily capturing, organizing and sharing photos with all members of their community. Ready to get started with Kairos?",
    "Ubanx \"We evaluated several face recognition options and time to market with the Kairos solution was the best, with very thorough documentation to help us implement with.\" - Max Cartier, Product Lead Ubanx is mainstreaming blockchain As early innovators in the FinTech industry , Ubanx is mainstreaming blockchain with their comprehensive offering of products and services for customers to engage in the crypto asset space. Ubanx is an easy, user-friendly real-world connection to the crypto economy. In offering three separate, yet connected crypto centric products and experiences through their Ubanx Wallet App, Ubanx Pro Exchange, and Ubanx Spaces—Ubanx's blockchain platforms require reliable, scalable, biometric identity authentication around account security and regulatory compliance processes. USE CASE Identity Verification INDUSTRY FinTech, Blockchain, Cryptocurrency Improving customer experiences and reducing identity fraud Ubanx has engaged Kairos Face Recognition as part of their DIA protocol. With Kairos, they are able to biometrically authenticate for customer onboarding, regulatory compliance and ongoing account verification processes. \"The Kairos team was extremely helpful in implementing our solution on top of their APIs. We recognize a lot of value in having a direct line with technical teams able to provide detailed and quick answers.\" - Gaston Cartier, Head of Ops Ubanx: The user-friendly and real-world connection to the crypto economy Ubanx is mainstreaming blockchain with a comprehensive offering of products and services that enable customers to fully engage in the crypto asset space. The Ubanx Wallet App, which solves the frictions around buying and selling crypto, the Ubanx Pro Exchange, which aims to be a trader-centric exchange, and Ubanx Spaces, retail locations complete with co working spaces and training. Ubanx \"We evaluated several face recognition options and time to market with the Kairos solution was the best, with very thorough documentation to help us implement with.\" - Max Cartier, Product Lead Ubanx is mainstreaming blockchain As early innovators in the FinTech industry , Ubanx is mainstreaming blockchain with their comprehensive offering of products and services for customers to engage in the crypto asset space. Ubanx is an easy, user-friendly real-world connection to the crypto economy. In offering three separate, yet connected crypto centric products and experiences through their Ubanx Wallet App, Ubanx Pro Exchange, and Ubanx Spaces—Ubanx's blockchain platforms require reliable, scalable, biometric identity authentication around account security and regulatory compliance processes. USE CASE Identity Verification INDUSTRY FinTech, Blockchain, Cryptocurrency Improving customer experiences and reducing identity fraud Ubanx has engaged Kairos Face Recognition as part of their DIA protocol. With Kairos, they are able to biometrically authenticate for customer onboarding, regulatory compliance and ongoing account verification processes. \"The Kairos team was extremely helpful in implementing our solution on top of their APIs. We recognize a lot of value in having a direct line with technical teams able to provide detailed and quick answers.\" - Gaston Cartier, Head of Ops Ubanx: The user-friendly and real-world connection to the crypto economy Ubanx is mainstreaming blockchain with a comprehensive offering of products and services that enable customers to fully engage in the crypto asset space. The Ubanx Wallet App, which solves the frictions around buying and selling crypto, the Ubanx Pro Exchange, which aims to be a trader-centric exchange, and Ubanx Spaces, retail locations complete with co working spaces and training. \"We evaluated several face recognition options and time to market with the Kairos solution was the best, with very thorough documentation to help us implement with.\" - Max Cartier, Product Lead Ubanx is mainstreaming blockchain As early innovators in the FinTech industry , Ubanx is mainstreaming blockchain with their comprehensive offering of products and services for customers to engage in the crypto asset space. Ubanx is an easy, user-friendly real-world connection to the crypto economy. In offering three separate, yet connected crypto centric products and experiences through their Ubanx Wallet App, Ubanx Pro Exchange, and Ubanx Spaces—Ubanx's blockchain platforms require reliable, scalable, biometric identity authentication around account security and regulatory compliance processes. Improving customer experiences and reducing identity fraud Ubanx has engaged Kairos Face Recognition as part of their DIA protocol. With Kairos, they are able to biometrically authenticate for customer onboarding, regulatory compliance and ongoing account verification processes. \"The Kairos team was extremely helpful in implementing our solution on top of their APIs. We recognize a lot of value in having a direct line with technical teams able to provide detailed and quick answers.\" - Gaston Cartier, Head of Ops Ubanx: The user-friendly and real-world connection to the crypto economy Ubanx is mainstreaming blockchain with a comprehensive offering of products and services that enable customers to fully engage in the crypto asset space. The Ubanx Wallet App, which solves the frictions around buying and selling crypto, the Ubanx Pro Exchange, which aims to be a trader-centric exchange, and Ubanx Spaces, retail locations complete with co working spaces and training. Ready to get started with Kairos?",
    "Veritone \"Kairos has established itself as a leading AI engine provider in the facial recognition space, continuing to add new capabilities and features over time.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone maximizes value of digital assets with Kairos Veritone uses Kairos Face Recognition to identify people in searched images across ingested media. USE CASE Search, Tag & Match INDUSTRY Digital Asset Management KEY STATS Kairos recognizes over 10 thousand enrolled faces for Veritone, with 5 million faces processed, and counting. Quickly find the people that matter, when it matters Veritone needed a scalable, time sensitive, and accurate way to identify images. Specifically, images of celebrities, politicians, athletes and television personalities-- contributed for the purpose of being identified when searched. For example, a sports agency may want to determine the number of times a NFL client appeared on ESPN during the season. Or, a news network wants to know exactly how many times Hillary Clinton appeared in their programming during the election. In each case, Veritone requires the capability to recognize the subject and generate insights to be used for purposes like marketing, programming and political strategy. Save precious time, and get more out of your media assets Veritone chose Kairos Face Recognition to identify and isolate individuals from the thousands of images searched in their database. No longer required to spend hours scouring over video searching for a single appearance, they are able organize, catalog and search that same video within seconds. Drive ROI, and get peace of mind, with face recognition In the last twelve months, Veritone has enrolled more than ten thousand images and processed nearly five million faces using Kairos Face Recognition API. The ability to provide rapid, accurate, insights at this volume upholds the integrity of their client offering and is essential to their business model. \"We appreciate Kairos' focus on collaboration and willingness to ideate solutions for our various client use cases.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone: The world's first cognitive media platform trusts Kairos Veritone has developed a proprietary platform that unlocks the power of AI-based cognitive computing so that unstructured audio and video data can be processed, transformed, correlated and analyzed in a seamless, automated manner to generate actionable intelligence. The open platform integrates an ecosystem of a variety of best-of-breed cognitive engines, which can be orchestrated together, to reveal valuable multivariate insights from vast amounts of media. Founded in 2014, Veritone has been recognized by some of the industry's most prestigious forums, including the Red Herring Top 100 Award, the Edison Awards, and the SIIA Business Technology CODiE Award for Best Native Advertising Platform or Service. Veritone \"Kairos has established itself as a leading AI engine provider in the facial recognition space, continuing to add new capabilities and features over time.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone maximizes value of digital assets with Kairos Veritone uses Kairos Face Recognition to identify people in searched images across ingested media. USE CASE Search, Tag & Match INDUSTRY Digital Asset Management KEY STATS Kairos recognizes over 10 thousand enrolled faces for Veritone, with 5 million faces processed, and counting. Quickly find the people that matter, when it matters Veritone needed a scalable, time sensitive, and accurate way to identify images. Specifically, images of celebrities, politicians, athletes and television personalities-- contributed for the purpose of being identified when searched. For example, a sports agency may want to determine the number of times a NFL client appeared on ESPN during the season. Or, a news network wants to know exactly how many times Hillary Clinton appeared in their programming during the election. In each case, Veritone requires the capability to recognize the subject and generate insights to be used for purposes like marketing, programming and political strategy. Save precious time, and get more out of your media assets Veritone chose Kairos Face Recognition to identify and isolate individuals from the thousands of images searched in their database. No longer required to spend hours scouring over video searching for a single appearance, they are able organize, catalog and search that same video within seconds. Drive ROI, and get peace of mind, with face recognition In the last twelve months, Veritone has enrolled more than ten thousand images and processed nearly five million faces using Kairos Face Recognition API. The ability to provide rapid, accurate, insights at this volume upholds the integrity of their client offering and is essential to their business model. \"We appreciate Kairos' focus on collaboration and willingness to ideate solutions for our various client use cases.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone: The world's first cognitive media platform trusts Kairos Veritone has developed a proprietary platform that unlocks the power of AI-based cognitive computing so that unstructured audio and video data can be processed, transformed, correlated and analyzed in a seamless, automated manner to generate actionable intelligence. The open platform integrates an ecosystem of a variety of best-of-breed cognitive engines, which can be orchestrated together, to reveal valuable multivariate insights from vast amounts of media. Founded in 2014, Veritone has been recognized by some of the industry's most prestigious forums, including the Red Herring Top 100 Award, the Edison Awards, and the SIIA Business Technology CODiE Award for Best Native Advertising Platform or Service. \"Kairos has established itself as a leading AI engine provider in the facial recognition space, continuing to add new capabilities and features over time.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone maximizes value of digital assets with Kairos Veritone uses Kairos Face Recognition to identify people in searched images across ingested media. Search, Tag & Match Kairos recognizes over 10 thousand enrolled faces for Veritone, with 5 million faces processed, and counting. Quickly find the people that matter, when it matters Veritone needed a scalable, time sensitive, and accurate way to identify images. Specifically, images of celebrities, politicians, athletes and television personalities-- contributed for the purpose of being identified when searched. For example, a sports agency may want to determine the number of times a NFL client appeared on ESPN during the season. Or, a news network wants to know exactly how many times Hillary Clinton appeared in their programming during the election. In each case, Veritone requires the capability to recognize the subject and generate insights to be used for purposes like marketing, programming and political strategy. Save precious time, and get more out of your media assets Veritone chose Kairos Face Recognition to identify and isolate individuals from the thousands of images searched in their database. No longer required to spend hours scouring over video searching for a single appearance, they are able organize, catalog and search that same video within seconds. Drive ROI, and get peace of mind, with face recognition In the last twelve months, Veritone has enrolled more than ten thousand images and processed nearly five million faces using Kairos Face Recognition API. The ability to provide rapid, accurate, insights at this volume upholds the integrity of their client offering and is essential to their business model. \"We appreciate Kairos' focus on collaboration and willingness to ideate solutions for our various client use cases.\" - Tyler Schulze, VP Strategy & Development, Veritone Veritone: The world's first cognitive media platform trusts Kairos Veritone has developed a proprietary platform that unlocks the power of AI-based cognitive computing so that unstructured audio and video data can be processed, transformed, correlated and analyzed in a seamless, automated manner to generate actionable intelligence. The open platform integrates an ecosystem of a variety of best-of-breed cognitive engines, which can be orchestrated together, to reveal valuable multivariate insights from vast amounts of media. Founded in 2014, Veritone has been recognized by some of the industry's most prestigious forums, including the Red Herring Top 100 Award, the Edison Awards, and the SIIA Business Technology CODiE Award for Best Native Advertising Platform or Service. Ready to get started with Kairos?",
    "Face Recognition Made Easy Thanks for your message Someone from our team will be in touch soon Face Recognition Made Easy Thank you Someone from our team will be in touch shortly FROM OUR FOUNDER I just wanted to say a personal thank you for contacting Kairos. I read every message we receive, so be assured you're in great hands. We're dedicated to serving our customers and love to help in any way we can. Having technical challenges? Our tech support is world-class. Trying to sell Human Analytics into your company? Our strategy and delivery experts have decades of enterprise experience to share. Brian Brackeen, Founder & CEO POPULAR ON KAIROS THIS WEEK WHITEPAPER: Improving Image and Video Tagging With Face Recognition Learn how Face Recognition and Human Analytics are transforming digital asset management. READ MORE Back to KAIROS.COM Kairos AR, Inc. Face Recognition Made Easy Thanks for your message Someone from our team will be in touch soon Face Recognition Made Easy Thank you Someone from our team will be in touch shortly FROM OUR FOUNDER I just wanted to say a personal thank you for contacting Kairos. I read every message we receive, so be assured you're in great hands. We're dedicated to serving our customers and love to help in any way we can. Having technical challenges? Our tech support is world-class. Trying to sell Human Analytics into your company? Our strategy and delivery experts have decades of enterprise experience to share. Brian Brackeen, Founder & CEO POPULAR ON KAIROS THIS WEEK WHITEPAPER: Improving Image and Video Tagging With Face Recognition Learn how Face Recognition and Human Analytics are transforming digital asset management. READ MORE Back to KAIROS.COM Kairos AR, Inc. Face Recognition Made Easy Thanks for your message Someone from our team will be in touch soon Face Recognition Made Easy Someone from our team will be in touch shortly I just wanted to say a personal thank you for contacting Kairos. I read every message we receive, so be assured you're in great hands. We're dedicated to serving our customers and love to help in any way we can. Having technical challenges? Our tech support is world-class. Trying to sell Human Analytics into your company? Our strategy and delivery experts have decades of enterprise experience to share. Brian Brackeen, Founder & CEO POPULAR ON KAIROS THIS WEEK WHITEPAPER: Improving Image and Video Tagging With Face Recognition Learn how Face Recognition and Human Analytics are transforming digital asset management. Kairos AR, Inc."
  ]
}