{
  "company": "www.au10tix.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 8,
    "-1": 7
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 8
    }
  },
  "sample_docs": [
    "\\n\\t\\t\\t\\t\\t\\t\\t\\t \\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t <\\/video>\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t<\\/div>\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t <\\/div>\\n\\t\\t\\t\\t\\t\\t\\t \\n\\t\\t\\t\\t\\t \\n\\t\\t\\t \\n\\t\\t\\t\\t\\t\\t \\n\\t\\t\\t\\t \\n\\t\\t\\t Identity verification that fraudsters hate and users love<\\/span><\\/h1><\\/div>\\t\\t<\\/div>\\n\\t\\t\\t\\t<\\/div>\\n\\t\\t\\t\\t \\n\\t\\t\\t\\t \\n\\t\\t\\t Book a Demo<\\/span><\\/a><\\/div>\\t\\t<\\/div>\\n\\t\\t\\t\\t<\\/div>\\n\\t\\t\\t\\t \\n\\t\\t\\t\\t \\n\\t\\t\\t Watch the Movie<\\/span> Identity verification that fraudsters hate and users love<\\/span><\\/h1><\\/div>\\t\\t<\\/div>\\n\\t\\t\\t\\t<\\/div>\\n\\t\\t\\t\\t \\n\\t\\t\\t\\t \\n\\t\\t\\t Book a Demo<\\/span><\\/a><\\/div>\\t\\t<\\/div>\\n\\t\\t\\t\\t<\\/div>\\n\\t\\t\\t\\t \\n\\t\\t\\t\\t \\n\\t\\t\\t Watch the Movie<\\/span>",
    "Conferences, Interviews, Tutorials and more MoneyConf, Madrid, - Ron Atzmon on the Fraud Prevention panel Ron Atzmon, MD AU10TIX, on the Cyber panel, MoneyConf World Identity Conference, Ron Atzmon BBVA Fintech University, San Francisco, Ron Atzamon BBVA Fintech University panel, Ron Atzmon to AU10TIX LTD. | Legal Disclaimer",
    "Document & ID Authentication line of products Document Comprehension line of products Travel & Access Control line of products \"Paperless Enrollment\" is one of the most talked of agenda items among enterprises worldwide. Even prior to the economic crisis, enterprises began embracing \"paperless enrollment\" due to the straightforward economic and operational benefits it offers. This shift is mainly driven by the need to cut costs, eliminate inefficiencies, and acquire a competitive advantage within customer acquisition, customer satisfaction and service. Most importantly, this offering has become highly relevant today as new technological breakthroughs allow for a mature and cost-effective solution deployment. \"Paperless enrollment\" follows the same core competencies that AU10TIX has been excelling at - document acquisition and identification, content cropping and classification, data analysis and comprehension, to name but a few, enabling the handling of a variety of documents, ranging from primary to supplementary documents, with various formats and procedures. The AU10TIX Document Comprehension System is built upon and extends the AU10TIX Document and ID Authentication scope, providing a unique technology platform that includes the following main engines, vitalizing the meaning of \"Paperless Enrollment\": The ability to receive information from heterogeneous intra and inter resources The ability to enhance, capture, authenticate and comprehend information in various advanced methods and techniques (patent pending) The ability to produce records in industry standard format, that integrate seamlessly with the organization's database and applications The ability to support both centralized and distributed processing environments Value proposition & Benefits AU10TIX Document Comprehension system offer enterprises and organizations a powerful, compelling value proposition. Seconds-fast, reliable end2end document processing Seamless integration with enterprise's databases and applications Everywhere, any time, fully manageable availability of records Excellent trail auditing and analytics capabilities These translate to: A smooth, straightforward and fast migration Substantial reduction in operational expenses Better, faster customer service and in turn higher customer satisfaction Excellent marketing platform Value proposition & Benefits AU10TIX Document Comprehension system offer enterprises and organizations a powerful, compelling value proposition. Seconds-fast, reliable end2end document processing Seamless integration with enterprise's databases and applications Everywhere, any time, fully manageable availability of records Excellent trail auditing and analytics capabilities These translate to: A smooth, straightforward and fast migration Substantial reduction in operational expenses Better, faster customer service and in turn higher customer satisfaction Excellent marketing platform A smooth, straightforward and fast migration Substantial reduction in operational expenses Better, faster customer service and in turn higher customer satisfaction Excellent marketing platform",
    "Document & ID Authentication line of products Document Comprehension line of products Travel & Access Control line of products AU10TIX's Document and ID authentication family of products provide an end-to-end, automated process of document data acquisition, document authentication and identity validation and screening. AU10TIX's Document and ID authentication family of products are standard-setters. They incorporate state-of-the-art, analytic technology with the most advanced data verification and utilization capabilities available to date. Information is acquired through standard industry scanning devices (from TWAIN to 3-illumination level scanners); supporting a variety of standard sizes (A6 to A4) and types (including ICAO standard and non standard based – referring to passports, driving license, national ID cards and more), including those equipped with electronic (eChip) and magnetic (stripes) means; enhanced with complementary ID information received from standard industry biometric devices. AU10TIX SDR© engine delivers rapid, accurate document reading and imaging, as well as excellent document identification and content classification capabilities Document forensics is the best-of-breed, covering the entire range of tests from physical tempering and dataset matching through to a variety of 3-illumination and data chip security feature testing The technology is designed to incorporate both internal and external databases as well as watch lists screening Fully flexible, with both local or central deployment options Data archiving with encryption and sharing functionalities providing a variety of industry standard API's enabling easy, semi-real-time end2end integration possibilities Value proposition & Benefits AU10TIX's Document and ID authentication family of products offer enterprises and organizations nothing less than a revolution, replacing commonly used manual processing routines. Seconds-fast, reliable record acquisition World class fraud prevention Unmatched enterprise database integrity (ability to eliminate typos and redundancies) High quality, long lasting data and image information Everywhere, any time, fully manageable availability of records Advanced audit trail and analytics abilities These translate into a compelling value proposition: Substantial cost savings Outstanding service efficiency Compliance with latest and imminent regulations Advanced marketing platform",
    "Our global activities and achievements reported AUI10TIX at Money 20/20 Europe ,Booth K32 AU10TIX invites you to the Liquid meetup in Tel-Aviv, 18 October 2018 AU10TIX now Supports Korean Language in Its 2nd Generation ID Authentication & Onboarding Service – Au10tix SaxoBank Chooses AU10TIX 2nd Generation Customer ID Authentication & Onboarding Automation AU10TIX Breaks Own Record Achieving 4.5 Seconds Average ID Authentication & Processing Under Extreme Traffic Loads AU10TIX Warns: Stolen Personal Data Behind +100% Increase in Payment Fraud – 2nd Generation Forensic ID Authentication Becomes Essential AU10TIX Reports Record Demand in The Cryptocurrency (Bitcoin) Market for 2nd Generation ID Authentication & Onboarding Automation VISA Chooses AU10TIX Automated ID Authentication & Onboarding Platform ezbob Extends Contract with AU10TIX for ID Authentication and Customer Onboarding Automation Prepaid Card and P2P Payment Provider, Cascade Fintech, Signs 3-Year Contract for AU10TIX ID Authentication & Onboarding Automation Money Transfer company, Ping Express, Signs with AU10TIX for 2nd Generation ID Authentication & Face Matching Automation Banking Services Provider Sepaga Integrates AU10TIX ID Authentication & Customer Onboarding Automation Service AU10TIX is Finalist at the 2017 Benzinga Global Fintech Awards to AU10TIX LTD. | Legal Disclaimer"
  ]
}