{
  "company": "www.smithsdetection.com",
  "dominant_topics": [
    0,
    4
  ],
  "topic_counts": {
    "0": 5,
    "4": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader"
  },
  "framing_scores": {
    "framing_ethical": 0.3703703703703703,
    "framing_surveillance": 0.3333333333333333,
    "framing_market": 0.2962962962962963,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "0": 5,
      "4": 1
    }
  },
  "sample_docs": [
    "Product Services The Americas As the premier provider of high tech security devices, our Product Services team is uniquely placed to assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Product Specialists Smiths Detection Service Operations, The Americas has created a group called Product Specialists. These individuals lead their product or product line as the top technical authority within Service Operations. The Product Specialist serves as the key expert resource to other Service team members, as well as the technical interface between Service Operations and Sales & Marketing, Research & Development and Product Management. Consulting Our service organization can provide you with various consulting services to assist you with addressing your security concerns. We offer various assistance including Site Security as well as First Responder consulting. Project Management Customers can receive the added attention of a dedicated Project Manager to assist with any special needs that they may have with their security equipment. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Radiation Safety & Regulatory Compliance Most State Radiation Control Agency regulations require owners of x-ray generating devices to register their unit(s) with their respective State agency. Smiths Detection can provide your site with a complete understanding of the registration process as well as the additional requirements that are called for by your respective state. Smiths Detection's radiation safety and regulatory compliance staff are experts in this field. Our Radiation Safety Training programs will provide your staff with the necessary knowledge to safely operate your equipment and can customize an entire radiation protection program specifically for you that will meet all state regulatory requirements for owning and operating your Smiths Detection x-ray machine. Leasing finance about a leasing finance program from our partner Amsource Capital. For North America leasing information, . For Latin America leasing information, . EMEA Our Product Services team can assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Service Consulting Our service organization can provide you with various consulting services to assist you with addressing your security concerns. Project Management Our team of experienced and highly specialized Project Managers assists with the planning and implementation of complex customized solutions. They fully supervise the installation of integrated security equipment in order to achieve optimum performance of your security systems. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Individualized Services Special applications require customized solutions. Smiths Detection is ready to meet your security needs. Asia Pacific Product services Service consulting Project management Individualized services As the premier provider of high tech security devices, our Product Services team is uniquely placed to assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Smiths Detection Service Operations, The Americas has created a group called Product Specialists. These individuals lead their product or product line as the top technical authority within Service Operations. The Product Specialist serves as the key expert resource to other Service team members, as well as the technical interface between Service Operations and Sales & Marketing, Research & Development and Product Management. Our service organization can provide you with various consulting services to assist you with addressing your security concerns. We offer various assistance including Site Security as well as First Responder consulting. Customers can receive the added attention of a dedicated Project Manager to assist with any special needs that they may have with their security equipment. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Radiation Safety & Regulatory Compliance Most State Radiation Control Agency regulations require owners of x-ray generating devices to register their unit(s) with their respective State agency. Smiths Detection can provide your site with a complete understanding of the registration process as well as the additional requirements that are called for by your respective state. Smiths Detection's radiation safety and regulatory compliance staff are experts in this field. Our Radiation Safety Training programs will provide your staff with the necessary knowledge to safely operate your equipment and can customize an entire radiation protection program specifically for you that will meet all state regulatory requirements for owning and operating your Smiths Detection x-ray machine. Leasing finance about a leasing finance program from our partner Amsource Capital. For North America leasing information, . For Latin America leasing information, . Our Product Services team can assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Our service organization can provide you with various consulting services to assist you with addressing your security concerns. Our team of experienced and highly specialized Project Managers assists with the planning and implementation of complex customized solutions. They fully supervise the installation of integrated security equipment in order to achieve optimum performance of your security systems. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Special applications require customized solutions. Smiths Detection is ready to meet your security needs. Send a support request Fill in your details below, and we'll get back to you just as soon as we can. Thank you.",
    "What is the underlying basic technology? Millimetre-wave refers to that part of the electromagnetic spectrum that lies between radio waves and infrared. This spectral band is used in many everyday products such as intruder alarms and driver assist for car parking. Millimetre-waves possess a unique property of passing transparently through lightweight materials such as clothing fabrics. The property is made use of in mm-wave scanners that find their main application in concealed object detection systems – typically used to identify the presence of weapons and contraband that are hidden beneath a person's clothing. Why do we use this technology? Millimetre waves are a safe non-ionising energy, which has the capability to see through light-weight material such as clothing. It is this property of millimetre wave that allows it to find uses in security applications for the detection of contraband hidden in a person's clothes. Millimetre waves are reflected from the body at different levels compared to hidden objects concealed beneath the clothing. The millimetre waves are received and sophisticated software algorithms analyse the data to locate any concealed objects . How do we practically implement it? Smiths Detection uses a novel technology that scans the 3D scene electronically to provide the first 'no moving parts' scanner that is suitable for mass people screening. The system consists of a flat-panel array that produces high quality data that is processed through the automatic detection algorithms in real-time. The transmitted millimetre waves are directed to the panel. The millimetre waves are reflected by the body and sensed by the receiver. The 3D volume is made up of thousands of fine voxels which are all interrogated 15 times every second. This builds up the data for the programmed person who is being scanned that is used by the automatic detection algorithms. Why do we implement it like this? The eqo product – named because it senses mm-wave echoes – marks an evolution to 'next-generation' technology for mm-wave scanners. The electronic scanning not only dispenses with the need for moving parts but also dramatically reduces the footprint of the product. What are our main focuses? In order to preserve the privacy of people who are being scanned the detection process is automated. In these automatic systems, the data processing algorithms find the position of concealed objects and provide a location indicator on a generic graphic to the system operator. The automated systems also have a faster and more cost-effective screening process. The fine resolution and high refresh rate allow eqo's automatic detection engines to produce a high probability of detection with a low false alarm rate . What is the underlying basic technology? Millimetre-wave refers to that part of the electromagnetic spectrum that lies between radio waves and infrared. This spectral band is used in many everyday products such as intruder alarms and driver assist for car parking. Millimetre-waves possess a unique property of passing transparently through lightweight materials such as clothing fabrics. The property is made use of in mm-wave scanners that find their main application in concealed object detection systems – typically used to identify the presence of weapons and contraband that are hidden beneath a person's clothing. Why do we use this technology? Millimetre waves are a safe non-ionising energy, which has the capability to see through light-weight material such as clothing. It is this property of millimetre wave that allows it to find uses in security applications for the detection of contraband hidden in a person's clothes. Millimetre waves are reflected from the body at different levels compared to hidden objects concealed beneath the clothing. The millimetre waves are received and sophisticated software algorithms analyse the data to locate any concealed objects Speak to Our Sales Team Ask us a Question Submit your question and we'll get back to you as soon as possible.",
    "An essential element of homeland security involves protecting essential industries, and government institutions - the critical infrastructure that supports national economies, where any disruption can be paralysing or catastrophic. Critical infrastructure At Smiths Detection, we have developed the most comprehensive security solution available, from enhancing security checkpoints, through to examining deliveries. For SECURITY CHECKPOINTS watch our video showing how HI-SCAN 6040C keeps people safe by identifying threats to your building. Click to view. For PRISONS - view a video showing the products and technologies we offer to check inmates, visitors and cells for drugs and illicit items. Click to view. Threat Areas Security checkpoints Checking cars & light vehicles, visitors, staff and their hand baggage for explosives, weapons and other illegal or dangerous items. Buildings protection Protecting buildings against the accidental or deliberate release of chemicals, shutting down HVAC systems. Using intelligent video systems to help in assessing the level of threat and to monitor events. Loading Dock Checking incoming deliveries of goods and sub-components for dangerous items and potentially lethal substances, in trucks, containers, packing cases or pallets. Mail security screening Smiths Detection advocates a layered approach to mail screening, helping organizations create a tailored solution to address multiple threats, including Improvised Explosive Devices (IED), chemical and biological threats. Site security Securing the perimeter with CCTV cameras linked to multiple intrusion detection devices for active surveillance that continually monitors the fence line. Sensor integration with advanced motion detection & object recognition for early detection and response. Mass transit Continuously monitored tunnel, platform and passenger waiting area systems for early detection & response to chemical warfare agents. At Smiths Detection, we have developed the most comprehensive security solution available, from enhancing security checkpoints, through to examining deliveries. For SECURITY CHECKPOINTS watch our video showing how HI-SCAN 6040C keeps people safe by identifying threats to your building. Click to view. For PRISONS - view a video showing the products and technologies we offer to check inmates, visitors and cells for drugs and illicit items. Click to view. At Smiths Detection, we have developed the most comprehensive security solution available, from enhancing security checkpoints, through to examining deliveries. For SECURITY CHECKPOINTS watch our video showing how HI-SCAN 6040C keeps people safe by identifying threats to your building. Click to view. For PRISONS - view a video showing the products and technologies we offer to check inmates, visitors and cells for drugs and illicit items. Click to view. Checking cars & light vehicles, visitors, staff and their hand baggage for explosives, weapons and other illegal or dangerous items. Checking cars & light vehicles, visitors, staff and their hand baggage for explosives, weapons and other illegal or dangerous items. Protecting buildings against the accidental or deliberate release of chemicals, shutting down HVAC systems. Using intelligent video systems to help in assessing the level of threat and to monitor events. Protecting buildings against the accidental or deliberate release of chemicals, shutting down HVAC systems. Using intelligent video systems to help in assessing the level of threat and to monitor events. Checking incoming deliveries of goods and sub-components for dangerous items and potentially lethal substances, in trucks, containers, packing cases or pallets. Checking incoming deliveries of goods and sub-components for dangerous items and potentially lethal substances, in trucks, containers, packing cases or pallets. Smiths Detection advocates a layered approach to mail screening, helping organizations create a tailored solution to address multiple threats, including Improvised Explosive Devices (IED), chemical and biological threats. Smiths Detection advocates a layered approach to mail screening, helping organizations create a tailored solution to address multiple threats, including Improvised Explosive Devices (IED), chemical and biological threats. Securing the perimeter with CCTV cameras linked to multiple intrusion detection devices for active surveillance that continually monitors the fence line. Sensor integration with advanced motion detection & object recognition for early detection and response. Securing the perimeter with CCTV cameras linked to multiple intrusion detection devices for active surveillance that continually monitors the fence line. Sensor integration with advanced motion detection & object recognition for early detection and response. Continuously monitored tunnel, platform and passenger waiting area systems for early detection & response to chemical warfare agents. Continuously monitored tunnel, platform and passenger waiting area systems for early detection & response to chemical warfare agents. The security checkpoint in public buildings Speak to Our Sales Team Ask us a Question Submit your question and we'll get back to you as soon as possible.",
    "10 Oct 2017 Print this page Smiths Detection hold baggage screening technology to support upgrade to ECAC Standard 3 EDS at Munich Airport Wiesbaden – 10 October 2017: Smiths Detection has been selected by the District Government of Upper Bavaria to supply ECAC Standard 3 EDS hold baggage screening systems to Munich Airport. The contract comprises 25 x HI-SCAN 10080 XCT advanced scanners which amalgamate high resolution X-ray technology, computed tomography (CT) and advanced detection algorithms to deliver exceptional levels of security whilst also increasing operational efficiency. A service agreement is also included. The scanners will not only detect the explosives threats specified by the new standard, but can also be easily upgraded to meet future requirements to identify evolving threats. Combining a very fast belt speed with a large rectangular tunnel, they offer a continuously high throughput of up to 1,800 bags per hour. Extremely sharp, full colour, high resolution images, as well as a low false alarm rate also support the greater levels of efficiency required by the new regulations. Munich is Germany's second largest airport and the only one in Europe to be awarded 5-star status in the Skytrax World Airport Rating. It already handles 100 airlines flying to over 250 destinations in over 70 countries with plans for further development. The new technology will deliver the efficiencies required by such a busy hub both now and in the future. \"We welcome the opportunity to help airports in upgrading to ECAC Standard 3. It is a major step but the rewards are significant in of higher levels of security and operational efficiency,†explained Tony Tielen, VP EMEA for Smiths Detection. \"The new equipment will be seamlessly integrated into Munich Airport's existing infrastructure to ensure smooth ongoing service during the upgrade.† To be deployed in both terminals, the first three scanners will be installed and fully operational by the end of this year. The remaining installations will be progressively rolled out between 2018 and 2021. Also included in the deal are 49 Level 2 and 3 workstations and a Matrix Server. HI-SCAN 10080 XCT key features: EU/ECAC EDS Standard 3 approved Laboratory certified for high-speed checked baggage screening by the United States Transportation Security Administration (TSA) Belt speed of 0.5m/sec (98.5ft/min) High throughput of up to 1800 bags per hour Large tunnel capable of screening objects 100 x 80 cm (39.4 x 31.5in) A dual-energy X-ray line scanner with full 3D volumetric Computed Tomography (CT) imaging and reconstruction, the HI-SCAN 10080 XCT is the next generation high-speed checked baggage explosives detection system (EDS). With a belt speed of 0.5m/sec (98.5ft/min) and a large 1070 x 810mm (42.1 x 31.9in) rectangular tunnel, the HI-SCAN 10080 XCT provides the most economical solution for airport checked baggage screening requirements. This combination of belt speed and tunnel size will provide baggage handling systems the capability to process a throughput of up to 1800 bags/hour with object sizes of up to 1000 x 800 mm (39.4 x 31.5in). The HI-SCAN 10080 XCT is designed to integrate easily into newly implemented Hold Baggage System (HBS) configurations or as a replacement for current baggage handling systems. Further details on the Smiths Detection HI-SCAN 10080 XCT can be found here: http://www.smithsdetection.com/index.php?option=com_k2&view=item&id=157:hi-scan-10080-xct&Itemid=101 About Smiths Detection Smiths Detection , part of Smiths Group, is a global leader in threat detection and screening technologies for aviation, ports and borders, urban security and military markets. With more than 40 years of field-tested experience, we deliver the solutions needed to protect society from the threat and illegal passage of explosives, prohibited weapons, contraband, toxic chemicals and narcotics. Our goal is simple – to provide security, peace of mind and freedom of movement upon which the world depends. For more information visit www.smithsdetection.com Media relations contact: Karen Kulinski Global Aviation Marketing Director +49 (0)611 9412 422 karen.kulinski@smithsdetection.com Share: Smiths Detection hold baggage screening technology to support upgrade to ECAC Standard 3 EDS at Munich Airport EU/ECAC EDS Standard 3 approved Laboratory certified for high-speed checked baggage screening by the United States Transportation Security Administration (TSA) Belt speed of 0.5m/sec (98.5ft/min) High throughput of up to 1800 bags per hour Large tunnel capable of screening objects 100 x 80 cm (39.4 x 31.5in)",
    "Read about business and product developments in Smiths Detection, through our latest press releases, in this section. Browse our database of Press Releases. Press releases Friday, 13 October Japan's Narita Airport Deploys State-of-the-Art Security Technology Tokyo, Japan – Smiths Detection, a global leader in threat detection systems, has been selected to supply innovative solutions for people… Tuesday, 10 October New Smiths Detection analytics suite keeps things moving with near 100% customer uptime CORAL preventive maintenance software from Smiths Detection facilitates scheduled system downtime Inter Airport Europe, Munich – 10 October… Tuesday, 10 October Smiths Detection hold baggage screening technology to support upgrade to ECAC Standard 3 EDS at Munich Airport Wiesbaden – 10 October 2017: Smiths Detection has been selected by the District Government of Upper Bavaria to supply ECAC Standard 3 EDS hold… Thursday, 5 October Smiths Detection takes checkpoint security to a new level Smiths Detection takes checkpoint security to a new level New HI-SCAN 6040 CTiX scanner enhances security and operational… Monday, 2 October Maryland Lieutenant Governor Visits Smiths Detection to Learn About Technology to Combat Opioid Epidemic Edgewood, MD– On Tuesday, Smiths Detection, Inc. (SDI) welcomed Maryland Lt. Governor Boyd K. Rutherford to its Edgewood, Maryland facility, where… Friday, 22 September Smiths Detection wins biggest ever single order for next-generation hold baggage scanner for Frankfurt Airport Advanced HI-SCAN 10080 XCT hold baggage scanners offer flexible, sophisticated detection capabilities Wiesbaden – 22 September 2017:… Wednesday, 16 August Smiths Detection Inc. Addresses Fentanyl Crisis with Roundtable Seminars on Exposure Prevention at ASIS International Edgewood, MD – Smiths Detection Inc. (SDI) expert Dr. Michael Frunzi will moderate a series of special roundtable seminars at ASIS International… Wednesday, 2 August Smiths Detection Technology Protects First Responders Against the Threat of Fentanyl Exposure Edgewood, MD. – Smiths Detection Inc. (SDI) is at the forefront of arming first responders with solutions to safeguard against the presence of… Thursday, 27 July Smiths Detection gains STAC certification for Checkpoint.Evoplus Wiesbaden – 27 July 2017: Checkpoint.Evoplus from Smiths Detection has been successfully assessed and certified by STAC, the French civil aviation… Thursday, 20 July London Gatwick Airport Again Selects Smiths Detection's CTX 9800 Hold Baggage Explosives Detection System LONDON – Smiths Detection LLC , formerly Morpho Detection LLC, today announced a second contract with Gatwick Airport to supply and service eleven… Wednesday, 19 July Smiths Detection offers onsite EDS CB software upgrades Wiesbaden – Smiths Detection can now upgrade previously installed checkpoint scanners to ECAC EDS CB standards using its approved EDS Cabin… Tuesday, 11 July Smiths Detection Inc. Launches New E-Commerce Site for all U.S. Markets Edgewood, MD – Smiths Detection Inc. (SDI) has launched www.MySmithsDetection.com , a new e-commerce management platform aimed at providing leading… Thursday, 29 June Smiths Detection's IONSCAN 600 Explosives Trace Detection System Receives Certification Edgewood, Md. – Smiths Detection's IONSCAN 600 has passed certification testing for the explosives trace detection system by Transportation… Tuesday, 13 June EL AL Airlines orders additional Smiths Detection CTX 5800 hold baggage explosives detection systems NEWARK, Calif. – Smiths Detection LLC , formerly Morpho Detection LLC,today announced that EL AL Airlines has purchased 11 additional CTX… Friday, 9 June Smiths Detection achieves four more EDS cabin baggage screening approvals Range of checkpoint scanners now meet latest security standards Wiesbaden – 9 June 2017: Smiths Detection continues to gain EDS Cabin Baggage… Thursday, 1 June Smiths Group agrees to sell Morpho Detection's former trace business Smiths Group plc (\"Smiths Groupâ€) today announces that it has entered into a binding agreement with OSI Systems Inc to sell the explosive trace… Wednesday, 31 May Smiths Detection Receives Order for CTX 9800 Explosives Detection Systems Valued at Over $45M NEWARK, Calif. – Smiths Detection , formerly Morpho Detection – Safran, today announced the Transportation Security Administration (TSA) has… Tuesday, 23 May Cochin International Airport Selects Smiths Detection's CTX 9800 for Next-Generation Hold Baggage Screening BENGALURU, India – Smiths Detection , formerly Morpho Detection – Safran, today announced that India's Cochin International Airport has deployed… Tuesday, 16 May Smiths Detection Wins London Gatwick Airport Contract for CTX 9800 Hold Baggage Explosives Detection Systems Cambridge, UK – Smiths Detection , formerly Morpho Detection – Safran, today announced a contract with London Gatwick Airport Limited to supply and… Monday, 15 May Checkpoint.Evoplus launched today at Airport Show in Dubai Smiths Detection has chosen the Airport Show in Dubai to unveil its advanced screening and management platform - Checkpoint.Evoplus. This… Friday, 7 April Smiths Group announces completion of acquisition of Morpho Detection Following the clearance from US Department of Justice on March 31st 2017 Smiths Group plc today confirms that it has completed the acquisition of… Wednesday, 5 April Smiths Detection Inc. Honors Somerset County Sheriff's Office at Maine Sheriffs' Association Annual Conference Rockport, ME – Smiths Detection Inc. (SDI) presented the Somerset County Sheriff's Office on Thursday, March 30th, with a Pioneer Award at the… Monday, 27 March UK Ministry of Defence selects Smiths Detection for airport security contract London (UK) – 24 March 2017 – Smiths Detection has been awarded a new, multi-million pound contract with the UK Ministry of Defence (MOD) to… Friday, 24 March Smiths Detection to supply Dutch Airports with advanced hold baggage scanners Wiesbaden – 24 March 2017: Smiths Detection has won a significant contract to supply Amsterdam Airport Schiphol with new hold baggage screening… Friday, 24 March Smiths Detection Inc. Partners with Duke University in Deep Learning Research for Airport Screening Edgewood, Md. – Smiths Detection Inc. (SDI) announced that it is partnering with the Duke University Edmund T. Pratt Jr. School of Engineering,… Monday, 13 March Smiths Detection to Unveil First Dual-View X-ray Screeners for use in Cruise Line Baggage Screening Miami, FL – Smiths Detection Inc. (SDI), along with maritime security provider American Guard Services, Inc., unveiled the first dual-view X-ray… Monday, 6 March Smiths Detection Announces New Distribution Partner in Brazil Edgewood, MD – Smiths Detection Inc., (SDI) a threat detection technology leader, announced today that it has entered into an agreement with… Wednesday, 1 March Smiths Detection Deploys First Smart Security Checkpoint at Kansai Airport in Japan Osaka, Japan , – Smiths Detection is working with Kansai Airport to deploy the first ever Smart Security checkpoint in Japan. The Smart Security… Thursday, 23 February First County in Maine Installs Body Scanner from Smiths Detection Madison, ME – Smiths Detection Inc. (SDI), in partnership with its Northeast distributor, Access Control Systems Inc., announced that the Somerset… Monday, 13 February Smiths Detection's IONSCAN 600 receives CAAC approval Bringing the next generation explosives and narcotics trace detector to passenger and baggage screening at Chinese airports SINGAPORE, 13… Tuesday, 7 February SDI Statement on House Homeland Security Committee Report on America's Aviation Security Edgewood, Md. – Smiths Detection Inc. (SDI) President, Dan Gelston, today issued the following statement in response to a new report from the House… Wednesday, 25 January Smiths Detection's HI-SCAN 6040aTiX X-ray System Achieves Industry First EDS Cabin Baggage Screening Certification First cabin baggage X-ray system to pass new ECAC explosives detection standard Benefits include enhanced airport security and… Thursday, 19 January Smiths Group welcomes European Commission clearance for acquisition of Morpho Detection Smiths Group plc (\"Smiths Groupâ€) welcomes the European Commission's clearance of the proposed acquisition of Morpho Detection. In order to… Monday, 9 January Smiths Detection Inc. Expert to Present on Tactical Chemistry at the Florida HazMat Training Symposium Daytona Beach, FL – January 9, 2017 – Smiths Detection Inc. (SDI) expert, Dr. Chris Weber, will deliver an interactive program on tactical… Thursday, 8 December Official opening of Smiths Detection's new UK centre of excellence for trace detection LONDON (UK) – Smiths Detection today announced the official opening of its new UK centre of excellence for trace detection, located in Hemel… Tuesday, 8 November Smiths Detection Launches 'Aviation Insider': New Global Web Portal for Aviation Security New website, \"aviation-insider.comâ€, set to showcase aviation security industry best practice Portal launches as Smiths Detection… Monday, 31 October Smiths Detection Inc's Dual-View HI-SCAN 180180-2is pro Qualifies for TSA's Air Cargo Screening Technology List Edgewood, MD – Smiths Detection Inc. (SDI) today announces that its advanced dual-view X-ray cargo scanner, the HI-SCAN 180180-2is pro, has become… Friday, 30 September Smiths Detection Inc. Announces Support for Five New ThanksUSA's \"Pathway to Tech/Stem†Scholarships Edgewood, Md. – Smiths Detection Inc. (SDI) announced it will support five new scholarships through ThanksUSA's \"Pathway to Tech/STEM†program,… Wednesday, 28 September Smiths Detection supplies next generation baggage screening technology to Berlin Brandenburg Airport BER Wiesbaden – Smiths Detection has been contracted by the Procurement Agency of the Federal Ministry of the Interior to provide hold baggage… Wednesday, 14 September Smiths Detection's TRACE-PRO now identifies the explosive - TATP Watford – Smiths Detection's newly launched TRACE-PRO â\"¢, a non-radioactive, hand-held explosive threat detector, now has the additional capability… Thursday, 18 August Smiths Detection Inc. Honors Worcester County at American Correctional Association Annual Conference Boston, MA – Smiths Detection Inc. (SDI) honored Worcester County Jail & House of Correction on Tuesday, August 9, with a recognition award at… Wednesday, 10 August Egyptian Ministry of Defence chooses Smiths Detection to provide advanced aviation security systems Wiesbaden, 10 August 2016 – Smiths Detection has been awarded contracts worth almost £19m by Falcon Group to provide advanced detection systems… Thursday, 7 July Smiths Detection Inc. expert to present at international association of bomb technicians and investigators' 44th annual international training conference HALIFAX, NOVA SCOTIA – July 7, 2016 – Smiths Detection Inc. (SDI) hazmat expert Dr. Chris Weber will give a presentation geared toward explosives… Tuesday, 21 June Smiths Detection Inc. receives $41M follow-on order from DNDO for handheld radioisotope identifiers Edgewood, Md. – 21 June 2016 – Smiths Detection Inc. (SDI) today announces a new task order award of $40.9 million for its RadSeeker handheld… Thursday, 2 June Smiths Detection extends IONSCAN 600 capability to detect narcotics Watford, UK, 2 June 2016 – Smiths Detection's IONSCAN 600 trace detector has been enhanced to detect and identify narcotics, in addition to its… Tuesday, 10 May Smiths Detection wins large contract to equip new airport in Turkmenistan capital Wiesbaden, 10 May 2016 – Smiths Detection has won a significant contract from Polimeks Construction to supply a comprehensive range of… Wednesday, 27 April Smiths Detection Announces $17M Chemical Detector Order from the US Army Edgewood, MD – 27 April 2016 - Smiths Detection Inc. (SDI) today announced a $17.2 million follow-on production order from the U.S. Army… Tuesday, 26 April Smiths Group focuses on global technology in security with $710m acquisition 25 April 2016 - Smiths Group plc (\"Smiths Group†or the \"Groupâ€) today announces that it has entered into an agreement to acquire Morpho Detection… Monday, 4 April Smiths Detection Inc. Helps Secure SUPER BOWL 50 Edgewood, Md. – 4 April 2016 – Smiths Detection Inc. (SDI) today announces its equipment was used by multiple local and national security and law… Wednesday, 16 March Smiths Detection Inc. Wins $65 Million, Five-Year Agreement with Federal Protective Service Edgewood, Md. – 16 March 2016 – Smiths Detection Inc. (SDI) today announced a $65 million five-year agreement to provide X-ray inspection systems to… Monday, 29 February Smiths Detection Inc. employees recognized for green leadership at Maryland manufacturing ceremony Edgewood, Md.– 29 February 2016 – Smiths Detection Inc. (SDI) employees have been recognized by the Regional Manufacturing Institute (RMI) for… Thursday, 4 February Smiths Detection Inc. receives follow-on order from U.S. Army Reserves for its Mobile Protective Shelters Edgewood, Md. – 04 February 2016 - Smiths Detection Inc. (SDI) today announces it has received a follow-on order from the U.S. Army Reserves for its… Sunday, 24 January Smiths Detection Inc. wins award from DNDO for handheld RadSeeker detectors Edgewood, Md. – 27 January 2016 – Smiths Detection Inc. (SDI) today announces an initial award of $1.27 million for its RadSeeker handheld… Tuesday, 10 November Smiths Detection launches TRACE-PRO, a revolutionary explosives detector for fast identification and evidence collection Watford, UK, 17th November 2015 – Smiths Detection announces the launch of TRACE-PRO, a compact and ruggedised, non-radioactive Explosives Trace… Wednesday, 28 October State Senator Bob Cassilly tours Smiths Detection Inc. U.S. HQ in Edgewood, MD Edgewood, Md.–28 October 2015–Smiths Detection Inc. (SDI) today welcomed Maryland State Senator Bob Cassilly on a tour of its U.S. headquarters in… Tuesday, 27 October Smiths Detection wins GBP6 million Chemical Agent Detector contract to equip new generation of UK Military vehicles WATFORD, England, October 26, 2015. Smiths Detection has been awarded a contract worth almost GBP6 million from General Dynamics UK to supply… Tuesday, 27 October Smiths Detection launches iCmoreâ\"¢ automatic detection software for cargo inspection X-ray systems Software addition speeds throughput and boosts detection accuracy, helping to improve traffic flows and secure valuable tax revenues. Thursday, 22 October Smiths Detection Inc.'s dual-view HI-SCAN 6040-2is qualifies for updated Air Cargo Screening List Edgewood, MD – 22 October, 2015 – Smiths Detection Inc. (SDI) announces its dual-view HI-SCAN 6040-2is X-ray has become its latest system to be… Friday, 16 October Dubuque County Chooses Smiths Detection Inc. to Provide Courthouse Security System Edgewood, Md.14 October 2015– Smiths Detection Inc. (SDI) announced today that it will supply the Dubuque County, Iowa, courthouse with a new… Wednesday, 14 October Smiths Detection Inc. continues to 'Go Green' with new Sustainability Initiatives; Joins Maryland Green Registry Edgewood, Md.–14 October 2015– Smiths Detection Inc. (SDI) announces three new \"green†initiatives focused on environmentally responsible… Sunday, 27 September Smiths Detection launches HI-SCAN 6040C, a new generation of X-ray scanners to enhance security in public buildings Wiesbaden, Germany, 28 September 2015 – Smiths Detection today launches HI-SCAN 6040C, a compact checkpoint scanner designed specifically to… Tuesday, 22 September Smiths Detection Inc. wins order for airport checkpoint X-rays Edgewood, Md. – 22 September 2015 – Smiths Detection Inc. (SDI) was awarded a $6.5 million contract to supply Advanced Technology X-ray scanners,… Tuesday, 22 September Smiths Detection wins major contract with Brazilian prisons Sao Paulo, Brazil, 22 September 2015 -- Smiths Detection has won a $5.4M contract to supply the Rio de Janeiro state prison authorities with… Thursday, 17 September Copenhagen Airport adds Smiths Detection's eqo Advanced People Screening System to Checkpoints Copenhagen, 17 September 2015 – Copenhagen Airport has installed 18 of Smiths Detection's advanced eqo millimetre-wave scanners to meet new EU… Tuesday, 15 September Smiths Detection wins first major airports contract for its new IONSCAN 600 explosives trace detector Watford, UK, 15 September, 2015 – Smiths Detection has been awarded a contract by the Spanish Airport Operator (Aena) to equip 24 of its airports… Thursday, 18 June Smiths Detection Inc. Announces $27m order from U.S. Army for Mobile Medical Shelters Edgewood, Md.– 18 June 2015. Smiths Detection Inc. (SDI) today announced it has received a$27.7 million follow-on production order from the… Tuesday, 9 June Smiths Detection wins order to supply Mobile Inspection Systems to Nicaraguan Customs Edgewood, MD. – 9 June 2015 – Smiths Detection, through its partner Alvimer International, has won a contract to supply Nicaraguan Customs with… Thursday, 4 June Next-generation trace explosives detector from Smiths Detection gains France's STAC certification Watford, UK, 4 June, 2015– Smiths Detection announces that its innovative IONSCAN 600, a non-radioactive, portable explosives detector, has… Wednesday, 20 May Smiths Detection announces U.S. Army Award for Next Generation Chemical Detection Air Monitor Edgewood, Md.– 20 May 2015. Smiths Detection Inc.today announced it has been selected to move forward in a U.S. Army program for Next Generation… Wednesday, 13 May Smiths Detection Announces $23m Chemical Detector Order from the U.S. Army Edgewood, Md. – 13 May 2015 - Smiths Detection Inc. today announced that the U.S. Army Contracting Command – Aberdeen Proving Ground, in support of… Thursday, 7 May Smiths Detection Supplies Body Scanners to Manila Airport Singapore, 7 May, 2015 - Smiths Detection has won a contract to supply Manila's Ninoy Aquino International Airport with 14 advanced… Tuesday, 21 April London Luton Airport chooses Smiths Detection to drive security upgrades Watford, UK, 21 April, 2015 – Smiths Detection has won a major contract to upgrade security screening at London Luton Airport (LLA) as part of a… Wednesday, 18 March Smiths Detection wins order to supply Mobile Inspection Systems to Paraguay Customs Edgewood, MD. – 17 March 2015 – Smiths Detection, through its local partner Grupo Empresarial Preventec S.A. has won a contract to supply the… Tuesday, 17 March Smiths Detection's next-generation trace explosives detector wins ECAC approval Watford, UK, 17 March, 2015 – Smiths Detection's newly launched IONSCAN 600, a non-radioactive, portable explosives detector, has gained a key… Monday, 16 March Smiths Detection Wins Major Abu Dhabi Airport Contract Abu Dhabi, United Arab Emirates, 16 March 2015: Smiths Detection, a global leader in providing government regulated systems to detect CBRNE, has… Tuesday, 10 March Smiths Detection to supply Heathrow with advanced hold baggage scanners Smiths Detection has won a contract to supply Heathrow Airport with 17 HI-SCAN 10080 XCT scanners, a revolutionary type of X-ray inspection system… Thursday, 5 March Smiths Detection inc. expands manufacturing in Edgewood, MD RadSeeker brings radiation detection technology to Harford County Edgewood, Md. – 05 March 2015 – Smiths Detection Inc. (SDI) announces the… Tuesday, 24 February Smiths Detection expert to present at International Association of Fire Chiefs' 2015 Hazmat Conference Baltimore, Md.– 24 February 2015– Smiths Detection hazmat expert Dr. Chris Weber has been selected to give two presentations at the industry's… Sunday, 18 January Smiths Detection launches Checkpoint.Evo, an Integrated Airport Security Software Suite Wiesbaden, Germany, 18 January 2015– Smiths Detection today unveils Checkpoint.Evo, an innovative software solution that greatly enhances the… Thursday, 15 January Smiths Group VP of Government Relations Re-Elected Chair of Security Manufacturers Coalition Washington, D.C. – 15 January 2015 –Smiths Detection today announced that Elizabeth \"Sissy†Pressnell, Vice President of Government Relations for… Tuesday, 13 January Smiths Detection Wins Major Order from Emirates for Dubai World Central Dubai, United Arab Emirates (UAE), 13 January, 2015 – Smiths Detection, a global leader in providing government regulated systems to detect CBRNE… Thursday, 11 December Smiths Detection Inc. Backs U.S. Congress Passage of TSA Acquisition Reform Bills Edgewood, Md.– 11 December 2014– Smiths Detection Inc. today announced its support of two bills passed by the U.S. Congress aimed at improving how… Wednesday, 10 December Smiths Detection Inc. Announces U.S. Customs and Border Protection Order for Range of Screening Systems Edgewood, Md.– 10 December 2014– Smiths Detection Inc. today announces a five-year contract to supply X-ray scanners to U.S. Customs and Border… Thursday, 13 November HI-SCAN 6040-2is checkpoint scanner gains Standard 3 certification for Liquid Explosives Detection Wiesbaden, 13 November 2014 – Smiths Detection announces today that its advanced X-ray inspection system HI-SCAN 6040-2is HR has obtained Standard… Friday, 3 October Smiths Detection Partners Maryland Department of Business & Economic Development on National Manufacturing Day Edgewood, MD– 3 October 2014–Smiths Detection Inc. today hosted Maryland's Secretary of Department of Business & Economic Development (DBED),… Wednesday, 1 October Smiths Detection launches new large-scale cargo inspection system High operational efficiency within compact footprint Wiesbaden, Germany, 1 October 2014– Smiths Detection today launches HI-SCAN… Monday, 29 September Smiths Detection Launches Next-Generation Non-Radioactive Explosives Detector IONSCANâ\"¢600 reduces cost, time and risks with superior technology Edgewood, MD – 29 September 2014 – Smiths Detection today introduces its… Friday, 22 August Morocco Upgrades Airport Security With Smiths Detection's High-Speed XCT Baggage Scanner Vitry, France, 22 August 2014 – Smiths Detection has been awarded a contract with the Morocco Civil Aviation Authority (ONDA) to install its… Monday, 18 August Key European Certificate awarded to Smiths Detection HI-SCAN 10080 XCT used with trays Wiesbaden, 18 August 2014 – Smiths Detection's HI-SCAN 10080 XCT Explosives Detection System has become the first hold baggage screener to gain… Monday, 28 July Smiths Detection Wins Contract For Advanced High-Speed Scanner Rapid And Automatic Inspection Of Baggage At Bremen Airport Wiesbaden, 28 July 2014 – Smiths Detection has won a contract with Bremen Airport… Tuesday, 1 July Leidos Awards Smiths Detection Multi-Million Dollar Order To Support U.S. Airports Edgewood, Md. – 1 July 2014 - Smiths Detection today announces a multi-million dollar order from Leidos, the prime contractor of the Transportation… Thursday, 19 June Smiths Detection to provide cargo security at Addis Ababa Airport Vitry, France, 18 June 2014 – Smiths Detection has won a contract with the Ethiopian Airports Enterprise (EAE) to supply a range of… Wednesday, 18 June Smiths Detection products help to safeguard G7 Summit in Brussels Vitry, France, 18 June 2014 – Security for world leaders who attended this month's G7 Summit in Brussels, Belgium, was enhanced by the use of… Tuesday, 10 June Smiths Detection Wins USD 17.6 (SAR 65.9) Million Order from Key Saudi Arabian Security Establishment Dubai, United Arab Emirates, 10 June 2014 – Smiths Detection, a global leader in providing government-regulated systems to detect CBRNE threats,… Thursday, 24 April Smiths Group Organisational Changes London - 23 April 2014 - Smiths Group plc today announces the appointment of Richard Ingram as President of Smiths Detection , replacing Brian… Tuesday, 22 April Smiths Detection announces $20m chemical detector order from the US Army Edgewood, Md. – 22 April 2014 - Smiths Detection today announced a $20 million follow-on production order from the U.S. Army under the Department of… Thursday, 17 April Smiths Detection Receives US Bridge Contract For Handheld Radiation Detectors $10.2 million in RadSeeker orders from Domestic Nuclear Detection Office (DNDO) Danbury, Connecticut – 17 April 2014 – Smiths Detection today… Monday, 7 April Smiths Detection Wins First Order for High-Speed Checked Baggage Scanner HI-SCAN 10080 XCT is fastest, largest-tunnel Explosives Detection System Edgewood, MD, 7 April 2014 - Smiths Detection has been awarded its… Friday, 4 April Smiths Detection security equipment helps protect EU-Africa Summit and Obama visit Watford, 3 April, 2014 – Smiths Detection is providing a range of its advanced threat detectors to contribute to increased security for this… Wednesday, 2 April Smiths Detection Wins $63M X-Ray Scanner Order From U.S. Awarded under TSA's Advanced Technology 2 (AT-2) Contract Edgewood, Maryland, 2 April 2014 – Smiths Detection has won a $62.9 million order to… Tuesday, 1 April Smiths Detection wins air cargo inspection contract in Philippines First order for compact, adaptable vehicle scanner Singapore, 1 April 2014 – Smiths Detection today announces that its new CIP-300 Car… Thursday, 20 March Smiths Detection HI-SCAN 6040-2is gains certification for Liquid Explosives Detection Wiesbaden, 24 March 2014 – Smiths Detection announces today that its HI-SCAN 6040-2is advanced baggage X-ray scanner has been approved by the… Monday, 3 March Smiths Detection Launches New Portable Identification Technology Targeting Illicit Drugs Edgewood, Md. – 3 March 2014 – Smiths Detection has introduced an advanced handheld identifier that provides a quick and accurate field analysis… Tuesday, 25 February Smiths Detection To Supply U.S. Customs And Border Protection Miniaturized Chemical Identification Technology Danbury, CT. – 24 February 2014 – Smiths Detection has been contracted by U.S. Customs and Border Protection to supply it miniaturized technology… Tuesday, 18 February Smiths Detection Receives $42m Order From U.S. Army For Mobile Medical Shelters Edgewood, Md. – 19 February 2014 - Smiths Detection has received a $42 million follow-on production order from the U.S. Department of the Army for… Thursday, 30 January Smiths Detection To Help Safeguard Teams, Staff And Visitors At Super Bowlâ\"¢ XLVIII Edgewood, Md., 30 January 2014 – Smiths Detection was awarded a contract by the Port Authority of New York and New Jersey to help provide security… Tuesday, 28 January Smiths Detection IONSCAN 500DT Explosives Detector On 2014 TSA Air Cargo Screening 'Qualified' Technology List Edgewood, Md – 28 January 2014 – Smiths Detection's IONSCAN 500DT is included among \"qualified†technologies for Explosive Trace Detection on the… Wednesday, 22 January Smiths Detection Establishes Manufacturing Footprint in Asia The new facility in Johor will support business growth across Asia, positioning the company for long-term expansion in the region Johor Bahru,… Monday, 20 January Smiths Detection HI-SCAN 6040aTiX Gains Another Major Certification For Liquid Explosive Detection Wiesbaden, 20 January 2014 – Smiths Detection announces today that its HI-SCAN 6040aTiX advanced baggage X-ray scanner has been certified by… Tuesday, 14 January Smiths Detection To Supply X-Ray Cargo Screening Systems For Canadian Border Security Edgewood, Maryland – 14 January 2014 – Smiths Detection has won a follow-on order for over $8 million to supply mobile X-ray cargo screening… Wednesday, 20 November Smiths Detection Awarded $14M U.S. Customs And Border Protection Order Edgewood, Md. – 20 November 2013 - Smiths Detection today announced a $14.1 million order from the Department of Homeland Security (DHS) for… Tuesday, 12 November Smiths Detection Launches a Light Vehicle Screener for Checkpoints A fast and efficient solution for high density traffic areas Vitry, France, 19 November 2013 – Smiths Detection today launches the HCVL , a… Tuesday, 12 November Smiths Detection Launches New Ultra Compact Mobile Screening System for Vehicle Checkpoints Security screening solution for areas where space is a challenge Vitry, France 18 November 2013 – Smiths Detection today launches the… Monday, 11 November Congresswoman Esty Visits Smiths Detection Connecticut Operations Visit Marks High-tech Contributions to Homeland Security and the Connecticut Economy Danbury, Conn. – 7 November 2013 – Smiths Detection… Wednesday, 30 October Smiths Detection protests TSA award of contract for AT-2 passenger screening systems Edgewood, MD., 30 October, 2013 -- Smiths Detection has filed a formal protest with the U.S. Government Accountability Office (GAO) of an award by… Wednesday, 30 October Smiths Detection's HI-SCAN 145180-2is approved as TSA qualified product for air cargo screening Dual View X-ray Provides High Quality Images and Cuts Inspection Times Edgewood, Md. – 30 October 2013 – Smiths Detection's HI-SCAN 145180-2is… Tuesday, 29 October Smiths Detection's new handheld explosives identifier improves responder safety Raman-Based Technology Identifies Substances without Contact Edgewood, Md. – 29 October 2013 – Smiths Detection today introduces ACE-ID , an… Monday, 28 October New Managing Director Appointed at Smiths Detection Middle East Dubai, 28 October 2013 – Ed Christie has been appointed the new Managing Director of Smiths Detection Middle East, succeeding Vatheeri… Thursday, 24 October Smiths Detection wins prestigious innovation award for new HI-SCAN 10080 XCT X-ray scanner Wiesbaden, 24 October 2013 – Smiths Detection has won the 'Best Innovator' award, from the Airport Operators Association, for the development of… Wednesday, 23 October Smiths Detection Partners In Study To Find Toxic Risks To Firefighters Smiths Detection Partners In Study To Find Toxic Risks To Firefighters Edgewood, Maryland – 24 October 2013 – Smiths Detection has provided… Thursday, 26 September Statement by Smiths Detection about TSA Award of Contract for AT-2 Passenger Screening Systems EDGEWOOD, Md.- September 27, 2013 - Today the Transportation Security Administration (TSA) announced its decision to award a contract for Advanced… Wednesday, 25 September Smiths Detection Launches New Dual-View X-Ray System for Security Checkpoints Compact footprint and flexible design for easy installation Wiesbaden, 23 September 2013 – Smiths Detection today launches an advanced… Monday, 23 September Smiths Detection Awarded Approximately $7 Million Contract for Bottled Liquid Scanners RespondeR BLS Provides Quick and Easy Liquid Scanning Capability Edgewood, Md. – 23 September 2013 - Smiths Detection has won a contract award… Friday, 20 September Smiths Detection's HazMatID Elite Receives Silver Award for Portable Analytical Instrument Design Leading Chemical Identifier once again acknowledged for Its easy to use, portable design Edgewood, Md. – 20 September 2013 – The Smiths… Monday, 19 August Smiths Detection to supply Florida with GasID units to enhance Hazmat response capabilities Portable technology identifies potentially dangerous gas or vapor chemicals in minutes Edgewood, Md. – 20 August 2013 – Smiths Detection has… Monday, 29 July Smiths Detection launches Threat Identification Module for Liquids Upgrade Package for existing X-ray systems to fulfill EU LEDS Standard 2 Wiesbaden, Germany, July 29. 2013 - Smiths Detection today launches a… Thursday, 25 July Smiths Detection Wins approximately $7m Chemical Detector Order JCAD Protects U.S. Troops from Chemical Warfare Agents, Toxic Industrial Chemicals Edgewood, MD, July 25. 2013 - Smiths Detection today… Tuesday, 23 July Smiths Detection's HazMatID Elite Wins Gold in Excellence In Design Awards Leading Chemical Identifier Recognized for Its Easy to Use, Portable Design Edgewood, MD, July 23. 2013 - Smiths Detection's HazMatID Elite… Wednesday, 10 July Smiths Group VP of Government Relations Elected First Chair of Security Manufacturers Coalition Washington, DC, July 10. 2013 - Smiths Detection today announced that Elizabeth \"Sissy†Pressnell, Vice President of Government Relations for… Monday, 1 July Smiths Detection's high-speed XCT scanner for hold baggage receives TSA lab certification HI-SCAN 10080 XCT is fastest, largest-tunnel Explosives Detection System Edgewood, MD, July 1. 2013 - Smiths Detection's HI-SCAN 10080 XCT… Tuesday, 18 June Smiths Detection Provides Handheld Explosives Detectors to Protect Pittsburgh Marathon SABRE 5000 Units Added Critical Portable Element to Layered Event Security Edgewood, MD, June 18. 2013 - Smiths Detection has supplied the… Monday, 3 June Smiths Detection's high-speed XCT scanner for hold baggage installed at Bremen Airport First European Airport to use the new HI-SCAN 10080 XCT Wiesbaden, Germany, June 3. 2013 - Smiths Detection's HI-SCAN 10080 XCT, a… Wednesday, 29 May UK's Department for Transport approves Smiths Detection's Multi-Mode Threat Detector Authorised to detect threats in baggage, cargo and on passengers Watford, UK, May 29. 2013 - The UK Department for Transport (DfT) has… Tuesday, 28 May Smiths Detection Signs New Zealand Hold Baggage Screening Agreement Auckland, New Zealand, May 28. 2013 - Smiths Detection will upgrade Hold Baggage Screening X-ray systems (HBS) across New Zealand to EU… Monday, 13 May Smiths Detection's eqo people screener wins key EU approval Millimetre-wave system is only one of its kind to meet EU Standard 2 requirement London, UK, May 13. 2013 - Smiths Detection announces today… Wednesday, 8 May Smiths Detection X-ray Customers Offered Real-Time 24/7 Contact with MSA Security Certified Bomb Technicians Edgewood, MD, May 8. 2013 - Operators of Smiths Detection's advanced X-ray security scanners will have the option to select real-time… Thursday, 11 April Smiths Detection Supplies Explosives Detectors to Canadian Airports Toronto, Canada, April 11. 2013 - Smiths Detection has started delivery of more than 100 advanced explosives trace detection systems to… Monday, 8 April Smiths Detection Opens New Training and Service Center for the Americas State of the Art Facility Underscores Commitment to Long-Term Value for Customers Edgewood, MD, April 8. 2013 - Smiths Detection has completed… Thursday, 4 April Luxembourg Customs bolstered by Smiths Detection Cargo Scanner Vitry, April 4. 2013 - Smiths Detection today announces a contract with Luxembourg Customs to supply a mobile X-ray cargo scanner for… Wednesday, 27 March Smiths Detection wins cargo scanner contract in Azerbaijan March 27. 2013 - Smiths Detection today announces a €17.8 million contract to supply the Azerbaijan Customs authorities with high energy… Tuesday, 19 March Smiths Detection Supplies Portable Radiation Detectors for Canadian Border Security RadSeeker to be deployed at major points of entry to combat radiological, nuclear threats Toronto, ON, March 19. 2013 - Smiths Detection has… Monday, 18 March State Supreme Court Strengthens Security at New York Facilities Advanced HI-SCAN systems screen for explosives, narcotics and dangerous goods. Edgewood, MD, March 18. 2013 Smiths Detection's HI-SCAN… Wednesday, 20 February Smiths Detection Starts Supplying Mobile Medical Shelters to U.S. Army Edgewood Facility to Deliver More than 100 Dual-Use Systems under $40m contract Edgewood, MD, February 20. 2013 - Smiths Detection has… Wednesday, 13 February Smiths Detection wins major Spanish airport scanner contract Wiesbaden, Germany, February 13. 2013 - Smiths Detection has won a major contract to supply 10 Spanish airports, including Madrid, Barcelona and… Tuesday, 12 February Major U.S. Emergency Response Team Boosts Capabilities with HazMatID Elite Chemical Identifier Danbury, CT, February 12. 2013 - One of the largest state law enforcement agencies in the U.S. has bought the first of Smiths Detection's… Wednesday, 6 February Smiths Detection wins £18m UK Military Order for Bio-consumables February 6. 2013 - Watford, UK, 6 February 2013 - Smiths Detection today announces an £18.5m bio-consumables contract with the UK… Wednesday, 30 January Smiths Detection wins €19m Italian Customs Order for Cargo Scanners Vitry-sur-Seine, France, January 30. 2013 - Smiths Detection today announces a €19m contract with the Italian Customs Agency to supply… << Prev 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Next >> Browse our database of Press Releases. Press releases Friday, 13 October Japan's Narita Airport Deploys State-of-the-Art Security Technology Tokyo, Japan – Smiths Detection, a global leader in threat detection systems, has been selected to supply innovative solutions for people… Tuesday, 10 October New Smiths Detection analytics suite keeps things moving with near 100% customer uptime CORAL preventive maintenance software from Smiths Detection facilitates scheduled system downtime Inter Airport Europe, Munich – 10 October… Tuesday, 10 October Smiths Detection hold baggage screening technology to support upgrade to ECAC Standard 3 EDS at Munich Airport Wiesbaden – 10 October 2017: Smiths Detection has been selected by the District Government of Upper Bavaria to supply ECAC Standard 3 EDS hold… Thursday, 5 October Smiths Detection takes checkpoint security to a new level Smiths Detection takes checkpoint security to a new level New HI-SCAN 6040 CTiX scanner enhances security and operational… Monday, 2 October Maryland Lieutenant Governor Visits Smiths Detection to Learn About Technology to Combat Opioid Epidemic Edgewood, MD– On Tuesday, Smiths Detection, Inc. (SDI) welcomed Maryland Lt. Governor Boyd K. Rutherford to its Edgewood, Maryland facility, where… Friday, 22 September Smiths Detection wins biggest ever single order for next-generation hold baggage scanner for Frankfurt Airport Advanced HI-SCAN 10080 XCT hold baggage scanners offer flexible, sophisticated detection capabilities Wiesbaden – 22 September 2017:… Wednesday, 16 August Smiths Detection Inc. Addresses Fentanyl Crisis with Roundtable Seminars on Exposure Prevention at ASIS International Edgewood, MD – Smiths Detection Inc. (SDI) expert Dr. Michael Frunzi will moderate a series of special roundtable seminars at ASIS International… Wednesday, 2 August Smiths Detection Technology Protects First Responders Against the Threat of Fentanyl Exposure Edgewood, MD. – Smiths Detection Inc. (SDI) is at the forefront of arming first responders with solutions to safeguard against the presence of… Thursday, 27 July Smiths Detection gains STAC certification for Checkpoint.Evoplus Wiesbaden – 27 July 2017: Checkpoint.Evoplus from Smiths Detection has been successfully assessed and certified by STAC, the French civil aviation… Thursday, 20 July London Gatwick Airport Again Selects Smiths Detection's CTX 9800 Hold Baggage Explosives Detection System LONDON – Smiths Detection LLC , formerly Morpho Detection LLC, today announced a second contract with Gatwick Airport to supply and service eleven… Wednesday, 19 July Smiths Detection offers onsite EDS CB software upgrades Wiesbaden – Smiths Detection can now upgrade previously installed checkpoint scanners to ECAC EDS CB standards using its approved EDS Cabin… Tuesday, 11 July Smiths Detection Inc. Launches New E-Commerce Site for all U.S. Markets Edgewood, MD – Smiths Detection Inc. (SDI) has launched www.MySmithsDetection.com , a new e-commerce management platform aimed at providing leading… Thursday, 29 June Smiths Detection's IONSCAN 600 Explosives Trace Detection System Receives Certification Edgewood, Md. – Smiths Detection's IONSCAN 600 has passed certification testing for the explosives trace detection system by Transportation… Tuesday, 13 June EL AL Airlines orders additional Smiths Detection CTX 5800 hold baggage explosives detection systems NEWARK, Calif. – Smiths Detection LLC , formerly Morpho Detection LLC,today announced that EL AL Airlines has purchased 11 additional CTX… Friday, 9 June Smiths Detection achieves four more EDS cabin baggage screening approvals Range of checkpoint scanners now meet latest security standards Wiesbaden – 9 June 2017: Smiths Detection continues to gain EDS Cabin Baggage… Thursday, 1 June Smiths Group agrees to sell Morpho Detection's former trace business Smiths Group plc (\"Smiths Groupâ€) today announces that it has entered into a binding agreement with OSI Systems Inc to sell the explosive trace… Wednesday, 31 May Smiths Detection Receives Order for CTX 9800 Explosives Detection Systems Valued at Over $45M NEWARK, Calif. – Smiths Detection , formerly Morpho Detection – Safran, today announced the Transportation Security Administration (TSA) has… Tuesday, 23 May Cochin International Airport Selects Smiths Detection's CTX 9800 for Next-Generation Hold Baggage Screening BENGALURU, India – Smiths Detection , formerly Morpho Detection – Safran, today announced that India's Cochin International Airport has deployed… Tuesday, 16 May Smiths Detection Wins London Gatwick Airport Contract for CTX 9800 Hold Baggage Explosives Detection Systems Cambridge, UK – Smiths Detection , formerly Morpho Detection – Safran, today announced a contract with London Gatwick Airport Limited to supply and… Monday, 15 May Checkpoint.Evoplus launched today at Airport Show in Dubai Smiths Detection has chosen the Airport Show in Dubai to unveil its advanced screening and management platform - Checkpoint.Evoplus. This… Friday, 7 April Smiths Group announces completion of acquisition of Morpho Detection Following the clearance from US Department of Justice on March 31st 2017 Smiths Group plc today confirms that it has completed the acquisition of… Wednesday, 5 April Smiths Detection Inc. Honors Somerset County Sheriff's Office at Maine Sheriffs' Association Annual Conference Rockport, ME – Smiths Detection Inc. (SDI) presented the Somerset County Sheriff's Office on Thursday, March 30th, with a Pioneer Award at the… Monday, 27 March UK Ministry of Defence selects Smiths Detection for airport security contract London (UK) – 24 March 2017 – Smiths Detection has been awarded a new, multi-million pound contract with the UK Ministry of Defence (MOD) to… Friday, 24 March Smiths Detection to supply Dutch Airports with advanced hold baggage scanners Wiesbaden – 24 March 2017: Smiths Detection has won a significant contract to supply Amsterdam Airport Schiphol with new hold baggage screening… Friday, 24 March Smiths Detection Inc. Partners with Duke University in Deep Learning Research for Airport Screening Edgewood, Md. – Smiths Detection Inc. (SDI) announced that it is partnering with the Duke University Edmund T. Pratt Jr. School of Engineering,… Monday, 13 March Smiths Detection to Unveil First Dual-View X-ray Screeners for use in Cruise Line Baggage Screening Miami, FL – Smiths Detection Inc. (SDI), along with maritime security provider American Guard Services, Inc., unveiled the first dual-view X-ray… Monday, 6 March Smiths Detection Announces New Distribution Partner in Brazil Edgewood, MD – Smiths Detection Inc., (SDI) a threat detection technology leader, announced today that it has entered into an agreement with… Wednesday, 1 March Smiths Detection Deploys First Smart Security Checkpoint at Kansai Airport in Japan Osaka, Japan , – Smiths Detection is working with Kansai Airport to deploy the first ever Smart Security checkpoint in Japan. The Smart Security… Thursday, 23 February First County in Maine Installs Body Scanner from Smiths Detection Madison, ME – Smiths Detection Inc. (SDI), in partnership with its Northeast distributor, Access Control Systems Inc., announced that the Somerset… Monday, 13 February Smiths Detection's IONSCAN 600 receives CAAC approval Bringing the next generation explosives and narcotics trace detector to passenger and baggage screening at Chinese airports SINGAPORE, 13… Tuesday, 7 February SDI Statement on House Homeland Security Committee Report on America's Aviation Security Edgewood, Md. – Smiths Detection Inc. (SDI) President, Dan Gelston, today issued the following statement in response to a new report from the House… Wednesday, 25 January Smiths Detection's HI-SCAN 6040aTiX X-ray System Achieves Industry First EDS Cabin Baggage Screening Certification First cabin baggage X-ray system to pass new ECAC explosives detection standard Benefits include enhanced airport security and… Thursday, 19 January Smiths Group welcomes European Commission clearance for acquisition of Morpho Detection Smiths Group plc (\"Smiths Groupâ€) welcomes the European Commission's clearance of the proposed acquisition of Morpho Detection. In order to… Monday, 9 January Smiths Detection Inc. Expert to Present on Tactical Chemistry at the Florida HazMat Training Symposium Daytona Beach, FL – January 9, 2017 – Smiths Detection Inc. (SDI) expert, Dr. Chris Weber, will deliver an interactive program on tactical… Thursday, 8 December Official opening of Smiths Detection's new UK centre of excellence for trace detection LONDON (UK) – Smiths Detection today announced the official opening of its new UK centre of excellence for trace detection, located in Hemel… Tuesday, 8 November Smiths Detection Launches 'Aviation Insider': New Global Web Portal for Aviation Security New website, \"aviation-insider.comâ€, set to showcase aviation security industry best practice Portal launches as Smiths Detection… Monday, 31 October Smiths Detection Inc's Dual-View HI-SCAN 180180-2is pro Qualifies for TSA's Air Cargo Screening Technology List Edgewood, MD – Smiths Detection Inc. (SDI) today announces that its advanced dual-view X-ray cargo scanner, the HI-SCAN 180180-2is pro, has become… Friday, 30 September Smiths Detection Inc. Announces Support for Five New ThanksUSA's \"Pathway to Tech/Stem†Scholarships Edgewood, Md. – Smiths Detection Inc. (SDI) announced it will support five new scholarships through ThanksUSA's \"Pathway to Tech/STEM†program,… Wednesday, 28 September Smiths Detection supplies next generation baggage screening technology to Berlin Brandenburg Airport BER Wiesbaden – Smiths Detection has been contracted by the Procurement Agency of the Federal Ministry of the Interior to provide hold baggage… Wednesday, 14 September Smiths Detection's TRACE-PRO now identifies the explosive - TATP Watford – Smiths Detection's newly launched TRACE-PRO â\"¢, a non-radioactive, hand-held explosive threat detector, now has the additional capability… Thursday, 18 August Smiths Detection Inc. Honors Worcester County at American Correctional Association Annual Conference Boston, MA – Smiths Detection Inc. (SDI) honored Worcester County Jail & House of Correction on Tuesday, August 9, with a recognition award at… Wednesday, 10 August Egyptian Ministry of Defence chooses Smiths Detection to provide advanced aviation security systems Wiesbaden, 10 August 2016 – Smiths Detection has been awarded contracts worth almost £19m by Falcon Group to provide advanced detection systems… Thursday, 7 July Smiths Detection Inc. expert to present at international association of bomb technicians and investigators' 44th annual international training conference HALIFAX, NOVA SCOTIA – July 7, 2016 – Smiths Detection Inc. (SDI) hazmat expert Dr. Chris Weber will give a presentation geared toward explosives… Tuesday, 21 June Smiths Detection Inc. receives $41M follow-on order from DNDO for handheld radioisotope identifiers Edgewood, Md. – 21 June 2016 – Smiths Detection Inc. (SDI) today announces a new task order award of $40.9 million for its RadSeeker handheld… Thursday, 2 June Smiths Detection extends IONSCAN 600 capability to detect narcotics Watford, UK, 2 June 2016 – Smiths Detection's IONSCAN 600 trace detector has been enhanced to detect and identify narcotics, in addition to its… Tuesday, 10 May Smiths Detection wins large contract to equip new airport in Turkmenistan capital Wiesbaden, 10 May 2016 – Smiths Detection has won a significant contract from Polimeks Construction to supply a comprehensive range of… Wednesday, 27 April Smiths Detection Announces $17M Chemical Detector Order from the US Army Edgewood, MD – 27 April 2016 - Smiths Detection Inc. (SDI) today announced a $17.2 million follow-on production order from the U.S. Army… Tuesday, 26 April Smiths Group focuses on global technology in security with $710m acquisition 25 April 2016 - Smiths Group plc (\"Smiths Group†or the \"Groupâ€) today announces that it has entered into an agreement to acquire Morpho Detection… Monday, 4 April Smiths Detection Inc. Helps Secure SUPER BOWL 50 Edgewood, Md. – 4 April 2016 – Smiths Detection Inc. (SDI) today announces its equipment was used by multiple local and national security and law… Wednesday, 16 March Smiths Detection Inc. Wins $65 Million, Five-Year Agreement with Federal Protective Service Edgewood, Md. – 16 March 2016 – Smiths Detection Inc. (SDI) today announced a $65 million five-year agreement to provide X-ray inspection systems to… Monday, 29 February Smiths Detection Inc. employees recognized for green leadership at Maryland manufacturing ceremony Edgewood, Md.– 29 February 2016 – Smiths Detection Inc. (SDI) employees have been recognized by the Regional Manufacturing Institute (RMI) for… Thursday, 4 February Smiths Detection Inc. receives follow-on order from U.S. Army Reserves for its Mobile Protective Shelters Edgewood, Md. – 04 February 2016 - Smiths Detection Inc. (SDI) today announces it has received a follow-on order from the U.S. Army Reserves for its… Sunday, 24 January Smiths Detection Inc. wins award from DNDO for handheld RadSeeker detectors Edgewood, Md. – 27 January 2016 – Smiths Detection Inc. (SDI) today announces an initial award of $1.27 million for its RadSeeker handheld… Tuesday, 10 November Smiths Detection launches TRACE-PRO, a revolutionary explosives detector for fast identification and evidence collection Watford, UK, 17th November 2015 – Smiths Detection announces the launch of TRACE-PRO, a compact and ruggedised, non-radioactive Explosives Trace… Wednesday, 28 October State Senator Bob Cassilly tours Smiths Detection Inc. U.S. HQ in Edgewood, MD Edgewood, Md.–28 October 2015–Smiths Detection Inc. (SDI) today welcomed Maryland State Senator Bob Cassilly on a tour of its U.S. headquarters in… Tuesday, 27 October Smiths Detection wins GBP6 million Chemical Agent Detector contract to equip new generation of UK Military vehicles WATFORD, England, October 26, 2015. Smiths Detection has been awarded a contract worth almost GBP6 million from General Dynamics UK to supply… Tuesday, 27 October Smiths Detection launches iCmoreâ\"¢ automatic detection software for cargo inspection X-ray systems Software addition speeds throughput and boosts detection accuracy, helping to improve traffic flows and secure valuable tax revenues. Thursday, 22 October Smiths Detection Inc.'s dual-view HI-SCAN 6040-2is qualifies for updated Air Cargo Screening List Edgewood, MD – 22 October, 2015 – Smiths Detection Inc. (SDI) announces its dual-view HI-SCAN 6040-2is X-ray has become its latest system to be… Friday, 16 October Dubuque County Chooses Smiths Detection Inc. to Provide Courthouse Security System Edgewood, Md.14 October 2015– Smiths Detection Inc. (SDI) announced today that it will supply the Dubuque County, Iowa, courthouse with a new… Wednesday, 14 October Smiths Detection Inc. continues to 'Go Green' with new Sustainability Initiatives; Joins Maryland Green Registry Edgewood, Md.–14 October 2015– Smiths Detection Inc. (SDI) announces three new \"green†initiatives focused on environmentally responsible… Sunday, 27 September Smiths Detection launches HI-SCAN 6040C, a new generation of X-ray scanners to enhance security in public buildings Wiesbaden, Germany, 28 September 2015 – Smiths Detection today launches HI-SCAN 6040C, a compact checkpoint scanner designed specifically to… Tuesday, 22 September Smiths Detection Inc. wins order for airport checkpoint X-rays Edgewood, Md. – 22 September 2015 – Smiths Detection Inc. (SDI) was awarded a $6.5 million contract to supply Advanced Technology X-ray scanners,… Tuesday, 22 September Smiths Detection wins major contract with Brazilian prisons Sao Paulo, Brazil, 22 September 2015 -- Smiths Detection has won a $5.4M contract to supply the Rio de Janeiro state prison authorities with… Thursday, 17 September Copenhagen Airport adds Smiths Detection's eqo Advanced People Screening System to Checkpoints Copenhagen, 17 September 2015 – Copenhagen Airport has installed 18 of Smiths Detection's advanced eqo millimetre-wave scanners to meet new EU… Tuesday, 15 September Smiths Detection wins first major airports contract for its new IONSCAN 600 explosives trace detector Watford, UK, 15 September, 2015 – Smiths Detection has been awarded a contract by the Spanish Airport Operator (Aena) to equip 24 of its airports… Thursday, 18 June Smiths Detection Inc. Announces $27m order from U.S. Army for Mobile Medical Shelters Edgewood, Md.– 18 June 2015. Smiths Detection Inc. (SDI) today announced it has received a$27.7 million follow-on production order from the… Tuesday, 9 June Smiths Detection wins order to supply Mobile Inspection Systems to Nicaraguan Customs Edgewood, MD. – 9 June 2015 – Smiths Detection, through its partner Alvimer International, has won a contract to supply Nicaraguan Customs with… Thursday, 4 June Next-generation trace explosives detector from Smiths Detection gains France's STAC certification Watford, UK, 4 June, 2015– Smiths Detection announces that its innovative IONSCAN 600, a non-radioactive, portable explosives detector, has… Wednesday, 20 May Smiths Detection announces U.S. Army Award for Next Generation Chemical Detection Air Monitor Edgewood, Md.– 20 May 2015. Smiths Detection Inc.today announced it has been selected to move forward in a U.S. Army program for Next Generation… Wednesday, 13 May Smiths Detection Announces $23m Chemical Detector Order from the U.S. Army Edgewood, Md. – 13 May 2015 - Smiths Detection Inc. today announced that the U.S. Army Contracting Command – Aberdeen Proving Ground, in support of… Thursday, 7 May Smiths Detection Supplies Body Scanners to Manila Airport Singapore, 7 May, 2015 - Smiths Detection has won a contract to supply Manila's Ninoy Aquino International Airport with 14 advanced… Tuesday, 21 April London Luton Airport chooses Smiths Detection to drive security upgrades Watford, UK, 21 April, 2015 – Smiths Detection has won a major contract to upgrade security screening at London Luton Airport (LLA) as part of a… Wednesday, 18 March Smiths Detection wins order to supply Mobile Inspection Systems to Paraguay Customs Edgewood, MD. – 17 March 2015 – Smiths Detection, through its local partner Grupo Empresarial Preventec S.A. has won a contract to supply the… Tuesday, 17 March Smiths Detection's next-generation trace explosives detector wins ECAC approval Watford, UK, 17 March, 2015 – Smiths Detection's newly launched IONSCAN 600, a non-radioactive, portable explosives detector, has gained a key… Monday, 16 March Smiths Detection Wins Major Abu Dhabi Airport Contract Abu Dhabi, United Arab Emirates, 16 March 2015: Smiths Detection, a global leader in providing government regulated systems to detect CBRNE, has… Tuesday, 10 March Smiths Detection to supply Heathrow with advanced hold baggage scanners Smiths Detection has won a contract to supply Heathrow Airport with 17 HI-SCAN 10080 XCT scanners, a revolutionary type of X-ray inspection system… Thursday, 5 March Smiths Detection inc. expands manufacturing in Edgewood, MD RadSeeker brings radiation detection technology to Harford County Edgewood, Md. – 05 March 2015 – Smiths Detection Inc. (SDI) announces the… Tuesday, 24 February Smiths Detection expert to present at International Association of Fire Chiefs' 2015 Hazmat Conference Baltimore, Md.– 24 February 2015– Smiths Detection hazmat expert Dr. Chris Weber has been selected to give two presentations at the industry's… Sunday, 18 January Smiths Detection launches Checkpoint.Evo, an Integrated Airport Security Software Suite Wiesbaden, Germany, 18 January 2015– Smiths Detection today unveils Checkpoint.Evo, an innovative software solution that greatly enhances the… Thursday, 15 January Smiths Group VP of Government Relations Re-Elected Chair of Security Manufacturers Coalition Washington, D.C. – 15 January 2015 –Smiths Detection today announced that Elizabeth \"Sissy†Pressnell, Vice President of Government Relations for… Tuesday, 13 January Smiths Detection Wins Major Order from Emirates for Dubai World Central Dubai, United Arab Emirates (UAE), 13 January, 2015 – Smiths Detection, a global leader in providing government regulated systems to detect CBRNE… Thursday, 11 December Smiths Detection Inc. Backs U.S. Congress Passage of TSA Acquisition Reform Bills Edgewood, Md.– 11 December 2014– Smiths Detection Inc. today announced its support of two bills passed by the U.S. Congress aimed at improving how… Wednesday, 10 December Smiths Detection Inc. Announces U.S. Customs and Border Protection Order for Range of Screening Systems Edgewood, Md.– 10 December 2014– Smiths Detection Inc. today announces a five-year contract to supply X-ray scanners to U.S. Customs and Border… Thursday, 13 November HI-SCAN 6040-2is checkpoint scanner gains Standard 3 certification for Liquid Explosives Detection Wiesbaden, 13 November 2014 – Smiths Detection announces today that its advanced X-ray inspection system HI-SCAN 6040-2is HR has obtained Standard… Friday, 3 October Smiths Detection Partners Maryland Department of Business & Economic Development on National Manufacturing Day Edgewood, MD– 3 October 2014–Smiths Detection Inc. today hosted Maryland's Secretary of Department of Business & Economic Development (DBED),… Wednesday, 1 October Smiths Detection launches new large-scale cargo inspection system High operational efficiency within compact footprint Wiesbaden, Germany, 1 October 2014– Smiths Detection today launches HI-SCAN… Monday, 29 September Smiths Detection Launches Next-Generation Non-Radioactive Explosives Detector IONSCANâ\"¢600 reduces cost, time and risks with superior technology Edgewood, MD – 29 September 2014 – Smiths Detection today introduces its… Friday, 22 August Morocco Upgrades Airport Security With Smiths Detection's High-Speed XCT Baggage Scanner Vitry, France, 22 August 2014 – Smiths Detection has been awarded a contract with the Morocco Civil Aviation Authority (ONDA) to install its… Monday, 18 August Key European Certificate awarded to Smiths Detection HI-SCAN 10080 XCT used with trays Wiesbaden, 18 August 2014 – Smiths Detection's HI-SCAN 10080 XCT Explosives Detection System has become the first hold baggage screener to gain… Monday, 28 July Smiths Detection Wins Contract For Advanced High-Speed Scanner Rapid And Automatic Inspection Of Baggage At Bremen Airport Wiesbaden, 28 July 2014 – Smiths Detection has won a contract with Bremen Airport… Tuesday, 1 July Leidos Awards Smiths Detection Multi-Million Dollar Order To Support U.S. Airports Edgewood, Md. – 1 July 2014 - Smiths Detection today announces a multi-million dollar order from Leidos, the prime contractor of the Transportation… Thursday, 19 June Smiths Detection to provide cargo security at Addis Ababa Airport Vitry, France, 18 June 2014 – Smiths Detection has won a contract with the Ethiopian Airports Enterprise (EAE) to supply a range of… Wednesday, 18 June Smiths Detection products help to safeguard G7 Summit in Brussels Vitry, France, 18 June 2014 – Security for world leaders who attended this month's G7 Summit in Brussels, Belgium, was enhanced by the use of… Tuesday, 10 June Smiths Detection Wins USD 17.6 (SAR 65.9) Million Order from Key Saudi Arabian Security Establishment Dubai, United Arab Emirates, 10 June 2014 – Smiths Detection, a global leader in providing government-regulated systems to detect CBRNE threats,… Thursday, 24 April Smiths Group Organisational Changes London - 23 April 2014 - Smiths Group plc today announces the appointment of Richard Ingram as President of Smiths Detection , replacing Brian… Tuesday, 22 April Smiths Detection announces $20m chemical detector order from the US Army Edgewood, Md. – 22 April 2014 - Smiths Detection today announced a $20 million follow-on production order from the U.S. Army under the Department of… Thursday, 17 April Smiths Detection Receives US Bridge Contract For Handheld Radiation Detectors $10.2 million in RadSeeker orders from Domestic Nuclear Detection Office (DNDO) Danbury, Connecticut – 17 April 2014 – Smiths Detection today… Monday, 7 April Smiths Detection Wins First Order for High-Speed Checked Baggage Scanner HI-SCAN 10080 XCT is fastest, largest-tunnel Explosives Detection System Edgewood, MD, 7 April 2014 - Smiths Detection has been awarded its… Friday, 4 April Smiths Detection security equipment helps protect EU-Africa Summit and Obama visit Watford, 3 April, 2014 – Smiths Detection is providing a range of its advanced threat detectors to contribute to increased security for this… Wednesday, 2 April Smiths Detection Wins $63M X-Ray Scanner Order From U.S. Awarded under TSA's Advanced Technology 2 (AT-2) Contract Edgewood, Maryland, 2 April 2014 – Smiths Detection has won a $62.9 million order to… Tuesday, 1 April Smiths Detection wins air cargo inspection contract in Philippines First order for compact, adaptable vehicle scanner Singapore, 1 April 2014 – Smiths Detection today announces that its new CIP-300 Car… Thursday, 20 March Smiths Detection HI-SCAN 6040-2is gains certification for Liquid Explosives Detection Wiesbaden, 24 March 2014 – Smiths Detection announces today that its HI-SCAN 6040-2is advanced baggage X-ray scanner has been approved by the… Monday, 3 March Smiths Detection Launches New Portable Identification Technology Targeting Illicit Drugs Edgewood, Md. – 3 March 2014 – Smiths Detection has introduced an advanced handheld identifier that provides a quick and accurate field analysis… Tuesday, 25 February Smiths Detection To Supply U.S. Customs And Border Protection Miniaturized Chemical Identification Technology Danbury, CT. – 24 February 2014 – Smiths Detection has been contracted by U.S. Customs and Border Protection to supply it miniaturized technology… Tuesday, 18 February Smiths Detection Receives $42m Order From U.S. Army For Mobile Medical Shelters Edgewood, Md. – 19 February 2014 - Smiths Detection has received a $42 million follow-on production order from the U.S. Department of the Army for… Thursday, 30 January Smiths Detection To Help Safeguard Teams, Staff And Visitors At Super Bowlâ\"¢ XLVIII Edgewood, Md., 30 January 2014 – Smiths Detection was awarded a contract by the Port Authority of New York and New Jersey to help provide security… Tuesday, 28 January Smiths Detection IONSCAN 500DT Explosives Detector On 2014 TSA Air Cargo Screening 'Qualified' Technology List Edgewood, Md – 28 January 2014 – Smiths Detection's IONSCAN 500DT is included among \"qualified†technologies for Explosive Trace Detection on the… Wednesday, 22 January Smiths Detection Establishes Manufacturing Footprint in Asia The new facility in Johor will support business growth across Asia, positioning the company for long-term expansion in the region Johor Bahru,… Monday, 20 January Smiths Detection HI-SCAN 6040aTiX Gains Another Major Certification For Liquid Explosive Detection Wiesbaden, 20 January 2014 – Smiths Detection announces today that its HI-SCAN 6040aTiX advanced baggage X-ray scanner has been certified by… Tuesday, 14 January Smiths Detection To Supply X-Ray Cargo Screening Systems For Canadian Border Security Edgewood, Maryland – 14 January 2014 – Smiths Detection has won a follow-on order for over $8 million to supply mobile X-ray cargo screening… Wednesday, 20 November Smiths Detection Awarded $14M U.S. Customs And Border Protection Order Edgewood, Md. – 20 November 2013 - Smiths Detection today announced a $14.1 million order from the Department of Homeland Security (DHS) for… Tuesday, 12 November Smiths Detection Launches a Light Vehicle Screener for Checkpoints A fast and efficient solution for high density traffic areas Vitry, France, 19 November 2013 – Smiths Detection today launches the HCVL , a… Tuesday, 12 November Smiths Detection Launches New Ultra Compact Mobile Screening System for Vehicle Checkpoints Security screening solution for areas where space is a challenge Vitry, France 18 November 2013 – Smiths Detection today launches the… Monday, 11 November Congresswoman Esty Visits Smiths Detection Connecticut Operations Visit Marks High-tech Contributions to Homeland Security and the Connecticut Economy Danbury, Conn. – 7 November 2013 – Smiths Detection… Wednesday, 30 October Smiths Detection protests TSA award of contract for AT-2 passenger screening systems Edgewood, MD., 30 October, 2013 -- Smiths Detection has filed a formal protest with the U.S. Government Accountability Office (GAO) of an award by… Wednesday, 30 October Smiths Detection's HI-SCAN 145180-2is approved as TSA qualified product for air cargo screening Dual View X-ray Provides High Quality Images and Cuts Inspection Times Edgewood, Md. – 30 October 2013 – Smiths Detection's HI-SCAN 145180-2is… Tuesday, 29 October Smiths Detection's new handheld explosives identifier improves responder safety Raman-Based Technology Identifies Substances without Contact Edgewood, Md. – 29 October 2013 – Smiths Detection today introduces ACE-ID , an… Monday, 28 October New Managing Director Appointed at Smiths Detection Middle East Dubai, 28 October 2013 – Ed Christie has been appointed the new Managing Director of Smiths Detection Middle East, succeeding Vatheeri… Thursday, 24 October Smiths Detection wins prestigious innovation award for new HI-SCAN 10080 XCT X-ray scanner Wiesbaden, 24 October 2013 – Smiths Detection has won the 'Best Innovator' award, from the Airport Operators Association, for the development of… Wednesday, 23 October Smiths Detection Partners In Study To Find Toxic Risks To Firefighters Smiths Detection Partners In Study To Find Toxic Risks To Firefighters Edgewood, Maryland – 24 October 2013 – Smiths Detection has provided… Thursday, 26 September Statement by Smiths Detection about TSA Award of Contract for AT-2 Passenger Screening Systems EDGEWOOD, Md.- September 27, 2013 - Today the Transportation Security Administration (TSA) announced its decision to award a contract for Advanced… Wednesday, 25 September Smiths Detection Launches New Dual-View X-Ray System for Security Checkpoints Compact footprint and flexible design for easy installation Wiesbaden, 23 September 2013 – Smiths Detection today launches an advanced… Monday, 23 September Smiths Detection Awarded Approximately $7 Million Contract for Bottled Liquid Scanners RespondeR BLS Provides Quick and Easy Liquid Scanning Capability Edgewood, Md. – 23 September 2013 - Smiths Detection has won a contract award… Friday, 20 September Smiths Detection's HazMatID Elite Receives Silver Award for Portable Analytical Instrument Design Leading Chemical Identifier once again acknowledged for Its easy to use, portable design Edgewood, Md. – 20 September 2013 – The Smiths… Monday, 19 August Smiths Detection to supply Florida with GasID units to enhance Hazmat response capabilities Portable technology identifies potentially dangerous gas or vapor chemicals in minutes Edgewood, Md. – 20 August 2013 – Smiths Detection has… Monday, 29 July Smiths Detection launches Threat Identification Module for Liquids Upgrade Package for existing X-ray systems to fulfill EU LEDS Standard 2 Wiesbaden, Germany, July 29. 2013 - Smiths Detection today launches a… Thursday, 25 July Smiths Detection Wins approximately $7m Chemical Detector Order JCAD Protects U.S. Troops from Chemical Warfare Agents, Toxic Industrial Chemicals Edgewood, MD, July 25. 2013 - Smiths Detection today… Tuesday, 23 July Smiths Detection's HazMatID Elite Wins Gold in Excellence In Design Awards Leading Chemical Identifier Recognized for Its Easy to Use, Portable Design Edgewood, MD, July 23. 2013 - Smiths Detection's HazMatID Elite… Wednesday, 10 July Smiths Group VP of Government Relations Elected First Chair of Security Manufacturers Coalition Washington, DC, July 10. 2013 - Smiths Detection today announced that Elizabeth \"Sissy†Pressnell, Vice President of Government Relations for… Monday, 1 July Smiths Detection's high-speed XCT scanner for hold baggage receives TSA lab certification HI-SCAN 10080 XCT is fastest, largest-tunnel Explosives Detection System Edgewood, MD, July 1. 2013 - Smiths Detection's HI-SCAN 10080 XCT… Tuesday, 18 June Smiths Detection Provides Handheld Explosives Detectors to Protect Pittsburgh Marathon SABRE 5000 Units Added Critical Portable Element to Layered Event Security Edgewood, MD, June 18. 2013 - Smiths Detection has supplied the… Monday, 3 June Smiths Detection's high-speed XCT scanner for hold baggage installed at Bremen Airport First European Airport to use the new HI-SCAN 10080 XCT Wiesbaden, Germany, June 3. 2013 - Smiths Detection's HI-SCAN 10080 XCT, a… Wednesday, 29 May UK's Department for Transport approves Smiths Detection's Multi-Mode Threat Detector Authorised to detect threats in baggage, cargo and on passengers Watford, UK, May 29. 2013 - The UK Department for Transport (DfT) has… Tuesday, 28 May Smiths Detection Signs New Zealand Hold Baggage Screening Agreement Auckland, New Zealand, May 28. 2013 - Smiths Detection will upgrade Hold Baggage Screening X-ray systems (HBS) across New Zealand to EU… Monday, 13 May Smiths Detection's eqo people screener wins key EU approval Millimetre-wave system is only one of its kind to meet EU Standard 2 requirement London, UK, May 13. 2013 - Smiths Detection announces today… Wednesday, 8 May Smiths Detection X-ray Customers Offered Real-Time 24/7 Contact with MSA Security Certified Bomb Technicians Edgewood, MD, May 8. 2013 - Operators of Smiths Detection's advanced X-ray security scanners will have the option to select real-time… Thursday, 11 April Smiths Detection Supplies Explosives Detectors to Canadian Airports Toronto, Canada, April 11. 2013 - Smiths Detection has started delivery of more than 100 advanced explosives trace detection systems to… Monday, 8 April Smiths Detection Opens New Training and Service Center for the Americas State of the Art Facility Underscores Commitment to Long-Term Value for Customers Edgewood, MD, April 8. 2013 - Smiths Detection has completed… Thursday, 4 April Luxembourg Customs bolstered by Smiths Detection Cargo Scanner Vitry, April 4. 2013 - Smiths Detection today announces a contract with Luxembourg Customs to supply a mobile X-ray cargo scanner for… Wednesday, 27 March Smiths Detection wins cargo scanner contract in Azerbaijan March 27. 2013 - Smiths Detection today announces a €17.8 million contract to supply the Azerbaijan Customs authorities with high energy… Tuesday, 19 March Smiths Detection Supplies Portable Radiation Detectors for Canadian Border Security RadSeeker to be deployed at major points of entry to combat radiological, nuclear threats Toronto, ON, March 19. 2013 - Smiths Detection has… Monday, 18 March State Supreme Court Strengthens Security at New York Facilities Advanced HI-SCAN systems screen for explosives, narcotics and dangerous goods. Edgewood, MD, March 18. 2013 Smiths Detection's HI-SCAN… Wednesday, 20 February Smiths Detection Starts Supplying Mobile Medical Shelters to U.S. Army Edgewood Facility to Deliver More than 100 Dual-Use Systems under $40m contract Edgewood, MD, February 20. 2013 - Smiths Detection has… Wednesday, 13 February Smiths Detection wins major Spanish airport scanner contract Wiesbaden, Germany, February 13. 2013 - Smiths Detection has won a major contract to supply 10 Spanish airports, including Madrid, Barcelona and… Tuesday, 12 February Major U.S. Emergency Response Team Boosts Capabilities with HazMatID Elite Chemical Identifier Danbury, CT, February 12. 2013 - One of the largest state law enforcement agencies in the U.S. has bought the first of Smiths Detection's… Wednesday, 6 February Smiths Detection wins £18m UK Military Order for Bio-consumables February 6. 2013 - Watford, UK, 6 February 2013 - Smiths Detection today announces an £18.5m bio-consumables contract with the UK… Wednesday, 30 January Smiths Detection wins €19m Italian Customs Order for Cargo Scanners Vitry-sur-Seine, France, January 30. 2013 - Smiths Detection today announces a €19m contract with the Italian Customs Agency to supply… << Prev 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Next >> Browse our database of Press Releases. First cabin baggage X-ray system to pass new ECAC explosives detection standard Benefits include enhanced airport security and… New website, \"aviation-insider.comâ€, set to showcase aviation security industry best practice Portal launches as Smiths Detection… Speak to Our Sales Team Ask us a Question Submit your question and we'll get back to you as soon as possible."
  ]
}