{
  "company": "www.melissa.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 66,
    "-1": 9
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 9,
      "0": 66
    }
  },
  "sample_docs": [
    "Visit us at booth #608 June 15-18 in Boston Help | About Us | Resources | Partners | Site Map | Privacy | USPS Trademarks Data Quality Tools | Software | Mailing Lists | Data Enhancement Services © Copyright 2009 by Melissa DATA Corp. All trademarks are used as property of their owners.",
    "Stop Bad Data from Entering Your Systems and Ensure Records are Up-to-Date and Complete Personator Consumer is the all-in-one Web service that you can easily integrate into your e-commerce, CRM, and mobile applications to capture verified U.S. and Canada consumer data – and enrich missing elements (email address, phone number, postal address, business info, and demographics). Identify potential fraud by matching a name to an address to validate identity Prevent bad data from entering your systems with real-time address, email, phone, and name validation Complete your customer and prospect records by adding missing email and postal address, phone number, and name (or business name) Gain insight by enriching records with detailed demographic, psychographic, and geographic data elements Personator Consumer Capabilities Address Verification Verify, correct, and standardize U.S., Canada, and international addresses to local postal formats for over 240 countries to ensure deliverability. Phone Verification Verify U.S., Canada, and international numbers, append useful geographic information associated with the phone number, and perform premium real-time checks to distinguish live numbers and phone types. Consumer Demographic Personator provides detailed demographics on over 250 U.S. individuals and 170 million households including household income, marital status, residence data, credit information, and more. Identity Matching Fill the gaps in your consumer records by adding missing names, phone numbers, email addresses, and postal addresses. Change of Address Personator utilizes proprietary change of address technology to update records with over 10 years of move history. Personator Move does not require compliance with USPS Move Update requirements and no mailing is required for change of address processing. Email Verification Validate and parse email addresses, correct common typographical errors, and standardize email addresses to improve deliverability and reduce spam. Features real-time email mailbox verification to remove up to 95% of bad emails at point of entry. Geocoding Personator converts U.S., Canada and international postal addresses to a precise latitude and longitude coordinate for mapping, target marketing, logistics, and other business uses. Personator Service Options Confirm Personator's basic service package includes address, email, phone, and name verification for real-time or batch processing needs. Enrich Add the Enrich tier of service to fill in missing gaps and update your contact records with the addition of: Complete Records: add consumer and business names, phone numbers, email addresses, and postal addresses Change of Address: update the addresses of U.S. and Canadian contacts that have moved over the last 10 years Enrich+ This tier of service is ideal for target marketing and geolocation intelligence with the following capabilities:. Consumer Demographics: Add info like date of birth (DOB), deceased info, gender, marital status, household income, and more. Geocoding: Covert postal addresses to lat/long coordinates and add geographic info like census tract/block numbers, FIPS codes, and more. Helpful Resources Vimeo Video Personator World Video Watch Video Webinar Synthetic Fraud Webinar Watch Webinar Data Sheet Personator Data Sheet Stop Bad Data from Entering Your Systems and Ensure Records are Up-to-Date and Complete Personator Consumer is the all-in-one Web service that you can easily integrate into your e-commerce, CRM, and mobile applications to capture verified U.S. and Canada consumer data – and enrich missing elements (email address, phone number, postal address, business info, and demographics). Identify potential fraud by matching a name to an address to validate identity Prevent bad data from entering your systems with real-time address, email, phone, and name validation Complete your customer and prospect records by adding missing email and postal address, phone number, and name (or business name) Gain insight by enriching records with detailed demographic, psychographic, and geographic data elements Stop Bad Data from Entering Your Systems and Ensure Records are Up-to-Date and Complete Personator Consumer is the all-in-one Web service that you can easily integrate into your e-commerce, CRM, and mobile applications to capture verified U.S. and Canada consumer data – and enrich missing elements (email address, phone number, postal address, business info, and demographics). Identify potential fraud by matching a name to an address to validate identity Prevent bad data from entering your systems with real-time address, email, phone, and name validation Complete your customer and prospect records by adding missing email and postal address, phone number, and name (or business name) Gain insight by enriching records with detailed demographic, psychographic, and geographic data elements Personator Consumer Capabilities Address Verification Verify, correct, and standardize U.S., Canada, and international addresses to local postal formats for over 240 countries to ensure deliverability. Phone Verification Verify U.S., Canada, and international numbers, append useful geographic information associated with the phone number, and perform premium real-time checks to distinguish live numbers and phone types. Consumer Demographic Personator provides detailed demographics on over 250 U.S. individuals and 170 million households including household income, marital status, residence data, credit information, and more. Identity Matching Fill the gaps in your consumer records by adding missing names, phone numbers, email addresses, and postal addresses. Change of Address Personator utilizes proprietary change of address technology to update records with over 10 years of move history. Personator Move does not require compliance with USPS Move Update requirements and no mailing is required for change of address processing. Email Verification Validate and parse email addresses, correct common typographical errors, and standardize email addresses to improve deliverability and reduce spam. Features real-time email mailbox verification to remove up to 95% of bad emails at point of entry. Geocoding Personator converts U.S., Canada and international postal addresses to a precise latitude and longitude coordinate for mapping, target marketing, logistics, and other business uses. Verify, correct, and standardize U.S., Canada, and international addresses to local postal formats for over 240 countries to ensure deliverability. Verify U.S., Canada, and international numbers, append useful geographic information associated with the phone number, and perform premium real-time checks to distinguish live numbers and phone types. Personator provides detailed demographics on over 250 U.S. individuals and 170 million households including household income, marital status, residence data, credit information, and more. Fill the gaps in your consumer records by adding missing names, phone numbers, email addresses, and postal addresses. Personator utilizes proprietary change of address technology to update records with over 10 years of move history. Personator Move does not require compliance with USPS Move Update requirements and no mailing is required for change of address processing. Validate and parse email addresses, correct common typographical errors, and standardize email addresses to improve deliverability and reduce spam. Features real-time email mailbox verification to remove up to 95% of bad emails at point of entry. Personator converts U.S., Canada and international postal addresses to a precise latitude and longitude coordinate for mapping, target marketing, logistics, and other business uses. Personator Service Options Confirm Personator's basic service package includes address, email, phone, and name verification for real-time or batch processing needs. Enrich Add the Enrich tier of service to fill in missing gaps and update your contact records with the addition of: Complete Records: add consumer and business names, phone numbers, email addresses, and postal addresses Change of Address: update the addresses of U.S. and Canadian contacts that have moved over the last 10 years Enrich+ This tier of service is ideal for target marketing and geolocation intelligence with the following capabilities:. Consumer Demographics: Add info like date of birth (DOB), deceased info, gender, marital status, household income, and more. Geocoding: Covert postal addresses to lat/long coordinates and add geographic info like census tract/block numbers, FIPS codes, and more. Personator's basic service package includes address, email, phone, and name verification for real-time or batch processing needs. Add the Enrich tier of service to fill in missing gaps and update your contact records with the addition of: Complete Records: add consumer and business names, phone numbers, email addresses, and postal addresses Change of Address: update the addresses of U.S. and Canadian contacts that have moved over the last 10 years This tier of service is ideal for target marketing and geolocation intelligence with the following capabilities:. Consumer Demographics: Add info like date of birth (DOB), deceased info, gender, marital status, household income, and more. Geocoding: Covert postal addresses to lat/long coordinates and add geographic info like census tract/block numbers, FIPS codes, and more. Consumer Demographics: Add info like date of birth (DOB), deceased info, gender, marital status, household income, and more. Geocoding: Covert postal addresses to lat/long coordinates and add geographic info like census tract/block numbers, FIPS codes, and more. Helpful Resources Vimeo Video Personator World Video Watch Video Webinar Synthetic Fraud Webinar Watch Webinar Data Sheet Personator Data Sheet",
    "Unison - Superior Data Quality for Better MDM and Big Data Insights We've made it simple to create and maintain data quality without programming – Unison – a data steward's best friend. Unison is your centralised solution for creating simple to complex data quality tasks with the ability to connect to multiple RDBMS platforms, schedule jobs, visualise reports/analytics, collaborate on projects, and much more. It's the ideal solution to cleanse sensitive customer information securely and safely – data never leaves your organization. Easy installation with support for Oracle, MS SQL, and MySQL Complete data quality including domestic and international address, phone, email verification, and geocoding Advanced architecture that is scalable across multiple servers and works completely offline On-premise platform – confidently manage your data on site to meet compliance and security needs Melissa Data Quality and Enhancement Transforms Melissa leverages the integration power of Semarchy xDM to provide a full spectrum of data quality with the following transforms: Address Verification Verify, correct, and standardise postal addresses to ensure deliverability. Phone Verification Verify U.S., Canada, & international numbers. Append useful geographic information associated with the phone number. Email Verification Validate and parse email addresses, correct common typographical errors, and standardise email addresses to improve deliverability and reduce spam. Geocoding Convert a postal address to a precise, rooftop latitude/longitude coordinate for mapping and analytics. Coverage for 95% of all physical addresses in the U.S. plus support for many countries around the world. Platform Topology Unison's architecture is designed from the ground up to be innovative, scalable, and reliable. Advanced Web Application Interface Job Scheduling Reports and Analytics User Authentication System Activity Logs Unison was designed from the ground up for effortless scalability, ease of use and updating, and robust data quality and cleansing capabilities. Client/Server architecture Scalable across multiple servers containerisation of backend Works while completely offline Helpful Resources Video Full Spectrum Video Watch Video Product Sheet Unison Product Sheet Read Whitepaper Unison - Superior Data Quality for Better MDM and Big Data Insights We've made it simple to create and maintain data quality without programming – Unison – a data steward's best friend. Unison is your centralised solution for creating simple to complex data quality tasks with the ability to connect to multiple RDBMS platforms, schedule jobs, visualise reports/analytics, collaborate on projects, and much more. It's the ideal solution to cleanse sensitive customer information securely and safely – data never leaves your organization. Easy installation with support for Oracle, MS SQL, and MySQL Complete data quality including domestic and international address, phone, email verification, and geocoding Advanced architecture that is scalable across multiple servers and works completely offline On-premise platform – confidently manage your data on site to meet compliance and security needs Unison - Superior Data Quality for Better MDM and Big Data Insights We've made it simple to create and maintain data quality without programming – Unison – a data steward's best friend. Unison is your centralised solution for creating simple to complex data quality tasks with the ability to connect to multiple RDBMS platforms, schedule jobs, visualise reports/analytics, collaborate on projects, and much more. It's the ideal solution to cleanse sensitive customer information securely and safely – data never leaves your organization. Easy installation with support for Oracle, MS SQL, and MySQL Complete data quality including domestic and international address, phone, email verification, and geocoding Advanced architecture that is scalable across multiple servers and works completely offline On-premise platform – confidently manage your data on site to meet compliance and security needs Melissa Data Quality and Enhancement Transforms Melissa leverages the integration power of Semarchy xDM to provide a full spectrum of data quality with the following transforms: Address Verification Verify, correct, and standardise postal addresses to ensure deliverability. Phone Verification Verify U.S., Canada, & international numbers. Append useful geographic information associated with the phone number. Email Verification Validate and parse email addresses, correct common typographical errors, and standardise email addresses to improve deliverability and reduce spam. Geocoding Convert a postal address to a precise, rooftop latitude/longitude coordinate for mapping and analytics. Coverage for 95% of all physical addresses in the U.S. plus support for many countries around the world. Melissa Data Quality and Enhancement Transforms Melissa leverages the integration power of Semarchy xDM to provide a full spectrum of data quality with the following transforms: Verify, correct, and standardise postal addresses to ensure deliverability. Verify U.S., Canada, & international numbers. Append useful geographic information associated with the phone number. Validate and parse email addresses, correct common typographical errors, and standardise email addresses to improve deliverability and reduce spam. Convert a postal address to a precise, rooftop latitude/longitude coordinate for mapping and analytics. Coverage for 95% of all physical addresses in the U.S. plus support for many countries around the world. Platform Topology Unison's architecture is designed from the ground up to be innovative, scalable, and reliable. Advanced Web Application Interface Job Scheduling Reports and Analytics User Authentication System Activity Logs Unison's architecture is designed from the ground up to be innovative, scalable, and reliable. Advanced Web Application Interface Unison was designed from the ground up for effortless scalability, ease of use and updating, and robust data quality and cleansing capabilities. Client/Server architecture Scalable across multiple servers containerisation of backend Works while completely offline Unison was designed from the ground up for effortless scalability, ease of use and updating, and robust data quality and cleansing capabilities. Scalable across multiple servers Works while completely offline Helpful Resources Video Full Spectrum Video Watch Video Product Sheet Unison Product Sheet Read Whitepaper",
    "Melissa provides an all-in-one solution to clean, verify, standardize, and complete names, phone numbers, addresses, and emails Global Identity Verification Prevent fraud and ensure compliance with Personator World. The service consolidates data from numerous sources to verify age and national ID and compare records against government watch lists. x Prevent fraud and ensure compliance with Personator World. The service consolidates data from numerous sources to verify age and national ID and compare records against government watch lists.",
    "Why Melissa? International Address Verification Reference Data for 240+ Countries Certified Postal Services USPS, Canada Post, Royal Mail, Eircode & Australia Post Secure & Compliant SOC 2, HIPAA / HITECH & GDPR Superior Support 99.99% Uptime & In-Country Support Experienced & Independent 35 Years of Data Quality Expertise High quality data improves your efforts in fraud prevention ,mail & fulfillment, lead generation, research & analytics, customer experience Keep your customer records clean, current, & complete for better marketing, sales & customer service. Identity Verification Manage KYC / AML compliance with identity & ID document verification. Contact Data Verification Verify addresses, email addresses & phone numbers. NCOA Change of Address Update postal addresses with moves. Data Matching & Deduplication Merge/purge duplicate records for a single customer view. Data Enrichment Add location intelligence, property & demographic details to customer records. Mailing Lists & Sales Leads Find new customers using targeted consumer & business mailing lists. High quality data improves your efforts in fraud prevention ,mail & fulfillment, lead generation, research & analytics, customer experience Keep your customer records clean, current, & complete for better marketing, sales & customer service. You choose how you want to work with us API Integrate our on-premise & Cloud APIs into your Website / App. View API Collection Automated Use secure, automated SFTP transfer to clean your files 24/7. View SFTP Services Full Service Send us your file & we'll process it & return the cleansed data to you. Upload File You choose how you want to work with us Resources for your success Case Study car2go Read Now View All Case Studies News Melissa Attends PASS Summit October 30 Read Now View All News Event Internet World – München Mar 10 & 11, 2020 Register Now View All Events News Melissa Prevent Bad Data At Microsoft Ignite October 23 Read Now View All News News Melissa Adds Simplified Matching to Unison Enterprise Data Quality Platform October 15 Read Now View All News Case Study HUF Read Now View All Case Studies Over 10,000 happy, satisfied customers Resources for your success Over 10,000 happy, satisfied customers"
  ]
}