{
  "company": "www.indepthcam.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "SMART FEVER DETECTION CAMERAS HOW IT WORKS EMAIL US AI POWERED 01 / FAST & ACCURATE 02 / A.I. ANALYTICS REAL-TIME ALERTS 03 / FAST & EASY SETUP Accurate Temperature Monitoring ±0.3 Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per second. Features high and low temperature automated alerts . ​ The AI Mask Detection setting provides an alert when someone removes a mask or other user defined scenarios . ​ ​ Our unique design and software allows for a simple and low effort setup. CONTACT GROUNDBREAKING TECHNOLOGY Deep Learning Artificial Intelligence Face & object recognition Store over 20,000 faces. Classification of known faces & strangers not in the database. ​ ​ Search database by images or search metadata of human and or scenarios. ​ Real-time alerts analytics & alerts Extraction from the video different attributes including gender, age, expression (happy, calm, surprised, sad, and angry), glasses, mouth masks, and beard & moustache The artificial intelligence can identify people wearing masks or removing mask. ​ ​ Forehead vs Inner Canthus Measurement Facial thermography of surface areas other than the region medially adjacent to the inner canthi is unreliable, and may be complicated by perspiration, facial skin flushed from exertion, etc. ​ IN-Depth advanced A.I. feature recognition pinpoints the thermal imager sensor for readings from the inner canthus. FEATURES VIDEO INTERCOM ACESS CONTROL REAL-TIME FACE RECOGNITION The software support and integration for access control and video intercom, the server supports two-way communication between intercom and control center. The server monitors door status and events, manages access rights, and supports advanced rules management. The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. Offers settings to configure all aspects of a video wall application. Offers settings to configure all aspects of a video wall application. FEATURES AI & Scene Analytics High Accuracy IN-Depth Camera utilizes advanced AI feature detection, pinpointing the thermal sensor for higher accurate measurement method of scanning the inner canthus of the eye. ​ Upon detection of any obstruction, the [AI] will assess and pinpoint to the thermal measurement to the next region which is the temple and forehead. The advanced software can detect triggers such as removal of safety masks. Highly accurate: temperature measurement range: (30~45 Celsius) – (86~113 Fahrenheit) with maximum range of error ±0.3°C, with blackbody system. Real-time Face Recognition The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. Access Control Flexibility and Scalability Compatibility The server monitors door status and events, manages access rights, and supports advanced rules management. The IN-Depth Camera supports 256 IP video channels, with support for two (2) connected face recognition cameras. DSS Express S also supports 256 Video Intercom Devices (SIP-enabled), and offers features to manage and control access control devices IN-Depth Camera is compatible with most IP-enabled devices: network cameras, NVRs, DVRs, video intercom devices, and access control devices. The server is also compatible with the ONVIF protocol, so it can connect to ONVIF-enabled third-party devices. PREVIOUS WORK CONTACT US! EMAIL US info@indepthcam.com Tel: 323-285-1541 ​ 1 West Mountain Street Pasadena, CA 91103 CONTACT FORM Please fill out the form with your information: HOW IT WORKS EMAIL US AI POWERED 01 / FAST & ACCURATE 02 / A.I. ANALYTICS REAL-TIME ALERTS 03 / FAST & EASY SETUP Accurate Temperature Monitoring ±0.3 Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per second. Features high and low temperature automated alerts . ​ The AI Mask Detection setting provides an alert when someone removes a mask or other user defined scenarios . ​ ​ Our unique design and software allows for a simple and low effort setup. CONTACT Accurate Temperature Monitoring ±0.3 Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per second. Features high and low temperature The AI Mask Detection setting provides an alert when someone removes a mask or other user defined scenarios . Our unique design and software allows for a simple and low effort setup. GROUNDBREAKING TECHNOLOGY Deep Learning Artificial Intelligence Face & object recognition Store over 20,000 faces. Classification of known faces & strangers not in the database. ​ ​ Search database by images or search metadata of human and or scenarios. ​ Real-time alerts analytics & alerts Extraction from the video different attributes including gender, age, expression (happy, calm, surprised, sad, and angry), glasses, mouth masks, and beard & moustache The artificial intelligence can identify people wearing masks or removing mask. ​ ​ Forehead vs Inner Canthus Measurement Facial thermography of surface areas other than the region medially adjacent to the inner canthi is unreliable, and may be complicated by perspiration, facial skin flushed from exertion, etc. ​ IN-Depth advanced A.I. feature recognition pinpoints the thermal imager sensor for readings from the inner canthus. Face & object recognition Store over 20,000 faces. Classification of known faces & strangers not in the database. Search database by images or search metadata of human and or scenarios. Extraction from the video different attributes including gender, age, expression (happy, calm, surprised, sad, and angry), glasses, mouth masks, and beard & moustache The artificial intelligence can identify people wearing masks or removing mask. Facial thermography of surface areas other than the region medially adjacent to the inner canthi is unreliable, and may be complicated by perspiration, facial skin flushed from exertion, etc. IN-Depth advanced A.I. feature recognition pinpoints the thermal imager sensor for readings from the inner canthus. FEATURES VIDEO INTERCOM ACESS CONTROL REAL-TIME FACE RECOGNITION The software support and integration for access control and video intercom, the server supports two-way communication between intercom and control center. The server monitors door status and events, manages access rights, and supports advanced rules management. The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. Offers settings to configure all aspects of a video wall application. Offers settings to configure all aspects of a video wall application. The software support and integration for access control and video intercom, the server supports two-way communication between intercom and control center. The server monitors door status and events, manages access rights, and supports advanced rules management. The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. Offers settings to configure all aspects of a video wall application. Offers settings to configure all aspects of a video wall application. FEATURES AI & Scene Analytics High Accuracy IN-Depth Camera utilizes advanced AI feature detection, pinpointing the thermal sensor for higher accurate measurement method of scanning the inner canthus of the eye. ​ Upon detection of any obstruction, the [AI] will assess and pinpoint to the thermal measurement to the next region which is the temple and forehead. The advanced software can detect triggers such as removal of safety masks. Highly accurate: temperature measurement range: (30~45 Celsius) – (86~113 Fahrenheit) with maximum range of error ±0.3°C, with blackbody system. Real-time Face Recognition The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. Access Control Flexibility and Scalability Compatibility The server monitors door status and events, manages access rights, and supports advanced rules management. The IN-Depth Camera supports 256 IP video channels, with support for two (2) connected face recognition cameras. DSS Express S also supports 256 Video Intercom Devices (SIP-enabled), and offers features to manage and control access control devices IN-Depth Camera is compatible with most IP-enabled devices: network cameras, NVRs, DVRs, video intercom devices, and access control devices. The server is also compatible with the ONVIF protocol, so it can connect to ONVIF-enabled third-party devices. IN-Depth Camera utilizes advanced AI feature detection, pinpointing the thermal sensor for higher accurate measurement method of scanning the inner canthus of the eye. Upon detection of any obstruction, the [AI] will assess and pinpoint to the thermal measurement to the next region which is the temple and forehead. The advanced software can detect triggers such as removal of safety masks. Highly accurate: temperature measurement range: (30~45 Celsius) – (86~113 Fahrenheit) with maximum range of error ±0.3°C, with blackbody system. The advanced [AI] real-time facial recognition on up to 2 channels simultaneously. The software captures and analyzes facial features to determine gender, age, expression, glasses, moustache, and mask, and then can record the faces and store the associated structured data. The server also filters incoming video to display faces that match target features. The server monitors door status and events, manages access rights, and supports advanced rules management. The IN-Depth Camera supports 256 IP video channels, with support for two (2) connected face recognition cameras. DSS Express S also supports 256 Video Intercom Devices (SIP-enabled), and offers features to manage and control access control devices IN-Depth Camera is compatible with most IP-enabled devices: network cameras, NVRs, DVRs, video intercom devices, and access control devices. The server is also compatible with the ONVIF protocol, so it can connect to ONVIF-enabled third-party devices. CONTACT US! EMAIL US info@indepthcam.com Tel: 323-285-1541 ​ 1 West Mountain Street Pasadena, CA 91103 1 West Mountain Street Pasadena, CA 91103 CONTACT FORM Please fill out the form with your information:",
    "1 x NVR 16-Channel with 4TB HD + Software NVR SKU: NVR-164TB-AI $1,585.90 Price IN-Depth new Analytics + network video recorder NVR-164TB-AI delivers excellent performance and high recording quality that is ideally suitable for IP video surveillance applications. This NVR adopts powerful processor, providing the capability of 4K resolution processing for applications where image details are highly required. Additionally, the NVR can be served as edge storage, central storage or backup storage with an intuitive shortcut operation menu for remote management and control. With build-in deep learning module, NVR-164TB-AI series products adopt video image structuring technology based on deep learning algorithms, achieving high-precision human face recognition and perimeter protection. By applying deep learning artificial intelligence, NVR-164TB-AI allows users to focus on what matters most, improves event response time and helps make video actionable The NVR is compatible with numerous third-party devices, which make it the perfect solution. Analytics+ NVR, 320Mbps, 160Mbps when Analytics+ function is enabled Automatically filtering out false alarms caused by animals, bright lights, etc. Enables system to act secondary recognition for the targets. Improving accuracy. Real Time Face Recognition (Classification of Name, gender, birthday, nationality, address, ID) AI Search (search by metadata of human and vehicles) Common/Stranger Mode (detects a strange face not in device's face database) 16 Channel IP video access Smart H.265+/H.265/Smart H.264+/H.264/MJPEG Designed for accurate body temperature measurement Up to 16 Channel perimeter protection Up to 4 Channel video stream face recognition Up to 24 face pictures /sec processing Up to 20 face databases with 100,000 face images in total 1-8 PoE Ports support ePoE & EoC H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant CVBS video output Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning CE and FCC certified 1 x NVR 16-Channel with 4TB HD + Software NVR SKU: NVR-164TB-AI $1,585.90 Price IN-Depth new Analytics + network video recorder NVR-164TB-AI delivers excellent performance and high recording quality that is ideally suitable for IP video surveillance applications. This NVR adopts powerful processor, providing the capability of 4K resolution processing for applications where image details are highly required. Additionally, the NVR can be served as edge storage, central storage or backup storage with an intuitive shortcut operation menu for remote management and control. With build-in deep learning module, NVR-164TB-AI series products adopt video image structuring technology based on deep learning algorithms, achieving high-precision human face recognition and perimeter protection. By applying deep learning artificial intelligence, NVR-164TB-AI allows users to focus on what matters most, improves event response time and helps make video actionable The NVR is compatible with numerous third-party devices, which make it the perfect solution. Analytics+ NVR, 320Mbps, 160Mbps when Analytics+ function is enabled Automatically filtering out false alarms caused by animals, bright lights, etc. Enables system to act secondary recognition for the targets. Improving accuracy. Real Time Face Recognition (Classification of Name, gender, birthday, nationality, address, ID) AI Search (search by metadata of human and vehicles) Common/Stranger Mode (detects a strange face not in device's face database) 16 Channel IP video access Smart H.265+/H.265/Smart H.264+/H.264/MJPEG Designed for accurate body temperature measurement Up to 16 Channel perimeter protection Up to 4 Channel video stream face recognition Up to 24 face pictures /sec processing Up to 20 face databases with 100,000 face images in total 1-8 PoE Ports support ePoE & EoC H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant CVBS video output Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning CE and FCC certified 1 x NVR 16-Channel with 4TB HD + Software 1 x NVR 16-Channel with 4TB HD + Software 1 x NVR 16-Channel with 4TB HD + Software NVR SKU: NVR-164TB-AI $1,585.90 Price IN-Depth new Analytics + network video recorder NVR-164TB-AI delivers excellent performance and high recording quality that is ideally suitable for IP video surveillance applications. This NVR adopts powerful processor, providing the capability of 4K resolution processing for applications where image details are highly required. Additionally, the NVR can be served as edge storage, central storage or backup storage with an intuitive shortcut operation menu for remote management and control. With build-in deep learning module, NVR-164TB-AI series products adopt video image structuring technology based on deep learning algorithms, achieving high-precision human face recognition and perimeter protection. By applying deep learning artificial intelligence, NVR-164TB-AI allows users to focus on what matters most, improves event response time and helps make video actionable The NVR is compatible with numerous third-party devices, which make it the perfect solution. Analytics+ NVR, 320Mbps, 160Mbps when Analytics+ function is enabled Automatically filtering out false alarms caused by animals, bright lights, etc. Enables system to act secondary recognition for the targets. Improving accuracy. Real Time Face Recognition (Classification of Name, gender, birthday, nationality, address, ID) AI Search (search by metadata of human and vehicles) Common/Stranger Mode (detects a strange face not in device's face database) 16 Channel IP video access Smart H.265+/H.265/Smart H.264+/H.264/MJPEG Designed for accurate body temperature measurement Up to 16 Channel perimeter protection Up to 4 Channel video stream face recognition Up to 24 face pictures /sec processing Up to 20 face databases with 100,000 face images in total 1-8 PoE Ports support ePoE & EoC H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant CVBS video output Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning CE and FCC certified IN-Depth new Analytics + network video recorder NVR-164TB-AI delivers excellent performance and high recording quality that is ideally suitable for IP video surveillance applications. This NVR adopts powerful processor, providing the capability of 4K resolution processing for applications where image details are highly required. Additionally, the NVR can be served as edge storage, central storage or backup storage with an intuitive shortcut operation menu for remote management and control. With build-in deep learning module, NVR-164TB-AI series products adopt video image structuring technology based on deep learning algorithms, achieving high-precision human face recognition and perimeter protection. By applying deep learning artificial intelligence, NVR-164TB-AI allows users to focus on what matters most, improves event response time and helps make video actionable The NVR is compatible with numerous third-party devices, which make it the perfect solution. IN-Depth new Analytics + network video recorder NVR-164TB-AI delivers excellent performance and high recording quality that is ideally suitable for IP video surveillance applications. This NVR adopts powerful processor, providing the capability of 4K resolution processing for applications where image details are highly required. Additionally, the NVR can be served as edge storage, central storage or backup storage with an intuitive shortcut operation menu for remote management and control. With build-in deep learning module, NVR-164TB-AI series products adopt video image structuring technology based on deep learning algorithms, achieving high-precision human face recognition and perimeter protection. By applying deep learning artificial intelligence, NVR-164TB-AI allows users to focus on what matters most, improves event response time and helps make video actionable The NVR is compatible with numerous third-party devices, which make it the perfect solution. Analytics+ NVR, 320Mbps, 160Mbps when Analytics+ function is enabled Automatically filtering out false alarms caused by animals, bright lights, etc. Enables system to act secondary recognition for the targets. Improving accuracy. Real Time Face Recognition (Classification of Name, gender, birthday, nationality, address, ID) AI Search (search by metadata of human and vehicles) Common/Stranger Mode (detects a strange face not in device's face database) 16 Channel IP video access Smart H.265+/H.265/Smart H.264+/H.264/MJPEG Designed for accurate body temperature measurement Up to 16 Channel perimeter protection Up to 4 Channel video stream face recognition Up to 24 face pictures /sec processing Up to 20 face databases with 100,000 face images in total 1-8 PoE Ports support ePoE & EoC H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant CVBS video output Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning CE and FCC certified Analytics+ NVR, 320Mbps, 160Mbps when Analytics+ function is enabled Automatically filtering out false alarms caused by animals, bright lights, etc. Enables system to act secondary recognition for the targets. Improving accuracy. Real Time Face Recognition (Classification of Name, gender, birthday, nationality, address, ID) AI Search (search by metadata of human and vehicles) Common/Stranger Mode (detects a strange face not in device's face database) 16 Channel IP video access Designed for accurate body temperature measurement Up to 16 Channel perimeter protection Up to 4 Channel video stream face recognition Up to 24 face pictures /sec processing Up to 20 face databases with 100,000 face images in total 1-8 PoE Ports support ePoE & EoC H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning CE and FCC certified",
    "The Full kit contains: 1 x Hybrid Thermal + Visible light camera system 1 x Blackbody calibration device 1 x Software for windows Fever Detection System + AI Software + Blackbody Box SKU: TIC-BF40-T $13,898.90 Price This fever detection camera Kit includes: TIC-BF40-T Thermal Network Camera, a ID-BBS Blackbody, a ID-PTC-US 12 VDC, 2A power adapter, two ID-QW026-00 brackets: Thermal Temperature Monitoring Solution cooled vanadium thermal sensor and a 2MP 1/2.8\" CMOS sensor, IN-Depth Technology's TIC-BF40-T Thermal Network Bullet Camera is designed to provide body temperature measurement. This unit captures thermal video in 400 x 300 resolution and optical video in 1920 x 1080 resolution. A single IR LED provides up to 115' of night vision. The camera features a 13mm fixed thermal lens with a 30° horizontal field of view, along with an 8mm fixed optical lens that has a 40° field of view. Two-way audio communication is possible thanks to an audio input and output. A built-in siren and spotlights -Safe, Efficient, and Accurate Temperature Monitoring±0.3° C (±0.54° F) -Temperature Measurement (with blackbody) -Long-distance Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per Second -Hybrid Thermal and optical sensors in one unit -Designed for accurate body temperature measurement -Uncooled VOx thermal sensor technology -≤40 mK thermal sensitivity -8 to 14µm spectral range -2D-DNR and 3D-DNR (Digital Noise Reduction) -Mirroring, 90 & 180° image flip -ROI (region of interest) -H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant -100M RJ45 Ethernet port -Two alarm inputs and outputs -Audio input and output -RS-485 port -CVBS video output -Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning -Enhanced Power over Ethernet (ePoE) technology enables long distance power and data transmission via Ethernet or coaxial cable -CE and FCC certified Networ IN-Depth Blackbody - Calibration Body; Working temperature: 40.0° c or 104° f (environment temperature +5.0°c~ 50.0°c or +41°f~ 122°f), Temperature resolution: 0.1 Temperature measurement accuracy : 0.2 (Single point) Temperature stability: ( 0.1~0.2 )/30 min Effective emissivity :0.97x0.02 Power: 220VAC 50 Hz Ambient temperature and humidity: 0~40/ =80% RH, must combine with TIC-BF40-T for temperature measurement. The Full kit contains: 1 x Hybrid Thermal + Visible light camera system 1 x Blackbody calibration device 1 x Software for windows Fever Detection System + AI Software + Blackbody Box SKU: TIC-BF40-T $13,898.90 Price This fever detection camera Kit includes: TIC-BF40-T Thermal Network Camera, a ID-BBS Blackbody, a ID-PTC-US 12 VDC, 2A power adapter, two ID-QW026-00 brackets: Thermal Temperature Monitoring Solution cooled vanadium thermal sensor and a 2MP 1/2.8\" CMOS sensor, IN-Depth Technology's TIC-BF40-T Thermal Network Bullet Camera is designed to provide body temperature measurement. This unit captures thermal video in 400 x 300 resolution and optical video in 1920 x 1080 resolution. A single IR LED provides up to 115' of night vision. The camera features a 13mm fixed thermal lens with a 30° horizontal field of view, along with an 8mm fixed optical lens that has a 40° field of view. Two-way audio communication is possible thanks to an audio input and output. A built-in siren and spotlights -Safe, Efficient, and Accurate Temperature Monitoring±0.3° C (±0.54° F) -Temperature Measurement (with blackbody) -Long-distance Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per Second -Hybrid Thermal and optical sensors in one unit -Designed for accurate body temperature measurement -Uncooled VOx thermal sensor technology -≤40 mK thermal sensitivity -8 to 14µm spectral range -2D-DNR and 3D-DNR (Digital Noise Reduction) -Mirroring, 90 & 180° image flip -ROI (region of interest) -H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant -100M RJ45 Ethernet port -Two alarm inputs and outputs -Audio input and output -RS-485 port -CVBS video output -Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning -Enhanced Power over Ethernet (ePoE) technology enables long distance power and data transmission via Ethernet or coaxial cable -CE and FCC certified Networ IN-Depth Blackbody - Calibration Body; Working temperature: 40.0° c or 104° f (environment temperature +5.0°c~ 50.0°c or +41°f~ 122°f), Temperature resolution: 0.1 Temperature measurement accuracy : 0.2 (Single point) Temperature stability: ( 0.1~0.2 )/30 min Effective emissivity :0.97x0.02 Power: 220VAC 50 Hz Ambient temperature and humidity: 0~40/ =80% RH, must combine with TIC-BF40-T for temperature measurement. The Full kit contains: 1 x Hybrid Thermal + Visible light camera system 1 x Blackbody calibration device 1 x Software for windows The Full kit contains: 1 x Hybrid Thermal + Visible light camera system 1 x Blackbody calibration device 1 x Software for windows The Full kit contains: 1 x Hybrid Thermal + Visible light camera system 1 x Blackbody calibration device 1 x Software for windows Fever Detection System + AI Software + Blackbody Box SKU: TIC-BF40-T $13,898.90 Price This fever detection camera Kit includes: TIC-BF40-T Thermal Network Camera, a ID-BBS Blackbody, a ID-PTC-US 12 VDC, 2A power adapter, two ID-QW026-00 brackets: Thermal Temperature Monitoring Solution cooled vanadium thermal sensor and a 2MP 1/2.8\" CMOS sensor, IN-Depth Technology's TIC-BF40-T Thermal Network Bullet Camera is designed to provide body temperature measurement. This unit captures thermal video in 400 x 300 resolution and optical video in 1920 x 1080 resolution. A single IR LED provides up to 115' of night vision. The camera features a 13mm fixed thermal lens with a 30° horizontal field of view, along with an 8mm fixed optical lens that has a 40° field of view. Two-way audio communication is possible thanks to an audio input and output. A built-in siren and spotlights -Safe, Efficient, and Accurate Temperature Monitoring±0.3° C (±0.54° F) -Temperature Measurement (with blackbody) -Long-distance Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per Second -Hybrid Thermal and optical sensors in one unit -Designed for accurate body temperature measurement -Uncooled VOx thermal sensor technology -≤40 mK thermal sensitivity -8 to 14µm spectral range -2D-DNR and 3D-DNR (Digital Noise Reduction) -Mirroring, 90 & 180° image flip -ROI (region of interest) -H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant -100M RJ45 Ethernet port -Two alarm inputs and outputs -Audio input and output -RS-485 port -CVBS video output -Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning -Enhanced Power over Ethernet (ePoE) technology enables long distance power and data transmission via Ethernet or coaxial cable -CE and FCC certified Networ IN-Depth Blackbody - Calibration Body; Working temperature: 40.0° c or 104° f (environment temperature +5.0°c~ 50.0°c or +41°f~ 122°f), Temperature resolution: 0.1 Temperature measurement accuracy : 0.2 (Single point) Temperature stability: ( 0.1~0.2 )/30 min Effective emissivity :0.97x0.02 Power: 220VAC 50 Hz Ambient temperature and humidity: 0~40/ =80% RH, must combine with TIC-BF40-T for temperature measurement. Fever Detection System + AI Software + Blackbody Box This fever detection camera Kit includes: TIC-BF40-T Thermal Network Camera, a ID-BBS Blackbody, a ID-PTC-US 12 VDC, 2A power adapter, two ID-QW026-00 brackets: Thermal Temperature Monitoring Solution cooled vanadium thermal sensor and a 2MP 1/2.8\" CMOS sensor, IN-Depth Technology's TIC-BF40-T Thermal Network Bullet Camera is designed to provide body temperature measurement. This unit captures thermal video in 400 x 300 resolution and optical video in 1920 x 1080 resolution. A single IR LED provides up to 115' of night vision. The camera features a 13mm fixed thermal lens with a 30° horizontal field of view, along with an 8mm fixed optical lens that has a 40° field of view. Two-way audio communication is possible thanks to an audio input and output. A built-in siren and spotlights This fever detection camera Kit includes: TIC-BF40-T Thermal Network Camera, a ID-BBS Blackbody, a ID-PTC-US 12 VDC, 2A power adapter, two ID-QW026-00 brackets: Thermal Temperature Monitoring Solution cooled vanadium thermal sensor and a 2MP 1/2.8\" CMOS sensor, IN-Depth Technology's TIC-BF40-T Thermal Network Bullet Camera is designed to provide body temperature measurement. This unit captures thermal video in 400 x 300 resolution and optical video in 1920 x 1080 resolution. A single IR LED provides up to 115' of night vision. The camera features a 13mm fixed thermal lens with a 30° horizontal field of view, along with an 8mm fixed optical lens that has a 40° field of view. Two-way audio communication is possible thanks to an audio input and output. A built-in siren and spotlights -Safe, Efficient, and Accurate Temperature Monitoring±0.3° C (±0.54° F) -Temperature Measurement (with blackbody) -Long-distance Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per Second -Hybrid Thermal and optical sensors in one unit -Designed for accurate body temperature measurement -Uncooled VOx thermal sensor technology -≤40 mK thermal sensitivity -8 to 14µm spectral range -2D-DNR and 3D-DNR (Digital Noise Reduction) -Mirroring, 90 & 180° image flip -ROI (region of interest) -H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant -100M RJ45 Ethernet port -Two alarm inputs and outputs -Audio input and output -RS-485 port -CVBS video output -Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning -Enhanced Power over Ethernet (ePoE) technology enables long distance power and data transmission via Ethernet or coaxial cable -CE and FCC certified Networ -Safe, Efficient, and Accurate Temperature Monitoring±0.3° C (±0.54° F) -Temperature Measurement (with blackbody) -Long-distance Rapid Screening at up to 4.50 m (15.0 ft), Monitoring 30 People per Second -Hybrid Thermal and optical sensors in one unit -Designed for accurate body temperature measurement -Uncooled VOx thermal sensor technology -≤40 mK thermal sensitivity -8 to 14µm spectral range -2D-DNR and 3D-DNR (Digital Noise Reduction) -Mirroring, 90 & 180° image flip -ROI (region of interest) -H.265, H.264, (H.264H, H.264B), and MJPEG video codecs ONVIF (Open Network Video Interface Forum) compliant -100M RJ45 Ethernet port -Two alarm inputs and outputs -Audio input and output -Alarm linkage includes motion detection, privacy mask, audio detection, microSD card abnormality, network abnormality, and anti-burn warning -Enhanced Power over Ethernet (ePoE) technology enables long distance power and data transmission via Ethernet or coaxial cable -CE and FCC certified Networ IN-Depth Blackbody - Calibration Body; Working temperature: 40.0° c or 104° f (environment temperature +5.0°c~ 50.0°c or +41°f~ 122°f), Temperature resolution: 0.1 Temperature measurement accuracy : 0.2 (Single point) Temperature stability: ( 0.1~0.2 )/30 min Effective emissivity :0.97x0.02 Power: 220VAC 50 Hz Ambient temperature and humidity: 0~40/ =80% RH, must combine with TIC-BF40-T for temperature measurement. IN-Depth Blackbody - Calibration Body; Working temperature: 40.0° c or 104° f (environment temperature +5.0°c~ 50.0°c or +41°f~ 122°f), Temperature resolution: 0.1 Temperature measurement accuracy : 0.2 (Single point) Temperature stability: ( 0.1~0.2 )/30 min Effective emissivity :0.97x0.02 Power: 220VAC 50 Hz Ambient temperature and humidity: 0~40/ =80% RH, must combine with TIC-BF40-T for temperature measurement."
  ]
}