{
  "company": "www.graymatics.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5,
    "framing_surveillance": 0.5,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Cloud Based Video Surveillance Solutions Graymatics provides a cognitive multimedia analytics platform capable of transforming images and videos into meaningful granular data. We primarily offer CCTV based Video Analytics solutions to enable our clients draw critical insights from existing infrastructure all in detailed dashboards Play Video About us Graymatics is a leading video analytics company founded in Silicon Valley in 2011. Currently headquartered in Singapore, we are a revolutionary cloud platform that enables automatic analysis and recognition of products within surveillance, telecom, media, advertising, retail and e-commerce. Our Differentiators Being one of the few video analytics companies in its' field to offer such in-depth analysis, we offer a unique set of products to clients who might have been used to more traditional technology. We continue to remain the #1 choice for our clients as we differentiate ourselves from our competitors by staying up to date with industry trends ' Industry expert in video analytics across industries i.e. schools, workplaces and law enforcement Deep Learning models deployed in plug-and-play fashion Highly optimized models with minimal hardware requirements in of RAM & GPU Massive scale & depth in CCTV analytics at low cost Easy Portability to Cloud platforms, Edge, Data Centre Draw critical insights from detailed Dashboards Continuous online learning for future-proof performance Choose from over 100 analytics and enable multiple analytics in each CCTV Our Solutions Our solutions are developed upon extensive research and are tried and tested on various platforms to ensure nearly accurate results. Their application spans across different industries like security and surveillance, digital marketing, e-commerce, telecommunications and the Internet of Things. Urban Vision Urban Vision is a video analytics solution for smart cities with two branches: Smart Infrastructure and Smart Public Services. The goal of Urban Vision is to provide solutions for efficiency, sustainability, security and people. SiteInsights SiteInsights helps building managers keep track of safety and security concerns when operating at all times, something that humans cannot manage. It gives our clients the most optimal solution for the issues they are facing regarding security and surveillance. Puerto Vista Smart Port, a video analytical solution, can enhance the security and surveillance of the Port through a host of features like vehicle, safety, port and COVID analytics that include monitoring illegal parking and social distancing, improving vessel detection and access management to name a few. LabVista LabVista is a video streaming analysis solution for smart laboratories and factories that helps with smart manufacturing, staff & visitor analytics, detection of workplace accidents, process optimization, quality control and safety gear compliance. Vistamart VistaMart is a video analytical solution to make retail services smarter, more profitable and effective. It uses cognitive media analytics to monitor customer demographics, such as age, ethnicity, gender and even the emotions of the customer. G- Safe Smart Bank unlocks visual media content through cognitive media analytics by analysing customer profiles, dwell time, queue patterns, abandoned objects detection etc and then displaying them through easy to understand dashboards for decision making and alert generation. Please contact us to know about our other solutions. Contact Us Technologies Graymatics uses state of the art technologies to develop its solutions and deliver the best results to its' clients. We stay adept with industry trends and update our core technology tools to match your requirements SOUFFLE This Self Assembly Training Engine can be used to upload different types of datasets for annotated and creation. The technology can help classify images, check the level of confidence and match them with our prediction models. IVAaaS Graymatics has developed a cloud-based Video Analytics platform called IVAaaS (Integrated Video Analytics as a Service), which telecommunications carriers could deploy for their enterprise clients from their cloud accounts. This will offer Video Analytics in a highly versatile, flexible, pay-as-you-go, and easy to use manner, as a service offering. Featured clients Platinum Partners Featured clients A few of our featured clients that we would keep refreshing Platinum Partners A few of our featured clients that we would keep refreshing Our Market Places View our offerings on digital marketplaces and transform your business to become smarter through cognitive media analytics and data driven decision making Learn more Learn more Awards The most innovative Indian-ASEAN tech for Smart City First company to be selected by Singapore's PMO for their new Global Executive Entrepreneurship Award One of the global 50 smartest companies selected by Silicon Review Top 10 best IT companies Top 10 most Disruptive Face & Image Recognition Solution Providers of 2020 by Analytics Insights Magazine Top 30 fastest growing companies in Asia 2019 by Silicon Review Top 25 retail solutions provider by CIO Top companies detecting violence within videos by Reuters In the Ne ws Exclusive Interview with Abhijit Shanbhag – President and CEO, Graymatics Smart City Enabler Quantela Makes Strategic Investment in Graymatics IoT Security: How We Are Keeping Consumers Safe from Cyber Threats Supporting and Ensuring the Safety of Women Through Video Surveillance HELLO THERE! Send us your queries Cloud Based Video Surveillance Solutions Graymatics provides a cognitive multimedia analytics platform capable of transforming images and videos into meaningful granular data. We primarily offer CCTV based Video Analytics solutions to enable our clients draw critical insights from existing infrastructure all in detailed dashboards Play Video Cloud Based Video Surveillance Solutions Graymatics provides a cognitive multimedia analytics platform capable of transforming images and videos into meaningful granular data. We primarily offer CCTV based Video Analytics solutions to enable our clients draw critical insights from existing infrastructure all in detailed dashboards About us Graymatics is a leading video analytics company founded in Silicon Valley in 2011. Currently headquartered in Singapore, we are a revolutionary cloud platform that enables automatic analysis and recognition of products within surveillance, telecom, media, advertising, retail and e-commerce. Graymatics is a leading video analytics company founded in Silicon Valley in 2011. Currently headquartered in Singapore, we are a revolutionary cloud platform that enables automatic analysis and recognition of products within surveillance, telecom, media, advertising, retail and e-commerce. Our Differentiators Being one of the few video analytics companies in its' field to offer such in-depth analysis, we offer a unique set of products to clients who might have been used to more traditional technology. We continue to remain the #1 choice for our clients as we differentiate ourselves from our competitors by staying up to date with industry trends ' Being one of the few video analytics companies in its' field to offer such in-depth analysis, we offer a unique set of products to clients who might have been used to more traditional technology. We continue to remain the #1 choice for our clients as we differentiate ourselves from our competitors by staying up to date with industry trends ' Industry expert in video analytics across industries i.e. schools, workplaces and law enforcement Deep Learning models deployed in plug-and-play fashion Highly optimized models with minimal hardware requirements in of RAM & GPU Massive scale & depth in CCTV analytics at low cost Industry expert in video analytics across industries i.e. schools, workplaces and law enforcement Deep Learning models deployed in plug-and-play fashion Highly optimized models with minimal hardware requirements in of RAM & GPU Massive scale & depth in CCTV analytics at low cost Easy Portability to Cloud platforms, Edge, Data Centre Draw critical insights from detailed Dashboards Continuous online learning for future-proof performance Choose from over 100 analytics and enable multiple analytics in each CCTV Easy Portability to Cloud platforms, Edge, Data Centre Draw critical insights from detailed Dashboards Continuous online learning for future-proof performance Choose from over 100 analytics and enable multiple analytics in each CCTV Our Solutions Our solutions are developed upon extensive research and are tried and tested on various platforms to ensure nearly accurate results. Their application spans across different industries like security and surveillance, digital marketing, e-commerce, telecommunications and the Internet of Things. Urban Vision Urban Vision is a video analytics solution for smart cities with two branches: Smart Infrastructure and Smart Public Services. The goal of Urban Vision is to provide solutions for efficiency, sustainability, security and people. SiteInsights SiteInsights helps building managers keep track of safety and security concerns when operating at all times, something that humans cannot manage. It gives our clients the most optimal solution for the issues they are facing regarding security and surveillance. Puerto Vista Smart Port, a video analytical solution, can enhance the security and surveillance of the Port through a host of features like vehicle, safety, port and COVID analytics that include monitoring illegal parking and social distancing, improving vessel detection and access management to name a few. LabVista LabVista is a video streaming analysis solution for smart laboratories and factories that helps with smart manufacturing, staff & visitor analytics, detection of workplace accidents, process optimization, quality control and safety gear compliance. Vistamart VistaMart is a video analytical solution to make retail services smarter, more profitable and effective. It uses cognitive media analytics to monitor customer demographics, such as age, ethnicity, gender and even the emotions of the customer. G- Safe Smart Bank unlocks visual media content through cognitive media analytics by analysing customer profiles, dwell time, queue patterns, abandoned objects detection etc and then displaying them through easy to understand dashboards for decision making and alert generation. Please contact us to know about our other solutions. Contact Us Technologies Graymatics uses state of the art technologies to develop its solutions and deliver the best results to its' clients. We stay adept with industry trends and update our core technology tools to match your requirements SOUFFLE This Self Assembly Training Engine can be used to upload different types of datasets for annotated and creation. The technology can help classify images, check the level of confidence and match them with our prediction models. IVAaaS Graymatics has developed a cloud-based Video Analytics platform called IVAaaS (Integrated Video Analytics as a Service), which telecommunications carriers could deploy for their enterprise clients from their cloud accounts. This will offer Video Analytics in a highly versatile, flexible, pay-as-you-go, and easy to use manner, as a service offering. Our solutions are developed upon extensive research and are tried and tested on various platforms to ensure nearly accurate results. Their application spans across different industries like security and surveillance, digital marketing, e-commerce, telecommunications and the Internet of Things. Urban Vision Urban Vision is a video analytics solution for smart cities with two branches: Smart Infrastructure and Smart Public Services. The goal of Urban Vision is to provide solutions for efficiency, sustainability, security and people. SiteInsights SiteInsights helps building managers keep track of safety and security concerns when operating at all times, something that humans cannot manage. It gives our clients the most optimal solution for the issues they are facing regarding security and surveillance. Puerto Vista Smart Port, a video analytical solution, can enhance the security and surveillance of the Port through a host of features like vehicle, safety, port and COVID analytics that include monitoring illegal parking and social distancing, improving vessel detection and access management to name a few. LabVista LabVista is a video streaming analysis solution for smart laboratories and factories that helps with smart manufacturing, staff & visitor analytics, detection of workplace accidents, process optimization, quality control and safety gear compliance. Vistamart VistaMart is a video analytical solution to make retail services smarter, more profitable and effective. It uses cognitive media analytics to monitor customer demographics, such as age, ethnicity, gender and even the emotions of the customer. G- Safe Smart Bank unlocks visual media content through cognitive media analytics by analysing customer profiles, dwell time, queue patterns, abandoned objects detection etc and then displaying them through easy to understand dashboards for decision making and alert generation. Please contact us to know about our other solutions. Contact Us Our solutions are developed upon extensive research and are tried and tested on various platforms to ensure nearly accurate results. Their application spans across different industries like security and surveillance, digital marketing, e-commerce, telecommunications and the Internet of Things. Technologies Graymatics uses state of the art technologies to develop its solutions and deliver the best results to its' clients. We stay adept with industry trends and update our core technology tools to match your requirements Graymatics uses state of the art technologies to develop its solutions and deliver the best results to its' clients. We stay adept with industry trends and update our core technology tools to match your requirements SOUFFLE This Self Assembly Training Engine can be used to upload different types of datasets for annotated and creation. The technology can help classify images, check the level of confidence and match them with our prediction models. This Self Assembly Training Engine can be used to upload different types of datasets for annotated and creation. The technology can help classify images, check the level of confidence and match them with our prediction models. IVAaaS Graymatics has developed a cloud-based Video Analytics platform called IVAaaS (Integrated Video Analytics as a Service), which telecommunications carriers could deploy for their enterprise clients from their cloud accounts. This will offer Video Analytics in a highly versatile, flexible, pay-as-you-go, and easy to use manner, as a service offering. Graymatics has developed a cloud-based Video Analytics platform called IVAaaS (Integrated Video Analytics as a Service), which telecommunications carriers could deploy for their enterprise clients from their cloud accounts. This will offer Video Analytics in a highly versatile, flexible, pay-as-you-go, and easy to use manner, as a service offering. Featured clients Platinum Partners Featured clients A few of our featured clients that we would keep refreshing Platinum Partners A few of our featured clients that we would keep refreshing Our Market Places View our offerings on digital marketplaces and transform your business to become smarter through cognitive media analytics and data driven decision making Learn more Learn more Awards The most innovative Indian-ASEAN tech for Smart City First company to be selected by Singapore's PMO for their new Global Executive Entrepreneurship Award One of the global 50 smartest companies selected by Silicon Review Top 10 best IT companies Top 10 most Disruptive Face & Image Recognition Solution Providers of 2020 by Analytics Insights Magazine Top 30 fastest growing companies in Asia 2019 by Silicon Review Top 25 retail solutions provider by CIO Top companies detecting violence within videos by Reuters In the Ne ws Exclusive Interview with Abhijit Shanbhag – President and CEO, Graymatics Smart City Enabler Quantela Makes Strategic Investment in Graymatics IoT Security: How We Are Keeping Consumers Safe from Cyber Threats Supporting and Ensuring the Safety of Women Through Video Surveillance Our Market Places View our offerings on digital marketplaces and transform your business to become smarter through cognitive media analytics and data driven decision making View our offerings on digital marketplaces and transform your business to become smarter through cognitive media analytics and data driven decision making Learn more Learn more The most innovative Indian-ASEAN tech for Smart City First company to be selected by Singapore's PMO for their new Global Executive Entrepreneurship Award One of the global 50 smartest companies selected by Silicon Review Top 10 best IT companies One of the global 50 smartest companies selected by Silicon Review Top 10 most Disruptive Face & Image Recognition Solution Providers of 2020 by Analytics Insights Magazine Top 30 fastest growing companies in Asia 2019 by Silicon Review Top 25 retail solutions provider by CIO Top companies detecting violence within videos by Reuters In the Ne ws Exclusive Interview with Abhijit Shanbhag – President and CEO, Graymatics Smart City Enabler Quantela Makes Strategic Investment in Graymatics Exclusive Interview with Abhijit Shanbhag – President and CEO, Graymatics Smart City Enabler Quantela Makes Strategic Investment in Graymatics IoT Security: How We Are Keeping Consumers Safe from Cyber Threats Supporting and Ensuring the Safety of Women Through Video Surveillance IoT Security: How We Are Keeping Consumers Safe from Cyber Threats Supporting and Ensuring the Safety of Women Through Video Surveillance HELLO THERE! Send us your queries Send us your queries Twitter Facebook-f Instagram Linkedin Twitter Facebook-f Instagram Linkedin"
  ]
}