{
  "company": "www.invixium.com",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "1": 1
    }
  },
  "sample_docs": [
    "Brands that Trust Us IXM Link Partners 7 Years Of innovation has put Invixium among the top biometric access control brands in the world. In this short span, we have launched 5 beautiful products and an enterprise level software. 300+ Customers Across the globe are reselling Invixium products purchased either through regional distributors or directly in regions where we don't have distributors. 60+ Countries In the world have at least 1 Invixium unit deployed which is providing security or time tracking for organizations, using biometrics. Brands that Trust Us IXM Link Partners 7 Years Of innovation has put Invixium among the top biometric access control brands in the world. In this short span, we have launched 5 beautiful products and an enterprise level software. 300+ Customers Across the globe are reselling Invixium products purchased either through regional distributors or directly in regions where we don't have distributors. 60+ Countries In the world have at least 1 Invixium unit deployed which is providing security or time tracking for organizations, using biometrics. Brands that Trust Us Of innovation has put Invixium among the top biometric access control brands in the world. In this short span, we have launched 5 beautiful products and an enterprise level software. Across the globe are reselling Invixium products purchased either through regional distributors or directly in regions where we don't have distributors. In the world have at least 1 Invixium unit deployed which is providing security or time tracking for organizations, using biometrics."
  ]
}