{
  "company": "www.ravirajtech.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 67,
    "-1": 28
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 28,
      "0": 67
    }
  },
  "sample_docs": [
    "We Provide biometrics identifications Products and solutions India for Commercial and industrial Time Attendance Access control Applications. Manufacturer and exporter of fingerprint access control and time attendance control systems Biometrics fingerprint products for PC security, authentication India screening safe passport time clock analysis HR Payroll, immigration patterns communications Active RFID inventory management software healthcare library Tracking Asset Management Solutions India. :: Application Area :: Go Green Visitor or Membership Management RF Module Modem more ... RF Module Modem more ... GPS Antenna GSM Modem Class 10 Modem GPS USB GPRS Voice Fax Modem GSM GPRS Ethernet Gateway 3G Modem Module Series TimeTRONIX Desktop is a Biometrics Fingerprint recognition based Time Attendance package for small and medium size companies with less then 100 employees. Attention software developers !!! Now start developing biometric fingerprint based applications using SDK. 60 days full featured evaluation version of SDK is available on CD or download it from url given below. Home | Services | Products | Solutions | Support | Partners | Careers | Contact Us India, USA (New York, California) Kuwait UK Qatar Luxembourg Norway Brunei Kuwait Iceland Finland Dubai UAE Oman Bahrain Saudi Arabia Australia south Africa Canada America middle east Europe Asia Argentina Austria Azerbaijan Bahamas Bangladesh Belgium Bhutan Brazil Brunei Bulgaria Burma Cameroon Canada Chile China Colombia. Congo Costa Rica Croatia Cuba Cyprus Czech Republic Denmark East west north south Ecuador Egypt England c Laos Malaysia Maldives Islands Mauritius Mexico Myanmar Nepal The Netherlands New Zealand Nigeria Ireland Norway Oman Pakistan Philippines Poland Portugal Qatar Romania Russia Saudi Arabia Scotland Seychelles Sierra Singapore South Africa Spain Sri Lanka Sudan Sweden Switzerland Syria Taiwan Tanzania Thailand Trinidad Tunisia Turkey United Arab Emirates United Kingdom Britain United States of America Vatican Venezuela Vietnam Wales Zimbabwe Greece Slovenia Bahamas The Czech Republic Malta Barbados Lithuania Latvia Seychelles Botswana Equatorial Guinea Libya Saint Kitts and Nevis Uruguay Lebanon Mauritius Belarus Kazakhstan Grenada Iran Saint Lucia Panama Serbia Dominica Saint Vincent and the Grenadines Macedonia Republic of Dominican Republic Peru Suriname Belize Jamaica Azerbaijan Belize Biometrics India Ahmedabad, Agra, Allahabad, Amritsar, Aurangabad, Bangalore, Baroda, Bhopal, Bhubaneshwar, Bikaner, Calicut, Chennai (Madras), Chandigarh, Coimbatore, Dehradun, Faridabad, Gandhinagar, investments Gwalior, Guwahati, Hyderabad, Indore, Property Jaipur, Jalandhar, Jammu, Kanpur, Kholapur, Kochi (Cochin), Kolkata (Calcutta), Lucknow, Ludhiana, Mumbai (Bombay), Mysore, Nagpur, Nashik, New Delhi, Patna, Pondicherry, Pune, impact components Raipur, Rajkot, Ranchi, Sangli, Sholapur, Shimla, Srinagar, Surat, Thane, Trichi, Thiruvananthapuram (Trivandrum), Udaipur, Vadodara, Varanasi, Vijayawada, Vishakhapatnam, Goa Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Madhya Pradesh, Maharashtra, biometric security Fingerprint products India Orissa, Punjab, Rajasthan, Tamil Nadu, West Bengal, biometric fingerprint scanner Chandigarh, Delhi ayurvedic Development, USB, Optical, cards, Sensors, Software Biometrics Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Biometric Madhya Pradesh, Biometrics time attendance Maharashtra, Orissa, Punjab, biometric time attendance Fingerprint Rajasthan, Biometric Tamil Nadu, West Bengal, Biometric Chandigarh, Delhi India",
    ":: GPS Vehicle Tracking Management System :: A n instantaneous tracking and logging system for autos, trucks, police department, delivery services, concerned parents of teenage children, etc. This revolutionary new tracking device combines GPS with GSM digital cellular technology using a PC or laptop without going through the Internet. A 20x4 LCD is provided on front panel of unit for on the spot position verification/detection. Our GSM/GPS Vehicle Tracker system is compact, reliable, affordable and easy to use. Its small size makes it easy to install and access. real time vehicle tracking systems. convert vehicle tracking systems, spy vehicle tracking, stolen vehicle tracking, vehicle tracking device, cell phone tracking, vehicle history, gps vehicle tracking system Vehicle Tracking System s GSM GPRS Modem gps vehicle tracking vehicle tracking system vehicle tracking device gps vehicle tracking system real time vehicle tracking vehicle fleet tracking vehicle tracking uk wireless vehicle tracking real time vehicle tracking system commercial tracking vehicle covert vehicle tracking stolen tracking vehicle device gps tracking vehicle vehicle satellite tracking vehicle tracking equipment gps real time tracking vehicle vehicle tracking software gps passive tracking vehicle south tracking vehicle Yorkshire covert gps tracking vehicle maintenance tracking vehicle vehicle tracking services vehicle tracking system uk gps Oregon tracking vehicle commercial system tracking uk vehicle Georgia gps tracking. General Specifications: Physical Characteristics: • Unit size: 100 * 70 * 50mm (height) • Weight: 300 g • Black plastic ABS Case Environmental Characteristics: • Operational Temperature: -5C to +85C (board temperature) Case Environmental Characteristics: • Communication and GPS ONLINE (in power saving mode) : Fully charged battery (5 Volt – 5*1.2 Volt- 650mA) last about 7 Hours with GPS and Communication ON LINE ( GPS in power saving mode) • Communication and GPS OFFLINE (sleep mode): Fully charged battery (5 Volt – 5*1.2 Volt- 650mA) last about 26 Hours with GPS OFFLINE and Communication ON LINE. * Depends on battery age, last charge, approximate only Unit Range: • Anywhere in the world within GSM Mobile Phone coverage. vehicle , gps inexpensive passive tracking vehicle, gps pennsylvania tracking vehicle, tracking unit vehicle, gps based vehicle tracking, car gps tracking vehicle, gps mexico tracking vehicle, vehicle tracking solution,GSM Modem India, GSM Module India, GPRS Modem India, GPRS Module India, GSM India, GPRS India, GSM-GPRS modules, GSM technology, GSM india, GPRS GSM technology, gsm modem, wavecom wireless vehicle tracking , falcon gsm modem, built in gsm modem, gsm module, alarm gsm oem module, gprs oem, MC45 relay module, Gprs module, Gsm india, gprs application, gsm architecture, mobile technology, mobile, m2m, india, gprs card modem, gprs tutorial, gsm technique, gprs sincrono modem gsm terminal india, gsm security system india, gsm gloabtel india, telit gsm india, nokia m2m india, motorola, siemens, lucent technologies, bell labs india, at&t gsm mobile india, airtel, idea, bpl mobile, gam antenna, GSM, GPRS modem, module, gprs, vehicle, tracking, GPS, AVL, system, locating, locator, monitoring, gsm-modem, gsm-module, automatic, vehicle, locating, gps, gsm, vehicle, truck, vessel, satellite, satelite, GSP, GMS, avl, systems, gsp, gms, SMS, sms, wireless planet india, wireless products, machine to machine comunicaiton, pune, mumbai, delhi, kolkatta. India, USA (New York, California) UK Qatar Luxembourg Norway Brunei Kuwait Iceland Finland Dubai UAE Oman Bahrain Saudi Arabia Australia south Africa Canada America middle east Europe Asia Argentina Austria Azerbaijan Bahamas Bangladesh Belgium Bhutan Brazil Brunei Bulgaria Burma Cameroon Canada Chile China Colombia. Congo Costa Rica Croatia Cuba Cyprus Czech Republic Denmark East west north south Ecuador Egypt England c Laos Malaysia Maldives Islands Mauritius Mexico Myanmar Nepal The Netherlands New Zealand Nigeria Ireland Norway Oman Pakistan Philippines Poland Portugal Qatar Romania Russia Saudi Arabia Scotland Seychelles Sierra Singapore South Africa Spain Sri Lanka Sudan Sweden Switzerland Syria Taiwan Tanzania Thailand Trinidad Tunisia Turkey United Arab Emirates United Kingdom Britain United States of America Vatican Venezuela Vietnam Wales Zimbabwe Greece Slovenia Bahamas The Czech Republic Malta Barbados Lithuania Latvia Seychelles Botswana Equatorial Guinea Libya Saint Kitts and Nevis Uruguay Lebanon Mauritius Belarus Kazakhstan Grenada Iran Saint Lucia Panama Serbia Dominica Saint Vincent and the Grenadines Macedonia Republic of Dominican Republic Peru Suriname Belize Jamaica Azerbaijan Belize Biometrics India Ahmedabad, Agra, Allahabad, Amritsar, Aurangabad, Bangalore, Baroda, Bhopal, Bhubaneshwar, Bikaner, Calicut, Chennai (Madras), Chandigarh, Coimbatore, Dehradun, Faridabad, Gandhinagar, investments Gwalior, Guwahati, Hyderabad, Indore, Property Jaipur, Jalandhar, Jammu, Kanpur, Kholapur, Kochi (Cochin), Kolkata (Calcutta), Lucknow, Ludhiana, Mumbai (Bombay), Mysore, Nagpur, Nashik, New Delhi, Patna, Pondicherry, Pune, impact components Raipur, Rajkot, Ranchi, Sangli, Sholapur, Shimla, Srinagar, Surat, Thane, Trichi, Thiruvananthapuram (Trivandrum), Udaipur, Vadodara, Varanasi, Vijayawada, Vishakhapatnam, Goa Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Madhya Pradesh, Maharashtra, biometric security Fingerprint products India Orissa, Punjab, Rajasthan, Tamil Nadu, West Bengal, biometric fingerprint scanner Chandigarh, Delhi ayurvedic Devlopement, USB, Optical, cards, Sensors, Software Biometrics Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Biometric Madhya Pradesh, Biometrics Maharashtra, Orissa, Punjab, biometric time attendance Fingerprint Rajasthan, Biometric Tamil Nadu, West Bengal, Biometric Chandigarh, Delhi Home | Services | Products | Solutions | Support | Partners | Careers | Contact Us",
    "Attention software developers !!! Now start developing biometric fingerprint based applications using SDK. 60 days full featured evaluation version of SDK is available on CD or download it from url given below. Deploying these biometrics technologies can be used separately or together in one powerful package to meet your entire authentication, verification and identification needs. Our proven technologies allow customers to develop highly scalable biometrics security solutions. Our FBI certified award winning biometrics devices and fingerprints scanners have rugged design and an unmatched fingerprint capturing capability. Our fingerprint readers are ideal for government innovativeness and enterprise applications. We provide electronic security system rugged structure for outdoor installation and extra durability Time Attendance Systems with Fast and accurate fingerprint identification Award winning fingerprint algorithm Deploying these biometrics technologies can be used separately or together in one powerful package to meet your entire authentication, verification and identification needs. Our proven technologies allow customers to develop highly scalable biometrics security solutions. Our FBI certified award winning biometrics devices and fingerprints scanners have rugged design and an unmatched fingerprint capturing capability. Our fingerprint readers are ideal for government innovativeness and enterprise applications. We provide electronic security system rugged structure for outdoor installation and extra durability Time Attendance Systems with Fast and accurate fingerprint identification Award winning fingerprint algorithm Contactless Palm Vein System Visitor or Membership Management RF Module Modem more ... UHF VHF Bluetooth NFC reader Anti Theft Solutions Retail RFID Silicon wrist Band GPS Antenna GSM Modem Class 10 Modem GPS USB GPRS Voice Fax Modem GSM GPRS Ethernet Gateway 3G Modem Module Series 4G Module Modem LTE We Provide biometrics identifications Products and solutions India for Commercial and industrial Time Attendance Access control Applications. Manufacturer and exporter of fingerprint access control and time attendance control systems Biometrics fingerprint products for PC security, authentication India screening safe passport time clock analysis HR Payroll, immigration patterns communications Active RFID inventory management software healthcare library Tracking Asset Management Solutions Institute management system India. We offers customized solutions to allow integration of our biometrics security software with your existing IT environment ... more Our biometric devices and biometrics software products include Fingerprint Time and Attendance, Fingerprint Access Control systems, USB Fingerprint Scanners, Embedded Fingerprint reader Modules, Fingerprint SDK (API), Biometrics Computer Logon, Mobile Fingerprint Scanner, Palm Vain Time Attendance Systems , Iris Access Control system, Web Based ID, Signature Verification, Voice Authentication Systems. Security System s Tripod Turnstile Automatic Barrier gate System . Home | Services | Products | Solutions | Support | Partners | Careers | Contact Us :: Useful Links :: Biometrics Access Control Fingerprint Scanners USB Fingerprint t echnologies Biometric Security Embedded Resource News Biometrics Fingerprints Software eOffice Resources RFID Modem/Module Biometrics Access control OEM Fingerprint Gold Campaign Sensors Software Development Kit GSM GPRS Products Biometrics services Wireless Data Terminal Biometric solutions BiometricsTime Attendance Rapidindex Fingerprints products Fingerprints Standalone Modules Property Management RFID Info Axis Systems Biometric Product GSM GPRS Modem Fingerprints Time Attendance Wireless Security Fingerprints Readers Electronics Time Attendance Biometrics Tech Fingerprint ID Products Ayurvedic Fingerprints Access Control Time Recorders Embedded Solution Biometrics Resources Mini ITX BOX Advanced Technologies Solutions",
    "Smart suite is a Visitor Management Software that assists you in professionalizing the manner in which you welcome your visitors and at same time you keep track on visitors. The Visitor Management Module allows you to welcome and manage your incoming and outgoing visitors' whether they are planned or not. Complete Web based software Easy to understand for security person Complete track on company vehicles visiting outside and detailed database Visitor Management Software | Web based Visitor Management System | Visitor Management Solution | Visitor Management Online Visitor Management Solution | Visitor Management Online Biometrics visitor management guest management electronic visitor visitor center visitor impact management visitor pass management visitor relationship management visitor management gated community security customer management biometric technology biometric security smart cards low cost free cheap Biometrics India USA America Europe Japan UK Germany france uae singapore Time attendance india access control india biometric india security india Fingerprint india Precise Biometrics Biometric Biometrics Security Biometrics Information Bio Biometrics india Biometric Fingerprint scanners. Most organizations manage their members by giving them a Photo Identity cards. This lead to following issues: Members don't like to carry so many additional cards, hence most members do not carry cards and this undermine the complete purpose of investing in card management and issuing system. Members don't like to carry so many additional cards, hence most members do not carry cards and this undermine the complete purpose of investing in card management and issuing system. Cards can still be misused as they can be easily transferred to other person. Cards can still be misused as they can be easily transferred to other person. There is no effective tracking of members which could have provided important decision making information. There is no effective tracking of members which could have provided important decision making information. What can Biometrics Fingerprint based Member & Visitor Management offer you? Control access to facilities and information Avoid misuse of flexible membership packages Track members effectively and analyze their pattern Improve member retention Reduce time and effort managing members/Visitors Monitor effectiveness of membership packages Manage resource allocation effective Simplify and standardize daily operations Instantly access member information Control access to facilities and information Control access to facilities and information Avoid misuse of flexible membership packages Avoid misuse of flexible membership packages Track members effectively and analyze their pattern Track members effectively and analyze their pattern Reduce time and effort managing members/Visitors Reduce time and effort managing members/Visitors Monitor effectiveness of membership packages Monitor effectiveness of membership packages Manage resource allocation effective Manage resource allocation effective Simplify and standardize daily operations Simplify and standardize daily operations Instantly access member information Instantly access member information .: Related Products :. Time-TRONIX Desktop is a USB Optical Fingerprint scanner based Computer software (online) controlled low cost but robust Time Attendance Membership & Visitor Management system. It offers fast 1:N matching and easy to use functions. :: Useful Links :: Home | Services | Products | Solutions | Support | Partners | Careers | Contact Us",
    "We provide E lectromagnetic Door locks, Electric strikes ,EM Locks India Electromagnetic Electromagnetic Door locks, Electromagnetic Door locks India locks lock padlocks padlock schlage deadbolt kwikset locksmith medeco lock picking combination mortice deadbolts Electric strikes India EM Locks Ele Electric Locks and Electric Strikes,SDC Security Door Controls, ISO 9001 certified manufacturer of door access control lock, locks, device, devices, door lock electric, electronic, door lock security, door control, door entry system, systems, door strike, electric bolt lock, electric cabinet lock, electric strike, cabinet door bolt lock, SDC Security Door Controls, SO 9001 certified manufacturer of Electric door strike, strikes, electric door lock, locks, electric lock, locks, electric deadbolt, lectric hinge, power transfer hinge, SDC Security Door Controls, ISO 9001 certified manufacturer of electronic lock, locks, exit delay ystem, exit delay alarm lock, exit alarm, exit switch, exit switches, SDC Security Door Controls, ISO 9001 certified manufacturer of equest-to-exit switch, exit button, electronic deadbolt, electronic door lock, locks, electronic keypad, keypad door lock, locks, lectronic keypad lock, SDC Security Door Controls, ISO 9001 certified manufacturer of access control key switch, SPDT, DPDT, key switches, omentary, maintained, locking devices, electric locking device, locking system, locking systems, lock manufacturerIndia, U. Which lock can be use for emergency exit doors? Please check and confirmed your emergency exit door direction. Out-swinging Emergency Exit Door Out-swinging Emergency Exit Door (Double Leaf) In-swinging Emergency Exit Door In-swinging Emergency Exit Door (Double Leaf) Double Action Emergency Exit Door Double Action Emergency Exit Door-2 Sliding Door Out-swinging Emergency Exit Door Recommended Electromagnet Lock 10020BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200 LBS) Features: 10020BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\"within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Regular Installation Optional Bracket for 10020BZ Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" Optional Brackets 300 LBS 38mm L-150 600LBS 42mm L-300,EM-10001L, L-01ST,L-GL600 800 LBS 48mm L-750,L-350,L-400,L-GL600 1200 LBS 60mm L-500,L-600 Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar Out-swinging Emergency Exit Door (Double Leaf) Recommended Electromagnet Lock 10040BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200x2 LBS) Features: 10040BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Regular Installation Optional Bracket L-500 x2 for 10040BZ Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" Optional Brackets 300 LBS 38mm L-150 600LBS 42mm L-300,EM-10001L, L-01ST,L-GL600 800 LBS 48mm L-750,L-350,L-400,L-GL600 1200 LBS 60mm L-500,L-600 Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar In-swinging Emergency Exit Door Recommended Electromagnet Lock 10020BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200 LBS) Features: 10020BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A LZ- bracket for the electromagnet depending on the narrow frame Regular Installation Recommended System DG-600E Stand alone proximity reader Features 1. Allows up to 600 proximity cards and PIN codes 2. Tamper switch and alarm buzzer included 3. Fully Programmable via keypad and master code 4. Access mode selectable: card only ;card or PIN ;card+PIN 5. Supports Wiegand 26/44-bit format auxiliary reader 6. Logical memory to prevent duplication 7. Invalid PIN Lock-out Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" 300 LBS ---------- 600 LBS 48mm 800 LBS 54mm 1200 LBS 76mm In-swinging Emergency Exit Door (Double Leaf) Recommended Electromagnet Lock 10040BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200x2 LBS) Features: 10040BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame Regular Installation Recommended System DG-600E Stand alone proximity reader Features 1. Allows up to 600 proximity cards and PIN codes 2. Tamper switch and alarm buzzer included 3. Fully Programmable via keypad and master code 4. Access mode selectable: card only ;card or PIN ;card+PIN 5. Supports Wiegand 26/44-bit format auxiliary reader 6. Logical memory to prevent duplication 7. Invalid PIN Lock-out Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" 300 LBS ---------- 600 LBS 48mm 800 LBS 54mm 1200 LBS 76mm Double Action Emergency Exit Door Recommended Electromagnet Lock GS-200 Shear Lock Features: The GS-200 Shear Lock locks by seating two conical locking bolts located on opposite corners of the Armature Plate into matching keep holes on each end of the Electromagnet body. Shear Locks never bind under pressure, are not sensitive to door alignment, and do not require door position sensing or auxiliary timing circuitry. Attention: Make sure the gap between the door top rail and frame header is 2mm. Make adjustments to the door as required. Optional The unit may also be fitted semi-flush with the use of the SMB-200 Bracket. The magnet should be fitted to the door transom and the housing holding the armature on to the door.It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Regular Installation Semi- Flush Installation The GS-200 may also be fitted semi-flush with the use of the SMB-200 Bracket. The magnet should be fitted to the door transom and the housing holding the armature on to the door. It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Surface Installation The GS-200 may also be fitted surface mounted using 2pcs of the SMB-200 Bracket. The housing holding the magnet should be fitted above the door and the housing holding the armature on to the door. It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Double Action Emergency Exit Door-2 Recommended Electromagnet Lock 10010 Indoor magnet (up to 1200 LBS) Features: Double Action Door change to Single Action Door, may omit in which if the door is not align because of the gate position factor to cage. Attention: First confirmed the doorframe the width whether can accommodate or not. Regular Installation Pay attention to the width of the Doorframe Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar Sliding Door Recommended Electromagnet Lock GS-705 Shear Lock (up to 2700 LBS in shear) Features: The GS-705 Shear Locks provide up to 2700 pounds shearing force and may be fitted in either aluminum, wood, steel or exit doors with the assistance of SMB-001 bracket. Regular Installation Dimensions Optional SMB-001 Bracket For GS-705-35 Surface mount installation Identify the thinness of the door leaf or frame header and inspect to determine if SMB-001 bracket is required. Installation manual 1. Which lock can be use for external doors? 2. Which lock can be use on aluminum doors? 3. Which lock can be use on wooden door? 4. Which lock can be use on glass door? 5. Which lock can be use for emergency exit doors? :: Order Information India - International Order By E-mail for orders e-mail: sales@ravirajtech.com with subject: EM-1000 or EM-20000 Order by Fax Orders By FAX You may place an order by fax 24 hours a day, 7 days a week. Simply print the form below and fax it to us at:+91-020-24475992 Download Fax Order Form Which lock can be use for emergency exit doors? Please check and confirmed your emergency exit door direction. Out-swinging Emergency Exit Door Out-swinging Emergency Exit Door (Double Leaf) In-swinging Emergency Exit Door In-swinging Emergency Exit Door (Double Leaf) Double Action Emergency Exit Door Double Action Emergency Exit Door-2 Sliding Door Out-swinging Emergency Exit Door Recommended Electromagnet Lock 10020BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200 LBS) Features: 10020BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\"within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Regular Installation Optional Bracket for 10020BZ Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" Optional Brackets 300 LBS 38mm L-150 600LBS 42mm L-300,EM-10001L, L-01ST,L-GL600 800 LBS 48mm L-750,L-350,L-400,L-GL600 1200 LBS 60mm L-500,L-600 Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar Out-swinging Emergency Exit Door (Double Leaf) Recommended Electromagnet Lock 10040BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200x2 LBS) Features: 10040BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Regular Installation Optional Bracket L-500 x2 for 10040BZ Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" Optional Brackets 300 LBS 38mm L-150 600LBS 42mm L-300,EM-10001L, L-01ST,L-GL600 800 LBS 48mm L-750,L-350,L-400,L-GL600 1200 LBS 60mm L-500,L-600 Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar In-swinging Emergency Exit Door Recommended Electromagnet Lock 10020BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200 LBS) Features: 10020BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A LZ- bracket for the electromagnet depending on the narrow frame Regular Installation Recommended System DG-600E Stand alone proximity reader Features 1. Allows up to 600 proximity cards and PIN codes 2. Tamper switch and alarm buzzer included 3. Fully Programmable via keypad and master code 4. Access mode selectable: card only ;card or PIN ;card+PIN 5. Supports Wiegand 26/44-bit format auxiliary reader 6. Logical memory to prevent duplication 7. Invalid PIN Lock-out Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" 300 LBS ---------- 600 LBS 48mm 800 LBS 54mm 1200 LBS 76mm In-swinging Emergency Exit Door (Double Leaf) Recommended Electromagnet Lock 10040BZ Indoor magnet (Monitored/Buzzer Alarm) (up to 1200x2 LBS) Features: 10040BZ build-in buzzer for the \"Door Held Open Alarm\" is depending on the \"VR timer adjust\" within 20 seconds. Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame Regular Installation Recommended System DG-600E Stand alone proximity reader Features 1. Allows up to 600 proximity cards and PIN codes 2. Tamper switch and alarm buzzer included 3. Fully Programmable via keypad and master code 4. Access mode selectable: card only ;card or PIN ;card+PIN 5. Supports Wiegand 26/44-bit format auxiliary reader 6. Logical memory to prevent duplication 7. Invalid PIN Lock-out Pay attention to the width of the Doorframe The \"A\" value in the table below for each bracket to mount on the door frame, shows the minimum requirement width of the door frame for different electromagnetic. Lock model. Magnet Grade Value \"A\" 300 LBS ---------- 600 LBS 48mm 800 LBS 54mm 1200 LBS 76mm Double Action Emergency Exit Door Recommended Electromagnet Lock GS-200 Shear Lock Features: The GS-200 Shear Lock locks by seating two conical locking bolts located on opposite corners of the Armature Plate into matching keep holes on each end of the Electromagnet body. Shear Locks never bind under pressure, are not sensitive to door alignment, and do not require door position sensing or auxiliary timing circuitry. Attention: Make sure the gap between the door top rail and frame header is 2mm. Make adjustments to the door as required. Optional The unit may also be fitted semi-flush with the use of the SMB-200 Bracket. The magnet should be fitted to the door transom and the housing holding the armature on to the door.It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Regular Installation Semi- Flush Installation The GS-200 may also be fitted semi-flush with the use of the SMB-200 Bracket. The magnet should be fitted to the door transom and the housing holding the armature on to the door. It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Surface Installation The GS-200 may also be fitted surface mounted using 2pcs of the SMB-200 Bracket. The housing holding the magnet should be fitted above the door and the housing holding the armature on to the door. It is vital that a minimum gap of 2mm exists between the magnet and the armature, to allow correct operation. Double Action Emergency Exit Door-2 Recommended Electromagnet Lock 10010 Indoor magnet (up to 1200 LBS) Features: Double Action Door change to Single Action Door, may omit in which if the door is not align because of the gate position factor to cage. Attention: First confirmed the doorframe the width whether can accommodate or not. Regular Installation Pay attention to the width of the Doorframe Optional The PBA-860 Switch Bar is focus on emergency exit doors (or other large-scale type doors), with a pressure push immediately cut the interior micro switch unlocking the electromagnet lock or other similar devices. Available in length of 36\" Standard Sized in Satin Silver, Red and Green Colors for versatile applications. PBA-860 Micro switch Bar Sliding Door Recommended Electromagnet Lock GS-705 Shear Lock (up to 2700 LBS in shear) Features: The GS-705 Shear Locks provide up to 2700 pounds shearing force and may be fitted in either aluminum, wood, steel or exit doors with the assistance of SMB-001 bracket. Regular Installation Dimensions Optional SMB-001 Bracket For GS-705-35 Surface mount installation Identify the thinness of the door leaf or frame header and inspect to determine if SMB-001 bracket is required. Installation manual 1. Which lock can be use for external doors? 2. Which lock can be use on aluminum doors? 3. Which lock can be use on wooden door? 4. Which lock can be use on glass door? 5. Which lock can be use for emergency exit doors? :: Order Information India - International Order By E-mail for orders e-mail: sales@ravirajtech.com with subject: EM-1000 or EM-20000 Order by Fax Orders By FAX You may place an order by fax 24 hours a day, 7 days a week. Simply print the form below and fax it to us at:+91-020-24475992 Download Fax Order Form Out-swinging Emergency Exit Door Out-swinging Emergency Exit Door (Double Leaf) In-swinging Emergency Exit Door In-swinging Emergency Exit Door (Double Leaf) Double Action Emergency Exit Door Double Action Emergency Exit Door-2 Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame . Attention: Identify the door frame header to determine if bracket is required. A LZ- bracket for the electromagnet depending on the narrow frame Attention: Identify the door frame header to determine if bracket is required. A L- bracket for the electromagnet depending on the narrow frame Attention: First confirmed the doorframe the width whether can accommodate or not. for orders e-mail: sales@ravirajtech.com with subject: EM-1000 or EM-20000 .: Related Products :. :: Useful Links :: Home | Services | Products | Solutions | Support | Partners | Careers | Contact Us India, USA (New York, California), UK, Dubai, UAE, Oman, Bahrain, Saudi Arabia, Australia, south Africa, Canada, America, middle east, Europe, Asia, Argentina, Austria, Azerbaijan, Bahamas, Bangladesh, Belgium, Bhutan, Brazil, Brunei, Bulgaria, Burma, Cameroon, Canada, Chile, China, Colombia. Congo, Costa Rica, Croatia, Cuba, Cyprus, Czech Republic, Denmark, East west north south, Ecuador, Egypt, England, c Laos, Malaysia, Maldives, Islands, Mauritius, Mexico, Myanmar, Nepal, The Netherlands, New Zealand, Nigeria, Ireland, Norway, Oman, Pakistan, Philippines, Poland, Portugal, Qatar, Romania, Russia, Saudi Arabia, Scotland, Seychelles, Sierra, code Singapore, South Africa, Spain, Sri Lanka, Sudan Sweden, Switzerland, Syria, Taiwan, Tanzania, impact components Thailand, Trinidad, Tunisia, Turkey, United Arab books onlinebooks Emirates, United Kingdom, Britain, United States of America, Vatican, Venezuela, Vietnam, Wales, Zimbabwe Ahmedabad, Agra, Allahabad, Amritsar, Aurangabad, Bangalore, Baroda, Bhopal, Bhubaneshwar, Bikaner, Calicut, Chennai (Madras), Chandigarh, Coimbatore, Dehradun, Faridabad, Gandhinagar, Gwalior, Guwahati, Hyderabad, Indore, Jaipur, Jalandhar, Jammu, Kanpur, Kholapur, Kochi (Cochin), Kolkata (Calcutta), Lucknow, Ludhiana, Mumbai (Bombay), Mysore, Nagpur, Nashik, New Delhi, Patna, Pondicherry, Pune, Raipur, Rajkot, Ranchi, Sangli, Sholapur, Shimla, Srinagar, Surat, Thane, Trichi, Thiruvananthapuram (Trivandrum), Udaipur, Vadodara, Varanasi, Vijayawada, Vishakhapatnam, Goa Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Madhya Pradesh, Maharashtra, Orissa, Punjab, Rajasthan, Tamil Nadu, West Bengal, Chandigarh, Delhi Biometrics , Biometric, Biometrics Time Attendance, Access Control, Fingerprint scanners, readers Standalone OEM modules, SDK, Products, Solutions, services, Projects, ayurvedic Devlopement, USB, Optical, cards, Sensors, Software Biometrics Andhra Pradesh, Assam, Bihar, Goa, Gujarat, Karnataka, Biometric Madhya Pradesh, Biometrics Maharashtra, Orissa, Punjab, Fingerprint Rajasthan, Biometric Tamil Nadu, West Bengal, Biometric Chandigarh, Fingerprint Delhi"
  ]
}