{
  "company": "www.photko.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 21,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4305555555555556,
    "framing_surveillance": 0.1944444444444444,
    "framing_market": 0.375,
    "num_docs": 24
  },
  "topic_timeline": {
    "20": {
      "-1": 21,
      "0": 3
    }
  },
  "sample_docs": [
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War When the puppet cast of an '80s children's TV show begins to get murdered one by one, a disgraced LAPD detective-turned-private eye puppet takes on the case. After a hunting expedition goes awry, a young caveman struggles against the elements to find his way home. To All the Boys I've Loved Before To All the Boys I've Loved Before Lara Jean's love life goes from imaginary to out of control when her secret letters to every boy she's ever fallen for are mysteriously mailed out. The life of a teenage boy is forever altered by a chance encounter with cutting edge military technology. A CIA field officer and an Indonesian police officer are forced to work together in confronting political corruption. An informant must be moved twenty-two miles to safety. Down a Dark Hall Down a Dark Hall Kitt Gordy, a new student at the exclusive Blackwood Boarding School, confronts the institution's supernatural occurrences and dark powers of its headmistress. Spencer Reinhard, Warren Lipka, Eric Borsuk and Chas Allen are four friends who live an ordinary existence in Kentucky. After a visit to Transylvania University, Lipka comes up with the idea to steal the rarest and most valuable books from the school's library. As one of the most audacious art heists in U.S. history starts to unfold, the men question whether their attempts to inject excitement and purpose into their lives are simply misguided attempts at achieving the American dream. In a small town in Massachusetts, four high school girls perform a ritual in an attempt to debunk the lore of Slender Man. When one of the girls goes mysteriously missing, they begin to suspect that she is, in fact, his latest victim. A deep sea submersible pilot revisits his past fears in the Mariana Trench, and accidentally unleashes the seventy foot ancestor of the Great White Shark believed to be extinct. The Spy Who Dumped Me The Spy Who Dumped Me Audrey and Morgan are best friends who unwittingly become entangled in an international conspiracy when one of the women discovers the boyfriend who dumped her was actually a spy. When a group of teenagers goes on a spring break camping trip, an unfortunate accident sets off a race to save their friend's most prized possession. Teen Titans Go! To the Movies Teen Titans Go! To the Movies It seems that all the major superheroes out there are starring in their own movies -- all but the Teen Titans. Robin is bound and determined to remedy that situation by becoming a star instead of a sidekick. With a few madcap ideas and a song in their hearts, the Teen Titans head to Hollywood to fulfill their dreams. Things soon go awry, however, when a supervillain plans to take over the planet -- putting the very fate of the young heroes on the line. Collin must make it through his final three days of probation for a chance at a new beginning. He and his troublemaking childhood best friend, Miles, work as movers, and when Collin witnesses a police shooting, the two men's friendship is tested as they grapple with identity and their changed realities in the rapidly-gentrifying neighborhood they grew up in. After a disease kills 98% of America's children, the surviving 2% develop superpowers and are placed in internment camps. A 16-year-old girl escapes her camp and joins a group of other teens on the run from the government. Working-class family man Christopher Robin encounters his childhood friend Winnie-the-Pooh, who helps him to rediscover the joys of life. ​When a 20-something finds a cache of hidden files on his new laptop, he and his friends are unwittingly thrust into the depths of the dark web. They soon discover someone has been watching their every move and will go to unimaginable lengths to protect the dark web. In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It. Written by Emma Chapman Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened. Written by Benett Sullivan Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. 12 years after the tragic death of their little girl, a dollmaker and his wife welcome a nun and several girls from a shuttered orphanage into their home, where they soon become the target of the dollmaker's possessed creation, Annabelle. Baby is a young and partially hearing impaired getaway driver who can make any wild move while in motion with the right track playing. It's a critical talent he needs to survive his indentured servitude to the crime boss, Doc, who values his role in his meticulously planned robberies. However, just when Baby thinks he is finally free and clear to have his own life with his new girlfriend, Deborah, Doc coerces him back for another job. Now saddled with a crew of thugs too violently unstable to keep to Doc's plans, Baby finds himself and everything he cares for in terrible danger. To survive and escape the coming maelstrom, it will take all of Baby's skill, wits and daring, but even on the best track, can he make it when life is forcing him to face the music? Written by Kenneth Chisholm ( [email protected] ) Pirates of the Caribbean: Dead Men Tell No Tales Pirates of the Caribbean: Dead Men Tell No Tales Captain Jack Sparrow finds the winds of ill-fortune blowing even more strongly when deadly ghost pirates led by his old nemesis, the terrifying Captain Salazar, escape from the Devil's Triangle, determined to kill every pirate at sea...including him. Captain Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, a powerful artifact that bestows upon its possessor total control over the seas. After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother-a brother who desperately wishes to follow in his twin's despicable footsteps-one former super-villain will rediscover just how good it feels to be bad. In sun-kissed Emerald Bay, the vigorous Lieutenant Mitch Buchannon and Baywatch, his elite team of hand-picked and perfectly tanned lifeguards, protect the bay, keeping both sunbathers and beach lovers safe. However, this summer, two new eager trainees will join the demanding life-saving program, as well as an insubordinate former Olympic swimmer, who are all called to prove their worth on the lifeguard towers just on time when a new synthetic street drug begins to infest the Emerald Bay: the flakka. Without a doubt, this calls for some serious undercover teamwork action, as the badgeless heroes in spandex comb the beach for shady newcomers and nefarious entrepreneurs with hidden agendas of their own. Can Mitch's band save the bay? Written by Nick Riganas War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when a pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers and her true destiny. Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy. Together, Batman and Wonder Woman work quickly to find and recruit a team of metahumans to stand against this newly awakened threat. But despite the formation of this unprecedented league of heroes-Batman, Wonder Woman, Aquaman, Cyborg and The Flash-it may already be too late to save the planet from an assault of catastrophic proportions. Guardians of the Galaxy Vol. 2 Guardians of the Galaxy Vol. 2 After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy. Written by Blazer346 Seven-year-old Tim Templeton has always been a boy of an overactive imagination, and for the past seven years, life was all peaches for him, getting all the love and affection from his caring parents. However, life will never be the same and Tim won't be the centre of attention anymore as the arrival of an improbable new brother named Boss Baby, dressed in a black suit complete with a tie and a briefcase, will shortly rob him of all love, as he takes over the whole Templetons' house. Nevertheless, although this may be true, soon, Tim and the new Boss in a diaper will need to put differences aside and join forces, as a sneaky scheme involving the head of Puppy Co. threatens to tilt the balance of power towards their insidiously adorable furry antagonists, not to mention that the next Pet Convention is in only two days.. Brothers, hurry up. Written by Nick Riganas Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn't through yet will test the heart of a champion on Piston Cup Racing's biggest stage! Written by Pixar Though safely entombed in a crypt deep beneath the unforgiving desert, an ancient princess, whose destiny was unjustly taken from her, is awakened in our current day bringing with her malevolence grown over millennia, and terrors that defy human comprehension. Written by Universal Pictures Christian and Ana decide to rekindle their relationship, except this time there are no more rules or punishments. As they begin to get used to their newfound relationship, Christian's past begins to haunt Ana as Christian struggles with his innermost thoughts. A look at the life, work and religious heritage of violinist Itzhak Perlman. Planet Earth II Episode 5 Planet Earth II Episode 5 David Attenborough returns in this breathtaking documentary showcasing life on Planet Earth. In a desolate war zone where screams of the innocent echo, on the very line between disaster and valor, 7 Maroon Berets will dance with death. A corrupt company, by the name of ShinRa is draining the energy out of the (nameless) planet and conducting expiriments on living things. Enviromental and social callamities, such as the pollution of the air and seas, overpopulation, high drug rate and treating women like objects. A mercenary and a rough and tough organization by the name of Avalanche must put an end to ShinRa, but a couple of ShinRa victims might be causing a bigger threat. One of the ShinRa victims is an alien that crash-landed on the planet and killed an ancient race. The other ShinRa victim is a man in a trench coat that wants to rule the world and summon the doomsday meteorite. Written by Jenova Synthesis [email protected] Grace, a teenage girl dying of cancer crashes a funeral home to find out what will happen to her after she dies but ends up teaching the awkward funeral director, Bill Jankowski how to celebrate life. This is an anti war film where we see a soldier's psychological state deteriorate due to the effects of war. It is not set in any particular time or war as it is meant to represent the soldier's post-combat state of mind. Set in backdrop of 1980s, Chitti Babu (Ram Charan) is a hearing impaired man who runs a boat for his livelihood in the village of Rangasthalam. But he becomes a crucial part of Rangasthalam politics where the politics of Rangasthalam ruled by 2 people and rivalry existing between the 2 people. Written by krishna vamsi Doctor Who: The Day of the Doctor Doctor Who: The Day of the Doctor In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. What Is Consciousness? What Is Its Purpose? What Is Consciousness? What Is Its Purpose? Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red. Written by J-S-Golden A young man (Matthew Gray Gubler) attends the funeral of his biological father, a man he never knew, only to meet a mysterious, quirky stranger (Jere Burns), who claims to have been best friends with his dad. The two set out on a comic adventure, helping one pursue the love of his life while the other leaves a trail of broken hearts and bank accounts in his wake. Documentary chronicling the intimate story of an aspiring actor who brings his sister, born with Down syndrome, out to Los Angeles to pursue her dream of becoming a Hollywood diva. But as her health begins to fail and she becomes increasing jealous of his fiancée, he is forced to confront his co-dependent sibling relationship and the threat it is posing on his engagement. A cinematic representation of Taylor Bennett's acclaimed album, Broad Shoulders guides us through a failed relationship. Dealing with lust, loss, and love Taylor and Heston Charres team up to pair movies and music with this visual album. When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen. Written by J. S. Golden Star Wars Rebels: The Siege of Lothal Star Wars Rebels: The Siege of Lothal When the rebel crew plan to evacuate, Ezra disagrees to let the people be in danger of the Empire and gets some unpleasant company. The Godfather: Part II The Godfather: Part II The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba. Written by Keith Loh [email protected] In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It. Written by Emma Chapman Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened. Written by Benett Sullivan Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. 12 years after the tragic death of their little girl, a dollmaker and his wife welcome a nun and several girls from a shuttered orphanage into their home, where they soon become the target of the dollmaker's possessed creation, Annabelle. Baby is a young and partially hearing impaired getaway driver who can make any wild move while in motion with the right track playing. It's a critical talent he needs to survive his indentured servitude to the crime boss, Doc, who values his role in his meticulously planned robberies. However, just when Baby thinks he is finally free and clear to have his own life with his new girlfriend, Deborah, Doc coerces him back for another job. Now saddled with a crew of thugs too violently unstable to keep to Doc's plans, Baby finds himself and everything he cares for in terrible danger. To survive and escape the coming maelstrom, it will take all of Baby's skill, wits and daring, but even on the best track, can he make it when life is forcing him to face the music? Written by Kenneth Chisholm ( [email protected] ) Pirates of the Caribbean: Dead Men Tell No Tales Pirates of the Caribbean: Dead Men Tell No Tales Captain Jack Sparrow finds the winds of ill-fortune blowing even more strongly when deadly ghost pirates led by his old nemesis, the terrifying Captain Salazar, escape from the Devil's Triangle, determined to kill every pirate at sea...including him. Captain Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, a powerful artifact that bestows upon its possessor total control over the seas. After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother-a brother who desperately wishes to follow in his twin's despicable footsteps-one former super-villain will rediscover just how good it feels to be bad. In sun-kissed Emerald Bay, the vigorous Lieutenant Mitch Buchannon and Baywatch, his elite team of hand-picked and perfectly tanned lifeguards, protect the bay, keeping both sunbathers and beach lovers safe. However, this summer, two new eager trainees will join the demanding life-saving program, as well as an insubordinate former Olympic swimmer, who are all called to prove their worth on the lifeguard towers just on time when a new synthetic street drug begins to infest the Emerald Bay: the flakka. Without a doubt, this calls for some serious undercover teamwork action, as the badgeless heroes in spandex comb the beach for shady newcomers and nefarious entrepreneurs with hidden agendas of their own. Can Mitch's band save the bay? Written by Nick Riganas War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when a pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers and her true destiny. Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy. Together, Batman and Wonder Woman work quickly to find and recruit a team of metahumans to stand against this newly awakened threat. But despite the formation of this unprecedented league of heroes-Batman, Wonder Woman, Aquaman, Cyborg and The Flash-it may already be too late to save the planet from an assault of catastrophic proportions. Guardians of the Galaxy Vol. 2 Guardians of the Galaxy Vol. 2 After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy. Written by Blazer346 Seven-year-old Tim Templeton has always been a boy of an overactive imagination, and for the past seven years, life was all peaches for him, getting all the love and affection from his caring parents. However, life will never be the same and Tim won't be the centre of attention anymore as the arrival of an improbable new brother named Boss Baby, dressed in a black suit complete with a tie and a briefcase, will shortly rob him of all love, as he takes over the whole Templetons' house. Nevertheless, although this may be true, soon, Tim and the new Boss in a diaper will need to put differences aside and join forces, as a sneaky scheme involving the head of Puppy Co. threatens to tilt the balance of power towards their insidiously adorable furry antagonists, not to mention that the next Pet Convention is in only two days.. Brothers, hurry up. Written by Nick Riganas Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn't through yet will test the heart of a champion on Piston Cup Racing's biggest stage! Written by Pixar Though safely entombed in a crypt deep beneath the unforgiving desert, an ancient princess, whose destiny was unjustly taken from her, is awakened in our current day bringing with her malevolence grown over millennia, and terrors that defy human comprehension. Written by Universal Pictures Christian and Ana decide to rekindle their relationship, except this time there are no more rules or punishments. As they begin to get used to their newfound relationship, Christian's past begins to haunt Ana as Christian struggles with his innermost thoughts. In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea. Written by Sam Gray Power tells the story of James Ghost St. Patrick, a wealthy New York City nightclub owner who caters to the city's elite. He wants to build an empire, turn the club into a Fortune 500 business, but there's just one problem: Ghost is living a double life. When he is not in the club, he is the kingpin of the most lucrative drug network in New York for a very high-level clientele. His marriage, family and business all become unknowingly threatened as he is tempted to leave his criminal life behind and become the rags-to-riches businessman he wants to be most of all. Written by Jiilo_Kim An animated series on adult-swim about the infinite adventures of Rick, a genius alcoholic and careless scientist, with his grandson Morty, a 14 year-old anxious boy who is not so smart, but always tries to lead his grandfather with his own morale compass. Together, they explore the infinite universes; causing mayhem and running into trouble. Written by Ruben Galaviz Scott McCall was just another kid in high school. Until, one night his best friend Stiles brings him to the woods, to look for a dead body, and Scott is bitten by a werewolf. Being a werewolf came with its perks- stronger, faster, new star in the lacrosse team, popularity- but also made it hard to control his anger. Scott has also fallen for the new girl in town, Allison, whose dad is trying to hunt and kill Scott. Scott now has to try and balance his out of control life, figure out how to control his new powers, try not to be killed by the alpha that bit him, and protect Allison- and keep her from finding out his big secret. While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as ... Written by USA Network Thirteen Reasons Why, based on the best-selling books by Jay Asher, follows teenager Clay Jensen (Dylan Minnette) as he returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers a group of cassette tapes recorded by Hannah Baker (Katherine Langford) -his classmate and crush-who tragically committed suicide two weeks earlier. On tape, Hannah unfolds an emotional audio diary, detailing the thirteen reasons why she decided to end her life. Through Hannah and Clay's dual narratives, Thirteen Reasons Why weaves an intricate and heartrending story of confusion and desperation that will deeply affect viewers. Written by Studio Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda. Written by Kenneth Chisholm ( [email protected] ) Set in the fictional town of Rosewood, Pennsylvania, the series follows the lives of four girls, Aria Montgomery, Hanna Marin, Emily Fields, and Spencer Hastings, whose clique falls apart after the disappearance of their leader, Alison DiLaurentis. One year later, the estranged friends are reunited as they begin receiving messages from a mysterious figure named A, who threatens to expose their deepest secrets, including ones they thought only Alison knew. At first, they think it's Alison herself, but after her body is found, the girls realize that someone else is planning on ruining their perfect lives. Sheriff Deputy Rick Grimes gets shot and falls into a coma. When awoken he finds himself in a Zombie Apocalypse. Not knowing what to do he sets out to find his family, after he's done that he gets connected to a group to become the leader. He takes charge and tries to help this group of people survive, find a place to live, and get them food. This show is all about survival, the risks, and the things you'll have to do to survive. Written by jzirkle1 Sick, twisted and politically incorrect, the animated series features the adventures of the Griffin family. Endearingly ignorant Peter and his stay-at-home wife Lois reside in Quahog, R.I., and have three kids. Meg, the eldest child, is a social outcast, and teenage Chris is awkward and clueless when it comes to the opposite sex. The youngest, Stewie, is a genius baby bent on killing his mother and destroying the world. The talking dog, Brian, keeps Stewie in check while sipping martinis and sorting through his own life issues. Written by Jwelch5742 Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are all friends, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend. The Big Bang Theory The Big Bang Theory Leonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with women. When Penny, a pretty woman and an aspiring actress from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend. Written by Huggo In 1960, a group of social outcasts who are bullied by a gang of greasers led by Henry Bowers are also tormented by an evil demon who can shape-shift into a clown and feed on children's fears and kill them. After defeating the demonic clown as kids, it resurfaces 30 years later and they must finish it off as adults once again. Written by Blake Both physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, and the employees and guests at a struggling hotel in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, addiction, and exploitation. The vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading normal lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon, who promised to Stefan an eternity of misery. Stefan falls in love with schoolgirl Elena, who has an uncanny resemblance to the Salvatore brothers old love, Katherine; and whose best friend Bonnie is a witch. Written by KGF Vissers Keeping Up with the Kardashians Keeping Up with the Kardashians A peek inside the exploits and privileged private lives of the blended Kardashian-Jenner family, including sisters Kim, Kourtney and Khloé. Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War Putlocker movies offers the best movies online for free. Top new movies to watch – Putlocker Movies are the best way of chilling out in the free time and feel relaxed. The year 2016 came up with various record breaking movies full of entertainment, thrill, suspense, emotions, and much more. Based on the reviews by the patrons, we have come up with the top ten movies of the year. The putlocker movies are as follows: Arrival: A power packed performance by Amy Adams, the movie specifies the way aliens visit earth and are dealt by us. The movie is based on the book named \"Story of your Life†by Ted Chiang, and further, it's full of science fiction, aliens, and much more. The movie was rated 8.3 by IMDb and is regarded as the best movies depicting the aliens invading the earth. Zootopia: Zootopia was a bit different from the usual animated movies and depicted the animals living together in a civilized society. Further, the story revolved around the rabbit who wanted to become a police officer. The movie was full of comedy and adventure and was rated 8.1 by IMDb and putlocker9 Deadpool: Deadpool was amongst the best movies starred by Ryan Reynolds. IMDb gave a rating of 8.1 and found this movie to be a funny tale about fourth-wall breaking, foul-mouthed, avocado-faced mercenary. The film was the seventh highest grossing film of 2016. Captain America: Civil War: This movie was the highest grossing film of 2016 and attained a rating of 8.0. The plot of the movie moves around the fight between the superheroes because of the disagreement with the Sokovia act providing various regulations for the Avengers. Doctor Strange: The movie was the tenth highest grossing film of 2016 and was rated 7.9 by IMDb. It was amongst the best works of Benedict Cumberbatch portraying out on the wizards, warlocks, sorcerers, and magic. Fantastic Beats: The movie was based on the Harry Potter's spin-off, and this helped the movie to achieve a rating of 7.8 by IMDb. The movie moved around the character named Newton Seambder, portrayed by Eddie Redmayne who studied at Hogwarts School of Witchcraft and Wizardry before Harry Potter joined the school. offered by putlocker9 Finding Dory: The movie emphasized on the fact that disabilities cannot let us set back and even we need to overcome it in the way we can. In the movie, Dory teaches the viewers just to swim. The movie became the second highest grossing film and was rated 7.5 by IMDb. Don't Breathe: Don't Breathe was a good movie which moved around a veteran who lived alone and started killing on a spree. Further, the movie was rated 7.2 by IMDb. Batman Vs Superman: Dawn of Justice: The movie might be regarded as an another spin-off in the series, the \"Man of Steel.†The movie became the sixth highest grossing film and was rated 6.8 on the IMDb. Suicide Squad: The movie can be regarded as a colorful, action movie packed with the DC Comics characters. Most of the major characters of the movie were overshadowed. As a result, the movie was criticized by the reviewers and led it to a rating of 6.1. Further, the film was the ninth highest grossing film of 2016. Based on true events. Aesha goes to an isolated b&b in Kent after her mom books her in so she can get some head space for her studies. In the night Aesha is visited by a nun at the door who will progressively begin to show her true colours as the night unfolds - As the nun continues to bother Aesha at the door, Aesha begins to question her surroundings in this isolated suspense horror. A family must use a magical box of Animal Crackers to save a rundown circus from being taken over by their evil uncle Horatio P. Huntington. A group of German construction workers set out for a foreign construction site in the Bulgarian province. The strange country awakens adventure feelings among the men. At the same time, they are confronted with their prejudices and mistrust. For two of the men, a nearby village becomes the stage for a competition for the recognition and favor of the village. Sheridan O'Connor and Riccardo Rossi were destined to meet on the set of their first big movie together when barely out of their teens. What they didn't know was that their on-screen chemistry would translate into a hot and heavy off-screen romance destined only for disaster. Now, living continents apart and a lifetime later, expecting their paths never to cross again, they are thrown back together to star in an updated version of their original film. The studio has high hopes that they will be able to attract the same audience who loved them the first time around. But working together again could demand greater acting skills than either ever imagined: long hours filming awkward romantic scenes, reliving the past and coming face to face with what fate has in store for them. Only slightly shaken and gently stirred by family and friends, Sheridan and Riccardo must find a way to make the perfect martini out of life so as not to waste a single drop of happiness. Feature film inspired by the pranks performed by the comedy troupe The Janoskians. Scooby-Doo! and the Gourmet Ghost Scooby-Doo! and the Gourmet Ghost The Scooby gang visits a culinary resort run by Fred's uncle, Bobby Flay. While enjoying the sights, a ghost attacks the guests and destroys the resort, leaving the gang to put a stop to its threat. Lisa Conroy may not love managing the restaurant Double Whammies, but she loves her employees more than anything, not only Danyelle, and Maci, her closest friends, but also her extended family. Unfortunately, the cheap, curmudgeonly owner Ben Cubby doesn't care nearly as much, and confronts Lisa when he learns that she's using the restaurant to raise money for Shaina, an employee in legal trouble related to an abusive boyfriend. To get even, the girls decide to sabotage the restaurant on the night of a major mixed martial arts fight. Honeycrisp tells the story of Hannah and Greta Lawton - two estranged sisters with a turbulent past who meet up to clean out their suddenly deceased parents cabin and repair - or end - their relationship. Dying for the Crown Dying for the Crown When Isabelle Wagner takes the plunge to attend her twenty-year high school reunion with her daughter, Sierra, she comes face to face with her past when she is reunited with her former classmate rival, Andrea Turner. When a seemingly changed Andrea insinuates herself into their lives, Isabelle's world comes crashing down and she soon realizes that twenty years hasn't changed Andrea after all. A young woman, Dakota, is trying to move on with her life and get away from her past after being rescued from a grim basement, where she was kidnapped and abused by a monstrous man. However, when the normal life she had starts to unravel, Dakota needs to uncover her tormentor and end her nightmare for good, since she fears for her life and is determined to no longer be the victim. Do You Take This Man Do You Take This Man When a gay couple's impending wedding hits a snag, the grooms must rely on their friends and family to see them through. Garage Sale Mystery: The Mask Murder Garage Sale Mystery: The Mask Murder When Jennifer buys a storage locker at auction, she discovers a dead body inside - along with a mask matching the deceased woman. Elf on the Run Elf on the Run A little girl makes an unusual friendship with a spring's goblin. High & Low: The Movie 3 - Final Mission High & Low: The Movie 3 - Final Mission In order to conceal past corruption by the government, the Kyuryu group proceeds on a plan to destroy a street and build a casino. To stop the Kyuryu group, members of SWORD begin to move. Garage Sale Mysteries: Murder In D Minor Garage Sale Mysteries: Murder In D Minor Jennifer wins the bid on a vintage self-playing piano at an estate auction. The piano was owned by the late Carl Deats and Jennifer discovers that this wealthy philanthropist has a dark history. American retired Judge Randall Nemes and his hired gun, Gaspar, track down a con man posing as a priest in a small Colombian town only to be thrown off-course by a scrappy 16-year-old girl intent on reuniting with her sister in the United States. The Unity of Heroes The Unity of Heroes When a strange warrior with unorthodox strength crashes into Master Wong Fei-Hung's school, Wong sets off to investigate. A policeman gets killed and the short-staffed police chief sends for a few experienced officers to support him in his fight with organized crime. Meanwhile, a conflict between local gangster groups escalates. A struggling actress moves to Hollywood where she discovers a piece of furniture in her apartment is haunted by a malicious ghost. A Man Called Jon A Man Called Jon Three men meet on a night train on the border of Finland and Sweden. All three are concealing something, and a sudden confrontation amongst them leads to disastrous consequences, with two of them being forced to make a joint decision. Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It. Written by Emma Chapman Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. 12 years after the tragic death of their little girl, a dollmaker and his wife welcome a nun and several girls from a shuttered orphanage into their home, where they soon become the target of the dollmaker's possessed creation, Annabelle. Baby is a young and partially hearing impaired getaway driver who can make any wild move while in motion with the right track playing. It's a critical talent he needs to survive his indentured servitude to the crime boss, Doc, who values his role in his meticulously planned robberies. However, just when Baby thinks he is finally free and clear to have his own life with his new girlfriend, Deborah, Doc coerces him back for another job. Now saddled with a crew of thugs too violently unstable to keep to Doc's plans, Baby finds himself and everything he cares for in terrible danger. To survive and escape the coming maelstrom, it will take all of Baby's skill, wits and daring, but even on the best track, can he make it when life is forcing him to face the music? Written by Kenneth Chisholm ( [email protected] ) War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Though safely entombed in a crypt deep beneath the unforgiving desert, an ancient princess, whose destiny was unjustly taken from her, is awakened in our current day bringing with her malevolence grown over millennia, and terrors that defy human comprehension. Written by Universal Pictures Fast and Furious 8: The Fate of the Furious Fast and Furious 8: The Fate of the Furious Now that Dom and Letty are on their honeymoon and Brian and Mia have retired from the game-and the rest of the crew has been exonerated-the globetrotting team has found a semblance of a normal life. But when a mysterious woman seduces Dom into the world of crime he can't seem to escape and a betrayal of those closest to him, they will face trials that will test them as never before. From the shores of Cuba and the streets of New York City to the icy plains off the arctic Barents Sea, the elite force will crisscross the globe to stop an anarchist from unleashing chaos on the world's stage... and to bring home the man who made them a family. Written by harpreet phamber Evacuation of Allied soldiers from Belgium, the British Empire, and France, who were cut off and surrounded by the German army from the beaches and harbor of Dunkirk, France, between May 26- June 04, 1940, during Battle of France in World War II. Written by Harvey Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles a lot like the Earth, nevertheless, sooner or later, the unsuspecting members of the Covenant will have to cope with invincible and unconquerable biological foes beyond human comprehension. Ultimately, what was intended as an exploratory and peaceful mission, under those circumstances, it will soon turn into a desperate rescue operation deep into the cold infinite space. Written by Nick Riganas Two friends are exploring the deep blue sea until something goes wrong. As they submerge 47m they encounter a creature that only wants flesh and blood. As they fight their way back to the top, they shortly run out of oxygen. With only an hour left they're not only racing against time they are racing against life and death. Written by anthonybobb John Wick: Chapter 2 John Wick: Chapter 2 After returning to the criminal underworld to repay a debt, John Wick discovers that a large bounty has been put on his life. In the US, a child goes missing every 40 seconds. You never think it will happen to you. Until it does. Alone and scared, Karla Dyson (Halle Berry) is unwilling to leave the fate of her son's life in someone else's hands. When she catches a glimpse of the abductors speeding away, she decides to fight back. In a heart pounding race against time, Kate begins a high speed pursuit and will stop at nothing to save her son's life. Written by http://teaser-trailer.com Fifty Shades Of Grey Fifty Shades Of Grey When Anastasia Steele, a literature student, goes to interview the wealthy Christian Grey as a favor to her roommate Kate Kavanagh, she encounters a beautiful, brilliant and intimidating man. The innocent and naive Ana starts to realize she wants him. Despite his enigmatic reserve and advice, she finds herself desperate to get close to him. Not able to resist Ana's beauty and independent spirit, Christian Grey admits he wants her too, but on his own . Ana hesitates as she discovers the singular tastes of Christian Grey - despite the embellishments of success, his multinational businesses, his vast wealth, and his loving family, Grey is consumed by the need to control everything. Written by MischaLeCroix A pilot lands work for the CIA and as a drug runner in the south during the 1980s. In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. Now You See Me 2 Now You See Me 2 One year after outwitting the FBI and winning the public's adulation with their Robin Hood-style magic spectacles, The Four Horsemen resurface for a comeback performance in hopes of exposing the unethical practices of a tech magnate. The man behind their vanishing act is none other than Walter Mabry, a tech prodigy who threatens the Horsemen into pulling off their most impossible heist yet. Their only hope is to perform one last unprecedented stunt to clear their names and reveal the mastermind behind it all. Written by Production John Form has found the perfect gift for his expectant wife, Mia - a beautiful, rare vintage doll in a pure white wedding dress. But Mia's delight with Annabelle doesn't last long. On one horrific night, their home is invaded by members of a satanic cult, who violently attack the couple. Spilled blood and terror are not all they leave behind. The cultists have conjured an entity so malevolent that nothing they did will compare to the sinister conduit to the damned that is now... Annabelle. Written by johntyler249 When a mercenary warrior (Matt Damon) is imprisoned within the Great Wall, he discovers the mystery behind one of the greatest wonders of the world. As wave after wave of marauding beasts besiege the massive structure, his quest for fortune turns into a journey toward heroism as he joins a huge army of elite warriors to confront the unimaginable and seemingly unstoppable force. Written by Watch_Movies World War Z 2 World War Z 2 \"The Thinning\" takes place in a post-apocalyptic future where population control is dictated by a high-school aptitude test. When two students (Logan Paul and Peyton List) discover the test is smoke and mirrors hiding a larger conspiracy, they must fight the system to expose it and take it down. Written by Legendary Digital Media In 1977, paranormal investigators Ed and Lorraine Warren travel to London, England, where single mother Peggy Hodgson believes that something evil is in her home. When Peggy's youngest daughter starts showing signs of demonic possession, Ed and Lorraine attempt to help the besieged girl, only to find themselves targeted by the malicious spirits. Kingsman: The Secret Service Kingsman: The Secret Service A young man named Eggsy whose father died when he was a young boy, is dealing with living with the creep his mother is with now, who mistreats her and him. He goes out and does something to one of the creep's friends. He gets arrested and he calls a number a man gave him around the time his father died, to call if he needs help. A man named Harry approaches him and tells him he's the one who helped him. He tells him that he knew his father. When the man Eggsy slighted wants some payback, Harry takes care of him and his companions single handed. Harry then tells Eggsy that he's part of a secret organization called the Kingsman and his father was also part of it. He died trying to make the world safe. Harry offers Eggsy the opportunity to be a Kingsman and he takes it. He undergoes a grueling training course. Harry is looking into the demise of another Kingsman and the trail leads him to tech billionaire named Valentine aka V who is also curious about the group following him, the ... Written by [email protected] When three girls are kidnapped by a man with 23 different personalities, they have to work out which of those personalities will help them escape and which of those personalities will try to stop them. Written by jjmcmanusnbalshiite Belle, her little sister, and her comatose twin brother move into a new house with their single mother Joan in order to save money to help pay for her brother's expensive healthcare. But when strange phenomena begin to occur in the house including the miraculous recovery of her brother, Belle begins to suspect her Mother isn't telling her everything and soon realizes they just moved into the infamous Amityville house. Written by The Weinstein Company An ex-hitman comes out of retirement to track down the gangsters that took everything from him. In 1960, a group of social outcasts who are bullied by a gang of greasers led by Henry Bowers are also tormented by an evil demon who can shape-shift into a clown and feed on children's fears and kill them. After defeating the demonic clown as kids, it resurfaces 30 years later and they must finish it off as adults once again. Written by Blake The Book of Henry The Book of Henry Sometimes things are not always what they seem, especially in the small suburban town where the Carpenter family lives. Single suburban mother Susan Carpenter works as a waitress at a diner, alongside feisty family friend Sheila. Her younger son Peter is a playful 8-year-old. Taking care of everyone and everything in his own unique way is Susan's older son Henry, age 11. Protector to his adoring younger brother and tireless supporter of his often self-doubting mother - and, through investments, of the family as a whole - Henry blazes through the days like a comet. Susan discovers that the family next door, which includes Henry's kind classmate Christina, has a dangerous secret - and that Henry has devised a surprising plan to help. As his brainstormed rescue plan for Christina takes shape in thrilling ways, Susan finds herself at the center of it. Written by Focus Features Ghost in the Shell Ghost in the Shell In the near future, Major Motoko Kusanagi (Scarlett Johansson) is the first of her kind: A human saved from a terrible terrorist attack, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals. When terrorism reaches a new level that includes the ability to hack into people's minds and control them, Major Kusanagi is uniquely qualified to stop it. As she prepares to face a new enemy, Major Kusanagi discovers that she has been lied to: her life was not saved, it was stolen. She will stop at nothing to recover her past, find out who did this to her and stop them before they do it to others. Written by Paramount Pictures The crown jewel of Her Majesty's Secret Intelligence Service, Agent Lorraine Broughton (Theron) is equal parts spycraft, sensuality and savagery, willing to deploy any of her skills to stay alive on her impossible mission. Sent alone into Berlin to deliver a priceless dossier out of the destabilized city, she partners with embedded station chief David Percival (James McAvoy) to navigate her way through the deadliest game of spies. Written by Focus Features The Purge: Election Year The Purge: Election Year It's been seventeen years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state. A young street magician (Jacob Latimore) is left to care for his little sister after their parents passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is forced to use his magic and brilliant mind to save her. Written by Blumhouse Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened. Written by Benett Sullivan Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother-a brother who desperately wishes to follow in his twin's despicable footsteps-one former super-villain will rediscover just how good it feels to be bad. War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when a pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers and her true destiny. Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy. Together, Batman and Wonder Woman work quickly to find and recruit a team of metahumans to stand against this newly awakened threat. But despite the formation of this unprecedented league of heroes-Batman, Wonder Woman, Aquaman, Cyborg and The Flash-it may already be too late to save the planet from an assault of catastrophic proportions. Guardians of the Galaxy Vol. 2 Guardians of the Galaxy Vol. 2 After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy. Written by Blazer346 Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles a lot like the Earth, nevertheless, sooner or later, the unsuspecting members of the Covenant will have to cope with invincible and unconquerable biological foes beyond human comprehension. Ultimately, what was intended as an exploratory and peaceful mission, under those circumstances, it will soon turn into a desperate rescue operation deep into the cold infinite space. Written by Nick Riganas High school outcasts stumble upon an old alien ship, where they acquire superpowers and are dubbed the Power Rangers. Learning that an old enemy of the previous generation has returned to exact vegenance, the group must harness their powers and use them to work together and save the world. Written by cyberboy1127-249-955930 A washed up monster chaser convinces the U.S. Government to fund a trip to an unexplored island in the South Pacific. Under the guise of geological research, the team travels to \"Skull Island\". Upon arrival, the group discover that their mission may be complicated by the wildlife which inhabits the island. The beautiful vistas and deadly creatures create a visually stunning experience that is sure to keep your attention. Written by Jason Burns Valerian and the City of a Thousand Planets Valerian and the City of a Thousand Planets VALERIAN AND THE CITY OF A THOUSAND PLANETS is the new adventure film from Luc Besson, the director of The Professional, The Fifth Element and Lucy, based on the comic book series which inspired a generation of artists, writers and filmmakers. In the 28th century, Valerian (Dane DeHaan) and Laureline (Cara Delevingne) are a team of special operatives charged with maintaining order throughout the human territories. Under assignment from the Minister of Defense, the two embark on a mission to the astonishing city of Alpha-an ever-expanding metropolis where species from all over the universe have converged over centuries to share knowledge, intelligence and cultures with each other. There is a mystery at the center of Alpha, a dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe. The Emoji Movie unlocks the never-before-seen secret world inside your smartphone. Hidden within the messaging app is Textopolis, a bustling city where all your favorite emojis live, hoping to be selected by the phone's user. In this world, each emoji has only one facial expression - except for Gene, an exuberant emoji who was born without a filter and is bursting with multiple expressions. Determined to become \"normal\" like the other emojis, Gene enlists the help of his handy best friend Hi-5 and the notorious code breaker emoji Jailbreak. Together, they embark on an epic \"app-venture\" through the apps on the phone, each its own wild and fun world, to find the Code that will fix Gene. But when a greater danger threatens the phone, the fate of all emojis depends on these three unlikely friends who must save their world before it's deleted forever. Written by Sony Pictures Entertainment In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela. The last Gunslinger, Roland Deschain, has been locked in an eternal battle with Walter O'Dim, also known as the Man in Black, determined to prevent him from toppling the Dark Tower, which holds the universe together. With the fate of the worlds at stake, good and evil will collide in the ultimate battle as only Roland can defend the Tower from the Man in Black. This is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life. Written by 20th Century Fox It feels good to be bad...Assemble a team of the world's most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government's disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren't picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it's every man for himself? Written by Amitash Balekar World War Z 2 World War Z 2 Guardians of the Galaxy Guardians of the Galaxy After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth, is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the world. Written by James Hake Ghost in the Shell Ghost in the Shell In the near future, Major Motoko Kusanagi (Scarlett Johansson) is the first of her kind: A human saved from a terrible terrorist attack, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals. When terrorism reaches a new level that includes the ability to hack into people's minds and control them, Major Kusanagi is uniquely qualified to stop it. As she prepares to face a new enemy, Major Kusanagi discovers that she has been lied to: her life was not saved, it was stolen. She will stop at nothing to recover her past, find out who did this to her and stop them before they do it to others. Written by Paramount Pictures Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe. Written by Marvel The Purge: Election Year The Purge: Election Year It's been seventeen years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state. A young street magician (Jacob Latimore) is left to care for his little sister after their parents passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is forced to use his magic and brilliant mind to save her. Written by Blumhouse Maze Runner: The Scorch Trials Maze Runner: The Scorch Trials The second chapter of the epic \"Maze Runner\" saga. Thomas (Dylan O'Brien) and his fellow Gladers face their greatest challenge yet: searching for clues about the mysterious and powerful organization known as WCKD. Their journey takes them to the Scorch, a desolate landscape filled with unimaginable obstacles. Teaming up with resistance fighters, the Gladers take on WCKD's vastly superior forces and uncover its shocking plans for them all. Written by 20th Century Fox It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio. Written by LeiaSolo Chris Redfield enlists the help of Leon S. Kennedy and Rebecca Chambers to stop a death merchant, with a vengeance, from spreading a deadly virus in New York. Thor The Dark World Thor The Dark World Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to ... Written by [email protected] As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain. Captain America: Civil War Captain America: Civil War With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges. Written by RespectTheHyphen Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children. While Gru, the ex-supervillain is adjusting to family life and an attempted honest living in the jam business, a secret Arctic laboratory is stolen. The Anti-Villain League decides it needs an insider's help and recruits Gru in the investigation. Together with the eccentric AVL agent, Lucy Wilde, Gru concludes that his prime suspect is the presumed dead supervillain, El Macho, whose his teenage son is also making the moves on his eldest daughter, Margo. Seemingly blinded by his overprotectiveness of his children and his growing mutual attraction to Lucy, Gru seems on the wrong track even as his minions are being quietly kidnapped en masse for some malevolent purpose. Written by Kenneth Chisholm ( [email protected] ) Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea. Written by Sam Gray Power tells the story of James Ghost St. Patrick, a wealthy New York City nightclub owner who caters to the city's elite. He wants to build an empire, turn the club into a Fortune 500 business, but there's just one problem: Ghost is living a double life. When he is not in the club, he is the kingpin of the most lucrative drug network in New York for a very high-level clientele. His marriage, family and business all become unknowingly threatened as he is tempted to leave his criminal life behind and become the rags-to-riches businessman he wants to be most of all. Written by Jiilo_Kim An animated series on adult-swim about the infinite adventures of Rick, a genius alcoholic and careless scientist, with his grandson Morty, a 14 year-old anxious boy who is not so smart, but always tries to lead his grandfather with his own morale compass. Together, they explore the infinite universes; causing mayhem and running into trouble. Written by Ruben Galaviz Scott McCall was just another kid in high school. Until, one night his best friend Stiles brings him to the woods, to look for a dead body, and Scott is bitten by a werewolf. Being a werewolf came with its perks- stronger, faster, new star in the lacrosse team, popularity- but also made it hard to control his anger. Scott has also fallen for the new girl in town, Allison, whose dad is trying to hunt and kill Scott. Scott now has to try and balance his out of control life, figure out how to control his new powers, try not to be killed by the alpha that bit him, and protect Allison- and keep her from finding out his big secret. While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as ... Written by USA Network Thirteen Reasons Why, based on the best-selling books by Jay Asher, follows teenager Clay Jensen (Dylan Minnette) as he returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers a group of cassette tapes recorded by Hannah Baker (Katherine Langford) -his classmate and crush-who tragically committed suicide two weeks earlier. On tape, Hannah unfolds an emotional audio diary, detailing the thirteen reasons why she decided to end her life. Through Hannah and Clay's dual narratives, Thirteen Reasons Why weaves an intricate and heartrending story of confusion and desperation that will deeply affect viewers. Written by Studio Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda. Written by Kenneth Chisholm ( [email protected] ) Set in the fictional town of Rosewood, Pennsylvania, the series follows the lives of four girls, Aria Montgomery, Hanna Marin, Emily Fields, and Spencer Hastings, whose clique falls apart after the disappearance of their leader, Alison DiLaurentis. One year later, the estranged friends are reunited as they begin receiving messages from a mysterious figure named A, who threatens to expose their deepest secrets, including ones they thought only Alison knew. At first, they think it's Alison herself, but after her body is found, the girls realize that someone else is planning on ruining their perfect lives. Sheriff Deputy Rick Grimes gets shot and falls into a coma. When awoken he finds himself in a Zombie Apocalypse. Not knowing what to do he sets out to find his family, after he's done that he gets connected to a group to become the leader. He takes charge and tries to help this group of people survive, find a place to live, and get them food. This show is all about survival, the risks, and the things you'll have to do to survive. Written by jzirkle1 Sick, twisted and politically incorrect, the animated series features the adventures of the Griffin family. Endearingly ignorant Peter and his stay-at-home wife Lois reside in Quahog, R.I., and have three kids. Meg, the eldest child, is a social outcast, and teenage Chris is awkward and clueless when it comes to the opposite sex. The youngest, Stewie, is a genius baby bent on killing his mother and destroying the world. The talking dog, Brian, keeps Stewie in check while sipping martinis and sorting through his own life issues. Written by Jwelch5742 Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are all friends, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend. The Big Bang Theory The Big Bang Theory Leonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with women. When Penny, a pretty woman and an aspiring actress from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend. Written by Huggo In 1960, a group of social outcasts who are bullied by a gang of greasers led by Henry Bowers are also tormented by an evil demon who can shape-shift into a clown and feed on children's fears and kill them. After defeating the demonic clown as kids, it resurfaces 30 years later and they must finish it off as adults once again. Written by Blake Both physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, and the employees and guests at a struggling hotel in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, addiction, and exploitation. The vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading normal lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon, who promised to Stefan an eternity of misery. Stefan falls in love with schoolgirl Elena, who has an uncanny resemblance to the Salvatore brothers old love, Katherine; and whose best friend Bonnie is a witch. Written by KGF Vissers Keeping Up with the Kardashians Keeping Up with the Kardashians A peek inside the exploits and privileged private lives of the blended Kardashian-Jenner family, including sisters Kim, Kourtney and Khloé. Set 400 years in the future, the show follows the adventures of the Orville, a not-so-top-of-the-line exploratory ship in Earth's interstellar Fleet. Facing cosmic challenges from without and within, this motley crew of space explorers will boldly go where no comedic drama has gone before. After the death of one of the rich and popular Blossom twins on the 4th of July, the small town of Riverdale investigates the murder. The series starts in September, the beginning of a new school year, that brings with it new students, relationships, and reveals the mysteries of the past 4th of July. A Medical-Based drama centered around Meredith Grey, an aspiring surgeon and daughter of one of the best surgeons, Dr. Ellis Grey. Throughout the series, Meredith goes through professional and personal challenges along with fellow surgeons at Seattle Grace Hospital. A spin-off from The Vampire Diaries and set in New Orleans, The Originals centers on the Mikaelson siblings, otherwise known as the world's original vampires: Klaus (Joseph Morgan), Elijah (Daniel Gillies), and Rebekah (Claire Holt). Now Klaus must take down his protégé, Marcel (Charles Michael Davis), who is now in charge of New Orleans, in order to re-take his city, as he originally built New Orleans. Klaus departed from the city after being chased down by his father Mikael, while it was being constructed and Marcel took charge. As Klaus has returned after many years, his ego has provoked him to become the king of the city. Every King needs an heir says Klaus, accepting the unborn child. The child is a first to be born to a hybrid (part vampire, part werewolf) and a werewolf (Hayley). Written by Anaya Miller This television drama is about the two Winchester brothers, Sam and Dean, who were raised by their father, John, to hunt and kill all things that go bump in the night after his wife, Mary, was murdered by an evil supernatural being when the boys were young. 22 years later the brothers set out on a journey, fighting evil along the way, to find their recently missing father who, when they finally meet up with, reveals he knows what killed their mother, a demon, and has found a way to track and kill it. Meanwhile, Sam starts to develop frightening abilities that include death visions, visions of people dying before it actually happens. These visions are somehow connected to the demon who murdered his mother and its mysterious plans that seem to be all about Sam. When their father dies striking a deal with the very same devil that had killed his wife, the brothers, now alone and without their mentor, are determined to finish the crusade their father started. But disturbing revelations ... Written by Rachel B. Told from the perspective of an unseen documentary filmmaker, the series offers an honest, often-hilarious perspective of family life. Parents Phil and Claire yearn for an honest, open relationship with their three kids. But a daughter who is trying to grow up too fast, another who is too smart for her own good, and a rambunctious young son make it challenging. Claire's dad, Jay, and his Latina wife, Gloria, are raising two sons together, but people sometimes believe Jay to be Gloria's father. Jay's gay son, Mitchell, and his partner, Cameron, have adopted a little Asian girl, completing one big -- straight, gay, multicultural, traditional -- happy family. Written by Jwelch5742 Watch the Irish American family the Gallagher's deal with their alcoholic father Frank. Fiona, the eldest daughter, takes the role of parent to her five brothers and sisters. Lip, Ian, Debbie, Carl, and Liam (half white and half black) deal with life in the South Side projects of Chicago. Fiona balances her sex life and raising her siblings. Every episode is another crazy situation that one or more of the Gallagher six get into. Watch them grow and learn how to make their way in life with what little they have. Written by Linda Taylor Lucifer, bored from his sulking life in hell comes to live in Los Angeles only to help humanity with its miseries through his experience and telepathic abilities to bring people's deepest desires and thoughts out of them. While meeting with a girl in his nightclub (called Lux), a shootout involving him and the girl leads him to become a LAPD consultant who tries to punish people for their crimes through law and justice. Written by Minhaj Ul Noor Oliver Queen and his father are lost at sea when their luxury yacht sinks, apparently in a storm. His father dies, but Oliver survives for five years on an uncharted island and eventually returns home. But he wasn't alone on the island where he learned not only how to fight and survive but also of his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city. Written by Anonymous Narcos tells the true-life story of the growth and spread of cocaine drug cartels across the globe and attendant efforts of law enforcement to meet them head on in brutal, bloody conflict. It centers around the notorious Colombian cocaine kingpin Pablo Escobar (Wagner Moura) and Steve Murphy (Holbrook), a DEA agent sent to Colombia on a U.S. mission to capture and ultimately kill him. Written by Soumik Ghosh An innocent man is framed for the homicide of the Vice President's brother and scheduled to be executed at a super-max penitentiary, thus it's up to his younger brother to save him with his genius scheme: install himself in the same prison by holding up a bank and, as the final month ticks away, launch the escape plan step-by-step to break the both of them out, with his full-body tattoo acting as his guide; a tattoo which hides the layout of the prison facility and necessary clues vital to the escape. Written by [email protected] The series is set 97 years after a devastating nuclear war wiped out almost all life on Earth. The only known survivors are the residents of twelve space stations in Earth's orbit prior to the war. The space stations banded together to form a single massive station named The Ark, wenis galore about 2,400 people live. Resources are scarce and all crimes no matter their nature or severity are punishable by death (floating) unless the perpetrator is under 18 years of age. After the Ark's life support systems are found to be critically failing, one hundred juvenile prisoners are declared expendable and sent to the surface in a last ditch attempt to determine if Earth is habitable again. The teens arrive on a beautiful planet they've only seen from space. Confronting the dangers of this rugged new world, they struggle to form a tentative community. However they discover that not all humanity was wiped out. There are people on Earth who survived the war, called grounders by the 100.... Written by Thomas O'Darren The Simpsons is an animated sitcom about the antics of a dysfunctional family called the Simpsons (surprise surprise). Homer is the oafish unhealthy beer loving father, Marge is the hardworking homemaker wife, Bart is the ten year old underachiever (and proud of it), Lisa is the unappreciated eight year old genius, and Maggie is the cute, pacifier loving silent infant. Written by Sam Kelly The curious, adventure-seeking, fourth grade group of boys, Stan, Kyle, Cartman, and Kenny, all join in in buffoonish adventures that sometimes evolve nothing. Sometimes something that was simple at the start, turns out to get out of control. Everything is odd in the small mountain town, South Park, and the boys always find something to do with it. The adventures of Ragnar Lothbrok: the greatest hero of his age. The series tells the saga of Ragnar's band of Viking brothers and his family as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods: legend has it that he was a direct descendant of Odin, the god of war and warriors. Written by History Channel A series centered around a group of football players and their families, friends, and handlers. Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies"
  ]
}