{
  "company": "www.telpo.com.cn",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Products EFT POS Mobile POS Biometric Device Face Recognition Machine Cash Register Machine Kiosk Machine POS Peripherals Bus Ticketing Machine MDM Service ODM FAQ Technical Support About Telpo Overview Certificates Factory Display Partnership Exhibition Video Products EFT POS Mobile POS Biometric Device Face Recognition Machine Cash Register Machine Kiosk Machine POS Peripherals Bus Ticketing Machine MDM Service ODM FAQ Technical Support About Telpo Overview Certificates Factory Display Partnership Exhibition Video Tel.: +86 757 8622 7898 Add.: Bldg.5, Zone A, Hantian Technology Town, Guiping RD., Nanhai District,Foshan City, Guangdong, China Copyright © Telepower Communication Co., Ltd.",
    "Products Payment POS Mobile POS Bus Validator Face Recognition Biometric Device Cash Register Self-service Kiosk Peripherals Telpo Cloud Service ODM FAQ Technical Support About Telpo Overview Certificates Factory Display Partnership Agent Video Products Payment POS Mobile POS Bus Validator Face Recognition Biometric Device Cash Register Self-service Kiosk Peripherals Telpo Cloud Service ODM FAQ Technical Support About Telpo Overview Certificates Factory Display Partnership Agent Video TPS680-Windows Windows Cash Register Machine READ MORE Windows Cash Register Machine TPS530 Public Transport Bus Validator For Passengers Onboard READ MORE Public Transport Bus Validator For Passengers Onboard TPS980 Face Recognition Time Attendance and Access Control READ MORE Face Recognition Time Attendance and Access Control TPS900 Smart POS Android EMV PCI EFT POS Machine READ MORE Smart POS Android EMV PCI EFT POS Machine A Comprehensive SaaS System Face Recognition READ MORE The Nilson Report Published Telpo Latest Face Payment Terminal TPS988 The Nilson Report, American famous financial journal, and global payment industry authoritative magazine has reported Telpo's latest face payment terminal TPS988 this week. Dec. 20, 2019 How EDEKA Create A Surprise Christmas with Cash Register How EDEKA Create A Surprise Christmas with Cash Register Dec. 18, 2019 Telpo Face Attendance System | Good Business Management Assistant Telpo Face Attendance System | Good Business Management Assistant Dec. 16, 2019 Hello 2020 NRF, Telpo Is Coming Hello 2020 NRF, Telpo Is Coming Dec. 10, 2019 The Past and Present of Face-based Payment The Past and Present of Face-based Payment Dec. 10, 2019 MasterCard Fingerprint Cards Drive Bank Financial Security MasterCard Fingerprint Cards Drive Bank Financial Security Dec. 09, 2019 Smart Catering Upgrade, Voice Order Kiosk Are Coming Smart Catering Upgrade, Voice Order Kiosk Are Coming Tel.: +86 757 8622 7898 or +86 757 8632 3369-840 Add.: Bldg.5, Zone A, Hantian Technology Town, Foshan City, Guangdong, China Copyright © Telepower Communication Co., Ltd."
  ]
}