{
  "company": "www.i2vsys.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 51
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.1666666666666666,
    "framing_market": 0.5,
    "num_docs": 51
  },
  "topic_timeline": {
    "20": {
      "0": 51
    }
  },
  "sample_docs": [
    "About Us About i 2V News & Events Products IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Central Monitoring System Cloud Surveillance Integrated Command Center IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Video Based Fire Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Toll Plaza Video AVCC Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Technology Partners Overview Our Technology Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Why to choose i2V Technology Partners Overview Our Technology Partners Support Camera Brands FAQ Open a New Ticket Open a New Ticket Resources Trial Version Downloads Contact Us Where to Buy Submit Query Careers Contact Us i2V Supports almost any IP camera/encoder including ONVIF. One can add camera in i2V software by specifying its streaming URL. i2V also supports DVRs with open streaming interface for example rtsp . Below is only the partial list of Camera brands. Please check your camera brand by emailing i2v@i2vsys.com *All logos are copyrighted by their respective copyright holders. If you do not find your Camera brand in the above list, please contact at i2v@i2vsys.com",
    "About Us About i 2V News & Events Products IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Central Monitoring System Cloud Surveillance Integrated Command Center IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Video Based Fire Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Toll Plaza Video AVCC Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Technology Partners Overview Our Technology Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Why to choose i2V Technology Partners Overview Our Technology Partners Support Camera Brands FAQ Open a New Ticket Open a New Ticket Resources Trial Version Downloads Contact Us Where to Buy Submit Query Careers Contact Us Red Light Violation Detection (RLVD) i2V RLVD is an intelligent and powerful video based Violation Detection System. Automatically detects and capture the vehicle crossing a defined zone while the traffic light is red. Zone can be a stop line or zebra crossing at the junction. Red light detection can be done either through video analytics(using color properties of the light in the video) or it can be integrated with junction controller to get red-green light trigger. Integrates with ANPR cameras and software for capturing the number plate and generating ticket, challan. Store /View images of multiple violating vehicle in different lane with unique ID, location/direction, device Id, type of offence,lane No., date/time, number plate etc. in database",
    "About Us About i 2V News & Events Products IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Central Monitoring System Cloud Surveillance Integrated Command Center IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Video Based Fire Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Toll Plaza Video AVCC Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Technology Partners Overview Our Technology Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Why to choose i2V Technology Partners Overview Our Technology Partners Support Camera Brands FAQ Open a New Ticket Open a New Ticket Resources Trial Version Downloads Contact Us Where to Buy Submit Query Careers Contact Us Why to choose i2V i2V is designed for utmost scalability and easy usability which makes our Certified Channel Partners easy to install, to manage, and to support. i2V makes it a priority to provide partners with all of the technical support they need, providing training to get started and continued IT assistance in the field. i2V maintains an online Partner Portal full of valuable resources and has a support center available to answer your questions. i2V regularly engages in co-marketing campaigns; the success of our partners is important to us. i2V offers opportunities for continued business success and account growth in purchases of additional features, system upgrades, advanced integration with other existing systems. i2V offers free support even during evaluation period of the software for its partners. i2V is open to integrate new camera models as per your client requirements. We may need camera SDK for tight integration to use any of the camera specific features through i2V VMS. i2V has open framework for integrating other security and surveillance devices like Access Control Devies, Fire Alarams and similar devices.",
    "About Us About i 2V News & Events Products IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Central Monitoring System Cloud Surveillance Integrated Command Center IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Video Based Fire Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Toll Plaza Video AVCC Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Technology Partners Overview Our Technology Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Why to choose i2V Technology Partners Overview Our Technology Partners Support Camera Brands FAQ Open a New Ticket Open a New Ticket Resources Trial Version Downloads Contact Us Where to Buy Submit Query Careers Contact Us About Incident Management System No business entity can be fully secured as risk can take place without institution or intention. Even the big business or it companies have to face disaster. They have to make recovery plans to execute the procedure in smooth way. In every big organizations and in It companies, a secure system is designed to assist in the management to solve out the emergency operations. Incident management system is a part of IT service management system which includes making the process normal after occurring an incident in way that has no negative impact or very little impact on the business or in IT industry. The incident management system ensures that temporarily problems are cleared out, services are still running as usual way while the incident is getting invested. The main motive behind the same is to identify the root problem and to fix the problem while finding prominent action. An incident is an unusual event which can disrupt the normal working procedure and may reason for interruption or loss. Being a part of problem management, preventive measures are also identified under this system or software. An effective incident management system requires proper planning related to relevant field or stream like finance, logistic, operations, planing, database etc. the incident may be technically like server problem, hacking, corrupted network etc, or may be natural like natural disasters, civil disturbances, multiple causality incidents, hazardous materials incidents, fires, terrorism etc. there is no limit of incidents which may occur time to time without any prior notifications. One has to be careful or must have measure to tackle with such incident. Companies usually rely on email, voicemail, database to communicate which can be in troublesome sue to any incident. I2vSYS company builds or design such incident management system or softwares which helps to track the risk and to tackle the problems by identifying roots. Our reliable and technical Incident management system helps the private or public Clint's to speed up their communication, tackles problem management and ensure smooth project management in India. As the name suggests i2V is a Indian company believes in providing intelligent (logical and reasonable) and integrated (complete) solution to its clients. Unlike other companies, we not only provide video management system but also the advanced video analytics, which makes it a complete solution. Over the years, due to high investment in R&D and presence of a robust team, we have developed one of the best video management system and analytics among all the competitors. Our aim is not make money out of customer or become biggest among all the competitors but we want to make the best security and surveillance system in the world. We believe in quality work.. We believe in Precision,Performance, Authenticity, Stability and finally, Customer Satisfaction.",
    "About Us About i 2V News & Events Products IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Central Monitoring System Cloud Surveillance Integrated Command Center IP Video Management Software OVERVIEW Basic Edition Professional Edition Enterprise Edition Video Analytics OVERVIEW Video Based Fire Detection Abandoned Object Detection Video Intrusion Detection Image Enhancement Boundary Loitering Detection Indoor People Counting Object Removal Detection Video Perimeter Tripwire Stopped Vehicle Detection Camera Tampering Detection Advanced Motion Detection Video Based Fire Detection Intelligent Traffic Solutions OVERVIEW ANPR/LPR RLVD Video based ATCC Toll Plaza Video AVCC Toll Plaza Video AVCC Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Technology Partners Overview Our Technology Partners Channel Partners Overview Why to choose i2V Global Partner Network Apply for Partnership Why to choose i2V Technology Partners Overview Our Technology Partners Support Camera Brands FAQ Open a New Ticket Open a New Ticket Resources Trial Version Downloads Contact Us Where to Buy Submit Query Careers Contact Us About Physical Security Information Management Physical Security Information Management or PSIM is a complete security software through which system Collects and correlates events from existing security devices, centralized the same in one monitor. It provides a unique platform in a form of application which is designed to integrate various security devices and controlling them through installing one comprehensive use interface. It collects the data from the information systems like video, access control, analytic, networks, building systems etc. to resolve the situations. Physical Security Information Management system or PSIM stands on the major capabilities like collection, analysis, verification, resolution, reporting, audit trail. The product helps to simplify the operator response and ensure execution of corrective procedures. Physical Security Information Management is one of the expensive application which is usually deployed by the biggest or highly invested organizations. This is also fact that it leads to one time Hugh investment and once it is assembled, it leads to cost reductions by lowering the number of gated guards, fewer control rooms, fewer monitors, deploying the information in single centralize information system. The major industries which are deploying Physical Security Information Management are education, energy, oil & gas, health care, corporate enterprise, homeland defense, industrial & manufacturing, safe cities, travel & transportation, retail, distribution, law enforcement. The idea behind launching this system is to bridge the gap between security and information technology. The main function is physical security information systems protect the people, buildings, confidential database etc. Physical Security Information Management or PSIM allows open technology which is usable with large of manufacturers. The systems integrated with this security systems comprising intrusion systems, fire alarms, security alarm, access control system, CCTV, GIS mapping system, video wall, video content analysis, power monitoring system, lighting control system, intercom and & IP phone, building management systems etc. Too many security services provider company in India, i2vsys claimed to be professionally managed integrated company which is providing high resolution security software services through diligent office staff. Contact for high levels of security requirement to our technological strong company. As the name suggests i2V is a Indian company believes in providing intelligent (logical and reasonable) and integrated (complete) solution to its clients. Unlike other companies, we not only provide video management system but also the advanced video analytics, which makes it a complete solution. Over the years, due to high investment in R&D and presence of a robust team, we have developed one of the best video management system and analytics among all the competitors. Our aim is not make money out of customer or become biggest among all the competitors but we want to make the best security and surveillance system in the world. We believe in quality work.. We believe in Precision,Performance, Authenticity, Stability and finally, Customer Satisfaction."
  ]
}