{
  "company": "www.hypr.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 5
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.4375,
    "framing_surveillance": 0.0,
    "framing_market": 0.5625,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "0": 5
    }
  },
  "sample_docs": [
    "Blog WSJ Features HYPR for Financial Services WSJ Features HYPR for Financial Services Industry News July 12, 2017 HYPR was featured this week in The Wall Street Journal on the security and usability benefits that decentralized authentication provides enterprises with consumer-facing and internal employee applications. HYPR is trusted across Fortune 500 enterprises including financial services, retail, eCommerce, healthcare, and the emerging IoT. Solving for issues like costly password resets are a thing of the past. HYPR leverages a unique decentralized approach to biometric authentication that helps eliminate fraud while providing passwordless access to everyday tools and platforms that drive the global economy. Schedule a demo with our VP of Sales Jim Pandise by emailing getsecured@hypr.com. Nick Donofrio, 44-year IBM Vet. EVP, Joins HYPR Can Decentralized Authentication Ease GDPR Compliance? Categories Share This Post for our Newsletter WSJ Features HYPR for Financial Services HYPR was featured this week in The Wall Street Journal on the security and usability benefits that decentralized authentication provides enterprises with consumer-facing and internal employee applications. HYPR was featured this week in The Wall Street Journal on the security and usability benefits that decentralized authentication provides enterprises with consumer-facing and internal employee applications. HYPR is trusted across Fortune 500 enterprises including financial services, retail, eCommerce, healthcare, and the emerging IoT. Solving for issues like costly password resets are a thing of the past. HYPR leverages a unique decentralized approach to biometric authentication that helps eliminate fraud while providing passwordless access to everyday tools and platforms that drive the global economy. HYPR is trusted across Fortune 500 enterprises including financial services, retail, eCommerce, healthcare, and the emerging IoT. Solving for issues like costly password resets are a thing of the past. HYPR leverages a unique decentralized approach to biometric authentication that helps eliminate fraud while providing passwordless access to everyday tools and platforms that drive the global economy. Schedule a demo with our VP of Sales Jim Pandise by emailing getsecured@hypr.com. Schedule a demo with our VP of Sales Jim Pandise by emailing getsecured@hypr.com.",
    "Blog Zero Trust Means Zero Passwords Zero Trust Means Zero Passwords Sean Connolly, VP Systems Engineering, HYPR Perspectives April 07, 2020 Given how often I'm seeing the topic of Zero Trust come up in marketing and sales messages, I figure it is best if we start with a few clarifications: First, Zero Trust is a security framework introduced by analyst John Kindervag of Forrester back in 2010. Zero Trust is not a marketing pitch that should be abused although it often is. From my perspective it has been misused by marketing and sales teams in our industry. Frankly, I believe this is because we perpetuate an unspoken agreement which enables this behavior. As an industry we find that organizations are intrigued by the value of a Zero Trust security framework and the insights provided through mainstream implementations like Google's BeyondCorp . So, it is important we critically look at the basics of this framework and step away from the glamour. Second, this blog is not another \"My company provides Zero Trust!\" message. Yes, HYPR does empower a Passwordless approach to Zero Trust and I will touch on that, but lets save my biases for the end. Lastly, we should level set on what this framework is and the focus I'll take within it. In simple , the Zero Trust framework calls for what the name implies: No trust for anything within or outside of your network. This is a broad statement and feeds into the fact that you have users accessing corporate networks, VPNs, and SaaS applications all from corporate or personal devices. These users, devices, and their data can never be trusted in of access control. This is a small glimpse of what is encompassed in a Zero Trust framework. While there are network and device-based controls that need to be implemented to achieve this framework, my area of expertise focuses on achieving Zero Trust with authentication. Zero Trust is Not a One Size Fits All Approach My personal experience in the industry is planted in Identity and Access Management. I've worked in many environments ranging from the typical mom-and-pop shop to a federally regulated network just outside of DC. As you can imagine there are a few differences in these environments. Not every company deals with a high level of data regulation. My point here is that the Zero Trust framework is not necessarily the right approach for everyone. While I frequently work with customers on Zero Trust implementations, one primary issue I find with Zero Trust is that friction is typically imposed on the end user. We have all seen that with 'great security' comes great friction. Just as it relates to authentication, the framework itself calls to authenticate the user and the device at each point of access. I recently worked on an environment where the organization enforced Multi-factor Authentication (MFA), using a product that will remain unnamed, to access each workstation on the domain. The user experience (UX) in this environment proceeded as follows: The User types in password (Username is stored in the Windows operating system) The user waits for an embedded IE browser to pop up and display MFA options (I won't go down the rabbit hole of using Web Views here) They get a cup of coffee while you wait for the PUSH, SMS or call to your mobile device They type in the OTP code or accept the PUSH request They wait for a response on the IE browser to establish the Windows Session There were simply too many steps required of the user. As you can imagine their executive team was not happy with the unnecessarily high degree of friction. It's taxing on the user and inevitably leads to the most difficult security threat to address: human error. Security solution providers have identified this issue. The concept of \"adaptive authentication\" or \"risk-based\" are generally applied to provide a streamlined UX where possible. As an example, some solution providers would go as far to say that if the geo-location, geo-velocity, and device fingerprint are as expected, authenticating with a password is sufficient. However, organizations inefficiently apply layers of data analysis to build a risk, or Trust, score to quantify the authentication event. A Downside of Authenticating with Risk Scores A potential problem with relying on a risk score for authentication is that it doesn't address the abruptness of change. All forms of user behavior can drastically change. In today's climate this data cannot be used for authentication and it is critical we have a fundamental process established to perform the true act of authentication. There is value in this data, but it should not be solely used to authenticate a transaction. This data needs to be integrated into an authorization process to ensure the transaction can proceed based on its context. An example I find relevant is cross-border employee authentication under the General Data Protection Regulation (GDPR). If an employee works in country A and resides in country B, their authentication cannot be authorized when they have crossed the border to return home. This is invaluable in understanding when authorization is permitted or if it should require step-up authentication. Zero Trust Security and Usability Now for the callback to my claim that HYPR empowers Zero Trust. HYPR provides what is typically the highest level of assurance in authentication, as it is based on both PKI and Biometrics. That's why with HYPR, risk layers are not required. Compared to the 5-step example of a legacy MFA experience I provided above, HYPR worked with the same customer to achieve Zero Trust with True Passwordless MFA into Windows with two steps that are so fast and easy there isn't enough time to grab that cup of coffee. HYPR's UX is the following: The user selects their workstation on their HYPR Mobile App The user provides their biometric and authenticates. I'm clearly biased, however HYPR can help customers accelerate and achieve Zero Trust through passwordless authentication. The point of this comparison is to show customers how you can enforce a true Zero Trust model without sacrificing usability. The Takeaway As security professionals organizations need to understand the core fundamentals of the framework they implement. You cannot allow marketing or sales professionals to dictate your security posture. I've seen too many LinkedIn posts at this point to realize the industry is confusing what is marketing, and what solutions truly support a Zero Trust model. Every aspect of a security framework needs to be properly considered, particularly the UX as discussed. Zero Trust may or may not be the right framework for you — it's not a one size fits all framework. And, it's important to note that no provider has a complete Zero Trust solution. If it is the right approach for you there are certainly solutions out there that help you properly achieve this. Read through the noise and you shall find them. Or better yet, try it out yourself first-hand . The Importance of Customer Success Why I Joined HYPR – Adam Abrevaya Categories Share This Post for our Newsletter Zero Trust Means Zero Passwords Given how often I'm seeing the topic of Zero Trust come up in marketing and sales messages, I figure it is best if we start with a few clarifications: Given how often I'm seeing the topic of Zero Trust come up in marketing and sales messages, I figure it is best if we start with a few clarifications: First, Zero Trust is a security framework introduced by analyst John Kindervag of Forrester back in 2010. Zero Trust is not a marketing pitch that should be abused although it often is. From my perspective it has been misused by marketing and sales teams in our industry. Frankly, I believe this is because we perpetuate an unspoken agreement which enables this behavior. As an industry we find that organizations are intrigued by the value of a Zero Trust security framework and the insights provided through mainstream implementations like Google's BeyondCorp . So, it is important we critically look at the basics of this framework and step away from the glamour. First, Zero Trust is a security framework introduced by analyst John Kindervag of Forrester back in 2010. Zero Trust is not a marketing pitch that should be abused although it often is. From my perspective it has been misused by marketing and sales teams in our industry. Frankly, I believe this is because we perpetuate an unspoken agreement which enables this behavior. As an industry we find that organizations are intrigued by the value of a Zero Trust security framework and the insights provided through mainstream implementations like Google's BeyondCorp . So, it is important we critically look at the basics of this framework and step away from the glamour. Second, this blog is not another \"My company provides Zero Trust!\" message. Yes, HYPR does empower a Passwordless approach to Zero Trust and I will touch on that, but lets save my biases for the end. Second, this blog is not another \"My company provides Zero Trust!\" message. Yes, HYPR does empower a Passwordless approach to Zero Trust and I will touch on that, but lets save my biases for the end. Lastly, we should level set on what this framework is and the focus I'll take within it. In simple , the Zero Trust framework calls for what the name implies: No trust for anything within or outside of your network. This is a broad statement and feeds into the fact that you have users accessing corporate networks, VPNs, and SaaS applications all from corporate or personal devices. These users, devices, and their data can never be trusted in of access control. This is a small glimpse of what is encompassed in a Zero Trust framework. While there are network and device-based controls that need to be implemented to achieve this framework, my area of expertise focuses on achieving Zero Trust with authentication. Lastly, we should level set on what this framework is and the focus I'll take within it. In simple , the Zero Trust framework calls for what the name implies: No trust for anything within or outside of your network. This is a broad statement and feeds into the fact that you have users accessing corporate networks, VPNs, and SaaS applications all from corporate or personal devices. These users, devices, and their data can never be trusted in of access control. This is a small glimpse of what is encompassed in a Zero Trust framework. While there are network and device-based controls that need to be implemented to achieve this framework, my area of expertise focuses on achieving Zero Trust with authentication. Zero Trust is Not a One Size Fits All Approach Zero Trust is Not a One Size Fits All Approach My personal experience in the industry is planted in Identity and Access Management. I've worked in many environments ranging from the typical mom-and-pop shop to a federally regulated network just outside of DC. As you can imagine there are a few differences in these environments. Not every company deals with a high level of data regulation. My point here is that the Zero Trust framework is not necessarily the right approach for everyone. My personal experience in the industry is planted in Identity and Access Management. I've worked in many environments ranging from the typical mom-and-pop shop to a federally regulated network just outside of DC. As you can imagine there are a few differences in these environments. Not every company deals with a high level of data regulation. My point here is that the Zero Trust framework is not necessarily the right approach for everyone. While I frequently work with customers on Zero Trust implementations, one primary issue I find with Zero Trust is that friction is typically imposed on the end user. We have all seen that with 'great security' comes great friction. Just as it relates to authentication, the framework itself calls to authenticate the user and the device at each point of access. I recently worked on an environment where the organization enforced Multi-factor Authentication (MFA), using a product that will remain unnamed, to access each workstation on the domain. The user experience (UX) in this environment proceeded as follows: While I frequently work with customers on Zero Trust implementations, one primary issue I find with Zero Trust is that friction is typically imposed on the end user. We have all seen that with 'great security' comes great friction. Just as it relates to authentication, the framework itself calls to authenticate the user and the device at each point of access. I recently worked on an environment where the organization enforced Multi-factor Authentication (MFA), using a product that will remain unnamed, to access each workstation on the domain. The user experience (UX) in this environment proceeded as follows: The User types in password (Username is stored in the Windows operating system) The user waits for an embedded IE browser to pop up and display MFA options (I won't go down the rabbit hole of using Web Views here) They get a cup of coffee while you wait for the PUSH, SMS or call to your mobile device They type in the OTP code or accept the PUSH request They wait for a response on the IE browser to establish the Windows Session The User types in password (Username is stored in the Windows operating system) The user waits for an embedded IE browser to pop up and display MFA options (I won't go down the rabbit hole of using Web Views here) They get a cup of coffee while you wait for the PUSH, SMS or call to your mobile device They type in the OTP code or accept the PUSH request They wait for a response on the IE browser to establish the Windows Session There were simply too many steps required of the user. As you can imagine their executive team was not happy with the unnecessarily high degree of friction. It's taxing on the user and inevitably leads to the most difficult security threat to address: human error. There were simply too many steps required of the user. As you can imagine their executive team was not happy with the unnecessarily high degree of friction. It's taxing on the user and inevitably leads to the most difficult security threat to address: human error. Security solution providers have identified this issue. The concept of \"adaptive authentication\" or \"risk-based\" are generally applied to provide a streamlined UX where possible. As an example, some solution providers would go as far to say that if the geo-location, geo-velocity, and device fingerprint are as expected, authenticating with a password is sufficient. However, organizations inefficiently apply layers of data analysis to build a risk, or Trust, score to quantify the authentication event. Security solution providers have identified this issue. The concept of \"adaptive authentication\" or \"risk-based\" are generally applied to provide a streamlined UX where possible. As an example, some solution providers would go as far to say that if the geo-location, geo-velocity, and device fingerprint are as expected, authenticating with a password is sufficient. However, organizations inefficiently apply layers of data analysis to build a risk, or Trust, score to quantify the authentication event. A Downside of Authenticating with Risk Scores A Downside of Authenticating with Risk Scores A potential problem with relying on a risk score for authentication is that it doesn't address the abruptness of change. All forms of user behavior can drastically change. In today's climate this data cannot be used for authentication and it is critical we have a fundamental process established to perform the true act of authentication. There is value in this data, but it should not be solely used to authenticate a transaction. This data needs to be integrated into an authorization process to ensure the transaction can proceed based on its context. An example I find relevant is cross-border employee authentication under the General Data Protection Regulation (GDPR). If an employee works in country A and resides in country B, their authentication cannot be authorized when they have crossed the border to return home. This is invaluable in understanding when authorization is permitted or if it should require step-up authentication. A potential problem with relying on a risk score for authentication is that it doesn't address the abruptness of change. All forms of user behavior can drastically change. In today's climate this data cannot be used for authentication and it is critical we have a fundamental process established to perform the true act of authentication. There is value in this data, but it should not be solely used to authenticate a transaction. This data needs to be integrated into an authorization process to ensure the transaction can proceed based on its context. An example I find relevant is cross-border employee authentication under the General Data Protection Regulation (GDPR). If an employee works in country A and resides in country B, their authentication cannot be authorized when they have crossed the border to return home. This is invaluable in understanding when authorization is permitted or if it should require step-up authentication. Zero Trust Security and Usability Zero Trust Security and Usability Now for the callback to my claim that HYPR empowers Zero Trust. HYPR provides what is typically the highest level of assurance in authentication, as it is based on both PKI and Biometrics. That's why with HYPR, risk layers are not required. Compared to the 5-step example of a legacy MFA experience I provided above, HYPR worked with the same customer to achieve Zero Trust with True Passwordless MFA into Windows with two steps that are so fast and easy there isn't enough time to grab that cup of coffee. HYPR's UX is the following: Now for the callback to my claim that HYPR empowers Zero Trust. HYPR provides what is typically the highest level of assurance in authentication, as it is based on both PKI and Biometrics. That's why with HYPR, risk layers are not required. Compared to the 5-step example of a legacy MFA experience I provided above, HYPR worked with the same customer to achieve Zero Trust with True Passwordless MFA into Windows with two steps that are so fast and easy there isn't enough time to grab that cup of coffee. HYPR's UX is the following: The user selects their workstation on their HYPR Mobile App The user provides their biometric and authenticates. The user selects their workstation on their HYPR Mobile App The user provides their biometric and authenticates. I'm clearly biased, however HYPR can help customers accelerate and achieve Zero Trust through passwordless authentication. The point of this comparison is to show customers how you can enforce a true Zero Trust model without sacrificing usability. I'm clearly biased, however HYPR can help customers accelerate and achieve Zero Trust through passwordless authentication. The point of this comparison is to show customers how you can enforce a true Zero Trust model without sacrificing usability. As security professionals organizations need to understand the core fundamentals of the framework they implement. You cannot allow marketing or sales professionals to dictate your security posture. I've seen too many LinkedIn posts at this point to realize the industry is confusing what is marketing, and what solutions truly support a Zero Trust model. Every aspect of a security framework needs to be properly considered, particularly the UX as discussed. Zero Trust may or may not be the right framework for you — it's not a one size fits all framework. And, it's important to note that no provider has a complete Zero Trust solution. If it is the right approach for you there are certainly solutions out there that help you properly achieve this. Read through the noise and you shall find them. Or better yet, try it out yourself first-hand . As security professionals organizations need to understand the core fundamentals of the framework they implement. You cannot allow marketing or sales professionals to dictate your security posture. I've seen too many LinkedIn posts at this point to realize the industry is confusing what is marketing, and what solutions truly support a Zero Trust model. Every aspect of a security framework needs to be properly considered, particularly the UX as discussed. Zero Trust may or may not be the right framework for you — it's not a one size fits all framework. And, it's important to note that no provider has a complete Zero Trust solution. If it is the right approach for you there are certainly solutions out there that help you properly achieve this. Read through the noise and you shall find them. Or better yet, try it out yourself first-hand .",
    "2 of the Top 4 What HYPR Can Do For You \"The biggest benefit of working with HYPR is that they make things easier and more secure, as well as their unbelievably great support.\" \"The single most important thing we can do is eliminate the human-targeted risks. HYPR's approach is fundamental to that.\" \"We needed to remove the security risks of remote hiring without adding friction. HYPR was the answer.\" Quantify Risk Reduction. Justify Your Budget Drastically reduce the risk of data breaches by eliminating the primary attack vector; passwords. HYPR provides a quantifiable 324% ROI verified by Forrester, helping you justify security investments and secure your enterprise from end-to-end. Stop Insider Threats with Verified Access Mitigate threats by ensuring every user is who they claim to be with phishing-resistant MFA and multi-factor identity verification. HYPR combines its own data with telemetry from security partners like CrowdStrike to help you make contextual access decisions and prevent unauthorized access to sensitive systems. Secure Onboarding from Day Zero Stop fake applicants and prevent interview fraud with automated identity verification. Ensure new hires are who they say they are and can securely access necessary systems from day 0 for a seamless and productive onboarding experience. Why It's Time for Identity Assurance Passwordless with FIDO Passkeys Eliminate passwords and integrate limitless phishing-resistant authentication flows for your unique environment. Secure Hiring & Onbaording Stop fake applicants and interview fraud with strong, automated identity verification. Stop social engineering and cut IT tickets by verifying users and enabling self-service MFA resets. Phishing-resistant MFA from desktop to cloud built on proven open standards with no password-based fallbacks End-to-end identity security from day zero with unified passwordless authentication, adaptive risk mitigation, and automated identity verification Limitless authentication flows and continuous real-time risk assessment to deliver a world-class experience for all users Trusted by Leading Global Enterprises HYPR has made the login experience seamless for my team. It was quick and easy to set up for our Okta users, and I appreciate that we can configure it to allow users to once at the workstation level, then seamlessly access our SSO without needing additional authentication. IT User HYPR has made the login experience seamless for my team. It was quick and easy to set up for our Okta users, and I appreciate that we can configure it to allow users to once at the workstation level, then seamlessly access our SSO without needing additional authentication. HYPR is easy to manage. My end users love using HYPR to login to their computers. Shane C. Cybersecurity Administrator HYPR is easy to manage. My end users love using HYPR to login to their computers. The multifactor solution for iPhone and Android is bar none for corporate environments. Users have one app for all their MFA. Integrates with all of our tools using SAML. Manufacturing User The multifactor solution for iPhone and Android is bar none for corporate environments. Users have one app for all their MFA. Integrates with all of our tools using SAML. The team at HYPR goes above and beyond to make sure our deployment is successful. The focus on end user experience is key. Financial Services User The team at HYPR goes above and beyond to make sure our deployment is successful. The focus on end user experience is key. I like how HYPR works across multiple platforms seamlessly. I use it on a daily basis with my iPhone and work computer. Automotive User I like how HYPR works across multiple platforms seamlessly. I use it on a daily basis with my iPhone and work computer. Seamless Integration With Your Ecosystem HYPR easily integrates with your existing IdPs and security tools. Passwordless Authentication and Identity Security Resources Toward Converged Identity Assurance Understand the drivers and guidelines for a converged Identity Assurance approach. What Is Identity Assurance and Why It's Needed Best practices for identity assurance in today's modern enterprise. Learn the basics of passwordless authentication and phishing-resistant MFA. The Total Economic Impact of HYPR Forrester Consulting calculates that HYPR customers save millions, with a 324% ROI.",
    "The Passwordless Approach to Zero Trust Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Phishing Awareness Training Multi-Factor Authentication Automated Attack Prevention and Detection Tools Endpoint Protection One or Many Identity Providers Device Visibility & Analytics Identity Governance Fraud Detection Tools Risk-Based Policy Management Credential-Based Threat Intelligence Password Managers or Password Training Privilege Access Management You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. Getting Started More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. Request a Demo NIST SP 800-207 – Zero Trust Architecture Passwordless Remote Login NIST Authentication Attack Matrix Zero Trust Means Zero Passwords Password Elimination Guide Top Myths & Misconceptions The Passwordless Approach to Zero Trust Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Phishing Awareness Training Multi-Factor Authentication Automated Attack Prevention and Detection Tools Endpoint Protection One or Many Identity Providers Device Visibility & Analytics Identity Governance Fraud Detection Tools Risk-Based Policy Management Credential-Based Threat Intelligence Password Managers or Password Training Privilege Access Management You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Automated Attack Prevention and Detection Tools One or Many Identity Providers Device Visibility & Analytics Password Managers or Password Training You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. Getting Started More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. Request a Demo More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. NIST SP 800-207 – Zero Trust Architecture Passwordless Remote Login NIST Authentication Attack Matrix Zero Trust Means Zero Passwords NIST SP 800-207 – Zero Trust Architecture NIST SP 800-207 – Zero Trust Architecture NIST Authentication Attack Matrix NIST Authentication Attack Matrix Zero Trust Means Zero Passwords Zero Trust Means Zero Passwords",
    "The Passwordless Approach to Zero Trust Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Phishing Awareness Training Multi-Factor Authentication Automated Attack Prevention and Detection Tools Endpoint Protection One or Many Identity Providers Device Visibility & Analytics Identity Governance Fraud Detection Tools Risk-Based Policy Management Credential-Based Threat Intelligence Password Managers or Password Training Privilege Access Management You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. Getting Started More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. Request a Demo NIST SP 800-207 – Zero Trust Architecture Passwordless Remote Login NIST Authentication Attack Matrix Zero Trust Means Zero Passwords Ebooks Top The Passwordless Approach to Zero Trust Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero Trust (ZT) is an important security framework that defines how users inside and outside an organization must be authenticated. At a high level, this means taking continuous measures to assess when and how users can access applications and data. ZT aims to do away with perimeter-based protection schemes and encourages a uniform model for trusted access no matter where users are coming from. Many companies are dedicating a ton of resources to zero-trust initiatives. There are a number of great public case studies such as the Microsoft initiative or Google's BeyondCorp program which focused on enabling secure remote access for employees without a VPN. Microsoft and Google are also at the forefront of another big trend: Passwordless. So where do passwords fit into the Zero-Trust concept? The purpose of this guide establish a simple premise: Passwords make your Zero-Trust program slower, more expensive, and less effective. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Phishing Awareness Training Multi-Factor Authentication Automated Attack Prevention and Detection Tools Endpoint Protection One or Many Identity Providers Device Visibility & Analytics Identity Governance Fraud Detection Tools Risk-Based Policy Management Credential-Based Threat Intelligence Password Managers or Password Training Privilege Access Management You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. Zero-Trust + Passwords = Slow & Expensive Businesses are encouraged to use modern technologies to verify the user's identity and maintain system security. The ZT framework itself is based on a simple concept – Don't Trust Anyone. What is the #1 reason for lack of trust? Passwords . Passwords are shared, stolen, reused, replayed. They are the hackers' favorite target and entire categories of vendor products exist to make up for the shortcomings of passwords. While passwords are not the only reason for diminished trust they are certainly the most expensive . Consider how many tools enterprises utilize to protect a password-based environment: Automated Attack Prevention and Detection Tools One or Many Identity Providers Device Visibility & Analytics Password Managers or Password Training You're likely to already have multiple security solutions working together. Your tooling ranges from identity providers, to access control, and threat intelligence which are integrated to inform your Trust Algorithm. The problem with implementations of this framework is that most organizations still depend heavily on passwords and shared secrets . How does a password-based environment negatively impact your Zero-Trust program? Higher Tooling Costs Additional tools require more administrators, new user licenses, and may even call for user and help desk training – all of which compound into a more expensive security program. In achieving a \"Trust No One\" environment you you are likely to purchase ancillary tooling to make up for the risks that come with using passwords. For example, Automated Credential Attacks are likely to happen in an organization where users login with passwords and shared secrets. But if you deployed smart-card enforced desktop login are you sure you need a tool to detect credential reuse attacks? Probably not. Gaps in MFA Adoption A key tenet of Zero-Trust is the use of Multi-Factor Authentication (MFA). Organizations often find significant gaps in MFA adoption such as workstation login, RDP, VPN, VDI and a number of edge cases where passwords are the default. These gaps are especially painful for employees who work remotely, travel often, and might use their workstation in public areas. The friction of forcing employees to use Password+MFA for all of these login experiences creates a major adoption hurdle and, in turn, slows down the initiative as a whole. Slower Time to Value & Resource Constraints Small businesses need time to procure, configure, and deploy. Large enterprises have long costly RFP cycles requiring a higher level of training and communication across the organization. Moreover, IT and Infosec teams are often under-resourced and overwhelmed; they feel the password pains more than anyone. A successful zero trust program requires focus from these critical departments. Taking passwords out of the equation gives your teams time to focus on everything else. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. What Does Passwordless Zero-Trust Look Like? That's where True Passwordless MFA comes in. Let's see what a zero trust experience looks like without passwords. This demo combines the use of HYPR, Okta, and YubiKey to demonstrate what a day in the life of a zero-trust user looks like. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. First your employee logs into their computer with Desktop MFA. Then, they continue their journey with True Passwordless SSO into Okta. And, if they require access to a more sensitive app, such as Salesforce, they can be prompted for step up authentication with Windows Hello or YubiKey. Let's explore the impact of going passwordless as part of your zero trust initiative. Fewer Passwords = Lower Tooling Costs Still think you need that automated credential attack tool? Should you purchase a hardware security token for every employee? Or can you reduce the cost by only issuing tokens to admins? Is all that phishing awareness training necessary if your employees don't even have a phishable password ? Consider the many ways you can better utilize your budget towards new, urgent resources for your team. Achieve Higher Levels of Assurance Replacing passwords with Certificate-Based Authentication allows for the highest level of assurance (NIST AAL3) and visibility. According to NIST SP 800-207 this is an optimal approach for securing enterprise access. With Smart Card enforcement at the workstation level, every user must login with Passwordless Desktop MFA. Solve the MFA Gaps and Accelerate Adoption Zero Trust begins at the endpoint, so naturally it should be secured to the highest degree. Whether users are logging into a personal laptop or a shared workstation, passwordless is the best way to solve your desktop MFA gap. The same login experience can then be extended to remote access such as RDP and VPN, as well as Virtual Desktops and Single Sign-On . Increase Deterrent for Credential Based Attacks One of the core tenets of Zero Trust model is \"the use of Preventative Measures to deter hackers.\" Let's assume the attacker was aware that your users did not utilize password-based login. How much of a deterrent is that knowledge? Malicious actors are far more likely to move on to an easier target. Redefining Risk-Based Authentication Zero Trust encourages continuous authorization. Authentication is no longer considered to be a static event and is happening throughout the digital experience. Passwords can be shared and require a higher level of risk profiling. The requirement to use continuous login prompts and force users to choose between multiple factors create an inconsistent user experience. A passwordless environment that relies on certificate-based authentication inherently carries a much lower level of risk. Getting Started More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. Request a Demo More than 50 Billion credential stuffing attacks happened last year. More than 50% of visitors to banking websites are malicious login attempts. Imagine if the security resources used to mitigate these attacks were reprioritized. Eliminating the password lays the foundation for a powerful Zero-Trust experience that is easy to use and easy to deploy. Between the reduced tooling and allowing infosec to focus on the things that really matter, the ROI of going passwordless cannot be understated. NIST SP 800-207 – Zero Trust Architecture Passwordless Remote Login NIST Authentication Attack Matrix Zero Trust Means Zero Passwords NIST SP 800-207 – Zero Trust Architecture NIST SP 800-207 – Zero Trust Architecture NIST Authentication Attack Matrix NIST Authentication Attack Matrix Zero Trust Means Zero Passwords Zero Trust Means Zero Passwords"
  ]
}