{
  "company": "www.gorilla-technology.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "IT'S ALL ABOUT ELEVATING CITIES WE BELIEVE IN INNOVATION. Whether it's nations, metropolitan areas, businesses, or educational institutions, Gorilla's cutting-edge solutions play a pivotal role in virtually and physically enabling cities and citizens. Gorilla Smart and Safe City CUSTOMIZED SOLUTIONS WE EMBRACE AI AND THRIVE IN ALL INDUSTRIES. We provide streamlined industry-specific AI solutions that enhance quality of life and economic competitiveness. POWERED BY GLOBAL MINDS, INSIGHTS, AND TALENT Gorilla Technology has over 20 years of hands-on experience delivering smart solutions to enterprises and governments worldwide. AI HAS NEVER BEEN THIS SIMPLE WE ARE GORILLA. We believe that AI should make your life easier and connect you to the things that matter most. Gorilla is here to help. Book a Demo OUR LEADERSHIP AI experts that deliver superior AI solutions and services to enterprises and smart cities across the world. Our Partners We collaborates with industry leaders worldwide to drive AI-powered transformation. INVESTORS Invest in innovation and shape the future of enterprises and smart cities. JOIN US Empower your passion and build a better world! IT'S ALL ABOUT ELEVATING CITIES WE BELIEVE IN INNOVATION. Whether it's nations, metropolitan areas, businesses, or educational institutions, Gorilla's cutting-edge solutions play a pivotal role in virtually and physically enabling cities and citizens. Gorilla Smart and Safe City IT'S ALL ABOUT ELEVATING CITIES WE BELIEVE IN INNOVATION. Whether it's nations, metropolitan areas, businesses, or educational institutions, Gorilla's cutting-edge solutions play a pivotal role in virtually and physically enabling cities and citizens. CUSTOMIZED SOLUTIONS WE EMBRACE AI AND THRIVE IN ALL INDUSTRIES. We provide streamlined industry-specific AI solutions that enhance quality of life and economic competitiveness. WE EMBRACE AI AND THRIVE IN ALL INDUSTRIES. We provide streamlined industry-specific AI solutions that enhance quality of life and economic competitiveness. POWERED BY GLOBAL MINDS, INSIGHTS, AND TALENT Gorilla Technology has over 20 years of hands-on experience delivering smart solutions to enterprises and governments worldwide. POWERED BY GLOBAL MINDS, INSIGHTS, AND TALENT Gorilla Technology has over 20 years of hands-on experience delivering smart solutions to enterprises and governments worldwide. AI HAS NEVER BEEN THIS SIMPLE WE ARE GORILLA. We believe that AI should make your life easier and connect you to the things that matter most. Gorilla is here to help. Book a Demo AI HAS NEVER BEEN THIS SIMPLE We believe that AI should make your life easier and connect you to the things that matter most. Gorilla is here to help. OUR LEADERSHIP AI experts that deliver superior AI solutions and services to enterprises and smart cities across the world. Our Partners We collaborates with industry leaders worldwide to drive AI-powered transformation. INVESTORS Invest in innovation and shape the future of enterprises and smart cities. JOIN US Empower your passion and build a better world! Contact Us Contact Us",
    "Edge AI Technology Gorilla provides innovative solutions across business verticals with edge AI-based technology that unlocks the value of video insights and IoT data. Edge AI Computing We use a combination of machine learning and deep learning through customizing MobileNet SSD, ResNet and more to provide various highly accurate analytics. Intelligent Video Analytics Our multiple AI algorithms collaborate to deliver intelligent video analytics (IVA) that transform data into actionable, real-time insights with people, vehicle, and object identification capabilities. Optimized & Accelerated We fully implement Intel OpenVINO optimization and CPU, VPU, & FPGA acceleration to enable edge devices to analyze more video feeds simultaneously in real time. More About Edge AI IVAR™ Gorilla IVAR™, Intelligent Video Analytics Recorder, is a real-time video analytics solution which creates many benefits in the business and security intelligence fields by being an optimized and performance driven edge AI-based computer vision software. People/Face Recognition Vehicle Detection/Recognition Object Detection/Classification Behavior Analysis Business Intelligence More About IVAR IVAR Whitepaper Intelligent Solutions Gorilla Technology offers a range of solutions that combines video analytics and IoT technology to deliver business intelligence insights for improving performance in sales, operations and understanding of customer needs. Enterprise Security Biometric attendance system for managing employees, their performance and training. More Retail Analytics and in-store marketing help retailers convert customer traffic into profitable transactions. More Smart Media Streamline digital broadcast production workflows and content distribution to monetize assets. More News and Events More Events Gorilla Partner Program Access Exclusive Services and Open the Door Business Success Targeted Information Get materials and information that's vital to your operations, not someone elses. Easy to Learn Moduled courses outline your path to becoming a master of our technology. Fits Your Schedule Get information on products or get certified, all in your time and on your schedule. Exclusive Product Knowledge Access the minds that created our tech to gain an edge in the market. Trusted By Edge AI Technology Gorilla provides innovative solutions across business verticals with edge AI-based technology that unlocks the value of video insights and IoT data. Gorilla provides innovative solutions across business verticals with edge AI-based technology that unlocks the value of video insights and IoT data. Edge AI Computing We use a combination of machine learning and deep learning through customizing MobileNet SSD, ResNet and more to provide various highly accurate analytics. We use a combination of machine learning and deep learning through customizing MobileNet SSD, ResNet and more to provide various highly accurate analytics. Intelligent Video Analytics Our multiple AI algorithms collaborate to deliver intelligent video analytics (IVA) that transform data into actionable, real-time insights with people, vehicle, and object identification capabilities. Our multiple AI algorithms collaborate to deliver intelligent video analytics (IVA) that transform data into actionable, real-time insights with people, vehicle, and object identification capabilities. Optimized & Accelerated We fully implement Intel OpenVINO optimization and CPU, VPU, & FPGA acceleration to enable edge devices to analyze more video feeds simultaneously in real time. We fully implement Intel OpenVINO optimization and CPU, VPU, & FPGA acceleration to enable edge devices to analyze more video feeds simultaneously in real time. IVAR™ Gorilla IVAR™, Intelligent Video Analytics Recorder, is a real-time video analytics solution which creates many benefits in the business and security intelligence fields by being an optimized and performance driven edge AI-based computer vision software. Gorilla IVAR™, Intelligent Video Analytics Recorder, is a real-time video analytics solution which creates many benefits in the business and security intelligence fields by being an optimized and performance driven edge AI-based computer vision software. Intelligent Solutions Gorilla Technology offers a range of solutions that combines video analytics and IoT technology to deliver business intelligence insights for improving performance in sales, operations and understanding of customer needs. Gorilla Technology offers a range of solutions that combines video analytics and IoT technology to deliver business intelligence insights for improving performance in sales, operations and understanding of customer needs. Enterprise Security Biometric attendance system for managing employees, their performance and training. More Biometric attendance system for managing employees, their performance and training. Retail Analytics and in-store marketing help retailers convert customer traffic into profitable transactions. More Analytics and in-store marketing help retailers convert customer traffic into profitable transactions. Smart Media Streamline digital broadcast production workflows and content distribution to monetize assets. More Streamline digital broadcast production workflows and content distribution to monetize assets. Gorilla Partner Program Access Exclusive Services and Open the Door Business Success Access Exclusive Services and Open the Door Business Success Get materials and information that's vital to your operations, not someone elses. Moduled courses outline your path to becoming a master of our technology. Get information on products or get certified, all in your time and on your schedule. Access the minds that created our tech to gain an edge in the market. Technologies Edge AI Whitepapers Solutions Enterprise Retail Smart Media Smart City Cybersecurity About Us The 800 pound Gorilla Press Room Events & Trade Shows Videos Partner Program Contact Us Blog The 800 pound Gorilla Events & Trade Shows Login Service Portal Partner Program Language English 日本語 简体中文 繁體中文"
  ]
}