{
  "company": "www.bitventure.co.za",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 3
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.625,
    "framing_surveillance": 0.0,
    "framing_market": 0.375,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 3
    }
  },
  "sample_docs": [
    "Alizé Freight System AVS CLEARING AND FORWARDING SOFTWARE Alizé Freight System is an established software solution tailored to the specific needs of the Freight Forwarding and Customs Clearing requirements of businesses operating in the South African Import and Export industry. With 13 years of development and collective experience in the field of importing, exporting and freight forwarding software, we have kept up with all the changes to regulations, import and export tariffs and SARS systems to provide a premium solution for your shipment clearing requirements. The system is user friendly, feature rich and has a crisp user interface and provides a plethora of reports which qualify all the operational reporting requirements for an importer or exporter in South Africa. Alizé Freightalso abstracts the particulars relating to the communications to and from SARs resulting in a clean and fluid medium which is made invisible to the system user allowing them to not have to worry about the transmissions and get on with what they need to do. Bitventure also provides premium support to their clients by helping them understand the business of importing / exporting to and from South Africa and to assist them with any queries regarding the system, the industry or the messages returned in SARS communications. Benefits Customs integration Improves efficiencies Improves customer satisfaction IMPORTS The Import module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Features Fully EDI integration with SARS enabling you to send your entries electronically to Customs. Provide rates of exchange updates from Customs on a daily basis. Weekly update of Tariff Amendments. Pre-framing worksheets and costing sheets Provisional payments Import permit control Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty. EXPORTS The Export module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Features Fully EDI integration with SARS enabling you to send your entries electronically to Customs SAD500, CCA1's, Export Permits, NEP forms. Voucher of Corrections Weekly update of Tariff Amendments. Provisional payments Complete Airfreight documentation (House Airway Bills, Master Airway Bills, Manifests, airline information, dangerous goods declarations). Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty. ACCOUNT VERIFICATION SERVICE Reduce the risk and administration cost of making payments to incorrect bank accounts. Bitventure offers a highly secure and cost effective online bank account verification system where users can sign on and upload individual or company account files for verification. The Bank Account Verification will help you to: Minimise the risk of payment rejection Reduce processing costs due to incorrect details Highlight possible fraud Our automatic CDV (Check Digit Verification) pre-validates bank accounts to determine if account numbers are consistent with bank and branch validations. This facilitates the accurate capturing of data prior to submitting transactions, reducing returned or rejected transactions and associated costs. The Bank Account Verification service verify the correlation between different bank account details and those of the accountholder and significantly reduce the risk in of setting up debit orders against invalid or dormant accounts; and making payments into incorrect accounts. For more information please Clickhere CLEARING AND FORWARDING SOFTWARE Alizé Freight System is an established software solution tailored to the specific needs of the Freight Forwarding and Customs Clearing requirements of businesses operating in the South African Import and Export industry. With 13 years of development and collective experience in the field of importing, exporting and freight forwarding software, we have kept up with all the changes to regulations, import and export tariffs and SARS systems to provide a premium solution for your shipment clearing requirements. The system is user friendly, feature rich and has a crisp user interface and provides a plethora of reports which qualify all the operational reporting requirements for an importer or exporter in South Africa. Alizé Freightalso abstracts the particulars relating to the communications to and from SARs resulting in a clean and fluid medium which is made invisible to the system user allowing them to not have to worry about the transmissions and get on with what they need to do. Bitventure also provides premium support to their clients by helping them understand the business of importing / exporting to and from South Africa and to assist them with any queries regarding the system, the industry or the messages returned in SARS communications. The Import module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Fully EDI integration with SARS enabling you to send your entries electronically to Customs. Provide rates of exchange updates from Customs on a daily basis. Weekly update of Tariff Amendments. Pre-framing worksheets and costing sheets Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty. The Export module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Fully EDI integration with SARS enabling you to send your entries electronically to Customs SAD500, CCA1's, Export Permits, NEP forms. Weekly update of Tariff Amendments. Complete Airfreight documentation (House Airway Bills, Master Airway Bills, Manifests, airline information, dangerous goods declarations). Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty. Reduce the risk and administration cost of making payments to incorrect bank accounts. Bitventure offers a highly secure and cost effective online bank account verification system where users can sign on and upload individual or company account files for verification. Minimise the risk of payment rejection Reduce processing costs due to incorrect details Our automatic CDV (Check Digit Verification) pre-validates bank accounts to determine if account numbers are consistent with bank and branch validations. This facilitates the accurate capturing of data prior to submitting transactions, reducing returned or rejected transactions and associated costs. The Bank Account Verification service verify the correlation between different bank account details and those of the accountholder and significantly reduce the risk in of setting up debit orders against invalid or dormant accounts; and making payments into incorrect accounts. For more information please Clickhere",
    "The concept of providing businesses with innovative and tailored software solutions to the challenges associated with specific enterprise needs began a few years ago, whilst developing a system for the import-export industry. The innovation became a business when Bitventure was officially registered in 2012. Bitventure was born in a time of technology disruption, change and complexity. In this exciting but challenging environment, we have embraced new technologies, approaches and methodologies to deliver high-end software solutions for organizations in both the private and public sector. We live outside the box and enjoy challenging the status quo. We've built the first real-time multi-bank Account Verification platform in South Africa, a mission-critical Payment Switch (processing over R1 billion worth of transactions every quarter), a SARS integrated import-export system and many more. Our most important asset will always be our team and we only hire the best. Our winning formula draws together the expertise of several IT experts, industry specialists and is complemented by substantial investment in training and cutting edge technology. The integration of these resources and capabilities means that we are able to provide innovative and effective tailored solutions of the highest quality at economical rates. Bitventure, with head office in Bedforview, Johannesburg, is a leading software engineering and solutions company. We have mastered the dynamics of software engineering. That's why we retain over 95% of our clients. Our collective experience has propelled the company to a point where it has spread its wings to develop expertise in various industries. Junior K. Biola CEO and Founder As Bitventure's founder and chief executive officer, Junior is responsible for Bitventure's day-to-day operations, as well as leading the company's technical and business strategy. He founded Bitventure upon his return from Duke University in North Carolina (US), where he spent his final year as an MBA Exchange Student. In 2013 he co-founded EasyDebit , the first South African online financial platform to facilitate real time bank account verification across all major banks. Prior to founding Bitventure, Junior was CIO of NuDebt Management, a leading debt collection company in South Africa. Previously, he served as a senior software developer and product manager at Altech NuPay, and was instrumental in the development of the first AEDO (Authenticated Early Debit Order) payment system in South Africa. Junior holds a bachelor's degree in computer systems (cum laude) as well as an MBA from the University of Witwatersrand in Johannesburg and Duke University in North Carolina. Contact Junior on junior@bitventure.co.za Anton Bosch Chief Technical Officer (CTO) Anton is responsible for managing the day-to-day technical aspects of all the systems that run at Bitventure, engaging in strategic discussions around the systems and the business and developing the software architecture and systems needed to meet the company's objectives. He joined Bitventure back in 2012 as seasoned application architect and as the need has arisen for more detailed, intrinsic and larger systems he took on a more involved role. He has worked in a number industries over the past 15 years primarily focused on the financial sector. The systems include: Fleet management, stock control, job cards, beneficiary trust administration, portfolio management, cell captive insurance, labour broking and risk management. Anton holds a national diploma in computer systems engineering (cum laude) from the Vaal University of Technology and a bachelor's degree in Information Technology (cum laude) from the Technikon Witwatersrand. Anton possesses over 15 years of computer programming and architectural design across a number of technology stacks. Contact Anton on anton@bitventure.co.za WHAT OUR CLIENTS SAY Alizé Freight is at the core of our business. Its seamless EDI integration with SARS enables us to move all freight we handle anywhere in the world. Mauro De Nicola - CEO at Aero Cargo Services Alizé Freight is at the core of our business. Its seamless EDI integration with SARS enables us to move all freight we handle anywhere in the world. Mauro De Nicola - CEO at Aero Cargo Services Alizé Freight support team have been providing technical support to our business for over 5 years, I've found the team to be both technically adept and highly responsive. Zamoy Mozagba - CEO at ZM Business Alizé Freight support team have been providing technical support to our business for over 5 years, I've found the team to be both technically adept and highly responsive. Zamoy Mozagba - CEO at ZM Business",
    "Alizé Freight System is an enterprise resource planning software system tailored to the specific needs of the Freight Forwarding and Customs Clearing requirements of businesses operating in the South African Import and Export industry. It delivers specific mandatory documents that are and also rapidly implements an end-to-end solution for international trade. The user friendly software is up to date with all the latest regulations, import and export tariffs and SARS systems, which provides your company with a premium solution for your shipment clearing requirements. Alizé Freight abstracts the particulars relating to the communications to and from SARS resulting in a clean and fluid medium which is made invisible to the system user allowing them to not have to worry about the transmissions and get on with what they need to do. Global enterprises and SMB's use Alizé to improve their processes, ensure compliance, streamline operations and maximise supply chain intelligence. Bitventure provides premium support regarding the system, the industry and communication with SARS to Alizé clients Clear and manageable interfaces Available for Windows XP, Vista, 7 & 8 Training on the software is provided Frequent upgrades to enhance the system Direct communications with SARS (EDI) No need to manually check in your goods at airports The Import module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Fully EDI integration with SARS enabling you to send your entries electronically to Customs. Provide rates of exchange updates from Customs on a daily basis. Weekly update of Tariff Amendments. Pre-framing worksheets and costing sheets Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty. The Export module of Alizé Freight covers all modes of transport including Seafreight, Airfreight andRoadfreight to enable you to submit all your Customs clearing documentations to the South African Revenue Service (SARS) via EDI communication. Fully EDI integration with SARS enabling you to send your entries electronically to Customs SAD500, CCA1's, Export Permits, NEP forms. Weekly update of Tariff Amendments. Complete Airfreight documentation (House Airway Bills, Master Airway Bills, Manifests, airline information, dangerous goods declarations). Ships with full harmonised Tariff Book including 1st, 2nd, 3rd, and 4th Schedules including EU and SADC rates of duty."
  ]
}