{
  "company": "www.idsplinfo.in",
  "dominant_topics": [
    -1,
    0,
    6,
    2,
    9
  ],
  "topic_counts": {
    "-1": 3,
    "0": 2,
    "6": 1,
    "2": 1,
    "9": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "6": "stripe, payments, think, really, payment",
    "2": "demand, cctv, camera, ca, verkada",
    "9": "gsm, gprs, wireless, cdma, rf"
  },
  "framing_scores": {
    "framing_ethical": 0.3,
    "framing_surveillance": 0.2,
    "framing_market": 0.5,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 2,
      "2": 1,
      "6": 1,
      "9": 1,
      "10": 1
    }
  },
  "sample_docs": [
    "Canteen Management Software is an automated software which enables all the activities of the canteen and maintain a detailed account of food served at the canteen.. It allows secure and speedy transactions. It helps management to handle the users by reducing the waiting time for the customers. Our software helps you to make the task much easy. It manages each and every aspect of the canteen right from the brunch to dinner. Canteen Management System helps to work seamlessly the dining facility without any hassle. This software helps to automate the canteen facility and makes it transparent. Additionally Biometric device is linked with this software to generate the reports of the employees in the Canteen. Real-time User Details Cashless Transaction Customizable Menu Smart Card Recharge Integrated with back office Cross-platform Support Cashless Transactions Time Limit Between Each Meals (Breakfast, Lunch, Dinner) Recharge of the particular user through by means of software One time swipe integration Secure and speedy Transactions Guest Card accessibility Alerts (Recharge, Block List emps) Any user can check their Transactions Display no of Card Swipes User wise Card Issue Department wise Card Issue Completely Scalable and Flexible",
    "Interactive Data Systems Limited offers a wide range of models in automatic Boom Barriers which are reliable and maintenance free. Models are available for boom length up to 8 m to suit various applications like car parking sites, condominiums, toll collection & industrial entrances. It is highly compact in size with extremely silent operation. The soft edges, rounded corners and high performance of the Boom Barriers offered by IDSL are suitable for any type of installation environment. The sturdy steel structure comes with scratch – proof coating which can resist harsh weather conditions. The wide range of lengths and accessories available ensure that all installation requirements are met. All models are equipped with a provision of manual operation in the event of power failure and battery back-up facility in selected models. Boom Barriers are available in wide range of models to suit various applications like car parking sites, condominiums, toll collection & Industrial entrance. Available for boom length up to 8 m. Highly compact in size has extremely silent operation. Sturdy steel structure with scratch-proof coating resistant to harsh weather conditions. Integration possible with wide range of accessories and all kinds of access control systems. Extremely reliable and maintenance free. Tested and distributed all over the world. Manual release in case of power failure. Battery backup facility in select models of boom barriers. The IDSL range is equipped with electronic declaration at opening and closing. A version with articulated barrier for low ceilings is available on request. The IDSL barrier is designed to accommodate use of optional items such as the limit-switch kit and anti-vandal value. Perfectly calibrated stopping, thanks to the adjustable electronic brake that shows down closing and opening movement. A thermal probe detects temperature and activates a cooling fan. With the no gear transmission system you can reach high levels of silence, reliability, long life and hassle free maintenance. The Economic solution - entry level barrier. Top Performance upto 7 mtrs / duty cycle 100%. For faster operations - opening closing time 2.0 - 0.8 sec./duty cycle 100%. Hydraulics (by-pass valve) very accurate and low acting threshold. Resistance - Higher Life 3 mm steel sheet body with cataphoresis treatment, cathode electroplating polyester painted UV resistant. The transmission motion to the beam is made by a balance spring and NIPLOY transmission shaft incorporated in a double bearing. The balance spring is submitted to a shot-penning treatment to increase resistance to stress.",
    "The Gate Management Software is a leading technology used in managing access to gated communities and gated offices. The Gate Management System (GMS) is a complete system, which can manage, control and monitor an entire vehicle gate logs and all related equipment. It is designed to continue to operate even when network connectivity is lost so that residents and visitors are never inconvenienced with long lines and compromised security. The simple and organized design of the administrative workstation allows administrators to efficiently control the database. The user-friendly gate attendant workstation helps streamline visitor tracking and resident gate access by accurately and efficiently processing requests and maintaining operational effectiveness of gated community security personnel. You're Company Officials and residents will have peace-of-mind that their information is secure and being utilized to proactively manage guest access. Our Gate Management System is highly recommended for urban access, Business parks, Gated -communities, residential areas, Hotels. Local and Remote monitoring is possible by 1. Visitor Control 2. Access Control 3. Vehicle Control 4. Security monitoring Key Features of Gate Management System Gate Management Software is an ultimate use for Automatic Gate Pass System. System is simple to use & no supervisor is required Visitor can simply enter the visiting card & gate pass can be made automatically by using simple touch-screen operation. While scanning the card the photo of the visitor is also maintained & printed on gate pass. Visitor can also type the data on touch screen if required. The unique feature of this software is that it can record both the entry & the exit of any visitor in the premise. This enables you to close loop the entry exit system. The data of the visitors can be easily maintained & accessed at a later date. This Software is being integrated with the following products Boom Barriers/Flap Barriers Turnstiles UVSS (Under vehicle surveillance systems) ALPR Cameras(Automatic number plate recognition ) Control and Monitoring – Vehicles cannot advance until all required data is entered, ensuring all vehicles are properly logged and accounted for. Detailed log – An extensive event log registers all vehicle passages and provides information regarding the status of the gate. Improved Process Times – More effective processing reduces delays and traffic buildup especially at peak periods. Reporting Made Easy – The central processing computer stores relayed data that can be filtered for customized reporting capabilities. Effective Management and Oversight – Gate Management Software generates an accurate record logs for all vehicles Enhanced Communication – The system centralizes all data and notification information for easy access and pass-along capabilities - no more notes posted that officers may or may not see. Easy integration – The Gate management Software allows for easy integration into existing management applications. Easy upgrade – Upgrade of new or customer specific policies can easily be implemented by means of software, without change of hardware.",
    "As data center convergence becomes more common in today's networking world, so do the demands placed on the physical infrastructure. Whether you're trying to increase your network's throughput, reduce latency or enable improved Service Level Agreements (SLAs), Interactive Data systems limited can help you through this. IDSL Solutions also offers wireless solutions apart from cabling solutions. IDSL solutions offer turnkey Voice / Video / Data connectivity solutions on wireless to build Indoor and Outdoor Wireless LAN. These LANS can used as point-to-point, point-to-multipoint, campus-wide, metropolitan area and Wide-area networks. We had Installed and commissioned LAN across various departments like Public & Private Enterprises, Government, Education, Utility & Financial, Public safety & Private security firms, Cellular carriers operators, ISPs, WISPs Scope Requirement Analysis Site survey Analysis Network design & engineering Equipment supply Installation & Commissioning Maintenance Liaising With Regulatory Authorities We design Wireless Solutions to deploy and facilitate: LAN access anywhere in office or residential premises Internet Access in public and private premises Temporary LAN setup Extension of Wired LAN Enable mobile handheld terminals to get connected to LAN 2 GHz&5GHz wireless broadband radio Design and Deployment experts Complete Point-to-Point and Point-to-Multipoint Multi-vendor Deployment portfolio Deployments in entire INDIA LAN Inter connect between two or more sites physically separated by kilometers for Data voice and Video Connectivity.(up to 40-60 Km) Extension of Internet access. Connecting LANs / PCs/ Terminals from remote sites that are very difficult to wire. Connecting multiple LAN sites to a central site. Connecting multiple remote PCs to Central Site LAN. In computer networking era, a network service is an application running at the network application layer that provides data storage, manipulation, presentation, communication or other capability which is often implemented using a client-server or peer-to-peer architecture based on application layer network protocols. Our Networking solutions offer the wide range of cabling, switches and Integrated Services Routers with the industry's most advanced technologies to build cost effective communications networks. A data center is a facility used to house computer systems and associated components, such as telecommunications and storage systems which generally includes redundant or backup power supplies, redundant data communications connections, environmental controls. Whether you are building a new Data Center, planning a Disaster Recovery Site or simply expanding a Server Room we at IDSL has the experience and resources to design and implement the physical infrastructure that will support your needs, and allow you to easily install new equipment and manage your network. How are we beneficiary to your business? At IDSL, we understand the nature of modern technology and its impact on the business needs. Based on it we offer the \"state-of-the art\" technology based solutions to meet the present & future emerging technologies. Our strong Technical Service and Solution team enables us to provide total and cost-effective solutions to our customers. We also provide consultancy services in designing the customer specific connectivity solutions.",
    "Biometric authentication is one of the most exciting technical improvements of recent history and looks set to change the way in which the majority of individuals work, Security is now becoming a more important issue for business, and the need for authentication has therefore become more important than ever. The use of biometric systems for personal authentication is a response to the rising issue of authentication and security. A face recognition system is a computer application for automatically identifying or verifying a person from a digital image or a video frame from a video source. One of the ways to do this is by comparing selected facial features from the image and a facial database. Rugged Fingerprint Algorithm: Equipped with most reliable fingerprint matching algorithm to ensure unrivaled accuracy with best verification result. Superior Verification Technique: Quality score display before registration helps in identifying the ideal finger for routine verification whereas auto finger update helps in keeping the track of finger changes over the period thus adequately taking care of dry, wet and swollen fingers. Multiple RFID Technologies: Supports all latest RFID technologies with inbuilt EM Reader and option of having Mifare/HID iClass/HID Prox. Fingerprint template can be stored on a smart card with HID iClass/Mifare technology to facilitate data portability & unlimited users without being dependent on the device template capacity. Multiple Card Formats: The system supports multiple card formats including HID Prox and HID iClass. It also supports 13.56 MHz Mifare credentials for CSN as well as sector reading. Inbuilt TCP/IP Network Interface: Leveraging on the merits of IP Based systems, it can be easily hooked up on the existing TCP/IP network. Thus the data can be transferred instantaneously in real time mode to a centralized server. Aluminum Die Cast Enclosure: Rugged aluminum die cast housing is meant to provide extra strength to the device particularly for rough industrial usage. Field Upgradable Firmware: Facility to onsite upgrade firmware over Ethernet so that the system can be easily updated without removing the devices. Gate Access Control System Interactive Data Systems Ltd ® offers wide ranges of barriers built from heavy gauge steel and the folded and welded case is extremely sturdy. The high torque electro-mechanical motor and gearbox are spring loaded and damped, decreasing mechanical stress and providing long term durability and Problem free service. The high torque electro-mechanical motor and gearbox are spring assisted and damped, reducing mechanical stress and providing long term reliability and trouble free service and uses a lever system that It also ensures that in the event of a power failure, the barrier boom can still be moved easily by hand. A built in spring mechanism provides a precise counterbalance for the boom barrier, the springs are Set to correspond with the boom length prior to installation, however if necessary, these can be easily reset during installation to allow for site specification. The barrier is driven by a torque motor. Under Vehicle Surveillance Systems Interactive Data Systems Ltd provides an Under Vehicle Inspection System (UVIS) as part of our electronic monitoring solutions. UVSS provides a safe, rapid and thorough method of examining passenger and commercial vehicles' undercarriages. The UVSS includes a user friendly touch-screen interface that makes inspections easier and faster. The entire underside of the vehicle is scanned to provide a complete image that can be magnified up to 12 times. The entire length of the undercarriage can be inspected in a matter of seconds as: Scene camera captures images of vehicle Vehicle drives over UVSS imaging unit at up to 40km/hr. Images are transferred to workstation in lane booth. Guard examines vehicle images and authorizes vehicle entry. Database automatically stores event record. Automatic License Plate Recognition LPR (License Plate Recognition) is an image-processing technology used to identify vehicles by their license plates. This technology is used in various security and traffic applications, such as the access-control system Camera Illumination - The illumination is Infra-Red (IR) which is invisible to the driver. Frame grabber - Allows the software to read the image information Heavy-duty electronically controlled turnstile can be equipped for automatic revenue collection systems. Uniquely upgradeable so that the turnstiles will remain for decades as revenue systems are changed. Wear and corrosion resistant. High security vault. Large captured ticket capacity. Extremely fast. Exceptionally low maintenance. Extremely long service life. Designed for the look of modern automatic fare collection systems. Three rotor sections provide a comfortable passage while still maintaining high security performance. Units are available with mechanical or electrical operation, in either one or two way operation, with any combination of fail lock or fail secure."
  ]
}