{
  "company": "www.collinsaerospace.com",
  "dominant_topics": [
    2
  ],
  "topic_counts": {
    "2": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.5,
    "framing_market": 0.5,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "2": 1
    }
  },
  "sample_docs": [
    "Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Request information I would like more information about this capability. Let's connect! Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Virtual pilot training Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Experience to deliver CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. Request information I would like more information about this capability. Let's connect! CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas. Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Request information I would like more information about this capability. Let's connect! I would like more information about this capability. Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Virtual pilot training Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Experience to deliver CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. Request information I would like more information about this capability. Let's connect! I would like more information about this capability. CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas. The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas."
  ]
}