{
  "company": "www.lips-hci.com",
  "dominant_topics": [
    2,
    -1,
    1
  ],
  "topic_counts": {
    "2": 14,
    "-1": 10,
    "1": 2
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.2,
    "framing_surveillance": 0.0,
    "framing_market": 0.8,
    "num_docs": 26
  },
  "topic_timeline": {
    "20": {
      "-1": 10,
      "1": 2,
      "2": 14
    }
  },
  "sample_docs": [
    "3DRuler is a 3D Metrology middleware that currently offers automatic measurement over L-W-H sizes of cuboid-shape or arbitrary shape object, like cardboard boxes, pallet...etc. People counting can differ dramatically in the way how people is to be counted as to from what angle the depth camera is mounted. It analyzes facial features including closing both eye lids and/or head's forward pitch angle greater than pre-defined degree for a pre-defined length of seconds, that signifies fatigue. This middleware captures detected hand's various gestures moving in a relatively natural motion. Full-body user tracking can uniquely segment and track multiple users as well as the motion of the detected body skeletons. Face recognition includes identity, gender, age, liveness, and face's pitch/ yaw/roll angles.",
    "Face recognition includes identity, gender, age, liveness, and face's pitch/ yaw/roll angles. To make sure your LIPS camera has the latest features, you will need to update it by downloading and installing the latest camera software. 1. Can extract 47 facial landmarks. 2. Can detect identity, gender, and age group (kids, young adult, adult, senior) Face properties include: liveness, face's pitch/yaw/roll angles, face ROI. Specifications are subject to change without notice. Operating ranges and accuracy can be scene dependent. 3DRuler is a 3D Metrology middleware that currently offers automatic measurement over L-W-H sizes of cuboid-shape or arbitrary shape object, like cardboard boxes, pallet...etc. People counting can differ dramatically in the way how people is to be counted as to from what angle the depth camera is mounted. It analyzes facial features including closing both eye lids and/or head's forward pitch angle greater than pre-defined degree for a pre-defined length of seconds, that signifies fatigue.",
    "LIPS works with a number of premium companies to give you more applications. Altera Corporation, Chinese name: Toulon Semiconductor. Is a programmable logic device located in Silicon Valley, and can be configured repeatedly complex digital circuit manufacturing enterprises. The company launched its first programmable logic device in 1984. ADI (Analog Devices) Ltd is a US multinational semiconductor device manufacturer. Yadu Nuo Semiconductor Technology Co., Ltd. for manufacturing and industrial products manufacturing ADC, DAC, MEMS and DSP chips. At Melexis, believe in engineering with a purpose. Passion for technology has made us one of the five world leaders in automotive semiconductor sensors, as well as a leading player in integrated circuits for motor driving, car networking and wireless communication. Nvidia Corporation is an American technology company based in Santa Clara, California. It designs graphics processing units (GPUs) for the gaming and professional markets, as well as system on a chip units (SoCs) for the mobile computing and automotive market. Matsushita Electric, officially known as Panasonic Co., Ltd., Japan's largest motor manufacturer, is also one of Japan's top eight motor companies, headquartered in Osaka, Japan, the door of the city. Fortune magazine ranked 106th in the world's top 500 in 2014. Realtek Semiconductor Corp. It's a fabless semiconductor company situated in the Hsinchu Science Park, Hsinchu, Taiwan. It was founded in October 1987 and subsequently listed on the Taiwan Stock Exchange in 1998. Texas Instruments is a multinational company based in Dallas, Texas, known for its development, manufacture and sales of semiconductor and computer technology, and is principally engaged in the research, manufacture and sales of digital signal processing and analog circuits. It has manufacturing, design or sales organization in 25 countries. Toshiba Corporation, commonly known as Toshiba and stylized as TOSHIBA, is a Japanese multinational conglomerate headquartered in Tokyo, Japan. Its diversified products and services include information technology, communication equipment and systems, electronic components and materials, and power systems. 3DiVi Inc. is a privately-owned computer vision company headquartered in Palo Alto, CA. The company specializes in 3D computer vision software development with particular focus on face and gesture recognition.",
    "Who are we? Established since 2013 in the silicon valley of city of Taipei, LIPS was born with a promising vision that is \"Create a Real 3D World\" preordained by the founder's second sight. It may sound simple and straight however brainpower intensive. The good news to you and the world who have been waiting eagerly for its debut is: Yes, we did it! What makes LIPS stand out so well in the competition is a team of MIT scholars that founded the company and years of dedicated research on convolutional neural network (CNN) deep learning spanning over institutions and industries in 3D machine vision and only this, period. This persistent investment and tenacious lab research along with final fruitful results effectively put the company and its products as a frontrunner in the 3D vision industry. What makes LIPS special? To further make life of our customers easier, we set out in the early stage to become a total 3D vision solution provider including lines of low-cost high-performance depth cameras and OpenNI 1.5/2.2 compatible middleware SDK which guarantees doing the work out of the box and free of compatibility concern. This strategy turns out to be a smart and first choice to and is appreciated by our customers. Depending upon applications, our customers may choose from 3D depth cameras based on different technologies behind the scene suiting your needs including ToF (Time of Flight), Stereo, Structured Light, and Array Camera. On top of these technologies, there's also an FPGA standalone solution offering customers the maximum flexibility in their product integration. These technologies in the cameras that we have to offer combined with our incomparable and patented algorithm performance in middleware SDK exploiting parallel processing to its extreme undoubtedly gives our throughput-hungry customers the needed edge in their own advanced product development. These strong and constant demands from our customers have been driving us to excel and transcend over the years manifested in our product generations. What are LIPS committed to? Rest assured that LIPS was created with decades of new inventions planned ahead. Once you stay with us, you will never be left alone. Our dream is to ultimately carve the \"LIPS Inside\" product slogan in this obsessively marvelous 3D machine vision industry. We believe we'll eventually be able to share this joy and glory with all of our customers that choose to join us today. To borrow the statements from one of our prominent technology partner, that is \"Realistic is not enough, it's gotta be Real\". At LIPS, we strive to deliver only the best-of-breed real 3D depth camera total solutions so the world can be truly captured photoreal through the eyes of our creations. As most aptly described and inspired by the CEO: \" Be the first, or, be the best \" – Luke Liu, 2016 Established since 2013 in the silicon valley of city of Taipei, LIPS was born with a promising vision that is \"Create a Real 3D World\" preordained by the founder's second sight. It may sound simple and straight however brainpower intensive. The good news to you and the world who have been waiting eagerly for its debut is: Yes, we did it! What makes LIPS stand out so well in the competition is a team of MIT scholars that founded the company and years of dedicated research on convolutional neural network (CNN) deep learning spanning over institutions and industries in 3D machine vision and only this, period. This persistent investment and tenacious lab research along with final fruitful results effectively put the company and its products as a frontrunner in the 3D vision industry. What makes LIPS special? To further make life of our customers easier, we set out in the early stage to become a total 3D vision solution provider including lines of low-cost high-performance depth cameras and OpenNI 1.5/2.2 compatible middleware SDK which guarantees doing the work out of the box and free of compatibility concern. This strategy turns out to be a smart and first choice to and is appreciated by our customers. Depending upon applications, our customers may choose from 3D depth cameras based on different technologies behind the scene suiting your needs including ToF (Time of Flight), Stereo, Structured Light, and Array Camera. On top of these technologies, there's also an FPGA standalone solution offering customers the maximum flexibility in their product integration. These technologies in the cameras that we have to offer combined with our incomparable and patented algorithm performance in middleware SDK exploiting parallel processing to its extreme undoubtedly gives our throughput-hungry customers the needed edge in their own advanced product development. These strong and constant demands from our customers have been driving us to excel and transcend over the years manifested in our product generations. What are LIPS committed to? Rest assured that LIPS was created with decades of new inventions planned ahead. Once you stay with us, you will never be left alone. Our dream is to ultimately carve the \"LIPS Inside\" product slogan in this obsessively marvelous 3D machine vision industry. We believe we'll eventually be able to share this joy and glory with all of our customers that choose to join us today. To borrow the statements from one of our prominent technology partner, that is \"Realistic is not enough, it's gotta be Real\". At LIPS, we strive to deliver only the best-of-breed real 3D depth camera total solutions so the world can be truly captured photoreal through the eyes of our creations. As most aptly described and inspired by the CEO: \" Be the first, or, be the best \" – Luke Liu, 2016",
    "05 Dec/16 LIPS is squarely invited to this VC roadshow event as a potential investment target focused on Smart Manufacturing on 2016/12/9 ~ 11. This again re-iterates the importance of our machine vision technology Read More… LIPS is squarely invited to this VC roadshow event as a potential investment target focused on Smart Manufacturing on 2016/12/9 ~ 11. This again re-iterates the importance of our machine vision technology Read More… 25 Nov/16 On 2016/11/25, LIPS was proud to receive 2016 Golden Torch Innovation Award (金炬çŽ) from Outstanding Enterprise Manager Associate in Taiwan. The honor certainly brought in more endorsement into the technologies behind our Read More… On 2016/11/25, LIPS was proud to receive 2016 Golden Torch Innovation Award (金炬çŽ) from Outstanding Enterprise Manager Associate in Taiwan. The honor certainly brought in more endorsement into the technologies behind our Read More… 03 Nov/16 This event is a great chance to showcase our rich lines of depth camera products from years of research and development works. In light of our strong market leading position, we continue Read More… This event is a great chance to showcase our rich lines of depth camera products from years of research and development works. In light of our strong market leading position, we continue Read More… 04 Oct/16 This Innovation Award given today (Oct 4, 2016) not only speaks for our 3D depth camera product series but also serves as the fullest endorsement of our range sensing technologies. We are Read More… This Innovation Award given today (Oct 4, 2016) not only speaks for our 3D depth camera product series but also serves as the fullest endorsement of our range sensing technologies. We are Read More… 18 Aug/16 We are honored to be invited as a technology sponsor of our 3D cameras & SDK product suite in this fun and creative annual robotics competition event hosted by Nvidia meant to Read More… We are honored to be invited as a technology sponsor of our 3D cameras & SDK product suite in this fun and creative annual robotics competition event hosted by Nvidia meant to Read More… 25 Jul/16 GPU and parallel processing play such an important role in our machine vision solution through artificial intelligence and deep learning. We'll never miss this year's GTC Taiwan to flex the muscle of Read More… GPU and parallel processing play such an important role in our machine vision solution through artificial intelligence and deep learning. We'll never miss this year's GTC Taiwan to flex the muscle of Read More… 18 Jul/16 This is one of the few major technology events held in the city of Taipei every year that attracts the most footprints of potential system integrators worldwide. As usual, LIPS won't be Read More… This is one of the few major technology events held in the city of Taipei every year that attracts the most footprints of potential system integrators worldwide. As usual, LIPS won't be Read More… 11 Jul/16 LIPS was proudly invited by our technology partner Intel to showcase our latest and greatest depth camera total solution at IFTD 2016. Look for our stand for a slew of fun machine Read More… LIPS was proudly invited by our technology partner Intel to showcase our latest and greatest depth camera total solution at IFTD 2016. Look for our stand for a slew of fun machine Read More…"
  ]
}