{
  "company": "www.airopie.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 25,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 26
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 25
    }
  },
  "sample_docs": [
    "Don't let unproductive meetings hold you back. With Airopie, you can transform the way your teams work together. Airopie is more than just a wireless display technology solution. It's a powerful platform that lets you collaborate wirelessly and seamlessly. Whether you're in the same room or across the globe, you can share and interact with the same information on your iPhone. Airopie helps you create a positive meeting environment where everyone is on the same page and aligned with the same vision. It's not just collaboration. It's magic. Collaboration is the key to success in the modern world. Whether you're at work or at school, you need a smart and safe way to share your ideas with others. That's why Airopie created VCast, the ultimate wireless presentation system. VCast lets you connect your iPhone to any display without any apps, cables, or buttons. Just tap and go. VCast also works seamlessly with your UC device, so you can communicate with anyone, anywhere. VCast is more than a wireless display. It's a wireless revolution.",
    "A Seamless Solution for Meeting Rooms in Montreal from Airopie VCast Max Wireless Presentation System Imagine a meeting room where you can wirelessly connect your iPhone to any display, share your screen with a touch of a button, control the presentation with your fingertips, annotate and edit on the fly, and display two screens at the same time. Imagine a meeting room where you can collaborate with your colleagues and clients without any hassle, delay, or distraction. This is not a dream, this is a reality with Airopie VCast Max Wireless Presentation System. Imagine a meeting room where you can wirelessly connect your iPhone to any display, share your screen with a touch of a button, control the presentation with your fingertips, annotate and edit on the fly, and display two screens at the same time. Imagine a meeting room where you can collaborate with your colleagues and clients without any hassle, delay, or distraction. This is not a dream, this is a reality with Airopie VCast Max Wireless Presentation System. How Airopie DC80 Document Camera Improves Middle School Education in Louisiana The Airopie DC80 document camera is a digital presentation tool that combines easy-to-use design, high-quality image, and innovative features, such as one-touch recording and onboard annotation. It can transform the image capturing and group presentation experience in your professional setting. 넶 23 2024-01-03 How Airopie DC80 Document Camera Improves Middle School Education in Louisiana The Airopie DC80 document camera is a digital presentation tool that combines easy-to-use design, high-quality image, and innovative features, such as one-touch recording and onboard annotation. It can transform the image capturing and group presentation experience in your professional setting. Airopie DC50 Document Camera: A Powerful Tool for Middle School Education in Texas Imagine a classroom where teachers can show any document or 3D object in high-definition, zoom in on the details, record and replay the videos, annotate and edit on the spot, and capture and save the images. Imagine a classroom where students can see the content clearly and vividly, explore the objects closely and curiously, and learn the content immersively and personally. This is not a fantasy, this is a reality with Airopie DC50 document camera. 넶 27 2024-01-03 Airopie DC50 Document Camera: A Powerful Tool for Middle School Education in Texas Imagine a classroom where teachers can show any document or 3D object in high-definition, zoom in on the details, record and replay the videos, annotate and edit on the spot, and capture and save the images. Imagine a classroom where students can see the content clearly and vividly, explore the objects closely and curiously, and learn the content immersively and personally. This is not a fantasy, this is a reality with Airopie DC50 document camera.",
    "We're Airopie, a dynamic and dependable group specializing in the design and manufacture of embedded vision hardware. Over the past few years, we've pioneered numerous groundbreaking innovations. Except camera hardware, Airopie supplies SDK and face liveness detection and face matching algorithm for ATM/Kiosk etc. TC5H5H-D Face Liveness Detection and Matching Dual Camera with 5MP WDR and 5MP NIR The TC5H5H-D face liveness detection camera is designed to discern whether the individual before it is indeed present in real-time, offering a robust defense against face spoofing attempts. This ensures secure biometric authentication and verification. Come with a tripod, it's ideal for unmanned counters, kiosks, and similar settings. ¥ 0.00 立即购买 TC5H5H Face Liveness Detection and Matching Dual Camera with 5MP WDR and 5MP NIR The TC5H5H face liveness detection camera identifies if the face in front of the camera belongs to the live person helping to prevent face spoofing attacks and ensuring safe biometric authentication and verification. Airopie supplies SDK, demo, manual, face liveness detection and face matching algorithm so that customers can be easily install it on ATM/Kiosk. ¥ 0.00 立即购买",
    "Airopie VC818 4K Mini PTZ USB Camera with 3 Times of Digital Zoom UItra HD True 4K Camera Smart Frame Selection 3X Zoom PTZ Camera 90°Wide-angle Field Of View Privacy Protection ¥ 0.00 Buy now Airopie W201 Aufo Focus Webcam with 1080P 60FPS HD 1080p video quality at 60FPS Plug-and-play USB connectivity 80°distortion-free field of view Stand-alone audio processor 6-Layer glass coated lens Hight dynamic range ¥ 0.00 Buy now Airopie W808 4K ePTZ All-in-One USB Mini Video Bar UItra HD True 4k Camera Automatic Face Frame Selection Echo Cancellation Microphone Privacy Protection Flexible Stand Wide Compatibility for all conference systems ¥ 0.00 Buy now Airopie W800 4K Webcam with Auto Face Framing for small rooms Ultra HD True 4K camera Smart Frame Selection Diversified Installation Numerous Locations for Applications. Built-in Microphone AI Button ¥ 0.00 Buy now Airopie VP100 Conference SpeakerPhone for small rooms Omnidirectional Vioce Pickup Long Endurance (3000Ah Battery) Sound Source Localization Technology Various Connection Methods Compatible With Various Applications ¥ 0.00 Buy now Airopie KB900 NDI PTZ Camera Controller Airopie offers advanced PTZ controllers and camera accessories, providing users with enhanced flexibility in camera control. By combining HD&UHD cameras with these camera additions, users can enjoy hands-free operation and streamline their video production process. ¥ 0.00 Buy now Airopie KP700 PTZ Camera Network Joystick Controller Airopie offers advanced PTZ controllers and camera accessories, providing users with enhanced flexibility in camera control. By combining HD&UHD cameras with these camera additions, users can enjoy hands-free operation and streamline their video production process. ¥ 0.00 Buy now Airopie LC2060 Live Streaming Full HD USB/HDMI Camera with 10x Optical Zoom Airopie live streaming camera boasts impeccable functionality, exceptional performance, and an array of video output interfaces. It is equipped with cutting-edge ISP processing algorithms, ensuring the delivery of vibrant and high-resolution videos that exhibit a remarkable sense of depth and stunning color reproduction. ¥ 0.00 Buy now",
    "Airopie WF80 Your Go-To 8MP Wireless Visualizer for Seamless Educational Streaming Instant peer-to-peer connection via Wi-Fi direct Built in 8-hour battery life Stunning 8MP clarity and 30X zoom for unmatched image quality Enhanced A3 capture area Versatile articulating arm Prepared for remote education Experience interactive software ¥ 0.00 Buy now Airopie WF130 Portable 13MP Wireless Visualizer for Crystal-Clear 4K Education Streaming Immediate peer-to-peer connectivity with Wi-Fi direct Built in 8-hour battery life Enjoy pristine 4K resolution with powerful 30X digital zoom for unparalleled clarity Expanded A3 shooting space Highly adaptable robotic arm Prepared for remote education Come with interactive software ¥ 0.00 Buy now WM130 Wall-Mounted 13.0MP Visualizer, Interactive Experience with Top-notch and Dependable Display Sharp and Detailed 4K Images with 13.0MP sensor Wall-mounted with security lock case design Multiple touch buttons for easy operation, USB ports and HUBs Inductive software start-up function Come with an interactive visualizer software ¥ 0.00 Buy now WM80 Wall-Mounted 8.0MP Visualizer with Cost-effective and Sturdy Design 8.0MP sensor with autofocus camera Wall-mounted with security lock case design Multiple touch buttons for easy operation, USB ports and HUBs Come with an interactive visualizer software ¥ 0.00 Buy now DC80 8.29MP, 4K 240X total zoom and image streaming via HDMI visualizer (document camera) 4K Image output at 3840x2160 12x optical zoom, 20x digital zoom, 240x total zoom Large A3 shooting area for documents and 3D objects Full HD 1080p output resolution with 60fps Records audio and video to SD card Stable and flexarm for various uses and easy portability ¥ 0.00 Buy now DC50 5.0MP, 240X total zoom and image streaming via HDMI visualizer (document camera) Full HD 1080p output resolution with 60fps A3 shooting area for documents and 3D objects 12x optical zoom, 20x digital zoom, 240x total zoom VGA, HDMI input and output and supports VGA, HDMI pass-thru Records audio and video to SD card Stable and flexarm for various uses and easy portability ¥ 0.00 Buy now"
  ]
}