{
  "company": "www.veritone.com",
  "dominant_topics": [
    3
  ],
  "topic_counts": {
    "3": 2
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.0425531914893617,
    "framing_surveillance": 0.7021276595744681,
    "framing_market": 0.2553191489361702,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "3": 2
    }
  },
  "sample_docs": [
    "You have been redirected to the Veritone Channel Partner Portal located within Salesforce.com Introducing the world's first operating system for artificial intelligence DISCOVER MORE Introducing the world's first operating system for artificial intelligence Harness the Power of the Operating System for AI Veritone created aiWARE to empower every person and every organization to do more with the power of AI. Our operating system for AI solves critical and often systemic issues facing industries, institutions and individuals by leveraging an advanced yet extensible AI ecosystem, a common infrastructure and your proprietary data feeds. With capabilities such as language detection, translation and transcription, object detection, face detection and identification and much more, aiWARE imitates human behavior while recognizing and analyzing patterns. It processes information faster and at higher volumes than the human brain – all to help boost revenue and efficiency. DISCOVER MORE IT'S TIME FOR A BETTER APPROACH TO AI 80 percent of the world's data can't be read by machines. But with aiWARE, you can use artificial intelligence to turn that data into actionable insights that help you make better, data-backed decisions for your business. Media and Entertainment Legal and Compliance Government Applications Veritone offers a suite of applications and best-of-breed technologies for you to organize, manage, search, analyze and extend cognitively enriched content. Previous Tab Intelligent, Real-Time Media Attribution for Radio Broadcasters With Veritone ® Attribute TM , you can analyze and enhance the effectiveness of broadcast advertising to drive customer investment. As a radio broadcaster, you can offer advertisers near-real-time ad performance analytics on their native and prerecorded campaigns. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Complete Digital Asset Management and Monetization Veritone ® Core TM is a cloud-native digital asset management (DAM) system used to manage, share and monetize content. Capable of ingesting large amounts of assets across a broad range of audio, video and still image formats, Core leverages the power of aiWARE to automatically enrich the metadata of every asset ingested. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Your Own Branded Dam Veritone ® Digital Media Hub TM is an intuitive web portal through which you can offer secure, cloud-native global access to your content to key stakeholders, including news media and corporate partners. And the best part? You can customize the look and feel of your portal to properly represent your brand. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab AI-Powered Application Suite Veritone ® Essentials TM is your fast and easy route to harnessing AI to analyze your data. Ingest, index, search and organize your audio, video and images to transform and extend the value of your media. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Intelligent, Rapid Suspect Identification Veritone ® IDentify TM allows law enforcement agencies to harness the power of your booking databases to identify suspects faster. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Intelligent Audio & Video Evidence Redaction Veritone ® Redact TM saves time and increases productivity by using artificial intelligence to automate the redaction of faces and sensitive information within audio, video and image-based evidence. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Veritone Attribute Veritone Core Veritone Digital Media Hub Veritone Essentials Veritone IDentify Veritone Redact Develop with Us Calling all machine learning developers, application developers, data licensors and system integrators. Every business has its unique challenges. With Veritone Developer, leverage a sales channel to monetize your AI software products, add intelligent features to your applications and build bespoke, AI-powered solutions for your customers. GET STARTED TODAY Artificial intelligence offers the opportunity to extract dramatically more value from data in ways that were previously impossible, and even unimaginable in some cases. By providing a platform for our cognitive engines, Veritone has emerged as a leader in AI and we're proud to be part of their ecosystem of AI engines. Kirk Arthur Worldwide Industry Solutions, Public Safety & Justice at Microsoft Partnering with Veritone differentiates your business Collaborating with Veritone makes artificial intelligence accessible to your customers. You get seamless integrations, innovative technologies and the ability to deliver the power of AI at scale. Veritone Blog - Insights Stay abreast of the latest Veritone news, events, and product insights. Veritone® Launches VeriAdsâ\"¢, a New Suite of AI-Enabled Ad Revenue Solutions for Radio and TV Broadcasters, Podcasters and Social Media Influencers Read More Five Tips for New Attribution Clients Read More TechBytes with Ryan Steelberg, President at Veritone Read More READ MORE Upcoming Events 13 December 2019 event Is the market finally ready for mass AI adoption? 23 December 2019 webinar WEBINAR ON DEMAND: The Growing Use of Audio Preservation and Collection 26 December 2019 webinar WEBINAR ON DEMAND: The Growing Use of Audio Preservation & Collection Contact Us Harness the Power of the Operating System for AI Veritone created aiWARE to empower every person and every organization to do more with the power of AI. Our operating system for AI solves critical and often systemic issues facing industries, institutions and individuals by leveraging an advanced yet extensible AI ecosystem, a common infrastructure and your proprietary data feeds. With capabilities such as language detection, translation and transcription, object detection, face detection and identification and much more, aiWARE imitates human behavior while recognizing and analyzing patterns. It processes information faster and at higher volumes than the human brain – all to help boost revenue and efficiency. DISCOVER MORE Harness the Power of the Operating System for AI Veritone created aiWARE to empower every person and every organization to do more with the power of AI. Our operating system for AI solves critical and often systemic issues facing industries, institutions and individuals by leveraging an advanced yet extensible AI ecosystem, a common infrastructure and your proprietary data feeds. With capabilities such as language detection, translation and transcription, object detection, face detection and identification and much more, aiWARE imitates human behavior while recognizing and analyzing patterns. It processes information faster and at higher volumes than the human brain – all to help boost revenue and efficiency. IT'S TIME FOR A BETTER APPROACH TO AI 80 percent of the world's data can't be read by machines. But with aiWARE, you can use artificial intelligence to turn that data into actionable insights that help you make better, data-backed decisions for your business. Media and Entertainment Legal and Compliance Government IT'S TIME FOR A BETTER APPROACH TO AI 80 percent of the world's data can't be read by machines. But with aiWARE, you can use artificial intelligence to turn that data into actionable insights that help you make better, data-backed decisions for your business. 80 percent of the world's data can't be read by machines. But with aiWARE, you can use artificial intelligence to turn that data into actionable insights that help you make better, data-backed decisions for your business. Applications Veritone offers a suite of applications and best-of-breed technologies for you to organize, manage, search, analyze and extend cognitively enriched content. Previous Tab Intelligent, Real-Time Media Attribution for Radio Broadcasters With Veritone ® Attribute TM , you can analyze and enhance the effectiveness of broadcast advertising to drive customer investment. As a radio broadcaster, you can offer advertisers near-real-time ad performance analytics on their native and prerecorded campaigns. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Complete Digital Asset Management and Monetization Veritone ® Core TM is a cloud-native digital asset management (DAM) system used to manage, share and monetize content. Capable of ingesting large amounts of assets across a broad range of audio, video and still image formats, Core leverages the power of aiWARE to automatically enrich the metadata of every asset ingested. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Your Own Branded Dam Veritone ® Digital Media Hub TM is an intuitive web portal through which you can offer secure, cloud-native global access to your content to key stakeholders, including news media and corporate partners. And the best part? You can customize the look and feel of your portal to properly represent your brand. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab AI-Powered Application Suite Veritone ® Essentials TM is your fast and easy route to harnessing AI to analyze your data. Ingest, index, search and organize your audio, video and images to transform and extend the value of your media. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Intelligent, Rapid Suspect Identification Veritone ® IDentify TM allows law enforcement agencies to harness the power of your booking databases to identify suspects faster. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Previous Tab Intelligent Audio & Video Evidence Redaction Veritone ® Redact TM saves time and increases productivity by using artificial intelligence to automate the redaction of faces and sensitive information within audio, video and image-based evidence. Next Tab Tab0 Tab1 Tab2 Tab3 Tab4 Tab5 Veritone Attribute Veritone Core Veritone Digital Media Hub Veritone Essentials Veritone IDentify Veritone Redact Veritone offers a suite of applications and best-of-breed technologies for you to organize, manage, search, analyze and extend cognitively enriched content. Intelligent, Real-Time Media Attribution for Radio Broadcasters With Veritone ® Attribute TM , you can analyze and enhance the effectiveness of broadcast advertising to drive customer investment. As a radio broadcaster, you can offer advertisers near-real-time ad performance analytics on their native and prerecorded campaigns. Complete Digital Asset Management and Monetization Veritone ® Core TM is a cloud-native digital asset management (DAM) system used to manage, share and monetize content. Capable of ingesting large amounts of assets across a broad range of audio, video and still image formats, Core leverages the power of aiWARE to automatically enrich the metadata of every asset ingested. Your Own Branded Dam Veritone ® Digital Media Hub TM is an intuitive web portal through which you can offer secure, cloud-native global access to your content to key stakeholders, including news media and corporate partners. And the best part? You can customize the look and feel of your portal to properly represent your brand. Veritone ® Essentials TM is your fast and easy route to harnessing AI to analyze your data. Ingest, index, search and organize your audio, video and images to transform and extend the value of your media. Intelligent, Rapid Suspect Identification Veritone ® IDentify TM allows law enforcement agencies to harness the power of your booking databases to identify suspects faster. Intelligent Audio & Video Evidence Redaction Veritone ® Redact TM saves time and increases productivity by using artificial intelligence to automate the redaction of faces and sensitive information within audio, video and image-based evidence. Veritone Digital Media Hub Develop with Us Calling all machine learning developers, application developers, data licensors and system integrators. Every business has its unique challenges. With Veritone Developer, leverage a sales channel to monetize your AI software products, add intelligent features to your applications and build bespoke, AI-powered solutions for your customers. GET STARTED TODAY Calling all machine learning developers, application developers, data licensors and system integrators. Every business has its unique challenges. With Veritone Developer, leverage a sales channel to monetize your AI software products, add intelligent features to your applications and build bespoke, AI-powered solutions for your customers. Artificial intelligence offers the opportunity to extract dramatically more value from data in ways that were previously impossible, and even unimaginable in some cases. By providing a platform for our cognitive engines, Veritone has emerged as a leader in AI and we're proud to be part of their ecosystem of AI engines. Kirk Arthur Worldwide Industry Solutions, Public Safety & Justice at Microsoft Artificial intelligence offers the opportunity to extract dramatically more value from data in ways that were previously impossible, and even unimaginable in some cases. By providing a platform for our cognitive engines, Veritone has emerged as a leader in AI and we're proud to be part of their ecosystem of AI engines. Kirk Arthur Worldwide Industry Solutions, Public Safety & Justice at Microsoft Kirk Arthur Worldwide Industry Solutions, Public Safety & Justice at Microsoft Partnering with Veritone differentiates your business Collaborating with Veritone makes artificial intelligence accessible to your customers. You get seamless integrations, innovative technologies and the ability to deliver the power of AI at scale. Partnering with Veritone differentiates your business Collaborating with Veritone makes artificial intelligence accessible to your customers. You get seamless integrations, innovative technologies and the ability to deliver the power of AI at scale. Veritone Blog - Insights Stay abreast of the latest Veritone news, events, and product insights. Veritone® Launches VeriAdsâ\"¢, a New Suite of AI-Enabled Ad Revenue Solutions for Radio and TV Broadcasters, Podcasters and Social Media Influencers Read More Five Tips for New Attribution Clients Read More TechBytes with Ryan Steelberg, President at Veritone Read More READ MORE Veritone Blog - Insights Stay abreast of the latest Veritone news, events, and product insights. Stay abreast of the latest Veritone news, events, and product insights. Upcoming Events 13 December 2019 event Is the market finally ready for mass AI adoption? 23 December 2019 webinar WEBINAR ON DEMAND: The Growing Use of Audio Preservation and Collection 26 December 2019 webinar WEBINAR ON DEMAND: The Growing Use of Audio Preservation & Collection Is the market finally ready for mass AI adoption? WEBINAR ON DEMAND: The Growing Use of Audio Preservation and Collection WEBINAR ON DEMAND: The Growing Use of Audio Preservation & Collection 06 What Partners Say 07 Partner with Us",
    "Empowering industries starts with empowering people. Find the clue that solves the case, unlock new revenue streams with your media content, or find the best people to supercharge your teams — this is AI that makes you even better. Commercial Public Sector Talent Acquisition Other industries Get more from your media. Your audio and video content holds immense value—but its full potential remains untapped if it's unstructured, unsearchable, or difficult to access. Most organizations don't treat media as data, creating inefficiencies and missed opportunities—Veritone changes that. More about Commercial Hubbard Radio St. Louis Using AI to prove performance, earning $70K. ATTRIBUTION INSIGHTS Less taskwork, more time to serve. Automate lengthy and tedious manual processes with powerful AI solutions made for law enforcement agencies and legal teams. Veritone's AI for the public sector can save hundreds of hours so they can spend more time keeping communities safe. More about Public Sector Pasadena Police Department See how the Pasadena Police Department turned two weeks of redaction time into two days with AI. PUBLIC SAFETY PRODUCTIVITY Superhuman Resources start here. Empower your talent acquisition team to find the best-fit candidates even faster with AI tools that optimize ad spend and hiring workflows. This is hiring as you've never seen it before. More about Talent Acquisition Dominos How a franchise of the global pizza leader increased their talent pipeline while reducing their costs. RETAIL TALENT ACQUISITION AI solutions, ready for all. Whether it's in healthcare, finance, retail, or another field, our AI solutions have helped businesses elevate what they are capable of doing. With these tools, countless businesses have grown their revenue, increased efficiency, and delivered effective results for their customers. Explore other industries Healthcare Created a billing-centric platform enabling reduced administrative costs and optimized revenue. EFFECTIVENESS AUTOMATION Custom AI, built for you. Build, implement, and deploy enterprise AI that was developed to fit your organization's needs. Our team will develop a customized solution to meet your goals, from specially designed workflows to end-user applications. Let's get started aiWARE. The OS for AI. Veritone aiWARE is a customizable platform designed to fit your organization's unique needs and objectives. We've helped some of the world's biggest brands turn data into intelligence with ultimate efficiency, and we can do the same for you. AI for good. We believe in AI that can help people achieve greater potential than ever before. Our core set of principles guides every decision we make, making sure our technology isn't just AI, it's AI for a better world. Read our philosophy Latest updates. . Only show updates from Veritone Follow for more . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… . Veritone @veritone-inc We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. . Veritone @veritone-inc Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… . Veritone @veritone-inc Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! . Veritone @veritone-inc We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. . Veritone @veritone-inc The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… . Veritone @veritone-inc We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. . Veritone @veritone-inc Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… . Veritone @veritone-inc Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! . Veritone @veritone-inc We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. . Veritone @veritone-inc The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… Adopt AI that brings out the best in your teams. Ready for proven, trusted enterprise AI solutions that can turn possibilities into profits, deliver better results, and make your people better than ever before? Let's join forces Empowering industries starts with empowering people. Find the clue that solves the case, unlock new revenue streams with your media content, or find the best people to supercharge your teams — this is AI that makes you even better. Empowering industries starts with empowering people. Commercial Public Sector Talent Acquisition Other industries Get more from your media. Your audio and video content holds immense value—but its full potential remains untapped if it's unstructured, unsearchable, or difficult to access. Most organizations don't treat media as data, creating inefficiencies and missed opportunities—Veritone changes that. More about Commercial Hubbard Radio St. Louis Using AI to prove performance, earning $70K. ATTRIBUTION INSIGHTS Less taskwork, more time to serve. Automate lengthy and tedious manual processes with powerful AI solutions made for law enforcement agencies and legal teams. Veritone's AI for the public sector can save hundreds of hours so they can spend more time keeping communities safe. More about Public Sector Pasadena Police Department See how the Pasadena Police Department turned two weeks of redaction time into two days with AI. PUBLIC SAFETY PRODUCTIVITY Superhuman Resources start here. Empower your talent acquisition team to find the best-fit candidates even faster with AI tools that optimize ad spend and hiring workflows. This is hiring as you've never seen it before. More about Talent Acquisition Dominos How a franchise of the global pizza leader increased their talent pipeline while reducing their costs. RETAIL TALENT ACQUISITION AI solutions, ready for all. Whether it's in healthcare, finance, retail, or another field, our AI solutions have helped businesses elevate what they are capable of doing. With these tools, countless businesses have grown their revenue, increased efficiency, and delivered effective results for their customers. Explore other industries Healthcare Created a billing-centric platform enabling reduced administrative costs and optimized revenue. EFFECTIVENESS AUTOMATION Get more from your media. Your audio and video content holds immense value—but its full potential remains untapped if it's unstructured, unsearchable, or difficult to access. Most organizations don't treat media as data, creating inefficiencies and missed opportunities—Veritone changes that. Hubbard Radio St. Louis Using AI to prove performance, earning $70K. Less taskwork, more time to serve. Automate lengthy and tedious manual processes with powerful AI solutions made for law enforcement agencies and legal teams. Veritone's AI for the public sector can save hundreds of hours so they can spend more time keeping communities safe. See how the Pasadena Police Department turned two weeks of redaction time into two days with AI. Superhuman Resources start here. Empower your talent acquisition team to find the best-fit candidates even faster with AI tools that optimize ad spend and hiring workflows. This is hiring as you've never seen it before. How a franchise of the global pizza leader increased their talent pipeline while reducing their costs. AI solutions, ready for all. Whether it's in healthcare, finance, retail, or another field, our AI solutions have helped businesses elevate what they are capable of doing. With these tools, countless businesses have grown their revenue, increased efficiency, and delivered effective results for their customers. Created a billing-centric platform enabling reduced administrative costs and optimized revenue. Custom AI, built for you. Build, implement, and deploy enterprise AI that was developed to fit your organization's needs. Our team will develop a customized solution to meet your goals, from specially designed workflows to end-user applications. Let's get started Custom AI, built for you. Build, implement, and deploy enterprise AI that was developed to fit your organization's needs. Our team will develop a customized solution to meet your goals, from specially designed workflows to end-user applications. aiWARE. The OS for AI. Veritone aiWARE is a customizable platform designed to fit your organization's unique needs and objectives. We've helped some of the world's biggest brands turn data into intelligence with ultimate efficiency, and we can do the same for you. AI for good. We believe in AI that can help people achieve greater potential than ever before. Our core set of principles guides every decision we make, making sure our technology isn't just AI, it's AI for a better world. Read our philosophy aiWARE. The OS for AI. Veritone aiWARE is a customizable platform designed to fit your organization's unique needs and objectives. We've helped some of the world's biggest brands turn data into intelligence with ultimate efficiency, and we can do the same for you. We believe in AI that can help people achieve greater potential than ever before. Our core set of principles guides every decision we make, making sure our technology isn't just AI, it's AI for a better world. Latest updates. . Only show updates from Veritone Follow for more . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… . Veritone @veritone-inc We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. . Veritone @veritone-inc Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… . Veritone @veritone-inc Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! . Veritone @veritone-inc We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. . Veritone @veritone-inc The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… . Veritone @veritone-inc We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. . Veritone @veritone-inc Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… . Veritone @veritone-inc Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! . Veritone @veritone-inc We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. . Veritone @veritone-inc The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… . Veritone @veritone-inc We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. . Veritone @veritone-inc Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. . Veritone @veritone-inc We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… . Veritone @veritone-inc In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… Only show updates from Veritone We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… We're thrilled to announce that Veritone's Sean King will be joining an incredible panel at IBC – International Broadcasting Convention to discuss the future of sustainability in the media industry. Just ONE WEEK until Veritone Hire brings AI-powered hiring innovation to the HR Tech Conference in Las Vegas (September 16-18)! 🌟 Here's why you'll want to visit us at booth #5832… Through Veritone Data Refinery (VDR), we processed an astonishing estimated 5 trillion tokens in Q2 2025! We're not only digitizing content for the sake of preservation, we're also bringing it to life in ways that were previously unimaginable. By partnering with MEMNON , we're revolutionizing how content owners can access, search, and utilize their archives. The Department of the Navy Chief Information Officer (DON CIO) announcement on containerization technology usage marks a pivotal moment for defense IT modernization. By mandating containerization for cloud-enabled software… We are proud to introduce Contact Analytics, an enhancement to our Contact solution that provides California law enforcement with near real-time data insights to help strengthen public trust. Veritone is proud to announce that our Illuminate, Redact, and Track AI solutions have achieved \"Awardable\" status on the Department of Defense's Tradewinds Solutions Marketplace! This designation streamlines procurement for defense and law enforcement agencies, empowering them with cutting-edge AI tools for data analysis, redaction, and digital video analytics. Our solutions are designed to enhance national security, investigative workflows, and intelligence operations, providing critical capabilities to rapidly analyze and manage data with speed, accuracy, and security. We are pleased to share that Veritone has renewed and expanded its exclusive global licensing agreement with CBS News and Stations ! The expanded multi-year contract renewal now includes exclusive local news content from CBS… In his recent article on Apple News, \"The Looming AI Data Crisis: A Call for Ethical Innovation,\" Veritone CEO Ryan Steelberg discusses the exhaustion of high-quality data and the limitations of synthetic alternatives… Adopt AI that brings out the best in your teams. Ready for proven, trusted enterprise AI solutions that can turn possibilities into profits, deliver better results, and make your people better than ever before? Let's join forces Adopt AI that brings out the best in your teams. Ready for proven, trusted enterprise AI solutions that can turn possibilities into profits, deliver better results, and make your people better than ever before?"
  ]
}