{
  "company": "www.nec.co.nz",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "NEC Face Recognition Technology Ranks First in World NEC's technology ranked No. 1 for fifth time READ MORE Communications & Security NEC is a world leader in network solutions, microwave technologies and cyber security Biometrics NEC is the global leader in the field of biometric authentication covering six key areas Transportation Solutions include integrated ticketing and automated fare collection to passenger information systems Field Services Our field services engineers are our team on the ground delivering networking and carrier solutions High Performance Computing With the in-house knowledge and commitment to High Performance Computing, NEC continues to innovate Accelerate your Digital Business With Our Solutions Access & Authentication NEC's access and authentication systems are implemented by a wide range of companies and government agencies. Customer Experience NEC's NeoFace Welcome provides a new and unique visitor welcome that is personalised customer experience. Digital Identity NEC's face recognition solutions have used by many counties around the world to identify and verify well over a billion people. Safety & Security NEC has deep expertise and offers a wide range of security and surveillance solutions including world-leading NeoFace Watch Wireless Transport NEC is the leading global provider of point-to-point microwave solutions, delivering wireless transport solutions for over 30 years. Latest News at NEC Publications & Media How Enhanced Video Analytics (EVA) is changing the world in which we live Published 17/12/2019 Read more Publications & Media Cyber Security Incident Response Steps – How to prepare for a cybersecurity incident Published 10/12/2019 Read more Publications & Media How Fingerprint Recognition has changed the world and what the future holds Published 03/12/2019 Read more Publications & Media Facial Recognition in 2020 – 8 trends to watch out for Published 25/11/2019 Read more View more Partner Ecosystem Juniper Networks Infinera DXC Palo Alto Need Assistance? Talk to our experts today CONTACT US NEC Face Recognition Technology Ranks First in World NEC's technology ranked No. 1 for fifth time READ MORE Communications & Security NEC is a world leader in network solutions, microwave technologies and cyber security Biometrics NEC is the global leader in the field of biometric authentication covering six key areas Transportation Solutions include integrated ticketing and automated fare collection to passenger information systems Field Services Our field services engineers are our team on the ground delivering networking and carrier solutions High Performance Computing With the in-house knowledge and commitment to High Performance Computing, NEC continues to innovate Accelerate your Digital Business With Our Solutions Access & Authentication NEC's access and authentication systems are implemented by a wide range of companies and government agencies. Customer Experience NEC's NeoFace Welcome provides a new and unique visitor welcome that is personalised customer experience. Digital Identity NEC's face recognition solutions have used by many counties around the world to identify and verify well over a billion people. Safety & Security NEC has deep expertise and offers a wide range of security and surveillance solutions including world-leading NeoFace Watch Wireless Transport NEC is the leading global provider of point-to-point microwave solutions, delivering wireless transport solutions for over 30 years. Latest News at NEC Publications & Media How Enhanced Video Analytics (EVA) is changing the world in which we live Published 17/12/2019 Read more Publications & Media Cyber Security Incident Response Steps – How to prepare for a cybersecurity incident Published 10/12/2019 Read more Publications & Media How Fingerprint Recognition has changed the world and what the future holds Published 03/12/2019 Read more Publications & Media Facial Recognition in 2020 – 8 trends to watch out for Published 25/11/2019 Read more View more Partner Ecosystem Juniper Networks Infinera DXC Palo Alto Need Assistance? Talk to our experts today CONTACT US NEC Face Recognition Technology Ranks First in World NEC's technology ranked No. 1 for fifth time READ MORE NEC Face Recognition Technology Ranks First in World NEC's technology ranked No. 1 for fifth time Communications & Security NEC is a world leader in network solutions, microwave technologies and cyber security Biometrics NEC is the global leader in the field of biometric authentication covering six key areas NEC is a world leader in network solutions, microwave technologies and cyber security NEC is the global leader in the field of biometric authentication covering six key areas Transportation Solutions include integrated ticketing and automated fare collection to passenger information systems Field Services Our field services engineers are our team on the ground delivering networking and carrier solutions High Performance Computing With the in-house knowledge and commitment to High Performance Computing, NEC continues to innovate Solutions include integrated ticketing and automated fare collection to passenger information systems Our field services engineers are our team on the ground delivering networking and carrier solutions With the in-house knowledge and commitment to High Performance Computing, NEC continues to innovate Accelerate your Digital Business With Our Solutions Access & Authentication NEC's access and authentication systems are implemented by a wide range of companies and government agencies. Customer Experience NEC's NeoFace Welcome provides a new and unique visitor welcome that is personalised customer experience. Digital Identity NEC's face recognition solutions have used by many counties around the world to identify and verify well over a billion people. Safety & Security NEC has deep expertise and offers a wide range of security and surveillance solutions including world-leading NeoFace Watch Wireless Transport NEC is the leading global provider of point-to-point microwave solutions, delivering wireless transport solutions for over 30 years. NEC's access and authentication systems are implemented by a wide range of companies and government agencies. NEC's NeoFace Welcome provides a new and unique visitor welcome that is personalised customer experience. NEC's face recognition solutions have used by many counties around the world to identify and verify well over a billion people. NEC has deep expertise and offers a wide range of security and surveillance solutions including world-leading NeoFace Watch NEC is the leading global provider of point-to-point microwave solutions, delivering wireless transport solutions for over 30 years. Latest News at NEC Publications & Media How Enhanced Video Analytics (EVA) is changing the world in which we live Published 17/12/2019 Read more Publications & Media Cyber Security Incident Response Steps – How to prepare for a cybersecurity incident Published 10/12/2019 Read more Publications & Media How Fingerprint Recognition has changed the world and what the future holds Published 03/12/2019 Read more Publications & Media Facial Recognition in 2020 – 8 trends to watch out for Published 25/11/2019 Read more View more Latest News at NEC How Enhanced Video Analytics (EVA) is changing the world in which we live Cyber Security Incident Response Steps – How to prepare for a cybersecurity incident How Fingerprint Recognition has changed the world and what the future holds Facial Recognition in 2020 – 8 trends to watch out for Partner Ecosystem Juniper Networks Infinera DXC Palo Alto Need Assistance? Talk to our experts today CONTACT US Need Assistance? Talk to our experts today",
    "Game Changing Technology for Retailers Less Crime – Safer Staff – Better Customer Experience Intelligent Transportation Enhance your fleet with intelligent NEC solutions successfully supporting operators, drivers and passengers across the globe. Accelerate Your Business with NEC Solutions Access & Authentication Critical Communications & Secure Networks Digital Identity Safety & Security Digital Government and Smart Transport Customer Experience Biometrics NEC is the global leader in the field of biometric authentication covering six key areas. Digital Identity Trusted to identify and verify well over a billion people around the world. Intelligent Transportation Enhance your fleet with intelligent NEC solutions successfully supporting operators, drivers and passengers across the globe. Communications & Security NEC is a world leader in network solutions, critical communications, radio and microwave technologies, and cyber security. What makes NEC so exciting? In a world of endless possibility, we're driven to push the boundaries of innovation. By harnessing cutting-edge technology and exceptional talent, we're shaping the future—always with security, ethics, and sustainability at our core. At the intersection of progress and responsibility, we're transforming everyday experiences with purpose and trust. Watch our video and find out more about NEC. Latest News at NEC General NEC Face Recognition Technology Ranks First in NIST Accuracy Testing Published 08/02/2024 Read more General NEC Launches new system using Biometric Authentication Technology Published 31/10/2024 Read more General NEC named a Top Global Innovator for 13th year Published 18/03/2024 Read more VIEW MORE Partner Ecosystem Juniper Networks Infinera Palo Alto Papercast NEED ASSISTANCE? Contact our experts today CONTACT US Game Changing Technology for Retailers Less Crime – Safer Staff – Better Customer Experience Intelligent Transportation Enhance your fleet with intelligent NEC solutions successfully supporting operators, drivers and passengers across the globe. Accelerate Your Business with NEC Solutions Access & Authentication Critical Communications & Secure Networks Digital Identity Safety & Security Digital Government and Smart Transport Customer Experience Biometrics NEC is the global leader in the field of biometric authentication covering six key areas. Digital Identity Trusted to identify and verify well over a billion people around the world. Intelligent Transportation Enhance your fleet with intelligent NEC solutions successfully supporting operators, drivers and passengers across the globe. Communications & Security NEC is a world leader in network solutions, critical communications, radio and microwave technologies, and cyber security. What makes NEC so exciting? In a world of endless possibility, we're driven to push the boundaries of innovation. By harnessing cutting-edge technology and exceptional talent, we're shaping the future—always with security, ethics, and sustainability at our core. At the intersection of progress and responsibility, we're transforming everyday experiences with purpose and trust. Watch our video and find out more about NEC. Latest News at NEC General NEC Face Recognition Technology Ranks First in NIST Accuracy Testing Published 08/02/2024 Read more General NEC Launches new system using Biometric Authentication Technology Published 31/10/2024 Read more General NEC named a Top Global Innovator for 13th year Published 18/03/2024 Read more VIEW MORE Partner Ecosystem Juniper Networks Infinera Palo Alto Papercast NEED ASSISTANCE? Contact our experts today CONTACT US Accelerate Your Business with NEC Solutions Critical Communications & Secure Networks Digital Government and Smart Transport NEC is the global leader in the field of biometric authentication covering six key areas. Trusted to identify and verify well over a billion people around the world. Enhance your fleet with intelligent NEC solutions successfully supporting operators, drivers and passengers across the globe. NEC is a world leader in network solutions, critical communications, radio and microwave technologies, and cyber security. What makes NEC so exciting? In a world of endless possibility, we're driven to push the boundaries of innovation. By harnessing cutting-edge technology and exceptional talent, we're shaping the future—always with security, ethics, and sustainability at our core. At the intersection of progress and responsibility, we're transforming everyday experiences with purpose and trust. Watch our video and find out more about NEC. Latest News at NEC NEC Face Recognition Technology Ranks First in NIST Accuracy Testing NEC Launches new system using Biometric Authentication Technology NEC named a Top Global Innovator for 13th year NEED ASSISTANCE? Contact our experts today CONTACT US Contact our experts today"
  ]
}