{
  "company": "www.tuya.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 30
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 30
    }
  },
  "sample_docs": [
    "Solutions & Products Power Accessories Smart Plug Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioner Heater Water Heater Heated Blanket Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance Equipment Security Camera Kitchen Applicances Milk Maker Smart Oven About Us About Tuya Smart Advantage Cooperation Countries and regions covered The Only Globally Deployed Smart Cloud Covering Asia-pacific, North/South America, Europe, etc., supporting millions of users concurrent at the same time. Flexibly Optional App Solutions Standard App can be used directly. OEM and the customization based on SDK are supported. Distribution network within 30s, low-power design, ultra-high device compatibility. The Only Globally Deployed Smart Cloud Covering Asia-pacific, North/South America, Europe, etc., supporting millions of users concurrent at the same time. Flexibly Optional App Solutions Standard App can be used directly. OEM and the customization based on SDK are supported. Distribution network within 30s, low-power design, ultra-high device compatibility. Power Accessories Power Accessories Free your hands, enjoy a smarter Life Smart Plug WATCH Switch WATCH Free your hands, enjoy a smarter Life Smart LED Lighting Smart LED Lighting Just transform your home light with a touch Light Bulb WATCH Just transform your home light with a touch Household Appliances Household Appliances Let your appliances start to care about you Air Conditioner WATCH Water Heater WATCH Heater WATCH Let your appliances start to care about you Environmental Health Environmental Health This is what the high life is all about Air Purifier WATCH Dehumidifier WATCH Water Purifier WATCH This is what the high life is all about Surveillance Equipment Surveillance Equipment Follow you at the end of eyes Security Camera WATCH Follow you at the end of eyes Kitchen Applicances Kitchen Applicances Your smart home is from the kitchen Smart Oven WATCH Milk Maker WATCH Your smart home is from the kitchen and Experience our products Explore three stages of an IoT journey and see how Tuya can help. Tuya Smart provides one-stop product development and services for generating or purchasing your own brand products: Quickly generate demo in 6 hours Mass production in 15 days Local legal and regulation compliance Tuya Smart provides Tuya Smart Cloud, Tuya Smart App and Embedded Modules to make your products smart effortlessly: Embedded modules based on multiple certifications Plug and play through global cloud deployment Tuya Smart provides various OEM or custom OEM smart products ordering that are widely sold across the globe: 10000+ suppliers with 30+ categories One App controls all smart devices Working perfectly with Amazon Alexa / Google Home / Google Nest / IFTTT Tuya Smart provides one-stop product development and services for generating or purchasing your own brand products: Quickly generate demo in 6 hours Mass production in 15 days Local legal and regulation compliance Tuya Smart provides Tuya Smart Cloud, Tuya Smart App and Embedded Modules to make your products smart effortlessly: Embedded modules based on multiple certifications Plug and play through global cloud deployment Tuya Smart provides various OEM or custom OEM smart products ordering that are widely sold across the globe: 10000+ suppliers with 30+ categories One App controls all smart devices Working perfectly with Amazon Alexa / Google Home / Google Nest / IFTTT",
    "And of course, Tuya Smart takes data security and privacy of personal information very seriously. To this end, we have adapted advanced security technology, including military-grade encryption, full-web HTTPS, virtual device, dynamic password, dual password and encrypted communication. 4655 Old Ironsides Dr., Ste 100, Santa Clara, CA 95054, USA 7 Floor, 3 Blvd., More Centre, 87 Gudun Rd., Xihu District, Hangzhou, PRC. Tel: +86 (571) 56038587 213, H Blvd., Bao'an ZhiGu Technology Park, Xixiang Rd., Bao'an District, Shenzhen, PRC. Tel: +86 (400) 159 4688",
    "Platforms & Services Smart Products Development Platform ã€TuyaGo】Smart Products Market Value-Added Services Products & Solutions Power Accessories Smart Plug Wi-Fi Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioning and Heating Heater Water Heaters and Purifiers Smart Fan Environmental Health Air Purifier Dehumidifier Robotic Vacuum Cleaner Surveillance/Smart Home Security Home Security Security Camera Kitchen Electronics Milk Maker Smart Oven Kettle About Us About Tuya Smart Advantage Cooperation Security and Compliance Develop Strategies for Your IoT Future",
    "Solutions & Products Power Accessories Smart Plug Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioner Heater Water Heater Heated Blanket Smart Fan Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance Equipment Security Camera Kitchen Applicances Milk Maker Smart Oven Water Cup Kettle About Us About Tuya Smart Advantage Cooperation Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building China-based Tuya Smart launches the fully upgraded global IoT platform Chinese IoT solutions provider Tuya Smart delivers insights into what the future portends at the World Internet Conference Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07",
    "Products & Services Platform & Services Value-Added Services Products & Solutions Power Accessories Smart Plug Wi-Fi Switch Smart LED Lighting Smart Bulb Household Appliances Air Conditioning and Heating Heater Water Heaters and Purifiers Heated Blanket Smart Fan Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance/Smart Home Security Home Security Security Camera Kitchen Electronics Milk Maker Smart Oven Water Cup Kettle About Us About Tuya Smart Advantage Cooperation Security and Compliance Develop Strategies for Your IoT Future"
  ]
}