{
  "company": "www.jumio.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.2244897959183673,
    "framing_surveillance": 0.0,
    "framing_market": 0.7755102040816326,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Face-based Biometrics Certified 3D Liveness Detection Selfie-based Authentication Trust the Global Leader in AI-Powered Identity Verification Jumio's AI-powered Trusted Identity as a Service connects to your product, app or service to verify your customers' real-world identities. With a simple ID scan and real-time selfie, Jumio lets you accurately and seamlessly know, verify and trust your customer. Optimize conversions Onboard good customers faster with a user-friendly, seamless customer experience. Deter and detect fraud Prevent online fraud and account takeover to create a safe, trusted online ecosystem. Meet compliance mandates Comply with regulations and directives including AML, KYC, GDPR and PSD2. Simplify authentication Replace outdated KBA and 2FA methods with a process as simple as taking a selfie. Trusted Identity & Authentication Solutions From onboarding verification to ongoing authentication, Jumio offers a complete solution to know, verify and trust your customers. Jumio ID Verification Determine if an ID is authentic and belongs to the user. Error-proof image capture Simple user experience Catch fake IDs get details Jumio Identity Verification Ensure that the person behind a transaction is who they say they are. Government-issued ID + selfie Liveness detection Compare ID photo to selfie get details Jumio Document Verification Easily scan documents even if folded, creased or crumpled. Meet KYC & AML directives Establish proof of residence Scan utility bills, bank statements and more get details Jumio Authentication Replace outdated KBA and 2FA with the simplicity and security of a selfie. Verify enrolled users Unlock access to passwords, accounts and other enrolled services Fast, secure and reliable get details New! Jumio Screening ID verification + complete AML screening and monitoring. Customizable risk screening Automated onboarding and ongoing monitoring Instant results and reduced false positives get details Ai the Jumio Way Learn how we deliver the highest verification accuracy in near-real-time using augmented intelligence and machine learning. Get Details Use Cases KBA Replacement User Onboarding Fraud Detection KYC & AML Verifying Users High-Risk Transactions Age Verification Explore All Use Cases Increasingly Recognized as the Industry Standard View All Jumio Takes the Stage The Lasting Impact of Cyberattacks and Data Breaches Watch Jumio's CEO, Robert Prigge, on the Discover Stage at Sibos London 2019, the world's premier financial services event. Over 200 million identities verified, and counting. Latest Blog Posts How Jumio Uses AI for Automatic Recognition of ID Documents KYC in Banking: Why Financial Institutions Must Perform Due Diligence What is a Digital Identity? How Jumio's Investment in AI is Delivering Big Results for Our Customers View All Latest News December 19, 2019 Jumio Donates $10,000 to Movember Foundation December 18, 2019 Kambista the First Peruvian Fintech to Use Facial Authentication, Powered by Jumio's AI-Driven Identity Verification Technology December 15, 2019 Jumio Wins Fraud & Compliance Solution of the Year at 2019 SBC Awards View All Latest Resources Guide/Whitepaper Trusted Identity From Start to Finish Guide/Whitepaper eKYC in APAC: How to Get it Right Read more... Guide/Whitepaper CCPA Readiness for Online Identity Verification Read more... View All Resources Face-based Biometrics Certified 3D Liveness Detection Selfie-based Authentication Trust the Global Leader in AI-Powered Identity Verification Jumio's AI-powered Trusted Identity as a Service connects to your product, app or service to verify your customers' real-world identities. With a simple ID scan and real-time selfie, Jumio lets you accurately and seamlessly know, verify and trust your customer. Optimize conversions Onboard good customers faster with a user-friendly, seamless customer experience. Deter and detect fraud Prevent online fraud and account takeover to create a safe, trusted online ecosystem. Meet compliance mandates Comply with regulations and directives including AML, KYC, GDPR and PSD2. Simplify authentication Replace outdated KBA and 2FA methods with a process as simple as taking a selfie. Trust the Global Leader in AI-Powered Identity Verification Jumio's AI-powered Trusted Identity as a Service connects to your product, app or service to verify your customers' real-world identities. With a simple ID scan and real-time selfie, Jumio lets you accurately and seamlessly know, verify and trust your customer. Onboard good customers faster with a user-friendly, seamless customer experience. Deter and detect fraud Prevent online fraud and account takeover to create a safe, trusted online ecosystem. Comply with regulations and directives including AML, KYC, GDPR and PSD2. Replace outdated KBA and 2FA methods with a process as simple as taking a selfie. Trusted Identity & Authentication Solutions From onboarding verification to ongoing authentication, Jumio offers a complete solution to know, verify and trust your customers. Jumio ID Verification Determine if an ID is authentic and belongs to the user. Error-proof image capture Simple user experience Catch fake IDs get details Jumio Identity Verification Ensure that the person behind a transaction is who they say they are. Government-issued ID + selfie Liveness detection Compare ID photo to selfie get details Jumio Document Verification Easily scan documents even if folded, creased or crumpled. Meet KYC & AML directives Establish proof of residence Scan utility bills, bank statements and more get details Jumio Authentication Replace outdated KBA and 2FA with the simplicity and security of a selfie. Verify enrolled users Unlock access to passwords, accounts and other enrolled services Fast, secure and reliable get details New! Jumio Screening ID verification + complete AML screening and monitoring. Customizable risk screening Automated onboarding and ongoing monitoring Instant results and reduced false positives get details Trusted Identity & Authentication Solutions From onboarding verification to ongoing authentication, Jumio offers a complete solution to know, verify and trust your customers. Determine if an ID is authentic and belongs to the user. Ensure that the person behind a transaction is who they say they are. Government-issued ID + selfie Compare ID photo to selfie Easily scan documents even if folded, creased or crumpled. Meet KYC & AML directives Establish proof of residence Scan utility bills, bank statements and more Replace outdated KBA and 2FA with the simplicity and security of a selfie. Unlock access to passwords, accounts and other enrolled services Fast, secure and reliable ID verification + complete AML screening and monitoring. Automated onboarding and ongoing monitoring Instant results and reduced false positives Ai the Jumio Way Learn how we deliver the highest verification accuracy in near-real-time using augmented intelligence and machine learning. Get Details Learn how we deliver the highest verification accuracy in near-real-time using augmented intelligence and machine learning. Use Cases KBA Replacement User Onboarding Fraud Detection KYC & AML Verifying Users High-Risk Transactions Age Verification Explore All Use Cases Increasingly Recognized as the Industry Standard View All Increasingly Recognized as the Industry Standard Jumio Takes the Stage The Lasting Impact of Cyberattacks and Data Breaches Watch Jumio's CEO, Robert Prigge, on the Discover Stage at Sibos London 2019, the world's premier financial services event. Jumio Takes the Stage Over 200 million identities verified, and counting. Latest Blog Posts How Jumio Uses AI for Automatic Recognition of ID Documents KYC in Banking: Why Financial Institutions Must Perform Due Diligence What is a Digital Identity? How Jumio's Investment in AI is Delivering Big Results for Our Customers View All Latest News December 19, 2019 Jumio Donates $10,000 to Movember Foundation December 18, 2019 Kambista the First Peruvian Fintech to Use Facial Authentication, Powered by Jumio's AI-Driven Identity Verification Technology December 15, 2019 Jumio Wins Fraud & Compliance Solution of the Year at 2019 SBC Awards View All How Jumio Uses AI for Automatic Recognition of ID Documents KYC in Banking: Why Financial Institutions Must Perform Due Diligence What is a Digital Identity? How Jumio's Investment in AI is Delivering Big Results for Our Customers December 19, 2019 Jumio Donates $10,000 to Movember Foundation December 18, 2019 Kambista the First Peruvian Fintech to Use Facial Authentication, Powered by Jumio's AI-Driven Identity Verification Technology December 15, 2019 Jumio Wins Fraud & Compliance Solution of the Year at 2019 SBC Awards Latest Resources Guide/Whitepaper Trusted Identity From Start to Finish Guide/Whitepaper eKYC in APAC: How to Get it Right Read more... Guide/Whitepaper CCPA Readiness for Online Identity Verification Read more... View All Resources Guide/Whitepaper Trusted Identity From Start to Finish Trusted Identity From Start to Finish Guide/Whitepaper eKYC in APAC: How to Get it Right Read more... eKYC in APAC: How to Get it Right Guide/Whitepaper CCPA Readiness for Online Identity Verification Read more... CCPA Readiness for Online Identity Verification"
  ]
}