{
  "company": "www.truekey.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 6,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 2
    }
  },
  "sample_docs": [
    "We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Simple and secure Sign-in is simple; Just type in your master password on the device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by a second authentication factor for safety. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Fingerprint Use your device's fingerprint reader to to the True Key app with a touch. 0 0 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 0 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Simple and secure Sign-in is simple; Just type in your master password on the device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by a second authentication factor for safety. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Fingerprint Use your device's fingerprint reader to to the True Key app with a touch. 0 0 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 0 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Sign-in is simple; Just type in your master password on the device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by a second authentication factor for safety. Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Start today, and store 15 passwords for free * The True Key app supports up to 10,000 Logins or passwords The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. Use your device's fingerprint reader to to the True Key app with a touch. Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. The websites you use, organized and at your fingertips from the moment you to your profile. Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. Microsoft Edge (extension only) Now add True Key to your browser This lets True Key eliminate the hassle of passwords by remembering and typing them for you. Now the True Key app can save your passwords and instantly log you in to your sites. Click Add Extension to add True Key to your browser. This allows True Key to auto-save and auto-fill passwords while you surf the web. * We ask for these permissions so that the True Key app can work where you need it to. Your private data is never shared or seen. Without the True Key browser extension, you won't be able to use the app or any of its features. Now the True Key app can save your passwords and instantly log you in to your sites. Just click the True Key icon above when you'd like to access your Launchpad. We've noticed you're using an older version of Internet Explorer. Unfortunately the True Key website only supports IE 9+ at this time. Please upgrade your browser or try on Chrome, Firefox or Safari.",
    "Use your face Use your fingerprint Use your devices How it works You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Simple and secure Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Face faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. 1 1 1 1 Fingerprint * Use your device's fingerprint reader to to the True Key app with a touch. 1 0 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 * View devices that support fingerprint login here Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Windows Face to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. 1 0 0 0 Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 0 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info Use your face Use your fingerprint Use your devices How it works You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Simple and secure Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Face faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. 1 1 1 1 Fingerprint * Use your device's fingerprint reader to to the True Key app with a touch. 1 0 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 * View devices that support fingerprint login here Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Windows Face to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. 1 0 0 0 Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 0 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important McAfee respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. Start today, and store 15 passwords for free * The True Key app supports up to 10,000 Logins or passwords faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. Use your device's fingerprint reader to to the True Key app with a touch. Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. The websites you use, organized and at your fingertips from the moment you to your profile. Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. Microsoft Edge (extension only) Now add True Key to your browser This lets True Key eliminate the hassle of passwords by remembering and typing them for you. Now the True Key app can save your passwords and instantly log you in to your sites. Click Add Extension to add True Key to your browser. This allows True Key to auto-save and auto-fill passwords while you surf the web. * We ask for these permissions so that the True Key app can work where you need it to. Your private data is never shared or seen. Without the True Key browser extension, you won't be able to use the app or any of its features. Now the True Key app can save your passwords and instantly log you in to your sites. Just click the True Key icon above when you'd like to access your Launchpad. We've noticed you're using an older version of Internet Explorer. Unfortunately the True Key website only supports IE 9+ at this time. Please upgrade your browser or try on Chrome, Firefox or Safari.",
    "Use your face Use your fingerprint Use your devices How it works You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important Intel Security respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Simple and secure Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. Additional security information For a technical briefing on the True Key app, download our white paper . If you are a security researcher and believe you have identified a security issue, you can report it to the Intel Security Incident Response team . Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Face faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. 1 1 1 1 Fingerprint * Use your device's fingerprint reader to to the True Key app with a touch. 1 0 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 * View devices that support fingerprint login here Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Windows Face to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. 1 0 0 0 Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Internet Explorer translation missing: en.home.index.features.internet_explorer.body 1 0 0 0 Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 1 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info Use your face Use your fingerprint Use your devices How it works You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. You choose how you We've added several ways you can — we call them factors. Don't feel comfortable using your face? Pick a different factor instead. We verify that it's you We always use at least two factors to verify it's you. You choose the first, and True Key verifies you're on a trusted device - multi-factor made easy. You can add extra security If you want more security, you can add additional factors when you to make your profile even stronger. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. We securely store your passwords Your passwords are stored locally on your device and synced to your profile using the strongest encryption available. You get instant access When you launch an app or visit a website, True Key auto-fills your passwords and logs in for you. You can use it everywhere True Key securely syncs across all your devices so you can access your information whenever you need it. Security How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important Intel Security respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, always Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Simple and secure Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. Additional security information For a technical briefing on the True Key app, download our white paper . If you are a security researcher and believe you have identified a security issue, you can report it to the Intel Security Incident Response team . Start today, and store 15 passwords for free Pricing Free $0 15 Passwords Premium $19.99/year Argentina (ARS) Australia (AUD) Brazil (BRL) Canada (CAD) Chile (CLP) Colombia (COP) Croatia (EUR) Czech Republic (CZK) Denmark (DKK) Finland (EUR) France (EUR) Germany (EUR) Greece (EUR) Hong Kong (HKD) Hungary (HUF) India (INR) Israel (ILS) Italy (EUR) Japan (JPY) Korea (KRW) Luxembourg (EUR) Malaysia (MYR) Mexico (MXN) Netherlands (EUR) New Zealand (NZD) Norway (NOK) Peru (PEN) Philippines (PHP) Poland (PLN) Portugal (EUR) Russia (RUB) Saudi Arabia (AED) Serbia (EUR) Singapore (SGD) Slovakia (EUR) South Africa (ZAR) Spain (EUR) Sweden (SEK) Switzerland (CHF) Taiwan (TWD) Turkey (TRY) United Kingdom (GBP) United States (USD) Venezuela (VEF) Unlimited Passwords * * The True Key app supports up to 10,000 Logins or passwords Features Ways you can PC Mac iOS Android Face faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. 1 1 1 1 Fingerprint * Use your device's fingerprint reader to to the True Key app with a touch. 1 0 1 1 2nd Device Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. 0 0 1 1 Master Password The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. 1 1 1 1 Email Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. 1 1 1 1 Trusted Device The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. 1 1 1 1 Windows Hello™ using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. 1 0 0 0 * View devices that support fingerprint login here Ways you can manage your info PC Mac iOS Android Launchpad The websites you use, organized and at your fingertips from the moment you to your profile. 1 1 1 1 Password Manager Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. 1 1 1 1 Digital Wallet Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. 1 1 1 1 Password Generator Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. 1 1 1 1 Additional features PC Mac iOS Android Windows Face to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. 1 0 0 0 Local Data Encryption All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. 1 1 1 1 Cross Device Sync Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. 1 1 1 1 Browsers* PC Mac iOS Android Internet Explorer translation missing: en.home.index.features.internet_explorer.body 1 0 0 0 Chrome translation missing: en.home.index.features.chrome.body 1 1 0 1 Firefox translation missing: en.home.index.features.firefox.body 1 1 0 1 Microsoft Edge (extension only) translation missing: en.home.index.features.edge.body 1 0 0 0 Safari translation missing: en.home.index.features.safari.body 0 0 1 0 * Supports latest versions Get more info How encryption keeps you safe The True Key app protects your passwords by scrambling them with AES-256, one of the strongest encryption algorithms available. Only you can decrypt and access your information with the factors you choose. Your privacy is important Intel Security respects your privacy. Your passwords belong only to you — accessible only by you. We never share or sell your data. Multi-factor authentication, or MFA, is standard with the True Key app. You'll always be verified by at least two factors before being signed in. Customize your profile by adding more factors — the more you add, the safer your profile becomes. Signing in can be as simple as using one factor that you choose — like your Face, Fingerprint or Master Password — on a device you trust. When not on a Trusted Device (a friend's phone, hotel computer), you'll be verified by two other factors you've chosen. For a technical briefing on the True Key app, download our white paper . If you are a security researcher and believe you have identified a security issue, you can report it to the Intel Security Incident Response team . Start today, and store 15 passwords for free * The True Key app supports up to 10,000 Logins or passwords faster, with your Face. The True Key app measures your unique facial math to sign you in with a look. Combine it with other factors for added security. Use your device's fingerprint reader to to the True Key app with a touch. Use a mobile phone or tablet as an additional factor. When you on your PC or Mac, the True Key app sends a notification to your iOS or Android 2nd device - just swipe the screen on your 2nd device to verify it's you. The only password you'll need to remember and you're the only one who has it. In addition to using this as one of your choices for factors to , you will use it to the first time you add the True Key app to a new device. Verify it's you with the click of a link. The True Key app will send an email to your inbox - just click on the link to verify it's you, as an additional factor. The factor we always use, and you don't even have to think about it. The True Key app recognizes which devices are yours - and notifies you if a is attempted on a device you haven't trusted. using Windows Hello. Exclusive to the True Key extension for Microsoft Edge. The websites you use, organized and at your fingertips from the moment you to your profile. Enter your login details once, and True Key does the rest. The app fills in your usernames and passwords and logs you in. It's that simple, and that fast. So you can get to the places you want to go. Store credit cards, IDs, passport numbers and other sensitive info - the personal info you sometimes need, secured and accessible to only you from any of your devices. Create long, strong passwords to protect each of your accounts. Your True Key app will remember them, so you don't have to. to your Windows PC with just a look. The same convenience as accessing your True Key profile, but for your entire Windows device. All of your information is stored locally on your device, and encrypted with best in class encryption when synced to your other devices. Use your True Key profile on all your devices - so you have fast access to the info you need on your computer, phone and tablets. Microsoft Edge (extension only) Now add True Key to your browser This lets True Key eliminate the hassle of passwords by remembering and typing them for you. Now the True Key app can save your passwords and instantly log you in to your sites. Click Add Extension to add True Key to your browser. This allows True Key to auto-save and auto-fill passwords while you surf the web. * We ask for these permissions so that the True Key app can work where you need it to. Your private data is never shared or seen. Without the True Key browser extension, you won't be able to use the app or any of its features. Now the True Key app can save your passwords and instantly log you in to your sites. Just click the True Key icon above when you'd like to access your Launchpad. We've noticed you're using an older version of Internet Explorer. Unfortunately the True Key website only supports IE 9+ at this time. Please upgrade your browser or try on Chrome, Firefox or Safari.",
    "On May 9, 2016, as part of the transition of McAfee into Intel Security, this Privacy Notice will be replaced with an updated version of the Intel Privacy Notice. to review the update. Read the FAQs for the Update of the McAfee Privacy Notice to the Intel Privacy Notice . If you have any questions, please contact privacy@mcafee.com . This Privacy Notice has been updated on November 21st, 2014 to reflect the relationship between Intel Security and McAfee, Inc. The prior update on March 20, 2014 added a link to our new Cookie Notice and made some edits for readability and clarity. This Notice provides information about data we use for security purposes and our commitment to using the personal data we collect in a respectful fashion. for our complete notice Privacy Notice Intel Security software and services (\"Softwareâ€) are provided by McAfee, Inc. - a wholly owned subsidiary of Intel Corporation (\"weâ€, \"usâ€, \"ourâ€). We care deeply about your privacy and security and your online safety is a significant part of our essential mission. We appreciate your decision to trust us with helping to protect your digital life from theft, disruption, and unauthorized access. This Privacy Notice is designed to inform you about how your personal information is collected, managed, and used to: Safeguard your devices and protect your data; Personalize and manage our relationship with you; Investigate, respond, and manage security related incidents and events; Improve security related products and services; and Predict future security threats and vulnerabilities. By collecting and processing data, we can help to predict threats and better protect you, your devices, and your information. We would like to help you understand how your data is processed, why it takes data to protect data, and our commitment to using the personal data we collect for the purposes discussed in this Notice. Every time you turn on a device, connect to a network or open a file, you are exposed to significant risk from hackers, spammers, malware, spyware, and other forms of unauthorized access to your data and systems. This is why it is important to use security products and services such as ours to keep you and your data safe. To defend against these threats and the thousands of new threats that emerge each day, our technologies may: Analyze data sent to/from your device(s) for risks, threats, vulnerabilities, suspicious activity, and attacks; Assess the reputation of the sending/receiving device to determine whether access should be allowed or if the transaction should be continued; Share data with threat intelligence networks to improve our products, services, and overall internet security; and Adapt responses to new threats based on intelligence collected from your device and our global network. Scope This Privacy Notice applies to personal information we obtain from individuals interacting with us and our websites, products, services, and applications. This Notice does not apply to personal information we obtain in our capacity as an employer; employment related data is covered under separate policies and/or notices. Notice We provide access to our Privacy Notice by: Linking to it throughout our websites; Referencing it in our of Use and End User License Agreements; and Incorporating it into our contracts, agreements, and other documents as necessary or appropriate. The Information We Collect We collect some information that is personal (i.e., information that identifies an individual either alone or in combination with other data). We also collect non-personal information that does not, on its own, identify an individual person. When non-personal information is combined with other information so that it does identify an individual person, we treat that combination as personally identifiable information. We obtain personal information when you or someone acting on your behalf provides it to us. We also collect information when you obtain or use our products or services or when you use a device with our products or services installed. The following are examples of the type of personal information that may be collected directly from you (or someone acting on your behalf): Contact information (including name, email address, social media ID/handle, mailing address, telephone, and fax number); Payment information (including payment card and bank account information); Shipping, billing, and other information provided in connection with the purchase or delivery of our products and services; Information about transactions with us (such as purchase history) and use of our products and services; Information provided by you through McAfee-related communication channels such as forums, technical support, and customer service; Username, password, and other information used to verify identity; and Photographs, images, biometrics, and related hash values. Details about your computers, devices, applications, and networks (including IP address, browser characteristics, device ID and characteristics, operating system, system language, and preferences); Activities on our websites and usage patterns of products and services (including referring URLs, dates and times of website visits, and clickstream data such as information commonly recorded in web server logs); Details about Internet or network usage (including URLs or domain names of websites you visit, information about applications that attempt to access your network, or traffic data); Data about files and communications, such as potential malware or spam (which may include computer files, emails and attachments, email addresses, metadata, and traffic data, or portions or hashes -- a hash file is a file that has been converted into a numerical string by a mathematical algorithm -- of any of this information); this may include similar information from third parties interacting with you; Other information used in the operation of our products and services (including information regarding the number of checked, suspicious, infected, or unwanted files or emails; number of actual infections); and Information that may be included in a virus or malware sample or a file submitted by you to us for review. IP Addresses An Internet Protocol address (IP address) is a numerical label assigned to each device (e.g., computer, printer, mobile phone, server) participating in a computer network that uses the Internet Protocol for communication. It is how devices find each other on a network. While it is possible that IP addresses can be associated with a single individual's device, they most often are associated with a group of systems, one system shared by many users, or a gateway into a group of systems or devices. For instance, IP addresses included in an email communication are typically associated with the respective email service provider and not with an individual user's device. Our security products and services use IP addresses to protect your information, your devices, and your data. For example, we may detect that a system or a group of systems associated with a particular IP address has been compromised and is sending malware or spam to some of our users. Even without identifying who owns the compromised system or who compromised it, we can assign a score to that IP address to reflect the heightened threat it poses. Our products and services can then divert your traffic away from this IP address or block this IP address from sending malware to your protected device before your device is a victim of an attack. We use \"cookies†to remember user preferences and to maximize the performance of our website and services. Additionally, cookies help us to identify returning users so, for example, we don't need to ask them to enter their email and password on every visit. Please note the information gathered by cookies is necessary to provide some of our services, including certain subscriptions. We cannot provide such services to users who do not give their consent to the data processing carried out through cookies or whose browsers are set to reject all cookies. For example, when you purchase a subscription to an online technology, a cookie is set that identifies the software, version, and when it expires. We use this information to alert you that a newer version is available or if your subscription is going to expire. Cookies may also be used to control the type and frequency of ads, promotions, or other marketing messages the customer views. These ads may be placed by us or third-party advertising companies which are our vendors. We also use \"web beacons†(small transparent image files) to count visitors to our sites and analyze how visitors use our sites. The information collected is generally anonymized and is not used to identify any particular user. We also maintain log files of the traffic on our sites. For example, our servers may automatically record the information you or your browser send when you visit a website. These log files may include information such as your requests, IP address, browser type, browser language, the date and time of your request, and one or more cookies that may uniquely identify your system. For more information about cookies and how we respond to \"do no track†signals, please see our Cookie Notice ( http://www.mcafee.com/common/privacy/english/cookie_notice/ ). Use of the Personal Information We Collect We use the information we collect in ways that serve your security needs and privacy preferences, including to: Provide threat prediction and protection products and services; Provide security advisories, information, and product updates; Conduct research and analysis (for example, market and consumer research, security research and analysis, and trend analysis); Analyze users' behavior when using our products and services to customize preferences; Establish and manage your accounts with us; Collect and process payments and complete transactions; Provide customer support, manage subscriptions, and respond to requests, questions and comments; Communicate about, and administer participation in, special events, programs, surveys, contests, sweepstakes, and other offers and promotions; Enable posting on our blogs and other communications; Customize, measure, and improve our websites, products, services, and advertising; Analyze and develop new products, services, and websites; Perform accounting, auditing, billing, reconciliation, and collection activities; Prevent detect, identify, investigate, respond, and protect against potential or actual claims, liabilities, prohibited behavior, and criminal activity; Comply with and enforce applicable legal requirements, agreements, and policies; and Perform other activities consistent with this Notice. Products and Services Data Processing If you install or use one of our products or services, software will operate in the background of your computer system or device environment to perform specific security and privacy tasks including: SPAM protection; Virus protection; Intrusion detection, prevention, and protection; Threat Prevention and Prediction; Network Defense; Data Encryption; Mobile Device Lockdown; Back-up and recovery activities; Product Updating and Reporting Our products and services may also process certain data to provide updates and reports. These update functions may check your system to see whether files relating to the services need to be refreshed or modernized. For example, products and services may transmit report files to McAfee. These files contain information, including the number of checked, suspicious, infected, or unwanted files or emails, the number of infections, the date and hash values of the detected infections, and the number of false negatives/false positives. The purpose of these reports is to analyze the frequency of particular infections or the prevalence of threats. McAfee also uses the information to adapt the product to conform to user preferences based on actual use. Personal Information We Share We may share personal information with: Other members of the Intel family of companies for the purposes described in this Privacy Notice, such as to: (i) provide services and joint content (e.g., registration, sales, and customer support); (ii) help detect and prevent potentially illegal acts and violations of our policies; and (iii) guide our decisions about our products, services, and communications; Authorized service providers and partners who perform services for us (including data storage, sales, marketing, fraud investigations, and bill collection) based on our instructions. These third parties may only use or disclose personal information obtained from us to perform services on our behalf or comply with legal obligations; Third parties with your consent. For example, co-marketing with a business partner or sharing limited information as necessary with researchers and analysts; and Other business entities legally related to Intel or any third party that may take over all or part of our functions in the future (provided that such party agrees to use such personal information in a manner that is consistent with this Privacy Notice). We may also disclose personal information: (i) if we are required to do so by law or legal process; (ii) in response to requests by government agencies, such as law enforcement authorities or other authorized third-parties; (iii) as may be required for purposes of national security; (iv) when we believe disclosure is necessary and appropriate to prevent physical, mental, financial, or other harm, injury, or loss; or (v) in connection with an investigation of suspected or actual illegal or inappropriate activity or exposure to liability. The Intel family companies may share personal information with each other and use it in a manner that is consistent with this Privacy Notice. We may also combine it with other information to provide and improve our products, services, content, and advertising. When we share personal information with a third party, they must contractually agree to comply with privacy and security standards at least as stringent as ours when we are handling similar data. When you provide data directly to the third party, the processing is based on their standards (which may not be the same as ours) and your own independent relationship with that provider. We do not share your personal information with non-affiliated third parties for their own marketing use without your permission. Security We use administrative, organizational, technical, and physical safeguards to protect the personal information we collect and process. Our security controls are designed to maintain an appropriate level of data confidentiality, integrity, and availability. We regularly test our website, data centers, systems, and other assets for security vulnerabilities. We handle payment card data in a manner consistent with the Payment Card Industry's Data Security Standards (PCI-DSS). For example, when you make a payment on our website using your credit card, we use SSL encryption for transmission of the credit card number. How You Can Manage and Control Your Personal Information We offer certain choices about how we communicate with our users and what personal information we obtain about them. Many of our products allow users to make choices about the personal information collected. You may choose not to receive marketing communications from us by clicking on the unsubscribe link or other instructions in our marketing emails, visiting the My Account ( https://home.mcafee.com/secure/protected/login.aspx ) section on our website, or contacting us as specified in the \"How to Contact Us†section below. Many of our products contain settings that allow users or administrators to control how the products collect information. Please refer to the relevant product manual or contact us through the appropriate technical support channel for assistance. To remove your personal information from a website testimonial that we control, please contact customer service ( http://service.mcafee.com/CustomerService.aspx?lc=1033&sg=CS&pt=1 ). If you chose to no longer receive marketing information, we may still communicate with you regarding such things as security updates, subscription notices, product functionality, responses to service requests, or other transactional, non-marketing/administrative related purposes. How You Can Access and Correct Inaccuracies You can access and correct the personal information in your profile by visiting My Account ( https://home.mcafee.com/secure/protected/login.aspx ). Alternatively, you may request reasonable access to your personal information by contacting us as indicated below. The time periods for which we retain your personal information depend on the purposes for which we use it. We will keep your personal information for as long as you are a registered subscriber or user of our products and, thereafter, for no longer than is required by law, or our Records Retention Policy, reasonably necessary for internal reporting and reconciliation purposes, or to provide you with feedback or information you might request. In certain circumstances, we may be required to retain data we have about you (such as for tax, litigation (threatened, anticipated, or actual), other business purposes, or if required by law enforcement). Storage of the Information We Collect From You The information we collect may be stored and processed in servers in the United States and wherever we and our service providers have facilities around the globe. We may transfer the personal information we obtain to countries other than the country in which the information originally was collected. Those countries may not have as comprehensive data protection laws as the country from which we initially obtained the information. When we transfer the information to other countries, we will protect that information as described in this Privacy Notice. Data Transfer We may transfer the personal information we obtain to countries other than the country in which the information originally was collected. Those countries may not have as comprehensive data protection laws as the country from which McAfee initially obtained the information. When we transfer the information to other countries, we will protect that information as described in this Privacy Notice. If you are located in the European Economic Area or Switzerland, we comply with applicable legal requirements providing adequate protection for the transfer of personal information to countries outside of the EEA or Switzerland. We are certified under the Safe Harbor Privacy Framework as set forth by the U.S. Department of Commerce, the European Commission and Switzerland regarding the collection, storage, use, transfer, and other processing of personal data transferred from the EEA or Switzerland to the U.S. ( http://safeharbor.export.gov/companyinfo.aspx?id=23562 ) to view our Safe Harbor Certification. We may update this Notice at any time by posting additions or modifications on this web page. If at any point we decide to use personal information in a manner materially different from that stated at the time it was collected, we will notify users by email, via a prominent notice on our website, or other such means. And, where required, we will seek appropriate consent prior to the new use. Links to Other Websites Our websites may contain links to other websites for your convenience and information. These websites may be operated by companies not affiliated with us. Linked websites may have their own privacy policies or notices, which we strongly suggest you review if you visit any linked websites. We are not responsible for the content of any websites that are not affiliated with us, any use of those websites, or the privacy practices of those websites. In certain circumstances, where the information of third parties is collected by us by virtue of the third-party's interaction with you such as the information of those individuals who send communications to your computer), we rely on you to provide the relevant third parties with appropriate notice and to obtain any requisite consent. You expressly consent to our processing of information as described in this Privacy Notice when you: Visit and/or provide information to us through our websites; Buy, license, and use our products or services and accept the of Use, End- User License Agreement, and Privacy Notice; or Sign a contract with us to purchase or subscribe to our products and services. In addition, by using and interacting with our products, services, or websites, you affirmatively consent to our collection and processing of personal information: (a) to provide the intended functionality of a product or service; (b) by automated means, such as cookies or web beacons; and (c) in accordance with this Privacy Notice. You also consent to the storage and transfer of the information to locations wherever we and our service providers have facilities, including the United States. Contact Us If you have questions or concerns regarding this Privacy Notice, or would like to update information we have about you or your preferences, please contact us by: Emailing the Privacy Program Office of McAfee, a part of Intel Security at privacy@mcafee.com Calling us at +1 972-963-7902 Writing to us at: Privacy Program Office –McAfee, A Part of Intel Security, 2821 Mission College Blvd Santa Clara, CA 95054 If you do not receive a prompt response, please contact the Consumer Privacy Response Team of McAfee, part of Intel Security, by Emailing consumerprivacyresponseteam@mcafee.com or Writing to: Consumer Privacy Response Team –McAfee, Part of Intel Security, 5000 Headquarters Drive Plano, Texas 75024 If you are located in the European Economic Area, please write to: Privacy Program Office –McAfee. Part of Intel Security. 26, Boulevard Royal 2449 Luxembourg, Luxembourg In addition to McAfee, Inc., the legal entity with which you have a business relationship is responsible for safeguarding your personal information. For the U.S., Mexico, Central America, South America, and the Caribbean: McAfee, Inc., 2821 Mission College Blvd., Santa Clara, California 95054 For Canada, Europe, the Middle East, Africa, Asia, and the Pacific Rim: McAfee Security S.A.R.L., 26, Boulevard Royal, 2449 Luxembourg, Luxembourg For Japan: McAfee Co., Ltd., Shibuya Mark City West Building 12-1, Dogenzaka 1-Chrome, Shibuya-ku, Tokyo 150-0043, Japan On May 9, 2016, as part of the transition of McAfee into Intel Security, this Privacy Notice will be replaced with an updated version of the Intel Privacy Notice. to review the update. Read the FAQs for the Update of the McAfee Privacy Notice to the Intel Privacy Notice . If you have any questions, please contact privacy@mcafee.com . This Privacy Notice has been updated on November 21st, 2014 to reflect the relationship between Intel Security and McAfee, Inc. The prior update on March 20, 2014 added a link to our new Cookie Notice and made some edits for readability and clarity. This Notice provides information about data we use for security purposes and our commitment to using the personal data we collect in a respectful fashion. for our complete notice Intel Security software and services (\"Softwareâ€) are provided by McAfee, Inc. - a wholly owned subsidiary of Intel Corporation (\"weâ€, \"usâ€, \"ourâ€). We care deeply about your privacy and security and your online safety is a significant part of our essential mission. We appreciate your decision to trust us with helping to protect your digital life from theft, disruption, and unauthorized access. This Privacy Notice is designed to inform you about how your personal information is collected, managed, and used to: Safeguard your devices and protect your data; Personalize and manage our relationship with you; Investigate, respond, and manage security related incidents and events; Improve security related products and services; and Predict future security threats and vulnerabilities. By collecting and processing data, we can help to predict threats and better protect you, your devices, and your information. We would like to help you understand how your data is processed, why it takes data to protect data, and our commitment to using the personal data we collect for the purposes discussed in this Notice. Every time you turn on a device, connect to a network or open a file, you are exposed to significant risk from hackers, spammers, malware, spyware, and other forms of unauthorized access to your data and systems. This is why it is important to use security products and services such as ours to keep you and your data safe. To defend against these threats and the thousands of new threats that emerge each day, our technologies may: Analyze data sent to/from your device(s) for risks, threats, vulnerabilities, suspicious activity, and attacks; Assess the reputation of the sending/receiving device to determine whether access should be allowed or if the transaction should be continued; Share data with threat intelligence networks to improve our products, services, and overall internet security; and Adapt responses to new threats based on intelligence collected from your device and our global network. This Privacy Notice applies to personal information we obtain from individuals interacting with us and our websites, products, services, and applications. This Notice does not apply to personal information we obtain in our capacity as an employer; employment related data is covered under separate policies and/or notices. We provide access to our Privacy Notice by: Linking to it throughout our websites; Referencing it in our of Use and End User License Agreements; and Incorporating it into our contracts, agreements, and other documents as necessary or appropriate. The Information We Collect We collect some information that is personal (i.e., information that identifies an individual either alone or in combination with other data). We also collect non-personal information that does not, on its own, identify an individual person. When non-personal information is combined with other information so that it does identify an individual person, we treat that combination as personally identifiable information. We obtain personal information when you or someone acting on your behalf provides it to us. We also collect information when you obtain or use our products or services or when you use a device with our products or services installed. The following are examples of the type of personal information that may be collected directly from you (or someone acting on your behalf): Contact information (including name, email address, social media ID/handle, mailing address, telephone, and fax number); Payment information (including payment card and bank account information); Shipping, billing, and other information provided in connection with the purchase or delivery of our products and services; Information about transactions with us (such as purchase history) and use of our products and services; Information provided by you through McAfee-related communication channels such as forums, technical support, and customer service; Username, password, and other information used to verify identity; and Photographs, images, biometrics, and related hash values. Details about your computers, devices, applications, and networks (including IP address, browser characteristics, device ID and characteristics, operating system, system language, and preferences); Activities on our websites and usage patterns of products and services (including referring URLs, dates and times of website visits, and clickstream data such as information commonly recorded in web server logs); Details about Internet or network usage (including URLs or domain names of websites you visit, information about applications that attempt to access your network, or traffic data); Data about files and communications, such as potential malware or spam (which may include computer files, emails and attachments, email addresses, metadata, and traffic data, or portions or hashes -- a hash file is a file that has been converted into a numerical string by a mathematical algorithm -- of any of this information); this may include similar information from third parties interacting with you; Other information used in the operation of our products and services (including information regarding the number of checked, suspicious, infected, or unwanted files or emails; number of actual infections); and Information that may be included in a virus or malware sample or a file submitted by you to us for review. An Internet Protocol address (IP address) is a numerical label assigned to each device (e.g., computer, printer, mobile phone, server) participating in a computer network that uses the Internet Protocol for communication. It is how devices find each other on a network. While it is possible that IP addresses can be associated with a single individual's device, they most often are associated with a group of systems, one system shared by many users, or a gateway into a group of systems or devices. For instance, IP addresses included in an email communication are typically associated with the respective email service provider and not with an individual user's device. Our security products and services use IP addresses to protect your information, your devices, and your data. For example, we may detect that a system or a group of systems associated with a particular IP address has been compromised and is sending malware or spam to some of our users. Even without identifying who owns the compromised system or who compromised it, we can assign a score to that IP address to reflect the heightened threat it poses. Our products and services can then divert your traffic away from this IP address or block this IP address from sending malware to your protected device before your device is a victim of an attack. We use \"cookies†to remember user preferences and to maximize the performance of our website and services. Additionally, cookies help us to identify returning users so, for example, we don't need to ask them to enter their email and password on every visit. Please note the information gathered by cookies is necessary to provide some of our services, including certain subscriptions. We cannot provide such services to users who do not give their consent to the data processing carried out through cookies or whose browsers are set to reject all cookies. For example, when you purchase a subscription to an online technology, a cookie is set that identifies the software, version, and when it expires. We use this information to alert you that a newer version is available or if your subscription is going to expire. Cookies may also be used to control the type and frequency of ads, promotions, or other marketing messages the customer views. These ads may be placed by us or third-party advertising companies which are our vendors. We also use \"web beacons†(small transparent image files) to count visitors to our sites and analyze how visitors use our sites. The information collected is generally anonymized and is not used to identify any particular user. We also maintain log files of the traffic on our sites. For example, our servers may automatically record the information you or your browser send when you visit a website. These log files may include information such as your requests, IP address, browser type, browser language, the date and time of your request, and one or more cookies that may uniquely identify your system. For more information about cookies and how we respond to \"do no track†signals, please see our Cookie Notice ( http://www.mcafee.com/common/privacy/english/cookie_notice/ ). Use of the Personal Information We Collect We use the information we collect in ways that serve your security needs and privacy preferences, including to: Provide threat prediction and protection products and services; Provide security advisories, information, and product updates; Conduct research and analysis (for example, market and consumer research, security research and analysis, and trend analysis); Analyze users' behavior when using our products and services to customize preferences; Establish and manage your accounts with us; Collect and process payments and complete transactions; Provide customer support, manage subscriptions, and respond to requests, questions and comments; Communicate about, and administer participation in, special events, programs, surveys, contests, sweepstakes, and other offers and promotions; Enable posting on our blogs and other communications; Customize, measure, and improve our websites, products, services, and advertising; Analyze and develop new products, services, and websites; Perform accounting, auditing, billing, reconciliation, and collection activities; Prevent detect, identify, investigate, respond, and protect against potential or actual claims, liabilities, prohibited behavior, and criminal activity; Comply with and enforce applicable legal requirements, agreements, and policies; and Perform other activities consistent with this Notice. Products and Services Data Processing If you install or use one of our products or services, software will operate in the background of your computer system or device environment to perform specific security and privacy tasks including: Intrusion detection, prevention, and protection; Threat Prevention and Prediction; Back-up and recovery activities; Product Updating and Reporting Our products and services may also process certain data to provide updates and reports. These update functions may check your system to see whether files relating to the services need to be refreshed or modernized. For example, products and services may transmit report files to McAfee. These files contain information, including the number of checked, suspicious, infected, or unwanted files or emails, the number of infections, the date and hash values of the detected infections, and the number of false negatives/false positives. The purpose of these reports is to analyze the frequency of particular infections or the prevalence of threats. McAfee also uses the information to adapt the product to conform to user preferences based on actual use. Personal Information We Share We may share personal information with: Other members of the Intel family of companies for the purposes described in this Privacy Notice, such as to: (i) provide services and joint content (e.g., registration, sales, and customer support); (ii) help detect and prevent potentially illegal acts and violations of our policies; and (iii) guide our decisions about our products, services, and communications; Authorized service providers and partners who perform services for us (including data storage, sales, marketing, fraud investigations, and bill collection) based on our instructions. These third parties may only use or disclose personal information obtained from us to perform services on our behalf or comply with legal obligations; Third parties with your consent. For example, co-marketing with a business partner or sharing limited information as necessary with researchers and analysts; and Other business entities legally related to Intel or any third party that may take over all or part of our functions in the future (provided that such party agrees to use such personal information in a manner that is consistent with this Privacy Notice). We may also disclose personal information: (i) if we are required to do so by law or legal process; (ii) in response to requests by government agencies, such as law enforcement authorities or other authorized third-parties; (iii) as may be required for purposes of national security; (iv) when we believe disclosure is necessary and appropriate to prevent physical, mental, financial, or other harm, injury, or loss; or (v) in connection with an investigation of suspected or actual illegal or inappropriate activity or exposure to liability. The Intel family companies may share personal information with each other and use it in a manner that is consistent with this Privacy Notice. We may also combine it with other information to provide and improve our products, services, content, and advertising. When we share personal information with a third party, they must contractually agree to comply with privacy and security standards at least as stringent as ours when we are handling similar data. When you provide data directly to the third party, the processing is based on their standards (which may not be the same as ours) and your own independent relationship with that provider. We do not share your personal information with non-affiliated third parties for their own marketing use without your permission. We use administrative, organizational, technical, and physical safeguards to protect the personal information we collect and process. Our security controls are designed to maintain an appropriate level of data confidentiality, integrity, and availability. We regularly test our website, data centers, systems, and other assets for security vulnerabilities. We handle payment card data in a manner consistent with the Payment Card Industry's Data Security Standards (PCI-DSS). For example, when you make a payment on our website using your credit card, we use SSL encryption for transmission of the credit card number. How You Can Manage and Control Your Personal Information We offer certain choices about how we communicate with our users and what personal information we obtain about them. Many of our products allow users to make choices about the personal information collected. You may choose not to receive marketing communications from us by clicking on the unsubscribe link or other instructions in our marketing emails, visiting the My Account ( https://home.mcafee.com/secure/protected/login.aspx ) section on our website, or contacting us as specified in the \"How to Contact Us†section below. Many of our products contain settings that allow users or administrators to control how the products collect information. Please refer to the relevant product manual or contact us through the appropriate technical support channel for assistance. To remove your personal information from a website testimonial that we control, please contact customer service ( http://service.mcafee.com/CustomerService.aspx?lc=1033&sg=CS&pt=1 ). If you chose to no longer receive marketing information, we may still communicate with you regarding such things as security updates, subscription notices, product functionality, responses to service requests, or other transactional, non-marketing/administrative related purposes. How You Can Access and Correct Inaccuracies You can access and correct the personal information in your profile by visiting My Account ( https://home.mcafee.com/secure/protected/login.aspx ). Alternatively, you may request reasonable access to your personal information by contacting us as indicated below. The time periods for which we retain your personal information depend on the purposes for which we use it. We will keep your personal information for as long as you are a registered subscriber or user of our products and, thereafter, for no longer than is required by law, or our Records Retention Policy, reasonably necessary for internal reporting and reconciliation purposes, or to provide you with feedback or information you might request. In certain circumstances, we may be required to retain data we have about you (such as for tax, litigation (threatened, anticipated, or actual), other business purposes, or if required by law enforcement). Storage of the Information We Collect From You The information we collect may be stored and processed in servers in the United States and wherever we and our service providers have facilities around the globe. We may transfer the personal information we obtain to countries other than the country in which the information originally was collected. Those countries may not have as comprehensive data protection laws as the country from which we initially obtained the information. When we transfer the information to other countries, we will protect that information as described in this Privacy Notice. We may transfer the personal information we obtain to countries other than the country in which the information originally was collected. Those countries may not have as comprehensive data protection laws as the country from which McAfee initially obtained the information. When we transfer the information to other countries, we will protect that information as described in this Privacy Notice. If you are located in the European Economic Area or Switzerland, we comply with applicable legal requirements providing adequate protection for the transfer of personal information to countries outside of the EEA or Switzerland. We are certified under the Safe Harbor Privacy Framework as set forth by the U.S. Department of Commerce, the European Commission and Switzerland regarding the collection, storage, use, transfer, and other processing of personal data transferred from the EEA or Switzerland to the U.S. ( http://safeharbor.export.gov/companyinfo.aspx?id=23562 ) to view our Safe Harbor Certification. We may update this Notice at any time by posting additions or modifications on this web page. If at any point we decide to use personal information in a manner materially different from that stated at the time it was collected, we will notify users by email, via a prominent notice on our website, or other such means. And, where required, we will seek appropriate consent prior to the new use. Links to Other Websites Our websites may contain links to other websites for your convenience and information. These websites may be operated by companies not affiliated with us. Linked websites may have their own privacy policies or notices, which we strongly suggest you review if you visit any linked websites. We are not responsible for the content of any websites that are not affiliated with us, any use of those websites, or the privacy practices of those websites. In certain circumstances, where the information of third parties is collected by us by virtue of the third-party's interaction with you such as the information of those individuals who send communications to your computer), we rely on you to provide the relevant third parties with appropriate notice and to obtain any requisite consent. You expressly consent to our processing of information as described in this Privacy Notice when you: Visit and/or provide information to us through our websites; Buy, license, and use our products or services and accept the of Use, End- User License Agreement, and Privacy Notice; or Sign a contract with us to purchase or subscribe to our products and services. In addition, by using and interacting with our products, services, or websites, you affirmatively consent to our collection and processing of personal information: (a) to provide the intended functionality of a product or service; (b) by automated means, such as cookies or web beacons; and (c) in accordance with this Privacy Notice. You also consent to the storage and transfer of the information to locations wherever we and our service providers have facilities, including the United States. If you have questions or concerns regarding this Privacy Notice, or would like to update information we have about you or your preferences, please contact us by: Emailing the Privacy Program Office of McAfee, a part of Intel Security at privacy@mcafee.com Calling us at +1 972-963-7902 Writing to us at: Privacy Program Office –McAfee, A Part of Intel Security, 2821 Mission College Blvd Santa Clara, CA 95054 If you do not receive a prompt response, please contact the Consumer Privacy Response Team of McAfee, part of Intel Security, by Writing to: Consumer Privacy Response Team –McAfee, Part of Intel Security, 5000 Headquarters Drive Plano, Texas 75024 If you are located in the European Economic Area, please write to: Privacy Program Office –McAfee. Part of Intel Security. 26, Boulevard Royal 2449 Luxembourg, Luxembourg In addition to McAfee, Inc., the legal entity with which you have a business relationship is responsible for safeguarding your personal information. For the U.S., Mexico, Central America, South America, and the Caribbean: McAfee, Inc., 2821 Mission College Blvd., Santa Clara, California 95054 For Canada, Europe, the Middle East, Africa, Asia, and the Pacific Rim: McAfee Security S.A.R.L., 26, Boulevard Royal, 2449 Luxembourg, Luxembourg McAfee Co., Ltd., Shibuya Mark City West Building 12-1, Dogenzaka 1-Chrome, Shibuya-ku, Tokyo 150-0043, Japan We've noticed you're using an older version of Internet Explorer. Unfortunately the True Key website only supports IE 9+ at this time. Please upgrade your browser or try on Chrome, Firefox or Safari.",
    "Thank you for using Intel Security software and services (\"Softwareâ€), provided by the applicable McAfee entity identified in Section 18 (\"McAfeeâ€, \"we†or \"usâ€), a wholly owned subsidiary of Intel Corporation. This is a legal agreement between you and us—installing or accessing our Software means you are agreeing to these , so please read them carefully. This Intel Security License Agreement (\"Agreementâ€) covers your rights to use the Software, restrictions on that use, our right to automatically renew and charge you for paid versions or features of the Software, and your agreement to arbitrate any dispute that may arise between you and us. We have included links to additional , such as our Privacy Notice ( Href ), which are important and together create this legal agreement that applies to you. Country-specific are located in the last section of the Agreement. If you are under the age of 18, you are not permitted to use the Software or provide your personal information to us without the consent of your parent or guardian who must first accept this Agreement and administer the Software on your behalf. 1. Accepting this Agreement and Modifications By clicking an acceptance button and/or installing or accessing the Software, you agree unconditionally to be bound by this Agreement and acknowledge that it is enforceable as a written contract signed by you. If you do not unconditionally agree to all of these , do not install, use or access this Software. To the extent any translated version of this Agreement conflicts with the English version, the English version controls. WE MAY MODIFY THIS AGREEMENT, INCLUDING THE CONFIDENTIAL ARBITRATION AND DISPUTE RESOLUTION PROVISION BELOW, FROM TIME TO TIME AT OUR SOLE DISCRETION FOR ANY REASON. For example, we may need to reflect changes in the law or updates in how the Software works. It is very important that you keep your account information current, including your email address and other contact information. If we make material changes to this Agreement, we will communicate the changes to you via the contact information you provided (or through other means) and give you an opportunity to review and accept or reject the updated Agreement as set out below. For paid subscriptions, you accept change(s) to this Agreement by renewing the subscription, and the change(s) will be effective upon the next renewal of your subscription. If you do not agree to the Agreement as amended, then you reject the Agreement by turning off auto renewal and uninstalling the Software at the end of the subscription term. If you withdraw your acceptance of this Agreement, you must uninstall and discontinue your use of the Software at that time. If you violate this Agreement, we may terminate your access to and use of the Software. For Free Software (as defined in Section 3 below), you accept change(s) to this Agreement by continuing to use the Free Software after the notice described in this section. If you reject the updated Agreement, your license to the Free Software is terminated and you must cease all access to and use of the Free Software and uninstall it. 2. License to Use We are pleased to grant you a nonexclusive limited license to install the Software for personal use in accordance with the of this Agreement. This license is limited to the number of your devices your subscription entitles you to, is nontransferable and is revocable by us as provided in this Agreement. We, along with our suppliers and partners, retain ownership of the Software and all rights related to the Software, including all intellectual property rights. The only rights we grant you are those rights expressly stated in this Agreement. Also, if you provide us any comments, information, opinions, or suggestions, which we consider \"Feedback,†you allow us to use your Feedback without restriction, for any purpose and without compensation to you. Your use of the Software is limited to devices and operating systems we support and may be affected by the performance and compatibility of your hardware, software and Internet access. Meeting system requirements is your responsibility and you are responsible for the cost of your equipment, which may include obtaining updates or upgrades from time to time in order to continue using the Software. System requirements are available on our website. 3. Term of Agreement For paid subscriptions, the Agreement is effective for the subscription term you purchased and each subsequent term that you renew, unless terminated earlier or later as permitted below; and if no term was specified, the default term is one year from the date you first acquired the subscription. For free versions of the Software, including (i) any features included in a paid subscription for which we no longer charge or which we offer to you at no charge, and (ii) any feature that we give you on a trial, courtesy or evaluation basis or that is labeled as \"Pre-Release,†\"Limited Release,†\"Beta†or otherwise described as experimental, untested, or not fully functional (collectively \"Free Softwareâ€), this Agreement is effective for as long as the Free Software is installed or we otherwise make the Free Software available to you. We may choose to provide you Free Software prior to, during, or after your paid subscription and any use is subject to the of this Agreement for as long as the Free Software is installed. We may terminate this Agreement at our option if you fail to comply with its . You may also terminate this Agreement prior to the expiration of the term by permanently erasing the Software from your devices and canceling your account with us. If this Agreement is terminated, you must stop using the Software and, if you have not done so, you must permanently erase all copies of the Software. If the Agreement terminates for any reason or expires, you will no longer be authorized to use or access the Software, including any online storage or backup services, and we may cancel and/or close your account at our sole discretion. After the termination or expiration date, we will follow our standard policies to delete any of your online stored or backed-up information, text, files, links, images or other materials provided to us (\"Contentâ€). It is your responsibility to store or backup your Content elsewhere before this Agreement expires or is terminated. We are not responsible for giving you a copy of your Content. Use of Software, at any time, is governed by the of this Agreement. 4. Automatic Renewal, Cancellation and Refund YOU AGREE TO ALLOW US TO AUTOMATICALLY RENEW YOUR PAID SUBSCRIPTION. BEFORE YOUR TERM EXPIRES, WE WILL SEND A NOTICE TO THE E-MAIL ADDRESS IDENTIFIED IN YOUR ACCOUNT PROFILE, INFORMING YOU OF THE UPCOMING RENEWAL. YOU WILL BE CHARGED THE UNDISCOUNTED SUBSCRIPTION PRICE FOR THE SOFTWARE AS LISTED ON OUR WEBSITE AT THE TIME OF RENEWAL, EXCLUDING ANY PROMOTIONAL OR DISCOUNT PRICING (\"UNDISCOUNTED SUBSCRIPTION PRICEâ€). THIS PRICE MAY CHANGE DURING A SUBSCRIPTION TERM, AND MAY BE HIGHER THAN THE PRICE PAID FOR AN INITIAL SUBSCRIPTION OR MANUAL RENEWAL AND HIGHER THAN PROMOTIONAL OR DISCOUNTED PRICES THAT MAY BE AVAILABLE AS OF THE DATE OF AUTOMATIC RENEWAL. WE WILL SEND YOU VIA EMAIL A RECEIPT CONFIRMING THE RENEWAL DATE, PRICE, TERM AND ANY APPLICABLE TAXES. IF, AT THE TIME OF RENEWAL, THE SOFTWARE HAS BEEN RENAMED, UPGRADED OR REPLACED BY A NEW PRODUCT OFFERING WITH COMPARABLE FEATURES (\"REPLACEMENTâ€), WE MAY, AT OUR DISCRETION, AUTOMATICALLY RENEW YOUR SUBSCRIPTION WITH THE REPLACEMENT FOR NO MORE THAN THE UNDISCOUNTED SUBSCRIPTION PRICE OF THE REPLACEMENT. UPON RENEWAL, THE NEW TERM WILL BE THE SAME LENGTH AS THE EXPIRED TERM UNLESS OTHERWISE SPECIFIED BY US AT THE TIME OF RENEWAL. FOR SUBSCRIPTIONS OF ONE YEAR OR MORE, THE RENEWAL AND YOUR PAYMENT WILL BE PROCESSED WITHIN 30 DAYS OF THE CURRENT TERM EXPIRATION DATE AND EACH ANNIVERSARY THEREAFTER. WE WILL INFORM YOU OF YOUR ACCOUNT STATUS AND ANY CHANGES TO THE OF YOUR SUBSCRIPTION. ANY TIME AFTER PURCHASING A SUBSCRIPTION, YOU MAY TURN OFF AUTOMATIC RENEWAL BY ACCESSING YOUR ONLINE ACCOUNT PAGE OR CONTACTING CUSTOMER SERVICE. IF YOU DO NOT WISH TO BE AUTOMATICALLY RENEWED, YOU MUST TURN OFF AUTO-RENEWAL AT LEAST THIRTY DAYS BEFORE YOUR SUBSCRIPTION EXPIRES. IF YOU DO NOT TURN OFF AUTO-RENEWAL, YOUR SUBSCRIPTION WILL CONTINUE UNTIL IT IS CANCELED BY YOU (OR TERMINATED BY US PURSUANT TO THIS AGREEMENT). If you have a monthly subscription, cancelling will not retroactively refund subscription payments, and previously charged subscription fees cannot be pro-rated based on cancellation date. Cancelling a monthly subscription will stop the recurring fee going forward, and you will have access to your subscription until the end of the month in which you notified us of your cancellation. For paid subscriptions other than monthly, you may end your use of the Software at any time and we will offer a refund (for the current term only) if requested within 60 days of purchase or renewal by contacting Customer Service. If you contact Customer Service to cancel your subscription more than 60 days after purchase or renewal, you are not entitled to a refund for any fees that you may have paid in advance for the current term, and you will remain liable for all fees you incur or accrue during the current term. You are responsible for ensuring that your billing information is current, complete, and accurate. If we experience a problem processing payment using the information you originally provided, we may seek to complete your transaction directly through your credit or debit account with your financial institution to prevent an interruption in service. You are responsible for any charges incurred with your data- or mobile-service provider in connection with your use of the Software, including any overage and penalties assessed for exceeding your data or minute allowance, or use of domestic or international short message service. We care deeply about your privacy and security and your online safety is a significant part of our essential mission. In order to provide services to you, to understand how users use our products and the environments in which they operate, and to improve our products and services, we may collect and process personal and machine data, including sensitive information (e.g., biometrics, health related data, financial/billing information, and geo-location) in accordance with our Privacy Notice for so long as the Software is installed. We may transfer and process such data in the United States and other countries where we or our service providers have facilities. You agree that any use of the Software and any collection, processing, or sharing of information through the Software is governed by our Privacy Notice. We will periodically send you communications from the Intel Security family of companies related to the Software (including email, SMS/text, and in-product messaging) to keep you informed about important information related to your account, subscription, or Software you are entitled to receive. With your permission (implied or express), we will also send you commercial messages such as special offers, promotions, contests/sweepstakes, and events from us and selected third parties. You can unsubscribe from these commercial messages at any time. We care deeply about your privacy and security and your online safety is a significant part of our essential mission. In order to provide services to you, to understand how users use our products and the environments in which they operate, and to improve our products and services, we may collect and process personal and machine data, including sensitive information (e.g., biometrics, health related data, financial/billing information, and geo-location) in accordance with our Privacy Notice for so long as the Software is installed. We may transfer and process such data in the United States and other countries where we or our service providers have facilities. You agree that any use of the Software and any collection, processing, or sharing of information through the Software is governed by our Privacy Notice. We will periodically send you communications from the Intel Security family of companies related to the Software (including email, SMS/text, and in-product messaging) to keep you informed about important information related to your account, subscription, or Software you are entitled to receive. With your permission (implied or express), we will also send you commercial messages such as special offers, promotions, contests/sweepstakes, and events from us and selected third parties. You can unsubscribe from these commercial messages at any time. 6. Limits on Use In order for us to keep the Software safe and available for everyone to use, we have to place some restrictions on what you can do with it. The Software is licensed to you, not sold, and it is protected by national and international laws and treaties in the United States and around the world. You do not have any right to reproduce or distribute the Software without our permission, and if you do so you may be subject to fines or any other penalties allowed by the civil and criminal laws of your country. You may not: reverse-engineer or otherwise try to derive source code from the Software, unless allowed by law; adapt or modify the Software or create derivative works based on the Software; publish, copy (other than backup copies if permitted by your subscription), sell, lend, rent, sublicense, assign or in any other way transfer the Software to anyone else; exploit the Software for any commercial purposes; attempt to circumvent technical protection measures in the software; use the Software to violate the law; or engage in any activity that interferes with anyone else's use of the Software. If you have installed the Software on a mobile device and you transfer ownership of that device to someone else, you must ensure that any Software is deleted from that device and that the device information is removed from your account with us. We have the right to terminate or suspend this Agreement, your account, and/or your access to the Software if, in our sole discretion, we determine that you have violated this Agreement. The Software may contain enforcement technology that limits the size of content storage, bandwidth consumption, or the number of devices on which the Software may be installed or that allows us to suspend your access to the Software if you have violated this Agreement or if your subscription has expired. 7. Support, Updates & Product Lifecycle End users with unexpired, paid subscriptions will receive technical support in accordance with our current standard-support offerings, policies, and procedures as described on our website. Our standard-support offerings, policies, and procedures may change from time to time at our sole discretion and may vary by country. Any obligation we may have to support the previous version of the Software ends when an upgrade, modified or later version, or other update to the Software (\"Updateâ€) becomes available. For your convenience and to ensure that the Software on your devices includes new features that we develop, by agreeing to this Agreement you give us permission to install Updates on your devices automatically when available, to the extent that it is possible for us to run such background installations. Any Updates or end-user technical support provided for Free Software that may be provided are provided at our sole discretion and may be discontinued at any time. From time to time, at our sole discretion, we may elect to discontinue certain Software or particular features of the Software. \"End of Support†refers to the date when we no longer provide automatic fixes, updates or technical assistance for particular Software. If a renewal term for your subscription would expire past the End of Support, you may not be eligible to renew your subscription, except as otherwise provided by Section 4 of this Agreement. For more information, please visit the McAfee Product Life Cycle page. 8. That Apply to Services, Specific Offers, Products or Features Services: This Agreement sets forth the that govern any subscriptions (free or paid), licenses or services acquired by you from us. In addition to this Agreement, services that you purchase from us are subject to and governed by published by us which are applicable to the purchased services. Safe Family and Multi-User Products: To use any McAfee Safe Family or multi-user Software, you must be at least 18 years old, or, if you are under 18, you must be authorized by your parent or legal guardian to use the Software once your parent or legal guardian has accepted this Agreement and installed the Software on your behalf. If you are an adult, parent, or legal guardian, you may use the Software to track and monitor only your own children, children for whom you are the legal guardian, or others for whom you have authorization to track and monitor. Free, Trial, Evaluation, Pre-Release and Beta Products: If the Software that you download or otherwise receive is Free Software, then this section of the Agreement shall also apply. To the extent that any provision in this section is in conflict with any other term or condition in this Agreement, this section shall supersede such other term(s) and condition(s) with respect to such Free Software, but only to the extent necessary to resolve the conflict. All Free Software is provided as is, without any warranty, indemnity, maintenance or support, express or implied, subject to any statutory rights that cannot be excluded or limited by law. You acknowledge that Free Software may contain bugs, errors and other problems that could cause system or other failures and data loss. You acknowledge that we have not promised or guaranteed to you that Free Software will be announced or made available to anyone in the future, that we have no express or implied obligation to you to announce or introduce Free Software, and that we are not obligated to introduce a product similar to or compatible with Free Software or any updates to any Free Software. Accordingly, you acknowledge that any use of the Free Software is entirely at your own risk. \"Life of Your (Device)†Subscription: The McAfee \"Life of Your (Device)†subscription can be applied to a single Windows PC or Android mobile device (\"Your Deviceâ€) if included in your purchase of Your Device, or on no more than three of Your Devices if you purchased the McAfee \"Life of Your (Device) subscription separately. Once properly installed onto Your Device, the McAfee \"Life of Your (Device)†subscription will be active for the remainder of Your Device's useful life, and you are entitled to English-language telephone and web-based technical support during normal business hours for one year, and English-language web-based technical support, as long as the operating system currently installed on Your Device is not more than two versions older than the most-current version (for example, \"Windows 8.x†or \"Android 4.x†, for the industry-standard useful life of Your Device (industry standard useful life for a PC is 5-7 years, or 3 years for a tablet or smartphone). The McAfee \"Life of Your (Device)†subscription is not transferable or movable to any other person, PC, or device in any event or under any circumstance. If you sell or otherwise transfer Your Device to another person prior to the end of Your Device's useful life, your McAfee \"Life of Your (Device)†subscription will void and terminate, and the subsequent owner of Your Device will not have the right to install, use, or possess the McAfee \"Life of Your (Device)†subscription. Any attempt to transfer, move, or reinstall the McAfee \"Life of Your (Device)†subscription on another PC or device, or to install the subscription on more than the original PC or device, or original three PCs or devices, as applicable, will void and terminate your right to install, use, or possess the McAfee \"Life of Your (Device)†subscription. In order to stay current and receive support, you must update your McAfee \"Life of Your (Device)†software periodically and upgrade to the latest version of the same McAfee product level of software. If at any time, you decide to upgrade to a different McAfee product other than the McAfee \"Life of Your (Device)†subscription, that product upgrade: (1) will be subject to payment of that product's subscription/license fee; (2) will NOT be a \"Life of Your (Device)†license; and (3) your subscription and license to McAfee \"Life of Your (Device)†subscription will automatically terminate without notice or refund of money previously paid. Virus Removal and TechMaster Services: If your subscription includes Virus Removal Service, TechMaster Service or a similar service whereby we or one of our partners access your device to attempt removal of malware or perform other specified services, additional apply. Please refer to the documentation that accompanied your subscription for details. Passwords and Identity Management: You are responsible for the security of your password and for keeping your account secure. You should keep your password and/or encryption key for your account secure because without them you may lose access to your data. You are solely responsible and liable for any activity that occurs under your account, including by anyone who uses your account. If there is any unauthorized use or access to your account, you must let us know immediately. We are not responsible for any loss caused by unauthorized use of or access to your account; however, you may be liable for any losses we or others suffer because of the unauthorized use. WE DO NOT HAVE ACCESS TO MASTER PASSWORDS AND CANNOT RECOVER YOUR ENCRYPTED DATA IF YOU FORGET THE MASTER PASSWORD FOR ANY PASSWORD MANAGEMENT FEATURE OR PRODUCT. We offer both free and premium versions of our password and identity management Software, and the free versions limit the maximum number of unique accounts (such as a website or application login) that you can store. If you have downloaded a premium version of the Software at no cost during a promotion, then when the promotional period ends you will not be permitted to add any new unique accounts if you have exceeded the maximum number permitted by the free version. IN ADDITION, IF YOU ORIGINALLY DOWNLOADED SOFTWARE OR SERVICES FROM PASSWORDBOX UNDER ITS FREE-FOR-LIFE MEMBERSHIP PROGRAM OR A SIMILAR \"LIFETIME†PROMOTION OR OFFER, THOSE PROMOTIONS OR OFFERS DO NOT APPLY AND ARE NOT TRANSFERABLE TO THE SOFTWARE. If you download any Intel Security password or identity management Software, that download will be subject to all subscription fees that are published in connection with that download, as well as the of this Agreement. SiteAdvisor & WebAdvisor: McAfee SiteAdvisor and WebAdvisor are software programs (with corresponding websites) that provide users with an opinion to guide users about certain risks that may be associated with a website. The software displays color-coded symbols next to links provided by major search engines, and the corresponding websites have dossier pages to provide information on the factors that affect site ratings. The ratings are primarily derived using automated methods; the software cannot detect or examine every possible aspect of website design, nor can it determine the intent of the site owner. McAfee does not control or assume responsibility for the content of the third-party sites, and some of the third-party sites may have content that you find objectionable, inappropriate, or offensive. THE SITE RATINGS ARE NOT A GUARANTEE OF ANY PARTICULAR SITE'S SPECIFIC PRACTICES OR TRUSTWORTHINESS, AND IN NO CASE DO THE RATINGS REPRESENT AN ENDORSEMENT BY MCAFEE OF THE SITE'S CONTENT, GENERAL SUBJECT MATTER, OVERALL QUALITY, OR USEFULNESS. 9. Binding Arbitration and Class Action Waiver Agreement to Arbitrate Disputes: Any claim, dispute or controversy (\"Claimâ€) by either you or us against the other arising from, relating to or in any way concerning the Agreement, the Software, or any equipment, products, or services you receive from us (or from any advertising for any such products or services) shall, at the demand of either party, be resolved by confidential binding arbitration. This agreement to arbitrate also includes claims relating to the enforceability or interpretation of any of these arbitration provisions. However, we will not demand arbitration pursuant to this Agreement in connection with any individual claim that you properly file and pursue in a small-claims court of your state or municipality, so long as the claim is pending only in that court and the claim is on an individual (non-class, non-representative) basis. This agreement to arbitrate includes all controversies and claims of any kind, regardless of the type of claim or legal theory or remedy (damages, injunctive relief, or declaratory relief). The disputes subject to this arbitration agreement include not only claims by you, but also made on your behalf or connected with you, such as an employee, representative, agent, predecessor, successor, heir, assignee, or trustee in bankruptcy. Disputes subject to this arbitration agreement include not only claims that relate directly to us, but also to our parent, affiliates, successors, assignees, employees, and agents. This agreement to arbitrate includes claims asserted as part of a class action, private attorney general or other representative action, it being expressly understood and agreed to that the arbitration of such claims must proceed on an individual (non-class, non-representative) basis and the arbitrator may award relief only on an individual (non-class and non-representative) basis. YOU AND WE AGREE THAT NO CLASS ACTION, PRIVATE ATTORNEY GENERAL OR OTHER REPRESENTATIVE CLAIMS MAY BE PURSUED IN ARBITRATION, NOR MAY SUCH ACTION BE PURSUED IN COURT, IF EITHER YOU OR WE ELECT ARBITRATION, BY ACCEPTING THIS ARBITRATION AGREEMENT, YOU AGREE TO WAIVE THE RIGHT TO INITIATE OR PARTICIPATE IN A CLASS ACTION, REPRESENTATIVE ACTION, PRIVATE ATTORNEY GENERAL ACTION OR CONSOLIDATED ARBITRATION IN ANY MATTER ENCOMPASSED BY THIS ARBITRATION PROVISION. Notice of Dispute: If either you or we intend to seek arbitration, the party seeking arbitration must first notify the other party of the dispute in writing at least 30 days in advance of initiating arbitration. Notice should be sent to McAfee, Inc., 5000 Headquarters Drive, Plano, TX 75024, Attention: Legal Department. The notice must include your name, address, and contact information, the facts giving rise to the dispute, and the relief requested. You and McAfee will attempt to resolve any dispute through informal negotiation within 60 days from the date of the Notice of Dispute is sent. After 60 days, you or McAfee may commence arbitration. Administration of Arbitration: If you and McAfee do not resolve any dispute by informal negotiation or in small claims court, any claim, dispute, or controversy will be conducted exclusively by binding arbitration governed by the Federal Arbitration Act (\"FAAâ€), and not state law. YOU ARE GIVING UP THE RIGHT TO LITIGATE (OR PARTICIPATE IN AS A PARTY OR CLASS MEMBER) ALL DISPUTES IN COURT BEFORE A JUDGE OR JURY. Instead, all disputes will be resolved on an individual basis before a single, neutral arbitrator and the proceeding shall be confidential. The arbitrator will be either a lawyer admitted to practice law in his or her jurisdiction and with at least ten years' experience or a retired or former judge selected in accordance with the rules of the AAA. The arbitrator is bound by the of this Agreement, and the arbitration shall be governed by the Commercial Arbitration Rules and Supplementary Procedures for Consumer Related Disputes of the AAA, as modified by this Agreement (the \"Arbitration Rulesâ€). For more information, see adr.org or call 1-800-778-7879. Except with respect to any claims or counterclaims seeking less than $25,000, the arbitrator shall issue a reasoned, written decision sufficient to explain the essential findings and conclusions on which the award is based. All arbitration proceedings shall be conducted in English, and the United States FAA shall apply to the Agreement and the binding arbitration. The award shall be confidential and only disclosed as is necessary to obtain judgment or as otherwise required by law. Where authorized by applicable law, the arbitrator's award may include attorneys' fees and other expenses. The arbitration award shall determine the rights and obligations between the named parties only, and only in respect of the claims in arbitration, and shall not have any bearing on the rights and obligations of any other dispute. Costs: The party initiating the arbitration shall pay the initial filing fee. If you file the arbitration and an award is rendered in your favor, McAfee will reimburse you for your filing fee. If there is a hearing, we will pay the fees and costs for the first day of that hearing. All other fees and costs will be allocated in accordance with the arbitration rules. However, we will advance or reimburse filing and other fees if the arbitrator rules that you cannot afford to pay them or if you ask us and we determine there is a good reason for doing so. Each party shall bear the expense of their respective attorneys, experts, and witnesses and other expenses, regardless of who prevails, but a party may recover any or all expenses from another party if the arbitrator, applying applicable law, so determines. Right to Resort to Provisional Remedies Preserved: Nothing herein shall be deemed to limit or constrain our right to resort to self-help remedies or to comply with legal process, or to obtain provisional remedies such as injunctive relief, attachment, or garnishment by a court having appropriate jurisdiction; provided, however, that you or we may elect to arbitrate any dispute related to such provisional remedies. Conflicting : In the event of a conflict between the Arbitration Rules and this arbitration agreement, this arbitration agreement shall govern. If any portion of this arbitration agreement is deemed invalid or unenforceable, it shall not invalidate the other provisions of the arbitration agreement; provided, however, that (a) if the prohibition on classwide arbitration is deemed invalid, then this entire arbitration agreement shall be null and void; and (b) if the prohibition on arbitration of representative claims brought in a private attorney general capacity is deemed invalid, then the arbitration agreement shall be null and void as to such claims only. This arbitration agreement shall survive the termination or cancellation of this Agreement. In the event of a conflict between this arbitration agreement and any other applicable arbitration provision, this arbitration agreement shall control. WAIVER OF JURY TRIAL: IF FOR ANY REASON A CLAIM PROCEEDS IN COURT RATHER THAN THROUGH ARBITRATION, YOU AND MCAFEE AGREE THAT THERE WILL NOT BE A JURY TRIAL. YOU AND MCAFEE UNCONDITIONALLY WAIVE ANY RIGHT TO TRIAL BY JURY IN ANY DISPUTE THAT IN ANY WAY RELATES TO OR ARISES OUT OF THE AGREEMENT OR FROM ANY EQUIPMENT, PRODUCTS AND SERVICES YOU RECEIVE FROM US (OR FROM ANY ADVERTISING FOR ANY SUCH PRODUCTS OR SERVICES). IN THE EVENT OF LITIGATION, THIS PARAGRAPH MAY BE FILED TO SHOW A WRITTEN CONSENT TO A TRIAL BY THE COURT. 10. Law Covering This Agreement Except as provided in Section 20 below, this Agreement, the use of the Software, the relationship of the parties, and any disputes arising out of, concerning, or relating to the Agreement, including any disputes between you and us, will be governed by and construed in accordance with the laws of the State of New York, excluding its conflict of law principles, except that the FAA governs all provisions relating to arbitration. If for any reason, the laws of the State of New York are found not to apply, then, except as provided in Section 20 below, this Agreement, the use of the Software, the relationship of the parties, and any disputes arising out of, concerning, or relating to the Agreement, including any disputes between you and us, will be governed by and construed in accordance with the laws of the State of Texas, excluding its conflict of law principles, except that the FAA governs all provisions relating to arbitration. The United Nations Convention on Contracts for the International Sale of Goods and the Uniform Computer Information Transactions Act do not apply to the Software. 11. Limited Warranties; Disclaimer of Other Warranties For 30 days after the purchase date, for paid versions of the Software only, we warrant that the Software licensed under this Agreement (including updates provided during the warranty period but only until the warranty lapses) will perform substantially in accordance with the documentation provided by us in connection with that Software at the time of purchase, and that any tangible medium (such as a CD-ROM, but excluding devices manufactured by other companies) on which the Software is contained and provided to you will be free from defects in materials and workmanship. We do not warrant or guarantee that any particular mobile device or computer will be compatible with or function with the Software, nor do we warrant or accept any liability for the operation of your personal equipment that is used to access the Software. Your sole remedy, and our and our suppliers' entire liability, in case of any breach of this limited warranty is that we will, at our option, refund the price you paid for the license, replace the defective medium that contains the Software, or provide an alternative remedy as required by local consumer law in your jurisdiction. These remedies may not be available in some countries to the extent that we are subject to restrictions under applicable export-control laws and regulations. If the tangible medium is defective, you must return it at your expense to the place where you bought it and provide a copy of your receipt. Any replacement medium will be warranted for the remainder of the original warranty period. THE ABOVE WARRANTIES ARE YOUR EXCLUSIVE WARRANTIES. THEY REPLACE ALL OTHER WARRANTIES, REPRESENTATIONS, OR CONDITIONS, EXPRESS OR IMPLIED, INCLUDING WARRANTIES OR CONDITIONS OF MERCHANTABILITY, PERFORMANCE, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT. EXCEPT FOR THE LIMITED WARRANTY IN THIS SECTION, THE SOFTWARE IS PROVIDED AS IS. YOU ARE RESPONSIBLE FOR SELECTING THE SOFTWARE TO ACHIEVE YOUR INTENDED RESULTS, FOR INSTALLING AND USING THE SOFTWARE, AND FOR THE RESULTS OBTAINED. WE DO NOT WARRANT OR GUARANTEE THE SOFTWARE'S USE OR PERFORMANCE. WE DO NOT WARRANT OR GUARANTEE THAT THE SOFTWARE'S OPERATION WILL BE FAILSAFE, UNINTERRUPTED, OR FREE FROM ERRORS OR DEFECTS, OR THAT THE SOFTWARE WILL PROTECT AGAINST ALL POSSIBLE SECURITY THREATS (INCLUDING INTENTIONAL MISCONDUCT BY THIRD PARTIES), THAT THERE WILL BE NO MALFUNCTIONS OR OTHER ERRORS IN THE SOFTWARE CAUSED BY VIRUS, INFECTION, WORM OR SIMILAR MALICIOUS CODE NOT INTRODUCED OR DEVELOPED BY US, OR THAT THE SOFTWARE WILL MEET YOUR REQUIREMENTS. WE ARE NOT LIABLE FOR ANY DOWNTIME OR SERVICE INTERRUPTION, FOR ANY LOST OR STOLEN DATA OR SYSTEMS, OR FOR ANY OTHER DAMAGES ARISING OUT OF OR RELATING TO ANY ACTIONS OR INTRUSIONS. The Software is not fault-tolerant and is not designed or intended for high-risk activities such as use in hazardous environments requiring failsafe performance, including nuclear-facilities operations, air traffic communication systems, weapons systems, direct life-support machines, or any other application in which the failure of the Software could lead directly to death, personal injury, or severe physical or property damage. We expressly disclaim any express or implied warranty of fitness for high-risk activities. 12. Limitation of Liability NO LIABILITY FOR NONDIRECT DAMAGES. UNDER NO CIRCUMSTANCES ARE WE OR OUR SUPPLIERS, LICENSORS OR OTHER THIRD-PARTY SERVICE PROVIDERS LIABLE TO YOU FOR ANY: (A) INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES; (B) THEFT OF PERSONALLY IDENTIFIABLE INFORMATION OR COST OF PROCURING SUBSTITUTE SOFTWARE OR SERVICES, AND (C) DAMAGES FOR LOSS OF PROFITS, LOSS OF GOODWILL, LOSS OF PERSONNEL SALARIES, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, LOSS OF DATA, OR NEGLIGENCE OF ANY KIND, OR FOR ANY OTHER NONDIRECT DAMAGE OR LOSS. IN NO EVENT WILL OUR, OUR AFFILIATES' OR OUR SUPPLIERS', LICENSORS' OR OTHER THIRD-PARTY SERVICE PROVIDERS' AGGREGATE LIABILITY TO YOU FOR DIRECT DAMAGES UNDER THIS AGREEMENT EXCEED THE PRICE YOU PAID FOR THE APPLICABLE SOFTWARE, OR US$ 100 (OR THE EQUIVALENT AMOUNT IN NATIONAL CURRENCY) IF YOU USED FREE SOFTWARE. You agree to the limitations of liability in this Section 12 and acknowledge that without your agreement to this term, the fee charged for the Software would be higher. Nothing in this Agreement limits any rights you may have under existing consumer-protection statutes or other applicable laws that may not be waived by contract in your jurisdiction. 13. Government End Users and Export Control The Software is commercial computer software under DFARS Section 217.7202, the Defense Federal Acquisition Regulations Supplement (codified under Chapter 2 in Title 48, Code of Federal Regulations). The accompanying documentation (if any) is commercial-computer-software documentation under FAR Section 12.212, the Federal Acquisition Regulations (codified in Title 48 of the United States Code of Federal Regulations). Any use, modification, reproduction, release, performance, display, or disclosure of the Software and accompanying documentation by the United States Government is governed solely by this Agreement and is prohibited except to the extent expressly permitted by this Agreement. Your use of the Software and its related documentation, including technical data, may not be exported or re-exported in violation of the U.S. Export Administration Act, its implementing laws and regulations, the laws and regulations of other U.S. agencies, or the export and import laws of the jurisdiction in which you obtained the Software. Export to a particular individual, entity, or country may be prohibited by law. Information about import restrictions can be found at the following websites: http://www.treas.gov/ofac and http://export.gov 14. Government End Users and Export Control Some third-party materials included with the Software may be subject to other , which are typically found in a \"Read Me†or an \"About†file accompanying the Software. Those third-party materials may include software source code licensed by third parties under one or more open-source or free-software licenses, including the GNU General Public License (GPL), which are considered \"Open Source Software.† The Open Source Software is licensed under different from this Agreement and may, in some cases, conflict with the of this Agreement and will apply instead of the of this Agreement. If an Open Source Software license requires us to distribute any source code related to the Software or any modifications to the Software, we will make the source code available on request. We do not waive any provision of this Agreement unless we waive it in a signed writing. If any part of this Agreement is for any reason held to be unenforceable, that part is, to that extent, deemed omitted, and the rest of it remains fully enforceable; PROVIDED HOWEVER, THAT THE ARBITRATION AGREEMENT SHALL NOT APPLY TO ANY CLAIMS AS TO WHICH THE LIMITATIONS ON CLASS ACTIONS OR CONSOLIDATED ARBITRATION ARE NOT PERMITTED BY APPLICABLE LAW. This Agreement includes our Privacy Notice, and with respect to any services purchased from us the applicable , which are all incorporated into this Agreement. This Agreement constitutes the entire agreement between you and us and governs your use of the Software and services acquired hereunder. This Agreement completely replaces any prior agreements between you and us in relation to the Software and any services, and any other communications, representations, or advertising relating to the Software. This Agreement operates to the fullest extent permissible by law. The Software is licensed to you by one of these McAfee legal entities: McAfee, Inc., a Delaware corporation, with offices located at 2821 Mission College Blvd., Santa Clara, California 95054, USA, if the Software is downloaded in the United States, Mexico, Central America, South America, or the Caribbean; McAfee Security S.A.R.L. with offices located at 26, Boulevard Royal, 2449 Luxembourg, Luxembourg, if the Software is downloaded in Canada, Europe, the Middle East, Africa, Asia, or the Pacific Rim; or McAfee Co., Ltd. with offices located at Shibuya Mark City West Building 12-1, Dougenzaka 1-Chrome, Shibuya-ku, Tokyo 150-0043, Japan, if the Software is downloaded in Japan. 19. How do I contact Intel Security/McAfee? Customer Service & Technical Support: http://service.mcafee.com The subsections below contain information regarding the local laws of certain jurisdictions that will apply to this Agreement and may supersede certain provisions as referenced herein. Australia - or consumers in Australia The benefits to you under the limited warranties in Section 11 of this Agreement are in addition to other rights and remedies of you may have under a law in relation to the goods or services to which the warranty relates. Our goods come with guarantees that cannot be excluded under Schedule 2 of the Competition and Consumer Act 2010 (Cth) (\"Australian Consumer Lawâ€). You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. This warranty is made by McAfee Security S.a.r.l., with offices located at 26, Boulevard Royal, 2440 Luxembourg, Luxembourg, but you may call 1800 998 887 with questions regarding our warranty for Australian customers. Any claims made under this warranty must be sent, at your expense, to the following address: Legal Department McAfee Australia Pty Ltd Level 20 201 Miller Street North Sydney NSW 2060 For customers located in Australia, if a tangible medium on which software was delivered is defective, you must return the defective medium to McAfee at your expense, with a copy of your receipt, within 14 days of discovering the defect. McAfee will notify you of receipt within 14 days of receiving it. THE DISCLAIMERS IN SECTIONS 11 DO NOT APPLY TO YOU TO THE EXTENT THAT AUSTRALIAN LAW DOES NOT ALLOW THE EXCLUSION OR LIMITATION OF ANY APPLICABLE STATUTORY GUARANTEES, EXPRESS OR IMPLIED WARRANTIES, CONDITIONS, REPRESENTATIONS OR . IN THAT CASE, THE EXPRESS OR IMPLIED WARRANTIES ARE LIMITED TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LIMITATIONS ON LIABILITY SET FORTH IN SECTION 12(C) DO NOT APPLY TO CONSUMERS IN AUSTRALIA. NOTHING IN THIS AGREEMENT LIMITS ANY RIGHTS YOU MAY HAVE UNDER EXISTING CONSUMER-PROTECTION STATUTES OR OTHER APPLICABLE LAWS, INCLUDING AUSTRALIAN CONSUMER LAW, THAT MAY NOT BE WAIVED BY CONTRACT IN YOUR JURISDICTION. If you downloaded the Software in Canada, unless expressly prohibited by local law, then this Agreement, the use of the Software, the relationship of the parties, and any disputes arising out of, concerning, or relating to the Agreement, including any disputes between you and us, will be governed by and construed in accordance with the laws in force in the Province of Ontario, Canada. European Union, Iceland, Norway, or Switzerland If you acquired the Software in the European Union, Iceland, Norway, or Switzerland, then national law of the country where you downloaded the Software applies. If you downloaded the Software in Japan, then this Agreement, the use of the Software, the relationship of the parties, and any disputes arising out of, concerning, or relating to the Agreement, including any disputes between you and us, will be governed by and construed in accordance with Japanese law without regard to its choice-of-law rules. For customers in the Netherlands, any automatic renewal of your original subscription will be for an indefinite term, billed in accordance with the of your subscription. You may terminate your renewed subscription any time after renewal by contacting Customer Service and providing at least 30 days' notice of your intent to terminate and we will provide a prorated refund in accordance with local law. If you do not want your subscription to renew automatically you must turn off auto-renewal in your account settings 30 days before the expiration of your initial subscription. We've noticed you're using an older version of Internet Explorer. Unfortunately the True Key website only supports IE 9+ at this time. Please upgrade your browser or try on Chrome, Firefox or Safari."
  ]
}