{
  "company": "www.guardforce.com.hk",
  "dominant_topics": [
    7,
    0,
    17,
    -1
  ],
  "topic_counts": {
    "7": 5,
    "0": 4,
    "17": 3,
    "-1": 2
  },
  "topic_descriptions": {
    "7": "ramco, payroll, aviation, en, ramco systems",
    "0": "access, information, security, data, piam",
    "17": "hid, think, like, know, really"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 4,
      "7": 5,
      "17": 3
    }
  },
  "sample_docs": [
    "A leader in ATM cash replenishment, cash collections and processing, security storage and time critical courier. One of the main areas of expertise in the overall success of Guardforce is specialized security transport services. When valuables need to be conveyed from one location to another, Guardforce has the technology, manpower and experience to get the job done right every time. For more details, please call us at 2765-2832. Our Sales & Marketing professionals would be pleased to discuss your needs and provide solutions that will add value to your business. Collection & Delivery Service ATM Management Service Wrapped Coins Supply & Coin Processing Service Security Storage Service Cash Processing Service Pick and Pack Service Sub-Treasury Services International Service Collection & Delivery Service Guardforce can provide highly reliable and secure cash and valuable collection and delivery services to reduce your risk in handling the transportation of cash and valuables. We are able to delivery this quality through the largest armoured fleet in Hong Kong that is equipped with the latest technology, professionally trained security personnel backed by full insurance coverage. ATM Management Service Guardforce provides comprehensive ATM management services, from cash replenishing, deposit envelope processing, cash depositor monitoring to attending alarm response and emergency maintenance service for machine failure. Our highly trained staff and complete ATM service can help you to develop your ATM networks without worrying about logistical problems. Wrapped Coins Supply & Coin Processing Service Exchanging and counting coins is a time consuming process that interferes with the core focus of your business. If you want to improve your company's efficiency, The Guardforce complete coin service can definitely help you. We supply all denominations of coins to meet your daily exchange need. Guardforce also has hi-tech equipment to count and verify high volume of coins. This service is particularly suitable to those business receiving coins on regular basis. Security Storage Service Guardforce's secure storage service offers you peace of mind. Our strongroom is manned 24-hours and 365-days offering over 1500 sq. feet of high security storage that includes advanced electronic access control, sophisticated alarm monitoring and recording system and color digital CCTV monitoring. Our high security storage area is up to Bank Vault standards and offers excellent short or long term secure storage. Cash Processing Service Guardforce provides a solution for handling bulk cash that will reduce your costs of processing cash in your business. Our Cash Processing Centre is in a high security area installed with real-time video recording systems and access control systems. Cash collected from your outlets are sorted, verified and consolidated into one single deposit in this Centre and them promptly deposited into your bank account. Customized management reports will be produced that will meet the requirements of your accounting department. Pick and Pack Service The pick and pack service offers you a total solution to address your need in handling phone cards, gift certificates, cash coupons and other stored value cards. The service includes the collection, packing, storage and distribution as well as inventory management. Sub-Treasury Services The sub treasury service focuses on the outsourcing need of the bank for their treasury function. The service includes the cash forecasting, cash collecting and processing and the supply of the emergency cash.",
    "UTC Fire & Security is committed to protecting the privacy of visitors to its Web site. This Statement of User Privacy and its attached of Use describe the information collected by UTC Fire & Security.com, how that information is used by UTC Fire & Security, and the of your use of this site. We encourage you to read both of these documents carefully before using this site. If you have any comments or questions, or there are other things we can do to maximize the value of this site to you, please contact us via our e-mail form. In General You can visit our Web site without identifying yourself or revealing any personal information. UTC Fire & Security monitors user traffic patterns throughout the site according to a user's domain name, browser type, date and time of access, and pages viewed. Our web servers collect the domain names but not the e-mail addresses of visitors. This information is collected in order to measure the number of visitors to our site and to determine which areas of the site users find useful based upon the amount of traffic to particular areas. UTC Fire & Security uses this information to enhance users' experience at the site and to better prepare future content based on the interests of users. On occasion a visitor to our Web site may be asked to provide personal information. In most cases, personal information is used only to respond to inquiries. UTC Fire & Security will not provide e-mail addresses or other visitor information to any non-UTC organization or partner. In some instances, UTC Fire & Security may provide links to non-UTC controlled Web sites. However, UTC Fire & Security does not control such third-party Web sites, and cannot be responsible for the content or the privacy practices employed by other sites. Cookies UTC Fire & Security may use cookies on this site. Cookies are small text files sent to and stored on users' computers that allow Web sites, such as UTC Fire & Security.com, to recognize repeat users, facilitate users' access to sites, and allow sites to compile aggregate data that will allow content improvements. Cookies do not damage users' computers or files. If users do not want cookies to be accessible by UTC Fire & Security, most browser programs allow users to deny or disable the use of cookies. Correcting or Changing Information UTC Fire & Security allows users to correct or change information submitted to UTC Fire & Security or to report problems with the site or to pose questions or concerns by sending an e-mail to us using our e-mail form. As UTC Fire & Security expands and improves this site, we will endeavor to refresh this policy. We encourage you to refer to this policy on a regular basis for updates to the policy. This policy may be modified from time to time without prior notice to its users.",
    "Want someone else to handle the daily cashflow from your outlets? Guardforce's Cash Processing Centre is a highly secured facility installed with real-time video recording and access control systems. Our trustworthy team and highly equipped operation, processes cash in a timely and cost-effective manner eliminating the need for businesses to do it themselves. Cash collected from your outlet is sorted, verified and then promptly deposited into your bank account. Customized management reports are also available to ensure we meet the requirements of your accounting department. Other Services ATM Management Services Coin Services Collection & Delivery Services Other Services ATM Management Services Coin Services Collection & Delivery Services Collection & Delivery Services",
    "Guardforce is committed to protecting the privacy of visitors to its Web site. This Statement of User Privacy and its attached of Use describe the information collected by Guardforce.com.hk , how that information is used by Guardforce, and the of your use of this site. We encourage you to read both of these documents carefully before using this site. If you have any comments or questions, or there are other things we can do to maximize the value of this site to you, please contact us via our e-mail form. You can visit our Web site without identifying yourself or revealing any personal information. Guardforce monitors user traffic patterns throughout the site according to a user's domain name, browser type, date and time of access, and pages viewed. Our web servers collect the domain names but not the e-mail addresses of visitors. This information is collected in order to measure the number of visitors to our site and to determine which areas of the site users find useful based upon the amount of traffic to particular areas. Guardforce uses this information to enhance users' experience at the site and to better prepare future content based on the interests of users. On occasion a visitor to our Web site may be asked to provide personal information. In most cases, personal information is used only to respond to inquiries. Guardforce will not provide e-mail addresses or other visitor information to any non-UTC organization or partner. In some instances, Guardforce may provide links to non-UTC controlled Web sites. However, Guardforce does not control such third-party Web sites, and cannot be responsible for the content or the privacy practices employed by other sites. Guardforce may use cookies on this site. Cookies are small text files sent to and stored on users' computers that allow Web sites, such as Guardforce.com.hk , to recognize repeat users, facilitate users' access to sites, and allow sites to compile aggregate data that will allow content improvements. Cookies do not damage users' computers or files. If users do not want cookies to be accessible by Guardforce, most browser programs allow users to deny or disable the use of cookies. Correcting or Changing Information Guardforce allows users to correct or change information submitted to Guardforce or to report problems with the site or to pose questions or concerns by sending an e-mail to us using our e-mail form. As Guardforce.com.hk expands and improves this site, we will endeavor to refresh this policy. We encourage you to refer to this policy on a regular basis for updates to the policy. This policy may be modified from time to time without prior notice to its users. Please notify us at Guardforce.com.hk if you wish to remove your information from this site.",
    "Hyperlinks Certain links provided on this site will launch Internet sites that are not under the control of UTC Fire & Security. UTC Fire & Security provides these outside links solely as a convenience to its users and the provision of any such link is not an endorsement by UTC Fire & Security of that site or any of the contents, products, or services contained or offered therein. Accordingly, UTC Fire & Security makes no representations or warranties whatsoever concerning availability of or content, including sub-links, found on those sites. When registering for, ordering or purchasing products or services from any party which is linked to this site, you will be entering into an agreement with that third party and not with UTC Fire & Security. In these cases, you should review and understand the posted by such third party and its before you register, order or purchase. Except to the extent specifically stated herein, the and of Use stated by UTC Fire & Security herein will not apply. UTC Fire & Security is committed to linking with companies that share our privacy concerns. However, we cannot and do not control the way these parties use or collect information or operate their businesses. When you link to another party's site, you should be aware that those companies may use cookies or other means to collect information about you. In this case, the UTC Fire & Security.com and will not apply. Submissions By submitting information and material to UTC Fire & Security, whether via e-mail or otherwise, including, but not limited to, feedback, questions, comments, suggestions, ideas, graphics or computer files of any type, you thereby expressly grant, or warrant, that the owner of such material has expressly granted UTC Fire & Security a royalty-free, perpetual, irrevocable, non-exclusive right and license to use, reproduce, modify, adapt, publish, translate and distribute such material (in whole or in part) worldwide and to incorporate it in other works in any form, media or technology now known or hereafter developed, subject to the UTC Fire & Security.com Statement of User Privacy. Limitation of liability Neither UTC Fire & Security nor any of its subsidiaries, employees, or other representatives shall be liable for damages arising out of or in connection with the use of this site. Under no circumstances shall UTC Fire & Security have any liability for any consequential, incidental, indirect, special, or punitive damages or costs, including, but not limited to, lost profits, business interruption, loss of information or data, or loss of goodwill, loss of or damage to property, and any claims of third parties, arising out of or in connection with the use, copying, or display of this site or its contents or any linked Web site, regardless of whether UTC Fire & Security has been advised, knew, or should have known of the possibility thereof. International users and jurisdiction This site is maintained and controlled by UTC Fire & Security in the State of Connecticut, United States of America. UTC Fire & Security makes no representation that materials on this site are appropriate or available for use at other locations outside of the United States and access to this site from territories where this site's contents are illegal is prohibited. If you access this site from locations outside the United States, you are responsible for compliance with all local laws. The laws of the State of Connecticut shall govern the content and use of this site, without giving effect to any of the conflict of law principles or rules thereof. Copyright and trademark All Web site design, text, graphics, and the selection and arrangement thereof, are the property of UTC Fire & Security and are copyright ."
  ]
}