{
  "company": "www.aidentity.org",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 12,
    "-1": 8
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3552631578947368,
    "framing_surveillance": 0.3815789473684211,
    "framing_market": 0.2631578947368421,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 12
    }
  },
  "sample_docs": [
    "biometric identification solutions solutions & services products contact emobi, a crossborder remittance platform Background Remittance. Money sent home by workers now largest source of external financing in low- and middle-income countries. It is estimated that every year, Africans, men and women who live overseas in the Diaspora transfert to their respectives countries of origin, about $50 billions US dollars. The money sent by Africans who live in the Diaspora to their home countries is meant to help their relatives back home with their essential needs such as hospital bills, school fees, utility bills, food, housing, etc. Unfortunately, half of that money goes wasted due to the presence of intermediaries and other social and administrative factors. ​ emobi eliminates middlemen, reduces the cost of transaction, creates an Identity for the unbanked and secures the transaction and identity. ​ Go directly to her website : https://www.myyobi.com solutions & services products contact emobi, a crossborder remittance platform emobi, a crossborder remittance platform Background Remittance. Money sent home by workers now largest source of external financing in low- and middle-income countries. It is estimated that every year, Africans, men and women who live overseas in the Diaspora transfert to their respectives countries of origin, about $50 billions US dollars. The money sent by Africans who live in the Diaspora to their home countries is meant to help their relatives back home with their essential needs such as hospital bills, school fees, utility bills, food, housing, etc. Unfortunately, half of that money goes wasted due to the presence of intermediaries and other social and administrative factors. emobi eliminates middlemen, reduces the cost of transaction, creates an Identity for the unbanked and secures the transaction and identity. Go directly to her website : https://www.myyobi.com",
    "biometric identification solutions solutions & services products news contact nymo, a crossborder innovative payment solution for the unbanked and underbanked. biometric identification solutions solutions & services products news contact solutions & services products news contact nymo, a crossborder innovative payment solution for the unbanked and underbanked. nymo, a crossborder innovative payment solution for the unbanked and underbanked.",
    "biometric identification solutions solutions & services products contact AIDENTITY LEGAL DISCLAIMER Please review the following which govern your use of this AIDENTITY website. By accessing, using, or downloading information from this website, you agree to be bound by these . If you do not agree with these , do not use this web site. Reproduction, distribution, or republication of any information, materials, documents, software, products, and services by any means, without the prior express written consent of AIDENTITY, is strictly prohibited. The use of any software or documentation is subject to the set forth in the applicable license agreement. Nothing in this AIDENTITY website shall be construed as conferring any license of AIDENTITY's intellectual property rights without express written permission from AIDENTITY. All rights not expressly granted herein are reserved. User Submissions Unless otherwise expressly stated, any information provided, communicated, posted or transmitted by you in connection with the AIDENTITY web site (\"User Information\") shall be deemed non-confidential and non-proprietary information. AIDENTITY shall have no obligation with respect to such User Information. You agree to hold AIDENTITY harmless for any and all User Information provided, communicated, posted or transmitted to or from this site. Trademark Information All company, product or services names may be trademarks or registered trademarks of their respective owners. Links to Third Party Sites The AIDENTITY website may contain hyper links to third party web-sites controlled by parties other than AIDENTITY. AIDENTITY is not responsible for, and does not endorse any of, the contents of such other web sites. Warranties and Disclaimers THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE ARE PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND. AIDENTITY AND ITS SUPPLIERS DISCLAIM ALL WARRANTIES RELATING TO THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES AGAINST INFRINGEMENT OF THIRD PARTY RIGHTS, MERCHANT ABILITY AND FITNES FOR A PARTICULAR PURPOSE. THE AIDENTITY WEB SITE COULD INCLUDE INACCURACIES OR OUT-DATED INFORMATION AND IS SUBJECT TO CHANGE AT ANY TIME WITHOUT NOTICE. YOUR USE OF THIS WEB SITE IS AT YOUR OWN RISK. YOU AGREE TO HOLD AIDENTITY HARMLESS FROM AND NOT SUE AIDENTITY FOR ANY CLAIMS BASED UPON USING THIS WEB SITE. Limitation of Liability NEITHER AIDENTITY NOR ITS SUPPLIERS SHALL BE RESPONSIBLE OR LIABLE WITH RESPECT TO ANY SUBJECT MATTER RELATED TO THIS WEB SITE OR ANY OTHER HYPERLINKED WEB SIDE UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY OR OTHER THEORY (A) FOR ANY DIRECT DAMAGES, (B) FOR LOSS OR INACCURACY OF DATA OR COST OF PROCUREMENT OF SUBSTITUTE GOODS, SERVICES OR TECHNOLOGY, OR (C) FOR ANY INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO LOSS OF REVENUES AND LOSS OF PROFITS. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATIONS AND EXCLUSIONS MAY NOT APPLY TO RECIPIENT. Export Restrictions You shall not and shall not allow any third-party to remove or export from the EU or allow the export or re-export of any part of the AIDENTITY web site, including the software, materials, documentation, services, or products in violation of any restrictions, laws or regulations of any EU country. Miscellaneous All matters relating to your access to or use of the AIDENTITY web site shall be governed by laws of Belgium without regard to conflicts of laws provisions thereof, and without regard to the United Nations Convention on the International Sale of Goods. Unless waived by AIDENTITY in its sole discretion, the jurisdiction and venue for actions related to the subject matter hereof shall be the Belgian courts. These are the complete and exclusive statement of the mutual understanding of the parties and these supersede and cancel all previous written and oral agreements and communications relating to the subject matter of these . Copyright Notice Copyright -2024 AIDENTITY LTD Legal Contacts If you have any questions about the information contained herein or other legal-related matters, please contact the AIDENTITY legal department at info@aidentity.org . If you have any questions about our GDPR compliance, please contact our Data Protection Officer at dpo@aidentity.org biometric identification solutions solutions & services products contact solutions & services products contact AIDENTITY LEGAL DISCLAIMER Please review the following which govern your use of this AIDENTITY website. By accessing, using, or downloading information from this website, you agree to be bound by these . If you do not agree with these , do not use this web site. Reproduction, distribution, or republication of any information, materials, documents, software, products, and services by any means, without the prior express written consent of AIDENTITY, is strictly prohibited. The use of any software or documentation is subject to the set forth in the applicable license agreement. Nothing in this AIDENTITY website shall be construed as conferring any license of AIDENTITY's intellectual property rights without express written permission from AIDENTITY. All rights not expressly granted herein are reserved. User Submissions Unless otherwise expressly stated, any information provided, communicated, posted or transmitted by you in connection with the AIDENTITY web site (\"User Information\") shall be deemed non-confidential and non-proprietary information. AIDENTITY shall have no obligation with respect to such User Information. You agree to hold AIDENTITY harmless for any and all User Information provided, communicated, posted or transmitted to or from this site. Trademark Information All company, product or services names may be trademarks or registered trademarks of their respective owners. Links to Third Party Sites The AIDENTITY website may contain hyper links to third party web-sites controlled by parties other than AIDENTITY. AIDENTITY is not responsible for, and does not endorse any of, the contents of such other web sites. Warranties and Disclaimers THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE ARE PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND. AIDENTITY AND ITS SUPPLIERS DISCLAIM ALL WARRANTIES RELATING TO THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES AGAINST INFRINGEMENT OF THIRD PARTY RIGHTS, MERCHANT ABILITY AND FITNES FOR A PARTICULAR PURPOSE. THE AIDENTITY WEB SITE COULD INCLUDE INACCURACIES OR OUT-DATED INFORMATION AND IS SUBJECT TO CHANGE AT ANY TIME WITHOUT NOTICE. YOUR USE OF THIS WEB SITE IS AT YOUR OWN RISK. YOU AGREE TO HOLD AIDENTITY HARMLESS FROM AND NOT SUE AIDENTITY FOR ANY CLAIMS BASED UPON USING THIS WEB SITE. Limitation of Liability NEITHER AIDENTITY NOR ITS SUPPLIERS SHALL BE RESPONSIBLE OR LIABLE WITH RESPECT TO ANY SUBJECT MATTER RELATED TO THIS WEB SITE OR ANY OTHER HYPERLINKED WEB SIDE UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY OR OTHER THEORY (A) FOR ANY DIRECT DAMAGES, (B) FOR LOSS OR INACCURACY OF DATA OR COST OF PROCUREMENT OF SUBSTITUTE GOODS, SERVICES OR TECHNOLOGY, OR (C) FOR ANY INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO LOSS OF REVENUES AND LOSS OF PROFITS. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATIONS AND EXCLUSIONS MAY NOT APPLY TO RECIPIENT. Export Restrictions You shall not and shall not allow any third-party to remove or export from the EU or allow the export or re-export of any part of the AIDENTITY web site, including the software, materials, documentation, services, or products in violation of any restrictions, laws or regulations of any EU country. Miscellaneous All matters relating to your access to or use of the AIDENTITY web site shall be governed by laws of Belgium without regard to conflicts of laws provisions thereof, and without regard to the United Nations Convention on the International Sale of Goods. Unless waived by AIDENTITY in its sole discretion, the jurisdiction and venue for actions related to the subject matter hereof shall be the Belgian courts. These are the complete and exclusive statement of the mutual understanding of the parties and these supersede and cancel all previous written and oral agreements and communications relating to the subject matter of these . Copyright Notice Copyright -2024 AIDENTITY LTD Legal Contacts If you have any questions about the information contained herein or other legal-related matters, please contact the AIDENTITY legal department at info@aidentity.org . If you have any questions about our GDPR compliance, please contact our Data Protection Officer at dpo@aidentity.org Please review the following which govern your use of this AIDENTITY website. By accessing, using, or downloading information from this website, you agree to be bound by these . If you do not agree with these , do not use this web site. Reproduction, distribution, or republication of any information, materials, documents, software, products, and services by any means, without the prior express written consent of AIDENTITY, is strictly prohibited. The use of any software or documentation is subject to the set forth in the applicable license agreement. Nothing in this AIDENTITY website shall be construed as conferring any license of AIDENTITY's intellectual property rights without express written permission from AIDENTITY. All rights not expressly granted herein are reserved. Unless otherwise expressly stated, any information provided, communicated, posted or transmitted by you in connection with the AIDENTITY web site (\"User Information\") shall be deemed non-confidential and non-proprietary information. AIDENTITY shall have no obligation with respect to such User Information. You agree to hold AIDENTITY harmless for any and all User Information provided, communicated, posted or transmitted to or from this site. All company, product or services names may be trademarks or registered trademarks of their respective owners. Links to Third Party Sites The AIDENTITY website may contain hyper links to third party web-sites controlled by parties other than AIDENTITY. AIDENTITY is not responsible for, and does not endorse any of, the contents of such other web sites. THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE ARE PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND. AIDENTITY AND ITS SUPPLIERS DISCLAIM ALL WARRANTIES RELATING TO THE INFORMATION, DOCUMENTATION, SOFTWARE, PRODUCTS, AND SERVICES CONTAINED ON THE AIDENTITY WEB SITE, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES AGAINST INFRINGEMENT OF THIRD PARTY RIGHTS, MERCHANT ABILITY AND FITNES FOR A PARTICULAR PURPOSE. THE AIDENTITY WEB SITE COULD INCLUDE INACCURACIES OR OUT-DATED INFORMATION AND IS SUBJECT TO CHANGE AT ANY TIME WITHOUT NOTICE. YOUR USE OF THIS WEB SITE IS AT YOUR OWN RISK. YOU AGREE TO HOLD AIDENTITY HARMLESS FROM AND NOT SUE AIDENTITY FOR ANY CLAIMS BASED UPON USING THIS WEB SITE. NEITHER AIDENTITY NOR ITS SUPPLIERS SHALL BE RESPONSIBLE OR LIABLE WITH RESPECT TO ANY SUBJECT MATTER RELATED TO THIS WEB SITE OR ANY OTHER HYPERLINKED WEB SIDE UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY OR OTHER THEORY (A) FOR ANY DIRECT DAMAGES, (B) FOR LOSS OR INACCURACY OF DATA OR COST OF PROCUREMENT OF SUBSTITUTE GOODS, SERVICES OR TECHNOLOGY, OR (C) FOR ANY INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO LOSS OF REVENUES AND LOSS OF PROFITS. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATIONS AND EXCLUSIONS MAY NOT APPLY TO RECIPIENT. You shall not and shall not allow any third-party to remove or export from the EU or allow the export or re-export of any part of the AIDENTITY web site, including the software, materials, documentation, services, or products in violation of any restrictions, laws or regulations of any EU country. All matters relating to your access to or use of the AIDENTITY web site shall be governed by laws of Belgium without regard to conflicts of laws provisions thereof, and without regard to the United Nations Convention on the International Sale of Goods. Unless waived by AIDENTITY in its sole discretion, the jurisdiction and venue for actions related to the subject matter hereof shall be the Belgian courts. These are the complete and exclusive statement of the mutual understanding of the parties and these supersede and cancel all previous written and oral agreements and communications relating to the subject matter of these . If you have any questions about the information contained herein or other legal-related matters, please contact the AIDENTITY legal department at info@aidentity.org . If you have any questions about our GDPR compliance, please contact our Data Protection Officer at dpo@aidentity.org",
    "biometric identification solutions solutions & services products news contact emobi, a crossborder innovative payment platform for the unbanked and underbanked. biometric identification solutions solutions & services products news contact emobi, a crossborder innovative payment platform for the unbanked and underbanked. solutions & services products news contact emobi, a crossborder innovative payment platform for the unbanked and underbanked.",
    "NIMC NIN REGISTRATION BE NOTIFIED WHEN WE START THE REGISTRATION OF THE NATIONAL IDENTITY NUMBER ! Aidentity is technical partner of UGS Technologies, official agent of NIMC, the National Identity Management Corporation Nigeria, to register the Nigerian Diaspora in the United Kingdom & Europe, and so obtain the National Identity Number (NIN). The NIN is part of the National e-ID card issuance, identity verification as well as data harmonization and authentication. Aidentity will be present in the United Kingdom, The Netherlands, Germany, Belgium, France, Luxemburg and Spain (more countries will follow). The process to obtain a National Identity Number exists out of 2 steps. The process of obtaining the National Identity Number consists of two steps. First, the filling of an online registration and appointment form and secondly, the physical presence of the enrollee at the location where his/her biometric and biographical data will be captured or enrolled by us. Lastly: To smooth the process, you may now subscribe for an appointment. Once subscribed, you will receive at time, by email an invitation to book your appointment. i want to be notified when the bookings are open. NIMC NIN REGISTRATION BE NOTIFIED WHEN WE START THE REGISTRATION OF THE NATIONAL IDENTITY NUMBER ! Aidentity is technical partner of UGS Technologies, official agent of NIMC, the National Identity Management Corporation Nigeria, to register the Nigerian Diaspora in the United Kingdom & Europe, and so obtain the National Identity Number (NIN). The NIN is part of the National e-ID card issuance, identity verification as well as data harmonization and authentication. Aidentity will be present in the United Kingdom, The Netherlands, Germany, Belgium, France, Luxemburg and Spain (more countries will follow). The process to obtain a National Identity Number exists out of 2 steps. The process of obtaining the National Identity Number consists of two steps. First, the filling of an online registration and appointment form and secondly, the physical presence of the enrollee at the location where his/her biometric and biographical data will be captured or enrolled by us. Lastly: To smooth the process, you may now subscribe for an appointment. Once subscribed, you will receive at time, by email an invitation to book your appointment. i want to be notified when the bookings are open. BE NOTIFIED WHEN WE START THE REGISTRATION OF THE NATIONAL IDENTITY NUMBER ! Aidentity is technical partner of UGS Technologies, official agent of NIMC, the National Identity Management Corporation Nigeria, to register the Nigerian Diaspora in the United Kingdom & Europe, and so obtain the National Identity Number (NIN). The NIN is part of the National e-ID card issuance, identity verification as well as data harmonization and authentication. Aidentity will be present in the United Kingdom, The Netherlands, Germany, Belgium, France, Luxemburg and Spain (more countries will follow). The process to obtain a National Identity Number exists out of 2 steps. The process of obtaining the National Identity Number consists of two steps. First, the filling of an online registration and appointment form and secondly, the physical presence of the enrollee at the location where his/her biometric and biographical data will be captured or enrolled by us. Lastly: To smooth the process, you may now subscribe for an appointment. Once subscribed, you will receive at time, by email an invitation to book your appointment. i want to be notified when the bookings are open. Aidentity is technical partner of UGS Technologies, official agent of NIMC, the National Identity Management Corporation Nigeria, to register the Nigerian Diaspora in the United Kingdom & Europe, and so obtain the National Identity Number (NIN). The NIN is part of the National e-ID card issuance, identity verification as well as data harmonization and authentication. Aidentity will be present in the United Kingdom, The Netherlands, Germany, Belgium, France, Luxemburg and Spain (more countries will follow). The process to obtain a National Identity Number exists out of 2 steps. The process of obtaining the National Identity Number consists of two steps. First, the filling of an online registration and appointment form and secondly, the physical presence of the enrollee at the location where his/her biometric and biographical data will be captured or enrolled by us. Lastly: To smooth the process, you may now subscribe for an appointment. Once subscribed, you will receive at time, by email an invitation to book your appointment. -2024 by AIDENTITY a subsidiary of Ember Eagle Ltd. 71-75 Shelton Street- Covent Garden - WC2H 9JQ London- United Kingdom UNGM United Nations licensed #176373 privacy - legal - gdpr - Anti Bribery and Corruption Policy ATHLIS, MyNIN, SmartID, QeS, CIAS, MABIS, Silent Watch, BioSSL, Nymo, Emobi, Yobi, Aidentity are registered trademarks ® and under copyright ©."
  ]
}