{
  "company": "www.entefy.com",
  "dominant_topics": [
    0,
    2
  ],
  "topic_counts": {
    "0": 2,
    "2": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.2285714285714285,
    "framing_surveillance": 0.0857142857142857,
    "framing_market": 0.6857142857142857,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "0": 2,
      "2": 2
    }
  },
  "sample_docs": [
    "By using this website you agree to accept all of this agreement. Do not use this website if you disagree with or do not agree to be bound by all of the following : The website you have entered is operated by or on behalf of Entefy Inc. (\"Entefy\"). Your use of this website indicates that you have read and accepted our privacy practices, as outlined in our as well as the following of use. At any time, Entefy reserves the right to modify such of use for any reason or no reason at all. Changes will be posted here and unless otherwise disclosed, any change becomes effective immediately upon posting. Your continued use of this website after the posting of any change in the shall constitute your acceptance to be bound by any such changes. The information and features included in this website are only for informational or entertainment purposes and have been put together from a variety of sources. By accessing or linking to this website, you assume the risk that the information on this website may be incomplete, inaccurate, out of date, or may not meet your needs and requirements. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, video and audio clips, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). While using the website, you agree not to commit or participate in any acts that may be found harmful or otherwise objectionable to Entefy, its employees, agents, affiliates, associates, other website users or any other person. Entefy makes no representation or warranty whatsoever regarding the completeness, accuracy, currency or adequacy of any information, facts, views, opinions, statements or recommendations contained on this website and/or the Material. Reference to any product, process, publication or service of any third party by trade name, domain name, trademark, service mark, logo, manufacturer or otherwise does not constitute or imply its endorsement or recommendation by Entefy. Views and opinions of users of this website do not necessarily state or reflect those of Entefy. Users are responsible for seeking the advice of professionals, as appropriate, regarding the information, opinions, advice or content available at this website. By using this website you agree to indemnify, defend and hold harmless Entefy and its employees, owners, officers, affiliates, licensors, assigns, from and against any third party claims, damages, losses, and liabilities as well as all costs and expenses related to defense arising out of or relating to your breach of your representations or agreements hereunder. Your violation of any of these or any law, your used of this website or the material violation of these , information or material transmitted through your computer that infringes any intellectual property rights including but not limited to copyright, trademark, trade secret, or patent, you will cooperate fully and reasonably in Entefy's defense of any claim. Entefy reserves the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you. Except as otherwise described in the website's , anything you submit to Entefy through this website or otherwise, including, without limitation, any ideas, data, questions, artwork, comments, suggestions, or personal information (jointly and severally, \"Submissions\"), is and will be treated as non-confidential and non-proprietary and we will not be liable for any use or disclosure. You hereby irrevocably grant, transfer, sell and assign to Entefy all right, title and interest in and to those Submissions, including, without limitation, all patents, trademarks, service marks, trade names, trade identities, copyrights, trade secrets, logos, domain names, know-how, source code and object code, mask-work rights, inventions, moral rights, author's rights, algorithms, rights in packaging, goodwill and other intellectual property and proprietary rights that may subsist in the Submissions. You further agree that Entefy will have the unfettered right throughout the universe, in perpetuity, without any credit or compensation to you, to use, reuse, modify, alter, display, archive, publish, license, perform, reproduce, disclose, transmit, publish, broadcast, post, sell, translate, create derivative works of, or distribute any Submissions or portions of any Submissions in any form, media, software or technology of any kind now known or developed in the future for any purposes whatsoever including, without limitation, developing, manufacturing and marketing products using such information. You hereby acknowledge and agree that your relationship with Entefy is not a confidential, fiduciary, or other special relationship, and that your decision to submit any material to Entefy does not place Entefy in a position that is any different from the position held by members of the general public with regard to your Submissions. You hereby waive any moral rights you may have in and to any of your Submissions, even if such material is altered or changed in a manner not agreeable to you. You represent that any Submissions are original with you and do not infringe upon, misappropriate or violate the rights of any third parties, including, without limitation, any intellectual property rights, rights of publicity or privacy or any other proprietary rights. You agree to execute any documents and take all steps that Entefy determines are necessary to affect the intentions of these . You agree and understand that Entefy is not obligated to use any Submission you make to Entefy through the website or otherwise and you have no right to compel such use. Finally, you acknowledge that, with respect to any claim you may have relating to or arising out of a Entefy's actual or alleged exploitation or use of any Submission, the damage, if any, thereby caused will not be irreparable or otherwise sufficient to entitle you to injunctive or other equitable relief or to in any way enjoin the production, distribution, exhibition or other exploitation of any production based on or allegedly based on the Submission, and your rights and remedies in any such event shall be strictly limited to the right to recover damages, if any, in an action at law. Violations and Additional Policies Entefy will determine your compliance with these in its sole discretion and its decision shall be final and binding. If any provision of these is found to be invalid by any court having competent jurisdiction, the invalidity of such provision will not affect the validity of the remaining provisions of these , which will remain in full force and effect. The section titles in these are for your convenience only and do not have any legal or contractual effect. If you have any questions, comments or concerns about our website or these of Use, you may contact us at contact@entefy.com .",
    "Play intro Your browser does not support the video tag. The universal communicator Untying the knots of digital interaction A dozen apps to connect with a dozen people entangles something perfectly natural: conversation. Entefy is untying the knots, using big ideas to create new technologies for digital communication – simplifying your interactions and creating space in your life to do more. ABOUT US You at the center Entefy is rewriting the code of digital interaction. Our universal communicator is a new tool for people-centric communication that puts you at the center of your hyper-connected world. It works on your favorite devices and gives you access to your digital universe whenever and wherever you need it. Entefy is built for the Internet of Things but designed for the Internet of People. OUR STORY In Short At Length Founders Entefy was born to rein in the growing chaos in communication and digital interaction. We are solving a pressing problem: the Internet generated a rush of amazing new technologies, then piled all these capabilities on our shoulders—a burden of devices, apps, protocols, web services, notifications. Something as innate as communication feels less and less instinctive. Entefy is not making an app for a demographic. We want to give anyone who communicates, anywhere on the planet, a new tool—a universal communicator —to unlock human potential and make connectedness natural again. The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. Read More OUR STORY At Length The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. We consume communication in huge amounts. Like air and water, interaction is ubiquitous, a constant presence. On any given day, 500 million thoughts are tweeted, 154 billion emails are composed, and 16 billion words are posted to Facebook. And we're not at any sort of peak. Not even close. These numbers are growing exponentially as more people globally join this hyper-connected world. The only thing in digital communication not growing is our capability for managing these interactions. But we've lost our way. There were no security backdoors in telegrams, no metadata breaches on the Pony Express, no ads embedded in smoke signals. In digital communication alone, people spend an average of 3 hours a day sending or reviewing messages, in part because our everyday conversations are distributed across a variety of devices, applications, formats, and operating systems. This fragmentation has forced us to accept inconsistency and inefficiency, not to mention unprecedented threats to privacy and security. All these devices and services represent wonderful improvements in point productivity. They let you do one particular thing better. But all these devices and services come at the expense of increased complexity. Standing amid a chaos of tools and messages and platforms and apps, the challenge before us is to manage this dynamic environment, to connect all of our communication channels in a way that enable a seamless conversation. Enter Entefy. We envision a future where communication is again natural and instinctive. Where technology serves us, and not the other way around. Where a new chapter in the human story can be written. Entefy's co-founders Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Read More OUR STORY Founders Entefy's co-founders, Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Brienne is a full-stack entrepreneur. She leads a variety of initiatives at Entefy including its Talent Force. Brienne set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. She has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math (STEM). She is being featured in the documentary film, \" She Started It ,\" highlighting women tech founders. CORE VALUES Innovation Drive Curiosity Trust Agility The stories of humanity's most remarkable thinkers—Leonardo Da Vinci, Galileo Galilei, Alexander Graham Bell, Nikola Tesla, Richard Feynman—show that more than mere necessity drives innovation. And not just any innovation but rather courageous innovation. The rare breed of innovation born in difficult environments fraught with obstacles and yet succeeds for the benefit of all. Central to their diverse stories are traits like curiosity, drive, and trust in their own capabilities: Georgia O'Keefe began life in a rural Wisconsin farmhouse, receiving a limited and conventional artistic training. Yet through years of effort and practice, she developed a distinctive style that influenced Modernism while remaining perennially popular with the public. Thomas Edison is credited with more than 2,000 patents and dozens of inventions, but also led business ventures in mining, construction, and public utilities. Benjamin Franklin excelled as an inventor but was also a scientist, a businessperson, a publisher, an author, a diplomat—and a Founding Father. At Entefy, we are inspired by these extraordinary examples of curiosity, drive, and wonder. We believe that Entefy's inventions will mark an inflection point in the history of communication technology, a point in time when many strands come together. When innovation leads to meaningful improvement in people's lives. Persistence. Grit. Moxie. Call it what you want, you know it when you see it. Drive defines that rare person with a vision to upend a paradigm or improve our understanding of the world. We see this spirit in Marie and Pierre Curie's work. To test their theories, they needed the very rare compound radium chloride, which does not occur naturally in its pure state. So over four years, Marie Curie refined a ton of ore to isolate a mere 100 milligrams of the substance. Four years work for a few granules of material. But Marie found great satisfaction in the work: \"We were very happy,\" Marie wrote. \"We lived in a preoccupation as complete as that of a dream.\" This same drive was present in Thomas Edison's work: he tested hundreds of different filaments for his incandescent bulb before selecting bamboo. His famous adage that \"Genius is one percent inspiration, ninety-nine percent perspiration\" was well-grounded in reality. At Entefy, we are solving big, complex problems. We draw inspiration from those who have demonstrated rugged persistence to overcome immense obstacles. We constantly revisit, discard, rework. We do what it takes to get it just right. Richard Feynman, one of the preeminent physicists of the 20th century, was renowned for the breadth of his interests beyond the Physics for which he received his Nobel Prize. He taught himself the bongo drums, and took a crack at decrypting ancient Mayan inscriptions. He said in his autobiography, \"I'm always looking, like a child, for the wonders I know I'm going to find.\" At Entefy, we feel the same way about the people and the world around us—limitless complexity so deep as to be awe-inspiring. We are excited to be working on intricate problems that defy easy resolution. We are motivated by sheer curiosity: What else can be discovered? There is magic out there still to be found. The causeway that links one person to another is trust. We see trust in the commitment of a handshake, and in our fidelity to people we never meet. Many of us engage in a collaborative exercise in trust every day: the commute. The average American adult gets behind the wheel 1,102 times a year, driving 10,600 miles over 280 hours. 210 million individuals and 253 million vehicles. Think of the potential risk inherent in driving a two-ton vehicle at 60 miles per hour at an oncoming vehicle just a dozen feet away. Driving is an exercise in trust. Trust in manufacturers, regulators, dealerships, and other drivers. We entrust our lives to our fellow citizens every day. At Entefy, we are motivated by trust in humankind in a shared future. We do not believe that a great product is built by one person, but generated by the collective efforts of a team. We trust each other, and extend that trust to the promise we make to our customers. We often think of \"agility\" in athletic : the grace of Baryshnikov or the wizardry of Michael Jordan. But agility encompasses intellectual flexibility as well. The economist John Maynard Keynes is famous for saying, \"When my information changes, I alter my conclusions. What do you do, sir?\" Generating innovation when technology is always changing, when our understanding of the world is always changing, requires mental flexibility to rival the physicality of a ballerina or the power of a sports legend. Entefy is solving complex technological problems that have resisted resolution for years. Our first ideas are not always our best, but we backtrack and rework and reexamine our assumptions. It takes agility to bring a first-ever solution to an increasingly digital world. FAQ What is it like to work at Entefy? Why should I use Entefy? What industries will benefit from Entefy's offerings? Just what does Entefy do? Is there any way to try out the universal communicator? Read More FAQ What is it like to work at Entefy? Have you ever met a young person with a wise soul? That's Entefy. Around our offices there is a blend of energy, smarts, and kinship that's simply magnetic. The excitement in the air comes from a shared sense of being present at the birth of something new and consequential. The mantra \"better is better\" guides our work, leaving little room for egos, politics, or anything else that can get in the way of progress. Like a tight-knit family, we work together, eat together, joke together. There is an uncommon degree of friendship and shared purpose. Whether you're someone who has amassed decades of professional experience or is just starting out, you're unlikely to find another place that parallels Entefy. The team is remarkable, the goal is electrifying, and the work is highly meaningful. Why should I use Entefy? There have been countless technology revolutions, from landline telephones to smartphones, from manual-drive cars to self-driving cars, from snail mail to email, from bulky CRT TVs to LED flat screens. Entefy's technology advancement is yet another giant leap forward. Entefy lets you communicate with people, smart things, and services, easier, faster, smarter, and safer than previously imaginable. This is not an evolution or minor improvement. Entefy represents a step-change in people's lives. It is one of those changes where you will wonder how you got along without it. If you care about personal efficiency, personal effectiveness, and personal privacy, you will want to use Entefy. What industries will benefit from Entefy's offerings? Digital interaction is at the core of our platform, so every industry can benefit from Entefy's universal communicator . That said, there are certain attributes that make Entefy especially valuable to particular industries. For example, industries dependent on high levels of communication, industries that collect and transmit large volumes of confidential data, industries where workers have a higher-than-average use of multiple applications, industries with high volumes of information sharing in complex environments, industries where employees are highly mobile, industries that are characterized by high levels of regulation – all of these are likely to especially benefit from Entefy. For a more detailed list, see our Work Better page. Just what does Entefy do? Entefy puts you at the center of your digital world by letting you access and manage people, smart things, and services in your life from a single application on all of your favorite devices. No more fooling around with multiple platforms, services, and protocols just to find when or where you promised to meet someone. No more hopping in and out of multiple apps to take care of mundane tasks. No more keeping track of dozens of passwords. No more searches that come up empty when you know the file is there (somewhere). And no more worries about the security of your personal data. In addition to all of this, Entefy's universal communicator puts the power of advanced AI in your hands. It works by unifying communications, search, smart things, contacts, and files, and seamlessly blends voice, pictures, audio, and text—all with perfect syncing across smartphone, tablet, laptop, and smart watch. However it is that you connect with your friends and colleagues, Entefy is your single platform for making your personal technology ecosystem simpler and easier. You've never seen anything like it. Is there any way to try out the universal communicator ? Thank you for your interest. We plan to host an early access beta test, but no date has yet been set. The best way to get your hands on Entefy is to for early access. There is already quite a bit of interest in our universal communicator —in one study, 95.6% of the people surveyed indicated their interest in using our solution. With an intelligent communication platform this expansive and intricate, our team recognizes the value of rigorous, relentless development and testing. We are working hard to chisel everything to perfection and get it into your hands as soon as possible. Why is the Entefy team so global? We are solving technological problems that have stymied some of the smartest and deepest pocketed companies. The composition of our team is one reason why we are succeeding where others have not. Entefy is pursuing sky-high goals, so we need stratospheric talent. We are completely dedicated to finding the right people. Not good-enough people. Not close-enough people. But rather, the right people to solve perhaps one of the most pervasive challenge in technology— the AI-powered communication platform for everyone and everything . Achieving these goals requires people with a formidable combination of skills, experiences, knowledge, values, and behaviors. We won't compromise. There are not a lot of people that meet our standards. So we cast a wide net to find the right people. We did not set out to make the Entefy team so international, it just so happens that the best of the best come from all over. How soon will the universal communicator be available? We are still in development and have not announced an official release date. The best way to keep in touch with us and find out when we announce our private beta is to for early access. How will Entefy achieve what others have not? The right team, building the right technology, pursing the right opportunity. Entefy operates at the intersection of communication, Internet of Things, cyber privacy, and artificial intelligence. We are creating ground-breaking technology, have a unique approach to market, and have assembled the right team to bring it all together. Our team is highly nimble with an incredibly diverse set of skills. Internally, we refer to the Entefyers as a chili pepper team—small yet potent. Cumulatively, we have 460 years of combined business and technology experience, expertise that prepares us for a wide range of problem solving. At the core of our universal communicator is a smart platform that leverages advanced computer vision and natural language processing to enable a highly intuitive user experience. We have filed 31 patents so far—in key areas of communication, artificial intelligence, security, search, and big data—and we're just getting started. As a young company, we have no historical burden that limits how we do things, no existing technology architectures that require expensive modification, no cultural norms created by earlier business circumstances, no legacy business model that threatens a better, new business model. Entefy can pursue the best solutions independent from the systems and architectures of the past. How is Entefy inventing the future? Human interaction is about as fundamental as it gets. In fact, our ability to communicate is a large part of what defines humans and humanity. New technologies like smartphones and message apps have shown us the potential for new forms of communication, but their implementation has in large part done more to complicate people's lives than improve them. Entefy is creating the communication technologies that will bring us into a new era. We are rewriting the code of digital interaction to seamlessly connect people with everyone and everything in their lives. By building our universal communicator from the ground up and with a completely fresh vision, we are creating something so new and so universal, that the future will be changed for the better. Dramatically so. How do you know what users want? The idea for Entefy's universal communicator grew out of conversations between our sibling co-founders Alston and Brienne . They observed how their friends and the people around them were using technology, or rather, letting technology use them. From these observations grew a vision of universal impact, a path for improving the lives of nearly everyone. That vision has guided our actions since then. Communication is about people, so we work closely with future users to ensure we are designing a product that makes a difference. We test our assumptions again and again—we survey, we interact with users, we run trials with advisors and investors. For example, we recently conducted a confidential survey among 1,500 U.S. professionals regarding their communication and digital interaction requirements. We were pleased to discover that 95.6% of these users were interested or very interested in using an offering that included the attributes of Entefy. Can Entefy keep my data secure? Entefy considers privacy and security to be central to the user experience. It is unavoidably the case that the more information Entefy has about the user, the more useful Entefy is to the user. It is also the case that different users have different preferences and therefore make different trade-off choices between convenience and security. Recognizing this, Entefy has designed the universal communicator so that you, the user, can make the decisions about what level of security and data access is most appropriate. And you can make these decisions dynamically to apply the correct level privacy and security to the particular situation. It is important to note that we have architected our system in such a fashion that Entefy maintains very little customer data. Between enabling customer choice and designing the system with security in mind from the ground up, we are able to deliver remarkable services with unprecedented security and privacy. Why doesn't Entefy sell ads? Our vision for universal communication has no room for advertising. We believe that, when it comes to people's conversations, advertising only serves as a distraction and, frankly, a disservice to users. Our people-centric approach keeps us focused on you, the user, not advertisers who would like to gain access to your information in order to sell you more of what you don't need. I only use my smartphone and my computer, no other devices. Does it make sense to use Entefy? Even if you use only a single device, Entefy delivers increased efficiency and effectiveness to your life. It is not just about the number of devices you use but also the number of apps and services. The more intricate and complex your digital universe, the more you will benefit from our universal communicator . Given that you are a small company with many people from different backgrounds, how do you order food for everyone? Lunches are an important part of the day at Entefy. The entire team pauses their work to assemble and engage in that oldest of traditions, breaking bread. Our conversations are both serious and bantering, discussing anything that comes to mind. With techies, business guys, and creatives at the table, no topic is off limits. When it comes to food, the team ranges from carnivores to pescetarians and vegetarians to vegans. We have people who need to eat gluten-free or have other allergies. And we can't forget the juicers and the raw food lovers. As you can imagine, meals at Entefy are quite the experience. We wouldn't have it any other way. Is the universal communicator primarily for professionals or will it be useful to anyone? Entefy's universal communicator is for anyone who communicates digitally. The more communication and digital interaction in your life, the more value Entefy brings. Even for a single person, with a single device, using just a few applications and services, Entefy delivers big value in of simplicity, speed, and security. What kind of impact will Entefy have? Every time there is a technology-enabled disruption (the printing press, the microprocessor, the graphical user interface, the Internet) there are certain predictable consequences. More information is made accessible, communication between and among people is increased, productivity and GDP is expanded, entrenched interests are disrupted, societal concerns about stress rise. We will likely see something similar with Entefy. Historically, there is an initial phase of resistance to technological disruption. But in the next phase, the potential for increased productivity translates to more choices, more opportunities, more freedom. Entefy will help people live better by removing the prevalent chaos and fragmentation that now exists in the digital world. Can I be involved in beta testing? Yes. We encourage you to for early access here . Is Entefy hiring? Yes. We are growing fast and need all the exceptional talent we can find. Check out our Careers section for available opportunities at Entefy. Where are you located? We have teams located internationally, with our headquarters in Palo Alto, the heart of Silicon Valley. How much money have you raised? Entefy has raised $14.8 million in venture funding to date. How many team members are there? Our team has 30 talented professionals and is growing rapidly. Meet the Entefyers . How old is Entefy? Entefy was founded in 2012 by sibling co-founders, Alston and Brienne . It all started on a napkin . What does the name Entefy signify? Entefy derives from \"entify,\" which means \"bring to life\" and that, quite simply, is what we are trying to do. Bring to life a future where people are more important than protocols, where people are placed at the center of their digital universe, and where people are able to communicate securely and seamlessly with everyone and everything in their lives. IMPACT Impact first. Everything else will follow. Select a meaningful problem. Recruit an exceptional team. Focus on real solutions. Change people's lives. Impact is a foundational concept at Entefy. We believe that if we are going to spend time solving a problem, we should make it the biggest, hardest problem we can find. Impact grows from the people on our team. Entefy Co-founder Brienne, who leads our Talent Force, described recruiting in of assembling a \"chili pepper\" team: small yet potent. Professionals with a 360-degree holistic viewpoint. The type of people who make a 10x impact. How do we know we've made an impact? By our firsts, bests and mosts—yardsticks that measure success. INVESTORS Fuel and inspiration In the Entefy family, our investors are the supportive aunts and uncles who provide the fuel and inspiration for us to do our best work. Entefy has attracted accomplished technologists and executives such as Wim Roelandts, Chairman of Applied Materials, Duncan Niederauer, former CEO of NYSE Euronext, Peter Detkin, Co-founder of Intellectual Ventures, Ed Oates, Co-founder of Oracle, and Keith Taylor, CFO of Equinix. BOARD & ADVISORS Wisdom and experience The confidence of youth can be a compelling force in creating the future. The wisdom of years of experience can forestall many missteps. We believe Entefy has forged a compelling balance of the two poles. Our Board and circle of advisors bring a breadth and depth of experience that informs our disciplined approach to the market. Alston Ghafourifar Chairman Brienne Ghafourifar Board Member Wim Roelandts Board Member Chairman of Applied Materials, Inc. Fmr. Chairman & CEO of Xilinx Lily Sarafan Board Member CEO of Home Care Assistance ADVISORS Peter Detkin Sr. Advisor Founder & Vice Chairman Intellectual Ventures Keith Taylor Advisor CFO Equinix Jeff Risher Advisor Fmr. Head Of Patent Licensing & Strategy At Apple Ed Oates Advisor Co-Founder Oracle Alex Lubar Advisor Global CMO McCann Worldgroup Andreas Ramos Advisor Global Digital Marketing Pirooz Parvarandeh Advisor Fmr. CTO of Maxim Integrated Products Nelson Chan Advisor Online Partnership Group Google Barry Katz Visionary Circle IDEO Fello & Professor (Stanford & CCA) John Grimley Visionary Circle Founder & Principal TJW Capital Management Charlie Perrell Advisor Co-Founder NetApp Keith Newman Advisor President Newman Media Adam Elegan Visionary Circle Director KKR Karen Williams Visionary Circle Lecturer, Communication Expert Chris Lalli Visionary Circle Managing Partner CapAccel, LP Robin Yeganeh, PhD Visionary Circle Clinical Professor Of Psychology UC Berkeley Wayne Michelsen Visionary Circle Distinguished Member Of Technical Staff ARRIS Fereshteh Khodadad Visionary Circle Real Estate Spanta Ashjaee Advisor President Valley Digital Technologies Lawrence E. Martin Visionary Circle Multifaceted Visionary Rob Trammell Visionary Circle Principal Abbott Stringham & Lynch Ray Scheaffer Visionary Circle Managing Principal Abbott Stringham & Lynch Maria Constantino-Roelandts Visionary Circle President Maria & Wim Roelandts Foundation Kenneth Cala Visionary Circle Founder & Director Of Planning Lowery Thomas LLP John Galbraith Visionary Circle CEO Galbraith Ventures Nanci Kauffman Visionary Circle Head Of School Castilleja Arya Mortazavi Visionary Circle Global Supply Chain Manager Lam Research Corp. Anthony Lee Visionary Circle Founder & President Coeur Values Chili pepper team: small yet potent Entefyers are inventors, engineers, and business leaders working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our passion is people, our roots are in technology, and our mission is helping them work better together. ENTEFYERS Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. Read More ENTEFYERS Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. We have people as young as seventeen and as old as seventy-eight. Cumulatively, we have centuries of experience, overwhelmingly in the high-technology sector but with a good dose of some dozen other industries as well, including consumer products, education, energy, manufacturing, retail, and utilities. Our executive team has deep experience in all major aspects of a corporation including finance, operations, technology, sales, and product development. Our senior leadership also has the experience of holding 26 Board of Director positions. Educationally, our people come primarily from a STEM background. We do have a scattering of economics, arts, political sciences, design, and other degrees. In addition, we have among us multiple MBAs and PhDs. We have intellectual horsepower and variety. This strength is reflected in the fact that our small team has produced hundreds of commercial apps, products, and other market solutions, not to mention more than 100 articles, books, and other publications. Alston Ghafourifar CEO & Co-Founder Rudd Canaday Product Force Sr. Software Architect Kostas Rapantzikos Product Force Sr. AI Scientist Brienne Ghafourifar Co-Founder Talent Force Steve Epstein Business Force George Vasilakis Product Force Software Engineer Banafsheh Akhlaghi Growth Force Strategic Partnerships Frank Bailinson Growth Force User Acquisition & Monetization Christos Varytimidis Product Force Machine Learning & AI Engineer Darya Gol Growth Force Creative Services Theo Raios Product Force Mobile Software Engineer Brian Walker Growth Force Content Ranger Meghan Gieber Growth Force Social Media Maven Daryoush Derakshandeh Product Force UI/UX Developer Aseem Chaudhary Mobile Engineer Kimon Kontosis Product Force Software Engineer Arwen Casuga Business Force Office Manager Mehdi Ghafourifar Growth Force Sr. Cheerleader Charles Bayless Growth Force Qmars Kalami Motion Graphics Designer Vangelis Anagnostopoulos Product Force Machine Learning Engineer Shiva Tadayoni Growth Force Visual Design Kye Monroe Product Force DevOps Engineer Nicolas Roger Product Force Software Engineer Blaize Berry Product Force Machine Learning & AI Engineer Neil Achtman Product Force Software Engineer Vincente Ciancio Product Force Software Engineer Alston Ghafourifar CEO & Co-Founder Brienne Ghafourifar Co-Founder Talent Force Rudd Canaday Product Force Sr. Software Architect Steve Epstein Business Force Kostas Rapantzikos Product Force Sr. AI Scientist George Vasilakis Product Force Software Engineer Banafsheh Akhlaghi Growth Force Strategic Partnerships Darya Gol Growth Force Creative Services Frank Bailinson Growth Force User Acquisition & Monetization Theo Raios Product Force Mobile Software Engineer Christos Varytimidis Product Force Machine Learning & AI Engineer Brian Walker Growth Force Content Ranger Meghan Gieber Growth Force Social Media Maven Kimon Kontosis Product Force Software Engineer Daryoush Derakshandeh Product Force UI/UX Developer Arwen Casuga Business Force Office Manager Aseem Chaudhary Mobile Engineer Mehdi Ghafourifar Growth Force Sr. Cheerleader Charles Bayless Growth Force Shiva Tadayoni Growth Force Visual Design Qmars Kalami Motion Graphics Designer Kye Monroe Product Force DevOps Engineer Vangelis Anagnostopoulos Product Force Machine Learning Engineer Nicolas Roger Product Force Software Engineer Blaize Berry Product Force Machine Learning & AI Engineer Vincente Ciancio Product Force Software Engineer Neil Achtman Product Force Software Engineer In all my 20+ years working on cutting-edge AI technologies, I've never come across a better opportunity to advance the state-of-the-art, than Entefy. Kostas Rapantzikos Product Force Sr. AI Scientist IMPACT FIRST Renaissance Team Culture Diversity Accomplished We look for people who are 360-degree thinkers, accomplished individuals accustomed to working in close teams to produce excellence by contributing impactful ideas and constructive refinement. The Entefy team has an incredible range of backgrounds and perspectives. We have individuals with deep experience in everything from filmmaking to chip design. From language parsing to computer vision. Even race car driving. None of this is surprising. When you hire accomplished, multifaceted individuals, it is amazing to discover what else they have done. Jump to Careers \"Better is Better\" The Sapir-Whorf hypothesis holds that the words we use reflect who we are and the way we view the world. We think that the best way to paint a picture of Entefy's culture is to share our mantras: Jump to Careers The best of the best come from all over Entefy embodies the best in diversity. Not only because team members were born or have lived in 16 countries on 6 continents, and range in age from 17 to 78. Nor that we have worked, collectively, in 53 different countries and speak 14 different languages. Details like this create something deeper. Our backgrounds make us open-minded and respectful of each other and our varied accomplishments. We value the different perspectives that come from diverse knowledge and experience. We share a capacity to embrace individuality even as we challenge one another to do our best work. We have different backgrounds but share a common goal—to create a future enriched by universal digital interaction. Jump to Careers One giant leap for… you Entefy is building incredible technology that does something remarkable: it makes you the center of your digital life. We dreamed up a universal communicator then took communications, security, privacy, reliability, and de entirely new directions—putting all of the people, services, and smart things in your life inside a single, beautifully designed application that works on all your favorite devices. It's technology you haven't seen before. It's generations ahead. And we're only getting started. UNIVERSAL COMMUNICATOR You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. Read More UNIVERSAL COMMUNICATOR You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. Entefy leverages proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast interface to help you better manage digital complexity and chaos. INNOVATION Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. Read More INNOVATION Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. We had to come up with new for all the things Entefy lets you do that no other technology allowed before, such as: Securefy . Data security and privacy controls aren't features, they are built into Entefy's DNA. Securefy lets you trust that your personal data is yours and yours alone, and gives you privacy controls that adapt to the context of every message you send. File Intuitor . We thought that finding where you put that document you needed was far too time-consuming, so we invented File Intuitor as a way to locate information faster and more reliably than ever before. Picosync . Have you ever closed your laptop before an application could finish uploading data? Now imagine syncing everything in your life across every device so fast that it's practically instantaneous. That's Picosync. We're making the dictionary thicker one innovation at a time. AUTHENTIC INTELLIGENCE You-centric intelligence Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" Read More AUTHENTIC INTELLIGENCE You-centric intelligence Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" With advances in computer vision and natural language processing, engineers are able to train machines to respond to ever-more-subtle nuances and trends. Which has great potential for making real impact in people's lives—except that most of these advances are used for little more than predicting another advertisement to put in your face. Entefy is doing something vastly different. We are redefining AI at the personal scale—we call it Authentic Intelligence. Authentic Intelligence is about you, your world, and the flow of your daily life. Here's what we mean. Most apps claiming to use AI merely collect and analyze data about you just to sell you more stuff. Authentic Intelligence collects and analyzes data in new ways designed to help you do more and live better. Imagine having the power of a super smart friend at your command on any device, anywhere, and at any time. NEW IOT: THE INTELLIGENCE OF THINGS NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. Read More NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. Yet humans are already approaching information saturation—we cannot continue to process more and more information indefinitely. Spam and email overload are already bad enough. What happens when all the things in our lives start sending updates? Entefy has anticipated the time when toasters talk and toothbrushes check in. Not only does our platform give you powerful ways to communicate with the people in your life, it also helps you control smart devices like never before—a single universal communicator for everyone and everything, available on all your favorite devices. Entefy makes dumb devices smart and smart devices smarter. That's the Intelligence of Things. SECURITY Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. Read More SECURITY Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. What's coming next is pretty exciting. Entefy is raising the privacy and security bar as high as it goes, giving you protection so effective that no error or downtime on our part can lead to the exposure of your valuable data. Look for innovations you've never seen before like zero-*********-servers, single sign-on access, and adaptive privacy controls. An entirely new generation of digital technologies that safeguard your security and give you full control over your privacy. INFRASTRUCTURE The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. Read More INFRASTRUCTURE The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. We are committed to providing you with 99.999% uptime—\"five nines\" for short—or no more than 25.9 seconds of downtime per month. To put that in perspective, California's largest electric utility was down for 551 seconds per customer per month in 2015. We chose a standard that is 21 times more stringent. Why? Because you trust us to protect all the connections in your life. Which makes reliability not just a goal, but a commitment. We'll take care of the complexity it takes to make it happen. It's Life Compatible Entefy makes it easy to manage your interconnected world, whether you're powered on or winding down. On average, people spend 3 hours a day just to send or receive messages. And that doesn't even include all of our other digital interactions throughout the day. We are constantly switching from app to app just to stay in touch—taking time away from actually getting things done. Entefy is introducing the only technology that puts you at the center of your digital universe. It gives you unprecedented access to the people, services, and smart things in your life and lets you find simplicity in your interconnected, digitally-engaged life. LIVE BETTER Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Read More LIVE BETTER Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Your weekend reengineered Free time is more free with Entefy. Don't like spending your free time doing chores? Entefy can't clean your kitchen (at least, not yet), but it can schedule your favorite cleaner. Not a big shopper? Use Entefy's intelligent agent to build a shopping list then place the order when you're ready. Can't find the time for a trip to the gym? Entefy gives you back all that time you spend managing apps, freeing up a little time here and a lot of time there—before you know it, you'll have time for the gym and a leisurely espresso afterwards. You won't realize what a technology burden you have been carrying until you let it go. Welcome to a better world. A world of living well. WORK BETTER Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Read More WORK BETTER Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Find your focus Entefy puts all of your connections and communications into a single, intuitive interface so you can do more in one place. No switching, no loss of focus. Add in an intuitive AI that learns your habits and preferences, and you have a powerful tool for getting more done in record time. Looking for that competitive edge to make you more productive? Entefy delivers everything you need to manage your hyper-connected world and stay two steps ahead of the curve. Busy won't feel quite so busy anymore. Want to make waves? Professionals looking to transform their industry need technology this transformative. With seamless connection to the people, things, and services in your work life, you'll find unique uses for Entefy whatever your industry focus: Aerospace & Defense Agriculture Automotive Banking Communications Consumer Goods & Services Education Energy, Utilities, & Mining Financial & Insurance Food Government Healthcare Hospitality & Travel Information Technology Law Manufacturing Media & Entertainment Nonprofit Pharmaceuticals & Life Sciences Retail Transportation & Logistics Pioneers wanted Every day at Entefy is challenging, rewarding, fun. We are looking for talented people who want to make an impact working on transformative technologies. Our team is growing fast, but when you're building something game-changing every talented mind makes a big impact. ETHOS We believe... Entefy is about people , not protocols. Technology exists to simplify lives, not complicate them. Leadership is defined by \" firsts ,\" \" mosts ,\" and \" bests .\" Success is measured by the degree of impact we make. Every day brings new opportunities for courageous innovation. TRIFECTA Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Read More TRIFECTA Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Next, the technology. Because the world is still in a state of transition, nothing quite works how we want it to. It is a pervasive problem that affects virtually everyone, every day, and it can only be solved with prodigious creativity. This promise of universal interaction is what drives Entefy. Now, the people—why would you want to work here? Rudd can tell you. Rudd Canaday is our Senior Software Architect, and also happens to be the computer science pioneer who co-invented Unix. He has spent more than half a century at the frontiers of technological innovation as a key contributor to numerous companies and initiatives. Here is what he said about his first working visit with the team: \" I just had a ball. It was so much fun working with these guys and the problem was really interesting and quite difficult and so when they actually offered me the job, I didn't even hesitate. I want to be somewhere where I know that what I am doing is having a real impact on the whole place. When I was involved in designing the core of the system, that's what I really love doing, that was really exciting and really fun. And we achieved it. We have got a design now that is going to work. And we have done enough with it to know that it is going to work. When we were working on Unix we weren't thinking of it as something that could change the world. Now I think we are a little more aware that what we are doing could have a huge impact. Pretty darn exciting. It really is. \" ENVIRONMENT Life is good Our office glows with electrifying enthusiasm. Just try bottling this stuff. There is a background hum as people coordinate and problem-solve. Occasionally there are hoots of laughter from a joke or clever wordplay. We are excited about what we are doing. The work is intense but so is the enthusiasm. You see, this team is indeed building the future. Like an extended family, we share our meals. And during our meals we share our opinions, our ideas, our recommendations. Around here, life is good. FORCES May the four forces be with you We're small, we're focused, we're moving fast. Big companies need to be hierarchical because they have many specialized silos. It makes sense for them. Entefy is a different creature. We are just getting started—small and growing fast. Hierarchy and silos would only slow us down. Our approach is to organize the company around what we need and nothing more. From that requirement, the Forces concept arose. Product Force brings the Entefy game-changing product to life, Growth Force connects with the customer, Talent Force ensures we have the right technical skills and cultural values within our team, and Business Force makes everything run smoothly. It is an entirely new way to organize a company. And another example of Entefy innovation at work. CAREER OPPORTUNITIES Make it happen Convinced you have the Entefy moxie? Browse our open positions, then introduce yourself. What qualities do we think it takes to change the future? Start by reading about Entefy's Core Values . Your accomplishments, capabilities, and education are the first part of the equation. The rest is cultural fit: we care about who you are just as much as what you have accomplished. If you do not find openings listed that match your interests and experience, use the \"Create Your Own\" option to tell us about your perfect role at the awesomest company in Silicon Valley. Jump to Team Apply CAREER BLOG Work matters We are proud of the team that we have assembled, diligently working to make a positive change in the world. Entefyers come from all over the world, and have worked in many different roles at many different companies. We share our insights on our Career blog. Here are some of our favorite stories: Say yes to working parents bringing their kids to the office Forget work-life balance. Think work-life fulfillment. The Eisenhower Matrix: 4 rules for getting more done faster 11 Entefy mantras that inspire our work Boost your solopreneur superpowers: 5 ways to create and manage time The hazards of confirmation bias in life and work Read more of our Careers blog Code with us Until we launch, we are being discreet about how much we share. But we are interested in working with like-minded partners developing technologies that give users a superior experience and help them live happily at the center of their digital ecosystems. Connect Entefy is making headlines We're making news at Entefy. Keep abreast of the latest developments from the company and see what people are saying about us. Journalists and media professionals, you'll find everything you need to know about Entefy, its founders, and its technology in the pages below. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Putting people at the heart of their digital universe Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Read More ENTEFY ABOUT Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy is introducing a universal communicator to rein in this growing chaos, putting you at the heart of your digital universe. The core technology is a smart platform that uses advanced Artificial Intelligence to help you seamlessly interact with everyone and everything in your life, all from a single application on your favorite devices. Co-founders Alston Ghafourifar (pronounced Gaf-fooree-far) and sister, Brienne, first sketched out their dream on a coffee shop napkin and immediately began building their venture. Entefy has since raised $14.8 million as it gained momentum, forged relationships, and gathered an exceptional team. From distinguished board members and investors such as Wim Roelandts , Chairman of Applied Materials, Lily Sarafan , CEO of Home Care Assistance, Duncan Niederauer , the former CEO of NYSE Euronext, Peter Detkin , Founder of Intellectual Ventures, Jeff Risher, Chief IP Counsel at Tesla and former Head of Patent Licensing and Strategy at Apple, and Ed Oates , Co-founder of Oracle, to notable team members including Dr. Rudd Canaday , the co-inventor of Unix, Entefy is attracting top talent in business and technology. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Putting you at the heart of your digital universe – With so many social networks, channels, and apps, people are finding it increasingly difficult to manage relationships with their growing personal and professional networks. Entefy officials share how they are \"rewriting the code of digital interaction.\" Inbox chaos? The ultimate taming tool – Entefy leaders discuss how their technology will help people manage the chaos and complexity of their day-to-day lives, gain control, and achieve more. The 10X factor: optimizing life and business – Today, we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. Entefy leaders discuss how new technology will help us be more engaged, organized, and productive. Assembling a brilliant team – Entefy is attracting top talent in business and technology. Company leaders discuss how startups can build a great team to bring a great idea to market. Courageous innovation: big solutions for big problems – Successful entrepreneurs are able to look ahead, envision where we are going, and find solutions to problems we didn't even know we had. Entefy's co-founders share why young people are well equipped to change the world. Suggested interview questions for Entefy company officials: What is Entefy's technology and what will it do? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Why is being young an advantage when it comes to developing big solutions for big problems? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? Read More FOUNDERS Interview Questions What is Entefy's technology and what will it do? People spend an average of three hours a day communicating on an average of 7.4 social/communication apps. How is this contributing to inconsistency, inefficiency, and challenges to privacy and security? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Who came up with the idea? How will Entefy help people manage the chaos and complexity of their day-to-day lives and achieve more? Today we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. How will Entefy help? How will Entefy change the world of digital interaction to revolve around people, and not technology trends? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? How will colleges, universities, instructors, and teachers use Entefy? Entefy has raised $14.8 million and attracted top talent in technology and business. What is the secret to this success? \"Courageous innovation\" is part of Entefy's company culture. What does this mean? Why is being young an advantage when it comes to developing big solutions for big problems? ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Alston Ghafourifar CEO & Founder With the curiosity of a social scientist and the precision of an engineer, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has raised $14.8 million in venture funding, created several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic intellectual property patents in the areas of security, privacy, and communications including: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a Bachelor's degree in Politics. Brienne Ghafourifar Co-founder Brienne is a Co-founder of Entefy, leads the company's Talent Force, and manages key product initiatives. Brienne is a full-stack entrepreneur who set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. As a leader among young entrepreneurs, she has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. She is featured in the documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a Bachelor's degree in Economics from Santa Clara University. \"'She Started It' Trailer: Documentary Aims To Bolster Female Entrepreneurship\" \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Young women raise big bucks for startups\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a Million\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"How AI Is Transforming Human Communication\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" $1 Million by 17: sparking youth entrepreneurship – Brienne explains why she hopes to inspire and open opportunities for other young entrepreneurs. When you're young, impossible is nothing – Alston and Brienne both graduated college at age 17. The siblings discuss the advantages of being \"too young to know what's impossible.\" The wheel revolves around you: master multitasking – Alston and Brienne share their secret to taming the chaos of life's demands, and how this principle inspired her to create new technology to put people at the center of their digital universe. Love your work, love life – Alston and Brienne work very hard but it doesn't feel like work because they're doing what they love. The co-founders discuss how their generation is redefining the idea of work-life balance. Girl power: engaging young women in STEM careers – As one of four female founders featured in the documentary \"She Started It,\" Brienne hopes to inspire more girls to pursue careers in science, technology, engineering and math. She discusses what it takes to empower girls. The 10X factor – Brienne shares her secrets for optimizing time, energy, and focus to maximize productivity and achieve goals in business, family and relationships, education, and health. Suggested interview questions for Entefy company founders: What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? Read More FOUNDERS Interview Questions What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? How do you optimize your time, energy, and focus to be so productive? How did this approach inspire your idea for Entefy? Entefy has put together a brilliant team. What's your secret to attracting exceptional talent? Women have formed only 3% of tech startups, run only 4% of Fortune 500 companies, and receive less than 10% of venture funding. How do you think your generation will change this? You say communication needs to be focused on people, not protocols. How will Entefy and universal interaction change the way people interact, collaborate, and create? ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Introducing the universal communicator . Entefy's answer to the increasingly chaotic digital world. Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. Read More TECHNOLOGY ABOUT Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. This is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. To make it all possible, we've assembled a team with a cumulative 460 years of industry experience and a track record of producing 730 apps, products, and commercial solutions. The right team, building the right technology, pursing the right opportunity. \"Pre-launch Startup, Entefy, tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Entefy closes more than $2 million in its Series AA round\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Entefy is transforming artificial intelligence into authentic intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Read More COMPANY Interview Questions Entefy is transforming Artificial Intelligence into Authentic Intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Entefy's infrastructure, a model for security and reliability – Consumers are accustomed to power outages, phone outages, Internet service outages. Entefy is designing its infrastructure to be more reliable than a light switch, with downtime limited to just 25.9 seconds per month. Entefyers discuss why continuous uptime matters to consumers' digital lives. How is Entefy breaking the cycle of data in-security? – Surveys show that 91% of adults in America believe they have lost control over their personal information. Entefyers discuss how the company has developed new technologies to give consumers total control over their security and privacy, without giving up usability and convenience. Suggested interview questions for Entefy company technology: You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? Read More COMPANY Interview Questions You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? How exactly does Entefy \"put you at the center of your digital universe\"? Isn't hopping in and out of apps simply a fact of professional and personal life in the 21st century? Entefy's claims that its technology is useful in practically any industry. How can that be so? How can Entefy develop new solutions that the world's largest technology companies can't simply develop themselves? Play intro Your browser does not support the video tag. The universal communicator Untying the knots of digital interaction A dozen apps to connect with a dozen people entangles something perfectly natural: conversation. Entefy is untying the knots, using big ideas to create new technologies for digital communication – simplifying your interactions and creating space in your life to do more. Untying the knots of digital interaction A dozen apps to connect with a dozen people entangles something perfectly natural: conversation. Entefy is untying the knots, using big ideas to create new technologies for digital communication – simplifying your interactions and creating space in your life to do more. ABOUT US You at the center Entefy is rewriting the code of digital interaction. Our universal communicator is a new tool for people-centric communication that puts you at the center of your hyper-connected world. It works on your favorite devices and gives you access to your digital universe whenever and wherever you need it. Entefy is built for the Internet of Things but designed for the Internet of People. You at the center Entefy is rewriting the code of digital interaction. Our universal communicator is a new tool for people-centric communication that puts you at the center of your hyper-connected world. It works on your favorite devices and gives you access to your digital universe whenever and wherever you need it. Entefy is built for the Internet of Things but designed for the Internet of People. OUR STORY In Short At Length Founders Entefy was born to rein in the growing chaos in communication and digital interaction. We are solving a pressing problem: the Internet generated a rush of amazing new technologies, then piled all these capabilities on our shoulders—a burden of devices, apps, protocols, web services, notifications. Something as innate as communication feels less and less instinctive. Entefy is not making an app for a demographic. We want to give anyone who communicates, anywhere on the planet, a new tool—a universal communicator —to unlock human potential and make connectedness natural again. The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. Read More OUR STORY At Length The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. We consume communication in huge amounts. Like air and water, interaction is ubiquitous, a constant presence. On any given day, 500 million thoughts are tweeted, 154 billion emails are composed, and 16 billion words are posted to Facebook. And we're not at any sort of peak. Not even close. These numbers are growing exponentially as more people globally join this hyper-connected world. The only thing in digital communication not growing is our capability for managing these interactions. But we've lost our way. There were no security backdoors in telegrams, no metadata breaches on the Pony Express, no ads embedded in smoke signals. In digital communication alone, people spend an average of 3 hours a day sending or reviewing messages, in part because our everyday conversations are distributed across a variety of devices, applications, formats, and operating systems. This fragmentation has forced us to accept inconsistency and inefficiency, not to mention unprecedented threats to privacy and security. All these devices and services represent wonderful improvements in point productivity. They let you do one particular thing better. But all these devices and services come at the expense of increased complexity. Standing amid a chaos of tools and messages and platforms and apps, the challenge before us is to manage this dynamic environment, to connect all of our communication channels in a way that enable a seamless conversation. Enter Entefy. We envision a future where communication is again natural and instinctive. Where technology serves us, and not the other way around. Where a new chapter in the human story can be written. Entefy's co-founders Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Read More OUR STORY Founders Entefy's co-founders, Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Brienne is a full-stack entrepreneur. She leads a variety of initiatives at Entefy including its Talent Force. Brienne set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. She has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math (STEM). She is being featured in the documentary film, \" She Started It ,\" highlighting women tech founders. Entefy was born to rein in the growing chaos in communication and digital interaction. We are solving a pressing problem: the Internet generated a rush of amazing new technologies, then piled all these capabilities on our shoulders—a burden of devices, apps, protocols, web services, notifications. Something as innate as communication feels less and less instinctive. Entefy is not making an app for a demographic. We want to give anyone who communicates, anywhere on the planet, a new tool—a universal communicator —to unlock human potential and make connectedness natural again. The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. The story of humankind is the story of interaction. Our ability to communicate allows ideas, traditions, and knowledge to build from generation to generation. From storytelling to the printing press, from the telegraph to the Internet, humankind's greatest inventions have always involved acquiring and transmitting information. To a degree never seen in human history, the proliferation of new technology is forcing near-daily changes in human behavior. We consume communication in huge amounts. Like air and water, interaction is ubiquitous, a constant presence. On any given day, 500 million thoughts are tweeted, 154 billion emails are composed, and 16 billion words are posted to Facebook. And we're not at any sort of peak. Not even close. These numbers are growing exponentially as more people globally join this hyper-connected world. The only thing in digital communication not growing is our capability for managing these interactions. But we've lost our way. There were no security backdoors in telegrams, no metadata breaches on the Pony Express, no ads embedded in smoke signals. In digital communication alone, people spend an average of 3 hours a day sending or reviewing messages, in part because our everyday conversations are distributed across a variety of devices, applications, formats, and operating systems. This fragmentation has forced us to accept inconsistency and inefficiency, not to mention unprecedented threats to privacy and security. All these devices and services represent wonderful improvements in point productivity. They let you do one particular thing better. But all these devices and services come at the expense of increased complexity. Standing amid a chaos of tools and messages and platforms and apps, the challenge before us is to manage this dynamic environment, to connect all of our communication channels in a way that enable a seamless conversation. Enter Entefy. We envision a future where communication is again natural and instinctive. Where technology serves us, and not the other way around. Where a new chapter in the human story can be written. Entefy's co-founders Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Read More OUR STORY Founders Entefy's co-founders, Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Brienne is a full-stack entrepreneur. She leads a variety of initiatives at Entefy including its Talent Force. Brienne set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. She has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math (STEM). She is being featured in the documentary film, \" She Started It ,\" highlighting women tech founders. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Entefy's co-founders, Alston and Brienne Ghafourifar have taken an idea originally sketched on a napkin and turned it into a fast-emerging technology company with development teams on two continents, a distinguished network of investors and advisors, and 31 filed patents protecting its groundbreaking solution. Alston serves as Entefy's CEO and brings to the company the curiosity of a social scientist and the precision of an engineer. In addition to leading the company's strategic direction, Alston heads the design and architecture of Entefy's universal communicator platform. He is also responsible for core inventions at the company and patent filings in the areas of communication, artificial intelligence, security, and cyber privacy. Brienne is a full-stack entrepreneur. She leads a variety of initiatives at Entefy including its Talent Force. Brienne set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. She has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math (STEM). She is being featured in the documentary film, \" She Started It ,\" highlighting women tech founders. CORE VALUES Innovation Drive Curiosity Trust Agility The stories of humanity's most remarkable thinkers—Leonardo Da Vinci, Galileo Galilei, Alexander Graham Bell, Nikola Tesla, Richard Feynman—show that more than mere necessity drives innovation. And not just any innovation but rather courageous innovation. The rare breed of innovation born in difficult environments fraught with obstacles and yet succeeds for the benefit of all. Central to their diverse stories are traits like curiosity, drive, and trust in their own capabilities: Georgia O'Keefe began life in a rural Wisconsin farmhouse, receiving a limited and conventional artistic training. Yet through years of effort and practice, she developed a distinctive style that influenced Modernism while remaining perennially popular with the public. Thomas Edison is credited with more than 2,000 patents and dozens of inventions, but also led business ventures in mining, construction, and public utilities. Benjamin Franklin excelled as an inventor but was also a scientist, a businessperson, a publisher, an author, a diplomat—and a Founding Father. At Entefy, we are inspired by these extraordinary examples of curiosity, drive, and wonder. We believe that Entefy's inventions will mark an inflection point in the history of communication technology, a point in time when many strands come together. When innovation leads to meaningful improvement in people's lives. Persistence. Grit. Moxie. Call it what you want, you know it when you see it. Drive defines that rare person with a vision to upend a paradigm or improve our understanding of the world. We see this spirit in Marie and Pierre Curie's work. To test their theories, they needed the very rare compound radium chloride, which does not occur naturally in its pure state. So over four years, Marie Curie refined a ton of ore to isolate a mere 100 milligrams of the substance. Four years work for a few granules of material. But Marie found great satisfaction in the work: \"We were very happy,\" Marie wrote. \"We lived in a preoccupation as complete as that of a dream.\" This same drive was present in Thomas Edison's work: he tested hundreds of different filaments for his incandescent bulb before selecting bamboo. His famous adage that \"Genius is one percent inspiration, ninety-nine percent perspiration\" was well-grounded in reality. At Entefy, we are solving big, complex problems. We draw inspiration from those who have demonstrated rugged persistence to overcome immense obstacles. We constantly revisit, discard, rework. We do what it takes to get it just right. Richard Feynman, one of the preeminent physicists of the 20th century, was renowned for the breadth of his interests beyond the Physics for which he received his Nobel Prize. He taught himself the bongo drums, and took a crack at decrypting ancient Mayan inscriptions. He said in his autobiography, \"I'm always looking, like a child, for the wonders I know I'm going to find.\" At Entefy, we feel the same way about the people and the world around us—limitless complexity so deep as to be awe-inspiring. We are excited to be working on intricate problems that defy easy resolution. We are motivated by sheer curiosity: What else can be discovered? There is magic out there still to be found. The causeway that links one person to another is trust. We see trust in the commitment of a handshake, and in our fidelity to people we never meet. Many of us engage in a collaborative exercise in trust every day: the commute. The average American adult gets behind the wheel 1,102 times a year, driving 10,600 miles over 280 hours. 210 million individuals and 253 million vehicles. Think of the potential risk inherent in driving a two-ton vehicle at 60 miles per hour at an oncoming vehicle just a dozen feet away. Driving is an exercise in trust. Trust in manufacturers, regulators, dealerships, and other drivers. We entrust our lives to our fellow citizens every day. At Entefy, we are motivated by trust in humankind in a shared future. We do not believe that a great product is built by one person, but generated by the collective efforts of a team. We trust each other, and extend that trust to the promise we make to our customers. We often think of \"agility\" in athletic : the grace of Baryshnikov or the wizardry of Michael Jordan. But agility encompasses intellectual flexibility as well. The economist John Maynard Keynes is famous for saying, \"When my information changes, I alter my conclusions. What do you do, sir?\" Generating innovation when technology is always changing, when our understanding of the world is always changing, requires mental flexibility to rival the physicality of a ballerina or the power of a sports legend. Entefy is solving complex technological problems that have resisted resolution for years. Our first ideas are not always our best, but we backtrack and rework and reexamine our assumptions. It takes agility to bring a first-ever solution to an increasingly digital world. The stories of humanity's most remarkable thinkers—Leonardo Da Vinci, Galileo Galilei, Alexander Graham Bell, Nikola Tesla, Richard Feynman—show that more than mere necessity drives innovation. And not just any innovation but rather courageous innovation. The rare breed of innovation born in difficult environments fraught with obstacles and yet succeeds for the benefit of all. Central to their diverse stories are traits like curiosity, drive, and trust in their own capabilities: Georgia O'Keefe began life in a rural Wisconsin farmhouse, receiving a limited and conventional artistic training. Yet through years of effort and practice, she developed a distinctive style that influenced Modernism while remaining perennially popular with the public. Thomas Edison is credited with more than 2,000 patents and dozens of inventions, but also led business ventures in mining, construction, and public utilities. Benjamin Franklin excelled as an inventor but was also a scientist, a businessperson, a publisher, an author, a diplomat—and a Founding Father. At Entefy, we are inspired by these extraordinary examples of curiosity, drive, and wonder. We believe that Entefy's inventions will mark an inflection point in the history of communication technology, a point in time when many strands come together. When innovation leads to meaningful improvement in people's lives. Persistence. Grit. Moxie. Call it what you want, you know it when you see it. Drive defines that rare person with a vision to upend a paradigm or improve our understanding of the world. We see this spirit in Marie and Pierre Curie's work. To test their theories, they needed the very rare compound radium chloride, which does not occur naturally in its pure state. So over four years, Marie Curie refined a ton of ore to isolate a mere 100 milligrams of the substance. Four years work for a few granules of material. But Marie found great satisfaction in the work: \"We were very happy,\" Marie wrote. \"We lived in a preoccupation as complete as that of a dream.\" This same drive was present in Thomas Edison's work: he tested hundreds of different filaments for his incandescent bulb before selecting bamboo. His famous adage that \"Genius is one percent inspiration, ninety-nine percent perspiration\" was well-grounded in reality. At Entefy, we are solving big, complex problems. We draw inspiration from those who have demonstrated rugged persistence to overcome immense obstacles. We constantly revisit, discard, rework. We do what it takes to get it just right. Richard Feynman, one of the preeminent physicists of the 20th century, was renowned for the breadth of his interests beyond the Physics for which he received his Nobel Prize. He taught himself the bongo drums, and took a crack at decrypting ancient Mayan inscriptions. He said in his autobiography, \"I'm always looking, like a child, for the wonders I know I'm going to find.\" At Entefy, we feel the same way about the people and the world around us—limitless complexity so deep as to be awe-inspiring. We are excited to be working on intricate problems that defy easy resolution. We are motivated by sheer curiosity: What else can be discovered? There is magic out there still to be found. The causeway that links one person to another is trust. We see trust in the commitment of a handshake, and in our fidelity to people we never meet. Many of us engage in a collaborative exercise in trust every day: the commute. The average American adult gets behind the wheel 1,102 times a year, driving 10,600 miles over 280 hours. 210 million individuals and 253 million vehicles. Think of the potential risk inherent in driving a two-ton vehicle at 60 miles per hour at an oncoming vehicle just a dozen feet away. Driving is an exercise in trust. Trust in manufacturers, regulators, dealerships, and other drivers. We entrust our lives to our fellow citizens every day. At Entefy, we are motivated by trust in humankind in a shared future. We do not believe that a great product is built by one person, but generated by the collective efforts of a team. We trust each other, and extend that trust to the promise we make to our customers. We often think of \"agility\" in athletic : the grace of Baryshnikov or the wizardry of Michael Jordan. But agility encompasses intellectual flexibility as well. The economist John Maynard Keynes is famous for saying, \"When my information changes, I alter my conclusions. What do you do, sir?\" Generating innovation when technology is always changing, when our understanding of the world is always changing, requires mental flexibility to rival the physicality of a ballerina or the power of a sports legend. Entefy is solving complex technological problems that have resisted resolution for years. Our first ideas are not always our best, but we backtrack and rework and reexamine our assumptions. It takes agility to bring a first-ever solution to an increasingly digital world. FAQ What is it like to work at Entefy? Why should I use Entefy? What industries will benefit from Entefy's offerings? Just what does Entefy do? Is there any way to try out the universal communicator? Read More FAQ What is it like to work at Entefy? Have you ever met a young person with a wise soul? That's Entefy. Around our offices there is a blend of energy, smarts, and kinship that's simply magnetic. The excitement in the air comes from a shared sense of being present at the birth of something new and consequential. The mantra \"better is better\" guides our work, leaving little room for egos, politics, or anything else that can get in the way of progress. Like a tight-knit family, we work together, eat together, joke together. There is an uncommon degree of friendship and shared purpose. Whether you're someone who has amassed decades of professional experience or is just starting out, you're unlikely to find another place that parallels Entefy. The team is remarkable, the goal is electrifying, and the work is highly meaningful. Why should I use Entefy? There have been countless technology revolutions, from landline telephones to smartphones, from manual-drive cars to self-driving cars, from snail mail to email, from bulky CRT TVs to LED flat screens. Entefy's technology advancement is yet another giant leap forward. Entefy lets you communicate with people, smart things, and services, easier, faster, smarter, and safer than previously imaginable. This is not an evolution or minor improvement. Entefy represents a step-change in people's lives. It is one of those changes where you will wonder how you got along without it. If you care about personal efficiency, personal effectiveness, and personal privacy, you will want to use Entefy. What industries will benefit from Entefy's offerings? Digital interaction is at the core of our platform, so every industry can benefit from Entefy's universal communicator . That said, there are certain attributes that make Entefy especially valuable to particular industries. For example, industries dependent on high levels of communication, industries that collect and transmit large volumes of confidential data, industries where workers have a higher-than-average use of multiple applications, industries with high volumes of information sharing in complex environments, industries where employees are highly mobile, industries that are characterized by high levels of regulation – all of these are likely to especially benefit from Entefy. For a more detailed list, see our Work Better page. Just what does Entefy do? Entefy puts you at the center of your digital world by letting you access and manage people, smart things, and services in your life from a single application on all of your favorite devices. No more fooling around with multiple platforms, services, and protocols just to find when or where you promised to meet someone. No more hopping in and out of multiple apps to take care of mundane tasks. No more keeping track of dozens of passwords. No more searches that come up empty when you know the file is there (somewhere). And no more worries about the security of your personal data. In addition to all of this, Entefy's universal communicator puts the power of advanced AI in your hands. It works by unifying communications, search, smart things, contacts, and files, and seamlessly blends voice, pictures, audio, and text—all with perfect syncing across smartphone, tablet, laptop, and smart watch. However it is that you connect with your friends and colleagues, Entefy is your single platform for making your personal technology ecosystem simpler and easier. You've never seen anything like it. Is there any way to try out the universal communicator ? Thank you for your interest. We plan to host an early access beta test, but no date has yet been set. The best way to get your hands on Entefy is to for early access. There is already quite a bit of interest in our universal communicator —in one study, 95.6% of the people surveyed indicated their interest in using our solution. With an intelligent communication platform this expansive and intricate, our team recognizes the value of rigorous, relentless development and testing. We are working hard to chisel everything to perfection and get it into your hands as soon as possible. Why is the Entefy team so global? We are solving technological problems that have stymied some of the smartest and deepest pocketed companies. The composition of our team is one reason why we are succeeding where others have not. Entefy is pursuing sky-high goals, so we need stratospheric talent. We are completely dedicated to finding the right people. Not good-enough people. Not close-enough people. But rather, the right people to solve perhaps one of the most pervasive challenge in technology— the AI-powered communication platform for everyone and everything . Achieving these goals requires people with a formidable combination of skills, experiences, knowledge, values, and behaviors. We won't compromise. There are not a lot of people that meet our standards. So we cast a wide net to find the right people. We did not set out to make the Entefy team so international, it just so happens that the best of the best come from all over. How soon will the universal communicator be available? We are still in development and have not announced an official release date. The best way to keep in touch with us and find out when we announce our private beta is to for early access. How will Entefy achieve what others have not? The right team, building the right technology, pursing the right opportunity. Entefy operates at the intersection of communication, Internet of Things, cyber privacy, and artificial intelligence. We are creating ground-breaking technology, have a unique approach to market, and have assembled the right team to bring it all together. Our team is highly nimble with an incredibly diverse set of skills. Internally, we refer to the Entefyers as a chili pepper team—small yet potent. Cumulatively, we have 460 years of combined business and technology experience, expertise that prepares us for a wide range of problem solving. At the core of our universal communicator is a smart platform that leverages advanced computer vision and natural language processing to enable a highly intuitive user experience. We have filed 31 patents so far—in key areas of communication, artificial intelligence, security, search, and big data—and we're just getting started. As a young company, we have no historical burden that limits how we do things, no existing technology architectures that require expensive modification, no cultural norms created by earlier business circumstances, no legacy business model that threatens a better, new business model. Entefy can pursue the best solutions independent from the systems and architectures of the past. How is Entefy inventing the future? Human interaction is about as fundamental as it gets. In fact, our ability to communicate is a large part of what defines humans and humanity. New technologies like smartphones and message apps have shown us the potential for new forms of communication, but their implementation has in large part done more to complicate people's lives than improve them. Entefy is creating the communication technologies that will bring us into a new era. We are rewriting the code of digital interaction to seamlessly connect people with everyone and everything in their lives. By building our universal communicator from the ground up and with a completely fresh vision, we are creating something so new and so universal, that the future will be changed for the better. Dramatically so. How do you know what users want? The idea for Entefy's universal communicator grew out of conversations between our sibling co-founders Alston and Brienne . They observed how their friends and the people around them were using technology, or rather, letting technology use them. From these observations grew a vision of universal impact, a path for improving the lives of nearly everyone. That vision has guided our actions since then. Communication is about people, so we work closely with future users to ensure we are designing a product that makes a difference. We test our assumptions again and again—we survey, we interact with users, we run trials with advisors and investors. For example, we recently conducted a confidential survey among 1,500 U.S. professionals regarding their communication and digital interaction requirements. We were pleased to discover that 95.6% of these users were interested or very interested in using an offering that included the attributes of Entefy. Can Entefy keep my data secure? Entefy considers privacy and security to be central to the user experience. It is unavoidably the case that the more information Entefy has about the user, the more useful Entefy is to the user. It is also the case that different users have different preferences and therefore make different trade-off choices between convenience and security. Recognizing this, Entefy has designed the universal communicator so that you, the user, can make the decisions about what level of security and data access is most appropriate. And you can make these decisions dynamically to apply the correct level privacy and security to the particular situation. It is important to note that we have architected our system in such a fashion that Entefy maintains very little customer data. Between enabling customer choice and designing the system with security in mind from the ground up, we are able to deliver remarkable services with unprecedented security and privacy. Why doesn't Entefy sell ads? Our vision for universal communication has no room for advertising. We believe that, when it comes to people's conversations, advertising only serves as a distraction and, frankly, a disservice to users. Our people-centric approach keeps us focused on you, the user, not advertisers who would like to gain access to your information in order to sell you more of what you don't need. I only use my smartphone and my computer, no other devices. Does it make sense to use Entefy? Even if you use only a single device, Entefy delivers increased efficiency and effectiveness to your life. It is not just about the number of devices you use but also the number of apps and services. The more intricate and complex your digital universe, the more you will benefit from our universal communicator . Given that you are a small company with many people from different backgrounds, how do you order food for everyone? Lunches are an important part of the day at Entefy. The entire team pauses their work to assemble and engage in that oldest of traditions, breaking bread. Our conversations are both serious and bantering, discussing anything that comes to mind. With techies, business guys, and creatives at the table, no topic is off limits. When it comes to food, the team ranges from carnivores to pescetarians and vegetarians to vegans. We have people who need to eat gluten-free or have other allergies. And we can't forget the juicers and the raw food lovers. As you can imagine, meals at Entefy are quite the experience. We wouldn't have it any other way. Is the universal communicator primarily for professionals or will it be useful to anyone? Entefy's universal communicator is for anyone who communicates digitally. The more communication and digital interaction in your life, the more value Entefy brings. Even for a single person, with a single device, using just a few applications and services, Entefy delivers big value in of simplicity, speed, and security. What kind of impact will Entefy have? Every time there is a technology-enabled disruption (the printing press, the microprocessor, the graphical user interface, the Internet) there are certain predictable consequences. More information is made accessible, communication between and among people is increased, productivity and GDP is expanded, entrenched interests are disrupted, societal concerns about stress rise. We will likely see something similar with Entefy. Historically, there is an initial phase of resistance to technological disruption. But in the next phase, the potential for increased productivity translates to more choices, more opportunities, more freedom. Entefy will help people live better by removing the prevalent chaos and fragmentation that now exists in the digital world. Can I be involved in beta testing? Yes. We encourage you to for early access here . Is Entefy hiring? Yes. We are growing fast and need all the exceptional talent we can find. Check out our Careers section for available opportunities at Entefy. Where are you located? We have teams located internationally, with our headquarters in Palo Alto, the heart of Silicon Valley. How much money have you raised? Entefy has raised $14.8 million in venture funding to date. How many team members are there? Our team has 30 talented professionals and is growing rapidly. Meet the Entefyers . How old is Entefy? Entefy was founded in 2012 by sibling co-founders, Alston and Brienne . It all started on a napkin . What does the name Entefy signify? Entefy derives from \"entify,\" which means \"bring to life\" and that, quite simply, is what we are trying to do. Bring to life a future where people are more important than protocols, where people are placed at the center of their digital universe, and where people are able to communicate securely and seamlessly with everyone and everything in their lives. What is it like to work at Entefy? Why should I use Entefy? What industries will benefit from Entefy's offerings? Just what does Entefy do? Is there any way to try out the universal communicator? Have you ever met a young person with a wise soul? That's Entefy. Around our offices there is a blend of energy, smarts, and kinship that's simply magnetic. The excitement in the air comes from a shared sense of being present at the birth of something new and consequential. The mantra \"better is better\" guides our work, leaving little room for egos, politics, or anything else that can get in the way of progress. Like a tight-knit family, we work together, eat together, joke together. There is an uncommon degree of friendship and shared purpose. Whether you're someone who has amassed decades of professional experience or is just starting out, you're unlikely to find another place that parallels Entefy. The team is remarkable, the goal is electrifying, and the work is highly meaningful. There have been countless technology revolutions, from landline telephones to smartphones, from manual-drive cars to self-driving cars, from snail mail to email, from bulky CRT TVs to LED flat screens. Entefy's technology advancement is yet another giant leap forward. Entefy lets you communicate with people, smart things, and services, easier, faster, smarter, and safer than previously imaginable. This is not an evolution or minor improvement. Entefy represents a step-change in people's lives. It is one of those changes where you will wonder how you got along without it. If you care about personal efficiency, personal effectiveness, and personal privacy, you will want to use Entefy. Digital interaction is at the core of our platform, so every industry can benefit from Entefy's universal communicator . That said, there are certain attributes that make Entefy especially valuable to particular industries. For example, industries dependent on high levels of communication, industries that collect and transmit large volumes of confidential data, industries where workers have a higher-than-average use of multiple applications, industries with high volumes of information sharing in complex environments, industries where employees are highly mobile, industries that are characterized by high levels of regulation – all of these are likely to especially benefit from Entefy. For a more detailed list, see our Work Better page. Entefy puts you at the center of your digital world by letting you access and manage people, smart things, and services in your life from a single application on all of your favorite devices. No more fooling around with multiple platforms, services, and protocols just to find when or where you promised to meet someone. No more hopping in and out of multiple apps to take care of mundane tasks. No more keeping track of dozens of passwords. No more searches that come up empty when you know the file is there (somewhere). And no more worries about the security of your personal data. In addition to all of this, Entefy's universal communicator puts the power of advanced AI in your hands. It works by unifying communications, search, smart things, contacts, and files, and seamlessly blends voice, pictures, audio, and text—all with perfect syncing across smartphone, tablet, laptop, and smart watch. However it is that you connect with your friends and colleagues, Entefy is your single platform for making your personal technology ecosystem simpler and easier. You've never seen anything like it. Thank you for your interest. We plan to host an early access beta test, but no date has yet been set. The best way to get your hands on Entefy is to for early access. There is already quite a bit of interest in our universal communicator —in one study, 95.6% of the people surveyed indicated their interest in using our solution. With an intelligent communication platform this expansive and intricate, our team recognizes the value of rigorous, relentless development and testing. We are working hard to chisel everything to perfection and get it into your hands as soon as possible. We are solving technological problems that have stymied some of the smartest and deepest pocketed companies. The composition of our team is one reason why we are succeeding where others have not. Entefy is pursuing sky-high goals, so we need stratospheric talent. We are completely dedicated to finding the right people. Not good-enough people. Not close-enough people. But rather, the right people to solve perhaps one of the most pervasive challenge in technology— the AI-powered communication platform for everyone and everything . Achieving these goals requires people with a formidable combination of skills, experiences, knowledge, values, and behaviors. We won't compromise. There are not a lot of people that meet our standards. So we cast a wide net to find the right people. We did not set out to make the Entefy team so international, it just so happens that the best of the best come from all over. We are still in development and have not announced an official release date. The best way to keep in touch with us and find out when we announce our private beta is to for early access. The right team, building the right technology, pursing the right opportunity. Entefy operates at the intersection of communication, Internet of Things, cyber privacy, and artificial intelligence. We are creating ground-breaking technology, have a unique approach to market, and have assembled the right team to bring it all together. Our team is highly nimble with an incredibly diverse set of skills. Internally, we refer to the Entefyers as a chili pepper team—small yet potent. Cumulatively, we have 460 years of combined business and technology experience, expertise that prepares us for a wide range of problem solving. At the core of our universal communicator is a smart platform that leverages advanced computer vision and natural language processing to enable a highly intuitive user experience. We have filed 31 patents so far—in key areas of communication, artificial intelligence, security, search, and big data—and we're just getting started. As a young company, we have no historical burden that limits how we do things, no existing technology architectures that require expensive modification, no cultural norms created by earlier business circumstances, no legacy business model that threatens a better, new business model. Entefy can pursue the best solutions independent from the systems and architectures of the past. Human interaction is about as fundamental as it gets. In fact, our ability to communicate is a large part of what defines humans and humanity. New technologies like smartphones and message apps have shown us the potential for new forms of communication, but their implementation has in large part done more to complicate people's lives than improve them. Entefy is creating the communication technologies that will bring us into a new era. We are rewriting the code of digital interaction to seamlessly connect people with everyone and everything in their lives. By building our universal communicator from the ground up and with a completely fresh vision, we are creating something so new and so universal, that the future will be changed for the better. Dramatically so. The idea for Entefy's universal communicator grew out of conversations between our sibling co-founders Alston and Brienne . They observed how their friends and the people around them were using technology, or rather, letting technology use them. From these observations grew a vision of universal impact, a path for improving the lives of nearly everyone. That vision has guided our actions since then. Communication is about people, so we work closely with future users to ensure we are designing a product that makes a difference. We test our assumptions again and again—we survey, we interact with users, we run trials with advisors and investors. For example, we recently conducted a confidential survey among 1,500 U.S. professionals regarding their communication and digital interaction requirements. We were pleased to discover that 95.6% of these users were interested or very interested in using an offering that included the attributes of Entefy. Entefy considers privacy and security to be central to the user experience. It is unavoidably the case that the more information Entefy has about the user, the more useful Entefy is to the user. It is also the case that different users have different preferences and therefore make different trade-off choices between convenience and security. Recognizing this, Entefy has designed the universal communicator so that you, the user, can make the decisions about what level of security and data access is most appropriate. And you can make these decisions dynamically to apply the correct level privacy and security to the particular situation. It is important to note that we have architected our system in such a fashion that Entefy maintains very little customer data. Between enabling customer choice and designing the system with security in mind from the ground up, we are able to deliver remarkable services with unprecedented security and privacy. Our vision for universal communication has no room for advertising. We believe that, when it comes to people's conversations, advertising only serves as a distraction and, frankly, a disservice to users. Our people-centric approach keeps us focused on you, the user, not advertisers who would like to gain access to your information in order to sell you more of what you don't need. Even if you use only a single device, Entefy delivers increased efficiency and effectiveness to your life. It is not just about the number of devices you use but also the number of apps and services. The more intricate and complex your digital universe, the more you will benefit from our universal communicator . Lunches are an important part of the day at Entefy. The entire team pauses their work to assemble and engage in that oldest of traditions, breaking bread. Our conversations are both serious and bantering, discussing anything that comes to mind. With techies, business guys, and creatives at the table, no topic is off limits. When it comes to food, the team ranges from carnivores to pescetarians and vegetarians to vegans. We have people who need to eat gluten-free or have other allergies. And we can't forget the juicers and the raw food lovers. As you can imagine, meals at Entefy are quite the experience. We wouldn't have it any other way. Entefy's universal communicator is for anyone who communicates digitally. The more communication and digital interaction in your life, the more value Entefy brings. Even for a single person, with a single device, using just a few applications and services, Entefy delivers big value in of simplicity, speed, and security. Every time there is a technology-enabled disruption (the printing press, the microprocessor, the graphical user interface, the Internet) there are certain predictable consequences. More information is made accessible, communication between and among people is increased, productivity and GDP is expanded, entrenched interests are disrupted, societal concerns about stress rise. We will likely see something similar with Entefy. Historically, there is an initial phase of resistance to technological disruption. But in the next phase, the potential for increased productivity translates to more choices, more opportunities, more freedom. Entefy will help people live better by removing the prevalent chaos and fragmentation that now exists in the digital world. Yes. We encourage you to for early access here . Yes. We are growing fast and need all the exceptional talent we can find. Check out our Careers section for available opportunities at Entefy. We have teams located internationally, with our headquarters in Palo Alto, the heart of Silicon Valley. Entefy has raised $14.8 million in venture funding to date. Our team has 30 talented professionals and is growing rapidly. Meet the Entefyers . Entefy was founded in 2012 by sibling co-founders, Alston and Brienne . It all started on a napkin . Entefy derives from \"entify,\" which means \"bring to life\" and that, quite simply, is what we are trying to do. Bring to life a future where people are more important than protocols, where people are placed at the center of their digital universe, and where people are able to communicate securely and seamlessly with everyone and everything in their lives. IMPACT Impact first. Everything else will follow. Select a meaningful problem. Recruit an exceptional team. Focus on real solutions. Change people's lives. Impact is a foundational concept at Entefy. We believe that if we are going to spend time solving a problem, we should make it the biggest, hardest problem we can find. Impact grows from the people on our team. Entefy Co-founder Brienne, who leads our Talent Force, described recruiting in of assembling a \"chili pepper\" team: small yet potent. Professionals with a 360-degree holistic viewpoint. The type of people who make a 10x impact. How do we know we've made an impact? By our firsts, bests and mosts—yardsticks that measure success. Impact first. Everything else will follow. Select a meaningful problem. Recruit an exceptional team. Focus on real solutions. Change people's lives. Impact is a foundational concept at Entefy. We believe that if we are going to spend time solving a problem, we should make it the biggest, hardest problem we can find. Impact grows from the people on our team. Entefy Co-founder Brienne, who leads our Talent Force, described recruiting in of assembling a \"chili pepper\" team: small yet potent. Professionals with a 360-degree holistic viewpoint. The type of people who make a 10x impact. How do we know we've made an impact? By our firsts, bests and mosts—yardsticks that measure success. INVESTORS Fuel and inspiration In the Entefy family, our investors are the supportive aunts and uncles who provide the fuel and inspiration for us to do our best work. Entefy has attracted accomplished technologists and executives such as Wim Roelandts, Chairman of Applied Materials, Duncan Niederauer, former CEO of NYSE Euronext, Peter Detkin, Co-founder of Intellectual Ventures, Ed Oates, Co-founder of Oracle, and Keith Taylor, CFO of Equinix. In the Entefy family, our investors are the supportive aunts and uncles who provide the fuel and inspiration for us to do our best work. Entefy has attracted accomplished technologists and executives such as Wim Roelandts, Chairman of Applied Materials, Duncan Niederauer, former CEO of NYSE Euronext, Peter Detkin, Co-founder of Intellectual Ventures, Ed Oates, Co-founder of Oracle, and Keith Taylor, CFO of Equinix. BOARD & ADVISORS Wisdom and experience The confidence of youth can be a compelling force in creating the future. The wisdom of years of experience can forestall many missteps. We believe Entefy has forged a compelling balance of the two poles. Our Board and circle of advisors bring a breadth and depth of experience that informs our disciplined approach to the market. Alston Ghafourifar Chairman Brienne Ghafourifar Board Member Wim Roelandts Board Member Chairman of Applied Materials, Inc. Fmr. Chairman & CEO of Xilinx Lily Sarafan Board Member CEO of Home Care Assistance ADVISORS Peter Detkin Sr. Advisor Founder & Vice Chairman Intellectual Ventures Keith Taylor Advisor CFO Equinix Jeff Risher Advisor Fmr. Head Of Patent Licensing & Strategy At Apple Ed Oates Advisor Co-Founder Oracle Alex Lubar Advisor Global CMO McCann Worldgroup Andreas Ramos Advisor Global Digital Marketing Pirooz Parvarandeh Advisor Fmr. CTO of Maxim Integrated Products Nelson Chan Advisor Online Partnership Group Google Barry Katz Visionary Circle IDEO Fello & Professor (Stanford & CCA) John Grimley Visionary Circle Founder & Principal TJW Capital Management Charlie Perrell Advisor Co-Founder NetApp Keith Newman Advisor President Newman Media Adam Elegan Visionary Circle Director KKR Karen Williams Visionary Circle Lecturer, Communication Expert Chris Lalli Visionary Circle Managing Partner CapAccel, LP Robin Yeganeh, PhD Visionary Circle Clinical Professor Of Psychology UC Berkeley Wayne Michelsen Visionary Circle Distinguished Member Of Technical Staff ARRIS Fereshteh Khodadad Visionary Circle Real Estate Spanta Ashjaee Advisor President Valley Digital Technologies Lawrence E. Martin Visionary Circle Multifaceted Visionary Rob Trammell Visionary Circle Principal Abbott Stringham & Lynch Ray Scheaffer Visionary Circle Managing Principal Abbott Stringham & Lynch Maria Constantino-Roelandts Visionary Circle President Maria & Wim Roelandts Foundation Kenneth Cala Visionary Circle Founder & Director Of Planning Lowery Thomas LLP John Galbraith Visionary Circle CEO Galbraith Ventures Nanci Kauffman Visionary Circle Head Of School Castilleja Arya Mortazavi Visionary Circle Global Supply Chain Manager Lam Research Corp. Anthony Lee Visionary Circle Founder & President Coeur Values The confidence of youth can be a compelling force in creating the future. The wisdom of years of experience can forestall many missteps. We believe Entefy has forged a compelling balance of the two poles. Our Board and circle of advisors bring a breadth and depth of experience that informs our disciplined approach to the market. Brienne Ghafourifar Board Member Wim Roelandts Board Member Chairman of Applied Materials, Inc. Fmr. Chairman & CEO of Xilinx Lily Sarafan Board Member CEO of Home Care Assistance Chili pepper team: small yet potent Entefyers are inventors, engineers, and business leaders working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our passion is people, our roots are in technology, and our mission is helping them work better together. Chili pepper team: small yet potent Entefyers are inventors, engineers, and business leaders working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our passion is people, our roots are in technology, and our mission is helping them work better together. ENTEFYERS Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. Read More ENTEFYERS Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. We have people as young as seventeen and as old as seventy-eight. Cumulatively, we have centuries of experience, overwhelmingly in the high-technology sector but with a good dose of some dozen other industries as well, including consumer products, education, energy, manufacturing, retail, and utilities. Our executive team has deep experience in all major aspects of a corporation including finance, operations, technology, sales, and product development. Our senior leadership also has the experience of holding 26 Board of Director positions. Educationally, our people come primarily from a STEM background. We do have a scattering of economics, arts, political sciences, design, and other degrees. In addition, we have among us multiple MBAs and PhDs. We have intellectual horsepower and variety. This strength is reflected in the fact that our small team has produced hundreds of commercial apps, products, and other market solutions, not to mention more than 100 articles, books, and other publications. Alston Ghafourifar CEO & Co-Founder Rudd Canaday Product Force Sr. Software Architect Kostas Rapantzikos Product Force Sr. AI Scientist Brienne Ghafourifar Co-Founder Talent Force Steve Epstein Business Force George Vasilakis Product Force Software Engineer Banafsheh Akhlaghi Growth Force Strategic Partnerships Frank Bailinson Growth Force User Acquisition & Monetization Christos Varytimidis Product Force Machine Learning & AI Engineer Darya Gol Growth Force Creative Services Theo Raios Product Force Mobile Software Engineer Brian Walker Growth Force Content Ranger Meghan Gieber Growth Force Social Media Maven Daryoush Derakshandeh Product Force UI/UX Developer Aseem Chaudhary Mobile Engineer Kimon Kontosis Product Force Software Engineer Arwen Casuga Business Force Office Manager Mehdi Ghafourifar Growth Force Sr. Cheerleader Charles Bayless Growth Force Qmars Kalami Motion Graphics Designer Vangelis Anagnostopoulos Product Force Machine Learning Engineer Shiva Tadayoni Growth Force Visual Design Kye Monroe Product Force DevOps Engineer Nicolas Roger Product Force Software Engineer Blaize Berry Product Force Machine Learning & AI Engineer Neil Achtman Product Force Software Engineer Vincente Ciancio Product Force Software Engineer Alston Ghafourifar CEO & Co-Founder Brienne Ghafourifar Co-Founder Talent Force Rudd Canaday Product Force Sr. Software Architect Steve Epstein Business Force Kostas Rapantzikos Product Force Sr. AI Scientist George Vasilakis Product Force Software Engineer Banafsheh Akhlaghi Growth Force Strategic Partnerships Darya Gol Growth Force Creative Services Frank Bailinson Growth Force User Acquisition & Monetization Theo Raios Product Force Mobile Software Engineer Christos Varytimidis Product Force Machine Learning & AI Engineer Brian Walker Growth Force Content Ranger Meghan Gieber Growth Force Social Media Maven Kimon Kontosis Product Force Software Engineer Daryoush Derakshandeh Product Force UI/UX Developer Arwen Casuga Business Force Office Manager Aseem Chaudhary Mobile Engineer Mehdi Ghafourifar Growth Force Sr. Cheerleader Charles Bayless Growth Force Shiva Tadayoni Growth Force Visual Design Qmars Kalami Motion Graphics Designer Kye Monroe Product Force DevOps Engineer Vangelis Anagnostopoulos Product Force Machine Learning Engineer Nicolas Roger Product Force Software Engineer Blaize Berry Product Force Machine Learning & AI Engineer Vincente Ciancio Product Force Software Engineer Neil Achtman Product Force Software Engineer In all my 20+ years working on cutting-edge AI technologies, I've never come across a better opportunity to advance the state-of-the-art, than Entefy. Kostas Rapantzikos Product Force Sr. AI Scientist Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. Talent that runs deep Entefyers consist of inventors, engineers, and business leaders who are working to create a beautiful product that makes the complex simple and transforms chaos into harmony. Our roots are in technology, our passion is for people, and our mission is helping them work better together. Geographically, we come from all over. People who were born or have lived throughout the United States, as well as Australia, Belgium, Canada, France, Germany, Greece, Iran, Japan, Netherlands, Sweden, UK, Venezuela, and elsewhere. Most Entefyers are bi- or multi-lingual. We've travelled the globe, done business in dozens of countries and know something of the world, its cultures, and how things are seen and done differently in other places. We are diversity personified. We have people as young as seventeen and as old as seventy-eight. Cumulatively, we have centuries of experience, overwhelmingly in the high-technology sector but with a good dose of some dozen other industries as well, including consumer products, education, energy, manufacturing, retail, and utilities. Our executive team has deep experience in all major aspects of a corporation including finance, operations, technology, sales, and product development. Our senior leadership also has the experience of holding 26 Board of Director positions. Educationally, our people come primarily from a STEM background. We do have a scattering of economics, arts, political sciences, design, and other degrees. In addition, we have among us multiple MBAs and PhDs. We have intellectual horsepower and variety. This strength is reflected in the fact that our small team has produced hundreds of commercial apps, products, and other market solutions, not to mention more than 100 articles, books, and other publications. In all my 20+ years working on cutting-edge AI technologies, I've never come across a better opportunity to advance the state-of-the-art, than Entefy. IMPACT FIRST Renaissance Team Culture Diversity Accomplished We look for people who are 360-degree thinkers, accomplished individuals accustomed to working in close teams to produce excellence by contributing impactful ideas and constructive refinement. The Entefy team has an incredible range of backgrounds and perspectives. We have individuals with deep experience in everything from filmmaking to chip design. From language parsing to computer vision. Even race car driving. None of this is surprising. When you hire accomplished, multifaceted individuals, it is amazing to discover what else they have done. Jump to Careers \"Better is Better\" The Sapir-Whorf hypothesis holds that the words we use reflect who we are and the way we view the world. We think that the best way to paint a picture of Entefy's culture is to share our mantras: Jump to Careers The best of the best come from all over Entefy embodies the best in diversity. Not only because team members were born or have lived in 16 countries on 6 continents, and range in age from 17 to 78. Nor that we have worked, collectively, in 53 different countries and speak 14 different languages. Details like this create something deeper. Our backgrounds make us open-minded and respectful of each other and our varied accomplishments. We value the different perspectives that come from diverse knowledge and experience. We share a capacity to embrace individuality even as we challenge one another to do our best work. We have different backgrounds but share a common goal—to create a future enriched by universal digital interaction. Jump to Careers We look for people who are 360-degree thinkers, accomplished individuals accustomed to working in close teams to produce excellence by contributing impactful ideas and constructive refinement. The Entefy team has an incredible range of backgrounds and perspectives. We have individuals with deep experience in everything from filmmaking to chip design. From language parsing to computer vision. Even race car driving. None of this is surprising. When you hire accomplished, multifaceted individuals, it is amazing to discover what else they have done. The Sapir-Whorf hypothesis holds that the words we use reflect who we are and the way we view the world. We think that the best way to paint a picture of Entefy's culture is to share our mantras: The best of the best come from all over Entefy embodies the best in diversity. Not only because team members were born or have lived in 16 countries on 6 continents, and range in age from 17 to 78. Nor that we have worked, collectively, in 53 different countries and speak 14 different languages. Details like this create something deeper. Our backgrounds make us open-minded and respectful of each other and our varied accomplishments. We value the different perspectives that come from diverse knowledge and experience. We share a capacity to embrace individuality even as we challenge one another to do our best work. We have different backgrounds but share a common goal—to create a future enriched by universal digital interaction. One giant leap for… you Entefy is building incredible technology that does something remarkable: it makes you the center of your digital life. We dreamed up a universal communicator then took communications, security, privacy, reliability, and de entirely new directions—putting all of the people, services, and smart things in your life inside a single, beautifully designed application that works on all your favorite devices. It's technology you haven't seen before. It's generations ahead. And we're only getting started. One giant leap for… you Entefy is building incredible technology that does something remarkable: it makes you the center of your digital life. We dreamed up a universal communicator then took communications, security, privacy, reliability, and de entirely new directions—putting all of the people, services, and smart things in your life inside a single, beautifully designed application that works on all your favorite devices. It's technology you haven't seen before. It's generations ahead. And we're only getting started. UNIVERSAL COMMUNICATOR You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. Read More UNIVERSAL COMMUNICATOR You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. Entefy leverages proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast interface to help you better manage digital complexity and chaos. You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. You at the center of your digital world Entefy has built the first-ever universal communicator that puts the world of people, services, and smart things inside a single application that runs on all your favorite devices. We created it, so we get to define it. A universal communicator is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. Entefy leverages proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast interface to help you better manage digital complexity and chaos. INNOVATION Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. Read More INNOVATION Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. We had to come up with new for all the things Entefy lets you do that no other technology allowed before, such as: Securefy . Data security and privacy controls aren't features, they are built into Entefy's DNA. Securefy lets you trust that your personal data is yours and yours alone, and gives you privacy controls that adapt to the context of every message you send. File Intuitor . We thought that finding where you put that document you needed was far too time-consuming, so we invented File Intuitor as a way to locate information faster and more reliably than ever before. Picosync . Have you ever closed your laptop before an application could finish uploading data? Now imagine syncing everything in your life across every device so fast that it's practically instantaneous. That's Picosync. We're making the dictionary thicker one innovation at a time. Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. Adding to the dictionary one invention at a time Sure, we've filed 31 patents covering pioneering advancements in machine learning, computer vision, search, and data security. That's not to mention the growing number of trade secrets we've created along the way. But talking about intellectual property doesn't give you much insight into how our technology can make a difference in your life. Entefy is not innovation for innovation's sake, but courageous innovation that changes the digital world for the better. We had to come up with new for all the things Entefy lets you do that no other technology allowed before, such as: Securefy . Data security and privacy controls aren't features, they are built into Entefy's DNA. Securefy lets you trust that your personal data is yours and yours alone, and gives you privacy controls that adapt to the context of every message you send. File Intuitor . We thought that finding where you put that document you needed was far too time-consuming, so we invented File Intuitor as a way to locate information faster and more reliably than ever before. Picosync . Have you ever closed your laptop before an application could finish uploading data? Now imagine syncing everything in your life across every device so fast that it's practically instantaneous. That's Picosync. We're making the dictionary thicker one innovation at a time. AUTHENTIC INTELLIGENCE You-centric intelligence Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" Read More AUTHENTIC INTELLIGENCE You-centric intelligence Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" With advances in computer vision and natural language processing, engineers are able to train machines to respond to ever-more-subtle nuances and trends. Which has great potential for making real impact in people's lives—except that most of these advances are used for little more than predicting another advertisement to put in your face. Entefy is doing something vastly different. We are redefining AI at the personal scale—we call it Authentic Intelligence. Authentic Intelligence is about you, your world, and the flow of your daily life. Here's what we mean. Most apps claiming to use AI merely collect and analyze data about you just to sell you more stuff. Authentic Intelligence collects and analyzes data in new ways designed to help you do more and live better. Imagine having the power of a super smart friend at your command on any device, anywhere, and at any time. Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" Transforming artificial intelligence into authentic intelligence. The \"artificial\" in artificial intelligence was needed long ago when a smart machine was a thing to fear. Even this frequently used definition of AI sounds a little frightening: \"a flexible rational computer agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal.\" With advances in computer vision and natural language processing, engineers are able to train machines to respond to ever-more-subtle nuances and trends. Which has great potential for making real impact in people's lives—except that most of these advances are used for little more than predicting another advertisement to put in your face. Entefy is doing something vastly different. We are redefining AI at the personal scale—we call it Authentic Intelligence. Authentic Intelligence is about you, your world, and the flow of your daily life. Here's what we mean. Most apps claiming to use AI merely collect and analyze data about you just to sell you more stuff. Authentic Intelligence collects and analyzes data in new ways designed to help you do more and live better. Imagine having the power of a super smart friend at your command on any device, anywhere, and at any time. NEW IOT: THE INTELLIGENCE OF THINGS NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. Read More NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. Yet humans are already approaching information saturation—we cannot continue to process more and more information indefinitely. Spam and email overload are already bad enough. What happens when all the things in our lives start sending updates? Entefy has anticipated the time when toasters talk and toothbrushes check in. Not only does our platform give you powerful ways to communicate with the people in your life, it also helps you control smart devices like never before—a single universal communicator for everyone and everything, available on all your favorite devices. Entefy makes dumb devices smart and smart devices smarter. That's the Intelligence of Things. NEW IOT: THE INTELLIGENCE OF THINGS NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. NEW IOT: THE INTELLIGENCE OF THINGS Making smart devices smarter At Entefy, Artificial Intelligence + Internet of Things = Intelligence of Things. Over the past few years, people generated more information than was accumulated during the entirety of human history. And with 200,000,000,000 smart machines projected to be collecting and analyzing data by 2020—more digital bits than there are stars in the universe, and representing $14.4 trillion in economic impact—this is something far greater than your average technology trend. Yet humans are already approaching information saturation—we cannot continue to process more and more information indefinitely. Spam and email overload are already bad enough. What happens when all the things in our lives start sending updates? Entefy has anticipated the time when toasters talk and toothbrushes check in. Not only does our platform give you powerful ways to communicate with the people in your life, it also helps you control smart devices like never before—a single universal communicator for everyone and everything, available on all your favorite devices. Entefy makes dumb devices smart and smart devices smarter. That's the Intelligence of Things. SECURITY Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. Read More SECURITY Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. What's coming next is pretty exciting. Entefy is raising the privacy and security bar as high as it goes, giving you protection so effective that no error or downtime on our part can lead to the exposure of your valuable data. Look for innovations you've never seen before like zero-*********-servers, single sign-on access, and adaptive privacy controls. An entirely new generation of digital technologies that safeguard your security and give you full control over your privacy. Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. Say goodbye to cyber insecurity Right now, 91% of adults in America believe they have lost control over their personal information. As consumers, we're asked to accept the fact that most popular digital services provide the app for free in exchange for collecting data on everything we do throughout the day. But time and again, these same services expose us to data breaches and security vulnerabilities. What's coming next is pretty exciting. Entefy is raising the privacy and security bar as high as it goes, giving you protection so effective that no error or downtime on our part can lead to the exposure of your valuable data. Look for innovations you've never seen before like zero-*********-servers, single sign-on access, and adaptive privacy controls. An entirely new generation of digital technologies that safeguard your security and give you full control over your privacy. INFRASTRUCTURE The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. Read More INFRASTRUCTURE The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. We are committed to providing you with 99.999% uptime—\"five nines\" for short—or no more than 25.9 seconds of downtime per month. To put that in perspective, California's largest electric utility was down for 551 seconds per customer per month in 2015. We chose a standard that is 21 times more stringent. Why? Because you trust us to protect all the connections in your life. Which makes reliability not just a goal, but a commitment. We'll take care of the complexity it takes to make it happen. The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. The new model for reliability Entefy is more reliable than a light switch. We believe that for our users to trust us, they have to trust our infrastructure. That means that Entefy has to be available 24 hours a day, every day of the year. We are committed to providing you with 99.999% uptime—\"five nines\" for short—or no more than 25.9 seconds of downtime per month. To put that in perspective, California's largest electric utility was down for 551 seconds per customer per month in 2015. We chose a standard that is 21 times more stringent. Why? Because you trust us to protect all the connections in your life. Which makes reliability not just a goal, but a commitment. We'll take care of the complexity it takes to make it happen. It's Life Compatible Entefy makes it easy to manage your interconnected world, whether you're powered on or winding down. On average, people spend 3 hours a day just to send or receive messages. And that doesn't even include all of our other digital interactions throughout the day. We are constantly switching from app to app just to stay in touch—taking time away from actually getting things done. Entefy is introducing the only technology that puts you at the center of your digital universe. It gives you unprecedented access to the people, services, and smart things in your life and lets you find simplicity in your interconnected, digitally-engaged life. Entefy makes it easy to manage your interconnected world, whether you're powered on or winding down. On average, people spend 3 hours a day just to send or receive messages. And that doesn't even include all of our other digital interactions throughout the day. We are constantly switching from app to app just to stay in touch—taking time away from actually getting things done. Entefy is introducing the only technology that puts you at the center of your digital universe. It gives you unprecedented access to the people, services, and smart things in your life and lets you find simplicity in your interconnected, digitally-engaged life. LIVE BETTER Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Read More LIVE BETTER Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Your weekend reengineered Free time is more free with Entefy. Don't like spending your free time doing chores? Entefy can't clean your kitchen (at least, not yet), but it can schedule your favorite cleaner. Not a big shopper? Use Entefy's intelligent agent to build a shopping list then place the order when you're ready. Can't find the time for a trip to the gym? Entefy gives you back all that time you spend managing apps, freeing up a little time here and a lot of time there—before you know it, you'll have time for the gym and a leisurely espresso afterwards. You won't realize what a technology burden you have been carrying until you let it go. Welcome to a better world. A world of living well. Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Giving you that 25th hour in the day It isn't always easy to set aside work when it's time to play. Entefy helps you do just that. Because all of the features that make Entefy effective at work are just as effective after hours. Entefy uses artificial intelligence and other first-ever technologies to create an adaptable, responsive, and custom-to-you portal for your interconnected world of devices, applications, apps, and services. Your weekend reengineered Free time is more free with Entefy. Don't like spending your free time doing chores? Entefy can't clean your kitchen (at least, not yet), but it can schedule your favorite cleaner. Not a big shopper? Use Entefy's intelligent agent to build a shopping list then place the order when you're ready. Can't find the time for a trip to the gym? Entefy gives you back all that time you spend managing apps, freeing up a little time here and a lot of time there—before you know it, you'll have time for the gym and a leisurely espresso afterwards. You won't realize what a technology burden you have been carrying until you let it go. Welcome to a better world. A world of living well. Free time is more free with Entefy. Don't like spending your free time doing chores? Entefy can't clean your kitchen (at least, not yet), but it can schedule your favorite cleaner. Not a big shopper? Use Entefy's intelligent agent to build a shopping list then place the order when you're ready. Can't find the time for a trip to the gym? Entefy gives you back all that time you spend managing apps, freeing up a little time here and a lot of time there—before you know it, you'll have time for the gym and a leisurely espresso afterwards. You won't realize what a technology burden you have been carrying until you let it go. Welcome to a better world. A world of living well. WORK BETTER Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Read More WORK BETTER Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Find your focus Entefy puts all of your connections and communications into a single, intuitive interface so you can do more in one place. No switching, no loss of focus. Add in an intuitive AI that learns your habits and preferences, and you have a powerful tool for getting more done in record time. Looking for that competitive edge to make you more productive? Entefy delivers everything you need to manage your hyper-connected world and stay two steps ahead of the curve. Busy won't feel quite so busy anymore. Want to make waves? Professionals looking to transform their industry need technology this transformative. With seamless connection to the people, things, and services in your work life, you'll find unique uses for Entefy whatever your industry focus: Aerospace & Defense Agriculture Automotive Banking Communications Consumer Goods & Services Education Energy, Utilities, & Mining Financial & Insurance Food Government Healthcare Hospitality & Travel Information Technology Law Manufacturing Media & Entertainment Nonprofit Pharmaceuticals & Life Sciences Retail Transportation & Logistics Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Stay two steps ahead Wake up, check email, compose email, read texts, send texts, check social, scan feeds, like a post, write a post, open photos, share a selfie, message a contact, check more feeds. And that's all before you leave for work—at work, things get far more fast-paced and hectic. When we switch from app to app and device to device during the day, we create digital overhead that would be better spent getting work done. Entefy puts all of your connections and communications into a single, intuitive interface so you can do more in one place. No switching, no loss of focus. Add in an intuitive AI that learns your habits and preferences, and you have a powerful tool for getting more done in record time. Looking for that competitive edge to make you more productive? Entefy delivers everything you need to manage your hyper-connected world and stay two steps ahead of the curve. Busy won't feel quite so busy anymore. Want to make waves? Professionals looking to transform their industry need technology this transformative. With seamless connection to the people, things, and services in your work life, you'll find unique uses for Entefy whatever your industry focus: Aerospace & Defense Agriculture Automotive Banking Communications Consumer Goods & Services Education Energy, Utilities, & Mining Financial & Insurance Food Government Healthcare Hospitality & Travel Information Technology Law Manufacturing Media & Entertainment Nonprofit Pharmaceuticals & Life Sciences Retail Transportation & Logistics Pioneers wanted Every day at Entefy is challenging, rewarding, fun. We are looking for talented people who want to make an impact working on transformative technologies. Our team is growing fast, but when you're building something game-changing every talented mind makes a big impact. Every day at Entefy is challenging, rewarding, fun. We are looking for talented people who want to make an impact working on transformative technologies. Our team is growing fast, but when you're building something game-changing every talented mind makes a big impact. ETHOS We believe... Entefy is about people , not protocols. Technology exists to simplify lives, not complicate them. Leadership is defined by \" firsts ,\" \" mosts ,\" and \" bests .\" Success is measured by the degree of impact we make. Every day brings new opportunities for courageous innovation. Entefy is about people , not protocols. Technology exists to simplify lives, not complicate them. Leadership is defined by \" firsts ,\" \" mosts ,\" and \" bests .\" Success is measured by the degree of impact we make. Every day brings new opportunities for courageous innovation. TRIFECTA Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Read More TRIFECTA Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Next, the technology. Because the world is still in a state of transition, nothing quite works how we want it to. It is a pervasive problem that affects virtually everyone, every day, and it can only be solved with prodigious creativity. This promise of universal interaction is what drives Entefy. Now, the people—why would you want to work here? Rudd can tell you. Rudd Canaday is our Senior Software Architect, and also happens to be the computer science pioneer who co-invented Unix. He has spent more than half a century at the frontiers of technological innovation as a key contributor to numerous companies and initiatives. Here is what he said about his first working visit with the team: \" I just had a ball. It was so much fun working with these guys and the problem was really interesting and quite difficult and so when they actually offered me the job, I didn't even hesitate. I want to be somewhere where I know that what I am doing is having a real impact on the whole place. When I was involved in designing the core of the system, that's what I really love doing, that was really exciting and really fun. And we achieved it. We have got a design now that is going to work. And we have done enough with it to know that it is going to work. When we were working on Unix we weren't thinking of it as something that could change the world. Now I think we are a little more aware that what we are doing could have a huge impact. Pretty darn exciting. It really is. \" Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Three rights make a better tomorrow The right team, building the right technology, pursing the right opportunity. First, let's define the opportunity. There have been tremendous advances in personal communication and data intelligence technologies. It has started a convergence in three key aspects of a person's digital life: the people they communicate with, the services they use, and the smart things they control. No single solution exists in the market that addresses these three areas, though there are many apps, services, and other products that offer point solutions. People want smarter, unifying solutions to help them keep pace with the growing demand for knowledge management and productivity. Next, the technology. Because the world is still in a state of transition, nothing quite works how we want it to. It is a pervasive problem that affects virtually everyone, every day, and it can only be solved with prodigious creativity. This promise of universal interaction is what drives Entefy. Now, the people—why would you want to work here? Rudd can tell you. Rudd Canaday is our Senior Software Architect, and also happens to be the computer science pioneer who co-invented Unix. He has spent more than half a century at the frontiers of technological innovation as a key contributor to numerous companies and initiatives. Here is what he said about his first working visit with the team: \" I just had a ball. It was so much fun working with these guys and the problem was really interesting and quite difficult and so when they actually offered me the job, I didn't even hesitate. I want to be somewhere where I know that what I am doing is having a real impact on the whole place. When I was involved in designing the core of the system, that's what I really love doing, that was really exciting and really fun. And we achieved it. We have got a design now that is going to work. And we have done enough with it to know that it is going to work. When we were working on Unix we weren't thinking of it as something that could change the world. Now I think we are a little more aware that what we are doing could have a huge impact. Pretty darn exciting. It really is. \" ENVIRONMENT Life is good Our office glows with electrifying enthusiasm. Just try bottling this stuff. There is a background hum as people coordinate and problem-solve. Occasionally there are hoots of laughter from a joke or clever wordplay. We are excited about what we are doing. The work is intense but so is the enthusiasm. You see, this team is indeed building the future. Like an extended family, we share our meals. And during our meals we share our opinions, our ideas, our recommendations. Around here, life is good. Our office glows with electrifying enthusiasm. Just try bottling this stuff. There is a background hum as people coordinate and problem-solve. Occasionally there are hoots of laughter from a joke or clever wordplay. We are excited about what we are doing. The work is intense but so is the enthusiasm. You see, this team is indeed building the future. Like an extended family, we share our meals. And during our meals we share our opinions, our ideas, our recommendations. Around here, life is good. FORCES May the four forces be with you We're small, we're focused, we're moving fast. Big companies need to be hierarchical because they have many specialized silos. It makes sense for them. Entefy is a different creature. We are just getting started—small and growing fast. Hierarchy and silos would only slow us down. Our approach is to organize the company around what we need and nothing more. From that requirement, the Forces concept arose. Product Force brings the Entefy game-changing product to life, Growth Force connects with the customer, Talent Force ensures we have the right technical skills and cultural values within our team, and Business Force makes everything run smoothly. It is an entirely new way to organize a company. And another example of Entefy innovation at work. May the four forces be with you We're small, we're focused, we're moving fast. Big companies need to be hierarchical because they have many specialized silos. It makes sense for them. Entefy is a different creature. We are just getting started—small and growing fast. Hierarchy and silos would only slow us down. Our approach is to organize the company around what we need and nothing more. From that requirement, the Forces concept arose. Product Force brings the Entefy game-changing product to life, Growth Force connects with the customer, Talent Force ensures we have the right technical skills and cultural values within our team, and Business Force makes everything run smoothly. It is an entirely new way to organize a company. And another example of Entefy innovation at work. CAREER OPPORTUNITIES Make it happen Convinced you have the Entefy moxie? Browse our open positions, then introduce yourself. What qualities do we think it takes to change the future? Start by reading about Entefy's Core Values . Your accomplishments, capabilities, and education are the first part of the equation. The rest is cultural fit: we care about who you are just as much as what you have accomplished. If you do not find openings listed that match your interests and experience, use the \"Create Your Own\" option to tell us about your perfect role at the awesomest company in Silicon Valley. Jump to Team Apply Convinced you have the Entefy moxie? Browse our open positions, then introduce yourself. What qualities do we think it takes to change the future? Start by reading about Entefy's Core Values . Your accomplishments, capabilities, and education are the first part of the equation. The rest is cultural fit: we care about who you are just as much as what you have accomplished. If you do not find openings listed that match your interests and experience, use the \"Create Your Own\" option to tell us about your perfect role at the awesomest company in Silicon Valley. CAREER BLOG Work matters We are proud of the team that we have assembled, diligently working to make a positive change in the world. Entefyers come from all over the world, and have worked in many different roles at many different companies. We share our insights on our Career blog. Here are some of our favorite stories: Say yes to working parents bringing their kids to the office Forget work-life balance. Think work-life fulfillment. The Eisenhower Matrix: 4 rules for getting more done faster 11 Entefy mantras that inspire our work Boost your solopreneur superpowers: 5 ways to create and manage time The hazards of confirmation bias in life and work Read more of our Careers blog We are proud of the team that we have assembled, diligently working to make a positive change in the world. Entefyers come from all over the world, and have worked in many different roles at many different companies. We share our insights on our Career blog. Here are some of our favorite stories: Say yes to working parents bringing their kids to the office Say yes to working parents bringing their kids to the office Forget work-life balance. Think work-life fulfillment. Forget work-life balance. Think work-life fulfillment. The Eisenhower Matrix: 4 rules for getting more done faster The Eisenhower Matrix: 4 rules for getting more done faster 11 Entefy mantras that inspire our work 11 Entefy mantras that inspire our work Boost your solopreneur superpowers: 5 ways to create and manage time Boost your solopreneur superpowers: 5 ways to create and manage time The hazards of confirmation bias in life and work The hazards of confirmation bias in life and work Code with us Until we launch, we are being discreet about how much we share. But we are interested in working with like-minded partners developing technologies that give users a superior experience and help them live happily at the center of their digital ecosystems. Connect Until we launch, we are being discreet about how much we share. But we are interested in working with like-minded partners developing technologies that give users a superior experience and help them live happily at the center of their digital ecosystems. Entefy is making headlines We're making news at Entefy. Keep abreast of the latest developments from the company and see what people are saying about us. Journalists and media professionals, you'll find everything you need to know about Entefy, its founders, and its technology in the pages below. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Entefy is making headlines We're making news at Entefy. Keep abreast of the latest developments from the company and see what people are saying about us. Journalists and media professionals, you'll find everything you need to know about Entefy, its founders, and its technology in the pages below. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Putting people at the heart of their digital universe Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Read More ENTEFY ABOUT Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy is introducing a universal communicator to rein in this growing chaos, putting you at the heart of your digital universe. The core technology is a smart platform that uses advanced Artificial Intelligence to help you seamlessly interact with everyone and everything in your life, all from a single application on your favorite devices. Co-founders Alston Ghafourifar (pronounced Gaf-fooree-far) and sister, Brienne, first sketched out their dream on a coffee shop napkin and immediately began building their venture. Entefy has since raised $14.8 million as it gained momentum, forged relationships, and gathered an exceptional team. From distinguished board members and investors such as Wim Roelandts , Chairman of Applied Materials, Lily Sarafan , CEO of Home Care Assistance, Duncan Niederauer , the former CEO of NYSE Euronext, Peter Detkin , Founder of Intellectual Ventures, Jeff Risher, Chief IP Counsel at Tesla and former Head of Patent Licensing and Strategy at Apple, and Ed Oates , Co-founder of Oracle, to notable team members including Dr. Rudd Canaday , the co-inventor of Unix, Entefy is attracting top talent in business and technology. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Putting you at the heart of your digital universe – With so many social networks, channels, and apps, people are finding it increasingly difficult to manage relationships with their growing personal and professional networks. Entefy officials share how they are \"rewriting the code of digital interaction.\" Inbox chaos? The ultimate taming tool – Entefy leaders discuss how their technology will help people manage the chaos and complexity of their day-to-day lives, gain control, and achieve more. The 10X factor: optimizing life and business – Today, we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. Entefy leaders discuss how new technology will help us be more engaged, organized, and productive. Assembling a brilliant team – Entefy is attracting top talent in business and technology. Company leaders discuss how startups can build a great team to bring a great idea to market. Courageous innovation: big solutions for big problems – Successful entrepreneurs are able to look ahead, envision where we are going, and find solutions to problems we didn't even know we had. Entefy's co-founders share why young people are well equipped to change the world. Suggested interview questions for Entefy company officials: What is Entefy's technology and what will it do? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Why is being young an advantage when it comes to developing big solutions for big problems? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? Read More FOUNDERS Interview Questions What is Entefy's technology and what will it do? People spend an average of three hours a day communicating on an average of 7.4 social/communication apps. How is this contributing to inconsistency, inefficiency, and challenges to privacy and security? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Who came up with the idea? How will Entefy help people manage the chaos and complexity of their day-to-day lives and achieve more? Today we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. How will Entefy help? How will Entefy change the world of digital interaction to revolve around people, and not technology trends? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? How will colleges, universities, instructors, and teachers use Entefy? Entefy has raised $14.8 million and attracted top talent in technology and business. What is the secret to this success? \"Courageous innovation\" is part of Entefy's company culture. What does this mean? Why is being young an advantage when it comes to developing big solutions for big problems? ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Alston Ghafourifar CEO & Founder With the curiosity of a social scientist and the precision of an engineer, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has raised $14.8 million in venture funding, created several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic intellectual property patents in the areas of security, privacy, and communications including: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a Bachelor's degree in Politics. Brienne Ghafourifar Co-founder Brienne is a Co-founder of Entefy, leads the company's Talent Force, and manages key product initiatives. Brienne is a full-stack entrepreneur who set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. As a leader among young entrepreneurs, she has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. She is featured in the documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a Bachelor's degree in Economics from Santa Clara University. \"'She Started It' Trailer: Documentary Aims To Bolster Female Entrepreneurship\" \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Young women raise big bucks for startups\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a Million\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"How AI Is Transforming Human Communication\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" $1 Million by 17: sparking youth entrepreneurship – Brienne explains why she hopes to inspire and open opportunities for other young entrepreneurs. When you're young, impossible is nothing – Alston and Brienne both graduated college at age 17. The siblings discuss the advantages of being \"too young to know what's impossible.\" The wheel revolves around you: master multitasking – Alston and Brienne share their secret to taming the chaos of life's demands, and how this principle inspired her to create new technology to put people at the center of their digital universe. Love your work, love life – Alston and Brienne work very hard but it doesn't feel like work because they're doing what they love. The co-founders discuss how their generation is redefining the idea of work-life balance. Girl power: engaging young women in STEM careers – As one of four female founders featured in the documentary \"She Started It,\" Brienne hopes to inspire more girls to pursue careers in science, technology, engineering and math. She discusses what it takes to empower girls. The 10X factor – Brienne shares her secrets for optimizing time, energy, and focus to maximize productivity and achieve goals in business, family and relationships, education, and health. Suggested interview questions for Entefy company founders: What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? Read More FOUNDERS Interview Questions What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? How do you optimize your time, energy, and focus to be so productive? How did this approach inspire your idea for Entefy? Entefy has put together a brilliant team. What's your secret to attracting exceptional talent? Women have formed only 3% of tech startups, run only 4% of Fortune 500 companies, and receive less than 10% of venture funding. How do you think your generation will change this? You say communication needs to be focused on people, not protocols. How will Entefy and universal interaction change the way people interact, collaborate, and create? ENTEFY FOUNDERS TECHNOLOGY About Assets Press Story Ideas Interview Questions Introducing the universal communicator . Entefy's answer to the increasingly chaotic digital world. Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. Read More TECHNOLOGY ABOUT Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. This is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. To make it all possible, we've assembled a team with a cumulative 460 years of industry experience and a track record of producing 730 apps, products, and commercial solutions. The right team, building the right technology, pursing the right opportunity. \"Pre-launch Startup, Entefy, tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Entefy closes more than $2 million in its Series AA round\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Entefy is transforming artificial intelligence into authentic intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Read More COMPANY Interview Questions Entefy is transforming Artificial Intelligence into Authentic Intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Entefy's infrastructure, a model for security and reliability – Consumers are accustomed to power outages, phone outages, Internet service outages. Entefy is designing its infrastructure to be more reliable than a light switch, with downtime limited to just 25.9 seconds per month. Entefyers discuss why continuous uptime matters to consumers' digital lives. How is Entefy breaking the cycle of data in-security? – Surveys show that 91% of adults in America believe they have lost control over their personal information. Entefyers discuss how the company has developed new technologies to give consumers total control over their security and privacy, without giving up usability and convenience. Suggested interview questions for Entefy company technology: You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? Read More COMPANY Interview Questions You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? How exactly does Entefy \"put you at the center of your digital universe\"? Isn't hopping in and out of apps simply a fact of professional and personal life in the 21st century? Entefy's claims that its technology is useful in practically any industry. How can that be so? How can Entefy develop new solutions that the world's largest technology companies can't simply develop themselves? Putting people at the heart of their digital universe Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives. We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 4 million smart phone apps available for download, more than 100 trillion electronic messages sent and received annually, and as many as 200 billion smart machines projected by 2020, and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy is introducing a universal communicator to rein in this growing chaos, putting you at the heart of your digital universe. The core technology is a smart platform that uses advanced Artificial Intelligence to help you seamlessly interact with everyone and everything in your life, all from a single application on your favorite devices. Co-founders Alston Ghafourifar (pronounced Gaf-fooree-far) and sister, Brienne, first sketched out their dream on a coffee shop napkin and immediately began building their venture. Entefy has since raised $14.8 million as it gained momentum, forged relationships, and gathered an exceptional team. From distinguished board members and investors such as Wim Roelandts , Chairman of Applied Materials, Lily Sarafan , CEO of Home Care Assistance, Duncan Niederauer , the former CEO of NYSE Euronext, Peter Detkin , Founder of Intellectual Ventures, Jeff Risher, Chief IP Counsel at Tesla and former Head of Patent Licensing and Strategy at Apple, and Ed Oates , Co-founder of Oracle, to notable team members including Dr. Rudd Canaday , the co-inventor of Unix, Entefy is attracting top talent in business and technology. \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Putting you at the heart of your digital universe – With so many social networks, channels, and apps, people are finding it increasingly difficult to manage relationships with their growing personal and professional networks. Entefy officials share how they are \"rewriting the code of digital interaction.\" Inbox chaos? The ultimate taming tool – Entefy leaders discuss how their technology will help people manage the chaos and complexity of their day-to-day lives, gain control, and achieve more. The 10X factor: optimizing life and business – Today, we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. Entefy leaders discuss how new technology will help us be more engaged, organized, and productive. Assembling a brilliant team – Entefy is attracting top talent in business and technology. Company leaders discuss how startups can build a great team to bring a great idea to market. Courageous innovation: big solutions for big problems – Successful entrepreneurs are able to look ahead, envision where we are going, and find solutions to problems we didn't even know we had. Entefy's co-founders share why young people are well equipped to change the world. Suggested interview questions for Entefy company officials: What is Entefy's technology and what will it do? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Why is being young an advantage when it comes to developing big solutions for big problems? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? What is Entefy's technology and what will it do? People spend an average of three hours a day communicating on an average of 7.4 social/communication apps. How is this contributing to inconsistency, inefficiency, and challenges to privacy and security? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Who came up with the idea? How will Entefy help people manage the chaos and complexity of their day-to-day lives and achieve more? Today we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. How will Entefy help? How will Entefy change the world of digital interaction to revolve around people, and not technology trends? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? How will colleges, universities, instructors, and teachers use Entefy? Entefy has raised $14.8 million and attracted top talent in technology and business. What is the secret to this success? \"Courageous innovation\" is part of Entefy's company culture. What does this mean? Why is being young an advantage when it comes to developing big solutions for big problems? With the curiosity of a social scientist and the precision of an engineer, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has raised $14.8 million in venture funding, created several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic intellectual property patents in the areas of security, privacy, and communications including: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a Bachelor's degree in Politics. Brienne is a Co-founder of Entefy, leads the company's Talent Force, and manages key product initiatives. Brienne is a full-stack entrepreneur who set a world record at the age of 17 by becoming the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $14.8 million. As a leader among young entrepreneurs, she has been covered by international media including Fast Company , CNN Money , Forbes , NBC , and The Huffington Post . Brienne actively participates in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. She is featured in the documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a Bachelor's degree in Economics from Santa Clara University. \"'She Started It' Trailer: Documentary Aims To Bolster Female Entrepreneurship\" \"Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round...\" \"Young women raise big bucks for startups\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a Million\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"Entefy closes more than $2 million in its Series AA round\" \"How AI Is Transforming Human Communication\" \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" $1 Million by 17: sparking youth entrepreneurship – Brienne explains why she hopes to inspire and open opportunities for other young entrepreneurs. When you're young, impossible is nothing – Alston and Brienne both graduated college at age 17. The siblings discuss the advantages of being \"too young to know what's impossible.\" The wheel revolves around you: master multitasking – Alston and Brienne share their secret to taming the chaos of life's demands, and how this principle inspired her to create new technology to put people at the center of their digital universe. Love your work, love life – Alston and Brienne work very hard but it doesn't feel like work because they're doing what they love. The co-founders discuss how their generation is redefining the idea of work-life balance. Girl power: engaging young women in STEM careers – As one of four female founders featured in the documentary \"She Started It,\" Brienne hopes to inspire more girls to pursue careers in science, technology, engineering and math. She discusses what it takes to empower girls. The 10X factor – Brienne shares her secrets for optimizing time, energy, and focus to maximize productivity and achieve goals in business, family and relationships, education, and health. Suggested interview questions for Entefy company founders: What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Brienne, why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? How do you optimize your time, energy, and focus to be so productive? How did this approach inspire your idea for Entefy? Entefy has put together a brilliant team. What's your secret to attracting exceptional talent? Women have formed only 3% of tech startups, run only 4% of Fortune 500 companies, and receive less than 10% of venture funding. How do you think your generation will change this? You say communication needs to be focused on people, not protocols. How will Entefy and universal interaction change the way people interact, collaborate, and create? Introducing the universal communicator . Entefy's answer to the increasingly chaotic digital world. Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. Entefy is building the first communication and digital interaction platform for everyone and everything. The universal communicator connects you with the people, services, and smart things in your life, all inside a single application that runs seamlessly on multiple devices. Entefy takes communications, security, privacy, reliability, and de entirely new directions, leveraging proprietary algorithms and intellectual property—including 31 filed patents in computer vision, natural language processing, security, search, and big data—and a lightning-fast conversational interface to help users better manage digital complexity and chaos. This is not just another point solution for communication, but an entire ecosystem of utility. An all-in-one platform that solves app-overload, inbox-overload, notification-overload, account-overload—even the \"I-can't-find-it-because-I-don't-know-where-it-is-and-search-isn't-helping-me\" problem. To make it all possible, we've assembled a team with a cumulative 460 years of industry experience and a track record of producing 730 apps, products, and commercial solutions. The right team, building the right technology, pursing the right opportunity. \"Pre-launch Startup, Entefy, tops $50 Million Valuation with New Investment Round...\" \"Entefy has garnered $4.1 million in investments and is currently in development...\" \"She Started It: A Film About Female Founders\" \"Meet next generation tech titans\" \"18 and a million\" \"Entefy listed in 'Top 20 Artificial Intelligence Companies'\" \"Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance\" \"If young girls are able to see Brienne Ghafourifar...than they will know that it is possible...\" \"Entefy closes more than $2 million in its Series AA round\" \"Local siblings co-found Palo Alto-based company to change the world\" Top 10 women throughout history who made groundbreaking achievements in tech \"This is one duo who is unafraid to aim high\" \"Ambitious...Entefy is attempting to integrate communications, search, and cloud storage\" \"The tools that Entefy is building will revolutionize the way people search and share information\" \"...Entefy will render redundant your current apps for email, text, social messaging...\" \"Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1M in Funding\" Entefy is transforming artificial intelligence into authentic intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Entefy is transforming Artificial Intelligence into Authentic Intelligence – Artificial intelligence is a hot topic in technology. New products and services are being created that make use of one or more aspects of AI: machine learning, natural language processing, and computer vision. Entefy leaders discuss how the company is taking AI in an entirely new direction that we call \"Authentic Intelligence.\" AI + IoT = Intelligence of Things – It is projected that there will be 200 billion smart machines operating by 2020. This includes everything from thermostats to medical nanobots to smart towns. Entefy's approach is to add Artificial Intelligence to Internet of Things devices and create what it calls the Intelligence of Things. Entefy leaders discuss the challenges in making smart devices truly smart. Entefy's infrastructure, a model for security and reliability – Consumers are accustomed to power outages, phone outages, Internet service outages. Entefy is designing its infrastructure to be more reliable than a light switch, with downtime limited to just 25.9 seconds per month. Entefyers discuss why continuous uptime matters to consumers' digital lives. How is Entefy breaking the cycle of data in-security? – Surveys show that 91% of adults in America believe they have lost control over their personal information. Entefyers discuss how the company has developed new technologies to give consumers total control over their security and privacy, without giving up usability and convenience. Suggested interview questions for Entefy company technology: You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? You describe your product as a \"universal communicator.\" What does that mean? How is Entefy different from chatbots or messaging apps? What does Entefy think about the future of artificial intelligence? What do you mean by the phrase \"Intelligence of Things\"? Most consumers believe they have lost control of their personal data. What is Entefy doing to change that belief? You claim your platform infrastructure delivers \"five nines\" uptime. What does this mean and why does it matter? How exactly does Entefy \"put you at the center of your digital universe\"? Isn't hopping in and out of apps simply a fact of professional and personal life in the 21st century? Entefy's claims that its technology is useful in practically any industry. How can that be so? How can Entefy develop new solutions that the world's largest technology companies can't simply develop themselves? By using this website you agree to accept all of this agreement. Do not use this website if you disagree with or do not agree to be bound by all of the following : The website you have entered is operated by or on behalf of Entefy Inc. (\"Entefy\"). Your use of this website indicates that you have read and accepted our privacy practices, as outlined in our as well as the following of use. At any time, Entefy reserves the right to modify such of use for any reason or no reason at all. Changes will be posted here and unless otherwise disclosed, any change becomes effective immediately upon posting. Your continued use of this website after the posting of any change in the shall constitute your acceptance to be bound by any such changes. The information and features included in this website are only for informational or entertainment purposes and have been put together from a variety of sources. By accessing or linking to this website, you assume the risk that the information on this website may be incomplete, inaccurate, out of date, or may not meet your needs and requirements. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, video and audio clips, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). While using the website, you agree not to commit or participate in any acts that may be found harmful or otherwise objectionable to Entefy, its employees, agents, affiliates, associates, other website users or any other person. Entefy makes no representation or warranty whatsoever regarding the completeness, accuracy, currency or adequacy of any information, facts, views, opinions, statements or recommendations contained on this website and/or the Material. Reference to any product, process, publication or service of any third party by trade name, domain name, trademark, service mark, logo, manufacturer or otherwise does not constitute or imply its endorsement or recommendation by Entefy. Views and opinions of users of this website do not necessarily state or reflect those of Entefy. Users are responsible for seeking the advice of professionals, as appropriate, regarding the information, opinions, advice or content available at this website. By using this website you agree to indemnify, defend and hold harmless Entefy and its employees, owners, officers, affiliates, licensors, assigns, from and against any third party claims, damages, losses, and liabilities as well as all costs and expenses related to defense arising out of or relating to your breach of your representations or agreements hereunder. Your violation of any of these or any law, your used of this website or the material violation of these , information or material transmitted through your computer that infringes any intellectual property rights including but not limited to copyright, trademark, trade secret, or patent, you will cooperate fully and reasonably in Entefy's defense of any claim. Entefy reserves the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you. Except as otherwise described in the website's , anything you submit to Entefy through this website or otherwise, including, without limitation, any ideas, data, questions, artwork, comments, suggestions, or personal information (jointly and severally, \"Submissions\"), is and will be treated as non-confidential and non-proprietary and we will not be liable for any use or disclosure. You hereby irrevocably grant, transfer, sell and assign to Entefy all right, title and interest in and to those Submissions, including, without limitation, all patents, trademarks, service marks, trade names, trade identities, copyrights, trade secrets, logos, domain names, know-how, source code and object code, mask-work rights, inventions, moral rights, author's rights, algorithms, rights in packaging, goodwill and other intellectual property and proprietary rights that may subsist in the Submissions. You further agree that Entefy will have the unfettered right throughout the universe, in perpetuity, without any credit or compensation to you, to use, reuse, modify, alter, display, archive, publish, license, perform, reproduce, disclose, transmit, publish, broadcast, post, sell, translate, create derivative works of, or distribute any Submissions or portions of any Submissions in any form, media, software or technology of any kind now known or developed in the future for any purposes whatsoever including, without limitation, developing, manufacturing and marketing products using such information. You hereby acknowledge and agree that your relationship with Entefy is not a confidential, fiduciary, or other special relationship, and that your decision to submit any material to Entefy does not place Entefy in a position that is any different from the position held by members of the general public with regard to your Submissions. You hereby waive any moral rights you may have in and to any of your Submissions, even if such material is altered or changed in a manner not agreeable to you. You represent that any Submissions are original with you and do not infringe upon, misappropriate or violate the rights of any third parties, including, without limitation, any intellectual property rights, rights of publicity or privacy or any other proprietary rights. You agree to execute any documents and take all steps that Entefy determines are necessary to affect the intentions of these . You agree and understand that Entefy is not obligated to use any Submission you make to Entefy through the website or otherwise and you have no right to compel such use. Finally, you acknowledge that, with respect to any claim you may have relating to or arising out of a Entefy's actual or alleged exploitation or use of any Submission, the damage, if any, thereby caused will not be irreparable or otherwise sufficient to entitle you to injunctive or other equitable relief or to in any way enjoin the production, distribution, exhibition or other exploitation of any production based on or allegedly based on the Submission, and your rights and remedies in any such event shall be strictly limited to the right to recover damages, if any, in an action at law. Violations and Additional Policies Entefy will determine your compliance with these in its sole discretion and its decision shall be final and binding. If any provision of these is found to be invalid by any court having competent jurisdiction, the invalidity of such provision will not affect the validity of the remaining provisions of these , which will remain in full force and effect. The section titles in these are for your convenience only and do not have any legal or contractual effect. If you have any questions, comments or concerns about our website or these of Use, you may contact us at contact@entefy.com .",
    "Entefy, Inc. (\"Entefy\") provides this to inform you of our privacy practices as they pertain to our website, www.entefy.com (the \"Site\"). We also intend for this policy to inform you about our privacy practices as they pertain to your use of our products and services. This applies to all aspects of our products and services, whether made available or accessed via our Site, via the websites of our partners, via other third parties, or on mobile devices. Entefy provides communication, data storage, and search solutions including, but not limited to, mobile and web-based products. The Entefy products, services, software, Entefy Site, and all analysis and results generated from use of such items, are collectively referred to in this as the \"Services.\" This may be updated from time to time. We will notify you of any changes by posting the new on the Site. You are advised to consult this regularly for any changes. What Information do we collect? Entefy collects personally identifiable information (\"PII\") via the Site and the Services. PII is any information that may be used to contact, identify or locate an individual, and includes, but is not limited to, your name, phone number, email address and postal address. We generally collect PII under the following scenarios: When you choose to provide us with your PII via the Site, including when you send us an email for any reason, we use that information to respond to your request and store it in our database. If you provide Entefy with your email address for the purposes of receiving email notifications regarding the Services, we may also email you with information and offers from Entefy and/or third parties that we believe you may find useful or interesting. If you decide at any time that you no longer wish to receive such communications, please follow the unsubscribe instructions provided within the email. The Services may enable you to send emails to your friends. If you provide your email address or your friends' email addresses for these purposes, we will store those email addresses, but will not use them to send promotional emails to you or your friends (unless you or your friends independently to receive promotional emails from us.) We also collect non-personally identifiable information (\"Non-PII\") via the Site and Services. Non-PII is information that may not, on its own, be used to identify or locate a person or entity, and includes your IP address, browser type, your computer's operating system, which pages you view, which links you click, the amount of time you spend on certain pages and certain demographic information such as age and gender. Entefy collects Non-PII under the following scenarios: When you visit the Site, our servers may automatically collect and may store Non-PII, including but not limited to your IP address, the number, frequency and duration of your visits to the Site and specific pages viewed, your browser type, your Internet Service Provider, your computer's operating system, the web page you were visiting before you came to the Site, and information you search for on the Site. This information may be used for Site maintenance, and to enable us to enhance our products and services offered. When you register on the Site, our servers may automatically collect the Non-PII items described above as well as your interactions with Entefy's staff and other registered Site users. We may retain this Non-PII in our internal system as part of your registered account. We may use this information internally to analyze the aggregate activities and preferences of our registered Site users, and to track and assess your interest in becoming a Services user. When you use the Services, our servers may automatically collect Non-PII including but not limited to your IP address, web pages viewed, your browser type, your Internet Service Provider, the web page you were visiting before you came to the Services, and information you search for via the Services. This information may be used for Site maintenance, to enable us to enhance our products and services offered. When you enable the Services on a website, we may record data related to that activity, including but not limited to the URL of the web page(s) where the Services are enabled. We use that information to help maintain and track the effectiveness of the Services. Non-PII is also collected from End Users who visit a web page where the Services are enabled. We may use certain Non-PII about your visits to this Site, other web sites and your use of the Services in order to enable us to provide products and services to you. As explained below, we use a cookie or web beacon to collect this information. Cookies and Web Beacons We use \"cookies\" in connection with the Site and the Services. A cookie is a small data file that we transfer to your computer for record-keeping purposes. We use \"persistent cookies\" to save your username and login password for future logins to the Site and the Services. We may use \"session ID cookies\" to enable certain features of the Services to better understand how Developers and End Users interact with the Services and to monitor web traffic routing on the Site and aggregate usage of the Services. We may also use \"flash cookies\" to enable certain features of the Services, and to help store the non-PII we use to deliver more relevant products, services, and advertisements to you via the Site, the Services, and on other websites you may visit. We also use web beacons in connection with the Site and Services. Web beacons (also known as \"1X1 pixels\" or \"clear GIFs\") are small strings of code that provide a method for delivering a graphic image on a web page or in an email message for the purpose of transferring data. You can instruct your browser, by changing its options, to stop accepting cookies or to prompt you before accepting a cookie from the website you visit. If you do not accept cookies, however, you may not be able to use all portions of the Site or all functionality of the Services. For more information about cookies and web beacons, please visit http://www.allaboutcookies.org/cookies/ . Information Sharing and Disclosure In addition to the data collection and use practices outlined above, we may share or otherwise disclose information to third parties under the following circumstances. Aggregate Information and Non-Identifying Information We may share aggregated information with third parties, including the press, in order to demonstrate usage of the Services, spot industry trends, and to generate publicity for the Services. Any such aggregated information will not contain PII. We may employ third party companies and individuals to facilitate the Services and/or to provide services on our behalf, (including, without limitation, bill and credit card payment processing, maintenance, hosting and database management services, and administration). These third parties have access to PII only to perform these tasks on our behalf and are obligated by contract not to disclose or use it for any other purpose. Compliance with Laws and Law Enforcement Entefy cooperates with government and law enforcement officials and private parties to enforce and comply with the law. We will disclose any information about you to government or law enforcement officials or private parties as we, in our sole discretion, believe necessary or appropriate to respond to claims and legal process (including but not limited to subpoenas), to protect the property and rights of Entefy or a third party, to protect the safety of the public or any person, or to prevent or stop any activity we may consider to be, or that poses a risk of being, illegal, unethical, inappropriate or legally actionable. Entefy may sell, transfer or otherwise share some or all of its assets, including PII, Non-PII, and any other information we have, in connection with a merger, acquisition, reorganization or sale of assets, or in the event of bankruptcy. Entefy's Policy Toward Children Entefy does not knowingly collect PII from children under 13. If a parent or guardian believes that his or her child has provided us with PII without their consent, he or she should contact us at contact@entefy.com . If we become aware that a child under 13 has provided us with PII, we will take reasonable steps to delete such information from our files. Opt-ing Out and Changing or Deleting Your Information Changing / Deleting your Information Anyone with a registered Entefy account may review, update, correct or delete the PII in their registration profile by logging into their account and changing the preferences associated with their account. We may retain an archived copy of your records as required by law or for legitimate business purposes. If you'd like Entefy to delete any PII that we have on you, please send us an email to contact@entefy.com . If you'd like to opt-out from having Entefy collect and use your Non-PII, please send us an email at contact@entefy.com . When you opt-out, we will place an opt-out cookie on your computer. The opt-out cookie tells us not to collect your Non-PII. Please note that if you delete, block or otherwise restrict cookies, or if you use a different computer or Internet browser, you may need to renew your opt-out choice. Please also note that opting out in this manner will not impact the information collection practices of certain third parties or social media sites. You will need to visit the privacy policies of those third parties in order to exercise your opt-out choice as it pertains to them. The security of your information is important to us, including but not limited to the PII collected via the Site and Services. We have implemented reasonable security measures to protect the information in our care, both during transmission and once we receive it. This may include, but is not limited to, the use of firewalls and encryption. You should know, however, that no method of transmission over the Internet, or method of electronic storage, is 100% secure. Therefore, while we strive to use commercially acceptable means to protect your information, we cannot guarantee its absolute security. Information collected on this Site or via the Services may be transferred to — and maintained on — computers located outside of your state, province, country or other governmental jurisdiction where the privacy laws may not be as protective as those in your jurisdiction. If you are located outside the United States and choose to provide information to Entefy, please be advised that we transfer PII to the United States and process and store it there. Your consent to this followed by your submission of such information represents your consent to that transfer. The Site and Services may contain links to other websites. If you choose to visit a product supplier, advertiser, or other third party by \"clicking on\" a product description, banner ad or other type of advertisement, or click on another third party link, you will be directed to that third party's website. The fact that we link to a website or present a product description, banner ad or other type of advertisement is not an endorsement, authorization or representation that we are affiliated with that third party, nor is it an endorsement of their privacy or information security policies or practices. We do not exercise control over third party websites. These other websites may place their own cookies or other files on your computer, collect data or solicit personal information from you. Other websites and services follow different rules regarding the use or disclosure of the personal information you submit to them. We encourage you to read the privacy policies or statements of the other websites you visit. This is subject to change. If we make any substantive changes in the way that we use the information collected through the Site or the Services, we will post a clear notice of those changes on the Site and in this . If you have any questions about this , please contact us at contact@entefy.com . The effective date of this is 1/1/2014. This was last updated on 4/16/2014.",
    "Press Corner Entefy Founders Assets About Putting People at the Heart of Their Digital Universe Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 2.5+ million apps available for download, more than 100 trillion electronic messages sent annually, and nearly 5 billion IoT products , and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy reins in the growing chaos and puts you at the heart of your hyper-connected world. The Palo Alto tech startup is building the first intelligent interface to help people easily and effectively manage their lives. It allows users to engage with others and the world around them from a single application on any smart device. Entefy promises users an intuitive interface, unmatched security, and real privacy—all without ads. The company is based on the principle that technology exists to simplify lives so it comes as no surprise that Entefy's technology is all about people, not protocols. Co-founders Alston Ghafourifar (SAY Gaf-fooree-far) and sister, Brienne, first sketched out their dream on a coffee shop napkin and immediately began building their venture. Entefy has since raised $9.7 million as it gained momentum, forged relationships, and gathered a brilliant team. From distinguished board members and investors such as the Wim Roelandts , Chairman of Applied Materials, Duncan Niederauer , the former CEO of NYSE Euronext, Peter Detkin , Founder of Intellectual Ventures, and Ed Oates , Founder of Oracle, as well as notable team members including Rudd Canaday , the co-inventor of UNIX, Entefy is attracting top talent in business and technology. Media Coverage Young women raise big bucks for startups NBC Bay Area: Entefy Tops $50 Million Valuation with New Investment Round Local siblings cofound Palo Alto-based company to change the world \"She Started It\" Aims To Change Silicon Valley's Gender Inequality Problem Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round 18-Year-Old Entrepreneur Crosses $2 Million Mark for Tech Startup Entefy \"She Started It\": A Film About Female Founders You Thought $1M by 18 Was Impressive? Brienne Ghafourifar Doubles Her Funding Haul 18 and a Million Local Teen Raises $1M for Her Startup--Before Her 18th Birthday 17-Year-Old Santa Clara University Grad Determined to Raise $1 Million in Venture Funding by Her 18th Birthday Can young Palo Alto founders beat the odds with Entefy? Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1 Milllion In Funding Brienne Ghafourifar, 17-year-old Silicon Valley teen, to raise $1 Million in Venture Funding Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance News and Story Ideas Putting You at the Center of Your Digital World – With so many social networks, channels, and apps, people are finding it increasingly difficult to manage relationships with their growing personal and professional networks. Entefy officials share how they are \"rewriting the code of digital interaction.\" Inbox Chaos? The Ultimate Taming Tool – Entefy leaders discuss how their technology will help people manage the chaos and complexity of their day-to-day lives, gain control, and achieve more. The 10X Factor: Optimizing Life and Business – Today, we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. Entefy leaders discuss how new technology will help us be more engaged, organized, and productive. Assembling a Brilliant Team – Entefy is attracting top talent in business and technology. Company leaders discuss how startups can build a great team to bring a great idea to market. Courageous Innovation: Big solutions for Big Problems – Successful entrepreneurs are able to look ahead, envision where we are going, and find solutions to problems we didn't even know we had. Entefy's co-founders share why young people are well equipped to change the world Interview Questions Suggested interview questions for Entefy company officials: What is Entefy's technology and what will it do? People spend an average of three hours a day communicating on an average of 7.4 social/communication apps. How is this contributing to inconsistency, inefficiency, and challenges to privacy and security? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Who came up with the idea? How will Entefy help people manage the chaos and complexity of their day-to-day lives and achieve more? Today we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. How will Entefy help? How will Entefy change the world of digital interaction to revolve around people, and not technology trends? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? How will colleges, universities, instructors, and teachers use Entefy? Entefy has raised $9.7 million and attracted top talent in technology and business. What is the secret to this success? \"Courageous innovation\" is part of Entefy's company culture. What does this mean? Why is being young an advantage when it comes to developing big solutions for big problems? Assets About Alston Ghafourifar, CEO & Co-Founder With the curiosity of a social scientist and an engineer's precision, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has successfully raised $9.7 million in venture funding, executed several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic IPs in areas of security, privacy, and communications such as: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a bachelor's degree in Politics. Brienne Ghafourifar, Co-Founder Brienne is a young, full-stack entrepreneur on a mission to radically transform the way technology helps people interact. While she acknowledges that it might be physically impossible to meet every person on the planet, she is more than willing to try. Brienne's deep passion for entrepreneurship and courageous innovation motivates her to actively participate in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. At the age of 17, she set the world record as the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $9.7 million. Brienne is being featured in an upcoming documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a bachelor's degree in Economics from Santa Clara University. Media Coverage Young women raise big bucks for startups NBC Bay Area: Entefy Tops $50 Million Valuation with New Investment Round Local siblings cofound Palo Alto-based company to change the world \"She Started It\" Aims To Change Silicon Valley's Gender Inequality Problem Pre-launch Startup, Entefy, Tops $50 Million Valuation with New Investment Round 18-Year-Old Entrepreneur Crosses $2 Million Mark for Tech Startup Entefy \"She Started It\": A Film About Female Founders You Thought $1M by 18 Was Impressive? Brienne Ghafourifar Doubles Her Funding Haul 18 and a Million Local Teen Raises $1M for Her Startup--Before Her 18th Birthday 17-Year-Old Santa Clara University Grad Determined to Raise $1 Million in Venture Funding by Her 18th Birthday Can young Palo Alto founders beat the odds with Entefy? Entefy Co-Founder Brienne Ghafourifar, 18, Raises $1 Milllion In Funding Brienne Ghafourifar, 17-year-old Silicon Valley teen, to raise $1 Million in Venture Funding Tech Startup's Female Co-Founder Addresses STEM Gender Imbalance News and Story Ideas $1 Million by 17: Sparking Youth Entrepreneurship – Brienne explains why she hopes to inspire and open opportunities for other young entrepreneurs. When You're Young, Impossible is Nothing – Alston and Brienne both graduated college at age 17. The siblings discuss the advantages of being \"too young to know what's impossible.\" The Wheel Revolves Around You: Master Multitasking – Alston and Brienne share their secret to taming the chaos of life's demands, and how this principle inspired her to create new technology to put people at the center of their digital universe. Love Your Work, Love Life – Alston and Brienne work very hard but it doesn't feel like work because they're doing what they love. The co-founders discuss how their generation is redefining the idea of work-life balance. Girl Power: Engaging Young Women in STEM Careers – As one of four female founders featured in the documentary She Started It , Brienne hopes to inspire more girls to pursue careers in science, technology, engineering and math. She discusses what it takes to empower girls. The 10X Factor – Brienne shares her secrets for optimizing time, energy, and focus to maximize productivity and achieve goals in business, family and relationships, education, and health. Interview Questions Suggested Interview Questions for Brienne and Alston: What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? How do you optimize your time, energy, and focus to be so productive? How did this approach inspire your idea for Entefy? Entefy has put together a brilliant team. What's your secret to attracting exceptional talent? Women have formed only 3 percent of tech startups, run only 4 percent of Fortune 500 companies, and receive less than 10 percent of venture funding. How do you think your generation will change this? You say communication needs to be focused on people, not protocols. How will Entefy and universal interaction change the way people interact, collaborate, and create? Putting People at the Heart of Their Digital Universe Entefy is rewriting the code of digital interaction to make it simple for people to experience abundantly interconnected lives We spend an average of three hours per day sending and receiving messages digitally across a variety of formats, applications, operating systems, and devices. Combine this with 2.5+ million apps available for download, more than 100 trillion electronic messages sent annually, and nearly 5 billion IoT products , and we're suddenly faced with a hyper-connected world that's becoming more challenging to navigate day by day. Entefy reins in the growing chaos and puts you at the heart of your hyper-connected world. The Palo Alto tech startup is building the first intelligent interface to help people easily and effectively manage their lives. It allows users to engage with others and the world around them from a single application on any smart device. Entefy promises users an intuitive interface, unmatched security, and real privacy—all without ads. The company is based on the principle that technology exists to simplify lives so it comes as no surprise that Entefy's technology is all about people, not protocols. Co-founders Alston Ghafourifar (SAY Gaf-fooree-far) and sister, Brienne, first sketched out their dream on a coffee shop napkin and immediately began building their venture. Entefy has since raised $9.7 million as it gained momentum, forged relationships, and gathered a brilliant team. From distinguished board members and investors such as the Wim Roelandts , Chairman of Applied Materials, Duncan Niederauer , the former CEO of NYSE Euronext, Peter Detkin , Founder of Intellectual Ventures, and Ed Oates , Founder of Oracle, as well as notable team members including Rudd Canaday , the co-inventor of UNIX, Entefy is attracting top talent in business and technology. News and Story Ideas Putting You at the Center of Your Digital World – With so many social networks, channels, and apps, people are finding it increasingly difficult to manage relationships with their growing personal and professional networks. Entefy officials share how they are \"rewriting the code of digital interaction.\" Inbox Chaos? The Ultimate Taming Tool – Entefy leaders discuss how their technology will help people manage the chaos and complexity of their day-to-day lives, gain control, and achieve more. The 10X Factor: Optimizing Life and Business – Today, we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. Entefy leaders discuss how new technology will help us be more engaged, organized, and productive. Assembling a Brilliant Team – Entefy is attracting top talent in business and technology. Company leaders discuss how startups can build a great team to bring a great idea to market. Courageous Innovation: Big solutions for Big Problems – Successful entrepreneurs are able to look ahead, envision where we are going, and find solutions to problems we didn't even know we had. Entefy's co-founders share why young people are well equipped to change the world Suggested interview questions for Entefy company officials: What is Entefy's technology and what will it do? People spend an average of three hours a day communicating on an average of 7.4 social/communication apps. How is this contributing to inconsistency, inefficiency, and challenges to privacy and security? Your company, Entefy, is developing new technology that promises to \"rewrite the code of digital interaction.\" What does that mean? Who came up with the idea? How will Entefy help people manage the chaos and complexity of their day-to-day lives and achieve more? Today we grapple with work-life balance on a daily basis, often taking our work home and our personal lives to work. How will Entefy help? How will Entefy change the world of digital interaction to revolve around people, and not technology trends? What are \"digital natives\" and \"digital immigrants,\" and how will Entefy help both? What are \"prosumers,\" and how are they shaping the drive for new technology? How will this technology be especially useful to solo entrepreneurs? How will colleges, universities, instructors, and teachers use Entefy? Entefy has raised $9.7 million and attracted top talent in technology and business. What is the secret to this success? \"Courageous innovation\" is part of Entefy's company culture. What does this mean? Why is being young an advantage when it comes to developing big solutions for big problems? Alston Ghafourifar, CEO & Co-Founder With the curiosity of a social scientist and an engineer's precision, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has successfully raised $9.7 million in venture funding, executed several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic IPs in areas of security, privacy, and communications such as: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a bachelor's degree in Politics. Alston Ghafourifar, CEO & Co-Founder With the curiosity of a social scientist and an engineer's precision, Alston loves pushing the status quo to solve the seemingly unsolvable. As Entefy's visionary and chief problem-solver, Alston leads and builds teams, products, partnerships, and culture. Since founding Entefy, he has successfully raised $9.7 million in venture funding, executed several key strategic partnerships, managed a global product team, and led the creation of a suite of strategic IPs in areas of security, privacy, and communications such as: zero-knowledge privacy with server-side encrypted search, multi-dimensional adaptive content permissioning, and multi-format communication composition, integration, and threading, to name a few. Alston graduated from UC Santa Cruz at age 17 with a bachelor's degree in Politics. Brienne Ghafourifar, Co-Founder Brienne is a young, full-stack entrepreneur on a mission to radically transform the way technology helps people interact. While she acknowledges that it might be physically impossible to meet every person on the planet, she is more than willing to try. Brienne's deep passion for entrepreneurship and courageous innovation motivates her to actively participate in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. At the age of 17, she set the world record as the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $9.7 million. Brienne is being featured in an upcoming documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a bachelor's degree in Economics from Santa Clara University. Brienne is a young, full-stack entrepreneur on a mission to radically transform the way technology helps people interact. While she acknowledges that it might be physically impossible to meet every person on the planet, she is more than willing to try. Brienne's deep passion for entrepreneurship and courageous innovation motivates her to actively participate in conferences and workshops that encourage more people to engage in Science, Technology, Engineering, and Math. At the age of 17, she set the world record as the youngest college graduate to raise $1 million in venture funding; that figure has since grown to $9.7 million. Brienne is being featured in an upcoming documentary film, \"She Started It,\" highlighting women tech founders in the U.S. and Europe. Brienne holds a bachelor's degree in Economics from Santa Clara University. News and Story Ideas $1 Million by 17: Sparking Youth Entrepreneurship – Brienne explains why she hopes to inspire and open opportunities for other young entrepreneurs. When You're Young, Impossible is Nothing – Alston and Brienne both graduated college at age 17. The siblings discuss the advantages of being \"too young to know what's impossible.\" The Wheel Revolves Around You: Master Multitasking – Alston and Brienne share their secret to taming the chaos of life's demands, and how this principle inspired her to create new technology to put people at the center of their digital universe. Love Your Work, Love Life – Alston and Brienne work very hard but it doesn't feel like work because they're doing what they love. The co-founders discuss how their generation is redefining the idea of work-life balance. Girl Power: Engaging Young Women in STEM Careers – As one of four female founders featured in the documentary She Started It , Brienne hopes to inspire more girls to pursue careers in science, technology, engineering and math. She discusses what it takes to empower girls. The 10X Factor – Brienne shares her secrets for optimizing time, energy, and focus to maximize productivity and achieve goals in business, family and relationships, education, and health. Suggested Interview Questions for Brienne and Alston: What is your background and how did you come up with the idea for Entefy? What is Entefy and what will it do? Brienne, how did you go about raising that record-breaking $1 million and how much have you raised since? You have said part of your success is due to your youth, which frees you from any preconception of \"impossible.\" What do you mean? Why is it important to you to inspire more young women to pursue careers in science, technology, engineering and math? I understand you work very hard, but you don't see what you do as work. Why? How do you optimize your time, energy, and focus to be so productive? How did this approach inspire your idea for Entefy? Entefy has put together a brilliant team. What's your secret to attracting exceptional talent? Women have formed only 3 percent of tech startups, run only 4 percent of Fortune 500 companies, and receive less than 10 percent of venture funding. How do you think your generation will change this? You say communication needs to be focused on people, not protocols. How will Entefy and universal interaction change the way people interact, collaborate, and create? Entefy is a Palo Alto startup that is rewriting the code of digital interaction. By using this website you agree to accept all of this agreement. Do not use this website if you disagree with or do not agree to be bound by all of the following : The website you have entered is operated by or on behalf of Entefy Inc. (\"Entefy\"). Your use of this website indicates that you have read and accepted our privacy practices, as outlined in our as well as the following of use. At any time, Entefy reserves the right to modify such of use for any reason or no reason at all. Changes will be posted here and unless otherwise disclosed, any change becomes effective immediately upon posting. Your continued use of this website after the posting of any change in the shall constitute your acceptance to be bound by any such changes. The information and features included in this website are only for informational or entertainment purposes and have been put together from a variety of sources. By accessing or linking to this website, you assume the risk that the information on this website may be incomplete, inaccurate, out of date, or may not meet your needs and requirements. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, video and audio clips, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). Restrictions on Use While using the website, you agree not to commit or participate in any acts that may be found harmful or otherwise objectionable to Entefy, its employees, agents, affiliates, associates, other website users or any other person. Entefy makes no representation or warranty whatsoever regarding the completeness, accuracy, currency or adequacy of any information, facts, views, opinions, statements or recommendations contained on this website and/or the Material. Reference to any product, process, publication or service of any third party by trade name, domain name, trademark, service mark, logo, manufacturer or otherwise does not constitute or imply its endorsement or recommendation by Entefy. Views and opinions of users of this website do not necessarily state or reflect those of Entefy. Users are responsible for seeking the advice of professionals, as appropriate, regarding the information, opinions, advice or content available at this website. Indemnification By using this website you agree to indemnify, defend and hold harmless Entefy and its employees, owners, officers, affiliates, licensors, assigns, from and against any third party claims, damages, losses, and liabilities as well as all costs and expenses related to defense arising out of or relating to your breach of your representations or agreements hereunder. Your violation of any of these or any law, your used of this website or the material violation of these , information or material transmitted through your computer that infringes any intellectual property rights including but not limited to copyright, trademark, trade secret, or patent, you will cooperate fully and reasonably in Entefy's defense of any claim. Entefy reserves the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you. Except as otherwise described in the website's , anything you submit to Entefy through this website or otherwise, including, without limitation, any ideas, data, questions, artwork, comments, suggestions, or personal information (jointly and severally, \"Submissions\"), is and will be treated as non-confidential and non-proprietary and we will not be liable for any use or disclosure. You hereby irrevocably grant, transfer, sell and assign to Entefy all right, title and interest in and to those Submissions, including, without limitation, all patents, trademarks, service marks, trade names, trade identities, copyrights, trade secrets, logos, domain names, know-how, source code and object code, mask-work rights, inventions, moral rights, author's rights, algorithms, rights in packaging, goodwill and other intellectual property and proprietary rights that may subsist in the Submissions. You further agree that Entefy will have the unfettered right throughout the universe, in perpetuity, without any credit or compensation to you, to use, reuse, modify, alter, display, archive, publish, license, perform, reproduce, disclose, transmit, publish, broadcast, post, sell, translate, create derivative works of, or distribute any Submissions or portions of any Submissions in any form, media, software or technology of any kind now known or developed in the future for any purposes whatsoever including, without limitation, developing, manufacturing and marketing products using such information. You hereby acknowledge and agree that your relationship with Entefy is not a confidential, fiduciary, or other special relationship, and that your decision to submit any material to Entefy does not place Entefy in a position that is any different from the position held by members of the general public with regard to your Submissions. You hereby waive any moral rights you may have in and to any of your Submissions, even if such material is altered or changed in a manner not agreeable to you. You represent that any Submissions are original with you and do not infringe upon, misappropriate or violate the rights of any third parties, including, without limitation, any intellectual property rights, rights of publicity or privacy or any other proprietary rights. You agree to execute any documents and take all steps that Entefy determines are necessary to affect the intentions of these . You agree and understand that Entefy is not obligated to use any Submission you make to Entefy through the website or otherwise and you have no right to compel such use. Finally, you acknowledge that, with respect to any claim you may have relating to or arising out of a Entefy's actual or alleged exploitation or use of any Submission, the damage, if any, thereby caused will not be irreparable or otherwise sufficient to entitle you to injunctive or other equitable relief or to in any way enjoin the production, distribution, exhibition or other exploitation of any production based on or allegedly based on the Submission, and your rights and remedies in any such event shall be strictly limited to the right to recover damages, if any, in an action at law. Violations and Additional Policies Entefy will determine your compliance with these in its sole discretion and its decision shall be final and binding. If any provision of these is found to be invalid by any court having competent jurisdiction, the invalidity of such provision will not affect the validity of the remaining provisions of these , which will remain in full force and effect. The section titles in these are for your convenience only and do not have any legal or contractual effect. Contact Us If you have any questions, comments or concerns about our website or these of Use, you may contact us at contact@entefy.com . By using this website you agree to accept all of this agreement. Do not use this website if you disagree with or do not agree to be bound by all of the following : The website you have entered is operated by or on behalf of Entefy Inc. (\"Entefy\"). Your use of this website indicates that you have read and accepted our privacy practices, as outlined in our as well as the following of use. At any time, Entefy reserves the right to modify such of use for any reason or no reason at all. Changes will be posted here and unless otherwise disclosed, any change becomes effective immediately upon posting. Your continued use of this website after the posting of any change in the shall constitute your acceptance to be bound by any such changes. The information and features included in this website are only for informational or entertainment purposes and have been put together from a variety of sources. By accessing or linking to this website, you assume the risk that the information on this website may be incomplete, inaccurate, out of date, or may not meet your needs and requirements. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, video and audio clips, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these . From time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). While using the website, you agree not to commit or participate in any acts that may be found harmful or otherwise objectionable to Entefy, its employees, agents, affiliates, associates, other website users or any other person. Entefy makes no representation or warranty whatsoever regarding the completeness, accuracy, currency or adequacy of any information, facts, views, opinions, statements or recommendations contained on this website and/or the Material. Reference to any product, process, publication or service of any third party by trade name, domain name, trademark, service mark, logo, manufacturer or otherwise does not constitute or imply its endorsement or recommendation by Entefy. Views and opinions of users of this website do not necessarily state or reflect those of Entefy. Users are responsible for seeking the advice of professionals, as appropriate, regarding the information, opinions, advice or content available at this website. By using this website you agree to indemnify, defend and hold harmless Entefy and its employees, owners, officers, affiliates, licensors, assigns, from and against any third party claims, damages, losses, and liabilities as well as all costs and expenses related to defense arising out of or relating to your breach of your representations or agreements hereunder. Your violation of any of these or any law, your used of this website or the material violation of these , information or material transmitted through your computer that infringes any intellectual property rights including but not limited to copyright, trademark, trade secret, or patent, you will cooperate fully and reasonably in Entefy's defense of any claim. Entefy reserves the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you. Except as otherwise described in the website's , anything you submit to Entefy through this website or otherwise, including, without limitation, any ideas, data, questions, artwork, comments, suggestions, or personal information (jointly and severally, \"Submissions\"), is and will be treated as non-confidential and non-proprietary and we will not be liable for any use or disclosure. You hereby irrevocably grant, transfer, sell and assign to Entefy all right, title and interest in and to those Submissions, including, without limitation, all patents, trademarks, service marks, trade names, trade identities, copyrights, trade secrets, logos, domain names, know-how, source code and object code, mask-work rights, inventions, moral rights, author's rights, algorithms, rights in packaging, goodwill and other intellectual property and proprietary rights that may subsist in the Submissions. You further agree that Entefy will have the unfettered right throughout the universe, in perpetuity, without any credit or compensation to you, to use, reuse, modify, alter, display, archive, publish, license, perform, reproduce, disclose, transmit, publish, broadcast, post, sell, translate, create derivative works of, or distribute any Submissions or portions of any Submissions in any form, media, software or technology of any kind now known or developed in the future for any purposes whatsoever including, without limitation, developing, manufacturing and marketing products using such information. You hereby acknowledge and agree that your relationship with Entefy is not a confidential, fiduciary, or other special relationship, and that your decision to submit any material to Entefy does not place Entefy in a position that is any different from the position held by members of the general public with regard to your Submissions. You hereby waive any moral rights you may have in and to any of your Submissions, even if such material is altered or changed in a manner not agreeable to you. You represent that any Submissions are original with you and do not infringe upon, misappropriate or violate the rights of any third parties, including, without limitation, any intellectual property rights, rights of publicity or privacy or any other proprietary rights. You agree to execute any documents and take all steps that Entefy determines are necessary to affect the intentions of these . You agree and understand that Entefy is not obligated to use any Submission you make to Entefy through the website or otherwise and you have no right to compel such use. Finally, you acknowledge that, with respect to any claim you may have relating to or arising out of a Entefy's actual or alleged exploitation or use of any Submission, the damage, if any, thereby caused will not be irreparable or otherwise sufficient to entitle you to injunctive or other equitable relief or to in any way enjoin the production, distribution, exhibition or other exploitation of any production based on or allegedly based on the Submission, and your rights and remedies in any such event shall be strictly limited to the right to recover damages, if any, in an action at law. Violations and Additional Policies Entefy will determine your compliance with these in its sole discretion and its decision shall be final and binding. If any provision of these is found to be invalid by any court having competent jurisdiction, the invalidity of such provision will not affect the validity of the remaining provisions of these , which will remain in full force and effect. The section titles in these are for your convenience only and do not have any legal or contractual effect. If you have any questions, comments or concerns about our website or these of Use, you may contact us at contact@entefy.com ."
  ]
}