{
  "company": "www.viatech.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "BUILDING THE AI-ENABLED WORLD Who We Are VIA NEXT, a leading provider of back-end technology services for IC design, boasts over 20 years of experience, specializing in advanced ASICs and chiplets to power AI computations. Visit VIA NEXT VIA Labs, Inc. (VLI) is a leading supplier of USB and USB Power Delivery controllers for multi-functional devices and platforms, enabling seamless data transfer and communication. Visit VIA Labs VIA Intelligent Solutions develops complete AI systems by integrating hardware and connectivity components into functional safety and Intelligent Edge solutions. Visit VIA Intelligent Solutions BUILDING THE AI-ENABLED WORLD Who We Are VIA NEXT, a leading provider of back-end technology services for IC design, boasts over 20 years of experience, specializing in advanced ASICs and chiplets to power AI computations. Visit VIA NEXT VIA Labs, Inc. (VLI) is a leading supplier of USB and USB Power Delivery controllers for multi-functional devices and platforms, enabling seamless data transfer and communication. Visit VIA Labs VIA Intelligent Solutions develops complete AI systems by integrating hardware and connectivity components into functional safety and Intelligent Edge solutions. Visit VIA Intelligent Solutions BUILDING THE AI-ENABLED WORLD VIA NEXT, a leading provider of back-end technology services for IC design, boasts over 20 years of experience, specializing in advanced ASICs and chiplets to power AI computations. VIA Labs, Inc. (VLI) is a leading supplier of USB and USB Power Delivery controllers for multi-functional devices and platforms, enabling seamless data transfer and communication. VIA Intelligent Solutions develops complete AI systems by integrating hardware and connectivity components into functional safety and Intelligent Edge solutions. Visit VIA Intelligent Solutions +886-2-2218-5452 8F, No. 533, Zhongzheng Rd., Xindian Dist., New Taipei City, Taiwan, 231 Follow Us Contact us for the latest news and updates from VIA Get In Touch Solutions Automotive Edge Building Industrial Resources EOL Products RMA Service VIA Gallery Stories Announcements Perspectives Press Releases About Company Contact Us Internships Investor Relations 8F, No. 533, Zhongzheng Rd., Xindian Dist., New Taipei City, Taiwan, 231 Contact us for the latest news and updates from VIA Patent Marking Legal"
  ]
}