{
  "company": "www.idemia-nss.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 3
    }
  },
  "sample_docs": [
    "Large Scale Biometrics Systems Large Scale Biometrics Systems Multi-biometric systems for criminal justice, civil identity border control, and identity dominance missions. 40+ years of experience developing biometrics systems Widest user base in the industry with unmatched speed, scalability and accuracy Continuous investment in R&D with top performing algorithms in NIST evaluations Scalability proven with the world's largest biometrics systems Delivering tenprint and latent identification and facial recognition for 18,000+ law enforcement agencies that rely on IDEMIA NSS systems supporting US Federal biometric systems of record with over 100,000 searches per day against a gallery of 100 million+ identities Delivering fingerprint and iris identification for India's national ID program managing 1 million template creations and 350,000+ searches per day against a gallery of 1 billion+ records Multi-biometric systems for criminal justice, civil identity border control, and identity dominance missions. 40+ years of experience developing biometrics systems Widest user base in the industry with unmatched speed, scalability and accuracy Continuous investment in R&D with top performing algorithms in NIST evaluations Scalability proven with the world's largest biometrics systems Delivering tenprint and latent identification and facial recognition for 18,000+ law enforcement agencies that rely on IDEMIA NSS systems supporting US Federal biometric systems of record with over 100,000 searches per day against a gallery of 100 million+ identities Delivering fingerprint and iris identification for India's national ID program managing 1 million template creations and 350,000+ searches per day against a gallery of 1 billion+ records 40+ years of experience developing biometrics systems Widest user base in the industry with unmatched speed, scalability and accuracy Continuous investment in R&D with top performing algorithms in NIST evaluations Scalability proven with the world's largest biometrics systems Delivering tenprint and latent identification and facial recognition for 18,000+ law enforcement agencies that rely on IDEMIA NSS systems supporting US Federal biometric systems of record with over 100,000 searches per day against a gallery of 100 million+ identities Delivering fingerprint and iris identification for India's national ID program managing 1 million template creations and 350,000+ searches per day against a gallery of 1 billion+ records Delivering tenprint and latent identification and facial recognition for 18,000+ law enforcement agencies that rely on IDEMIA NSS systems supporting US Federal biometric systems of record with over 100,000 searches per day against a gallery of 100 million+ identities Delivering fingerprint and iris identification for India's national ID program managing 1 million template creations and 350,000+ searches per day against a gallery of 1 billion+ records",
    "Finger: MorphoWave - the first high-speed, contactless fingerprint access solution. Captures and matches four fingerprints with a wave of the hand. Overcomes the challenges of wet/dry fingers and latent prints. NIST #1 ranked algorithms ensure unrivalled matching accuracy. Proven access gate integration for secure, frictionless, high throughput access solution Face: Morpho 3D Face Reader - lightning-speed, hands-free access to restricted areas using 3D face recognition - extremely accurate matching while ensuring high throughput Iris: Morpho IAD™ (Iris at a Distance) offers fast, non-intrusive iris recognition. High throughput: 2 irises + portrait in < 1 second Integrates easily into gates, counters, walls NIST #1 ranked algorithms for speed & accuracy Finger: MorphoWave - the first high-speed, contactless fingerprint access solution. Captures and matches four fingerprints with a wave of the hand. Overcomes the challenges of wet/dry fingers and latent prints. NIST #1 ranked algorithms ensure unrivalled matching accuracy. Proven access gate integration for secure, frictionless, high throughput access solution Captures and matches four fingerprints with a wave of the hand. Overcomes the challenges of wet/dry fingers and latent prints. NIST #1 ranked algorithms ensure unrivalled matching accuracy. Proven access gate integration for secure, frictionless, high throughput access solution Face: Morpho 3D Face Reader - lightning-speed, hands-free access to restricted areas using 3D face recognition - extremely accurate matching while ensuring high throughput Iris: Morpho IAD™ (Iris at a Distance) offers fast, non-intrusive iris recognition. High throughput: 2 irises + portrait in < 1 second Integrates easily into gates, counters, walls NIST #1 ranked algorithms for speed & accuracy High throughput: 2 irises + portrait in < 1 second Integrates easily into gates, counters, walls NIST #1 ranked algorithms for speed & accuracy",
    "Morpho Video Analytic & Image Processing Platform (MVI) enables rapid analysis of complex, multi-source video content saving countless hours when it matters most. Facilitates post event video analysis and real-time face recognition Processes large volumes of heterogeneous surveillance video in minutes Streamlines analysis by extracting areas of interest including movement, persons, faces, and optionally license plates Enables customer-tailored applications such as searching video files against a specific gallery of face images Flexible deployment configurations to meet specific mission needs – on-premises, cloud, on an edge device, or in a portable jumpkit Morpho Video Analytic & Image Processing Platform (MVI) enables rapid analysis of complex, multi-source video content saving countless hours when it matters most. Facilitates post event video analysis and real-time face recognition Processes large volumes of heterogeneous surveillance video in minutes Streamlines analysis by extracting areas of interest including movement, persons, faces, and optionally license plates Enables customer-tailored applications such as searching video files against a specific gallery of face images Flexible deployment configurations to meet specific mission needs – on-premises, cloud, on an edge device, or in a portable jumpkit Facilitates post event video analysis and real-time face recognition Processes large volumes of heterogeneous surveillance video in minutes Streamlines analysis by extracting areas of interest including movement, persons, faces, and optionally license plates Enables customer-tailored applications such as searching video files against a specific gallery of face images Flexible deployment configurations to meet specific mission needs – on-premises, cloud, on an edge device, or in a portable jumpkit",
    "IDEMIA is the proven leader for credentialing solutions across Federal Agencies. Prime Contractor to high profile Federal agencies where performance is critical and national security is at stake Manager of the nation's largest facial databases of well over 200 million images Primary supplier to the DoD for iris recognition software for tactical use IDEMIA is the proven leader for credentialing solutions across Federal Agencies. Prime Contractor to high profile Federal agencies where performance is critical and national security is at stake Manager of the nation's largest facial databases of well over 200 million images Primary supplier to the DoD for iris recognition software for tactical use Prime Contractor to high profile Federal agencies where performance is critical and national security is at stake Manager of the nation's largest facial databases of well over 200 million images Primary supplier to the DoD for iris recognition software for tactical use",
    "Forensic Face Comparison Training Forensic Face Comparison Training Could you confidently compare these images when lives are on the line? Could you confirm whether these images depict the same individual, demonstrating age progression? Training Details Date(s): March 26-30, 2018 May 14-18, 2018 July 23-27, 2018 Sept 24-28, 2018 Location: Alexandria, VA Cost: $995 Register: Registration Form Take Dr. Nicole Spaun's five-day training course on forensic face comparison. Dr. Spaun is a recognized expert in facial identification and testified in State and Federal courts as an FBI expert witness. Her course builds on recommendations from the Facial Identification Scientific Working Group (FISWG) to develop vendor-independent forensic facial comparison training for IDEMIA-NSS clients and partners. Could you confidently compare these images when lives are on the line? Could you confirm whether these images depict the same individual, demonstrating age progression?"
  ]
}