{
  "company": "www.abouttimetech.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 27,
    "0": 7
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0686274509803921,
    "framing_surveillance": 0.0,
    "framing_market": 0.931372549019608,
    "num_docs": 34
  },
  "topic_timeline": {
    "20": {
      "-1": 27,
      "0": 7
    }
  },
  "sample_docs": [
    "OUR STORY, VISION and MISSION TO REVOLUTIONIZE RESOURCE MANAGEMENT SINCE 2003 In 2003 AboutTime set out to help businesses track and capture accurate field data, deliver it to the office quickly, manage the data efficiently and finally, to better feed other business systems this accurate data. AboutTime knows mobile data collection, we have specialized in mobile resource solutions before Apple and Android devices or apps existed, in fact early customers ran AboutTime \"apps\" on PALM pilots, BLACKBERRY and even early WINDOWS (Pocket PC) mobile devices. AboutTime has delivered powerful resource management solutions to our customers for well over a decade. A VISION TO HELP CUSTOMERS Gain accurate time and labor data for paychecks, invoices and true job costs. Money-makers in the field can stop pushing paper and focus on what they do well. Office staff can complete payroll, job costing and billing in a fraction of the time. Continue to leverage technology in order to eliminate waste and increase profits. A DECADE OF MOBILE EXPLOSION 2006 - 2016 Much has changed in the mobile space over the last decade. Mobile technology is exponentially better, faster and more accessible. Businesses are implementing smart technologies in the field to get the job done better, quicker and smarter. More accurate data, sooner is the goal and the end result. These businesses are joining forces with AboutTime every day and eliminating enormous amounts of waste in order to gain automation, accuracy and visibility across operations. AboutTime is constantly innovating and in order to provide our customers with the very best solutions. BUSINESSES ARE EMBRACING TECHNOLOGY NOW Mobile technology is helping our customers get better, faster. Our mission remains consistent to help our customers better track mobile, remote and local operations, to better connect their teams and to better manage mobile and remote resources. Mobile employees rely on AboutTime every day to accurately track where they were, what they did and for how long. Office administrators, managers and executives rely on AboutTIme to accurately capture and transfer accurate mobile data for real-time results, productivity reporting and improved automation. AboutTime has spent many years providing solutions our customers trust to better connect teams and manage resources. THE FUTURE IS HERE NOW. WELCOME TO ABOUT TIME Our mission is to help your teams better manage mobile, remote and local labor, productivity, assets, forms and connect your business resources. AboutTime can help you streamline operations from field to office so data is captured as it happens with complete accuracy. AboutTime is an all-inclusive, resource mangement solution that is configurable to your business. Call us today to see how our mobile workforce solutions can help your business grow and thrive in the future. MOST INFLUENTIAL Today's businesses rely on AboutTime to manage their most valuable resources... their people, their things and their mobile business. MOST INNOVATIVE AboutTime has been innovating mobile resource management solutions since 2003. >100 INTEGRATIONS AboutTime is development partners with today's premier accounting systems and has developed LIVE integration to work with the best-of-breed solutions.",
    "TRACK AND MANAGE LABOR, ASSETS, FORMS AND PRODUCTIVITY IN ONE ALL INCLUSIVE SOLUTION Since 2003, AboutTime has been helping businesses with a mobile workforce leverage technology to eliminate paper and automate inefficient processes. Our mission is to help your team better manage mobile and remote labor, productivity, assets, forms and resources. Connect your operations for complete visibility, increased accuracy and amazing gains through automation. AboutTime is an all-inclusive, on premise resource management solution that is configurable to your business. Tracking labor electronically opens the door for accurately measuring current productivity of your mobile workforce as it happens daily . As workers punch IN and OUT , accurate man hours, units used/completed and productivity metrics can be gathered. Productivity results stream into your office so management always knows where you're at before it's too late. Take resource management to the next level by capturing job photos, field notes, GPS, auto-tracking site weather conditions AND seeing complete productivity results. Reduce asset theft, extend asset life and know exactly who has what and where your assets are at all times. AboutTime's asset management helps your mobile and remote workforce collect accurate real-time or after-the-fact equipment use with location and assignment of equipment. Maintain a documented history of your assets, tools and equipment as they are assigned and re-assigned within your company. Mobile workers can better track time, labor and productivity, more accurately... in mere seconds. Multiple real-time and after-the-fact workflows are supported. No Service? No problem as workers can punch IN and OUT anywhere then sync up later. Workers can punch IN individually or supervisors can punch IN an entire crew. Mobile workers can even punch IN on one mobile device, then OUT on another and the system will tie it altogether, allow for sign offs, capture GPS, calculate unique overtime rules and more. Electronic forms help your mobile, remote and local teams quickly capture custom form information right on their mobile device, anytime, anywhere. Digital forms can be sent to the office immediately or later. Your mobile workforce can not only go paperless, now they can capture rich form data that is impossible with paper or spreadsheets, including accurate documentation, GPS, photos and video. No service? No problem. You can fill in forms offline, then sync up later. Go paperless and gain unlimited, accurate and legible electronic forms. Eliminate manual data entry, reduce payroll processing time and drastically increase accuracy on Payday. One of AboutTime's greatest strengths is the ability to tightly integrate accurate data directly with your accounting, ERP or other business systems. Accurate mobile and remote data streams into the ControlCenter as it happens. Payroll admins and office staff can then review and approve accurate records to be sent to accounting. WELCOME TO COMPLETE RESOURCE MANAGEMENT Arm your workforce with the tools to eliminate mis-reported time, form documentation errors, manual data entry mistakes, productivity loss and paper inefficiencies. Easily capture time, forms, assets and productivity data electronically to increase efficiency and automation from mobile data collection... to data delivery... to data entry. Connect all of your mobile, remote and local teams and gain completely accurate visibility over your network of field operations. Know where you're at on all projects at all times. ACCURACY AND AUTOMATION FOR YOUR WORKFORCE Shuffling paper and spreadsheets in the field is costing your business time and money. There is a BETTER , more ACCURATE and more EFFICIENT way. WORK SMARTER FROM YOUR LAPTOP TABLET OR PHONE ON THE GO Mobile workers with a laptop can capture accurate data with the AboutTime Windows TouchCenter application or with the AboutTime webclock. The TouchCenter application even allows for employee biometric authentication. All employee/job restrictions are honored so your mobile workforce only sees what is relevant to them. SEE WHY ABOUTTIME WAS VOTED #1 OUR AMAZING CUSTOMERS ARE NOW... MORE AMAZING \"Our company has offices in 11 different states, which requires multiple mobile and remote crews working in various remote locations. With AboutTime we get accurate employee time recorded daily, no matter where the staff's location!\" \"Since using AboutTime, processing payroll has been FAST and ACCURATE. We eliminated the manual data entry and the possibility of error.\" \"AboutTime has DRASTICALLY reduced payroll costs and INCREASED accountability. The support team has always been there for us when we have needed them.\" ABOUT OUR CUSTOMERS and INDUSTRIES SIMPLE IN THE FIELD... POWERFUL IN THE OFFICE! AboutTime mobile time tracking and real-time resource management solutions greatly increase efficiencies in managing a mobile workforce. Automation starts with tracking time and attendance ( labor costs ) accurately. AboutTime helps your team capture accurate field data to streamline payroll and provide your supervisors with powerful real-time visibility. Now your team can see and know current information at all times, helping make critical decisions quicker, as it happens. Choosing a competent and scalable time and attendance system is the key to accurately managing remote labor costs, field production and true job/project costs. AboutTime's field data analytics, reports and visual dashboards provide complete and current visibility of progress in the field virtually as it happens. Many software systems simply track labor. AboutTime helps you track true field operations in real-time . Eliminate cumbersome time sheets, forms and daily logs and start capturing field data with real-time accuracy that will absolutely revolutionize your business. We invite you to learn new possibilities of how quickly AboutTime can improve automation and efficiency in your company.",
    "TRACK AND MANAGE LABOR, ASSETS, FORMS AND PRODUCTIVITY IN ONE ALL INCLUSIVE SOLUTION Since 2003, AboutTime has been helping businesses with a mobile workforce leverage technology to eliminate paper and automate inefficient processes. Our mission is to help your team better manage mobile and remote labor, productivity, assets, forms and resources. Connect your operations for complete visibility, increased accuracy and amazing gains through automation. AboutTime is an all-inclusive, on premise resource management solution that is configurable to your business. Tracking labor electronically opens the door for accurately measuring current productivity of your mobile workforce as it happens daily . As workers punch IN and OUT , accurate man hours, units used/completed and productivity metrics can be gathered. Productivity results stream into your office so management always knows where you're at before it's too late. Take resource management to the next level by capturing job photos, field notes, GPS, auto-tracking site weather conditions AND seeing complete productivity results. Reduce asset theft, extend asset life and know exactly who has what and where your assets are at all times. AboutTime's asset management helps your mobile and remote workforce collect accurate real-time or after-the-fact equipment use with location and assignment of equipment. Maintain a documented history of your assets, tools and equipment as they are assigned and re-assigned within your company. Mobile workers can better track time, labor and productivity, more accurately... in mere seconds. Multiple real-time and after-the-fact workflows are supported. No Service? No problem as workers can punch IN and OUT anywhere then sync up later. Workers can punch IN individually or supervisors can punch IN an entire crew. Mobile workers can even punch IN on one mobile device, then OUT on another and the system will tie it altogether, allow for sign offs, capture GPS, calculate unique overtime rules and more. Electronic forms help your mobile, remote and local teams quickly capture custom form information right on their mobile device, anytime, anywhere. Digital forms can be sent to the office immediately or later. Your mobile workforce can not only go paperless, now they can capture rich form data that is impossible with paper or spreadsheets, including accurate documentation, GPS, photos and video. No service? No problem. You can fill in forms offline, then sync up later. Go paperless and gain unlimited, accurate and legible electronic forms. Eliminate manual data entry, reduce payroll processing time and drastically increase accuracy on Payday. One of AboutTime's greatest strengths is the ability to tightly integrate accurate data directly with your accounting, ERP or other business systems. Accurate mobile and remote data streams into the ControlCenter as it happens. Payroll admins and office staff can then review and approve accurate records to be sent to accounting. WELCOME TO COMPLETE RESOURCE MANAGEMENT Arm your workforce with the tools to eliminate mis-reported time, form documentation errors, manual data entry mistakes, productivity loss and paper inefficiencies. Easily capture time, forms, assets and productivity data electronically to increase efficiency and automation from mobile data collection... to data delivery... to data entry. Connect all of your mobile, remote and local teams and gain completely accurate visibility over your network of field operations. Know where you're at on all projects at all times. SEE WHY ABOUTTIME WAS VOTED #1 OUR AMAZING CUSTOMERS ARE NOW... MORE AMAZING \"Our company has offices in 11 different states, which requires multiple mobile and remote crews working in various remote locations. With AboutTime we get accurate employee time recorded daily, no matter where the staff's location!\" \"Since using AboutTime, processing payroll has been FAST and ACCURATE. We eliminated the manual data entry and the possibility of error.\" \"AboutTime has DRASTICALLY reduced payroll costs and INCREASED accountability. The support team has always been there for us when we have needed them.\" ABOUT OUR CUSTOMERS and INDUSTRIES ACCURACY AND AUTOMATION FOR YOUR WORKFORCE Shuffling paper and spreadsheets in the field is costing your business time and money. There is a BETTER , more ACCURATE and more EFFICIENT way. WORK SMARTER FROM YOUR LAPTOP TABLET OR PHONE ON THE GO Mobile workers with a laptop can capture accurate data with the AboutTime Windows TouchCenter application or with the AboutTime webclock. The TouchCenter application even allows for employee biometric authentication. All employee/job restrictions are honored so your mobile workforce only sees what is relevant to them. SIMPLE IN THE FIELD... POWERFUL IN THE OFFICE! AboutTime mobile time tracking and real-time resource management solutions greatly increase efficiencies in managing a mobile workforce. Automation starts with tracking time and attendance ( labor costs ) accurately. AboutTime helps your team capture accurate field data to streamline payroll and provide your supervisors with powerful real-time visibility. Now your team can see and know current information at all times, helping make critical decisions quicker, as it happens. Choosing a competent and scalable time and attendance system is the key to accurately managing remote labor costs, field production and true job/project costs. AboutTime's field data analytics, reports and visual dashboards provide complete and current visibility of progress in the field virtually as it happens. Many software systems simply track labor. AboutTime helps you track true field operations in real-time . Eliminate cumbersome time sheets, forms and daily logs and start capturing field data with real-time accuracy that will absolutely revolutionize your business. We invite you to learn new possibilities of how quickly AboutTime can improve automation and efficiency in your company.",
    "INCREASE ACCURACY , EFFICIENCY AND AUTOMATION ACROSS YOUR WORKFORCE INTEGRATE ABOUTTIME WITH OTHERS DATA INTEGRITY AboutTime ensures accurate data by integrating only active items such as active employees, jobs and costs codes, and available equipment inventory. Review, edit and sign off on records in AboutTime and then when it's time to do payroll you simply export a file to your accounting system. The payroll process becomes efficient and automated when you feed accurate field data directly into your accounting system with AboutTime's streamlined integration. LIVE Integration AboutTime is development partners with many of today's premier accounting systems and has developed LIVE integration to work directly with the \"best-of-breed\" accounting systems. This \"LIVE\" integration from your accounting system to AboutTime provides the ultimate in convenience, efficiency and automation by pulling directly into AboutTime - automatically. This streamlines operations by eliminating manual data entry while also reducing the overhead of maintaining data integrity within two systems. CSV Integration Import jobs, employees, cost codes / tasks and equipment into the AboutTime ControlCenter via CSV. Review, edit and sign off on time records throughout the week as data streams in from the field, then when it's time for payroll you simply close out and export accurate time and attendance data, then import it right into your accounting software. With Payroll XPress, sending a CSV file to accounting takes mere seconds and is typically done once per week. INTEGRATE ABOUTTIME WITH OTHERS AboutTime ensures accurate data by integrating only active items such as active employees, jobs and costs codes, and available equipment inventory. Review, edit and sign off on records in AboutTime and then when it's time to do payroll you simply export a file to your accounting system. The payroll process becomes efficient and automated when you feed accurate field data directly into your accounting system with AboutTime's streamlined integration. AboutTime is development partners with many of today's premier accounting systems and has developed LIVE integration to work directly with the \"best-of-breed\" accounting systems. This \"LIVE\" integration from your accounting system to AboutTime provides the ultimate in convenience, efficiency and automation by pulling directly into AboutTime - automatically. This streamlines operations by eliminating manual data entry while also reducing the overhead of maintaining data integrity within two systems. Import jobs, employees, cost codes / tasks and equipment into the AboutTime ControlCenter via CSV. Review, edit and sign off on time records throughout the week as data streams in from the field, then when it's time for payroll you simply close out and export accurate time and attendance data, then import it right into your accounting software. With Payroll XPress, sending a CSV file to accounting takes mere seconds and is typically done once per week.",
    "TRACK AND MANAGE LABOR, ASSETS, FORMS AND PRODUCTIVITY IN ONE ALL INCLUSIVE SOLUTION Since 2003, AboutTime has been helping businesses with a mobile workforce leverage technology to eliminate paper and automate inefficient processes. Our mission is to help your team better manage mobile and remote labor, productivity, assets, forms and resources. Connect your operations for complete visibility, increased accuracy and amazing gains through automation. AboutTime is an all-inclusive, on premise resource management solution that is configurable to your business. Tracking labor electronically opens the door for accurately measuring current productivity of your mobile workforce as it happens daily . As workers punch IN and OUT , accurate man hours, units used/completed and productivity metrics can be gathered. Productivity results stream into your office so management always knows where you're at before it's too late. Take resource management to the next level by capturing job photos, field notes, GPS, auto-tracking site weather conditions AND seeing complete productivity results. Reduce asset theft, extend asset life and know exactly who has what and where your assets are at all times. AboutTime's asset management helps your mobile and remote workforce collect accurate real-time or after-the-fact equipment use with location and assignment of equipment. Maintain a documented history of your assets, tools and equipment as they are assigned and re-assigned within your company. Mobile workers can better track time, labor and productivity, more accurately... in mere seconds. Multiple real-time and after-the-fact workflows are supported. No Service? No problem as workers can punch IN and OUT anywhere then sync up later. Workers can punch IN individually or supervisors can punch IN an entire crew. Mobile workers can even punch IN on one mobile device, then OUT on another and the system will tie it altogether, allow for sign offs, capture GPS, calculate unique overtime rules and more. Electronic forms help your mobile, remote and local teams quickly capture custom form information right on their mobile device, anytime, anywhere. Digital forms can be sent to the office immediately or later. Your mobile workforce can not only go paperless, now they can capture rich form data that is impossible with paper or spreadsheets, including accurate documentation, GPS, photos and video. No service? No problem. You can fill in forms offline, then sync up later. Go paperless and gain unlimited, accurate and legible electronic forms. Eliminate manual data entry, reduce payroll processing time and drastically increase accuracy on Payday. One of AboutTime's greatest strengths is the ability to tightly integrate accurate data directly with your accounting, ERP or other business systems. Accurate mobile and remote data streams into the ControlCenter as it happens. Payroll admins and office staff can then review and approve accurate records to be sent to accounting. WELCOME TO COMPLETE RESOURCE MANAGEMENT Arm your workforce with the tools to eliminate mis-reported time, form documentation errors, manual data entry mistakes, productivity loss and paper inefficiencies. Easily capture time, forms, assets and productivity data electronically to increase efficiency and automation from mobile data collection... to data delivery... to data entry. Connect all of your mobile, remote and local teams and gain completely accurate visibility over your network of field operations. Know where you're at on all projects at all times. ACCURACY AND AUTOMATION FOR YOUR WORKFORCE Shuffling paper and spreadsheets in the field is costing your business time and money. There is a BETTER , more ACCURATE and more EFFICIENT way. WORK SMARTER FROM YOUR LAPTOP TABLET OR PHONE ON THE GO Mobile workers with a laptop can capture accurate data with the AboutTime Windows TouchCenter application or with the AboutTime webclock. The TouchCenter application even allows for employee biometric authentication. All employee/job restrictions are honored so your mobile workforce only sees what is relevant to them. SEE WHY ABOUTTIME WAS VOTED #1 OUR AMAZING CUSTOMERS ARE NOW... MORE AMAZING \"Our company has offices in 11 different states, which requires multiple mobile and remote crews working in various remote locations. With AboutTime we get accurate employee time recorded daily, no matter where the staff's location!\" \"Since using AboutTime, processing payroll has been FAST and ACCURATE. We eliminated the manual data entry and the possibility of error.\" \"AboutTime has DRASTICALLY reduced payroll costs and INCREASED accountability. The support team has always been there for us when we have needed them.\" ABOUT OUR CUSTOMERS and INDUSTRIES FORMSXPRESS SKIP THE CLIPBOARD, CAPTURE ELECTRONIC FORMS Simple in the field... Powerful in the office! ELECTRONIC FORMS Employees can quickly enter form information into their mobile devices in the field and immediately send it back to the office. Imagine the time savings achieved by using your iPad, iPhone, Android, Tablet or Laptop Computer to capture and transfer field forms! Collect data offline if you wish and sync up when you get connected. With FormsXPress your business will receive accurate and legible digital forms from the field any time you want. Your workforce can easily capture inspection forms, materials checklists, new employee application, accident reports, change orders, work orders, or limitless other form possibilities that your business requires right on their mobile device. Electronic forms are AUTOMATICALLY SAVED and DOCUMENTED in AboutTime. Convert messy, illegible paper forms into neat, accurate, digital forms. BUILD and DEPLOY FORMS FOR ANY PROJECT Mobile and remote teams can fill out forms with or without service Associate FORMS to employees, locations or tasks for easy reference later Capture RICH data not possible with spreadsheets - GPS, SIGNATURES, PHOTOS On Sync your FORMS are auto-saved and organized - No scanning or data entry Accident, Delivery, Inspections, Work Orders, Change Orders... ANY FORM NO PAPER, NO SPREADSHEETS, NO SERVICE... NO PROBLEM Build and customize your forms and deploy them to the appropriate specific employees in the field. Once populated with the appropriate information, a simple sync sends the completed form into your office. In addition to collecting simple text and numerical input, FormsXPress allows you to go far beyond the limitations of paper by capturing rich content to your digital forms such as pictures, video, audio, GPS location stamps and even hand-signed digital signatures collected right there on the mobile device. ALL YOUR FORMS NEATLY DOCUMENTED AND ORGANIZED All of the data collected is neatly organized and directly associated with the appropriate Employee, Job, Project, Phase, Location, Task, Cost Code, Work Order, or Equipment/Asset within your AboutTime System. Stop using clipboards, spreadsheets and paper forms for good! Call AboutTime to see how your business can leverage FormsXPress by AboutTime to streamline, and ELIMINATE costly, inefficient, and annoying PAPER documents from your field operations once and for all. ALL INCLUSIVE MOBILE RESOURCE MANAGEMENT Imagine the power of combining TIME with other AboutTime features to help capture rich, accurate data along with time and attendance. LEVERAGE ABOUTTIME FOR YOUR ULTIMATE SOLUTION Take TIME and LABOR management to the next level by leveraging other mobile data capture solutions included with AboutTime. Once your mobile workforce starts capturing accurate TIME, it's quite simple to track and mange real-time productivity, assets and electronic forms, exponentially increasing the value of the solution to your business. REAL-WORLD LEVERAGE EXAMPLE + Add PRODUCTIVITY to TIME and now you begin seeing and experiencing workforce and project data that truly matters, real-time progress and productivity, triggered alerts, site specific documentation and even automatically documented weather conditions. Many of AboutTime's productivity features are captured automatically as your workforce tracks their TIME. Your business can run like a well-oiled machine by eliminating paper in the field, increase automation and reduce waste by having your field workers track it electronically. MOBILE DEVICE OPTIONS AboutTime is software-driven so whether your workforce is down the hall, down the street or completely remote they can use familiar devices to capture accurate labor information. No extra charge for loading the app on all of your staff's devices which enables the most convenient access for your teams. Your workforce will be able to track TIME, ASSETS, FORMS and PRODUCTIVITY from their smartphone, tablet, laptop or even through any web browser. Mix and match any of the following options and mobile devices to capture accurate field information across your entire workforce. SKIP THE CLIPBOARD, CAPTURE ELECTRONIC FORMS Simple in the field... Powerful in the office! Employees can quickly enter form information into their mobile devices in the field and immediately send it back to the office. Imagine the time savings achieved by using your iPad, iPhone, Android, Tablet or Laptop Computer to capture and transfer field forms! Collect data offline if you wish and sync up when you get connected. With FormsXPress your business will receive accurate and legible digital forms from the field any time you want. Your workforce can easily capture inspection forms, materials checklists, new employee application, accident reports, change orders, work orders, or limitless other form possibilities that your business requires right on their mobile device. Electronic forms are AUTOMATICALLY SAVED and DOCUMENTED in AboutTime. Convert messy, illegible paper forms into neat, accurate, digital forms. ALL INCLUSIVE MOBILE RESOURCE MANAGEMENT Imagine the power of combining TIME with other AboutTime features to help capture rich, accurate data along with time and attendance. Take TIME and LABOR management to the next level by leveraging other mobile data capture solutions included with AboutTime. Once your mobile workforce starts capturing accurate TIME, it's quite simple to track and mange real-time productivity, assets and electronic forms, exponentially increasing the value of the solution to your business. Add PRODUCTIVITY to TIME and now you begin seeing and experiencing workforce and project data that truly matters, real-time progress and productivity, triggered alerts, site specific documentation and even automatically documented weather conditions. Many of AboutTime's productivity features are captured automatically as your workforce tracks their TIME. Your business can run like a well-oiled machine by eliminating paper in the field, increase automation and reduce waste by having your field workers track it electronically. AboutTime is software-driven so whether your workforce is down the hall, down the street or completely remote they can use familiar devices to capture accurate labor information. No extra charge for loading the app on all of your staff's devices which enables the most convenient access for your teams. Your workforce will be able to track TIME, ASSETS, FORMS and PRODUCTIVITY from their smartphone, tablet, laptop or even through any web browser. Mix and match any of the following options and mobile devices to capture accurate field information across your entire workforce. SIMPLE IN THE FIELD... POWERFUL IN THE OFFICE! AboutTime mobile time tracking and real-time resource management solutions greatly increase efficiencies in managing a mobile workforce. Automation starts with tracking time and attendance ( labor costs ) accurately. AboutTime helps your team capture accurate field data to streamline payroll and provide your supervisors with powerful real-time visibility. Now your team can see and know current information at all times, helping make critical decisions quicker, as it happens. Choosing a competent and scalable time and attendance system is the key to accurately managing remote labor costs, field production and true job/project costs. AboutTime's field data analytics, reports and visual dashboards provide complete and current visibility of progress in the field virtually as it happens. Many software systems simply track labor. AboutTime helps you track true field operations in real-time . Eliminate cumbersome time sheets, forms and daily logs and start capturing field data with real-time accuracy that will absolutely revolutionize your business. We invite you to learn new possibilities of how quickly AboutTime can improve automation and efficiency in your company."
  ]
}