{
  "company": "www.realeyesit.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 2,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 1
    }
  },
  "sample_docs": [
    "Who we share your personal information with? Realeyes may share your personal information with the following trusted third parties who are our carefully selected business partners that are certified as compliant with the EU-US Privacy Shield Framework or equivalent protections: • Amazon Web Services • Google Analytics • Google Cloud Patform • Opentok (Tokbox) • Vladislav Stolyarov (Private entrepreneur) < BACK TO PRIVACY Who we share your personal information with? Realeyes may share your personal information with the following trusted third parties who are our carefully selected business partners that are certified as compliant with the EU-US Privacy Shield Framework or equivalent protections: • Amazon Web Services • Google Analytics • Google Cloud Patform • Opentok (Tokbox) • Vladislav Stolyarov (Private entrepreneur) < BACK TO PRIVACY",
    "Technology Using computer vision and machine learning, we measure how people feel as they view your content online through their webcam. Drag, Drop, Done. Upload your own or competitor images, GIFs or videos at any stage of its life-cycle. We source a sample audience between 150 to 300 viewers based on your objectives. Real Responses We can measure the attention , emotions and sentiment of your sample audience as they watch your content on their own device at home. You can even ask brand lift survey questions too. Real Results, Fast Delivered to the dashboard within 3 hours (with Realeyes GO ) - inform your campaign strategy at speed by seeing how audiences responded to your creative. Act on Insight Reports are crafted by our team of highly-experienced marketing professionals who distil your results into valuable insights you can act on with confidence. Want the scientific detail? Our white papers cover the science behind our technology in greater depth - how we teach computers to recognize audience's emotions and their attention levels. ATTENTION EMOTIONS Technology Using computer vision and machine learning, we measure how people feel as they view your content online through their webcam. Using computer vision and machine learning, we measure how people feel as they view your content online through their webcam. Drag, Drop, Done. Upload your own or competitor images, GIFs or videos at any stage of its life-cycle. We source a sample audience between 150 to 300 viewers based on your objectives. Real Responses We can measure the attention , emotions and sentiment of your sample audience as they watch your content on their own device at home. You can even ask brand lift survey questions too. Real Results, Fast Delivered to the dashboard within 3 hours (with Realeyes GO ) - inform your campaign strategy at speed by seeing how audiences responded to your creative. Act on Insight Reports are crafted by our team of highly-experienced marketing professionals who distil your results into valuable insights you can act on with confidence. Upload your own or competitor images, GIFs or videos at any stage of its life-cycle. We source a sample audience between 150 to 300 viewers based on your objectives. We can measure the attention , emotions and sentiment of your sample audience as they watch your content on their own device at home. You can even ask brand lift survey questions too. Delivered to the dashboard within 3 hours (with Realeyes GO ) - inform your campaign strategy at speed by seeing how audiences responded to your creative. Reports are crafted by our team of highly-experienced marketing professionals who distil your results into valuable insights you can act on with confidence. Want the scientific detail? Our white papers cover the science behind our technology in greater depth - how we teach computers to recognize audience's emotions and their attention levels. ATTENTION EMOTIONS Want the scientific detail? Our white papers cover the science behind our technology in greater depth - how we teach computers to recognize audience's emotions and their attention levels.",
    "AI that Identifies, Verifies, and Understands Humans Realeyes helps leading brands, media companies, and tech platforms make smarter decisions. Boost ad performance, verify digital identity, and make customer experiences more human, all with privacy guaranteed. Contact Us AI that Identifies, Verifies, and Understands Humans Realeyes helps leading brands, media companies, and tech platforms make smarter decisions. Boost ad performance, verify digital identity, and make customer experiences more human, all with privacy guaranteed. Creative Intelligence for the Attention Economy Predicting sales outcomes by analyzing Attention and Emotion response to creative across social and video platforms. PreView Creative Intelligence for the Attention Economy Predicting sales outcomes by analyzing Attention and Emotion response to creative across social and video platforms. PreView Creative Intelligence for the Attention Economy Predicting sales outcomes by analyzing Attention and Emotion response to creative across social and video platforms. Ethical and Anonymous Facial Coding With advanced deep learning models trained on the world's most diverse dataset, our system estimates age, gender, and facial characteristics—while ensuring total GDPR compliance. IDENTITY Ethical and Anonymous Facial Coding With advanced deep learning models trained on the world's most diverse dataset, our system estimates age, gender, and facial characteristics—while ensuring total GDPR compliance. IDENTITY Ethical and Anonymous Facial Coding With advanced deep learning models trained on the world's most diverse dataset, our system estimates age, gender, and facial characteristics—while ensuring total GDPR compliance. Accurate and Ethically Sourced Vision AI Data The highest quality Vision AI training data, specializing in GDPR compliant opt-in face and voice data collection from the most challenging in-the-wild and studio environments. VISION AI DATA Accurate and Ethically Sourced Vision AI Data The highest quality Vision AI training data, specializing in GDPR compliant opt-in face and voice data collection from the most challenging in-the-wild and studio environments. Eliminate Fraud for Assured Panel Quality Lightweight facial verification to fight bots and tackle user fraud, ensuring that your sample data remains untainted by fake user engagement . Verify Optimize Experiences via Passive User Feedback Use cases include identity verification for panel providers, device use wellbeing, gaming engagement, automotive safety and beyond. EXPERIENCE PLATFORM Eliminate Fraud for Assured Panel Quality Lightweight facial verification to fight bots and tackle user fraud, ensuring that your sample data remains untainted by fake user engagement . Verify Eliminate Fraud for Assured Panel Quality Lightweight facial verification to fight bots and tackle user fraud, ensuring that your sample data remains untainted by fake user engagement . Optimize Experiences via Passive User Feedback Use cases include identity verification for panel providers, device use wellbeing, gaming engagement, automotive safety and beyond. EXPERIENCE PLATFORM Optimize Experiences via Passive User Feedback Use cases include identity verification for panel providers, device use wellbeing, gaming engagement, automotive safety and beyond. Latest Blog Posts Nielsen Launches Outcomes Marketplace for Smarter Ad Measurement Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Nielsen's Outcomes Marketplace Debuts, Realeyes Launch Partner Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Slash CPM by 15% with Stronger Creative Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Blog Nielsen Launches Outcomes Marketplace for Smarter Ad Measurement Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Nielsen Launches Outcomes Marketplace for Smarter Ad Measurement Nielsen's Outcomes Marketplace Debuts, Realeyes Launch Partner Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Nielsen's Outcomes Marketplace Debuts, Realeyes Launch Partner Slash CPM by 15% with Stronger Creative Better ad creative doesn't just engage – it lowers CPMs. Learn how greater creative attention improves media efficiency. View Post Slash CPM by 15% with Stronger Creative Get in touch Measure Human Response at the Speed and Scale of AI Contact Us Measure Human Response at the Speed and Scale of AI"
  ]
}