{
  "company": "www.eyn.vision",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 10,
    "0": 5
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 10,
      "0": 5
    }
  },
  "sample_docs": [
    "EYN - Privacy Notice This Privacy Notice provides details of the Personal Information we collect from you, what we do with it, how you might access it and who it might be shared with. What Personal Information do we collect? Personal Information, exclusively the following is necessary to fulfill the requirements of the business relationship which may exist between EYN Limited and its clients. Where Personal Information is collected directly from you it may contain: Visual facial images Identity data Where Identity data includes: Photo of the identity document Photo of the facial biometry contained inside the chip of the passport The identity information: Name: First name and last name Date of birth Date of expiry and issue of the identity document Issuing state of the identity document Nationality Document number Type of document And Visual facial images mean: Facial video of 2 sec We do not collect or use special categories of Personal Information unless we are legally obliged to. These special categories include, for example, trade union membership, racial origin, genetic and biometric data. Where we collect the Personal Information of a child we always obtain the consent of a parent or legal guardian. Why is this personal information collected? This personal information is being collected for compliance reasons (Right to work and Know Your customer) and for machine learning algorithm training. We collect the following Special Categories Biometric data How we collect Personal Information Where we collect your Personal Information directly from you we do this in ways including: Through your access and use of our mobile application EYN VeriFast We may also collect your Personal Information from third parties but will inform you should we do so. Who might we share Personal Information with? To maintain and improve our services, your Personal Information may need to be shared with or disclosed to other similar service providers or, in some cases, public authorities. In the course of our business relationship, where necessary, we will always seek your consent before sharing your Personal Information. We may also be mandated to disclose your Personal Information in response to requests from a court, police services or other Regulatory bodies. Where feasible, we will consult with you prior to making such disclosure and, in order to protect your privacy, we will ensure that we will disclose only the minimum amount of your information necessary for the required purpose. The only entity that will have access to your personal information is EYN LTD. What do we do with Personal Information? Detailed below you will find how we may use your Personal Information Where Personal Information is collected directly from you, we may use it to: Follow up on complaints or compliments Train machine learning algorithms How do we look after Personal Information? We limit the amount of Personal Information collected only to what is fit for the purpose of our business relationship. We restrict, secure and control all of our information assets against unauthorized access, damage, loss or destruction; whether physical or electronic. We retain Personal Information only for as long as is necessary to fulfil the requirements of business relationships, respond to requests from individuals, or longer if required by law. If we retain your Personal Information for historical or statistical purposes we ensure that the Personal Information cannot be used further. While in our possession, together with your assistance, we try to maintain the accuracy of your Personal Information. How can you access your information? Under the General Data Protection Regulation, you have the right to request access to any of your Personal Information we may hold. If any of that information is incorrect, you may request that we correct it. If we are improperly using your information, you may request that we stop using it or even delete it completely. If you would like to make a request to see what Personal Information of yours we might hold, you may make a request by contacting us directly. In addition to your right to request, correct, erase or restrict our usage of your Personal Information, you also have the right to request that we port or transfer your Personal Information to a different service provider or to yourself, if you so wish. Where it may have been necessary to get your consent to use your Personal Information, at any moment, you have the right to withdraw that consent. If you withdraw your consent, we will cease using your Personal Information without affecting the lawfulness of processing based on consent before your withdrawal. You have the right to lodge a complaint with any Supervisory Authority. See our Supervisory Authority contact details below Who we are and how you may contact us EYN Limited One Eighty, Flat 23, 180 High Street, London, United Kingdom, E15 2FD email: contact@eyn.vision phone: +44 7731 310943 Supervisory Authority United Kingdom Water Lane, Wycliffe House Wilmslow - Cheshire SK9 5AF international.team@ico.org.uk +44 1625 545 745 www.ico.org.uk EYN - Privacy Notice This Privacy Notice provides details of the Personal Information we collect from you, what we do with it, how you might access it and who it might be shared with. What Personal Information do we collect? Personal Information, exclusively the following is necessary to fulfill the requirements of the business relationship which may exist between EYN Limited and its clients. Where Personal Information is collected directly from you it may contain: Visual facial images Identity data Where Identity data includes: Photo of the identity document Photo of the facial biometry contained inside the chip of the passport The identity information: Name: First name and last name Date of birth Date of expiry and issue of the identity document Issuing state of the identity document Nationality Document number Type of document And Visual facial images mean: Facial video of 2 sec We do not collect or use special categories of Personal Information unless we are legally obliged to. These special categories include, for example, trade union membership, racial origin, genetic and biometric data. Where we collect the Personal Information of a child we always obtain the consent of a parent or legal guardian. Why is this personal information collected? This personal information is being collected for compliance reasons (Right to work and Know Your customer) and for machine learning algorithm training. We collect the following Special Categories Biometric data How we collect Personal Information Where we collect your Personal Information directly from you we do this in ways including: Through your access and use of our mobile application EYN VeriFast We may also collect your Personal Information from third parties but will inform you should we do so. Who might we share Personal Information with? To maintain and improve our services, your Personal Information may need to be shared with or disclosed to other similar service providers or, in some cases, public authorities. In the course of our business relationship, where necessary, we will always seek your consent before sharing your Personal Information. We may also be mandated to disclose your Personal Information in response to requests from a court, police services or other Regulatory bodies. Where feasible, we will consult with you prior to making such disclosure and, in order to protect your privacy, we will ensure that we will disclose only the minimum amount of your information necessary for the required purpose. The only entity that will have access to your personal information is EYN LTD. What do we do with Personal Information? Detailed below you will find how we may use your Personal Information Where Personal Information is collected directly from you, we may use it to: Follow up on complaints or compliments Train machine learning algorithms How do we look after Personal Information? We limit the amount of Personal Information collected only to what is fit for the purpose of our business relationship. We restrict, secure and control all of our information assets against unauthorized access, damage, loss or destruction; whether physical or electronic. We retain Personal Information only for as long as is necessary to fulfil the requirements of business relationships, respond to requests from individuals, or longer if required by law. If we retain your Personal Information for historical or statistical purposes we ensure that the Personal Information cannot be used further. While in our possession, together with your assistance, we try to maintain the accuracy of your Personal Information. How can you access your information? Under the General Data Protection Regulation, you have the right to request access to any of your Personal Information we may hold. If any of that information is incorrect, you may request that we correct it. If we are improperly using your information, you may request that we stop using it or even delete it completely. If you would like to make a request to see what Personal Information of yours we might hold, you may make a request by contacting us directly. In addition to your right to request, correct, erase or restrict our usage of your Personal Information, you also have the right to request that we port or transfer your Personal Information to a different service provider or to yourself, if you so wish. Where it may have been necessary to get your consent to use your Personal Information, at any moment, you have the right to withdraw that consent. If you withdraw your consent, we will cease using your Personal Information without affecting the lawfulness of processing based on consent before your withdrawal. You have the right to lodge a complaint with any Supervisory Authority. See our Supervisory Authority contact details below Who we are and how you may contact us EYN Limited One Eighty, Flat 23, 180 High Street, London, United Kingdom, E15 2FD email: contact@eyn.vision phone: +44 7731 310943 Supervisory Authority United Kingdom Water Lane, Wycliffe House Wilmslow - Cheshire SK9 5AF international.team@ico.org.uk +44 1625 545 745 www.ico.org.uk EYN - Privacy Notice What Personal Information do we collect? Photo of the identity document Photo of the facial biometry contained inside the chip of the passport Name: First name and last name Date of expiry and issue of the identity document Issuing state of the identity document Facial video of 2 sec Why is this personal information collected? We collect the following Special Categories How we collect Personal Information Through your access and use of our mobile application EYN VeriFast Who might we share Personal Information with? What do we do with Personal Information? Follow up on complaints or compliments Train machine learning algorithms How do we look after Personal Information? How can you access your information? Who we are and how you may contact us",
    "Image based document reading Identity documents contain information like name, date of birth, expiry date, document number and much more. EYN's deep learning algorithm automatically extract this information and return the data in a structured format. Try out the API, upload an identity document picture and get a structured text in under 2 sec. Get started with the API > Acoustic face liveness detection Our patented technology can detect whether someone is trying to impersonate someone else's identity by presenting a falsified biometric face in the form or a 2D face photograph or a replay video. The face liveness detection is achieved by projecting imperceptible ultrasound signals via the phone speaker. Based on the reflected audio and video signals, we can detect whether it's a live person's face or spoof (photo or video replay). 3 Patents filed in the UK, USA and EU 1) Method and apparatus for detecting the live human face leveraging passive response of human visual system [GB1703664.1,EP18160570.0,US 15913921] 2) Biometric Aliveness Detection and Localization – Ultrasound approach [GB1713469.3,EP18190068.9,US 16108183] 3) Biometric Aliveness Detection and Localization – Ultrasound and Video Analysis Approach [GB1713471.9,EP18190068.9,US 16108183] Device agnostic Our technology works on any standard smartphone and does not require additional hardware. Chip based document verification Electronic identity documents contain a chip that encodes all the information about the associated person. These information are digitally signed and encrypted.Using near field communication, EYN laverages the power of crytography to verify the authenticity and validity of identity documents by electrnically communicating and authenticating with the chip. Download the demo app > Image based document reading Identity documents contain information like name, date of birth, expiry date, document number and much more. EYN's deep learning algorithm automatically extract this information and return the data in a structured format. Try out the API, upload an identity document picture and get a structured text in under 2 sec. Get started with the API > Image based document reading Identity documents contain information like name, date of birth, expiry date, document number and much more. EYN's deep learning algorithm automatically extract this information and return the data in a structured format. Try out the API, upload an identity document picture and get a structured text in under 2 sec. Acoustic face liveness detection Our patented technology can detect whether someone is trying to impersonate someone else's identity by presenting a falsified biometric face in the form or a 2D face photograph or a replay video. The face liveness detection is achieved by projecting imperceptible ultrasound signals via the phone speaker. Based on the reflected audio and video signals, we can detect whether it's a live person's face or spoof (photo or video replay). 3 Patents filed in the UK, USA and EU 1) Method and apparatus for detecting the live human face leveraging passive response of human visual system [GB1703664.1,EP18160570.0,US 15913921] 2) Biometric Aliveness Detection and Localization – Ultrasound approach [GB1713469.3,EP18190068.9,US 16108183] 3) Biometric Aliveness Detection and Localization – Ultrasound and Video Analysis Approach [GB1713471.9,EP18190068.9,US 16108183] Device agnostic Our technology works on any standard smartphone and does not require additional hardware. Acoustic face liveness detection Our patented technology can detect whether someone is trying to impersonate someone else's identity by presenting a falsified biometric face in the form or a 2D face photograph or a replay video. The face liveness detection is achieved by projecting imperceptible ultrasound signals via the phone speaker. Based on the reflected audio and video signals, we can detect whether it's a live person's face or spoof (photo or video replay). Our technology works on any standard smartphone and does not require additional hardware. Chip based document verification Electronic identity documents contain a chip that encodes all the information about the associated person. These information are digitally signed and encrypted.Using near field communication, EYN laverages the power of crytography to verify the authenticity and validity of identity documents by electrnically communicating and authenticating with the chip. Download the demo app > Chip based document verification Electronic identity documents contain a chip that encodes all the information about the associated person. These information are digitally signed and encrypted.Using near field communication, EYN laverages the power of crytography to verify the authenticity and validity of identity documents by electrnically communicating and authenticating with the chip.",
    "Extract structured data from ID document images Powered by hyper accurate OCR technology. Upload a document image to EYN's API. ID image is processed in EYN's secure cloud in a couple of seconds. Get structured data in a JSON format containing information like name, date of birth and expiry date. Try it yourself > Extract structured data from ID document images Powered by hyper accurate OCR technology. Upload a document image to EYN's API. ID image is processed in EYN's secure cloud in a couple of seconds. Get structured data in a JSON format containing information like name, date of birth and expiry date. Your browser does not support the video tag. Match users to documents with biometric face matching. User takes a selfie after uploading their identity document to make sure they are the person who they say they are. Select the type of document to scan. Take a picture of the identity document. Take a selfie. Try it yourself > Match users to documents with biometric face matching. User takes a selfie after uploading their identity document to make sure they are the person who they say they are. Select the type of document to scan. Take a picture of the identity document. Integrate into your platform with a couple of lines of code API integration Upload ID pictures and selfie to EYN's restful API and receive a verification result within 20 seconds. iFrame integration Insert a code snippet into your web application and Eagle-ID will do the job for you. NPM package The EYN Eagle Id component provides convenient access to the EYN's API from applications written in React-based JavaScript. See API documentation > Access npm package > Integrate into your platform with a couple of lines of code API integration Upload ID pictures and selfie to EYN's restful API and receive a verification result within 20 seconds. iFrame integration Insert a code snippet into your web application and Eagle-ID will do the job for you. NPM package The EYN Eagle Id component provides convenient access to the EYN's API from applications written in React-based JavaScript. See data and checks results on the dashboard Extracted data from ID document For your compliance team and audit, you can easily see the captured ID images, extracted information and document checks. Face match score See how similar is the user to the submitted document. Regulatory checks View extra regulatory checks results like Right To Work checks in the UK on the user's profile. See data and checks results on the dashboard Extracted data from ID document For your compliance team and audit, you can easily see the captured ID images, extracted information and document checks. Face match score See how similar is the user to the submitted document. Regulatory checks View extra regulatory checks results like Right To Work checks in the UK on the user's profile. Why people choose EYN? We have been working on this product for more than three years closely with product managers, compliance, and IT directors to bring you an easy and fast ID check service. An amazing user experience. Eagle-ID takes less than 2 minutes for your users to complete. They simply upload an image of their ID and take a selfie. Simple for your developers. Eagle-ID's API can be integrated within hours to maximum a few days if you build your front end. Scalable. Eagle-ID is a 100% automated software solution. It scales automatically according to your demand. Time saver. The average time for an ID check response is 25 seconds . This will help you save operations costs of manual ID checks. Why people choose EYN? We have been working on this product for more than three years closely with product managers, compliance, and IT directors to bring you an easy and fast ID check service. Eagle-ID takes less than 2 minutes for your users to complete. They simply upload an image of their ID and take a selfie. Eagle-ID's API can be integrated within hours to maximum a few days if you build your front end. Eagle-ID is a 100% automated software solution. It scales automatically according to your demand. The average time for an ID check response is 25 seconds . This will help you save operations costs of manual ID checks. We have used EYN's ID check API to add document checking to our candidate portals. We have found it very helpful to have EYN checking the documents and extracting the data for us. We have automated the outputs into our CRM so that our business can see them. During the Covid-19 outbreak this has been particularly helpful and a belt-and-braces approach to ID checking for us. Implementing the API was a dream. Documentation is great and it's very easily to integrate. EYN's dev team were really helpful and answered all our questions really quickly. Our end clients and users are saying that we couldn't do without it now! We have used EYN's ID check API to add document checking to our candidate portals. We have found it very helpful to have EYN checking the documents and extracting the data for us. We have automated the outputs into our CRM so that our business can see them. During the Covid-19 outbreak this has been particularly helpful and a belt-and-braces approach to ID checking for us. Implementing the API was a dream. Documentation is great and it's very easily to integrate. EYN's dev team were really helpful and answered all our questions really quickly. Our end clients and users are saying that we couldn't do without it now! Startup £ 400 Billed monthly 500 ID checks/month Data extraction from ICAO specific documents Data validity document checks with MRZ Face match between selfie and the idenity document API access iFrame integration into your web app 10 dashboard users Cost per extra check: £0.80 Growth £ 900 Billed monthly 1,500 ID checks/month Data extraction from ICAO specific documents Data validity document checks with MRZ Face match between selfie and the idenity document API access iFrame integration into your web app 100 dashboard users 2 days developer support Cost per extra check: £0.60 Entreprise Contact us Billed yearly Volume discount on ID checks Data extraction from ICAO specific documents Data validity document checks with MRZ Face match between selfie and the idenity document API access iFrame integration into your web app Volume discount on dashboard users 10 days developer support Want to start your 1 month free subscription? Want to start your 1 month free subscription? Can Eagle-ID detect fake documents? Among the different types of document forgery, Eagle-ID can detect data manipulation forgery. That is if a user manipulates the MRZ data on the document Eagle-ID detects and flags it. Does Eagle-ID connect with any government database? For certain types of documents, Eagle-ID communicates with some government online services to extract additional information. For example, for British biometric residence permits, you will receive the remarks associated with the document alongside the API response. Is Eagle-ID a fully automated system? Yes, Eagle-ID is a 100% software solution with an automated response. We do not rely on any human intervention for checking documents. What documents do you support? We support all ICAO specific documents such as passports, ID cards, visas and biometric residence permits. Among the different types of document forgery, Eagle-ID can detect data manipulation forgery. That is if a user manipulates the MRZ data on the document Eagle-ID detects and flags it. For certain types of documents, Eagle-ID communicates with some government online services to extract additional information. For example, for British biometric residence permits, you will receive the remarks associated with the document alongside the API response. Yes, Eagle-ID is a 100% software solution with an automated response. We do not rely on any human intervention for checking documents. We support all ICAO specific documents such as passports, ID cards, visas and biometric residence permits.",
    "Imposters use replica of faces to impersonate a victim's identity. One of the main challenges of digital identity verification or biometric authentication is detecting the physical presence of the genuine user when matching their face to their identity document. Imposters use different face spoofing techniques to impersonate someone else's biometric identity. Digital replicas. Imposters may use photos, manipulated or computer-generated videos of the victim's face to impersonate their identity. Physical replicas. Imposters may use face photos from identity documents or printed photos of the victim's face. Watch a demo of how LiveProof is detecting genuine users using acoustic sound waves. Your browser does not support the video tag. Click below to subscribe to early access to LiveProof's demo apps on Android and iOS. We will send a private invitation to your email address. Get early access to demo app > Using audio information. LiveProof analyses the echos that interaced with a 3D face or a flat surface to determine the genuine presence of a user. Just like a bat! Mobile friendly. All you need to run LiveProof is a mobile phone. No need for special hardware or access to the most recent phones. Patented technology. LiveProof's audio based face liveness detection technique is protected by multiple patents filed in the UK, USA and EU. Integrate LiveProof into your mobile platform with a couple lines of code Mobile SDK calls LiveProof video and sound capture modules, communicates with a backend inference endpoint and output liveness score results in a JSON frormat. API API documentation. Android SDK Kotlin based SDK. iOS SDK Swift based SDK. Case studies Blog Press Imposters use replica of faces to impersonate a victim's identity. One of the main challenges of digital identity verification or biometric authentication is detecting the physical presence of the genuine user when matching their face to their identity document. Imposters use different face spoofing techniques to impersonate someone else's biometric identity. Digital replicas. Imposters may use photos, manipulated or computer-generated videos of the victim's face to impersonate their identity. Physical replicas. Imposters may use face photos from identity documents or printed photos of the victim's face. Imposters use replica of faces to impersonate a victim's identity. One of the main challenges of digital identity verification or biometric authentication is detecting the physical presence of the genuine user when matching their face to their identity document. Imposters use different face spoofing techniques to impersonate someone else's biometric identity. Imposters may use photos, manipulated or computer-generated videos of the victim's face to impersonate their identity. Imposters may use face photos from identity documents or printed photos of the victim's face. Watch a demo of how LiveProof is detecting genuine users using acoustic sound waves. Your browser does not support the video tag. Watch a demo of how LiveProof is detecting genuine users using acoustic sound waves. Click below to subscribe to early access to LiveProof's demo apps on Android and iOS. We will send a private invitation to your email address. Get early access to demo app > Click below to subscribe to early access to LiveProof's demo apps on Android and iOS. We will send a private invitation to your email address. Using audio information. LiveProof analyses the echos that interaced with a 3D face or a flat surface to determine the genuine presence of a user. Just like a bat! Mobile friendly. All you need to run LiveProof is a mobile phone. No need for special hardware or access to the most recent phones. Patented technology. LiveProof's audio based face liveness detection technique is protected by multiple patents filed in the UK, USA and EU. LiveProof analyses the echos that interaced with a 3D face or a flat surface to determine the genuine presence of a user. Just like a bat! All you need to run LiveProof is a mobile phone. No need for special hardware or access to the most recent phones. LiveProof's audio based face liveness detection technique is protected by multiple patents filed in the UK, USA and EU. Integrate LiveProof into your mobile platform with a couple lines of code Mobile SDK calls LiveProof video and sound capture modules, communicates with a backend inference endpoint and output liveness score results in a JSON frormat. API API documentation. Android SDK Kotlin based SDK. iOS SDK Swift based SDK. Integrate LiveProof into your mobile platform with a couple lines of code Mobile SDK calls LiveProof video and sound capture modules, communicates with a backend inference endpoint and output liveness score results in a JSON frormat. Case studies Blog Press",
    "Verify ID documents in real time with border grade security Contrary to traditional image-based document verification techniques, Verifast verifies ID document's authenticity cryptographically by reading and validating the embedded chip. It's the fastest and most secure way of verifying identity documents that exist. Hyper accurate data extraction. Compared to OCR-only methods, which are error prone, VeriFast extracts data from the embedded document chip digitally. Such technique ensures the integrity and validity of the extracted data. Tamper proof. To guarantee the most accurate and secure way to verify the authenticity of an identity document, VeriFast performs a cryptographic document check on the embedded chip of the ID. Through this process we can guarantee data integrity and detect potential illegitimate manipulations. Fast. No need to wait for a manual document check. Users verify their ID documents within minutes. Frictionless. Verifying an identity document with VeriFast is as easy as contactless payment. Completed within a couple of clicks Only four simple steps to complete a user's identity verification Your browser does not support the video tag. Select the type of document to scan. Place the document in front of the camera for an automatic capture. Place the phone on top of the ID to scan the embedded chip using NFC. Take a photo of the user. View reports on EYN's dashboard and access via API Dashboard See all records of your identity checks in a single web based dashboard. API integration Access all report results such as document checks, face match, captured images and other extracted data via our API. See API documentation > Document OCR. Form an ID document image, Verifast automatically extracts information like name, date of birth and expiry date. Chip ID check. VeriFast performs a cryptographic document check on the embedded chip of the ID using NFC. Face match. To prove a users' identity claims, a face matching between the identity document and a selfie is performed. Face liveness. Coming soon. Passive face liveness detection with ultrasounds. Go to LiveProof page for more information. Why our customers love VeriFast? Here are some numbers: 150k+ checks VeriFast is powered by the latest cloud and mobile technology and scales on-demand without any availability issues. 3 minutes to complete the whole flow Performing an identity check with Verifast is as easy as taking a picture and a contactless payment tap --- the whole process takes on average 3 minutes minute. 60% automation VeriFast can verify a chipped document's authenticity in real-time with no need for manual intervention. The majority of VeriFast's document checks are fully automated. 99.9% true positive Chipped documents are tough to forge and require powerful resources such as access to document printing machines. Such a robust technology makes verifying a document's authenticity almost foolproof. You can be reassured that receiving a true positive result from VeriFast is nearly 100% correct. How is VeriFast ID check different? Tamper proof. VeriFast only validates an identity document as genuine when the data inside the embedded chip of the identity document has been cryptographically validated. Such method provides a digital, tamper-proof that the holder was in procession of the genuine physical ID document during the verification process. Compared to visual, image-based approaches, chip document check has 99.99% true positive accuracy. Speed. Most users are genuine users and they will get checked within seconds with VeriFast. Thanks to its chip reading technology, VeriFast provides you with true positive document checks within seconds. No need to wait for human visual inspection, upload multiple documents or manual input. We engaged with EYN during our search for a digital ID check solution to improve the efficiency of our Right To Work and onboarding processes. We check between 2,000 and 4,000 new workers Right to Work every week, both the accuracy and security of EYN's document verification powered by chip reading technology was a crucial factor for our consideration. We must ensure compliance of our ethical standards while also satisfying Government and GLAA regulation during the placement of up to 60,000 workers each day. At Staffline, we have a rigorous compliance policy and the EYN ID check service successfully manages this task at scale through innovative and advanced technology. The process provides us accurate results within seconds!Facial recognition was also very important for us as it proves that our workers are who they say they are. Overall, it was a pleasure working with the EYN team, from due diligence and commercial agreements to our 400+ site rollout. I would recommend the product and the team to any business looking for a secure a scalable ID check solution. Passports National identity cards Biometric residence permits Can VeriFast detect fake documents? Among the different types of document forgery, Verifast can detect data manipulation forgery. That is if a user manipulates the MRZ data on the document Verifast detects and flags it. Can I integrate VeriFast in my mobile application? Currently, we do not offer mobile SDKs to integrate VeriFast in mobile applications. VeriFast is only avaialble on Android. If you are interested about integrating VeriFast into your mobile application, please email us at contact@eyn.vision. Is VeriFast a fully automated system? Yes, VeriFast is a 100% software solution with an automated response. We do not rely on any human intervention for checking documents. What documents do you support? We support all ICAO specific documents such as passports, ID cards, visas and biometric residence permits. Case studies Blog Press Verify ID documents in real time with border grade security Contrary to traditional image-based document verification techniques, Verifast verifies ID document's authenticity cryptographically by reading and validating the embedded chip. It's the fastest and most secure way of verifying identity documents that exist. Hyper accurate data extraction. Compared to OCR-only methods, which are error prone, VeriFast extracts data from the embedded document chip digitally. Such technique ensures the integrity and validity of the extracted data. Tamper proof. To guarantee the most accurate and secure way to verify the authenticity of an identity document, VeriFast performs a cryptographic document check on the embedded chip of the ID. Through this process we can guarantee data integrity and detect potential illegitimate manipulations. Fast. No need to wait for a manual document check. Users verify their ID documents within minutes. Frictionless. Verifying an identity document with VeriFast is as easy as contactless payment. Verify ID documents in real time with border grade security Contrary to traditional image-based document verification techniques, Verifast verifies ID document's authenticity cryptographically by reading and validating the embedded chip. It's the fastest and most secure way of verifying identity documents that exist. Compared to OCR-only methods, which are error prone, VeriFast extracts data from the embedded document chip digitally. Such technique ensures the integrity and validity of the extracted data. To guarantee the most accurate and secure way to verify the authenticity of an identity document, VeriFast performs a cryptographic document check on the embedded chip of the ID. Through this process we can guarantee data integrity and detect potential illegitimate manipulations. No need to wait for a manual document check. Users verify their ID documents within minutes. Verifying an identity document with VeriFast is as easy as contactless payment. Completed within a couple of clicks Only four simple steps to complete a user's identity verification Your browser does not support the video tag. Select the type of document to scan. Place the document in front of the camera for an automatic capture. Place the phone on top of the ID to scan the embedded chip using NFC. Take a photo of the user. Completed within a couple of clicks Only four simple steps to complete a user's identity verification Select the type of document to scan. Place the document in front of the camera for an automatic capture. Place the phone on top of the ID to scan the embedded chip using NFC. Take a photo of the user. View reports on EYN's dashboard and access via API Dashboard See all records of your identity checks in a single web based dashboard. API integration Access all report results such as document checks, face match, captured images and other extracted data via our API. See API documentation > View reports on EYN's dashboard and access via API Dashboard See all records of your identity checks in a single web based dashboard. API integration Access all report results such as document checks, face match, captured images and other extracted data via our API. Document OCR. Form an ID document image, Verifast automatically extracts information like name, date of birth and expiry date. Chip ID check. VeriFast performs a cryptographic document check on the embedded chip of the ID using NFC. Face match. To prove a users' identity claims, a face matching between the identity document and a selfie is performed. Face liveness. Coming soon. Passive face liveness detection with ultrasounds. Go to LiveProof page for more information. Form an ID document image, Verifast automatically extracts information like name, date of birth and expiry date. VeriFast performs a cryptographic document check on the embedded chip of the ID using NFC. To prove a users' identity claims, a face matching between the identity document and a selfie is performed. Coming soon. Passive face liveness detection with ultrasounds. Go to LiveProof page for more information. Why our customers love VeriFast? Here are some numbers: 150k+ checks VeriFast is powered by the latest cloud and mobile technology and scales on-demand without any availability issues. 3 minutes to complete the whole flow Performing an identity check with Verifast is as easy as taking a picture and a contactless payment tap --- the whole process takes on average 3 minutes minute. 60% automation VeriFast can verify a chipped document's authenticity in real-time with no need for manual intervention. The majority of VeriFast's document checks are fully automated. 99.9% true positive Chipped documents are tough to forge and require powerful resources such as access to document printing machines. Such a robust technology makes verifying a document's authenticity almost foolproof. You can be reassured that receiving a true positive result from VeriFast is nearly 100% correct. Why our customers love VeriFast? Here are some numbers: VeriFast is powered by the latest cloud and mobile technology and scales on-demand without any availability issues. Performing an identity check with Verifast is as easy as taking a picture and a contactless payment tap --- the whole process takes on average 3 minutes minute. VeriFast can verify a chipped document's authenticity in real-time with no need for manual intervention. The majority of VeriFast's document checks are fully automated. Chipped documents are tough to forge and require powerful resources such as access to document printing machines. Such a robust technology makes verifying a document's authenticity almost foolproof. You can be reassured that receiving a true positive result from VeriFast is nearly 100% correct. How is VeriFast ID check different? Tamper proof. VeriFast only validates an identity document as genuine when the data inside the embedded chip of the identity document has been cryptographically validated. Such method provides a digital, tamper-proof that the holder was in procession of the genuine physical ID document during the verification process. Compared to visual, image-based approaches, chip document check has 99.99% true positive accuracy. Speed. Most users are genuine users and they will get checked within seconds with VeriFast. Thanks to its chip reading technology, VeriFast provides you with true positive document checks within seconds. No need to wait for human visual inspection, upload multiple documents or manual input. How is VeriFast ID check different? VeriFast only validates an identity document as genuine when the data inside the embedded chip of the identity document has been cryptographically validated. Such method provides a digital, tamper-proof that the holder was in procession of the genuine physical ID document during the verification process. Compared to visual, image-based approaches, chip document check has 99.99% true positive accuracy. Most users are genuine users and they will get checked within seconds with VeriFast. Thanks to its chip reading technology, VeriFast provides you with true positive document checks within seconds. No need to wait for human visual inspection, upload multiple documents or manual input. We engaged with EYN during our search for a digital ID check solution to improve the efficiency of our Right To Work and onboarding processes. We check between 2,000 and 4,000 new workers Right to Work every week, both the accuracy and security of EYN's document verification powered by chip reading technology was a crucial factor for our consideration. We must ensure compliance of our ethical standards while also satisfying Government and GLAA regulation during the placement of up to 60,000 workers each day. At Staffline, we have a rigorous compliance policy and the EYN ID check service successfully manages this task at scale through innovative and advanced technology. The process provides us accurate results within seconds!Facial recognition was also very important for us as it proves that our workers are who they say they are. Overall, it was a pleasure working with the EYN team, from due diligence and commercial agreements to our 400+ site rollout. I would recommend the product and the team to any business looking for a secure a scalable ID check solution. We engaged with EYN during our search for a digital ID check solution to improve the efficiency of our Right To Work and onboarding processes. We check between 2,000 and 4,000 new workers Right to Work every week, both the accuracy and security of EYN's document verification powered by chip reading technology was a crucial factor for our consideration. We must ensure compliance of our ethical standards while also satisfying Government and GLAA regulation during the placement of up to 60,000 workers each day. At Staffline, we have a rigorous compliance policy and the EYN ID check service successfully manages this task at scale through innovative and advanced technology. The process provides us accurate results within seconds!Facial recognition was also very important for us as it proves that our workers are who they say they are. Overall, it was a pleasure working with the EYN team, from due diligence and commercial agreements to our 400+ site rollout. I would recommend the product and the team to any business looking for a secure a scalable ID check solution. Passports National identity cards Biometric residence permits Can VeriFast detect fake documents? Among the different types of document forgery, Verifast can detect data manipulation forgery. That is if a user manipulates the MRZ data on the document Verifast detects and flags it. Can I integrate VeriFast in my mobile application? Currently, we do not offer mobile SDKs to integrate VeriFast in mobile applications. VeriFast is only avaialble on Android. If you are interested about integrating VeriFast into your mobile application, please email us at contact@eyn.vision. Is VeriFast a fully automated system? Yes, VeriFast is a 100% software solution with an automated response. We do not rely on any human intervention for checking documents. What documents do you support? We support all ICAO specific documents such as passports, ID cards, visas and biometric residence permits. Among the different types of document forgery, Verifast can detect data manipulation forgery. That is if a user manipulates the MRZ data on the document Verifast detects and flags it. Currently, we do not offer mobile SDKs to integrate VeriFast in mobile applications. VeriFast is only avaialble on Android. If you are interested about integrating VeriFast into your mobile application, please email us at contact@eyn.vision. Yes, VeriFast is a 100% software solution with an automated response. We do not rely on any human intervention for checking documents. We support all ICAO specific documents such as passports, ID cards, visas and biometric residence permits. Case studies Blog Press"
  ]
}