{
  "company": "www.inttelix.com",
  "dominant_topics": [
    1,
    2,
    0,
    -1,
    6
  ],
  "topic_counts": {
    "1": 11,
    "2": 6,
    "0": 4,
    "-1": 3,
    "6": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.3333333333333333,
    "framing_market": 0.3333333333333333,
    "num_docs": 25
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 4,
      "1": 11,
      "2": 6,
      "6": 1
    }
  },
  "sample_docs": [
    "Inttelix Software Technologies Pvt. Ltd. , a leader in Facial Biometric Security solutions, specializes in biometric engineering. Through relentless efforts in R&D and responding dynamically to the demands of biometric security market, Inttelix developed innovative solutions to a few legacy security problems and has becoming the leader in biometric application / technology markets. Inttelix , now, offers you a wide range of facial biometric security products based on advanced biometric solutions . . MORE >> Blackbox is a unique embedded device , based on Intel® ATOM processor allowing it to run Fast and Easy multimedia interface... MORE >> Facial recognition is the least intrusive and fastest biometric technology. It works as Authentication solution, Access Control... MORE >> Intel Developer Forum 2008 : Digital Enterprise Keynote Inttelix Shows FRS AccessII for new Intel® Atom Processor Inttelix Develops a new Intel® Atom based Automation Control Device: BlackBox Inttelix releases Access Control System for Axis & Vivotek Cameras Seminar on Facial Biometric Security at CSI Exhibition 2008 September 24, Coimbatore Intellix at IDF 2008 2008 Aug 18 - 24, San Francisco Intel Developer Forum 2008 : Image Gallery Intel Developer Forum 2008 : Digital Enterprise Keynote Inttelix Shows FRS AccessII for new Intel® Atom Processor Inttelix Develops a new Intel® Atom based Automation Control Device: BlackBox Inttelix releases Access Control System for Axis & Vivotek Cameras Seminar on Facial Biometric Security at CSI Exhibition 2008 September 24, Coimbatore Intellix at IDF 2008 2008 Aug 18 - 24, San Francisco Intel Developer Forum 2008 : Image Gallery Intel ® Atom Processor How Facial Recognition Works",
    "Face Recognition based Contract Labour Management System Face Recognition based Suspect Detection System Face Recognition based Volunteer Management System Face Recognition System for T&A and Access Control Face Recognitions based PC Login Face Scanner for T & A and Access Control IP Camera based Surveillance System with Stranger Identification",
    "VIDEO ANALYTICS SYSTEM TO MONITOR/ALERT SUSPICIOUS EVENTS The solution gives real-time analysis of the video stream. Identify and generate alerts for a variety of user-defined events relating to people, vehicles and objects. Key features Comprehensive Video Analytics Solutions - real-time & post-even Unique Software Architecture - single server to support 100+ cameras Proven Quality - over 8 years in the market Open Architecture - easy to integrate with other VMS Analytics Support for a Variety of Camera Types Search for specific events or targets Operational efficiency and business intelligence analysis Motion Path Analysis Video Analysis for rapid response Security & Perimeter protection Safety & City surveillance Traffic monitoring Section 2 Key features list integrate with other VMS Analytics Support for a Variety of Camera Types Search for specific events or targets Operational efficiency and business intelligence analysis Motion Path Analysis Video Analysis for rapid response Security & Perimeter protection Safety & City surveillance Traffic monitoring Comprehensive Video Analytics Solutions - real-time & post-even Unique Software Architecture - single server to support 100+ cameras Proven Quality - over 8 years in the market Open Architecture - easy to integrate with other VMS Analytics Support for a Variety of Camera Types Search for specific events or targets Operational efficiency and business intelligence analysis Video Analysis for rapid response Security & Perimeter protection Safety & City surveillance list integrate with other VMS Analytics Support for a Variety of Camera Types Search for specific events or targets Operational efficiency and business intelligence analysis Video Analysis for rapid response Security & Perimeter protection Safety & City surveillance",
    "VIDEO MANAGEMENT SYSTEM WITH VIDEO ANALYTICS (Head-Count) In large public gathering or organisations having a large labour force a need arises to have a count of the flow of people in the area. Head Count System is a camera based solution for Shopping Malls, Public places, Mega Events etc. This can also be used for Enterprises and factories to get the total head-count dynamically. The best feature in the solution is that along with counting of the people, the system also stores images with date/time stamp in the database. These stored images can be used for organisations for forensic analysis or any other future requirements that may arise. Some Of The Unique Features Of The Products Are - A low cost solution for logging people passing through doors, gates, passages, entrances using multi face detection technology Access any IP Camera Detect faces found in the cam stream at fixed intervals Store to the database the faces found and provide the report in pdf format Shows live face counts Quick filter report based on time period Very useful for Shopping malls, Auditoriums, Cinema Stalls, etc. Some Of The Unique Features Of The Products Are - A low cost solution for logging people passing through doors, gates, passages, entrances using multi face detection technology Access any IP Camera Detect faces found in the cam stream at fixed intervals Store to the database the faces found and provide the report in pdf format Shows live face counts Quick filter report based on time period Very useful for Shopping malls, Auditoriums, Cinema Stalls, etc.",
    "FACE RECOGNITION BASED PC LOGIN & FOLDER LOCKS (LOGON) A PC has become an integral part of our lives. Most of the people store confidential personal or business information in computers. However, with the trend of increasing number of identity thefts, conventional way of using ID and password to protect access to computer involves lot of risks. Logon provides a simple but effective option. The integration of Logon and PC camera provides access only when a live-fed face image of authorized user is detected, thus effectively preventing unauthorized access. Logon is a non-invasive technology that does not require physical contact. Hands-Free Login This is a revolutionary technology that facilitates secure and biometric login to a Microsoft Windows environment. The software runs an automatic scan and then detects and matches the physical presence of the user, thereby eliminating the need for user name and password. The process does not store any image of the user but uses only algorithm based calculation results. In case the user is absent, the system locks the computer access until the Logon scan and identifies the user through the physical data stored in the system."
  ]
}