{
  "company": "www.digit9tech.com",
  "dominant_topics": [
    -1,
    3
  ],
  "topic_counts": {
    "-1": 9,
    "3": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.1956521739130435,
    "framing_surveillance": 0.2391304347826087,
    "framing_market": 0.5652173913043478,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 9,
      "3": 1
    }
  },
  "sample_docs": [
    "Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Multi-modal Biometric Devices View Detail Facial Recognition Solution View Detail IDentity Proofing Engine View Detail Custodial Management Solution View Detail Security Frameworks View Detail Biometrics powered SSO View Detail Checkout our services Let's go Connect with us Let's go Loss Prevention in Retail Black-list / VIP Identification Follow us on social media",
    "Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification DIGIT9 TECH LABS V4 RANGE With the COVID-19 virus spreading easily through touchpoints, fingerprint scanners, card readers, and different devices used for accurate identity authentication can quickly become a source for infections, specifically in public spaces. Our Solution can be used in such cases for contactless detection. Due to the Re-opening of numerous retail industries, the biometric access control devices are playing a significant role for the safety and security of the people. Our contactless biometric access control device is designed for consumers who don't want to interact with shared contact-based authentication devices. The access points with biometric contact used in public transport can be replaced by D9-V4X for contactless forehead temperature scan and mask detection. Looking into the concept of contactless guest access and authentication, When a guest arrives into a hotel, if facial recognition technology is in place, he or she can self-check-in, activate elevators, and unlock rooms through a biometric face scan. Our solutions can provide a new contact-less experience at the time of temperature scanning, mask detection, and authentication before check-in. As offices start to re-open, Contact-based Biometric systems could pose a big threat to safety from coronavirus. Our contactless biometric scanner and identifier can be integrated into the existing Access Control Systems. Checkout our services Let's go Connect with us Let's go Loss Prevention in Retail Black-list / VIP Identification Follow us on social media",
    "Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Physical & Logical Access Solutions SSO - Single Sign On Multi-modal Biometric Devices Read More Facial Recognition Solution Read More IDentity Proofing Engine Read More Custodial Management Solution Read More Security Frameworks Read More Biometrics powered SSO Read More iVaxrify COVID-19 Vaccine Certification Verification App iVaxrify COVID-19 Vaccine Certification Verification App COVID-19 TRACK & TRACE SOLUTION Most modern custodial operations demand higher level of facilities management to achieve the desired security without compromising the human rights of the inmates. Loss Prevention in Retail Inventory losses are a big deal in the retail industry. Whether it's caused by shoplifting, employee theft, or another reason, inventory shrinkage represents a $100 billion... Black-list / VIP Identification Public safety is always a vital concern for governments, but the responsibility of ensuring personal and property safety doesn't only fall to them. Smart-I is an interesting product designed to safeguard your personal/work information from privy eyes. It has been observed that over 70% work PCs are susceptible Citizen / National ID Citizen / National ID Immigration / Border Management Immigration / Border Management Loss Prevention in Retail Black-list / VIP Identification Follow us on social media",
    "Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Most modern custodial operations demand higher level of facilities management to achieve the desired security without compromising the human rights of the inmates. Sentinel – is a comprehensive Biometric software solution which enables custodial facilities to achieve significant operational efficiencies and savings whilst contributing towards effective rehabilitation. The core of Sentinel is powered by HID biometrics for IDentification and Authentication. This platform provides enhanced visibility and security by integrating with all the existing security infrastructure and placing 'verifiable identity' at the centre of the operation. ASSETS & RESOURCES MANAGEMENT SENTINEL integrates all the procedural steps in a typical facility - for e.g., Biometrics identifies the inmates/visitors/staff – which is integrated with the Prisoner Management, Building Management System, Time Management, HR, Payroll, etc. This eliminates the need to maintain multiple records as the current procedures are largely manual or semi-automated. Sentinel provides a single window IDentification and life history of the prisoners, visitors and the correction facility staff. SENTINEL Visitor Management modules and secured Access Control enables visitor checks and on-boarding in just a few seconds. IAM module ensures strict compliances are followed even in the online registration process. This eliminates the need to maintain clerical engagements, paper work, dedicated personnel and above all, the security risk of manual intervention Sentinel provides a single window Visitor IDentification, Authorization, Privileges, Restrictions, Geo-Fencing, etc with a detailed movement trail of the visitor within the facility Assets & Resources Management Manual day-to-day management means engaging a large back-office administration workforce to handle multiple systems – payroll, rostering, asset checks, etc. SENTINEL integrates all these backoffice functions using existing modules and easy to integrate third-party plugins. Sentinel framework makes it easy to for the customers to customize the process-flow based on existing workflow. Staff engagement with the Sentinel is UI driven and easy to adopt with minimal training. Self serving Kiosks can be deployed for 24x7 unmanned operations by Visitors, Contractors, Vendors, etc. SENTINEL integrates operational procedures such as inmate transfer, inmate identification, inmate records, resources and assets transfer between facilities, etc. in easy to maintain single platform. Sentinel APIs offer seamless integration with the existing administration systems or any other third-party solutions in the network. This eliminates the need to maintain multiple records as the current procedures are usually manual and subject to duplication and human error. SENTINEL framework allows multiple Correction Centers to function in sync thus reducing the cost of maintaining multiple systems and staff. Visitor Management Enrol, identify, audit and manage movement control policies for all visitors, individuals, groups, and watchlist restrictions, across multiple facilities Enrol, identify, audit and manage movement control policies for all visitors, individuals, groups, and watchlist restrictions, across multiple facilities Access Control Manage physical access rights, groups, privileges, zones, times, pathways and movements between zones by group or individual, zone and device Manage physical access rights, groups, privileges, zones, times, pathways and movements between zones by group or individual, zone and device Tagged Asset Management Self-service biometric kiosk managing issue, use, tracking and return of tagged assets with RFID or QR code Self-service biometric kiosk managing issue, use, tracking and return of tagged assets with RFID or QR code Time and Attendance Integrates with payroll and HR systems to accurately manage time and attendance, licensing and certification Integrates with payroll and HR systems to accurately manage time and attendance, licensing and certification Keysafe Management Self-service biometric kiosk governing access to electronic key safes, policies for key bunches, key safes and people with real time location and status tracking Self-service biometric kiosk governing access to electronic key safes, policies for key bunches, key safes and people with real time location and status tracking Prisoner Muster and Movement Prisoner movement and tracking. Segregation and control, location reporting, alerts and status Prisoner Muster and Movement Prisoner movement and tracking. Segregation and control, location reporting, alerts and status Secure Credentials Design and produce secure identification credentials for differing groups such as visitors, contractors, and others Design and produce secure identification credentials for differing groups such as visitors, contractors, and others Drugs Dispensing Automated Opioid Substitution Drugs and other Scheduled Poisons Dispensing Automated Opioid Substitution Drugs and other Scheduled Poisons Dispensing Web Self Service Booking Self-service kiosk managing contractor on-boarding and visitor session bookings, with a high-level interface to the OIMS Web Self Service Booking Self-service kiosk managing contractor on-boarding and visitor session bookings, with a high-level interface to the OIMS Workforce Communication Personalised or group communications with user acknowledgement. For example WHS, General notice, etc. Personalised or group communications with user acknowledgement. For example WHS, General notice, etc. Bail and Parole Reporting Automated self-service Bail and Parole reporting kiosk with interface to the existing backend systems Bail and Parole Reporting Automated self-service Bail and Parole reporting kiosk with interface to the existing backend systems Professional Services System development, integration, ongoing platform support and specialist hardware engineering services System development, integration, ongoing platform support and specialist hardware engineering services Digit9 IAM family of multi-modal biometric terminals and kiosks combine with SENTINEL to offer customized UI using the workflow design tool. All user interface screens are easy to use, icon-driven, making it simple to operate even in multi-lingual staff environment. Checkout our services Let's go Connect with us Let's go Loss Prevention in Retail Black-list / VIP Identification Follow us on social media",
    "Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification Case studies Custodial Management Loss Prevention in Retail Black-list / VIP Identification Visual Hacking Solution Loss Prevention in Retail Black-list / VIP Identification ID Verify is a must-have tool for every organization that looks at secured yet easy customer onboarding. With ID Verify it is a simple 4 - step process. AI-driven ID Verify is one of the best Biometric Identity Verification tool helping organizations build Trust. ID Verify has built in intelligence to read ID documents such as driving licenses, passports, national ID cards, utility bills, etc. and purge out forged documents, photoshopped images, altered fonts, etc with 99,9% accuracy. Facial Authentication AI powered face recognition detects liveness, depth perception, microexpressions, skin reflection AI powered face recognition detects liveness, depth perception, microexpressions, skin reflection AI based IDVerify Engine Detects document genuiness by checking the rainbow print, detecting folded edges, microprints, holograms, MRZ codes, etc using fuzzy logic AI based IDVerify Engine Detects document genuiness by checking the rainbow print, detecting folded edges, microprints, holograms, MRZ codes, etc using fuzzy logic Realtime Verification Online verification engine ensures almost instant IDentity verification in 4-easy steps Online verification engine ensures almost instant IDentity verification in 4-easy steps Easy Integration Built-in Machine Learning ensures that the ID Verify is ready-to-deploy on any platform within short time Built-in Machine Learning ensures that the ID Verify is ready-to-deploy on any platform within short time Forged Document Detection Anti-spoofing algorithms coupled with Machine Learning capabilities ensure 99.99% accuracy in detecting forgery Anti-spoofing algorithms coupled with Machine Learning capabilities ensure 99.99% accuracy in detecting forgery Secured Platform ID Verify is a complete IDentity Verification solution offered as a secured Service to BFSI, Telcos, Retail, Travel, Utility service providers, Government and Large Organizations ID Verify is a complete IDentity Verification solution offered as a secured Service to BFSI, Telcos, Retail, Travel, Utility service providers, Government and Large Organizations Leveraging Opportunities with Online ID Verification Face Verification The user takes a selfie during the verification process. This image undergoes multiple image processing stages in the background to ensure that live image is taken. ID Verify biometric image processing is done by AI (Artificial Intelligence) and self learning techniques. ID Verify Biometric Face Analysis consists of 70+ checks performed including comparison of face against the image present on user's ID card, passport or driving license to ensure valid identity. The user takes a selfie during the verification process. This image undergoes multiple image processing stages in the background to ensure that live image is taken. ID Verify biometric image processing is done by AI (Artificial Intelligence) and self learning techniques. ID Verify Biometric Face Analysis consists of 70+ checks performed including comparison of face against the image present on user's ID card, passport or driving license to ensure valid identity. Document Verification The image taken is then compared with the one on the user's document - passport, driving license and national ID card. Once the face matching is done, the document itself is verified for genuineness by running a 40-point document scanning process including: Accuracy of the format Authenticity of the MRZ Detect any tempering Check for Image manipulation Verify Hologram Detect blurriness and exposure The image taken is then compared with the one on the user's document - passport, driving license and national ID card. Once the face matching is done, the document itself is verified for genuineness by running a 40-point document scanning process including: Accuracy of the format Authenticity of the MRZ Check for Image manipulation Detect blurriness and exposure Geolocation Verification This is a key component of digital ID verification - confirming the location of the user to eliminate any fraud. ID Verify also detects any use of VPN or proxy by the user. The geolocation parameters captured are Latitude & Longitude Detect IP and device Type Collect timestamps Detect ISP, Country Code Operating System Detect IP location This is a key component of digital ID verification - confirming the location of the user to eliminate any fraud. ID Verify also detects any use of VPN or proxy by the user. The geolocation parameters captured are Detect IP and device Type Detect ISP, Country Code Optional Modules Address Verification Consent Verification AML Screening Checkout our services Let's go Connect with us Let's go Loss Prevention in Retail Black-list / VIP Identification Follow us on social media"
  ]
}