{
  "company": "www.hubino.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 11,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.25,
    "framing_surveillance": 0.5,
    "framing_market": 0.25,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 11,
      "0": 3
    }
  },
  "sample_docs": [
    "» Project Management Tool As mobile phones are increasingly used for internet browsing and for making net based transactions, web based applications require a revamp to be accessed through mobile phones. Even a slight delay in providing this capability will spell big trouble and a huge loss to the brand value of a company. Mobile Converter provides this capability within a very short time. It gives a mobile front end to let your customers access your web page through their mobile phones. This vehicle fleet management program will enable you to record, manage and consult all information concerning your vehicle fleet quickly and efficiently. It is designed not just for large transport firms, but service companies and businesses, too. Whether you have a fleet of 3 or 1000 vehicles to look after, we have the solution to meet your expectations. Stop wasting your time looking for repair bills, license plates, insurance data, serial numbers or other vehicle information. Store it all together in the same place! View the real operating costs of your vehicle fleet with a simple mouse click thanks to the versatile, detailed and printable reports provided. Small and Medium Enterprise Application (SMEA) aims at enabling sustained profitable growth for SMEs with an innovative service model - SaaS (Software as a Service). SaaS will leverage Hubino's leadership in technology and service innovations to offer integrated end-to-end managed solutions to small and medium businesses. With SaaS, Hubino aims to address the end-to-end IT needs of SMEs and help streamline the business processes for market advantage; provide customers with blueprints for business process improvement; deliver integrated end-to-end managed solutions in IT and telecom and offer flexible pricing options to reduce capital expenditure and minimize operating expenditure and maximize return on investment while achieving economies of scale. A subscription-driven \"build-as-you-grow\", \"pay-as-you-use\" model through centralized hosting from a common platform would facilitate alignment of technology adoption to the needs of the business and bring scalability to the business model. Each organization has a unique set of processes in managing its projects but to be highly competitive and to exceed customer expectations one should follow the best practices in project management. PMTool has been developed keeping the best practices of project management that fit the small and medium scale enterprises. When collaborative development is the mantra in the new age product development methodology, what happens if an idea, though brilliant, goes without being noticed? Now imagine a product that does not allow even a simple idea to slip through without being discussed and analyzed. Our collaborative knowledge management tool – HubinKnowl brings to life the very essential elements required for greater participation and co-ordination among employees, where every suggestion counts. Hubino -2010",
    "Feel Free to quotes us About Our Hubino At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services Our address 20034, Europe, Some Street, 4551/33 +5 566-44-34-223 +5 665-15-34-667 somaemail@gmail.com Whats New @ Hubino Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services 20034, Europe, Some Street, 4551/33 Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 Natural Language Processing Natural language processing (NLP) is a field of computer science, artificial intelligence, and computational linguistics concerned with the interactions between computers and human (natural) languages. As such, NLP is related to the area of human–computer interaction. Many challenges in NLP involve natural language understanding, that is, enabling computers to derive meaning from human or natural language input, and others involve natural language generation. Automatic summarization Coreference resolution Discourse analysis Machine translation Discourse analysis Morphological segmentation Named entity recognition (NER) What we can do for you - Natural Language Processing : Modern NLP algorithms are based on machine learning, especially statistical machine learning. The paradigm of machine learning is different from that of most prior attempts at language processing. Prior implementations of language-processing tasks typically involved the direct hand coding of large sets of rules. Natural language generation Natural language understanding Part-of-speech tagging Question answering Relationship extraction Speech recognition Some of Our Results 55 % Increase in Accurancy 60 % Increase in Performance Speed 20 % Average visit & Downloads Natural language processing (NLP) is a field of computer science, artificial intelligence, and computational linguistics concerned with the interactions between computers and human (natural) languages. As such, NLP is related to the area of human–computer interaction. Many challenges in NLP involve natural language understanding, that is, enabling computers to derive meaning from human or natural language input, and others involve natural language generation. Named entity recognition (NER) What we can do for you - Natural Language Processing : Modern NLP algorithms are based on machine learning, especially statistical machine learning. The paradigm of machine learning is different from that of most prior attempts at language processing. Prior implementations of language-processing tasks typically involved the direct hand coding of large sets of rules. Some of Our Results Optical Character Recognition ( OCR ) Optical Character Recognition ( OCR ) Banking & Financial Services Banking & Financial Services . Legal / Privacy / Case Studies . Legal / Privacy / Case Studies Legal / Privacy / Case Studies",
    "Feel Free to quotes us About Our Hubino At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services Our address 20034, Europe, Some Street, 4551/33 +5 566-44-34-223 +5 665-15-34-667 somaemail@gmail.com Whats New @ Hubino Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services 20034, Europe, Some Street, 4551/33 Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 Medical Imaging Medical imaging is the technique and process of creating visual representations of the interior of a body for clinical analysis and medical intervention. Medical imaging seeks to reveal internal structures hidden by the skin and bones, as well as to diagnose and treat disease. Image Gently and Image Wisely Campaigns Maximizing imaging procedure use Medical Imaging in the Cloud What we can do for you - Medical Imaging : Medical imaging also establishes a database of normal anatomy and physiology to make it possible to identify abnormalities. Although imaging of removed organs and tissues can be performed for medical reasons, such procedures are usually considered part of pathology instead of medical imaging. Magnetic resonance imaging Endoscopy Tactile imaging Medical photography Nuclear medicine functional imaging Elastography Some of Our Results 83 % Increase in Accurancy 89 % Increase in Performance Speed 81 % Average visit & Downloads Medical imaging is the technique and process of creating visual representations of the interior of a body for clinical analysis and medical intervention. Medical imaging seeks to reveal internal structures hidden by the skin and bones, as well as to diagnose and treat disease. Image Gently and Image Wisely Campaigns Maximizing imaging procedure use Medical Imaging in the Cloud What we can do for you - Medical Imaging : Medical imaging also establishes a database of normal anatomy and physiology to make it possible to identify abnormalities. Although imaging of removed organs and tissues can be performed for medical reasons, such procedures are usually considered part of pathology instead of medical imaging. Nuclear medicine functional imaging Some of Our Results Optical Character Recognition ( OCR ) Optical Character Recognition ( OCR ) Banking & Financial Services Banking & Financial Services . Legal / Privacy / Case Studies . Legal / Privacy / Case Studies Legal / Privacy / Case Studies",
    "Hubino for the internet. Hubino is sensitive to privacy issues on the Internet. We believe it is important you know how we treat the information about you, we receive from you, on the Internet. In general, you can visit Hubino on the World Wide Web without telling us who you are or revealing any information about yourself. Our Web servers collect the domain names, not the e-mail addresses, of visitors. This information is aggregated to measure the number of visits, average time spent on the site, pages viewed, etc. Hubino uses this information to measure the use of our site and to improve the content of our site. Your accessing our site signifies your unconditional consent to allow the collection of your domain names. There are times, however, when we may need information from you, such as your name and address. When information is needed, we will try (but are not obligated) to let you know at the time of collection, how we will use the personal information. Usually, the personal information we collect is used only by us to respond to your inquiry, process an order or allow you to access specific account information. Occasionally, we may make the e-mail addresses, of those who provide information, available to other reputable organizations whose products or services we think you may find interesting. In these cases, you will be offered an opportunity to limit access to your information. In case we do not receive any response from you to limit the access of your information, it shall be deemed that you consent to such distribution of your information as mentioned above. If you register with one of Hubino's business units on-line, they may use this information to provide you with custom information about Hubino's offering in support of your business needs. A technology called cookies may be used to provide you with tailored information. A cookie is a tiny element of data that a web site can send to your browser, which may then be stored on your hard drive so we can recognize you when you return. You may set your browser to notify you when you receive a cookie. Registering with any Hubino business unit online signifies your unconditional consent to receive such cookies. At times we conduct on-line surveys to better understand the needs and profile of our visitors. When we conduct a survey, we will try (but are not obligated) to let you know how we will use the information at the time we collect information from you on the Internet. You recognize and understand that there is no compulsion on you to provide us with your personal information and any and all personal information provided by you to us is with your full consent, own volition and desire to provide such personal information. You also understand that we are under no obligation to verify the source from which the personal information about you is provided to us, and they are deemed to be provided by you, unless you demonstrate to us within a period of fifteen days from the date of providing of such information to us, to our satisfaction, that the information was provided to us without your free consent. Hubino's Web site may contain links to other sites such as Hubino partners, clients and affiliates. While we try to link only to sites that share our high standards and respect for privacy, we are not responsible for the content or the privacy practices employed by other sites. This site has security measures in place to protect the loss, misuse, and/or alteration of information under our control. The data resides behind a firewall, with access restricted to authorized Hubino personnel. If you have any questions about this privacy statement, the practices of this site, or your dealings with this Web site, you can contact Hubino Hubino",
    "Feel Free to quotes us About Our Hubino At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services Our address 20034, Europe, Some Street, 4551/33 +5 566-44-34-223 +5 665-15-34-667 somaemail@gmail.com Whats New @ Hubino Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 At Hubino, we integrate core and agile processes to provide higher quality, greater flexibility, and higher efficiency to our customers. We value each and every one of our customers and our goal is always to provide lower costs while providing individual services 20034, Europe, Some Street, 4551/33 Ramp App launched in App store 15 July 2014 Updated our wepa in launched in App store 9 July 2014 WHY US? Hubino gives teams the ability to turn knowledge into solving complex problems around world. Software engineers will get a chance to work on next generation business solutions such as augmented reality, artificial intelligence, computer vision & image processing solutions and mobility. We work with bleeding edge technologies to server our customers and creating new next-gen products to make the peoples life easier. We have an amazing group of experts in augmented reality, artificial intelligence, computer vision & image processing solutions and mobility platforms. Come work with a passionate team in putting a dent into the universe. Unique opportunity to make your mark on a world changing products. We offer Competitive salaries. Medical Insurance. Catered team lunches. Budget for learning , training. Pick your own setup (monitors, computers,etc). Work in an engineering driven products where every member has a huge impact on the code. Hubino gives teams the ability to turn knowledge into solving complex problems around world. Software engineers will get a chance to work on next generation business solutions such as augmented reality, artificial intelligence, computer vision & image processing solutions and mobility. We work with bleeding edge technologies to server our customers and creating new next-gen products to make the peoples life easier. We have an amazing group of experts in augmented reality, artificial intelligence, computer vision & image processing solutions and mobility platforms. Come work with a passionate team in putting a dent into the universe. Unique opportunity to make your mark on a world changing products. Image Processing / Computer Vision Engineer iOS / Mac OSX Developer Android Developer Business Development QA Engineer Freshers Internship Job Summary A PhD degree or Computer Science in image processing or machine vision is required. Preference is given to candidates with a strong background in state-of-the-art image processing and vision methiods, machine learning, feature selection, and applied mathematics. Furthermore, familiarity with standard scientific programming languages (Matlab, C++) is required. The successful candidate will receive a competitive salary according to the standards of Hubino as well as the opportunity to work in a stimulating international environment with excellent working conditions. Job Summary Since the birth of Hubino, our iOS team has delivered some peculiar apps involving technologies which are on a rise. If it is new technologies and challenging scenarios you want to be associated with our iOS team is the best place for you to get in touch with. Responsibilities Develop client projects and create new applications for own brand. Understand client project requirement, collaborate with team players and deliver on-time with quality. Stay updated with new approaches on development, technologies, tools and industry trends. Learn new technologies and try and come up with innovative apps for own brand. What we look out for Strong knowledge in Objective C, Xcode, CoCoa. Strong knowledge in iOS4.0 + SDK Development (Web Services & API's, LBS, Social Network Integration. Strong knowledge in database (SQLite3, MySQL). Good Knowledge in Google API's. Basic knowledge on developing hybrid applications. Knowledge about latest mobile technology. Good organizational and problem solving skills. Proficient with XML and JSON will be added advantage. Knowledge in publishing application in iTunes. Knowledge in PHP Content Management System like Wordpress, Joomla, Magento. Job Summary An ever-growing team with young brains in majority and a couple of senior experts to guide them. A fun-filled group that learns by doing things and love what they do. Opportunities are wide as we not only take up client projects but churn out own apps as well. Responsibilities Develop and create applications for client projects and in-house requirements. Make use of Android frameworks to create UI faster, take control/understand client projects. Deliver the projects successfully in-time with quality. Stay updated on the latest industry trends, development practices and evolving mobile technologies. What we look out for Handful experience in tools like Android Studio, Eclipse and analytical tools like Find Bugs and PMD. Basic knowledge about Hybrid Application and ideas on publishing applications in Android Market. Knowledge in PHP-driven CMSes & versioning tools like SVN will be added an advantage. Job Summary Business Development is the process of building a long term value for an organization. We are looking for self motivated individuals (freshers and experienced) who are highly energetic, skillful in meeting sales goals, closing skills, self confident and have the interest to drive in more sales. Responsibilities Identify and generate new business opportunities through effective cold calling. Understand the client's requirement and provide an appropriate solution. Build and maintain excellent relationship with clients. Actively and successfully manage the sales process. What we look out for Excellent written and verbal communication skills. Maintain a professional and a positive approach with clients. Self-motivated individuals and good team players. Adaptability to work round the clock amid tight schedules. A graduate with 60% in academics or experience in Business Development (MBA Marketing Preferred). Job Summary Quality assurance marks the culmination of the product development process. We are looking for candidates who have a strong aptitude to learn about the product functionalities and test every minute aspect accurately so as to deliver a bug free product. Responsibilities Creative solving of technical problems to translate technical requirements to test plans. Writing test plans and test cases, document issues and communicating bugs to developing team. Understanding the business process. Performing functional and non-functional testing. Working closely with the product development team and ensuring work completion within the deadline. Developing, documenting and maintaining test cases and other test artifacts. What we look out for Professional with a firm knowledge in testing and quality practices. Ability to think abstract. Knowledge in defect tracking tools. Basic understanding of programming concepts. Job Summary A software engineer is a skilled professional focused on the design and creation of computer applications. Software engineers are also involved in designing and creating applications for other computerized devices such as cell phones, security systems and video games. Responsibilities Understanding and analyzing project requirements and translating it into specifications and deliverables Working closely with analysts, designers and clients to enhance existing applications. Testing and debugging the product in controlled, real situations Performing functional and non-functional testing. Maintaining the systems and updating as per requirements. What we look out for Good programming skills. Good understanding of coding language. Strong understanding of basic concepts and knowledge about advanced concepts. Good communication skills Job Summary A PhD degree or Computer Science in image processing or machine vision is required. Preference is given to candidates with a strong background in state-of-the-art image processing and vision methiods, machine learning, feature selection, and applied mathematics. Furthermore, familiarity with standard scientific programming languages (Matlab, C++) is required. The successful candidate will receive a competitive salary according to the standards of Hubino as well as the opportunity to work in a stimulating international environment with excellent working conditions. Job Summary Since the birth of Hubino, our iOS team has delivered some peculiar apps involving technologies which are on a rise. If it is new technologies and challenging scenarios you want to be associated with our iOS team is the best place for you to get in touch with. Responsibilities Develop client projects and create new applications for own brand. Understand client project requirement, collaborate with team players and deliver on-time with quality. Stay updated with new approaches on development, technologies, tools and industry trends. Learn new technologies and try and come up with innovative apps for own brand. What we look out for Strong knowledge in Objective C, Xcode, CoCoa. Strong knowledge in iOS4.0 + SDK Development (Web Services & API's, LBS, Social Network Integration. Strong knowledge in database (SQLite3, MySQL). Good Knowledge in Google API's. Basic knowledge on developing hybrid applications. Knowledge about latest mobile technology. Good organizational and problem solving skills. Proficient with XML and JSON will be added advantage. Knowledge in publishing application in iTunes. Knowledge in PHP Content Management System like Wordpress, Joomla, Magento. Since the birth of Hubino, our iOS team has delivered some peculiar apps involving technologies which are on a rise. If it is new technologies and challenging scenarios you want to be associated with our iOS team is the best place for you to get in touch with. What we look out for Job Summary An ever-growing team with young brains in majority and a couple of senior experts to guide them. A fun-filled group that learns by doing things and love what they do. Opportunities are wide as we not only take up client projects but churn out own apps as well. Responsibilities Develop and create applications for client projects and in-house requirements. Make use of Android frameworks to create UI faster, take control/understand client projects. Deliver the projects successfully in-time with quality. Stay updated on the latest industry trends, development practices and evolving mobile technologies. What we look out for Handful experience in tools like Android Studio, Eclipse and analytical tools like Find Bugs and PMD. Basic knowledge about Hybrid Application and ideas on publishing applications in Android Market. Knowledge in PHP-driven CMSes & versioning tools like SVN will be added an advantage. An ever-growing team with young brains in majority and a couple of senior experts to guide them. A fun-filled group that learns by doing things and love what they do. Opportunities are wide as we not only take up client projects but churn out own apps as well. What we look out for Job Summary Business Development is the process of building a long term value for an organization. We are looking for self motivated individuals (freshers and experienced) who are highly energetic, skillful in meeting sales goals, closing skills, self confident and have the interest to drive in more sales. Responsibilities Identify and generate new business opportunities through effective cold calling. Understand the client's requirement and provide an appropriate solution. Build and maintain excellent relationship with clients. Actively and successfully manage the sales process. What we look out for Excellent written and verbal communication skills. Maintain a professional and a positive approach with clients. Self-motivated individuals and good team players. Adaptability to work round the clock amid tight schedules. A graduate with 60% in academics or experience in Business Development (MBA Marketing Preferred). Business Development is the process of building a long term value for an organization. We are looking for self motivated individuals (freshers and experienced) who are highly energetic, skillful in meeting sales goals, closing skills, self confident and have the interest to drive in more sales. What we look out for Job Summary Quality assurance marks the culmination of the product development process. We are looking for candidates who have a strong aptitude to learn about the product functionalities and test every minute aspect accurately so as to deliver a bug free product. Responsibilities Creative solving of technical problems to translate technical requirements to test plans. Writing test plans and test cases, document issues and communicating bugs to developing team. Understanding the business process. Performing functional and non-functional testing. Working closely with the product development team and ensuring work completion within the deadline. Developing, documenting and maintaining test cases and other test artifacts. What we look out for Professional with a firm knowledge in testing and quality practices. Ability to think abstract. Knowledge in defect tracking tools. Basic understanding of programming concepts. Quality assurance marks the culmination of the product development process. We are looking for candidates who have a strong aptitude to learn about the product functionalities and test every minute aspect accurately so as to deliver a bug free product. What we look out for Job Summary A software engineer is a skilled professional focused on the design and creation of computer applications. Software engineers are also involved in designing and creating applications for other computerized devices such as cell phones, security systems and video games. Responsibilities Understanding and analyzing project requirements and translating it into specifications and deliverables Working closely with analysts, designers and clients to enhance existing applications. Testing and debugging the product in controlled, real situations Performing functional and non-functional testing. Maintaining the systems and updating as per requirements. What we look out for Good programming skills. Good understanding of coding language. Strong understanding of basic concepts and knowledge about advanced concepts. Good communication skills A software engineer is a skilled professional focused on the design and creation of computer applications. Software engineers are also involved in designing and creating applications for other computerized devices such as cell phones, security systems and video games. What we look out for Optical Character Recognition ( OCR ) Optical Character Recognition ( OCR ) Banking & Financial Services Banking & Financial Services . Legal / Privacy . Legal / Privacy"
  ]
}