{
  "company": "www.vintra.io",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Pricing Flexible Cloud and On-Premises solutions purpose-built to fit your needs FulcrumAI Investigator Three-letter grade analytics, deployed instantly in the cloud. Starting at $1,999 /mo* Unlimited users and cases Effortlessly collect video from the public 500 hours of AI-powered video processing / mo Quarterly updates to Vintra's AI algorithms 5 TB's of storage Email support – 1 business day Roll-over hours – unused hours are good for 1 year** Schedule a Demo FulcrumAI Real Time Integrate with your VMS or use as a stand-alone solution. Let's Talk (per camera/mo*) 150 camera minimum and annual subscription required Standalone or VMS integrated AI-powered, real-time analytics Quarterly updates to Vintra's AI algorithms Maintenance and support included Phone support – same business day Hardware VMS charged separately by certified integrator Schedule a Demo *All pricing in USD, billed annually, and requires a one-year contract. **Subscription must be active to use roll-over hours. Save time and money on video review and monitoring Request a Demo AI-Powered Video Analytics that Work The Very Best in AI Unlike most analytics on the market, Vintra's deep learning algorithms are built with the latest AI and work on video from any camera source. Unlimited Upgrades Quarterly upgrades are included with every subscription. Never ask the IT department to manually perform an upgrade on your solution again. Easy to Use The cloud solution can be up and running in minutes, and the on-premises solution works with your existing camera infrastructure. Excellent Support Dedicated specialists ensure client success through in-depth training and a personalized on-boarding program. Pricing Flexible Cloud and On-Premises solutions purpose-built to fit your needs Flexible Cloud and On-Premises solutions purpose-built to fit your needs FulcrumAI Investigator Three-letter grade analytics, deployed instantly in the cloud. Starting at $1,999 /mo* Unlimited users and cases Effortlessly collect video from the public 500 hours of AI-powered video processing / mo Quarterly updates to Vintra's AI algorithms 5 TB's of storage Email support – 1 business day Roll-over hours – unused hours are good for 1 year** Schedule a Demo FulcrumAI Real Time Integrate with your VMS or use as a stand-alone solution. Let's Talk (per camera/mo*) 150 camera minimum and annual subscription required Standalone or VMS integrated AI-powered, real-time analytics Quarterly updates to Vintra's AI algorithms Maintenance and support included Phone support – same business day Hardware VMS charged separately by certified integrator Schedule a Demo *All pricing in USD, billed annually, and requires a one-year contract. **Subscription must be active to use roll-over hours. Unlimited users and cases Effortlessly collect video from the public 500 hours of AI-powered video processing / mo Quarterly updates to Vintra's AI algorithms 5 TB's of storage Email support – 1 business day Roll-over hours – unused hours are good for 1 year** 150 camera minimum and annual subscription required Standalone or VMS integrated Quarterly updates to Vintra's AI algorithms Maintenance and support included Phone support – same business day Hardware VMS charged separately by certified integrator *All pricing in USD, billed annually, and requires a one-year contract. **Subscription must be active to use roll-over hours. Save time and money on video review and monitoring Request a Demo AI-Powered Video Analytics that Work The Very Best in AI Unlike most analytics on the market, Vintra's deep learning algorithms are built with the latest AI and work on video from any camera source. Unlimited Upgrades Quarterly upgrades are included with every subscription. Never ask the IT department to manually perform an upgrade on your solution again. Easy to Use The cloud solution can be up and running in minutes, and the on-premises solution works with your existing camera infrastructure. Excellent Support Dedicated specialists ensure client success through in-depth training and a personalized on-boarding program. AI-Powered Video Analytics that Work The Very Best in AI Unlike most analytics on the market, Vintra's deep learning algorithms are built with the latest AI and work on video from any camera source. Unlimited Upgrades Quarterly upgrades are included with every subscription. Never ask the IT department to manually perform an upgrade on your solution again. The Very Best in AI Unlike most analytics on the market, Vintra's deep learning algorithms are built with the latest AI and work on video from any camera source. Quarterly upgrades are included with every subscription. Never ask the IT department to manually perform an upgrade on your solution again. Easy to Use The cloud solution can be up and running in minutes, and the on-premises solution works with your existing camera infrastructure. Excellent Support Dedicated specialists ensure client success through in-depth training and a personalized on-boarding program. The cloud solution can be up and running in minutes, and the on-premises solution works with your existing camera infrastructure. Dedicated specialists ensure client success through in-depth training and a personalized on-boarding program.",
    "Fill out the form below to schedule a demo Real-Time Analytics Watchlists and subject search powered by Face Recognition. Tailgating and intrustion alerts. User defined alerts and alarms triggered by attribute and biometric detections. All in real time. Comprehensive Investigative Tools Find exactly what you're looking for in any type of video. Works on both fixed and mobile video. Never sit and review lengthy hours of video again. Fill out the form below to schedule a demo Fill out the form below to schedule a demo Real-Time Analytics Watchlists and subject search powered by Face Recognition. Tailgating and intrustion alerts. User defined alerts and alarms triggered by attribute and biometric detections. All in real time. Comprehensive Investigative Tools Find exactly what you're looking for in any type of video. Works on both fixed and mobile video. Never sit and review lengthy hours of video again. Real-Time Analytics Watchlists and subject search powered by Face Recognition. Tailgating and intrustion alerts. User defined alerts and alarms triggered by attribute and biometric detections. All in real time. Comprehensive Investigative Tools Find exactly what you're looking for in any type of video. Works on both fixed and mobile video. Never sit and review lengthy hours of video again. Watchlists and subject search powered by Face Recognition. Tailgating and intrustion alerts. User defined alerts and alarms triggered by attribute and biometric detections. All in real time. Find exactly what you're looking for in any type of video. Works on both fixed and mobile video. Never sit and review lengthy hours of video again."
  ]
}