{
  "company": "www.aware.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "NISTPack enables law enforcement agencies, systems integrators, and vendors of fingerprint and mug shot systems to easily comply with the ANSI/NIST standard: \" Data Format For The Interchange Of Fingerprint, Facial, and Scar/Mark/Tattoo Information ,\" and the FBI's implementation of it: \"Electronic Fingerprint Transmission Specification.\" NISTPack provides an easy-to-use library of functions that simplify the process of formatting WSQ compressed fingerprint image data (type 4 record), biographic data (type 1 and 2 records), user defined gray scale images (type 7 record), digitized signature data (type 8 record), minutiae data (type 9 record) and facial or other color image data (type 10 record) into the single, compact file standard defined by ANSI/NIST. These software development tools ensure that digitized images are properly compressed, that demographic data is included in the correct format, and that the resulting file is constructed properly for interoperability with other agencies or other standard compliant vendors. NISTPack supports the ANSI/NIST specifications of the FBI, Interpol, The Home Office in the UK, Western Identification Network, and all 50 US states. Nistpack Display of Type 4 Records NistPack provides compliance with the ANSI/NIST standard and ensures the law enforcement data can be exchanged with other systems ActiveX Controls Image Control Field Control Transaction Control Printer Control Easy data viewing and editing GUI based runtime utilities FBI certified WSQ compression/decompression Supported Platforms Windows 95/NT HPUX Sun Solaris AIX Unixware Linux for an interactive demonstration of NistPack for the Web To receive more information about Aware's Compression Products please contact us",
    "WSQ by Aware is the industry's highest performing implementation of the FBI's Wavelet Scalar Quantization (WSQ) digital fingerprint compression algorithm. WSQ is a wavelet transform-based compression standard, developed by the FBI for compression of digital fingerprint images. Widely used around the world, WSQ by Aware is specifically designed for the compression and management of high-resolution, grayscale fingerprint images. As the first officially certified WSQ vendor, Aware guarantees FBI compliance with every WSQ license. Aware provides WSQ and other IAFIS compliant software solutions to a diverse customer base, including major system integrators, livescan and AFIS vendors, as well as local, state, and federal government agencies. Why WSQ by Aware? Performance: Aware is the leader in wavelet based compression algorithms. WSQ by Aware is significantly faster than the next fastest commercial implementation of the WSQ algorithm. Fingerprint images are large, and digital ten-print cards (\"NIST\" files, see NistPack by Aware ) typically include 14 WSQ compressed fingerprint images. Use of WSQ by Aware to quickly compress or decompress fingerprint image data will reduce the likelihood of system bottlenecks or delays associated with acquiring or displaying high quality digital fingerprint images. Be certain that your system incorporates the fastest WSQ implementation available. Fingerprint Image-Quality Measurement Functions : How can you be certain that the fingerprint images your system acquires will be accepted by the FBI, by Interpol, the RCMP, UK NAFIS, or by other local state or federal systems? Aware's WSQ image-quality API is designed to help integrators build a suite of quality assurance controls into a digital fingerprint system. The ability to quickly assess the quality of an image before it is compressed with WSQ is critical to any system acquiring fingerprint images. Aware's WSQ image-quality API performs a set of functions that segment, process, and measure an image. The API then returns values and a color-coded quality image (Figure 4) to the user or developer. These measurements, which include ridge flow values, image size, contrast, brightness and dynamic range, can be clearly displayed via the user interface of an application, thus allowing the user to immediately determine whether the image will meet the requirements of an AFIS system. Provide your system with the flexibility to determine fingerprint image quality and then accept or reject the image before the compression process. Risk Reduction: Aware played a role in the development and testing of the WSQ algorithm during the early 90's when the FBI was developing the standard. Aware was the first company to commercialize WSQ and to provide it to the digital fingerprint market as a dependable, bug free, and FBI certified API. Today WSQ by Aware is installed in thousands of live scan, AFIS, and criminal justice or civil applicant data bases around the world. WSQ by Aware has been field proven, optimized and maintained for over five years. Have confidence that your system will properly compress and decompress even the most problematic fingerprint images. Maintenance: Aware is a commercial organization dedicated to the support and maintenance of its software tools. Aware's Advanced Products Group consists of a dedicated group of software engineers that will respond to your technical support questions in a timely way. Aware constantly maintains and optimizes WSQ. When a single change is made to the API or to the algorithm we resubmit new test data to the FBI. You can be sure that any version of WSQ by Aware that you use will be fully certified and tested by the FBI. Aware will work closely with you and assist you during your application development. Our goal is customer satisfaction. We are in this business for the long term. Rely on Aware's expertise and responsive engineering team for answers to your digital fingerprint information systems development questions. More Than WSQ : WSQ is one piece of the FBI IAFIS compliance requirements. Aware provides a family of development tools that are designed to provide compliance with … The FBI's \" Electronic Fingerprint Transmission Specification\" - NISTPack by Aware ANSI/NIST-CSL 1-1993, \" Data Format For The Interchange of Fingerprint, Facial and Scar/Mark/Tattoo Information \"- NISTPack by Aware The FBI's EFTS Appendix F Image Quality Specifications for Printers- AccuPrint By Aware Benefits: Guaranteed FBI compliance Highly optimized for speed Rigorously field tested and proven Used by blue chip systems integrators and vendors Features: An easy to use API with example programs and source code Image quality measurement functions ActiveX control Browser plug-in Multi platform support File conversions between WSQ and TIFF, BMP, TGA, PPM & DIB WSQ file comment insertion / extraction Full error condition handling Partial resolution image extraction Re-entrant and thread safe Specifications Image Size: Minimum: 65x65 pixels Maximum: 5000x5000 pixels Pixel Depth: 8-bit Grey scale Compression Range: 2:1 minimum compression 50:1 maximum compression User Controllable Options: Compression ratio Progressive decompression Image-quality thresholds Source file formats: Raw (no header) 8-bit gray scale BMP, TIFF Platforms: Sun O/S Sun Solaris SGI IRIX Windows 95/98/NT DOS UNIXWare NextStep OS/2 RS6000 / AIX HP / UX Alpha / OSF Linux To receive more information about Aware's Compression Products please contact us The FBI's \" Electronic Fingerprint Transmission Specification\" - NISTPack by Aware ANSI/NIST-CSL 1-1993, \" Data Format For The Interchange of Fingerprint, Facial and Scar/Mark/Tattoo Information \"- NISTPack by Aware The FBI's EFTS Appendix F Image Quality Specifications for Printers- AccuPrint By Aware Benefits: Guaranteed FBI compliance Highly optimized for speed Rigorously field tested and proven Used by blue chip systems integrators and vendors Features: An easy to use API with example programs and source code Image quality measurement functions ActiveX control Browser plug-in Multi platform support File conversions between WSQ and TIFF, BMP, TGA, PPM & DIB WSQ file comment insertion / extraction Full error condition handling Partial resolution image extraction Re-entrant and thread safe Specifications Image Size: Minimum: 65x65 pixels Maximum: 5000x5000 pixels Pixel Depth: 8-bit Grey scale Compression Range: 2:1 minimum compression 50:1 maximum compression User Controllable Options: Compression ratio Progressive decompression Image-quality thresholds Source file formats: Raw (no header) 8-bit gray scale BMP, TIFF Platforms: Sun O/S Sun Solaris SGI IRIX Windows 95/98/NT DOS UNIXWare NextStep OS/2 RS6000 / AIX HP / UX Alpha / OSF Linux To receive more information about Aware's Compression Products please contact us Highly optimized for speed Rigorously field tested and proven Used by blue chip systems integrators and vendors Features: An easy to use API with example programs and source code Image quality measurement functions ActiveX control Browser plug-in Multi platform support File conversions between WSQ and TIFF, BMP, TGA, PPM & DIB WSQ file comment insertion / extraction Full error condition handling Partial resolution image extraction Re-entrant and thread safe Specifications Image Size: Minimum: 65x65 pixels Maximum: 5000x5000 pixels Pixel Depth: 8-bit Grey scale Compression Range: 2:1 minimum compression 50:1 maximum compression User Controllable Options: Compression ratio Progressive decompression Image-quality thresholds Source file formats: Raw (no header) 8-bit gray scale BMP, TIFF Platforms: Sun O/S Sun Solaris SGI IRIX Windows 95/98/NT DOS UNIXWare NextStep OS/2 RS6000 / AIX HP / UX Alpha / OSF Linux To receive more information about Aware's Compression Products please contact us An easy to use API with example programs and source code Image quality measurement functions File conversions between WSQ and TIFF, BMP, TGA, PPM & DIB WSQ file comment insertion / extraction Full error condition handling Partial resolution image extraction Re-entrant and thread safe Pixel Depth: 8-bit Grey scale Compression Range: 2:1 minimum compression 50:1 maximum compression User Controllable Options: Compression ratio Progressive decompression Image-quality thresholds Source file formats: Raw (no header) 8-bit gray scale BMP, TIFF Platforms: Sun O/S Sun Solaris SGI IRIX Windows 95/98/NT DOS UNIXWare NextStep OS/2 RS6000 / AIX HP / UX Alpha / OSF Linux To receive more information about Aware's Compression Products please contact us",
    "Title: A proposal to use HDLC as defined in IETF RFC 16621622 as a data link layer for full duplex physical layer management interface on the ADSL U interface ADSL Forum 97.146. Date: September, 1997, Brussels BelgiumBelguim Working Group Status: ADSL Forum Network Management Source: 3Com, Broadband Access Division, Ericsson, Aware Inc. Authors: Peter J. Silverman 3COM , James R. Loehndorf 3COM , Albin Johansson Ericsson, Ross Spearman Ericsson, Abbas Bagasrawala Aware Inc. James R. Loehndorf 3Com, Broadband Access Division Mailstop: Denmark 9 8100 N. McCormick Blvd. Skokie, Il. 60076 Tel.: +1 847 933 5684 Fax: +1 847 982 1348 E-mail: Jloeh@usr.com Albin Johansson Ericsson Austria, Pottendorfer Strasse 25-27 A-1121 Ross Spearman Ericsson Austria, Pottendorfer Strasse 25-27 A-1121 Vienna Tel: +43 1 81100-6693 Fax: +43 1 81100-5381 E-mail: ross.spearman@sea.ericsson.se Abbas Bagasrawala Aware Inc. One Oak Park Bedford MA 01730 Tel: +1 781 276 4000 Fax: +1 781 276 4001 Email: telecom@aware.com There have been several proposals for supporting a full duplex and autonomous management interface for the physical layer on the ADSL U interface. These include enhancements to the T1.413 EOC or use of ATM OAM constructs such as F3 or F4 cells. Regardless of the method used to provide a transport channel, the following functions must be supported by a data link layer protocol over that channel: Delineation of the PDU, support for data integrity, and independence of any higher level protocols carried. An implementation of a subset of HDLC, similar to that utilized in RFC 1662 will provide a data link layer that fulfills these requirements that is efficient and easy to implementablimplemente. This contribution has been prepared to assist the ADSL Forum. It is offered to the Committee as a basis for discussion and is not a binding proposal on 3Com, Ericsson, or Aware Inc., or3Com, m, Ericsson, and Aware Inc. and specifically reserves the right to add, amend, or retract any and all statements contained herein without further notice. There have been several proposals for supporting a full duplex and autonomous management interface for the physical layer on the ADSL U interface. These include enhancements to the T1.413 EOC or use of ATM OAM constructs such as F3 or F4 cells and others. Regardless of the method used to provide a transport channel, the following functions must be supported by a data link layer protocol over that channel: Delineation of the PDU, support for data integrity, and independence from any higher level protocols carried on the channel. An implementation of a subset of HDLC as utilized in RFC 1662 [RFC 1662] will provide a data link layer that fulfills these requirements and is efficient and implementable. Use of PPP/HDLC RFC 1662 It is proposed that an HDLC like protocol be used as the data link layer on type of a full duplex management channel on the ADSL U interface. . [DSC] RFC 1662 defines a protocol that can be adapted for this function. This byte oriented protocol frames messages and provides a reliable transport mechanism for messages in that corrupt messages are detected by the FCS provided by the protocol. The following features of the protocol defined in RFC 1662 would be utilized: The protocol defined in RFC 16621622 has a three byte header consisting of: -a one byte frame flag, -an address field which will always be set to 1's - a control field always set to 00000011b, indicating that only \"unnumbered information frames\" are being used. A three-byte trailer contains a two byte FCS and a frame flag to end the frame. The payload of the unnumbered information frames will contain the following elements -A two byte \"protocol identifier\" -Information bytes containing the payload. No padding bytes are required. The \"transparency methods\" defined in 4.2 of RFC 1662 are used. An escape sequence 0111101b is used to prevent bytes which contain the frame flag code point as data from being inappropriately identified as flags. A byte that contains the frame flag or the escape sequence is preceded with the escape sequence byte and the data byte is ex-or'd with 00100000b. Since only the UI frame ius defined for this protocol no acknowledgments, channel initialization sequences, or times need to be defined for this data link layer. When used over a full duplex management channel on the U interface, the frames would be placed on the channel. In order to prevent buffer overflow a maximum frame length must be defined.of 1020 bytes is specified . In the case of an enhanced EOC as defined in contribution adslforum-97-145, each byte of an RFC 16621622 frame would be placed in the payload of an EOC autonomous data \"frame'. Should the operations channel be based on constructs other then an enhanced EOC, such as use of an F3 OAM flow, the HDLC frames could be inserted in the channel supported by that scheme. Use of the \"Protocol Identifier\" The two byte \"Protocol Identifier\", indicates which higher level protocol is carried in a particular frame. It is proposed that it contain an Ethertype as defined in RFC 1700 [RFC 1700] . For example, a frame containing a SNMP message would have the Protocol Identifier set to 814C. The following diagram illustrates the use of this protocol in the case of an enhanced ADSL. Other diagrams could be created for other transport methods such as OAM cells. A similar diagram could be constructed for other transport architectures. References [RFC 1662] IETF, Request for Comments 1662: PPP in HDLC-like Framing July 1994 [RFC 1700] IETF: Request for Comments 1700: Assigned Numbers The protocol defined in RFC 16621622 has a three byte header consisting of: -a one byte frame flag, -an address field which will always be set to 1's - a control field always set to 00000011b, indicating that only \"unnumbered information frames\" are being used. A three-byte trailer contains a two byte FCS and a frame flag to end the frame. The payload of the unnumbered information frames will contain the following elements -A two byte \"protocol identifier\" -Information bytes containing the payload. No padding bytes are required. The \"transparency methods\" defined in 4.2 of RFC 1662 are used. An escape sequence 0111101b is used to prevent bytes which contain the frame flag code point as data from being inappropriately identified as flags. A byte that contains the frame flag or the escape sequence is preceded with the escape sequence byte and the data byte is ex-or'd with 00100000b. Since only the UI frame ius defined for this protocol no acknowledgments, channel initialization sequences, or times need to be defined for this data link layer. When used over a full duplex management channel on the U interface, the frames would be placed on the channel. In order to prevent buffer overflow a maximum frame length must be defined.of 1020 bytes is specified . In the case of an enhanced EOC as defined in contribution adslforum-97-145, each byte of an RFC 16621622 frame would be placed in the payload of an EOC autonomous data \"frame'. Should the operations channel be based on constructs other then an enhanced EOC, such as use of an F3 OAM flow, the HDLC frames could be inserted in the channel supported by that scheme. Use of the \"Protocol Identifier\" The two byte \"Protocol Identifier\", indicates which higher level protocol is carried in a particular frame. It is proposed that it contain an Ethertype as defined in RFC 1700 [RFC 1700] . For example, a frame containing a SNMP message would have the Protocol Identifier set to 814C. The following diagram illustrates the use of this protocol in the case of an enhanced ADSL. Other diagrams could be created for other transport methods such as OAM cells. A similar diagram could be constructed for other transport architectures. [RFC 1662] IETF, Request for Comments 1662: PPP in HDLC-like Framing July 1994 [RFC 1700] IETF: Request for Comments 1700: Assigned Numbers"
  ]
}