{
  "company": "www.ipsidy.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 16,
    "0": 10
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.1428571428571428,
    "framing_surveillance": 0.0357142857142857,
    "framing_market": 0.8214285714285714,
    "num_docs": 26
  },
  "topic_timeline": {
    "20": {
      "-1": 16,
      "0": 10
    }
  },
  "sample_docs": [
    "Voter Identification – Zambia Electoral Commission In 2005 the Zambia Electoral Commission along with the United Nations Development Program and other human rights organizations sought to achieve an objective of One Citizen One Vote for the countrys first fully democratic Presidential election. Between 5.5 and 6 million voters from 72 electoral districts were registered on paper with only an inked impression of the right thumb. Zambia needed a solution that would accurately confirm the identities of its citizens and ensure that duplicate registrations did not occur. In support of the Zambian 2005 presidential elections, Ipsidy delivered IDSearch, our proprietary, identity management service that includes Biometric Fingerprint Enrollment, Fingerprint Matching and Fingerprint Deduplication services. We also provided custom software development to integrate our AFIS with a third-party Voter Results system and full integration with the Zambia Electoral Commission's infrastructure. ID Search captured over 6 million voter fingerprint images and registration records and produced highly accurate AFIS templates. Fingerprint match processing and deduplication of over 500 billion records was completed within 90 days. The 2005 effort was so successful that we have been chosen by the Zambia Electoral Commission for every presidential election since 2005. Clean, de-duplicated Voter Registry Objective of \"One Citizen - One Vote\" met .",
    "Security and Payments Market Trends Half a billion records compromised in 2015 data breaches - Symantec Securing Identity In A Mobile World With global electronic payments at all time high, cash still 80% of consumer spending in many developing countries - EuroMonitor 1.1 + billion banking customers to use mobile biometrics for account security by 2020 - Goode Intelligence 2.5 billion adults, 38% of global adult population are 'unbanked' - World Bank Driving Financial Inclusion In Developing Countries Trusted, Easy to Use, Real-Time Identity and Electronic Transaction Solutions Use our real-time identity management solutions for authenticating digital and physical transactions and our biometric services to verify and manage identities of citizens, employees and customers. Leverage our electronic transaction platform delivering secure multifunctional payment services for merchants and financial institutions. Offer OnePay™ our virtual mobile wallet and merchant payment solution to broaden financial inclusion. Biometric Identity Management United States Transport Workers Since 2007 Ipsidy has helped the US Dept. of Homeland Security/TSA secure the US maritime and aviation ports by providing a biometric identity management system. Ipsidy provides best-in-class Identity and Voter Registry Validation Services for Presidential Elections in Zambia to achieve its mission of \"One Citizen, One Vote\". Unattended Ticketing Kiosks Bogota Bogota, Colombia based TransMilenio is one of the world's largest bus transit providers. Ipisdy has helped to enhance and extend their electronic ticketing and fare collection network. Want to about our Security & Payment solutions? .",
    "Identity Proofing: What a Business Needs to Know A Guide to Choosing a Visitor Pass and Access Cont... 6 Workplace Security Tips to Keep Your Business an... Enhance Your Access Control Policy and Procedures What Is Identity as a Service (IDaaS)? Top Church Security Guide For a Safer House of Wor... The Benefits of MultiFactor Authentication – A Def... What To Look For In A Visitor Logger INTERVIEW: Ipsidy forms multiple partnerships in L... ISC West: Ipsidy's Philip Beck Talks Face-Based On... INTERVIEW: Philip Beck, CEO, Ipsidy Ipsidy is a 2019 KNOW Award Finalist! Ipsidy updates on roll-outs of its suite of biomet...",
    "What is Ipsidy? [ ip-si-dé ] From the Latin word 'Ipse' meaning Selfhood, individual identity President and CEO, Director of the Company Tom Szoke has over 25 years of engineering, global sales and operations management . Prior to IDGS, Tom was a founding member and Chief Operating Officer of Innovation In Motion Inc., which was merged into IIM Global Corporation in 2013. Tom pioneered the concept and development and is the inventor of IIM Global Corps HDR Intelligent Accessory product lines, including the IIM Global Corps Inventory Control Handheld (ICH) and Handheld Voter Registration Device used in the 2012 Ghana elections and the IIM Global Corps SRIO Mobile Payment Solution. Prior to that, Tom spent 23 years with Motorola, Inc. gaining experience in field and product engineering, systems integration, program management and sales. Doug Solomon has over 30 years of hands‐on experience in the management of corporations and international subsidiaries, with over 13 years in international sales and marketing within the high‐tech industry. Prior to founding ID Solutions, Doug held various positions as President and/or CEO of various US‐based and international companies. As a graduate of the University of the Witwatersrand, Doug started his career with Hewlett Packard in South Africa in 1979 and in 1985 left HP to start one of the largest HP OEM's in Africa, under the banner of the then publicly traded \"Square One Solutions Group\". Max Umarov has over 15 years of experience in the fields of Biometrics and Security, having held positions ranging from System Administrator to Vice President of Engineering at several high‐tech companies in the US and Russia. Max has successfully led teams in the design and deployment of large scale IT and biometrics systems for government and enterprise customers. Max received his Master of Science and Engineering Degrees with honors from Bauman Moscow State Technical University. His credentials include Cisco and Microsoft IT security certifications, as well as INFOSEC CNSS 4011 & 4013 (Information Security Professional) certification granted by Committee for National Systems Security (CNSS) and U.S. National Security Agency (NSA). Charles Albanese has more than 25 years of financial and operations experience in both public and private companies. He cultivated his senior management experience as part of the business team at AT&T Wireless Services for over 16 years. Charles' leadership skills coupled with his knowledge of finance, audit, tax, security and real estate helped enable this start‐up to become the premier wireless telecommunications carrier in the nation. At Cambridge Management Group LLC, one of the leading pre‐ settlement finance companies, Charles served as COO/CFO. Charles holds a BS in Business Administration from Manhattan College and is a certified ODI Facilitator. Matt Cordis has more than 13 years of broad legal, financial and operations experience. Previously, Matthew served as President of CBC Global Capital, LLC where he directed the company's operations in the Republic of Colombia. Prior to that, Matt practiced law at Clarke Silverglate & Campbell in Miami, a top peer‐rated law firm in Florida, where after only six years, he became the youngest partner in the firm's history. In addition, Matthew served in various political, community and election advisory positions for the City of Miami Beach, and as a Director of the Board of Plus International Bank in Miami. Mr. Cordis holds a BS magna cum laude from Washington University and graduated with honors from the Loyola University Chicago School of Law. President, LATAM Region, VP Sales Latin America Ricardo Galeano has over 22 years of executive experience in high tech companies in Europe, Middle East, Africa and Latin America. He previously served as Vice President of Sales for Latin America for Airbus Defense and Space, Vice President of International Sales at Innovation In Motion Inc., and Director of Sales (Biometrics Business Unit) for EMEA at Motorola Inc. Ricardo also offers a wealth of experience across defense, security and biometric and wireless technologies industries, and has a deep knowledge of negotiating commercial and public/private partnerships. Ricardo holds an Electronic Engineering degree from Santo Tomas University in Colombia, has participated in management seminars at Wharton and holds an Executive MBA from Instituto de Empresa in Madrid Spain. .",
    "ID Global Solutions Corporation doing business as Ipsidy (\"Ipsidy\" or \"IDGS\") operates http://www.ipsidy.com (the \"Site\"). The following statements inform you of Ipsidy's policies regarding the collection, use and disclosure of Personal Information Ipsidy receives from users of the Site. By using the Site, you agree to the collection and use of information in accordance with this policy. Information Collection and Use While using the Site, Ipsidy may ask you to provide it with certain personally identifiable information that can be used to contact or identify you. Personally identifiable information may include, but is not limited to, your name, e-mail address, telephone number and postal address (\"Personal Information\"). Ipsidy uses your Personal Information for providing you with information about Ipsidy, its products and services and for maintaining and improving the Site. Ipsidy may use your Personal Information to contact you with marketing or promotional materials. We are a multinational business headquartered in the United States, with subsidiaries and affiliates in various countries around the world. Your personal information may be disclosed to recipients located outside of your country, including our global subsidiaries and affiliates. We do not make a practice of selling, sharing, trading or renting your personal information to others in ways different from what is disclosed within this policy, agreed to contractually by our customers or otherwise with their permission. Like many site operators, Ipsidy collects information that your browser sends whenever you visit the Site (\"Log Data\"). This Log Data may include information such as your computer's or other device's Internet Protocol (\"IP\") address, browser type, browser version, the pages of the Site that you visit, the time and date of your visit, the time spent on those pages and other statistics. In addition, Ipsidy may use third- party services such as Google Analytics provided by Google, Inc. (\"Google\") that collect, monitor and analyze such activity. Google Analytics uses its own cookies to help Ipsidy analyze how you and other users use this website. The information generated by the cookie about your use of this website (which may include your IP address, the internet browser and language you use, preferences, the date and hour of your access to the web page and the websites you access after visiting this website) will be transmitted to and stored by Google on servers in the United States. Google will use this information for the purpose of evaluating your use of this website, compiling reports on website activity for website operators and providing other services relating to website activity and internet usage. By using this website, you consent to the processing of data about you by Google in the manner and for the purposes set out above and in Google's . To opt out of being tracked by Google Analytics and to find out more about Google's , Like many sites, Ipsidy uses \"cookies\" to collect information. You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of the Site. A \"cookie\" is a text file that websites send to a visitor's computer or other internet-connected device to uniquely identify the visitor's browser or to store information or settings in the browser. This website's uses of cookies includes those cookies that are strictly necessary to enable the features of the website, performance cookies to see how visitors use the website, and functionality cookies that enable the webpage to \"remember\" machines or devices, personalize website content and tailor user experience. In addition, cookies may be used to help us define our audience so that we can make appropriate changes to this website (\"Demographics\" cookies) and target advertisements to users when they are browsing this website and other websites (\"Interest Reporting\" cookies), in each case by reference to anonymous identifiers, not personal information. The security of your Personal Information is important to Ipsidy, but remember that no method of data transmission over the Internet, or method of electronic data storage, is 100% secure. While Ipsidy strives to use commercially reasonable means to protect your Personal Information, Ipsidy cannot guarantee its absolute security. Ipsidy may provide links on this website to other websites that are not under our control. We do not endorse or make any warranty of any type regarding the content contained on such websites or products and services offered on those websites. We make no representation regarding your use of such websites. Please be aware that we are not responsible for the privacy practices of the operators of other websites. We encourage our users to be aware when they leave our site and to read the privacy statements of each and every website that collects personal information. This policy applies solely to information collected by us. You should read any other applicable privacy and cookies policies carefully before accessing and using such other websites. Changes To This This is effective as of April 15, 2016 and will remain in effect subject to any changes in its provisions in the future, which will be in effect immediately after being posted on this page. Ipsidy reserves the right to update or change this at any time and thus you should check this periodically. Your continued use of the Site after Ipsidy posts any modifications to the on this page will constitute your acknowledgment of the modifications and your consent to abide and be bound by the modified . If you have any questions about this , please contact us. ."
  ]
}