{
  "company": "www.techsign.com.tr",
  "dominant_topics": [
    0,
    -1,
    1,
    4,
    11
  ],
  "topic_counts": {
    "0": 21,
    "-1": 8,
    "1": 4,
    "4": 1,
    "11": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader",
    "11": "authentication, password, lastpass, factor, hanko"
  },
  "framing_scores": {
    "framing_ethical": 0.2,
    "framing_surveillance": 0.1532710280373831,
    "framing_market": 0.6467289719626168,
    "num_docs": 38
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 21,
      "1": 4,
      "2": 1,
      "3": 1,
      "4": 1,
      "6": 1,
      "11": 1
    }
  },
  "sample_docs": [
    "TechSign MultiFactor Authentication System (Fast Identity Online compatible) is the largest international ecosystem of standard based, interoperable authentication solutions. Better Security For Online Services Reduced Cost For Enterprise Simpler and Safer For Consumers FIDO standards are managed by the FIDO alliance, which is formed in 2012 with the vision of eliminating security problems based on weak, password-based authentication infrastructures. FIDO allows an easy and secure way of authentication, especially for online services. FIDO UAF (Universal Authentication Framework) Passwordless Authentication on Mobile Devices Passwordless Authentication on Mobile Devices The passwordless FIDO experience is provided by the UAF protocol. The user can register its device to the service by using a personal identification method such as fingerprint recognition, face recognition, voice recognition or a special PIN, according to the capability of the device and platform. UAF allows for managing the available methods centrally. After registration, the selected recognition method can be used for authentication to the service. At this point, it is completely unnecessary to enter a password again. UAF also allows for joint operation of different recognition methods, such as fingerprint and face recognition. FIDO U2F (Universal Two-Factor Authentication Framework) Two-Factor Authentication from Local Devices Two-Factor Authentication from Local Devices The Two-Factor FIDO experience is provided by the U2F protocol. Using FIDO U2F, online services can add an additional protection layer to their existing login systems. User continues using a username and password, as before. The service asks for the second factor authentication whenever necessary. This strong two-factor authentication methodology allows for using simpler passwords without compromising security. User can use the same FIDO U2F device for different services. Insert Dongle + Press Button FIDO2 U2F WebAuthn + CTAP FIDO Web Experience Using Local Devices FIDO Web Experience Using Local Devices FIDO2 Project is the collection of initiatives preparing an interoperable authentication standard for web browsers. It includes the WebAuthn protocol from W3C and the Client-to-Authenticator Protocol (CTAP) from FIDO Alliance. Thus, it allows for fast and easy login to online services with authentication on local devices. Why TechSign MultiFactor Authentication System? Public/Private Key Based Security Local Biometric Authentication on Device Protection against Phishing and Man-in-the-middle attacks Lower development and maintenance cost Lower risk of data breach Increased Customer Satisfaction with better UX No need for complicated passwords Authentication with a simple gesture Same device and recognition for different services Easy and fast usage En Areas of Usage Employee, partner, supplier authentication Login to online services Remote access to desktop or mobile applications",
    "Digital Customer On boarding With Remote Know Your Customer (RKYC) RKYC (Remote Know Your Customer) is developed to enable corporations to accept online customers while also enabling customers to access the institutions safely and quickly without going to the branch. Bring your organization to the forefront in digital transformation through a process of customer acquisition that is sensitive to corporate preferences and regulations with a product that is compliant with the international Know Your Customer (KYC) laws, which aims to protect organizations from potential risk, fraud and money laundering (AML). Let's Design The Process Together Thanks to our modular software approach, the customer acquisition process is customizable for you. Choose the modules that suits your purpose, institutional preferences and legal allowances to turn on boarding into a one time experience for your customers. Device Surround Check Signal Strength Light Sound OCR ID Card Address Confirmation Documents Additional Documents Chip Reading With NFC (IOS, Android) With Card Reader (IOS, Android) With NFC (IOS, Android) With Card Reader (IOS, Android) Auto Capture Automatic Face Capture (Alignment)) Automatic Document Capture (Sharpness, Distance, Reflection Control) Automatic Face Capture (Alignment)) Automatic Document Capture (Sharpness, Distance, Reflection Control) Signing with Biometric Signature Artificial Intelligence Verification Face Recognation (Photo from NFC, Selfie, Video and ID Card) Liveness Test (Göz kırpma, kafa çevirme, kelime okuma) ID Card Recognition (Recognition of type, integrity, hologram) Address Confirmation Document Recognition Additional Documents Recognition Static signature checking Face Recognation (Photo from NFC, Selfie, Video and ID Card) Liveness Test (Göz kırpma, kafa çevirme, kelime okuma) ID Card Recognition (Recognition of type, integrity, hologram) Address Confirmation Document Recognition",
    "TechSign Biometric Signature: SAFER THAN WET SIGNATURE Sign the electronical documents by hand using tablets or computer pads. Sealed Document: Real Document Security! Biometric siganture is attached to the document with all its biometric parameters: Document is converted to a signed and sealed PDF document FIRST STEP OF DIGITAL TRANSFORMATION Business life becomes digital. Take the first step by digitalizing your documents! Don't fall behind on competition. Smart Card Technology in Identity Verification Smart Card Verification System NO MORE DOCUMENT CHAOS Meet the comfort of simplified, accelerated business processes. The safest identity verification for online processing One Word: FIDO Today, digital transformation is not an option, it is an obligation to catch the era. For this transformation, transferring the data to digital platforms and keeping them safely is an initial move and \"digitalizing documents with wet-ink signatures\" is the first step. This step is of huge importance for adapting your firm to the digital world. The digital transformation of document processes reduces paper, print and storage costs. But these are only a small part of its advantages. Without the hassle created by paper documents, work environment will be more plain and efficient and customer satisfaction will increase. TechSign aims to introduce its customers to the power of the digital age by providing safe and innovative solutions. These solutions bring efficiency, speed and convenience to business life and also a great advantage for competition",
    "Today, the majority of work flow is handled in digital platforms. And the digital part keeps growing. So information security is of critical importance. The information security of institutions needs to be carried beyond the classical encryption methods which can not avoid personal misuse. TechSign uses state of the art technology in identity verification and increases your information security. TechSign promises you passwordles services, high information security and beyond: High Security PKI encrypting Keys are hidden in device, passwords are not kept in server Prevents phishing attacks Prevents man in the middle attack Biometric data does not leave the device Third party protocols are not used Keys are hidden in device, passwords are not kept in server Prevents man in the middle attack Biometric data does not leave the device Third party protocols are not used Customer Friendly There is no need to use complex passwords, the same verification can be used on different levels of the workflow. A customer friendly system that increases efficiency. Low Cost Increasing the speed, decreasing the cost.",
    "TechSign offers the best solutions to your company for digitalizing its processes. The first step for digitalizing is eliminating paper from the business processes. TechSign provides integrated packages, which include biometric signature, electronic signature and identity verification solutions. And these packages can be tailored considering your own requirements. TechSign is with you in your first step for your digital transformation. We introduce you biometric digital signature and related solutions, which are safer than alternative traditional procedures, to reduce your cost, to improve your organizational speed, to increase your efficiency"
  ]
}