{
  "company": "www.surrey.ac.uk",
  "dominant_topics": [
    16,
    3,
    2,
    0
  ],
  "topic_counts": {
    "16": 44,
    "3": 3,
    "2": 1,
    "0": 1
  },
  "topic_descriptions": {
    "16": "university, surrey, data, personal data, prize",
    "3": "vantage, development, document, ai, prioxis",
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 49
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "2": 1,
      "3": 3,
      "16": 44
    }
  },
  "sample_docs": [
    "Welcome to Surrey For new, confirmed students starting in September 2015 For new, confirmed students starting in September 2015 Latest Freshers' videos from Stag TV What else do I need to know? In this video Sophie brings you all the other little bits of information that you may find useful to know in your first weeks at the University of Surrey. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2015 group Surrey Student page Latest Freshers' videos from Stag TV What else do I need to know? In this video Sophie brings you all the other little bits of information that you may find useful to know in your first weeks at the University of Surrey. Stay in the loop Surrey Freshers 2015 group Help and advice We hope that our Welcome website provides the answers to many of the questions you have as you begin life at the University of Surrey. However, if the website doesn't answer your questions, the Student Services Centre staff will be happy to help. If you have a question relating to the running of your programme, contact your Faculty Student Services Office. First check out our list of popular FAQs If that doesn't answer your question, once you have completed your online initial registration, the quickest way to get help is to submit a question online . If you have a question but you haven't registered yet, you can also get in touch by phone by calling +44 (0)1483 686868. Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website provides the answers to many of the questions you have as you begin life at the University of Surrey. However, if the website doesn't answer your questions, the Student Services Centre staff will be happy to help. If you have a question relating to the running of your programme, contact your Faculty Student Services Office. First check out our list of popular FAQs If that doesn't answer your question, once you have completed your online initial registration, the quickest way to get help is to submit a question online . If you have a question but you haven't registered yet, you can also get in touch by phone by calling +44 (0)1483 686868. Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Monday 12 October 2015 13:42:51 by ks0045 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Fri Oct 23 23:48:25 BST 2015 Content ID: 104477 Revision: 56 Community: 1024",
    "Welcome to Surrey For new, confirmed students starting in September 2016 For new, confirmed students starting in September 2016 Sorry, we need to know what type of course you'll be studying in order to find your timetable. Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2016 group Surrey Student page uniofsurrey @uniofsurrey Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Stay in the loop Surrey Freshers 2016 group Help and advice We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Monday 3 October 2016 15:41:09 by cd0027 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Tue Oct 25 20:52:51 BST 2016 Content ID: 104477 Revision: 72 Community: 1024",
    "Welcome to Surrey For new, confirmed students starting in September 2016 For new, confirmed students starting in September 2016 Featured Welcome Week Events Exhibition Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 12:00 to 16:00 PATS Field The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 10:00 to 18:00, 10:00 to 17:30 Surrey Sports Park Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 16:00 to 18:30 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Exhibition Volunteering Fayre Tuesday 4 Oct. 2016 16:00 to 18:30 Rubix, Students' Union Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Exhibition Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 11:00 to 15:00 PATS Playing Field Marquee The Autumn Careers & Placements Fair is the biggest event in the Employability and Careers Centre's year, offering an exciting opportunity for students to meet graduate employers and placement providers. . Featured Welcome Week Events Exhibition Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 12:00 to 16:00 PATS Field The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 10:00 to 18:00, 10:00 to 17:30 Surrey Sports Park Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 16:00 to 18:30 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 Friday 30 Sep. 2016 The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 Saturday 1 Oct. 2016 Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 Tuesday 4 Oct. 2016 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Exhibition Volunteering Fayre Tuesday 4 Oct. 2016 16:00 to 18:30 Rubix, Students' Union Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Exhibition Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 11:00 to 15:00 PATS Playing Field Marquee The Autumn Careers & Placements Fair is the biggest event in the Employability and Careers Centre's year, offering an exciting opportunity for students to meet graduate employers and placement providers. . Tuesday 4 Oct. 2016 Tuesday 4 Oct. 2016 Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 Wednesday 12 Oct. 2016 PATS Playing Field Marquee Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2016 group Surrey Student page uniofsurrey @uniofsurrey Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Stay in the loop Surrey Freshers 2016 group Help and advice We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Friday 30 September 2016 09:22:37 by cd0027 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Fri Sep 30 09:25:41 BST 2016 Content ID: 104477 Revision: 72 Community: 1024",
    "News and Events Discover engineering news, events and resources from the Why Engineering? team. Keep checking back for more updates. Latest news Discover engineering news, events and resources from the Why Engineering? team. Keep checking back for more updates. Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: pg0016 Page Created: Thursday 20 November 2014 10:26:30 by pg0016 Last Modified: Thursday 20 November 2014 10:26:48 by pg0016 Expiry Date: Saturday 20 February 2016 10:25:11 Assembly date: Fri Aug 14 19:43:56 BST 2015 Content ID: 136205 Revision: 1 Community: 1056",
    "Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Why Engineering? Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: whyeng@surrey.ac.uk Engineers are in demand as never before. Representing a quarter of the turnover of all UK enterprises – over three times the size of the retail sector – engineering is set for further growth in the near future, with an estimated two million engineers needing to be employed between now and 2020. The Why Engineering? campaign has been launched by the University of Surrey to highlight the many different ways our lives are improved through the work of engineers, and the diverse and exciting range of career opportunities open to graduates with a UK engineering degree. Contact us for more information: About Launched by the University of Surrey, the Why Engineering? campaign aims to create awareness of the broad spectrum of careers available to graduates with a UK engineering degree, and the many ways engineers are making a difference and improving people's lives. News Discover engineering news, events and resources from the Why Engineering? team. Resources Our Resources section offers a range of materials for students, parents, teachers and careers advisors to inform and educate around the opportunities within engineering. Frequently Asked Questions Partners Latest News Surrey brings engineering into the classroom As part of its 'Why Engineering?' campaign, the University has launched a range of curriculum resources that will open pupils' eyes to the fundamental role engineering plays in our daily lives. Get on the road to career success with an engineering degree Did you know that the world's top businesspeople are more likely to have studied engineering than economics, business studies or law? Among the CEOs of Fortune 500 companies, engineering is the most common undergraduate degree, while according to a survey by Spear's 'Wealth Management' magazine, engineering degrees produce the most millionaires. @SurreyEng Launched by the University of Surrey, the Why Engineering? campaign aims to create awareness of the broad spectrum of careers available to graduates with a UK engineering degree, and the many ways engineers are making a difference and improving people's lives. Discover engineering news, events and resources from the Why Engineering? team. Our Resources section offers a range of materials for students, parents, teachers and careers advisors to inform and educate around the opportunities within engineering. Surrey brings engineering into the classroom As part of its 'Why Engineering?' campaign, the University has launched a range of curriculum resources that will open pupils' eyes to the fundamental role engineering plays in our daily lives. Surrey brings engineering into the classroom As part of its 'Why Engineering?' campaign, the University has launched a range of curriculum resources that will open pupils' eyes to the fundamental role engineering plays in our daily lives. Get on the road to career success with an engineering degree Did you know that the world's top businesspeople are more likely to have studied engineering than economics, business studies or law? Among the CEOs of Fortune 500 companies, engineering is the most common undergraduate degree, while according to a survey by Spear's 'Wealth Management' magazine, engineering degrees produce the most millionaires. Get on the road to career success with an engineering degree Did you know that the world's top businesspeople are more likely to have studied engineering than economics, business studies or law? Among the CEOs of Fortune 500 companies, engineering is the most common undergraduate degree, while according to a survey by Spear's 'Wealth Management' magazine, engineering degrees produce the most millionaires. Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: pg0016 Page Created: Friday 20 June 2014 11:18:25 by pg0016 Last Modified: Wednesday 11 February 2015 09:47:39 by pg0016 Expiry Date: Thursday 11 June 2015 11:49:46 Assembly date: Fri Oct 09 23:59:29 BST 2015 Content ID: 127365 Revision: 10 Community: 1056"
  ]
}