{
  "company": "www.onelogin.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 71,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4630350194552529,
    "framing_surveillance": 0.0,
    "framing_market": 0.5369649805447471,
    "num_docs": 73
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 71
    }
  },
  "sample_docs": [
    "OneLogin for your workforce . For your customers . For your apps. Our Trusted Experience Platformâ\"¢ securely connects people and technology. Every user. Every app. Every device. workforce identity customer identity application security OneLogin for your workforce . For your customers . For your apps. Our Trusted Experience Platformâ\"¢ securely connects people and technology. Every user. Every app. Every device. Workforce Identity Empower and secure employees, contractors, and partners Single sign-on Multi-factor authentication Device trust Cloud directory User provisioning Explore workforce identity Customer Identity Build trusted customer experiences Authentication Multi-factor authentication APIs and toolkits Social login User management explore customer identity Application Security Protect your most valuable investments Office 365 Salesforce Workday Oracle EBS PeopleSoft And more… explore app security Empower and secure employees, contractors, and partners Build trusted customer experiences Protect your most valuable investments OneLogin Trusted Experience Platformâ\"¢: not your standard identity As organizations grow, the technology puzzle pieces multiply: more apps, users, and devices - all distributed across more locations. This complexity holds back digital transformation, slowing your business and leaving you vulnerable to unnecessary risk. You need more than just the standard Identity and Access Management (IAM) solution. With Vigilance AIâ\"¢, SmartFactor Authenticationâ\"¢, and the Shield browser extension, only OneLogin delivers the unparalleled protection and control you need with the simplicity users demand, so you can get back to business. EXPLORE OUR TRUSTED EXPERIENCE PLATFORMâ\"¢ OneLogin Trusted Experience Platformâ\"¢: not your standard identity As organizations grow, the technology puzzle pieces multiply: more apps, users, and devices - all distributed across more locations. This complexity holds back digital transformation, slowing your business and leaving you vulnerable to unnecessary risk. You need more than just the standard Identity and Access Management (IAM) solution. With Vigilance AIâ\"¢, SmartFactor Authenticationâ\"¢, and the Shield browser extension, only OneLogin delivers the unparalleled protection and control you need with the simplicity users demand, so you can get back to business. Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"The nature of our business demands that we make security a mission-critical priority. OneLogin's leading platform was the obvious solution to secure and manage all of our in-house enterprise applications.\" SEE HYPERLOOP ONE PRESS RELEASE Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"When you're accessing apps through OneLogin, you never have to do anything with your password. It's a huge time saver.\" SEE CASE STUDY Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"Compared with the other solutions, we found the OneLogin user experience and user interface to be more flexible.\" SEE CASE STUDY Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"The nature of our business demands that we make security a mission-critical priority. OneLogin's leading platform was the obvious solution to secure and manage all of our in-house enterprise applications.\" Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"When you're accessing apps through OneLogin, you never have to do anything with your password. It's a huge time saver.\" Over 2,500 enterprise customers globally trust OneLogin to secure their applications \"Compared with the other solutions, we found the OneLogin user experience and user interface to be more flexible.\" OneLogin ranks as a top Identity and Access Management brand When it comes to simplicity, reliability, and security, analysts and customers consistently rank OneLogin's access management solution in the top tier. OneLogin ranks as a top Identity and Access Management brand When it comes to simplicity, reliability, and security, analysts and customers consistently rank OneLogin's access management solution in the top tier. OneLogin is named a November 2019 Gartner Peer Insights Access Management. READ MORE OneLogin is Named G2 Leader & High Performer Based on Customer Reviews READ MORE OneLogin Recognized as a Strong Performer in The Forrester Waveâ\"¢: Identity-As-A-Service (IDaaS) For Enterprise SEE PRESS RELEASE OneLogin Appoints Marketing & Operations Leader Joanne Bradford to Board of Directors SEE PRESS RELEASE OneLogin's Brad Brooks Named Top Identity Management CEO of 2019 READ MORE OneLogin is named a November 2019 Gartner Peer Insights Access Management. OneLogin is Named G2 Leader & High Performer Based on Customer Reviews OneLogin Recognized as a Strong Performer in The Forrester Waveâ\"¢: Identity-As-A-Service (IDaaS) For Enterprise OneLogin Appoints Marketing & Operations Leader Joanne Bradford to Board of Directors OneLogin's Brad Brooks Named Top Identity Management CEO of 2019 Secure all your apps, users, and devices",
    "Select Video Type Video Types: Quick Links: Configuring Multi-Account AWS Access - Video Guide SEE MORE Secure Your Company From the SaaS Tsunami SEE MORE Securing Access with Modern Identity Solutions SEE MORE Extortionware: Your Privacy Problems Made Public Over the last decade, ransomware has increasingly become the most popular option for hackers to monetize the access t… April 22nd, 2021 / webinar Digital Transformation in Manufacturing: IT Leaders Perspectives As the technology landscape continues to evolve at break-neck speeds, the manufacturing industry is working diligentl… April 7th, 2021 / webinar Extortionware: How Cyberattacks are Evolving in 2021 In early 2020, the COVID-19 pandemic took the world by storm and forced many companies to rapidly move to a digital w… March 25th, 2021 / webinar Extortionware: The Next Evolution of Cyber Attacks As organisations moved to the cloud to support today's digital workforce, IT teams were tasked with securing remote… March 25th, 2021 / webinar Extortionware: Your Privacy Problems Made Public Over the last decade, ransomware has increasingly become the most popular option for hackers to monetize the access t… March 25th, 2021 / webinar Cybersecurity in a State of Disinformation 2020 was a uniquely disruptive year. The pandemic and rapid acceleration to remote work, social and political unrest … February 17th, 2021 / webinar Identity and Access Management Predictions 2021 Due to COVID-19, companies have had to change the way security teams, policies and their technology is managed. Adapt… February 9th, 2021 / webinar Protecting the UK and Europe from Cyber Security Aggressions Cyber Security threats know no borders and are constantly changing and evolving in complexity and maturity. No single… December 17th, 2020 / webinar Exposing Cyberespionage from Within the FBI Cybersecurity measures are frequently focused on threats from outside an organization rather than threats posed by un… December 14th, 2020 / webinar OneLogin overview: The Trusted Experience Platform Today, the proliferation of digital access has made the world more connected than ever before. With the availability … December 11th, 2020 / webinar Securing and Scaling Identity and Access in 2021 At the outset of the pandemic, businesses scrambled to stand up widespread work-from-home (WFH) arrangements. But mon… December 11th, 2020 / webinar Hacker Chat: Attacks and Threats in a Rapidly Remote World Listen in as ethical hackers discuss the current interesting attack techniques that are being utilized and how multi-… November 20th, 2020 / webinar WFH Stories: How the Evernote IT Team Prepared for Remote Work Making the transition to a fully remote workforce virtually overnight has proven challenging for many businesses, inc… November 20th, 2020 / webinar Future of Work Fireside Chat: The Evolution of the Cloud and Security in a Transitioning World Today's businesses need to rely on the cloud more than ever before. With the move to remote work and evolving consu… November 20th, 2020 / webinar To Pay or Not to Pay, That is the Ransomware Question In this Executive Panel discussion, Vanessa Pegueros discusses with her expert panelists the business impacts to orga… November 19th, 2020 / webinar From Workforce to CIAM: Building Secure Login Experiences in a Digital World Many businesses today grasp the importance of securing access to corporate applications, especially with a growing nu… November 19th, 2020 / webinar OneLogin on OneLogin: How We Use Automation Internally for Instant Incident Response With an ever-increasing focus on business continuity planning and reliability, how quickly your organization responds… November 19th, 2020 / webinar The Crisis of Connection: Addressing the Impact of Remote Work on Employee Connectivity and Business Results COVID-19 and the move to remote work has forever changed the way we operate as businesses. While many businesses had … November 19th, 2020 / webinar Security Nature over Security Nurture In this panel session, hear from business leaders as they discuss security culture and associated challenges related … November 19th, 2020 / webinar What Did We Learn? Scaling On-Prem and Cloud Based Applications for Remote Work In March, Employees all over the world were forced to work remotely for the unforeseeable future and because so many … November 19th, 2020 / webinar How orderbird Frees Employees to Deliver More Value to Customers by Streamlining Secure Access Every fast-growing company struggles to balance agility with adequate governance and controls when it comes to resour… November 19th, 2020 / webinar How to Communicate, Consume, and Integrate the Right Threat Intelligence into Your Business Strategy, Operations, and Tactics Each year, cyber threats increase, hackers become more intelligent, and businesses are more vulnerable. Unfortunately… November 19th, 2020 / webinar Channel Connect EMEA Following our annual user group conference in October, November 18th, 2020 / webinar Build the Best Enterprise Security & IT Strategy for 2021 As you begin your 2021 planning, make sure you don't cut corners to satisfy the fiscal efficiency demands from you… November 10th, 2020 / webinar Don't Cut Corners for Your 2021 IT/Security Plan Hold on to your hat because we're taking a ride with the fastest mode of ground transportation in the world - Virgi… November 10th, 2020 / webinar Webinar: How to Revolutionize Your MSP with IAM | OneLogin Identity Access Management (IAM) is a foundational technology for cloud, security and end user productivity. As organ… November 4th, 2020 / webinar Bug Bounties & Extortion Payments: CISO Accountability Earlier this summer a federal court delivered an indictment for obstruction of justice to a former chief security off… October 27th, 2020 / webinar Identity Crisis? Solved. We talk a lot about how passwords are obsolete, easy to breach, and generally just an old technology that should be r… September 30th, 2020 / webinar Security and the State of the 2020 Presidential Elections We surveyed voters across the nation to see where they stood. To understand the top concerns, we asked registered vot… September 30th, 2020 / webinar Webinar: OneLogin Overview: The Trusted Experience Platform Today, the proliferation of digital access has made the world more connected than ever before. With the availability … September 25th, 2020 / webinar What You Need to Know about Customer Identity Access Management In today's digital landscape, businesses collect lots of information from customers and are expected to not only se… August 25th, 2020 / webinar OneLogin Q2 2020 Product Release Watch the OneLogin Product Team teach about the new features and enhancements included in our Q2 2020 Product Release… July 14th, 2020 / webinar Best Practices for Managing Apple Devices in the Wild COVID-19 has had a huge impact on the global workforce - with more employees working remotely now than ever before. T… July 7th, 2020 / webinar State of Security and Trust During and Beyond the Turbulent Times: Security Leaders' Perspectives State of Security and Trust During and Beyond the Turbulent Times: Security Leaders' Perspectives June 17th, 2020 / webinar Customer Case Study: How Familia Dental Mobilized Their Remote Workforce with IAM at Break-Neck Speed Customer Case Study: How Familia Dental Mobilized Their Remote Workforce with IAM at Break-Neck Speed … June 17th, 2020 / webinar The Agile Workforce: How Business Leaders Are Adjusting and Planning for the Post COVID-19 World The Agile Workforce: How Business Leaders Are Adjusting and Planning for the Post COVID-19 World C… June 17th, 2020 / webinar Scaling with Modern Identity and Access Management to Meet the Challenges of Hybrid IT and Remote Workforce Scaling with Modern Identity and Access Management to Meet the Challenges of Hybrid IT and Remote Workforc… June 17th, 2020 / webinar How the Current Crisis is Accelerating Digital Transformation, a fireside chat with Robert Herjavec, Shark Tank Investor & Cybersecurity Expert How the Current Crisis is Accelerating Digital Transformation, a fireside chat with Robert Herjavec, Shark… June 17th, 2020 / webinar Enable your remote workforce with secured Identity and Access Management Enable Your Remote Workforce with Secured Identity and Access Management The situation of remote w… June 3rd, 2020 / webinar Secure VPN Authentication for the Remote Workforce Secure VPN Authentication for the Remote Workforce The digital workforce transformation is suddenl… May 28th, 2020 / webinar Protect Your Organization By Securing Remote Windows Users Protect Your Organization By Securing Remote Windows Users The digital workforce transformation is… May 14th, 2020 / webinar Securing Remote Learning Environments The coronavirus (COVID-19) pandemic has changed education drastically. Millions of students are no longer able to lea… May 8th, 2020 / webinar Cut through the hype surrounding AI and Identity Security May 5th, 2020 / webinar Secure Remote Access from Your Corporate Devices Secure Remote Access from Your Corporate Devices The rapid unfolding of today's global healt… April 28th, 2020 / webinar Leading a Remote Workforce Through Change The rapid unfolding of today's global health crisis, resulting quarantine, social distancing, and mandatory wor… April 23rd, 2020 / webinar Safeguard Remote Learning During COVID-19 The coronavirus (COVID-19) pandemic has heavily impacted our education system, leading to school closures and educati… April 21st, 2020 / webinar Empower your employees to work securely and efficiently from home Empower your employees to work securely and efficiently from home Over the past couple of decades … April 15th, 2020 / webinar Modern IDAAS at a Glance The best IDAAS solutions cover all kinds of users, all kinds of directories and allows both cloud and on-prem apps. A… February 13th, 2020 / webinar Building Trust into Digital Experiences with a Modern Identity Strategy The proliferation of digital access has made organizations more connected than ever before. Being digitally connected… February 11th, 2020 / webinar Automating the User Journey - Managing Joiners, Movers and Leavers Securely In this webinar you'll learn about: How user provisioning can decrease your employee on-boarding … November 28th, 2019 / webinar Sichere Digitalisierung durch ganzheitliches Access Management in der Cloud November 8th, 2019 / webinar Modern IDAAS at a Glance November 7th, 2019 / webinar Empower the Workplace using Modern Authentication Passwords typically lead the entryway for accessing a company's assets. However, with the increase in data breaches… October 29th, 2019 / webinar Azure or OneLogin? How to Best Protect Office 365 Data Does your company use Office 365 and need to manage it in a more automated and secure way? Join us for our webinar, A… October 24th, 2019 / webinar The Future of Multi-Factor Authentication Multi-Factor Authentication (MFA) is a security system that verifies a user's iden… September 19th, 2019 / webinar Securely Authenticate Your Window PCs without using Active Directory OneLogin Desktop provides a cloud-based alternative to Active Directory, which always … August 29th, 2019 / webinar From Password Self-Service to a Password-less Future If passwords are designed to improve security, why are they responsible for 81% of breaches? Passwords are re… August 22nd, 2019 / webinar Why Passwords are the Enemy of the Modern Enterprise If passwords are designed to improve security, why are they responsible for 81% of breaches? Passwords are re… August 21st, 2019 / webinar OneLogin Desktop Pro for Windows Come learn about OneLogin Desktop Pro for Windows! In this webinar, we will highlight key features and functionality … July 31st, 2019 / webinar How to Unify Access to On-Prem and Cloud Apps in the Enterprise Operating and managing applications in both on-prem and cloud environments isn't an easy task. And it's getting e… July 24th, 2019 / webinar The Evolving World of Privacy Laws The California Consumer Privacy Act goes into effect January 1, 2020. This expansive new law radically shifts compani… June 25th, 2019 / webinar OneLogin Spring '19 Release Product Webinar Come learn about the new features and enhancements included in the OneLogin Spring '19 Product Release! In this rel… June 5th, 2019 / webinar The 5 Challenges of Hybrid Reality Mobile, distributed workforces increase the number of access points, devices and platforms needed to achieve IT moder… May 7th, 2019 / webinar Dialing up Your Privileged User Strategy leveraging Single Sign On The list of assets privileged users need to access is ever-expanding in today's hybrid organizations - infrastructu… May 2nd, 2019 / webinar How to enable secure access to all cloud apps with DNS visibility and single sign on Companies are moving to the cloud to compete more effectively and employees are using an increasing number of SaaS cl… April 24th, 2019 / webinar Fireside Chat with OneLogin's CEO & CPO Get a sneak peak into the future of work, 2019 market trends, and what you and your company can expect from OneLogin … March 19th, 2019 / webinar Using Digital Identity as Your Primary Cyber Defense Weapon While compromised credentials cause 81% of data breaches, identity and access management spend represents only 8.5% o… January 31st, 2019 / webinar Accelerating Digital Transformation with BMC Remedyforce and OneLogin Together, BMC and OneLogin provides a best-in-class identity management solution for securing access and simplifying … January 22nd, 2019 / webinar How to Stay Zen During Your Security Journey to the Cloud Companies large and small are inundated with SaaS applications. Sanctioned apps help employees work. Unsanctioned app… December 13th, 2018 / webinar Protecting Your Business with Always On Smart Authentication Cybercriminals never stop, so obviously the notion of a static username and password won't suffice. Authenticat… November 28th, 2018 / webinar 3 Steps to Unleash the Power of ServiceNow for Governance and Risk Management Are you looking to strengthen identity governance and risk management for compliance initiatives like GDPR? Or to aut… August 29th, 2018 / webinar How to Kill VPNs While Ensuring Zero Trust Security Many enterprises rely on VPNs and other \"boxes†to enable application access for employees and contractors. These… August 1st, 2018 / webinar The 4 Current Threats Enterprises Can't Ignore The changing digital landscape of data and devices is creating a perfect storm of opportunity for cybercriminals. Ent… July 27th, 2018 / webinar Critical Steps to Deploying MFA at Enterprise Scale Without Regrets You know 81% of hacking-related breaches involve stolen or weak credentials (Verizon Data Breach Investigation Report… June 21st, 2018 / webinar The Emergence of Unified Access Management Today, the vast majority of organizations struggle to manage complex app environments made of a growing portfolio of … March 19th, 2018 / webinar Myths & Realities of MFA: The CISO Perspective Passwords alone won't cut it in the days of sophisticated phishing, spoofed email, and social engineering attacks. … December 5th, 2017 / webinar Driving Digital Transformation in Finance Through Single Sign-On and Content Management We are witnessing a huge wave of digital transformation in IT departments for all Financial Services companies. Insti… December 4th, 2017 / webinar Simplifying application access while reducing IT overhead with OneLogin Whether serving faculty and staff, current students, alumni, or prospective students, the IT department at University… November 7th, 2017 / webinar Hybrid Access Management for both On-Prem and Cloud Apps If you work with legacy Web Access Management (WAM) products, you know what a pain they are. Policy server sprawl. An… October 31st, 2017 / webinar HR-driven Identity Management with Stitch Fix and OneLogin Learn how to integrate your HRIS… September 1st, 2017 / webinar How to Harden Your MFA with Machine Learning For security teams who need to reduce the risk of account takeovers, static multi-factor… July 18th, 2017 / webinar How to Reduce Data Breaches with Cloud-Authenticated Laptops Your company may be overlooking a big security gap. Despite the rapid adoption of SaaS or web applications by enterpr… March 16th, 2017 / webinar Mastering AWS IAM: Using Automation to Secure Access For many companies, Amazon Web Services is the foundation of their software apps, containing valuable software code t… January 9th, 2017 / webinar How To Prepare for Intensifying Cyber Security Risks in 2017 Applications are under siege, and successful application attacks are the source of the biggest data loss. While there… December 7th, 2016 / webinar Secure Your Company in 2017: Four Key Initiatives Risk flows to the least-secure. Hackers will target what they see as the weakest link. Given the unrelenting security… November 8th, 2016 / webinar Protect Your Employees' Personally Identifiable Information Whether you manage HCM, IT or security at your company, you're responsible for employees' personal identi… October 27th, 2016 / webinar User Directory Unification October 21st, 2016 / Implementation Showcases Streamlined Identity and Access Management (IAM) For Education October 20th, 2016 / Implementation Showcases Simplify Remedyforce User Management with IDaaS As a Service Desk Manager, you need to deliver fast yet secure support to keep users happy and the business running. … October 13th, 2016 / webinar Prevent Laptop Security Breaches, No Active Directory Required It only takes one unsecured laptop for a security breach to occur. OneLogin Desktop can fix that. Cloud-first compani… September 22nd, 2016 / webinar Secure Your Company from the SaaS Tsunami According to Gartner, a staggering 600 to 1000 SaaS apps are in use at a typical company, yet IT only knows about &am… August 22nd, 2016 / webinar Extending Active Directory to the Cloud August 3rd, 2016 / Implementation Showcases HR-Driven Identity Automation August 2nd, 2016 / Implementation Showcases Streamlined User Mapping with Flexible Rules Engine August 1st, 2016 / Implementation Showcases Simplify Your G Suite Collaboration and Management with IDaaS Attempting to roll out G Suite (previously Google Apps) to the right users with the right access often results in ove… July 24th, 2016 / webinar Fast Track Your Office 365 Deployment and Beyond Deploying and managing safe access to Office 365 is not simple, fast, or pleasant. It's your job to get the mos… July 19th, 2016 / webinar IDaaS: Modernize Your IAM in the Cloud As an IT leader, it's the norm: Your team can spend months setting up a new business application and spend anot… July 12th, 2016 / webinar Supporting Legacy Infrastructure on the Way to the Cloud Join featured speaker Forrester Principal Analyst Andras Cser and OneLogin Director of Sales Engineering Mario Tarabb… June 15th, 2016 / webinar Securing Access to On-prem & SaaS Environments with Cloud-based IAM Despite the rapid enterprise adoption of SaaS, many organizations still rely on a hybrid mix of on-premise and SaaS a… May 3rd, 2016 / webinar 5 Steps to Scalable Authentication with Kaplan's IT Leadership If you're challenged by teams across your organization constantly adopting new applications and chartered to qu… April 28th, 2016 / webinar Stop Hackers with Integrated CASB & IDaaS Security Your organization has turned to cloud platforms and applications (including SaaS, IaaS, PaaS, and even IDaaS) to meet… April 27th, 2016 / webinar Identity Access Management 101 Join Samer Baroudi and Rob Capozzi from OneLogin, the leader in enterprise Identity and Access Management, for an IAM… August 27th, 2015 / webinar The Future of Enterprise Identity Management Join guest Merritt Maxim, Senior Analyst at Forrester Research, and David Meyer, VP Product at OneLogin, as they disc… July 27th, 2015 / webinar Integrated Cloud Security Join us in this session where we explore key trends, challenges and solutions from OneLogin and Dropbox, and how real… July 23rd, 2015 / webinar Making your Cloud Initiatives Successful Watch an overview and live demo showcasing must-have capabilities to bridge AD and your SaaS applications, including:… June 24th, 2015 / webinar Cloud Identity and Extending Active Directory Off-Premises Join Chip Epps and Michael Yee from OneLogin for a compelling demonstration on how to easily extend Active Directory … May 28th, 2015 / webinar How to Automate User Provisioning Cloud app adoption continues to grow within the enterprise, delivering greater functionality to users, increasing the… May 14th, 2015 / webinar How to Take Cloud Access Control to the Next Level Join OneLogin, the leader in enterprise identity and access management to learn: Why MFA eliminates a ma… April 14th, 2015 / webinar Is Mobile Access to Cloud Apps Putting Your Company at Risk? Join guest Tyler Shields of Forrester Research, Inc. and David Meyer from OneLogin for a discussion on: March 28th, 2015 / webinar Securing Apps & Data in the Cloud & On-Premises with OneLogin & Duo Security Join OneLogin, the leader in enterprise identity management, and Duo Security, the leader in two-factor authenticatio… March 14th, 2015 / webinar Compliance in the Era of Cloud Join OneLogin, the leader in enterprise identity management for a lively, informative webinar and live demonstration … February 28th, 2015 / webinar How to Automate User Provisioning Watch a compelling 30-minute demonstration to see how you can efficiently onboard and offboard employees using OneLog… February 14th, 2015 / webinar Desktop SSO - How to Leverage Windows Auth for SaaS Apps A quick 30-minute live demo to see how OneLogin can: Eliminates redundant login requirements by leveragi… January 28th, 2015 / webinar How to Extend AD to the Cloud How do you extend Active Directory to your cloud apps without all the time and high costs? Here's a qui… January 14th, 2015 / webinar 5 Steps for Harnessing Shadow IT 5 Steps for Harnessing Shadow IT Business users are taking advantage of cloud apps to stor… December 28th, 2014 / webinar Secure File Transfer in the Cloud with OneLogin We will show you how to: Securely enable MOVEit in the cloud Easily manage user identities thro… December 14th, 2014 / webinar OneLogin for Office 365 November 28th, 2014 / webinar Best Practices for Optimizing Your Migration to Office 365 Watch this On-Demand OneLogin webinar featuring Forrester's TJ Keitt and OneLogin's David Meyer to learn the … November 14th, 2014 / webinar Integrate Dropbox with Active Directory & LDAP Join Deanna Dong, Account Executive at Dropbox and Mario Tarabbia, Director of Business Development at OneLogin, for … October 28th, 2014 / webinar OneLogin & Strong Authentication Methods October 14th, 2014 / webinar Achieve Single Sign-on (SSO) and Active Directory / LDAP Integration for New Relic Join Bill Fried, Sales Engineer at New Relic and Mario Tarabbia, Director of Business Development at OneLogin, for a … September 14th, 2014 / webinar Single Sign-On & Active Directory / LDAP Integration for Zendesk Join Eric Shen, Partner Integration Manager for Zendesk, and Mario Tarabbia, Director of Business Development at OneL… August 28th, 2014 / webinar Single Sign-On & AD / LDAP Integration for BMC Remedyforce Join Erin Avery, Remedyforce Solutions Marketing Manager at BMC Software, and Mario Tarabbia, Director of Business De… August 14th, 2014 / webinar Integrate Hightail with AD / LDAP & Enforce MFA Join Mike Nakamura, Director of Sales Engineering at Hightail and Mario Tarabbia, Director of Business Development at… July 28th, 2014 / webinar Integrate AD / LDAP to Samanage, Sync Users in Real-Time, and SSO Join Oz Merchant, Director of Sales at Samanage and Mario Tarabbia, Director of Business Development at OneLogin, for… July 14th, 2014 / webinar Integrate IdeaScale with Active Directory & LDAP Join Audrey Zuro, Director of New Business at IdeaScale, an innovation management partner and Mario Tarabbia, Directo… June 28th, 2014 / webinar Integrate PlayVox with Active Directory & LDAP Join Nicole Helgeson, Inbound Marketing Manager at PlayVox, and Mario Tarabbia, Director of Business Development at O… June 14th, 2014 / webinar OneLogin Product Demo: Onelogin for Desktop SSO May 28th, 2014 / webinar Use SAML with Syncplicity to Automate User Management & SSO Join Leonard Chung, Chief Product Strategist at Syncplicity, and Mario Tarabbia, Director of Business Development at … May 14th, 2014 / webinar Integrate LiveHive with AD & LDAP & Extend SSO to All Your Workspaces Join Jon Wang, Business Development Manager at LiveHive, and Mario Tarabbia, Director of Business Development at OneL… April 28th, 2014 / webinar Connect AD or LDAP to CloudPassage & Enable SSO Join Ryan Thomas, Senior Product Manager at CloudPassage, and Mario Tarabbia, Director of Business Development at One… April 14th, 2014 / webinar Identity and Integration: The Key Ingredients to SaaS Success Key drivers for SaaS adoption are lower costs, speed to value, an increasingly mobile workforce and simplicity. Yet c… March 28th, 2014 / webinar Extending Identity to the Cloud: ADFS vs. Azure AD vs. OneLogin Learn the best ways to integrate your directory infrastructure with cloud applications like Office… March 14th, 2014 / webinar Zero Trust Identity Is Not A Zero-Sum Game Many enterprises are flinging themselves headlong into the cloud, and IT security and identity professionals are tryi… February 28th, 2014 / webinar Integrate Parature with Active Directory & LDAP Join John Seed, Marketing Director at Parature, and Mario Tarabbia, Director of Business Development at OneLogin, for… February 14th, 2014 / webinar Integrate Huddle with Active Directory & LDAP Join Andy McLoughlin, EVP of Strategy at Huddle, and Mario Tarabbia, Director of Business Development at OneLogin, fo… January 28th, 2014 / webinar Smart Hooks: Pre-Authentication Hook Demo demos Smart Hooks: User Migration Hook Demo demos How to Setup SSO for Deputy Using SAML demos How to Configure Cloud RADIUS for Meraki WiFi demos How to Provision Active Directory Security Groups into O365 demos Demo: OneLogin and API Gateway Integrations demos Demo: Add Users to OneLogin Cloud Directory demos OneLogin Demo: Authorization Code Grant Using PKCE (Proof Key for Code Exchange) demos OneLogin Demo: Remote Desktop Gateway (RDG) Server Install & User Experience demos SOTI & OneLogin demos OneLogin Hydraboost demos OneLogin: AWS Control Tower demos OneLogin: Smart Access Demo demos Dropbox SSO - End User Experience demos OneLogin: Smart MFA demos Watch as PacifiCorp's Sourav Sen, IT customer service, shares how moving their 2+ million customers to OneLogin was smooth and successful Customer Spotlights See what Digicel, a complete communications provider, has to say about their partnership with OneLogin Customer Spotlights OneLogin: Smart Flows demos OneLogin Demo: Setup Dropbox SSO demos Evernote grows with a one-stop shop portal, gaining access to all their apps with ease Customer Spotlights Set Up OneLogin Protect: Demo Video demos Stitch Fix securely authenticates their growing number of applications with OneLogin's end-to-end solution Customer Spotlights OneLogin SmartFactor Authentication: Blacklist Countries Using APIs demos Virgin Hyperloop One secures intellectual properties with adaptive multi-factor authentication Customer Spotlights OneLogin: Password Reset Flow demos Customer Focused - OneLogin Users Share Their Experience Customer Spotlights AWS IAM: Multi-Account, Multi-Role Provisioning demos Secure RADIUS for Meraki demos Virtual LDAP Directory Service demos Steelcase uses one easy way to authenticate users Customer Spotlights OneLogin Desktop for Mac demos Real-Time Active Directory Sync demos San José Unified Integrates Active Directory, Box Customer Spotlights Easy Office 365 Federation with OneLogin One Click demos Aspire boosts productivity and data security with OneLogin Customer Spotlights Dell Services relies on OneLogin for flexible provisioning Customer Spotlights SOTI Moves to Cloud for Anywhere, Anytime Access Customer Spotlights Whitby School empowers teachers with one set of user credentials Customer Spotlights Configuring Multi-Account AWS Access - Video Guide SEE MORE Secure Your Company From the SaaS Tsunami SEE MORE Securing Access with Modern Identity Solutions SEE MORE Extortionware: Your Privacy Problems Made Public Over the last decade, ransomware has increasingly become the most popular option for hackers to monetize the access t… April 22nd, 2021 / webinar Digital Transformation in Manufacturing: IT Leaders Perspectives As the technology landscape continues to evolve at break-neck speeds, the manufacturing industry is working diligentl… April 7th, 2021 / webinar Extortionware: How Cyberattacks are Evolving in 2021 In early 2020, the COVID-19 pandemic took the world by storm and forced many companies to rapidly move to a digital w… March 25th, 2021 / webinar Extortionware: The Next Evolution of Cyber Attacks As organisations moved to the cloud to support today's digital workforce, IT teams were tasked with securing remote… March 25th, 2021 / webinar Extortionware: Your Privacy Problems Made Public Over the last decade, ransomware has increasingly become the most popular option for hackers to monetize the access t… March 25th, 2021 / webinar Cybersecurity in a State of Disinformation 2020 was a uniquely disruptive year. The pandemic and rapid acceleration to remote work, social and political unrest … February 17th, 2021 / webinar Identity and Access Management Predictions 2021 Due to COVID-19, companies have had to change the way security teams, policies and their technology is managed. Adapt… February 9th, 2021 / webinar Protecting the UK and Europe from Cyber Security Aggressions Cyber Security threats know no borders and are constantly changing and evolving in complexity and maturity. No single… December 17th, 2020 / webinar Exposing Cyberespionage from Within the FBI Cybersecurity measures are frequently focused on threats from outside an organization rather than threats posed by un… December 14th, 2020 / webinar OneLogin overview: The Trusted Experience Platform Today, the proliferation of digital access has made the world more connected than ever before. With the availability … December 11th, 2020 / webinar Securing and Scaling Identity and Access in 2021 At the outset of the pandemic, businesses scrambled to stand up widespread work-from-home (WFH) arrangements. But mon… December 11th, 2020 / webinar Hacker Chat: Attacks and Threats in a Rapidly Remote World Listen in as ethical hackers discuss the current interesting attack techniques that are being utilized and how multi-… November 20th, 2020 / webinar WFH Stories: How the Evernote IT Team Prepared for Remote Work Making the transition to a fully remote workforce virtually overnight has proven challenging for many businesses, inc… November 20th, 2020 / webinar Future of Work Fireside Chat: The Evolution of the Cloud and Security in a Transitioning World Today's businesses need to rely on the cloud more than ever before. With the move to remote work and evolving consu… November 20th, 2020 / webinar To Pay or Not to Pay, That is the Ransomware Question In this Executive Panel discussion, Vanessa Pegueros discusses with her expert panelists the business impacts to orga… November 19th, 2020 / webinar From Workforce to CIAM: Building Secure Login Experiences in a Digital World Many businesses today grasp the importance of securing access to corporate applications, especially with a growing nu… November 19th, 2020 / webinar OneLogin on OneLogin: How We Use Automation Internally for Instant Incident Response With an ever-increasing focus on business continuity planning and reliability, how quickly your organization responds… November 19th, 2020 / webinar The Crisis of Connection: Addressing the Impact of Remote Work on Employee Connectivity and Business Results COVID-19 and the move to remote work has forever changed the way we operate as businesses. While many businesses had … November 19th, 2020 / webinar Security Nature over Security Nurture In this panel session, hear from business leaders as they discuss security culture and associated challenges related … November 19th, 2020 / webinar What Did We Learn? Scaling On-Prem and Cloud Based Applications for Remote Work In March, Employees all over the world were forced to work remotely for the unforeseeable future and because so many … November 19th, 2020 / webinar How orderbird Frees Employees to Deliver More Value to Customers by Streamlining Secure Access Every fast-growing company struggles to balance agility with adequate governance and controls when it comes to resour… November 19th, 2020 / webinar How to Communicate, Consume, and Integrate the Right Threat Intelligence into Your Business Strategy, Operations, and Tactics Each year, cyber threats increase, hackers become more intelligent, and businesses are more vulnerable. Unfortunately… November 19th, 2020 / webinar Following our annual user group conference in October, November 18th, 2020 / webinar Build the Best Enterprise Security & IT Strategy for 2021 As you begin your 2021 planning, make sure you don't cut corners to satisfy the fiscal efficiency demands from you… November 10th, 2020 / webinar Don't Cut Corners for Your 2021 IT/Security Plan Hold on to your hat because we're taking a ride with the fastest mode of ground transportation in the world - Virgi… November 10th, 2020 / webinar Webinar: How to Revolutionize Your MSP with IAM | OneLogin Identity Access Management (IAM) is a foundational technology for cloud, security and end user productivity. As organ… November 4th, 2020 / webinar Bug Bounties & Extortion Payments: CISO Accountability Earlier this summer a federal court delivered an indictment for obstruction of justice to a former chief security off… October 27th, 2020 / webinar We talk a lot about how passwords are obsolete, easy to breach, and generally just an old technology that should be r… September 30th, 2020 / webinar Security and the State of the 2020 Presidential Elections We surveyed voters across the nation to see where they stood. To understand the top concerns, we asked registered vot… September 30th, 2020 / webinar Webinar: OneLogin Overview: The Trusted Experience Platform Today, the proliferation of digital access has made the world more connected than ever before. With the availability … September 25th, 2020 / webinar What You Need to Know about Customer Identity Access Management In today's digital landscape, businesses collect lots of information from customers and are expected to not only se… August 25th, 2020 / webinar OneLogin Q2 2020 Product Release Watch the OneLogin Product Team teach about the new features and enhancements included in our Q2 2020 Product Release… July 14th, 2020 / webinar Best Practices for Managing Apple Devices in the Wild COVID-19 has had a huge impact on the global workforce - with more employees working remotely now than ever before. T… July 7th, 2020 / webinar State of Security and Trust During and Beyond the Turbulent Times: Security Leaders' Perspectives State of Security and Trust During and Beyond the Turbulent Times: Security Leaders' Perspectives June 17th, 2020 / webinar Customer Case Study: How Familia Dental Mobilized Their Remote Workforce with IAM at Break-Neck Speed Customer Case Study: How Familia Dental Mobilized Their Remote Workforce with IAM at Break-Neck Speed … June 17th, 2020 / webinar The Agile Workforce: How Business Leaders Are Adjusting and Planning for the Post COVID-19 World The Agile Workforce: How Business Leaders Are Adjusting and Planning for the Post COVID-19 World C… June 17th, 2020 / webinar Scaling with Modern Identity and Access Management to Meet the Challenges of Hybrid IT and Remote Workforce Scaling with Modern Identity and Access Management to Meet the Challenges of Hybrid IT and Remote Workforc… June 17th, 2020 / webinar How the Current Crisis is Accelerating Digital Transformation, a fireside chat with Robert Herjavec, Shark Tank Investor & Cybersecurity Expert How the Current Crisis is Accelerating Digital Transformation, a fireside chat with Robert Herjavec, Shark… June 17th, 2020 / webinar Enable your remote workforce with secured Identity and Access Management Enable Your Remote Workforce with Secured Identity and Access Management The situation of remote w… June 3rd, 2020 / webinar Secure VPN Authentication for the Remote Workforce Secure VPN Authentication for the Remote Workforce The digital workforce transformation is suddenl… May 28th, 2020 / webinar Protect Your Organization By Securing Remote Windows Users Protect Your Organization By Securing Remote Windows Users The digital workforce transformation is… May 14th, 2020 / webinar Securing Remote Learning Environments The coronavirus (COVID-19) pandemic has changed education drastically. Millions of students are no longer able to lea… May 8th, 2020 / webinar Cut through the hype surrounding AI and Identity Security May 5th, 2020 / webinar Secure Remote Access from Your Corporate Devices Secure Remote Access from Your Corporate Devices The rapid unfolding of today's global healt… April 28th, 2020 / webinar Leading a Remote Workforce Through Change The rapid unfolding of today's global health crisis, resulting quarantine, social distancing, and mandatory wor… April 23rd, 2020 / webinar Safeguard Remote Learning During COVID-19 The coronavirus (COVID-19) pandemic has heavily impacted our education system, leading to school closures and educati… April 21st, 2020 / webinar Empower your employees to work securely and efficiently from home Empower your employees to work securely and efficiently from home Over the past couple of decades … April 15th, 2020 / webinar Modern IDAAS at a Glance The best IDAAS solutions cover all kinds of users, all kinds of directories and allows both cloud and on-prem apps. A… February 13th, 2020 / webinar Building Trust into Digital Experiences with a Modern Identity Strategy The proliferation of digital access has made organizations more connected than ever before. Being digitally connected… February 11th, 2020 / webinar Automating the User Journey - Managing Joiners, Movers and Leavers Securely In this webinar you'll learn about: How user provisioning can decrease your employee on-boarding … November 28th, 2019 / webinar Sichere Digitalisierung durch ganzheitliches Access Management in der Cloud November 8th, 2019 / webinar Modern IDAAS at a Glance November 7th, 2019 / webinar Empower the Workplace using Modern Authentication Passwords typically lead the entryway for accessing a company's assets. However, with the increase in data breaches… October 29th, 2019 / webinar Azure or OneLogin? How to Best Protect Office 365 Data Does your company use Office 365 and need to manage it in a more automated and secure way? Join us for our webinar, A… October 24th, 2019 / webinar The Future of Multi-Factor Authentication Multi-Factor Authentication (MFA) is a security system that verifies a user's iden… September 19th, 2019 / webinar Securely Authenticate Your Window PCs without using Active Directory OneLogin Desktop provides a cloud-based alternative to Active Directory, which always … August 29th, 2019 / webinar From Password Self-Service to a Password-less Future If passwords are designed to improve security, why are they responsible for 81% of breaches? Passwords are re… August 22nd, 2019 / webinar Why Passwords are the Enemy of the Modern Enterprise If passwords are designed to improve security, why are they responsible for 81% of breaches? Passwords are re… August 21st, 2019 / webinar OneLogin Desktop Pro for Windows Come learn about OneLogin Desktop Pro for Windows! In this webinar, we will highlight key features and functionality … July 31st, 2019 / webinar How to Unify Access to On-Prem and Cloud Apps in the Enterprise Operating and managing applications in both on-prem and cloud environments isn't an easy task. And it's getting e… July 24th, 2019 / webinar The Evolving World of Privacy Laws The California Consumer Privacy Act goes into effect January 1, 2020. This expansive new law radically shifts compani… June 25th, 2019 / webinar OneLogin Spring '19 Release Product Webinar Come learn about the new features and enhancements included in the OneLogin Spring '19 Product Release! In this rel… June 5th, 2019 / webinar The 5 Challenges of Hybrid Reality Mobile, distributed workforces increase the number of access points, devices and platforms needed to achieve IT moder… May 7th, 2019 / webinar Dialing up Your Privileged User Strategy leveraging Single Sign On The list of assets privileged users need to access is ever-expanding in today's hybrid organizations - infrastructu… May 2nd, 2019 / webinar How to enable secure access to all cloud apps with DNS visibility and single sign on Companies are moving to the cloud to compete more effectively and employees are using an increasing number of SaaS cl… April 24th, 2019 / webinar Fireside Chat with OneLogin's CEO & CPO Get a sneak peak into the future of work, 2019 market trends, and what you and your company can expect from OneLogin … March 19th, 2019 / webinar Using Digital Identity as Your Primary Cyber Defense Weapon While compromised credentials cause 81% of data breaches, identity and access management spend represents only 8.5% o… January 31st, 2019 / webinar Accelerating Digital Transformation with BMC Remedyforce and OneLogin Together, BMC and OneLogin provides a best-in-class identity management solution for securing access and simplifying … January 22nd, 2019 / webinar How to Stay Zen During Your Security Journey to the Cloud Companies large and small are inundated with SaaS applications. Sanctioned apps help employees work. Unsanctioned app… December 13th, 2018 / webinar Protecting Your Business with Always On Smart Authentication Cybercriminals never stop, so obviously the notion of a static username and password won't suffice. Authenticat… November 28th, 2018 / webinar 3 Steps to Unleash the Power of ServiceNow for Governance and Risk Management Are you looking to strengthen identity governance and risk management for compliance initiatives like GDPR? Or to aut… August 29th, 2018 / webinar How to Kill VPNs While Ensuring Zero Trust Security Many enterprises rely on VPNs and other \"boxes†to enable application access for employees and contractors. These… August 1st, 2018 / webinar The 4 Current Threats Enterprises Can't Ignore The changing digital landscape of data and devices is creating a perfect storm of opportunity for cybercriminals. Ent… July 27th, 2018 / webinar Critical Steps to Deploying MFA at Enterprise Scale Without Regrets You know 81% of hacking-related breaches involve stolen or weak credentials (Verizon Data Breach Investigation Report… June 21st, 2018 / webinar The Emergence of Unified Access Management Today, the vast majority of organizations struggle to manage complex app environments made of a growing portfolio of … March 19th, 2018 / webinar Myths & Realities of MFA: The CISO Perspective Passwords alone won't cut it in the days of sophisticated phishing, spoofed email, and social engineering attacks. … December 5th, 2017 / webinar Driving Digital Transformation in Finance Through Single Sign-On and Content Management We are witnessing a huge wave of digital transformation in IT departments for all Financial Services companies. Insti… December 4th, 2017 / webinar Simplifying application access while reducing IT overhead with OneLogin Whether serving faculty and staff, current students, alumni, or prospective students, the IT department at University… November 7th, 2017 / webinar Hybrid Access Management for both On-Prem and Cloud Apps If you work with legacy Web Access Management (WAM) products, you know what a pain they are. Policy server sprawl. An… October 31st, 2017 / webinar HR-driven Identity Management with Stitch Fix and OneLogin Learn how to integrate your HRIS… September 1st, 2017 / webinar How to Harden Your MFA with Machine Learning For security teams who need to reduce the risk of account takeovers, static multi-factor… July 18th, 2017 / webinar How to Reduce Data Breaches with Cloud-Authenticated Laptops Your company may be overlooking a big security gap. Despite the rapid adoption of SaaS or web applications by enterpr… March 16th, 2017 / webinar Mastering AWS IAM: Using Automation to Secure Access For many companies, Amazon Web Services is the foundation of their software apps, containing valuable software code t… January 9th, 2017 / webinar How To Prepare for Intensifying Cyber Security Risks in 2017 Applications are under siege, and successful application attacks are the source of the biggest data loss. While there… December 7th, 2016 / webinar Secure Your Company in 2017: Four Key Initiatives Risk flows to the least-secure. Hackers will target what they see as the weakest link. Given the unrelenting security… November 8th, 2016 / webinar Protect Your Employees' Personally Identifiable Information Whether you manage HCM, IT or security at your company, you're responsible for employees' personal identi… October 27th, 2016 / webinar October 21st, 2016 / Implementation Showcases Streamlined Identity and Access Management (IAM) For Education October 20th, 2016 / Implementation Showcases Simplify Remedyforce User Management with IDaaS As a Service Desk Manager, you need to deliver fast yet secure support to keep users happy and the business running. … October 13th, 2016 / webinar Prevent Laptop Security Breaches, No Active Directory Required It only takes one unsecured laptop for a security breach to occur. OneLogin Desktop can fix that. Cloud-first compani… September 22nd, 2016 / webinar Secure Your Company from the SaaS Tsunami According to Gartner, a staggering 600 to 1000 SaaS apps are in use at a typical company, yet IT only knows about &am… August 22nd, 2016 / webinar Extending Active Directory to the Cloud August 3rd, 2016 / Implementation Showcases August 2nd, 2016 / Implementation Showcases Streamlined User Mapping with Flexible Rules Engine August 1st, 2016 / Implementation Showcases Simplify Your G Suite Collaboration and Management with IDaaS Attempting to roll out G Suite (previously Google Apps) to the right users with the right access often results in ove… July 24th, 2016 / webinar Fast Track Your Office 365 Deployment and Beyond Deploying and managing safe access to Office 365 is not simple, fast, or pleasant. It's your job to get the mos… July 19th, 2016 / webinar IDaaS: Modernize Your IAM in the Cloud As an IT leader, it's the norm: Your team can spend months setting up a new business application and spend anot… July 12th, 2016 / webinar Supporting Legacy Infrastructure on the Way to the Cloud Join featured speaker Forrester Principal Analyst Andras Cser and OneLogin Director of Sales Engineering Mario Tarabb… June 15th, 2016 / webinar Securing Access to On-prem & SaaS Environments with Cloud-based IAM Despite the rapid enterprise adoption of SaaS, many organizations still rely on a hybrid mix of on-premise and SaaS a… May 3rd, 2016 / webinar 5 Steps to Scalable Authentication with Kaplan's IT Leadership If you're challenged by teams across your organization constantly adopting new applications and chartered to qu… April 28th, 2016 / webinar Stop Hackers with Integrated CASB & IDaaS Security Your organization has turned to cloud platforms and applications (including SaaS, IaaS, PaaS, and even IDaaS) to meet… April 27th, 2016 / webinar Identity Access Management 101 Join Samer Baroudi and Rob Capozzi from OneLogin, the leader in enterprise Identity and Access Management, for an IAM… August 27th, 2015 / webinar The Future of Enterprise Identity Management Join guest Merritt Maxim, Senior Analyst at Forrester Research, and David Meyer, VP Product at OneLogin, as they disc… July 27th, 2015 / webinar Join us in this session where we explore key trends, challenges and solutions from OneLogin and Dropbox, and how real… July 23rd, 2015 / webinar Making your Cloud Initiatives Successful Watch an overview and live demo showcasing must-have capabilities to bridge AD and your SaaS applications, including:… June 24th, 2015 / webinar Cloud Identity and Extending Active Directory Off-Premises Join Chip Epps and Michael Yee from OneLogin for a compelling demonstration on how to easily extend Active Directory … May 28th, 2015 / webinar How to Automate User Provisioning Cloud app adoption continues to grow within the enterprise, delivering greater functionality to users, increasing the… May 14th, 2015 / webinar How to Take Cloud Access Control to the Next Level Join OneLogin, the leader in enterprise identity and access management to learn: Why MFA eliminates a ma… April 14th, 2015 / webinar Is Mobile Access to Cloud Apps Putting Your Company at Risk? Join guest Tyler Shields of Forrester Research, Inc. and David Meyer from OneLogin for a discussion on: March 28th, 2015 / webinar Securing Apps & Data in the Cloud & On-Premises with OneLogin & Duo Security Join OneLogin, the leader in enterprise identity management, and Duo Security, the leader in two-factor authenticatio… March 14th, 2015 / webinar Compliance in the Era of Cloud Join OneLogin, the leader in enterprise identity management for a lively, informative webinar and live demonstration … February 28th, 2015 / webinar How to Automate User Provisioning Watch a compelling 30-minute demonstration to see how you can efficiently onboard and offboard employees using OneLog… February 14th, 2015 / webinar Desktop SSO - How to Leverage Windows Auth for SaaS Apps A quick 30-minute live demo to see how OneLogin can: Eliminates redundant login requirements by leveragi… January 28th, 2015 / webinar How to Extend AD to the Cloud How do you extend Active Directory to your cloud apps without all the time and high costs? Here's a qui… January 14th, 2015 / webinar 5 Steps for Harnessing Shadow IT 5 Steps for Harnessing Shadow IT Business users are taking advantage of cloud apps to stor… December 28th, 2014 / webinar Secure File Transfer in the Cloud with OneLogin We will show you how to: Securely enable MOVEit in the cloud Easily manage user identities thro… December 14th, 2014 / webinar OneLogin for Office 365 November 28th, 2014 / webinar Best Practices for Optimizing Your Migration to Office 365 Watch this On-Demand OneLogin webinar featuring Forrester's TJ Keitt and OneLogin's David Meyer to learn the … November 14th, 2014 / webinar Integrate Dropbox with Active Directory & LDAP Join Deanna Dong, Account Executive at Dropbox and Mario Tarabbia, Director of Business Development at OneLogin, for … October 28th, 2014 / webinar OneLogin & Strong Authentication Methods October 14th, 2014 / webinar Achieve Single Sign-on (SSO) and Active Directory / LDAP Integration for New Relic Join Bill Fried, Sales Engineer at New Relic and Mario Tarabbia, Director of Business Development at OneLogin, for a … September 14th, 2014 / webinar Single Sign-On & Active Directory / LDAP Integration for Zendesk Join Eric Shen, Partner Integration Manager for Zendesk, and Mario Tarabbia, Director of Business Development at OneL… August 28th, 2014 / webinar Single Sign-On & AD / LDAP Integration for BMC Remedyforce Join Erin Avery, Remedyforce Solutions Marketing Manager at BMC Software, and Mario Tarabbia, Director of Business De… August 14th, 2014 / webinar Integrate Hightail with AD / LDAP & Enforce MFA Join Mike Nakamura, Director of Sales Engineering at Hightail and Mario Tarabbia, Director of Business Development at… July 28th, 2014 / webinar Integrate AD / LDAP to Samanage, Sync Users in Real-Time, and SSO Join Oz Merchant, Director of Sales at Samanage and Mario Tarabbia, Director of Business Development at OneLogin, for… July 14th, 2014 / webinar Integrate IdeaScale with Active Directory & LDAP Join Audrey Zuro, Director of New Business at IdeaScale, an innovation management partner and Mario Tarabbia, Directo… June 28th, 2014 / webinar Integrate PlayVox with Active Directory & LDAP Join Nicole Helgeson, Inbound Marketing Manager at PlayVox, and Mario Tarabbia, Director of Business Development at O… June 14th, 2014 / webinar OneLogin Product Demo: Onelogin for Desktop SSO May 28th, 2014 / webinar Use SAML with Syncplicity to Automate User Management & SSO Join Leonard Chung, Chief Product Strategist at Syncplicity, and Mario Tarabbia, Director of Business Development at … May 14th, 2014 / webinar Integrate LiveHive with AD & LDAP & Extend SSO to All Your Workspaces Join Jon Wang, Business Development Manager at LiveHive, and Mario Tarabbia, Director of Business Development at OneL… April 28th, 2014 / webinar Connect AD or LDAP to CloudPassage & Enable SSO Join Ryan Thomas, Senior Product Manager at CloudPassage, and Mario Tarabbia, Director of Business Development at One… April 14th, 2014 / webinar Identity and Integration: The Key Ingredients to SaaS Success Key drivers for SaaS adoption are lower costs, speed to value, an increasingly mobile workforce and simplicity. Yet c… March 28th, 2014 / webinar Extending Identity to the Cloud: ADFS vs. Azure AD vs. OneLogin Learn the best ways to integrate your directory infrastructure with cloud applications like Office… March 14th, 2014 / webinar Zero Trust Identity Is Not A Zero-Sum Game Many enterprises are flinging themselves headlong into the cloud, and IT security and identity professionals are tryi… February 28th, 2014 / webinar Integrate Parature with Active Directory & LDAP Join John Seed, Marketing Director at Parature, and Mario Tarabbia, Director of Business Development at OneLogin, for… February 14th, 2014 / webinar Integrate Huddle with Active Directory & LDAP Join Andy McLoughlin, EVP of Strategy at Huddle, and Mario Tarabbia, Director of Business Development at OneLogin, fo… January 28th, 2014 / webinar Smart Hooks: Pre-Authentication Hook Demo Smart Hooks: User Migration Hook Demo How to Setup SSO for Deputy Using SAML How to Configure Cloud RADIUS for Meraki WiFi How to Provision Active Directory Security Groups into O365 Demo: OneLogin and API Gateway Integrations Demo: Add Users to OneLogin Cloud Directory OneLogin Demo: Authorization Code Grant Using PKCE (Proof Key for Code Exchange) OneLogin Demo: Remote Desktop Gateway (RDG) Server Install & User Experience OneLogin: AWS Control Tower OneLogin: Smart Access Demo Dropbox SSO - End User Experience Watch as PacifiCorp's Sourav Sen, IT customer service, shares how moving their 2+ million customers to OneLogin was smooth and successful See what Digicel, a complete communications provider, has to say about their partnership with OneLogin OneLogin Demo: Setup Dropbox SSO Evernote grows with a one-stop shop portal, gaining access to all their apps with ease Set Up OneLogin Protect: Demo Video Stitch Fix securely authenticates their growing number of applications with OneLogin's end-to-end solution OneLogin SmartFactor Authentication: Blacklist Countries Using APIs Virgin Hyperloop One secures intellectual properties with adaptive multi-factor authentication OneLogin: Password Reset Flow Customer Focused - OneLogin Users Share Their Experience AWS IAM: Multi-Account, Multi-Role Provisioning Secure RADIUS for Meraki Virtual LDAP Directory Service Steelcase uses one easy way to authenticate users OneLogin Desktop for Mac Real-Time Active Directory Sync San José Unified Integrates Active Directory, Box Easy Office 365 Federation with OneLogin One Click Aspire boosts productivity and data security with OneLogin Dell Services relies on OneLogin for flexible provisioning SOTI Moves to Cloud for Anywhere, Anytime Access Whitby School empowers teachers with one set of user credentials Secure all your apps, users, and devices",
    "Come join us for a webinar! Come join us for a webinar! Upcoming Webinars Title Speaker Date Extortionware: Your Privacy Problems Made Public Lonnie Benavides April 22, 2021 Register Cyberthreats in a Post-Pandemic World Brad Brooks Theresa Payton May 13, 2021 Register Past Webinars Title Speaker Date Digital Transformation in Manufacturing: IT Leaders Perspectives Luke Eaton Tommy Craddock Dawn Armstrong April 07, 2021 Watch On-Demand Extortionware: How Cyberattacks are Evolving in 2021 Lonnie Benavides March 25, 2021 Watch On-Demand Extortionware: The Next Evolution of Cyber Attacks Lonnie Benavides March 25, 2021 Watch On-Demand Extortionware: Your Privacy Problems Made Public Lonnie Benavides March 25, 2021 Watch On-Demand Cybersecurity in a State of Disinformation Brad Brooks Christopher Krebs February 17, 2021 Watch On-Demand Identity and Access Management Predictions 2021 Brandon Simmons Garrett Bekker February 09, 2021 Watch On-Demand Protecting the UK and Europe from Cyber Security Aggressions Ciaran Martin Stuart Sharp December 17, 2020 Watch On-Demand Exposing Cyberespionage from Within the FBI Brad Brooks Eric O'Neill December 14, 2020 Watch On-Demand OneLogin overview: The Trusted Experience Platform Peter Bastiaansen December 11, 2020 Watch On-Demand Securing and Scaling Identity and Access in 2021 Gary Gwin Joan Goodchild December 11, 2020 Watch On-Demand Hacker Chat: Attacks and Threats in a Rapidly Remote World Lonnie Benavides Douglas Day, AKA the_arch_angel Justin Clarke-Salt November 20, 2020 Watch On-Demand WFH Stories: How the Evernote IT Team Prepared for Remote Work Shams Mansoor November 20, 2020 Watch On-Demand Future of Work Fireside Chat: The Evolution of the Cloud and Security in a Transitioning World Brad Brooks Chris Grusz November 20, 2020 Watch On-Demand To Pay or Not to Pay, That is the Ransomware Question Vanessa Pegueros Alex Rice Errol Weiss Mary N. Chaney Laura Chang November 19, 2020 Watch On-Demand From Workforce to CIAM: Building Secure Login Experiences in a Digital World Rich Chetwynd James Herbert Kayla Gesek November 19, 2020 Watch On-Demand See All Webinars",
    "Come join us for a webinar! Come join us for a webinar! Upcoming Webinars Title Speaker Date Cyberthreats in a Post-Pandemic World Brad Brooks Theresa Payton May 13, 2021 Register Past Webinars Title Speaker Date Extortionware: Your Privacy Problems Made Public Lonnie Benavides April 22, 2021 Watch On-Demand Digital Transformation in Manufacturing: IT Leaders Perspectives Luke Eaton Tommy Craddock Dawn Armstrong April 07, 2021 Watch On-Demand Extortionware: How Cyberattacks are Evolving in 2021 Lonnie Benavides March 25, 2021 Watch On-Demand Extortionware: The Next Evolution of Cyber Attacks Lonnie Benavides March 25, 2021 Watch On-Demand Extortionware: Your Privacy Problems Made Public Lonnie Benavides March 25, 2021 Watch On-Demand Cybersecurity in a State of Disinformation Brad Brooks Christopher Krebs February 17, 2021 Watch On-Demand Identity and Access Management Predictions 2021 Brandon Simmons Garrett Bekker February 09, 2021 Watch On-Demand Protecting the UK and Europe from Cyber Security Aggressions Ciaran Martin Stuart Sharp December 17, 2020 Watch On-Demand Exposing Cyberespionage from Within the FBI Brad Brooks Eric O'Neill December 14, 2020 Watch On-Demand OneLogin overview: The Trusted Experience Platform Peter Bastiaansen December 11, 2020 Watch On-Demand Securing and Scaling Identity and Access in 2021 Gary Gwin Joan Goodchild December 11, 2020 Watch On-Demand Hacker Chat: Attacks and Threats in a Rapidly Remote World Lonnie Benavides Douglas Day, AKA the_arch_angel Justin Clarke-Salt November 20, 2020 Watch On-Demand WFH Stories: How the Evernote IT Team Prepared for Remote Work Shams Mansoor November 20, 2020 Watch On-Demand Future of Work Fireside Chat: The Evolution of the Cloud and Security in a Transitioning World Brad Brooks Chris Grusz November 20, 2020 Watch On-Demand To Pay or Not to Pay, That is the Ransomware Question Vanessa Pegueros Alex Rice Errol Weiss Mary N. Chaney Laura Chang November 19, 2020 Watch On-Demand See All Webinars",
    "See All Videos How to Setup SSO for Deputy Using SAML See just how easy it is for admins to set up a Deputy-OneLogin integration for desktop and mobile devices. How to Setup SSO for Deputy Using SAML See just how easy it is for admins to set up a Deputy-OneLogin integration for desktop and mobile devices. Secure all your apps, users, and devices"
  ]
}