{
  "company": "www.pensees.sg",
  "dominant_topics": [
    2,
    1,
    -1,
    9,
    0
  ],
  "topic_counts": {
    "2": 15,
    "1": 13,
    "-1": 6,
    "9": 1,
    "0": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "9": "gsm, gprs, wireless, cdma, rf",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.3837837837837838,
    "framing_surveillance": 0.2108108108108108,
    "framing_market": 0.4054054054054054,
    "num_docs": 36
  },
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 1,
      "1": 13,
      "2": 15,
      "9": 1
    }
  },
  "sample_docs": [
    "80% PSG Grant Support COVID-19 Support: Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Join Demo Webinar> More on PSG Grant > FAQs > Brought to you by Part of What Sets Us Apart? HSA CLASS A CERTIFIED Automated Submission For SafeEntry And People Counting On-Premise Cloud Integration Integrate with existing system through API 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics Other Features: 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations ​ Key Advantages: 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations Use Cases: The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. ​ Technical Support: Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology Testimonials Nicholas Kraal, True Group We made the best decision appointing Pensees Singapore as our preferred vendor for thermal solutions for all our True Fitness & TFX Centres in Singapore. Our average centre receives an average of 500 members per day plus an average of 20 staff per centre; hence having this solution saves us additional manpower required for temperature screening and tracking of temperature readings. A great product made better with amazing technical support. Pensees Team have been prompt and extremely responsive with all technical support required by our centres. We look forward to working alongside Pensees and contributing towards improvements & enhancements. REQUEST QUOTATION To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. LINKS CONTACT E-mail: business@pensees.sg Tel: +65 6969 8658 Add: 3 Fusionopolis Way, #14-23, Symbiosis, Singapore 138633 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M Website's & Conditions 80% PSG Grant Support COVID-19 Support: Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Join Demo Webinar> More on PSG Grant > FAQs > Brought to you by Part of What Sets Us Apart? Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Brought to you by What Sets Us Apart? Integrate with existing system through API 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics Other Features: 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations ​ Key Advantages: 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations Use Cases: The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. ​ Technical Support: Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology Nicholas Kraal, True Group We made the best decision appointing Pensees Singapore as our preferred vendor for thermal solutions for all our True Fitness & TFX Centres in Singapore. Our average centre receives an average of 500 members per day plus an average of 20 staff per centre; hence having this solution saves us additional manpower required for temperature screening and tracking of temperature readings. A great product made better with amazing technical support. Pensees Team have been prompt and extremely responsive with all technical support required by our centres. We look forward to working alongside Pensees and contributing towards improvements & enhancements. REQUEST QUOTATION To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. LINKS CONTACT E-mail: business@pensees.sg Tel: +65 6969 8658 Add: 3 Fusionopolis Way, #14-23, Symbiosis, Singapore 138633 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M Website's & Conditions Tel: +65 6969 8658 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M",
    "Facial Recognition Door Access Control Device PesGuard A Door Access Control Solution PesGuard is an smart Face Recognition Door Access Control Device that works via facial recognition technology to scan, read and match faces to recognize, identify and authenticate people. PesGuard can be integrated with attendance management for businesses, offices and homes for human resource (HR) and admin matters, where it is incorporated with a time management system (TMS) software for time and attendance supervision. By automating processes electronically and digitally, it brings an advantage to various applications. It functions as a scanner or reader for a complete security system for door access entry, security access and many more. It also generates and provides new-user QR codes for ease of access. ​ Smart access control devices are essential to the architecture of buildings for advanced security systems. With an operating biometric access control solution, it boosts efficiency and productivity in the workplace. About access control White Paper on access control systems A comprehensive overview of access control, including insights of technologies in access control, use cases of the system across industries, future developments of access control, and so on. Read Now PesGuard uses intelligent biometric technology that enables companies to manage the attendance of their staff and visitors via door access control. It reduces the hygienic problems associated with traditional fingerprint systems and the inconvenience of access cards. It can be enhanced with an Integrated Thermal Temperature Monitoring Module to check the temperature of staff and visitors. ​ PesGuard has also been featured by the National Council of Social Service (NCSS) Singapore as a solution for an intelligent access control system, where it also identifies and encourages for technological adoption and digitalisation. ​ During the COVID-19 pandemic in 2020, PesGuard was approved as a Covid-19 Support product by IMDA under the PSG Grant and approved by the Health Sciences Authority (HSA) as a Class-A medical device for temperature measurement to help our community to stay safe and healthy. ​ Today, as we move into a post-pandemic world, Pensees' PesGuard continues to serve numerous organizations and companies in Singapore and abroad with its variety of functions. PesGuard Video PesGuard INTRODUCTORY VIDEO Facial Recognition People Counting and Time Management System Access Control Remote Door Opening Attendance Management Temperature Taking One-click ePSS Generation CLOUD-EDGE DESIGN PesGuard is designed with a Cloud-Edge approach. Owlook, the Pensees Management server, contains all the settings, user databases, and management of all PesGuard devices. PesGuard, the frontend device, performs facial recognition, authentication and authorization, temperature taking, and grants access to staff and visitors accordingly. It then sends all event data to the Pensees Management server. It also receives pictures and a list of authorized users from the server. ​ The Pensees Management server is Cloud-hosted and thus can be accessed efficiently from any location. All communication is protected and encrypted. There is no need for a backend server to be installed locally. As the server is on the Cloud, it is not necessary for additional servers. If required, the Pensees Management server can be deployed locally as well. Cloud-edge design PesGuard SOLUTIONS Facial Recognition The PesGuard makes use of facial recognition technology to enable swift and convenient door access for approved personnel. The PesGuard is able to detect faces regardless of whether the user is wearing a mask or not, and its liveness recognition function prevents it from detecting faces from photos or videos. The PesGuard is able to detect a face in less than 0.3 seconds, and has an accuracy rate of ≥99%. The PesGuard comes with Pensees' Owlook Cloud Dashboard, which records in real-time the check-in and check-out times of staff and registered visitors. It is able to store the information of up to 30,000 individuals, and the recording the face of one individual requires only one clear front-view photograph. The attendance and movement data can be exported in Excel format. Attendance Management PesGuard is able to support a Blacklist and Whitelist function. Blacklisted individuals will not be allowed access by the PesGuard. Arrival of whitelisted individuals, such as VIP guests, will also trigger a notification when detected by the PesGuard for employees to respond accordingly. This dual-list function reduces the manpower needed to monitor entrances and doorways, and allows personnel to react quickly to visitors of different categories. Blacklist and Whitelist People Counting and Time Management PesGuard's Cloud-based dashboard provides a real-time count of the number of people in an area, as well as a breakdown of past and present data. The Time Management System, contained within a single dashboard, gives the administrator a clear view of the manpower present and any capacity limits. The PesGuard is equipped with a 'Help' button for visitors and other non-registered personnel whose entry cannot be approved by the PesGuard. When they press the 'Help' button, a message together with a snapshot of the visitor taken by the PesGuard will be sent to the administrator. The administrator can then remotely open the door using the Pensees Cloud Dashboard without having to travel to the door, thereby enabling convenient, swift and safe visitor reception. Remote Door Access One-Click ePSS Generation for Construction Using entry and exit data collected by the PesGuard. administrators in the construction industry can make use of the Pensees Cloud Dashboard's inbuilt function to generate Electronic Productivity Submission System (ePSS) reports in excel format. Facial Recognition Attendance Management Blacklist and Whitelist People Counting and Time Management Remote Door Access Featuring ePSS Facial recognition technology has come a long way in recent years and has become increasingly popular in various industries - particularly security and access control. The benefits of facial recognition access control systems are numerous and can greatly enhance operations. Why are biometric access control systems popular? Biometric access control systems, such as those featuring facial recognition, are becoming increasingly popular due to their ability to provide higher levels of security compared to traditional access control methods. They rely on unique physical characteristics, such as facial features of people, making them much more difficult to bypass. On the other hand, traditional methods such as keycards and passwords, can be easily replicated or stolen, making them vulnerable to security breaches. Another reason for their popularity is the convenience they provide. Biometric access control systems eliminate the need for employees to carry around keys or remember complex passwords for access. This not only saves time but also reduces the risk of lost or stolen keys and forgotten passwords. The advantages of facial recognition access control Advantages Facial recognition access control, a type of biometric-based technology, has several advantages over other biometric access control methods. Firstly, it is a non-intrusive method, as it does not require employees to touch or place their fingerprints on a scanner. With a touch-free experience, it is sanitary and this eliminates the need for regular cleaning and reduces the risk of spreading germs. Secondly, these systems can be integrated with other security systems, such as CCTV cameras, providing organizations with an additional layer of security. Apart from access control, organizations can also monitor and track individuals as they move throughout the building. ​ Thirdly, the results of facial recognition systems can be easily verified by the administrator, as the snapshot of the persons for each transaction is captured and stored for security purposes, as part of the in/out records of the people going through the facial recognition systems. The speed of the technology is also another advantage. Facial recognition systems can quickly and accurately identify individuals, even in large crowds, making it ideal for high-traffic areas such as airports and train stations. Why should organizations adopt such systems? There are many benefits of facial recognition access control systems and they greatly enhance the security and efficiency of any organization. By implementing such systems, organizations can ensure that only authorized individuals have access to sensitive areas and information, while also providing a more efficient and convenient way of managing access. In addition, these type of systems are able to provide better tracking and monitoring of individuals as they move throughout the building. This feature is essential in the event of an incident or emergency, as it can help identify the people and entities who were present at the particular time. Conclusion In conclusion, facial recognition access control systems are becoming more popular as they are more capable and provides a higher level of security compared to traditional methods. They are also convenient and can be integrated with other security systems, making them ideal for organizations of all sizes and demands. By adopting facial recognition access control systems, organizations can further enhance their security and efficiency, and obtain a convenient method of managing access for employees. APPLICATIONS OF PesGuard OLD FOLKS' HOMES CONSTRUCTION SITES INSTITUTIONS Pensees' Medicine Dispenser uses facial recognition to recognise residents, most of whom are old folks, so that medicine will be dispensed accurately. and at the same time reducing additional manpower to take temperature. It also greatly reduces the chance of human error and reliance on manpower. The PesGuard has been employed at construction sites for people counting and Time Management System to keep track of capacity limits in the whole site or subsections of the site. Capacity-tracking with technology improves safety and efficiency on-site. Pensees' PesGuard is deployed at tuition and enrichment centres for temperature-taking and attendance-taking. The Pensees stands are childproof and the contactless nature of the process ensures the outmost safety and hygiene for the students and staff of the centre. AND MORE...... Applications MOUNTING OPTIONS Pensees Stand Desktop Mount Wall Mount Mounting Options Facial Recognition Door Access Control Device PesGuard Facial Recognition Door Access Control Device PesGuard Facial Recognition Door Access Control Device A Door Access Control Solution PesGuard is an smart Face Recognition Door Access Control Device that works via facial recognition technology to scan, read and match faces to recognize, identify and authenticate people. PesGuard can be integrated with attendance management for businesses, offices and homes for human resource (HR) and admin matters, where it is incorporated with a time management system (TMS) software for time and attendance supervision. By automating processes electronically and digitally, it brings an advantage to various applications. It functions as a scanner or reader for a complete security system for door access entry, security access and many more. It also generates and provides new-user QR codes for ease of access. ​ Smart access control devices are essential to the architecture of buildings for advanced security systems. With an operating biometric access control solution, it boosts efficiency and productivity in the workplace. About access control A Door Access Control Solution PesGuard is an smart Face Recognition Door Access Control Device that works via facial recognition technology to scan, read and match faces to recognize, identify and authenticate people. PesGuard can be integrated with attendance management for businesses, offices and homes for human resource (HR) and admin matters, where it is incorporated with a time management system (TMS) software for time and attendance supervision. By automating processes electronically and digitally, it brings an advantage to various applications. It functions as a scanner or reader for a complete security system for door access entry, security access and many more. It also generates and provides new-user QR codes for ease of access. Smart access control devices are essential to the architecture of buildings for advanced security systems. With an operating biometric access control solution, it boosts efficiency and productivity in the workplace. White Paper on access control systems A comprehensive overview of access control, including insights of technologies in access control, use cases of the system across industries, future developments of access control, and so on. Read Now White Paper on access control systems A comprehensive overview of access control, including insights of technologies in access control, use cases of the system across industries, future developments of access control, and so on. Read Now White Paper on access control systems A comprehensive overview of access control, including insights of technologies in access control, use cases of the system across industries, future developments of access control, and so on. PesGuard uses intelligent biometric technology that enables companies to manage the attendance of their staff and visitors via door access control. It reduces the hygienic problems associated with traditional fingerprint systems and the inconvenience of access cards. It can be enhanced with an Integrated Thermal Temperature Monitoring Module to check the temperature of staff and visitors. ​ PesGuard has also been featured by the National Council of Social Service (NCSS) Singapore as a solution for an intelligent access control system, where it also identifies and encourages for technological adoption and digitalisation. ​ During the COVID-19 pandemic in 2020, PesGuard was approved as a Covid-19 Support product by IMDA under the PSG Grant and approved by the Health Sciences Authority (HSA) as a Class-A medical device for temperature measurement to help our community to stay safe and healthy. ​ Today, as we move into a post-pandemic world, Pensees' PesGuard continues to serve numerous organizations and companies in Singapore and abroad with its variety of functions. PesGuard Video PesGuard INTRODUCTORY VIDEO Facial Recognition People Counting and Time Management System Access Control Remote Door Opening Attendance Management Temperature Taking One-click ePSS Generation CLOUD-EDGE DESIGN PesGuard is designed with a Cloud-Edge approach. Owlook, the Pensees Management server, contains all the settings, user databases, and management of all PesGuard devices. PesGuard, the frontend device, performs facial recognition, authentication and authorization, temperature taking, and grants access to staff and visitors accordingly. It then sends all event data to the Pensees Management server. It also receives pictures and a list of authorized users from the server. ​ The Pensees Management server is Cloud-hosted and thus can be accessed efficiently from any location. All communication is protected and encrypted. There is no need for a backend server to be installed locally. As the server is on the Cloud, it is not necessary for additional servers. If required, the Pensees Management server can be deployed locally as well. Cloud-edge design PesGuard SOLUTIONS Facial Recognition The PesGuard makes use of facial recognition technology to enable swift and convenient door access for approved personnel. The PesGuard is able to detect faces regardless of whether the user is wearing a mask or not, and its liveness recognition function prevents it from detecting faces from photos or videos. The PesGuard is able to detect a face in less than 0.3 seconds, and has an accuracy rate of ≥99%. The PesGuard comes with Pensees' Owlook Cloud Dashboard, which records in real-time the check-in and check-out times of staff and registered visitors. It is able to store the information of up to 30,000 individuals, and the recording the face of one individual requires only one clear front-view photograph. The attendance and movement data can be exported in Excel format. Attendance Management PesGuard is able to support a Blacklist and Whitelist function. Blacklisted individuals will not be allowed access by the PesGuard. Arrival of whitelisted individuals, such as VIP guests, will also trigger a notification when detected by the PesGuard for employees to respond accordingly. This dual-list function reduces the manpower needed to monitor entrances and doorways, and allows personnel to react quickly to visitors of different categories. Blacklist and Whitelist People Counting and Time Management PesGuard's Cloud-based dashboard provides a real-time count of the number of people in an area, as well as a breakdown of past and present data. The Time Management System, contained within a single dashboard, gives the administrator a clear view of the manpower present and any capacity limits. The PesGuard is equipped with a 'Help' button for visitors and other non-registered personnel whose entry cannot be approved by the PesGuard. When they press the 'Help' button, a message together with a snapshot of the visitor taken by the PesGuard will be sent to the administrator. The administrator can then remotely open the door using the Pensees Cloud Dashboard without having to travel to the door, thereby enabling convenient, swift and safe visitor reception. Remote Door Access One-Click ePSS Generation for Construction Using entry and exit data collected by the PesGuard. administrators in the construction industry can make use of the Pensees Cloud Dashboard's inbuilt function to generate Electronic Productivity Submission System (ePSS) reports in excel format. Facial Recognition Attendance Management Blacklist and Whitelist People Counting and Time Management Remote Door Access Featuring ePSS Facial recognition technology has come a long way in recent years and has become increasingly popular in various industries - particularly security and access control. The benefits of facial recognition access control systems are numerous and can greatly enhance operations. Why are biometric access control systems popular? Biometric access control systems, such as those featuring facial recognition, are becoming increasingly popular due to their ability to provide higher levels of security compared to traditional access control methods. They rely on unique physical characteristics, such as facial features of people, making them much more difficult to bypass. On the other hand, traditional methods such as keycards and passwords, can be easily replicated or stolen, making them vulnerable to security breaches. Another reason for their popularity is the convenience they provide. Biometric access control systems eliminate the need for employees to carry around keys or remember complex passwords for access. This not only saves time but also reduces the risk of lost or stolen keys and forgotten passwords. The advantages of facial recognition access control Advantages Facial recognition access control, a type of biometric-based technology, has several advantages over other biometric access control methods. Firstly, it is a non-intrusive method, as it does not require employees to touch or place their fingerprints on a scanner. With a touch-free experience, it is sanitary and this eliminates the need for regular cleaning and reduces the risk of spreading germs. Secondly, these systems can be integrated with other security systems, such as CCTV cameras, providing organizations with an additional layer of security. Apart from access control, organizations can also monitor and track individuals as they move throughout the building. ​ Thirdly, the results of facial recognition systems can be easily verified by the administrator, as the snapshot of the persons for each transaction is captured and stored for security purposes, as part of the in/out records of the people going through the facial recognition systems. The speed of the technology is also another advantage. Facial recognition systems can quickly and accurately identify individuals, even in large crowds, making it ideal for high-traffic areas such as airports and train stations. Why should organizations adopt such systems? There are many benefits of facial recognition access control systems and they greatly enhance the security and efficiency of any organization. By implementing such systems, organizations can ensure that only authorized individuals have access to sensitive areas and information, while also providing a more efficient and convenient way of managing access. In addition, these type of systems are able to provide better tracking and monitoring of individuals as they move throughout the building. This feature is essential in the event of an incident or emergency, as it can help identify the people and entities who were present at the particular time. Conclusion In conclusion, facial recognition access control systems are becoming more popular as they are more capable and provides a higher level of security compared to traditional methods. They are also convenient and can be integrated with other security systems, making them ideal for organizations of all sizes and demands. By adopting facial recognition access control systems, organizations can further enhance their security and efficiency, and obtain a convenient method of managing access for employees. APPLICATIONS OF PesGuard OLD FOLKS' HOMES CONSTRUCTION SITES INSTITUTIONS Pensees' Medicine Dispenser uses facial recognition to recognise residents, most of whom are old folks, so that medicine will be dispensed accurately. and at the same time reducing additional manpower to take temperature. It also greatly reduces the chance of human error and reliance on manpower. The PesGuard has been employed at construction sites for people counting and Time Management System to keep track of capacity limits in the whole site or subsections of the site. Capacity-tracking with technology improves safety and efficiency on-site. Pensees' PesGuard is deployed at tuition and enrichment centres for temperature-taking and attendance-taking. The Pensees stands are childproof and the contactless nature of the process ensures the outmost safety and hygiene for the students and staff of the centre. AND MORE...... Applications MOUNTING OPTIONS Pensees Stand Desktop Mount Wall Mount Mounting Options PesGuard uses intelligent biometric technology that enables companies to manage the attendance of their staff and visitors via door access control. It reduces the hygienic problems associated with traditional fingerprint systems and the inconvenience of access cards. It can be enhanced with an Integrated Thermal Temperature Monitoring Module to check the temperature of staff and visitors. ​ PesGuard has also been featured by the National Council of Social Service (NCSS) Singapore as a solution for an intelligent access control system, where it also identifies and encourages for technological adoption and digitalisation. ​ During the COVID-19 pandemic in 2020, PesGuard was approved as a Covid-19 Support product by IMDA under the PSG Grant and approved by the Health Sciences Authority (HSA) as a Class-A medical device for temperature measurement to help our community to stay safe and healthy. ​ Today, as we move into a post-pandemic world, Pensees' PesGuard continues to serve numerous organizations and companies in Singapore and abroad with its variety of functions. PesGuard uses intelligent biometric technology that enables companies to manage the attendance of their staff and visitors via door access control. It reduces the hygienic problems associated with traditional fingerprint systems and the inconvenience of access cards. It can be enhanced with an Integrated Thermal Temperature Monitoring Module to check the temperature of staff and visitors. PesGuard has also been featured by the National Council of Social Service (NCSS) Singapore as a solution for an intelligent access control system, where it also identifies and encourages for technological adoption and digitalisation. During the COVID-19 pandemic in 2020, PesGuard was approved as a Covid-19 Support product by IMDA under the PSG Grant and approved by the Health Sciences Authority (HSA) as a Class-A medical device for temperature measurement to help our community to stay safe and healthy. Today, as we move into a post-pandemic world, Pensees' PesGuard continues to serve numerous organizations and companies in Singapore and abroad with its variety of functions. Facial Recognition People Counting and Time Management System Access Control Remote Door Opening Attendance Management Temperature Taking One-click ePSS Generation People Counting and Time Management System CLOUD-EDGE DESIGN PesGuard is designed with a Cloud-Edge approach. Owlook, the Pensees Management server, contains all the settings, user databases, and management of all PesGuard devices. PesGuard, the frontend device, performs facial recognition, authentication and authorization, temperature taking, and grants access to staff and visitors accordingly. It then sends all event data to the Pensees Management server. It also receives pictures and a list of authorized users from the server. ​ The Pensees Management server is Cloud-hosted and thus can be accessed efficiently from any location. All communication is protected and encrypted. There is no need for a backend server to be installed locally. As the server is on the Cloud, it is not necessary for additional servers. If required, the Pensees Management server can be deployed locally as well. PesGuard is designed with a Cloud-Edge approach. Owlook, the Pensees Management server, contains all the settings, user databases, and management of all PesGuard devices. PesGuard, the frontend device, performs facial recognition, authentication and authorization, temperature taking, and grants access to staff and visitors accordingly. It then sends all event data to the Pensees Management server. It also receives pictures and a list of authorized users from the server. The Pensees Management server is Cloud-hosted and thus can be accessed efficiently from any location. All communication is protected and encrypted. There is no need for a backend server to be installed locally. As the server is on the Cloud, it is not necessary for additional servers. If required, the Pensees Management server can be deployed locally as well. PesGuard SOLUTIONS Facial Recognition The PesGuard makes use of facial recognition technology to enable swift and convenient door access for approved personnel. The PesGuard is able to detect faces regardless of whether the user is wearing a mask or not, and its liveness recognition function prevents it from detecting faces from photos or videos. The PesGuard is able to detect a face in less than 0.3 seconds, and has an accuracy rate of ≥99%. The PesGuard comes with Pensees' Owlook Cloud Dashboard, which records in real-time the check-in and check-out times of staff and registered visitors. It is able to store the information of up to 30,000 individuals, and the recording the face of one individual requires only one clear front-view photograph. The attendance and movement data can be exported in Excel format. Attendance Management PesGuard is able to support a Blacklist and Whitelist function. Blacklisted individuals will not be allowed access by the PesGuard. Arrival of whitelisted individuals, such as VIP guests, will also trigger a notification when detected by the PesGuard for employees to respond accordingly. This dual-list function reduces the manpower needed to monitor entrances and doorways, and allows personnel to react quickly to visitors of different categories. Blacklist and Whitelist People Counting and Time Management PesGuard's Cloud-based dashboard provides a real-time count of the number of people in an area, as well as a breakdown of past and present data. The Time Management System, contained within a single dashboard, gives the administrator a clear view of the manpower present and any capacity limits. The PesGuard is equipped with a 'Help' button for visitors and other non-registered personnel whose entry cannot be approved by the PesGuard. When they press the 'Help' button, a message together with a snapshot of the visitor taken by the PesGuard will be sent to the administrator. The administrator can then remotely open the door using the Pensees Cloud Dashboard without having to travel to the door, thereby enabling convenient, swift and safe visitor reception. Remote Door Access One-Click ePSS Generation for Construction Using entry and exit data collected by the PesGuard. administrators in the construction industry can make use of the Pensees Cloud Dashboard's inbuilt function to generate Electronic Productivity Submission System (ePSS) reports in excel format. The PesGuard makes use of facial recognition technology to enable swift and convenient door access for approved personnel. The PesGuard is able to detect faces regardless of whether the user is wearing a mask or not, and its liveness recognition function prevents it from detecting faces from photos or videos. The PesGuard is able to detect a face in less than 0.3 seconds, and has an accuracy rate of ≥99%. The PesGuard comes with Pensees' Owlook Cloud Dashboard, which records in real-time the check-in and check-out times of staff and registered visitors. It is able to store the information of up to 30,000 individuals, and the recording the face of one individual requires only one clear front-view photograph. The attendance and movement data can be exported in Excel format. PesGuard is able to support a Blacklist and Whitelist function. Blacklisted individuals will not be allowed access by the PesGuard. Arrival of whitelisted individuals, such as VIP guests, will also trigger a notification when detected by the PesGuard for employees to respond accordingly. This dual-list function reduces the manpower needed to monitor entrances and doorways, and allows personnel to react quickly to visitors of different categories. People Counting and Time Management PesGuard's Cloud-based dashboard provides a real-time count of the number of people in an area, as well as a breakdown of past and present data. The Time Management System, contained within a single dashboard, gives the administrator a clear view of the manpower present and any capacity limits. The PesGuard is equipped with a 'Help' button for visitors and other non-registered personnel whose entry cannot be approved by the PesGuard. When they press the 'Help' button, a message together with a snapshot of the visitor taken by the PesGuard will be sent to the administrator. The administrator can then remotely open the door using the Pensees Cloud Dashboard without having to travel to the door, thereby enabling convenient, swift and safe visitor reception. One-Click ePSS Generation for Construction Using entry and exit data collected by the PesGuard. administrators in the construction industry can make use of the Pensees Cloud Dashboard's inbuilt function to generate Electronic Productivity Submission System (ePSS) reports in excel format. Facial recognition technology has come a long way in recent years and has become increasingly popular in various industries - particularly security and access control. The benefits of facial recognition access control systems are numerous and can greatly enhance operations. Why are biometric access control systems popular? Biometric access control systems, such as those featuring facial recognition, are becoming increasingly popular due to their ability to provide higher levels of security compared to traditional access control methods. They rely on unique physical characteristics, such as facial features of people, making them much more difficult to bypass. On the other hand, traditional methods such as keycards and passwords, can be easily replicated or stolen, making them vulnerable to security breaches. Another reason for their popularity is the convenience they provide. Biometric access control systems eliminate the need for employees to carry around keys or remember complex passwords for access. This not only saves time but also reduces the risk of lost or stolen keys and forgotten passwords. The advantages of facial recognition access control Facial recognition access control, a type of biometric-based technology, has several advantages over other biometric access control methods. Firstly, it is a non-intrusive method, as it does not require employees to touch or place their fingerprints on a scanner. With a touch-free experience, it is sanitary and this eliminates the need for regular cleaning and reduces the risk of spreading germs. Secondly, these systems can be integrated with other security systems, such as CCTV cameras, providing organizations with an additional layer of security. Apart from access control, organizations can also monitor and track individuals as they move throughout the building. Thirdly, the results of facial recognition systems can be easily verified by the administrator, as the snapshot of the persons for each transaction is captured and stored for security purposes, as part of the in/out records of the people going through the facial recognition systems. The speed of the technology is also another advantage. Facial recognition systems can quickly and accurately identify individuals, even in large crowds, making it ideal for high-traffic areas such as airports and train stations. Why should organizations adopt such systems? There are many benefits of facial recognition access control systems and they greatly enhance the security and efficiency of any organization. By implementing such systems, organizations can ensure that only authorized individuals have access to sensitive areas and information, while also providing a more efficient and convenient way of managing access. In addition, these type of systems are able to provide better tracking and monitoring of individuals as they move throughout the building. This feature is essential in the event of an incident or emergency, as it can help identify the people and entities who were present at the particular time. In conclusion, facial recognition access control systems are becoming more popular as they are more capable and provides a higher level of security compared to traditional methods. They are also convenient and can be integrated with other security systems, making them ideal for organizations of all sizes and demands. By adopting facial recognition access control systems, organizations can further enhance their security and efficiency, and obtain a convenient method of managing access for employees. APPLICATIONS OF PesGuard OLD FOLKS' HOMES CONSTRUCTION SITES INSTITUTIONS Pensees' Medicine Dispenser uses facial recognition to recognise residents, most of whom are old folks, so that medicine will be dispensed accurately. and at the same time reducing additional manpower to take temperature. It also greatly reduces the chance of human error and reliance on manpower. The PesGuard has been employed at construction sites for people counting and Time Management System to keep track of capacity limits in the whole site or subsections of the site. Capacity-tracking with technology improves safety and efficiency on-site. Pensees' PesGuard is deployed at tuition and enrichment centres for temperature-taking and attendance-taking. The Pensees stands are childproof and the contactless nature of the process ensures the outmost safety and hygiene for the students and staff of the centre. AND MORE...... Pensees' Medicine Dispenser uses facial recognition to recognise residents, most of whom are old folks, so that medicine will be dispensed accurately. and at the same time reducing additional manpower to take temperature. It also greatly reduces the chance of human error and reliance on manpower. The PesGuard has been employed at construction sites for people counting and Time Management System to keep track of capacity limits in the whole site or subsections of the site. Capacity-tracking with technology improves safety and efficiency on-site. Pensees' PesGuard is deployed at tuition and enrichment centres for temperature-taking and attendance-taking. The Pensees stands are childproof and the contactless nature of the process ensures the outmost safety and hygiene for the students and staff of the centre. MOUNTING OPTIONS Pensees Stand Desktop Mount Wall Mount",
    "Acerca de WHAT IS ACCESS CONTROL? Our PesGuard is a facial recognition door access system that integrates temperature-taking, remote reception and people counting all in one. This product helps to increase efficiency and convenience for employees and visitors alike. Additionally, our PesGuard also has a Time Management System that allows users to track working hours as well to facilitate processes such as generating an attendance report. Click on \"Read More\" to understand more about our PesGuard! Read More > AI FOR ACCESS CONTROL Acerca de WHAT IS ACCESS CONTROL? Our PesGuard is a facial recognition door access system that integrates temperature-taking, remote reception and people counting all in one. This product helps to increase efficiency and convenience for employees and visitors alike. Additionally, our PesGuard also has a Time Management System that allows users to track working hours as well to facilitate processes such as generating an attendance report. Click on \"Read More\" to understand more about our PesGuard! Read More > AI FOR ACCESS CONTROL WHAT IS ACCESS CONTROL? Our PesGuard is a facial recognition door access system that integrates temperature-taking, remote reception and people counting all in one. This product helps to increase efficiency and convenience for employees and visitors alike. Additionally, our PesGuard also has a Time Management System that allows users to track working hours as well to facilitate processes such as generating an attendance report. Click on \"Read More\" to understand more about our PesGuard! Read More > WHAT IS ACCESS CONTROL? Our PesGuard is a facial recognition door access system that integrates temperature-taking, remote reception and people counting all in one. This product helps to increase efficiency and convenience for employees and visitors alike. Additionally, our PesGuard also has a Time Management System that allows users to track working hours as well to facilitate processes such as generating an attendance report. Click on \"Read More\" to understand more about our PesGuard! AI FOR ACCESS CONTROL",
    "80% PSG Grant Support COVID-19 Support: Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Join Demo Webinar> More on PSG Grant > FAQs > Brought to you by Part of Click to Whatsapp Us What Sets Us Apart? HSA CLASS A CERTIFIED On-Premise Cloud Integration Automated Submission For SafeEntry And People Counting Integrate with existing system through API 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics Other Features: 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations ​ Key Advantages: 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations Use Cases: The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. ​ Technical Support: Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology Testimonials Nicholas Kraal, True Group We made the best decision appointing Pensees Singapore as our preferred vendor for thermal solutions for all our True Fitness & TFX Centres in Singapore. Our average centre receives an average of 500 members per day plus an average of 20 staff per centre; hence having this solution saves us additional manpower required for temperature screening and tracking of temperature readings. A great product made better with amazing technical support. Pensees Team have been prompt and extremely responsive with all technical support required by our centres. We look forward to working alongside Pensees and contributing towards improvements & enhancements. REQUEST QUOTATION To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. LINKS CONTACT E-mail: business@pensees.sg Tel: +65 6969 8658 Add: 3 Fusionopolis Way, #14-23, Symbiosis, Singapore 138633 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M Website's & Conditions 80% PSG Grant Support COVID-19 Support: Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Join Demo Webinar> More on PSG Grant > FAQs > Brought to you by Part of Click to Whatsapp Us Pensees Intelligent Face Recognition Access Control System with Temperature Monitoring Version 1.0 Pensees Intelligent Face Recognition Access with a Temperature Screening Module is a 4-in-1 device . Automatic contact-less temperature measurement allows you to avoid traditional body temperature measurement by thermometers and temperature gun. With infrared thermal body temperature measurement, the device is able to achieve a temperature deviation of ±0.3°C, in the body temperature range of 30°C~45°C. Pensees in-housed developed device and Face Recognition algorithm, face recognition with mask algorithm patented to Pensees Singapore R&D Center. Brought to you by What Sets Us Apart? Integrate with existing system through API 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics Other Features: 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations ​ Key Advantages: 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations Use Cases: The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. ​ Technical Support: Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology 4 -in 1 Main Features: - Contact-less automated Temperature Measurement - Door Access by Face recognition with Liveness detection - Intelligent alert of High temperature - Contact Tracing with attendance management with temperature statistics 1. Face recognition with or without mask on 2. Reminder to wear mask 3. Visitor app with health/travel declaration form 4. Staff/Visitor QR code + link to SafeEntry, and will be constantly updated with local regulations 1. Efficient and safe passing by accurate, fast and contact-less temperature measurement 2. Double verification via connected face and temperature data, easy tracing via synchronization of records to back-end system 3. Attendance and Temperature report can be exported 4. Alert of abnormal body temperature in forms of voice messages, lighting and more 5. Flexible deployment with standalone or networked operations The device can be installed as a standalone system, work parallel with existing door access system, installed and replace risky existing contact-based access system, integrate with existing systems e.g. turnstile. Visitor management systems to achieve contact-less body temperature screening of incoming and outgoing personnel at entrances of offices, commercial buildings, government buildings, communities and apartments. In case of persons with fever detected, passage shall be blocked and notifications be sent to persons in charge for subsequent manual intervention. Ownership of propriety of product and algorithm, allowing full technical support Expertise in Facial Recognition and Thermal Imaging Technology Nicholas Kraal, True Group We made the best decision appointing Pensees Singapore as our preferred vendor for thermal solutions for all our True Fitness & TFX Centres in Singapore. Our average centre receives an average of 500 members per day plus an average of 20 staff per centre; hence having this solution saves us additional manpower required for temperature screening and tracking of temperature readings. A great product made better with amazing technical support. Pensees Team have been prompt and extremely responsive with all technical support required by our centres. We look forward to working alongside Pensees and contributing towards improvements & enhancements. REQUEST QUOTATION To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. To enquire more or to schedule a product demo with one of our product consultants, please fill in your contact details. LINKS CONTACT E-mail: business@pensees.sg Tel: +65 6969 8658 Add: 3 Fusionopolis Way, #14-23, Symbiosis, Singapore 138633 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M Website's & Conditions Tel: +65 6969 8658 Pensees Systems Pte. Ltd. by Pensees Systems Pte Ltd (Singapore) I UEN:202003679M",
    "Acerca de ​ AI FOR VA SOLUTION WHAT IS VA SOLUTION? Video Analytics (VA) is a method of analysing videos to detect or determine temporal and spatial events. Real-time VA solutions can be deployed in contexts such as smart buildings, smart car parks, smart communities, and smart factories. Using face, human and object detection and tracking, behavior analysis, as well as event and anomaly recognition, Pensees' solutions have been installed in more than 20 buildings in Singapore within several months. Our VA solutions have helped companies in their drive towards digital transformation through AI technology. Read More > Acerca de ​ AI FOR VA SOLUTION WHAT IS VA SOLUTION? Video Analytics (VA) is a method of analysing videos to detect or determine temporal and spatial events. Real-time VA solutions can be deployed in contexts such as smart buildings, smart car parks, smart communities, and smart factories. Using face, human and object detection and tracking, behavior analysis, as well as event and anomaly recognition, Pensees' solutions have been installed in more than 20 buildings in Singapore within several months. Our VA solutions have helped companies in their drive towards digital transformation through AI technology. Read More > AI FOR VA SOLUTION WHAT IS VA SOLUTION? Video Analytics (VA) is a method of analysing videos to detect or determine temporal and spatial events. Real-time VA solutions can be deployed in contexts such as smart buildings, smart car parks, smart communities, and smart factories. Using face, human and object detection and tracking, behavior analysis, as well as event and anomaly recognition, Pensees' solutions have been installed in more than 20 buildings in Singapore within several months. Our VA solutions have helped companies in their drive towards digital transformation through AI technology. Read More > WHAT IS VA SOLUTION? Video Analytics (VA) is a method of analysing videos to detect or determine temporal and spatial events. Real-time VA solutions can be deployed in contexts such as smart buildings, smart car parks, smart communities, and smart factories. Using face, human and object detection and tracking, behavior analysis, as well as event and anomaly recognition, Pensees' solutions have been installed in more than 20 buildings in Singapore within several months. Our VA solutions have helped companies in their drive towards digital transformation through AI technology."
  ]
}