{
  "company": "www.smartmetrics.in",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "1": 1
    }
  },
  "sample_docs": [
    "Biometric Access Control System Identification of Humans and Objects is our passion Smartmetrics is found by a group of passionate, talented and well experienced team with a Vision to Provide world class solutions in Automatic Identification and Data capturing solutions We aim at providing positive authentication and recognition to the concerned personnel. With this aim we develop and supply solutions with the latest on par technologies available in their respective domains. A solution which should meet the client;s objectives efficiently and effectively. Smartmetrics is a Biometrics Company offering various solutions like core biometric technologies, Smart Card and RFID technologies of best-inclass for identity authentication and management solutions based in Hyderabad. We are developing client need specific solutions. A technology enabled solutions to solve our client's toughest challenges, demonstrating a commitment to excel and a passion for exceeding expectations. We at Smartmetrics's aim to remain at the forefront of our business to deliver the value to our clients using the innovative technologies in a cost effective manner. Face Recognition System Face-Fact is a facial recognition software developed by Smartmetrics The facial recognition engine used by us is among the top 3 companies in of accuracy and speed which was independently tested by NIST. lT Computer Vision algorithms our products are 100% deep neural networks based which is the state-of-the-art technology today and it will continue to be that for many years to come. What strongly differentiates our products from any other competitors are three things: We dictate the new approaches in DNN-based face recognition since we are only one of 15 companies and universities in the world who develop Pytorch (www.pytorch.org) - a deep learning framework (software to train DNN-based algorithms). Meaning that methods openly available on Pytorch are already something that we don't use in our products today - we are always ahead of competition. We do not use open-source and/or third-party deep neural network architectures (models) - we have our own. This allows us to fully control the accuracy in all use cases across different platforms. We do not use open-source and/or third-party deep neural network inference frameworks (software that helps run DNN models on devices) - we have our own. This allows us to fully control the performance of our DNN models in all use cases across different platforms. Face-Fact is a Video Surveillance facial recognition software developed by Smartmetrics. The facial recognition engine used by us is among the top 3 companies in of accuracy and speed which was independently tested by NIST. The Functions of Face Fact are: Detects tracks and analyses people in live video feeds Performs real time comparisons against pre-processed database and watch lists and gives the alerts provides people analytics and demographics such as people counting, their age, gender, ethnicity, facial expression etc. Matches facial images to image databases enabling biometric identification and verification process, performs efficient and accurate 1:1, 1: N and N: N identification process etc. It will identify the people from live video stream It will search for a person in the database with probe image It will search a person from the recorded video by comparing with database Image enhancement function is available to compare the probe image with the database image It has a report's function, where one can get the report of facial matches with frame by selecting the dates (from date to date) Face Fact can be customized according the user requirement Why Smart Metrics Top Reliability Smartmetrics provides highly reliable products and solutions basing on customer needs and requirements. Wide Flexibility One of Smartmetrics strengths is wide flexibility which comes from various choices of technologies and highly qualified capabilities for customization. We offer customers wide-open ways of solutions so that they can find out the tailor-made solutions for their applications. Just in Response and Expertise With versatile experience and consolidated biometric security skills, we respond rapidly to client's needs, no matter how complex they are. Matched by business-focused, technical support, our response to client's objectives has led to the highest levels of customer satisfaction. Excellent Support Selling a product means the beginning of the long term relations with a customer. S provides various ways of customer support for customer's success with its expertise technical support service that must have never been experienced before. Experienced Staff The company has a team of skilled programmers and technical support staff to deliver committed service to our customers with unrivalled expertise, service and support. Our Clients Central Industrial Security Force National Mineral Development Corporation National Thermal Power Corporation Limited Singareni Collieries Company Limited South Central Railway Telangana State Police Identification of Humans and Objects is our passion Smartmetrics is found by a group of passionate, talented and well experienced team with a Vision to Provide world class solutions in Automatic Identification and Data capturing solutions We aim at providing positive authentication and recognition to the concerned personnel. With this aim we develop and supply solutions with the latest on par technologies available in their respective domains. A solution which should meet the client;s objectives efficiently and effectively. Smartmetrics is a Biometrics Company offering various solutions like core biometric technologies, Smart Card and RFID technologies of best-inclass for identity authentication and management solutions based in Hyderabad. We are developing client need specific solutions. A technology enabled solutions to solve our client's toughest challenges, demonstrating a commitment to excel and a passion for exceeding expectations. We at Smartmetrics's aim to remain at the forefront of our business to deliver the value to our clients using the innovative technologies in a cost effective manner. Face-Fact is a facial recognition software developed by Smartmetrics The facial recognition engine used by us is among the top 3 companies in of accuracy and speed which was independently tested by NIST. lT Computer Vision algorithms our products are 100% deep neural networks based which is the state-of-the-art technology today and it will continue to be that for many years to come. What strongly differentiates our products from any other competitors are three things: We dictate the new approaches in DNN-based face recognition since we are only one of 15 companies and universities in the world who develop Pytorch (www.pytorch.org) - a deep learning framework (software to train DNN-based algorithms). Meaning that methods openly available on Pytorch are already something that we don't use in our products today - we are always ahead of competition. We do not use open-source and/or third-party deep neural network architectures (models) - we have our own. This allows us to fully control the accuracy in all use cases across different platforms. We do not use open-source and/or third-party deep neural network inference frameworks (software that helps run DNN models on devices) - we have our own. This allows us to fully control the performance of our DNN models in all use cases across different platforms. Face-Fact is a Video Surveillance facial recognition software developed by Smartmetrics. The facial recognition engine used by us is among the top 3 companies in of accuracy and speed which was independently tested by NIST. The Functions of Face Fact are: Detects tracks and analyses people in live video feeds Performs real time comparisons against pre-processed database and watch lists and gives the alerts provides people analytics and demographics such as people counting, their age, gender, ethnicity, facial expression etc. Matches facial images to image databases enabling biometric identification and verification process, performs efficient and accurate 1:1, 1: N and N: N identification process etc. It will identify the people from live video stream It will search for a person in the database with probe image It will search a person from the recorded video by comparing with database Image enhancement function is available to compare the probe image with the database image It has a report's function, where one can get the report of facial matches with frame by selecting the dates (from date to date) Face Fact can be customized according the user requirement Smartmetrics provides highly reliable products and solutions basing on customer needs and requirements. One of Smartmetrics strengths is wide flexibility which comes from various choices of technologies and highly qualified capabilities for customization. We offer customers wide-open ways of solutions so that they can find out the tailor-made solutions for their applications. Just in Response and Expertise With versatile experience and consolidated biometric security skills, we respond rapidly to client's needs, no matter how complex they are. Matched by business-focused, technical support, our response to client's objectives has led to the highest levels of customer satisfaction. Selling a product means the beginning of the long term relations with a customer. S provides various ways of customer support for customer's success with its expertise technical support service that must have never been experienced before. The company has a team of skilled programmers and technical support staff to deliver committed service to our customers with unrivalled expertise, service and support. Central Industrial Security Force National Mineral Development Corporation National Thermal Power Corporation Limited Singareni Collieries Company Limited"
  ]
}