{
  "company": "www.stengg.com",
  "dominant_topics": [
    -1,
    0,
    1
  ],
  "topic_counts": {
    "-1": 19,
    "0": 11,
    "1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information",
    "1": "module, students, year, level, grade"
  },
  "framing_scores": {
    "framing_ethical": 0.4014598540145985,
    "framing_surveillance": 0.1678832116788321,
    "framing_market": 0.4306569343065693,
    "num_docs": 31
  },
  "topic_timeline": {
    "20": {
      "-1": 19,
      "0": 11,
      "1": 1
    }
  },
  "sample_docs": [
    "ST Engineering has lined up an exciting schedule of talks and presentations on the industry landscape of the defence and aerospace sectors. These will be delivered by guest speakers and our in-house specialists and engineering experts. Talks and Presentation Schedule at The Talking Point @ ST Engineering Pavilion 11 Feb 2014, Tuesday 12 Feb 2014, Wednesday 13 Feb 2014, Thursday 14 Feb 2014, Friday 15 Feb 2014, Saturday 16 Feb 2014, Sunday Major James Fowler, Officer Commanding \"B\" Squadron, 2nd Royal Tank Regiment Topic: UK Army Experience from Operational Deployment of Warthog in Afghanistan 11 Feb 2014, Tue, 1130hr to 1200hr 12 Feb 2014, Wed, 1130hr to 1200hr 14 Feb 2014, Wed, 1530hr to 1600hr \"I was commissioned into the Royal Tank Regiment in 1999 and served in Germany, Canada and the UK in various regimental appointments. I instructed the Junior Officers' Tactics Course before attending Staff College on promotion to Major and also worked in the Ministry of Defence Head Office in London as a desk officer in the Special Projects Capability Branch. I then assumed command of Badger Squadron, 2nd Royal Tank Regiment and deployed to operations in Kosovo, Iraq and recently in Afghanistan where I commanded the Warthog Squadron. Join me at the Singapore Airshow where I will be sharing my experiences!\" Brigadier (Ret) Ben Barry, Senior Fellow for Land Warfare, International Institute for Strategic Studies Topic: Strategic Trends in Armoured Warfare and Armoured Vehicles (11 Feb 2014) Soldier Modernisation (12 Feb 2014) Unmanned Systems in Land Warfare (13 Feb 2014) 11 Feb 2014, Tue, 1400hr to 1430hr 12 Feb 2014, Wed, 1400hr to 1430hr 13 Feb 2014, Thu, 1400hr to 1430hr \"In the Defence and Military Analysis Programme, I am responsible for ensuring the quality of the Institute's analysis of land warfare and the information on land capabilities presented in our flagship Military Balance publication. I am also responsible for the formulation and execution of research projects in my areas of expertise. I left the British Army in October 2010. A graduate of Sandhurst, the Army Staff College, the joint Higher Command and Staff Course and the Royal College of Defence Studies, an infantry officer, I have commanded troops at every rank from Lieutenant to Brigadier and in every British infantry role apart from parachute. My regimental experience includes three Northern Ireland tours, two in intelligence appointments, Cold War soldiering in Germany and Berlin, and duties in France, Portugal, Canada and Hong Kong. In my book 'A Cold War; Frontline Operations in Bosnia' I described my battalion's operational tour under both UN and NATO flags. Subsequently I commanded a NATO brigade in Bosnia and instructed at the Rifle Depot, the School of Infantry and led Defence Diplomacy work in NATO countries, Central Asia and the Middle East. My final appointment was leading the British Army's analysis of the lessons of the Iraq campaign. Find out more about my experiences at the Singapore Airshow.\" Tan Yong Lin, Assistant Programme Development Manager, ST Aerospace Topic: Designing UAVs for Security 12 Feb 2014, Wed, 1530 hours \"I first joined ST Aerospace as a system engineer in August 2009 and work on developing our Unmanned Aerial Systems (UAS). My job is to manage the computer software subsystems, and to work with the software people to make sure everything works together perfectly. I was also involved in aircraft weight optimisation and feasibility studies on aircraft recovery systems. Since then, I have had the opportunity to take up various responsibilities related to the UAV business, including programme management and export administration of ST Aerospace's UAV products. My current work involves engaging customers, as well as researching new technologies that will enhance our UAV product line. ST Aerospace has a number of Unmanned UAS products and can be at the forefront of the UAS technology market. I am excited to tell you more about how ST Aerospace has embarked on UAS development and how safety, marketability and performance are built into our UAS products.\" Sing Mong Kee, Vice President, Intelligent Transport Systems, ST Electronics Topic: Integrated Intelligent Transport Systems for Enhanced Mobility 13 Feb 2014, Thu, 1445 hours \"I joined ST Electronics in 2004 and am deeply involved in the Intelligent Transport Systems business. Big cities are addressing their mobility needs by relying more on innovative technology for optimised traffic management and give users real-time transport information. However, many such intelligent transport systems are implemented and operate as standalone systems - they may not work together reliably, At ST Electronics, we design and integrate systems that work together seamlessly all the time. My presentation looks at the power of integration for intelligent transport systems by bringing all the standalone systems together to function as one. This makes for efficiency and a better managed real time multi modal transport information for commuters and fleet operators.\" Chia Jieru, Engineer, ST Aerospace Topic: My ST Aerospace Experience 14 Feb 2014, Fri, 1330 hours 15 Feb 2014, Sat, 1330 hours \"As a young engineer, I find at ST Aerospace an environment that pushes me to do better, to expand my mind. It's tough but builds foundations. With my colleagues, we have to work hard to acquire new knowledge and learn to apply this to real-world situations. I am now involved in modifying the waste and water drainage systems of an Airbus 330 as part of a Passenger to Freighter (PTF) conversion. I like things that challenge me to come up with solutions - this suits my drive as an engineer very well. Come and find out what it takes to be an engineer at ST Aerospace at the Singapore Airshow 2014! Franck Cheung, Engineer, ST Aerospace Topic: Designing Aircraft Systems 14 Feb 2014, Fri, 1430 hours 16 Feb 2014, Sun, 1330 hours \"I have been an aviation enthusiast since I was a kid. When I was reading Mechanical Engineering at Icam-Nantes, France, I became part of ST Engineering in 2010 when I joined ST Aerospace as an intern. I was thrilled to join ST Aerospace as a full-time Engineer for commercial projects two years later. This is a fast-paced company that values and trains its people! Projects are often multidisciplinary in nature and I am now learning aircraft design practice. All this brings me right back to my childhood dream and here I am making a career of it at ST Aerospace! I look forward to meet you and tell you more about what Aircraft Engineering is about at the Singapore Airshow.\" Nicholas Phua, Senior Engineer, ST Electronics (Training & Simulation Systems) Topic: Engineering Balance 15 Feb 2014, Sat, 1400 hours 16 Feb 2014, Sun, 1530 hours \"Being an engineer in ST Engineering is not all just about the traditional images of engineering, no matter how many times the word \"engineer\" appears (yes, pun intended!). My work involves direct interactions with customers, so in addition to my training, I am taking on board skills like understanding and communicating with customers, crafting the perfect proposal while planning the architecture of a next-generation electronics simulation system. My day also involves motivating fellow team members to do better and guide those who are new to our company. Life at ST Electronics is well rounded. We focus on work-life balance and there are company and community events to give us time-outs and to stay sharp. I hope to give you a glimpse into the life of an engineer working on training and simulation systems at ST Electronics, the opportunities for a very fulfilling career and how we balance work and play.\" Tracie Teo, Senior Engineer, ST Kinetics Topic: Custom Engineering Solutions - My Experience as an Industrial Engineer in ST Kinetics 14 Feb 2014, Fri, 1500 hours 15 Feb 2014, Sat, 1300 hours \"After joining ST Kinetics in 2011, I have spent the past two-and-a-half years work to develop better processes to improve the work environment for people on our shopfloor like our machinists and improve factory productivity. At ST Engineering, I work with people and my task is to help them do what they do better. The people I meet are talented and extremely diverse; made up of people who work the factory machines and are experts in what they do, to people who assemble products like our Terrex infantry carrier vehicle. My day can also include meeting senior executives who are focused on the business decisions. I enjoy this because everyone has a story, and I am learning lessons for life every day that broadens my perspective as a professional. Come join me as I share my experience as an Industrial Engineer at ST Kinetics working with people who build the Terrex.\" Harold Au, Senior Engineer, ST Kinetics Topic: Experience as a Design Engineer in ST Kinetics 14 Feb 2014, Fri, 1400 hours 16 Feb 2014, Sun, 1300 hours \"At ST Kinetics, I develop systems to allow armoured vehicles swim across rivers and even in the open sea. I am an amphibious design engineer and work on land mobility platforms like the Terrex and the Warthog. I have experienced the design, analysis, prototyping, testing and integration phases in the design of military vehicles ST Kinetics' Terrex Infantry Carrier Vehicle is widely regarded as one of the world's most advanced and capable 8x8s, and was shortlisted by the US Marine Corps. The Warthog All Terrain Vehicle was deployed extensively by the UK Ministry of Defence in Afghanistan, and has saved many lives through its robust design that protects its occupants against Improvised Explosive Devices. How were these vehicles designed from scratch locally? I will provide a glimpse into the exciting role of a design engineer in this challenging endeavour.\" Mr Neil Jenkins, Chairman, Gibbs Sports Amphibians Topic: High Speed Amphibians and their Applications 12 Feb 2014, Wed, 1445hr to 1515hr \"Gibbs Sports Amphibians is the world's leading developer of high-speed amphibious (HSA) vehicles for consumer, commercial and military use. In 1989, I established Loades Design, a firm that undertook the design, engineering, tooling and production of a number of vehicles including the Aston Martin DB7 Cabriolet, MGRV8, Rolls-Royce Limousines and four-wheel-drives. Five years later, I founded Krafthaus, a company that specialises in lightweight vehicle technology and in 1999, Krafthaus merged with Gibbs Technologies to design and develop a broad range of amphibious vehicles. I assembled a talented team of engineers to bridge the gaps between car and boat design. My Gibbs team went on to develop unique product designs and achieved a number of major engineering breakthroughs. I was awarded the Churchill Medal for the development of high-speed-amphibian vehicles in 2004 and the Sir Henry Royce Medal in 2005. At the Singapore Airshow, I will be sharing on high speed amphibian technology and its applications. Hope to see you there!\" Mr Loh Piang Khuen, Director Programme Development, Military Business, ST Aerospace Topic: C130 Modernisation 11 Feb 2014, Tue, 1445hr to 1515hr \"I joined ST Aerospace in 1991 as an electrical engineer providing support to aircraft maintenance and flight-line operations. From 2007 to 2010, I managed the turnkey ST Aerospace's C130 modernisation programme overseeing the completion of two prototype aircraft. With the successful completion of the prototype modification, I then moved on to programme development in 2010 and participated in securing the first international C130 modernisation programme customer in 2012. Find out how ST Aerospace has modernised the legacy C130 aircraft for our customers, with the latest being a contract for three aircraft for the Royal Air Force of Oman. Besides hearing about my experiences and challenges we faced, I will be showing a video of the actual work done to modernise the C130 from aircraft induction to flight test!\" Mr Ang Yong Lim Thomas, Principal Engineer, ST Kinetics Topic: Enhancing a War Fighter's Capabilities with 40mm Solutions 11 Feb 2014, Tue, 1530hr to 1600hr \"For ten years, I have participated in five 40mm products design and development cycles to create new 40mm solutions to enhance a war fighter's capability in combat. I started working with 40mm SPARCS, where I wrote the first prototype software for the Soldier Parachute Aerial Reconnaissance Camera System (SPARCS). Following this, I was part of the team that developed the 40mm AirBurst Munition (ABM) series in Low Velocity, Extended Range, and High Velocity variants where my responsibilities included ultra low power electronic board design, writing and testing software, inertia power generator design, development of manufacturing processes and conducting of live firings on various weapon systems. Modern war fighters are often face new threats given the myriad of operational scenarios they might face in the present world and possibly the future. By analysing past operations, new threats and capability shortfalls can be effectively addressed using innovations to current weapon systems and ammunition. My presentation shares some insights into ST Kinetics' newest 40mm solutions that enhance a war fighter's capabilities in the field.\" Mr Tan Cheng Hai, Specialist Consultant, ST Electronics (Satellite Systems) Pte Ltd Topic: Introducing ST Electronics' Commercial Earth Observation Satellite Business 11 Feb 2014, Tue, 1600hr to 1630hr \"ST Electronics (Satellite Systems) is a joint-venture between ST Electronics, NTU and DSO and we are developing Singapore's first commercial earth observation satellite named TeLEOS-1. This satellite will be launched into a near-equatorial orbit in the second half of 2015 providing satellite-based GeoServices that will meet demands for applications such as maritime safety and security as well as disaster preparedness and timely consequence management response. Since May 2013, I have been working with the satellite system team to develop satellite-based products and services for TeLEOS-1 and its marketing strategy. I am excited to be involved in Singapore's first commercial earth observation satellite project and am today working with a talented team. Come and find out more about ST Electronics (Satcom and Sensor Systems) Earth Observation Satellite Business at the Singapore Airshow!\" Ms Ng Seo Phei Chloe, Assistant Manager, ST Kinetics Topic: Emergency Response Solutions 13 Feb 2014, Thu, 1600hr to 1630hr \"I started my career with ST Kinetics in 2007 as procurement executive and in 2012, I was involved in business development for the ExtremV. The ExtremV is ST Kinetics' twin-cabin, articulated, amphibious vehicle designed for emergency rescue. This all-terrain tracked vehicle can travel over rough terrain, muddy areas, and snow. A special feature is the interchangeable module of the rear cabin to meet a wide range of disaster relief needs. According to the International Disaster Database, the two most dominant types of disaster in Asia are flood and storm. Recognising the ExtremV's superior performance, the Japanese government has bought our vehicle for their disaster preparedness needs. Find out how the ExtremV, designed and built to save lives, can be deployed for emergency rescue, medical evacuation, transportation of relief supplies and fire-fighting purposes!\" Ms Irmaliah Bte Tukiman, Mr Yeow Xian Ching, Mr Quek Rong Jia Jason and Mr Lee Gen Feng Ron, ST Marine Topic: Voices from ST Marine 13 Feb 2014, Thu, 1530hr to 1600hr 15 Feb 2014, Sat, 1530hr to 1600hr \"We are a group of young engineers from ST Marine! At the Singapore Airshow, we will give an introduction of the shipbuilding process from the design stage through to delivery. While providing the audience with a glimpse of this process, we will also be sharing our personal experiences and encounters at various stages of the shipbuilding process. In all, the audience should be able to have a broad understanding on how a ship is designed, constructed, and delivered, and importantly, how we have benefitted and grown from these experiences!\" ST Engineering (Singapore Technologies Engineering Ltd) is an integrated engineering group providing solutions and services in the aerospace, electronics, land systems and marine sectors. Headquartered in Singapore, the Group reported revenues of S$6.38b in FY2012 and ranks among the largest companies listed on the Singapore Exchange. It is a component stock of the FTSE Straits Times Index, FTSE ASEAN 40 Index, MSCI Singapore and other indices. ST Engineering has more than 22,000 employees worldwide, and over 100 subsidiaries and associated companies in 23 countries and 41 cities. Please visit www.stengg.com .",
    "The focus is on our capabilities as a leading Total Aviation Provider. Includes airframe, component and engine MRO, as well as new service offerings such as VIP aircraft completions and modernisation solutions. C130/L382 Centre of Excellence Innovative Unmanned Air Systems Solutions Integrated Contractor Logistics Support ST Aerospace provides one stop integrated MRO and customised engineering solutions for the C130/L382 operators, with services ranging from airframe structural repair, component and engine repair and overhaul, as well as design, modification and modernisation. Amongst its capabilities is the modernisation solution which resolves equipment obsolescence and allows seamless operations between civilian and military air space. Through interactive demonstrations and animation videos, ST Aerospace will showcase a wide range of customisable engineering and design solutions, which includes the process of modernisation from design through testing. ST Aerospace has partnered Singapore's defence research & development organisation - DSO National Laboratories - to design and develop a series of innovative and indigenous fixed wing unmanned aerial vehicles (UAVs), namely the Skyblade III, Skyblade IV and Skyblade 360. With fully autonomous flight operations, the Skyblade family of UAVs delivers an effective, highly mobile reconnaissance capability for any user. Skyblade UAVs also complement civil applications such as plantation vegetation management and coastal patrol, with runway independent capabilities and intuitive user interface. With a strong culture of continuous innovation and dedication toward fulfilling customer requirements, ST Aerospace will be showcasing its latest UAV product series at the Singapore Airshow 2014 - the USTAR series. The USTAR family boasts of vertical take-off and landing capability, modular design, and swift assembly for deployment. USTAR-X is a quad-rotor platform offering lightweight detachable rotor arms and extreme modularity, empowering users with autonomous surveillance capabilities within a small package. USTAR-Y is a hex-rotor platform, incorporating rotor redundancy, non-line-of-sight video link; the perfect combination for safe and worry-free environmental operations. The USTAR series utilises the latest tablet technology as ground control stations, perfect for the new generation user. A premier MRO service provider with close to four decades of aerospace maintenance and engineering track record, ST Aerospace offers an integrated suite of aircraft support to defence operators globally. Ranging from airframe, component and engine MRO, to engineering design and development, logistics and training, ST Aerospace harnesses its core competencies, to provide end-to-end solutions across a wide range of aircraft platforms, including fighter, transport, helicopter and trainer aircraft. From border surveillance and protection systems to personal data protection, this cluster comprises a collection of customisable solutions aimed at enhancing public safety and security, making towns and cities safer, cleaner and more liveable AgilFence Perimeter Protection System AgilFence RAPIDS Manpack VSAT Terminal Airside Procedural Trainer Automatic Fare Collection System (AFC) Coastal Surveillance Solutions Command, Control & Communications (C3) System for Metro Cyber Training and Cyber Security Solutions Electric Buses Batteries Swapping System Humanitarian Assistance & Disaster Relief (HADR) HyPower Full Electric and Hybrid Electric Drive Solutions for Buses iDirect Aeronautical Communications Solution Infrared Fever Screening System 2 Intelligent Airport Intelligent Building Management System Intelligent Water Management System (IWMS) iTAG Maintenance Management System (MMS) Passenger Information System (PIS) Platform Screen Door (PSD) System Safe City Sand Shark Shore Connector - Hoverbarge Shore Connector - Hovercraft Smart Lighting and Intelligent Communications & Control System (SLIC 2 ) Smart Utilities Suite Submarine Support and Rescue Vessel (SSRV) TeLEOS-1 TRXBUILD Construction Equipment & LeeBoy Road Construction Equipment Under the Environmental Solutions Cluster, a city centrepiece will feature key solution concepts for Future Cities, which include Intelligent Water and Building Management systems, as well as a suite of in-house developed rail electronics solutions to address every city's need for efficient infrastructure and enhanced mobility. As 'Smart' becomes the new 'Green', ST Electronics offers our eco-enabling Smart Utilities Suite and Smart Street Lighting solutions. Our land and maritime surveillance solutions will feature through the Integrated Coastal Surveillance Solutions, Comprehensive Maritime Awareness System and the award-winning AgilFence Integrated Perimeter Intrusion Detection System. Addressing a growing need to manage the security and safety of cities, our command and control capabilities through our Safe City and Intelligent Airport Solutions are now complemented by an Airside Procedural Trainer. And with new cyber threats arriving at our shores recently, ST Electronics' data protection and cyber defence capabilities through our latest Cyber Training & Mobile Security Solutions will prove to be solutions that agencies and corporates may find increasingly relevant. This year's pavilion will also feature our advanced technologies in satellite communications through the iDirect Airbourne Routers and Manpack Terminal, as well as a replica of the X-Sat and the newly announced TeLEOS-1, Singapore's first commercial earth observation satellite which will be launched in 2015. Riding on the success of implementing the highly innovative FBG-based perimeter intrusion detection system for Changi Airport, ST Electronics AgilFence PIDS is now offering an integrated perimeter protection solution with the world-leading Genetec unified security platform. ST Electronics' suite of fence-mount, wall-mount, buried and free-standing intrusion detection systems can now be integrated with CCTV, thermal cameras, and video analytic systems via Genetec's Security Centre for perimeter surveillance and intrusion detection. This perimeter security platform offers highly accurate intrusion detection and instantaneous visual verification, enabling a facility's security force to respond quickly and effectively to intrusions. The AgilFence PIDS for fence-mount, wall-mount and buried requirements uses advanced optical fibre sensors known as Fibre Bragg Grating (FBG) that are embedded in the optical fibre cable to form an array of sensors for perimeter fence intrusion detection, AgilFence PID's extremely sensitive FBG sensors recognises incidents in various scenarios where very slight environmental distance to the physical parameters will trigger a response in the optical fibre sensor that translates into an intrusion alert to the command centre. A number of critical infrastructures and high security areas face a dilemma when the fence type is not suited for a conventional fence-mounted PIDS. Often the challenge lies in having a perimeter without any kind of fencing or where there is a preference to preserve the physical aesthetics of the area. The AgilFence RAPIDS free-standing PIDS is an advanced Electronically Scanning Radar (ESR) designed for perimeter protection. It creates an invisible detection zone that triggers an alarm when an intrusion occurs. Its reliable detection capabilities and discreet appearance make it an ideal choice in securing and monitoring key assets and critical areas. The AgilFence RAPIDS uses proven solid-state ESR technology. Its packaging and durability offer a game-changing system in \"virtual\" perimeter intrusion detection. Being a radar, the AgilFence RAPIDS provides both Doppler speed and location information (range and angle), allowing better target discrimination. This offers a superior false alarm control compared to many motion-sensing microwave systems which only sense movements but do not provide target location information. The Manpack VSAT Terminal operates in Ku-Band (13.75GHz to 14.8GHz) and can be deployed in less than 10 minutes with the help of the embedded intelligent sensor system. Measuring just 552mm(L) x 312mm(W) x 245mm(H), it is one of the smallest of its kind available in the industry and is highly portable and delivers high performance. Airside Procedural Trainer (APT) is specially designed to train drivers who need to operate in airside roads, aprons and other manoeuvring area that may include runways. APT creates a virtual 3D environment that provides a realistic experience of airside traffic for trainee drivers. It allows trainee drivers to learn driving in various airside zones without danger, removing the need for special arrangements usually required for driving in these highly sensitive areas. The Automatic Fare Collection System (AFC) is a solution for fare collection and payment. This state-of-the-art solution is uniquely designed for the revenue services requirements of modern transit operations. The AFC also enables transit operators to expand revenue opportunities, exploit the benefits of payment integration with other transit operators as well as non-transit service providers. AgilTrack, an in-house developed Radar Extractor & Tracker enables users to unleash the full potential of their radar capabilities to detect and track the smallest and often challenging targets, including swimmers and small rigid inflatable boat. Many radar tracking systems are currently under-performing due to high false alarm rates or the inability to detect small targets. Through conscientious R&D efforts, ST Electronics has specially designed a radar extractor and tracker system that runs on a Track-Before-Detect (TBD) algorithm. This powerful software engine enables the detection of small targets even in noisy and heavily cluttered environments. The AgilTrack Radar Extractor & Tracker has a unique capability that allows tracking of small targets in an auto-initiation mode in a 360° sector. Conventional systems have difficulty operating in this mode because of the high false alarms generated. AgilTrack Radar Extractor & Tracker is particularly suited for handling any element of surprise encountered in a situation of threat, from all angles. The metro C3 system is a proven realtime operational-centric platform for driverless MRT system developed by ST Electronics. It provides control, supervision and full situational awareness of the entire line's electrical and mechanical equipment. Unlike conventional railway Supervisory Control and Data Acquisition Systems, the C3 system completely integrates the operations, effectively uses Decision Support Systems as an aid especially during incident and emergency situations. At the heart of the C3 is an integrated suite of modular software systems certified to Safety Integrity Level (SIL) 2 and designed to meet international standards such as EN50128. Versatile and featuring low life-cycle costs, the C3 integrates different subsystems in trains, tunnels, passenger stations, power substations and depots to enable fully automated, safe, effective and efficient rail operations. ST Electronics provides a holistic approach to mitigate risks such as cyber-attacks and information leaks which are increasingly posing serious threats to governments and enterprises worldwide. The company delivers comprehensive cyber security solutions that incorporate protection, detection, response and recovery capabilities. It adopts a continuous and cyclical evolution of security systems which places emphasis on people, process and technology to form an Integrated Cyber Defence Framework. It has also successfully designed, built, implemented, operated and maintained Cyber Security Operation Centres for the government and commercial organisations. In order to address the varying needs in the cyber security industry, ST Electronics has designed a range of security products under the brand name DigiSAFE to focus in securing end-point devices, communications and networks, mobile security, media security and authentication. These high assurance products are purpose-built to meet the stringent requirements of customers. They represent the best in research and development to fit seamlessly into any enterprise security architecture. In addition, ST Electronics recognises the importance of highly trained security professionals in any successful cyber security operation. Coupled with this growing need for cyber security professionals, it has set up a new DigiSAFE Cyber Security Centre to offer cyber security training tailored for both new and existing cyber security professionals to develop and enhance their competencies in this area. The Centre allows organisations to simulate their own information and network environments to train their security professionals with realistic operational and threat scenarios. Trainees are equipped with the latest operational cyber security skill sets through the courseware offered. The Centre started operation in December 2013. ST Kinetics offers state power agencies and bus OEMs an integrated solution for battery swapping and charging stations in electric buses' transportation infrastructure. Our integrated solution can be customised according to the running needs of the electric buses with features like full automatic quick battery swapping, intelligent vehicle navigation and even remote monitoring of the electric buses' running status. The Endurance series of Landing Platform Dock vessels The ENDURANCE series is a well proven multi-purpose, multi-role platform purposefully designed for naval and civilian operations including Humanitarian Assistance and Disaster Relief, Peacekeeping Missions and Counter-Piracy Operations. Over the past decade, it has been deployed and had served very well in these capacities. Shore Connector - Brave Series (Military) The Brave series of Fast Landing Craft is a series of high speed shallow draft vessels designed to offer both high speed and abilities to carry varied payloads unmatched by ordinary landing craft. ST Kinetics' HyPower Full Electric and Hybrid Electric drive solutions are the answers to a green environmental transportation network. We work with bus OEMs on full electric and hybrid electric drive conversions, as well as incorporating the HyPower solutions into new vehicle designs. Full Electric Bus Solutions Besides minimising exhaust and noise emissions, the HyPower Full Electric Bus Solution features a three-speed dual clutch transmission, which brings about significant weight reduction, improved efficiency and low power consumption. As a result, buses fitted with HyPower Electric Drives can travel further and carry a heavier passenger load. The installed smart vehicle motor and controller feature both innovation and safety; such as real-time monitoring of the battery system's state of charge and health status, and establishing a reliable linkup to the local control and command centre. Hybrid Electric Bus Solutions Combining the advantages of series and parallel configurations, the HyPower Hybrid Electric Bus Solutions maximise engine efficiency while minimising emissions and noise pollution. The lightweight engine used in the Hybrid Electric Bus Solutions yield fuel efficiency of 20%-30% and reduced carbon footprint. Apart from cost-savings through greater fuel economy, the HyPower Hybrid Electric Bus Solutions require no transmission, promote easy driving and maintenance, while being environmentally friendly. Communication is imperative to successful military operations. Significant breakthroughs in speed and throughput of satellite communications (satcom) have made airborne satellite communication (satcom) a reality and as reliable and effective as ground-based communications. Airborne applications allow war fighters to use bandwidth for a multitude of tasks without experiencing any degradation in performance or throughput. It can quickly and accurately transmit, in realtime, large amounts of data generated by countless devices. Today, airborne satcom is successfully used for intelligence, surveillance and reconnaissance (ISR) mission, for routine voice, video and data applications for the military, and to fortify emergency response support. It is a proven tool for command assignments, target information imagery, and imagery of natural and man-made disasters. Evolution 8000 Series Satellite Router (e8350) Developed to meet the most rigorous mobility and security requirements, the Evolution 8000 Series Satellite Router provides fast, secure and reliable military grade connections. With the integration of spread spectrum technology and DVB-S2/ACM, along with advanced FIPS-certified TRANSEC security and advanced QoS functionality, the Evolution 8000 Series provides an optimal efficiency balance of high-speed and security. Evolution iConnex e800 Series Satellite Router Board The Evolution series satellite router boards are designed to be easily integrated into portable solutions. To meet the most rigorous demands for mobility and security with TRANSEC and FIPS 140-2 L2, Evolution iConnex boards deliver always-on broadband capabilities into smaller form factors that support data, voice, and video connectivity in highly mobile military and government applications. The e850mp-IND has been industrialized to MIL Standard requirements for extreme operational conditions. In our fight against the Severe Acute Respiratory Syndrome (SARS) in 2003, ST Electronics together with DSTA and STELOP, developed and designed a system known as Infrared Fever Screening System (IFSS). IFSS uses leading-edge electro-optics technology and allows for rapid realtime mass screening, identifying individuals with high fever, one of the symptoms for flu like diseases such as SARS, MERS, Avian Flu (Bird Flu). After years of proven performance, reliability and service, STELOP has taken the success of the IFSS for fever screening to the next level and developed the IFSS 2. The new version is ergonomically designed and automated for quick deployment and instant usage. Using touch screen menus, it allows the user to pre-configure for a host of detection alerts ranging from built-in audio/visual to email/SMS alarms. IFSS 2 can also double up as an automated security screening and alert management system. Facial detection and tracking Wired/Wireless smart devices connectivity Automated Security Screening and Alert Management System Rapid realtime mass screening for identifying individuals with fever With ever increasing passenger traffic and demands, airports have to run their operations more efficiently and effectively. Airport operations are dynamic, complex and time sensitive and are managed by various stakeholders. Intelligent Airport empowers airport operators to effectively fulfil their core function of handling air traffic arrivals/departures, providing seamless connectivity while delivering first class service to passengers. It operateson an integrated multi-mission, multi-partner environment, sharing information collaborating amongst all stakeholders. The Intelligent Airport consists of the following components: Passengers Centric Experience - provides realtime flight information updates and notifications of changes for passengers in the terminals. Airport Communication Suite - as the communication medium of the system, it tracks and provides information enabling faster communication, response, resource planning and coordination among allstakeholders. One Glance Visualisation - collaborates, shares and creates a common relevant situation picture of key airport assets and resources for better situational awareness and response. End to End Simulation - combines air, land and terminal simulation for precise forecasting, enhancing operation decision support and experimentation on future ATM concepts. Airport Collaborative Decision Making - supports EUROCONTROL Airport Collaborative Decision Making initiative with in-built rules to maintain and share accurate information, particularly relating to arrival/departure timings. Smart Analytics with Insight (SAINT) - telemetry data analytics and business intelligence offers sense-making predictions capabilities to identify anomalies for early resolution and rectification. ST Electronics' Intelligent Building solution provides a wide range of innovative systems to support the ever growing demand of sustainable environmental development. Our Intelligent Building Green Thrust strategy focuses on the importance of energy conservation and protection of the environment while ensuring building operation efficiency; without compromising comfort and responsiveness. Our offer includes Intelligent Building Management System, Smart Building Energy Management System, Integrated Security Management System and Car Park Guidance System. The Intelligent Water Management System (IWMS) is an end-to-end water management system for the effective management of water operations and resources. It enables quick and efficient response to water incidents such as leaks, intrusions or changes in demands. A suite of dashboards and reports, driven by analytics and a decision support capability, enable water operators to have an overview of the water situation at all times. ST Electronics deployed the IWMS for PUB, Singapore's water agency. This allows the PUB's Operations Centre to interact and exchange information with its field crew, as they collaborate to resolve incidents in an integrated manner. Pertinent information is displayed visually and interactively, allowing operators to track the progress and status through images, videos and other data such as asset information. The system will also be able to recommend courses of action depending on the types of events. ST Electronics offers a full service for the IWMS systems, from consultancy to implementation according to users' needs. iTAG is a patented and field proven electronic device that captures personal information as well as time sensitive medical information. Treatment data can be recorded, providing critical information for evacuation and follow-up treatments and this shortens and strengthens the whole treatment process. The safety and well-being of emergency/ defence personnel can be assured through these measures and this can help save lives. iTAG combines large memory space with NFC's ease of use and the ability to read/write either contact and contactless. Maintenance management is an essential part of the transport industry as it involves the management of large amounts of assets. Traditionally, maintenance management is carried out manually involving substantial paperwork, planning of preventive maintenance and tracking of completed work. The entire manual process from registration of assets, to storing transactions, and recording of the maintenance work undertaken can be extremely labour intensive, slow and prone to errors. MMS is an automated maintenance system that integrates operational and organisational processes such as fault reporting to optimise both operational and cost effectiveness. The Passenger Information System (PIS) is designed to enhance the metro travel experience by providing a wide array of information catering to all transit passengers. The technology delivers realtime information updates and offers information on-board trains and in stations. PIS offers ability to deliver such information to transit passengers in a mixture of text, graphic and video formats for passengers' safety and infotainment and revenue can also be derived through advertisements. Designed to be modular for ease of implementation and maintenance, PIS can be customised to meet specific requirements and retrofitted on operational metro transit systems with minimal disruption. The Platform Screen Door (PSD) System is a turnkey system designed to meet the needs of metro networks to improve safety and comfort within the platform environment. It is offered as a scalable half-height or full-height screen door system engineered to meet the heavy-duty requirements of the busiest metro systems of the world. PSD is ideal for high commuter traffic networks such as stations in modern metros, light rail transit systems and automated people movers. In addition to its many safety aspects, the doors reduce the level of noise and wind blasts caused by the trains as they pull into and out of the stations. They also enable energy conservation by improving the efficiency of air-conditioning, heating and ventilation systems. Safe City employs new technologies to enhance existing systems to deliver a high level of interaction and control to provide better visibility, understanding and management of safety within the city. Safe City enables city administrators to feel the pulse of the city, through sense-making and predictive analysis of information. It measures the parameters of the city beyond physical sensors by also taking input from its citizens. The ubiquitous popularity of mobile applications allows citizens to report and share information on public issues and hazards. Information available and shared on open platforms, such as social networks and online media can also provide insights to matters that concern the city and the quality of life of its citizens. LeeBoy's Sand Shark is an exceptional beach cleaner that had proven itself by cleaning US beaches affected by the 2010 Gulf of Mexico oil spill. Capable of sifting objects as small as two milimetres in size, the Sand Shark is a variant of LeeBoy's versatile 3000 Force Feed Loader , which features a climate-controlled operator's cab that enhances safety and provides superior visibility of the front pickup feeder and rear discharge conveyor. The Hoverbarge is designed using a modular concept which enables transportation to lesser accessible areas for deployments. The Hoverbarge, designed to carry a significant payload, is also capable of overcoming terrains such as swamps, shallow water, wet sands, mud-flats and reduced environment. The Tiger 30TD HoverCraft is designed for commercial applications in areas where traditional modes of transportation area difficult. With its high speed and flexible deck space, it can be deployed for a myriad range of tasks including for the mining and oil and gas industries and operations such as transportation, search and rescue and oil spill containment. ST Electronics' Smart Lighting and Intelligent Communications & Control System (SLIC 2 ) provides efficient and cost-effective management of mass lighting on the streets/highways and in premises such as car parks, petrol stations and other industrial and commercial facilities. The SLIC 2 family of outdoor mass lighting management solutions is designed to provide realtime access to the operational status of street lights such as power consumption readings and other dynamic lighting parameters, anytime and anywhere. Advances in technologies and smart sensors have changed the way lighting is managed in environmental cities and along highways. Governments and maintenance companies have realised that such technologies and sensors help to significantly reduce energy consumption and operating and maintenance costs through the enhanced management of mass street lighting. ST Electronics' Smart Utilities Suite enables utilities providersto increase operational efficiencies, reduce carbon emissions and empower their customers to manage their consumption of utilities such as water, electricity and gas, through efficient monitoring processes and systems. The Smart Utilities Suite provides flexible and secure Advanced Metering Infrastructure (AMI), ideal for utilities providers. The AMI is compatible with a wide range of meters that provide high performance integrated management systems to enable seamless and efficient network management. Through a Public-Private Partnership, ST Marine was awarded a contract to Design, Build, Own & Operate the Submarine Support and Rescue Vessel - the first of its class developed to meet the submarine rescue requirements of the Republic of Singapore Navy. Key features: - Good speed and seakeeping performance - Highly manoeuvrable - Dynamic Positioning Capability (DPS-2) - Able to carry an organic submarine rescue payload and an integrated Transfer Under Pressure system Following the success of XSAT, ST Electronics is currently developing Singapore's first commercial Earth observation satellite \"TeLEOS-1\" to be launched into a 550km Near Equatorial Obit (NEO) for commercial imagery service in 2015. The 450kg satellite is equipped with an electro-optical camera payload capable of performing imaging at ground resolution of up to one metre which is well suited for applications such as disaster and environment monitoring, maritime safety, costal surveillance, urban planning and homeland security. Another added advantage is that the unique Near Equatorial Orbit allows frequent revisit to areas of interest located in equatorial regions at approximately every 96 minutes interval, hence delivering high temporal coverage and operational responsiveness. TRXBUILD Construction Equipment TRXBUILD is the construction equipment brand of ST Kinetics. Established in 2010, the global brand is making an impact with its range of rugged and productive construction equipment. Its range of productive construction equipment include excavators, dump trucks, pavers, milling machines, asphalt and concrete mixing plants, and multi-functional high-speed engineering equipment. TRXBUILD's range of equipment is distributed in more than 30 countries globally. LeeBoy Road Construction Equipment Since 1964, LeeBoy has been manufacturing road construction and maintenance equipment in the US. Today, it is the leading maker of commercial class pavers in North America, well known for its quality and innovative design. LeeBoy expanded into Asia with the establishment of LeeBoy India in 2010 and now distributes its products in more than 20 countries worldwide, in North and Central America, Africa and South Asia. ExtremV The ExtremV Emergency Response Vehicle (ERV) is an evolution of ST Kinetics' highly successful family of all-terrain tracked vehicles. The EXTREMV provides multiple essential capabilities for disaster relief missions, ranging from emergency rescue and medical evacuation, to logistics transportation and fire fighting. Demonstrating extreme mobility in difficult terrain, the back cabin of ExtremV allows flexible configuration for multiple disaster relief missions, ranging from emergency rescue, medical evacuation, to fire fighting and transportation of essential supplies. The ExtremV enables quick response and relief into difficult-to-access areas with its high mobility and keeps the vital flow of emergency personnel and supplies going immediately after disaster hits with its high and versatile payload. With its high efficiency and cost effectiveness, countries can ensure the robustness of their disaster relief supply chains for emergency personnel and supplies to get quickly to disaster-hit areas. Advanced communications systems, land and sea vehicles, sensors and simulators, these are some of the latest innovative solutions and platforms from our electronics, land systems and marine sectors that are designed to enhance the effectiveness of the modern warfighter. Visitors will also be able to get their hands on the latest weapons and ammunition on display. C4i Suite For Land Platforms: CETEON MIL-SPEC Vehicular Computers and Multi-Functional Displays C4i Suite For Land Platforms: CETEON MIL-SPEC Vehicular Computers 515 and 530 C4i Suite For Land Platforms: CETEON Panel Computers C4i Suite For Land Platforms: CETEON Rugged Multi-Functional Displays C4i Suite For Land Platforms: CETEON TXF1500 C4i Suite For Land Platforms: SuperneT™ Vehicular Integrated Communication System (ST6800 VICS) C4i Suite For Land Platforms: Integrated Battlefield Management System (iBMS) C4i Suite For Land Platforms: Advanced Combat Man System Lite (ACMS Lite) C4i Suite For Land Platforms: CETRON Next Gen Tactical Command Post Communications & Sensors: Mini-T Communications & Sensors: Coris Grande Communications & Sensors: Uralis Communications & Sensors: Sharp I2 LR Communications & Sensors: Sharp I2 iNBA-5 - intelligent Nulling & Beam Forming Antenna 5 MÄK VR-Forces MÄK VR-The World Server MÄK VR-Vantage MÄK WebLVC Suite MÄK WebLVC Server Maritime Security: Fearless-55 MK II & Fearless-75 MK II Maritime Security: New Generation Offshore Patrol Vessel, NGF & LMV STellar DLink - Digital Data Link System Training & Simulation: F-16 Mission Trainer Unmanned: Venus Unmanned Surface Vehicle (USV) Unmanned: Venus Autonomous Underwater Vehicle (AUV-3) Urban Fighting: Mobile Reconnaissance Robots Urban Fighting: Tactical Throwing Sensor Urban Fighting: Forward Sensor System ST Electronics will feature advanced technologies and solutions with a focus on integrated defence under a Combat Cluster. The Combat Cluster will showcase Communications and Sensor systems and a series of ruggedised computer systems, as well as C4I suite for land platforms and command posts, electro-optics solutions, satellite communications systems, unmanned systems for maritime security and a flight simulator and other simulation solutions. CETEON MIL-SPEC Vehicular Computers and Multi-Functional Displays The CETEON family of MIL-SPEC Rugged products comprises the Vehicular Computers 515 and 530, Panel Computers, Multi-Functional Displays and TXF1500. This comprehensive range of rugged vehicle mountable computers, displays and handheld computing devices are designed to drive the most demanding Command, Control, Communications and Computer (C4) applications in the field. CETEON MIL-SPEC Vehicular Computers 515 and 530 The CETEON MIL-SPEC Vehicular Computers 515 (MVC515) and 530 (MVC530) feature the latest iCore processor and is geared to perform under harsh environments. The MVC 530 offers a comprehensive range of input/output interfaces for superior connectivity, easy deployment and superior power management, making it the ideal rugged computer suited for tracked vehicles. The compact MVC 515 offers high portability, superior power management and is ergonomically designed for easy deployment and handling, making it suitable for deployment on any wheeled vehicles. CETEON Panel Computers The CETEON Panel Computers series (P Series) offers high performance rugged computers that are integrated with superior quality touchscreen displays for military applications. With the latest iCore processors, it is designed to perform under harsh environments and offers customisable interfaces and comprehensive connectivity options as well as advanced power management. It is available in a variety of sizes to suit various operational requirements. CETEON Rugged Multi-Functional Displays The CETEON rugged Multi-Functional Displays are high performance displays designed for military applications. Boasting superior graphics and the latest multi-touch projected capacitive touch screen technology, the CETEON Rugged Multi-Functional Displays' ergonomic design and user-friendly interfaces make them ideal for deployment on both tracked and wheeled vehicles. It is available in different sizes to suit various operational requirements and space constraints in the vehicles. CETEON TXF1500 The rugged CETEON TXF1500 transforms the way operational information is shared in the field. It comprises a lightweight, ultra-portable pocket-sized Handheld Computing Device which offers dismounted commanders or soldiers the ability to plan and organise operations while on the move in the field. This high performance device offers a multi-touch projected capacitive touch screen that delivers graphics with enhanced clarity. SuperneT™ Vehicular Integrated Communication System (ST6800 VICS) The SuperneT™ VICS is a flexible, ruggedised and reliable IP based communication and network solution suited for military and para-military applications in harsh tactical and mobile environments. It can be deployed in wheeled and tracked combat vehicles, as well as small marine vessels which commonly operate in mobile and fast-changing network environments. As a key enabler for network-centric fighting capabilities, it provides a networked platform to integrate various C4 (Command, Control, Communications and Computers) systems to enhance inter-connectivity, survivability and interoperability in the field. Integrated Battlefield Management System (iBMS) The integrated Battlefield Management System (iBMS) provides the ability to network and share information among friendly forces. It is also able to provide an updated picture of enemy conditions detected by friendly forces. The Blue Force Tracking (BFT) system provides commanders with precise updates of \"own force\" locations through Global Positioning System (GPS), thereby reducing the chances of fratricide. The system's collaborative tools allow commanders to participate in mission planning and share information on overlays, tactical situational picture and logistics updates. The iBMS offers improvement in situational awareness across fighting units allowing the battalion headquarters to command and control its forces more quickly and effectively. Advanced Combat Man System Lite (ACMS Lite) The lightweight Advanced Combat Man System Lite (ACMS Lite) provides seamless connectivity while on-the-move and a common situational awareness for soldiers and tactical commanders. The ultra-portable ACMS weighs less than 2kg and enhances the survivability, mobility, lethality and sustainability of soldiers in the field. The ACMS Lite allows for integration with other ACMS configurations to provide a comprehensive and common operational picture among all troopers. In addition, its compact and ergonomic design makes it easy to deploy and handle. The modular design of the ACMS makes it easy to maintain while being future-proofed for scalability, quick integration and technology enhancements. The compact and highly versatile ACMS Lite consists of a lightweight palm-sized smart mobile device loaded with Command and Control (C2) Apps, a wireless mobile ad-hoc network module, navigation systems and a central power system. It is also equipped with an efficient power management feature to optimise power consumption for the system. CETRON Next Gen Tactical Command Post The CETRON Next Gen Tactical Command Post (TAC CP) is a compact, quick deployable network-centric C4 system that can be implemented on any vehicle configuration, whether tracked, such as the Bronco or wheeled, such as the Operations Utility Vehicle. The TAC CP allows commanders to maintain topsight over the battlefield as well as collaborate and communicate with headquarters, peers and subordinates to share a common situational picture in the field. It serves as the forward echelon of field headquarters and is typically located well forward in the battlefield so that the commanders are closer to their subordinates and can directly influence operations. Mini-T The Mini Turret is a stabilised day/night surveillance payload specially designed for moving platforms and quick mobile applications. It is developed for patrol and unmanned crafts and mobile surveillance systems. Coris Grande CORIS GRANDE is a portable Target Acquisition System that features both day and night cameras. Lightweight at only 2kg (including primary battery pack), CORIS GRANDE has a North-finding capability with an accuracy of 0.5° (1Sigma) and a positioning capability with an absolute accuracy of 5metres CEP (Circular Error Probability). In addition, its Laser range finder can measure a NATO target's position up to 2km. Uralis URALIS, an uncooled thermal imaging system, is designed specifically as a weapon sight for various types of crew-served weapons. Lightweight and ergonomically designed, it can also be used as a handheld device for surveillance in daytime and in the night under adverse weather conditions. Sharp I2 LR The SHARP I2 LR is an in-line thermal imaging device front loaded on a sniper or rifle scope that enables the operator to engage targets both in the day time and at night. Sharp I2 The Sharp I2 is a clip-on Thermal Imaging device that can be mounted directly in front of a sniper scope and enables a sniper to see and accurately engage targets both in the day as well as at night. iNBA-5 \" i ntelligent Nulling & Beam forming Antenna 5\" is a robust system designed leveraging on the state-of-the-art technologies in both beam forming and nulling using a 5-element smart antenna array to achieve the objective of interference immunisation. It can be operated with all Global Navigation Satellite Systems (GNSS) receivers. The Controlled Radiation Pattern Antenna technique is considered to be the best Global Positioning System (GPS) pre-correlation protection technique against interference. It consists of an antenna array and a processing unit that performs a phase-destructive sum of the incoming interference signals, this process being equivalent to making nulls towards interferers in the array radiation pattern. Being modular and customizable, iNBA5 is the cost effective solution that enable sustained GPS signals reception to support critical operations whereby navigation precision and time synchronisation are the outmost requirement. VR-Forces is a powerful and flexible Computer Generated Forces (CGF) platform to fill synthetic environments with environmental, battlefield, maritime, and airspace activity. It has all the necessary features for use as a tactical leadership trainer, threat generator for training and mission rehearsal systems, a synthetic environment for experimentation, an engine to stimulate C4I systems, behaviour model testbed, or CGF application. VR-The World Server is a simple, yet powerful, web-based Streaming Terrain Server, developed in conjunction with Pelican Mapping. It is delivered with a global base map, allowing users to populate it easily with their own custom source data through a web-based interface. VR-TheWorld stores and streams elevation, imagery, and features including roads, buildings, and trees to multiple applications simultaneously. VR-TheWorld Server is seeded with over two terabytes of global elevation and imagery data - pre-tiled for high-performance access. VR-Vantage suite of products offers unprecedented flexibility in visualisation and is tailored to fit different simulation designs. It allows users to fulfil their wide-ranging visualisation needs. With Flexible licensing, users can retain both run-time control and terrain agility. The MÄK WebLVC Suite is a collection of web-based applications that expand the reach of live, virtual, or constructive simulations. Users can now observe, control, and participate in simulations from any computer or mobile device with a compatible web browser and access to a simulation network. MÄK WebLVC Suite Apps can interact with existing simulations or be a platform for new applications. The MÄK WebLVC Server is the linchpin that connects web-based simulation federates to DIS/HLA federations using the WebLVC Protocol*. The Server, based on our VR-Exchange interoperability portal, implements the server side of the WebLVC protocol so web-based federates can participate in a distributed simulation. The federation may be using DIS, HLA 1.3, HLA 1516, HLA Evolved, TENA, or any other protocol for which a VR-Exchange \"Broker\" exists. On the client side, we offer a set of s it to travel longer distances and deeper into the sea during mine hunting missions without risking the mother craft. Multiple vehicles can also be deployed to increase the operational effectiveness of a mission. Versatile and robust, the AUV-3 is a cost-effective capability force multiplier. It is equipped with advanced sensors, navigation and communications features to enable effective seabed surveys. It is engineered to be easily deployed from shore or from any Craft of Opportunity (COOP) without the need for costly handling equipment. The AUV-3 can be further configured to suit other applications such as research, commercial and homeland security operations. Mobile Reconnaissance Robots The Tactical Throwing Sensor (TTS) and Forward Sensor System (FSS) are mobile reconnaissance robots specially designed to wirelessly provide realtime video feeds for situational awareness to a Control Display System (CDS) before military and homeland security personnel are sent into an incident location. It also offers great advantages in low ambient light or total darkness as the built-in infrared optical system is activated to provide a clear realtime video feed that can be transmitted to a Control Display System (CDS). Tactical Throwing Sensor The Tactical Throwing Sensor (TTS) provides easy manoeuvrability for indoor environments. It is designed to be thrown through a window or a doorway. The robot's movement is controlled by the CDS and a good view of the environment is available before teams are sent into the area. The extremely quiet TTS makes it an ideal solution for reconnaissance operations. Tested to meet stringent MIL STD-810G environmental standards, the TTS stands up to rough handling and operates up to a range of 150 metres from the CDS. The complete system that comprises the sensor robot and the CDS is highly portable and easy to deploy for any operation. Forward Sensor System The Forward Sensor System (FSS) is equipped with powerful motors and heavy-duty wheels to navigate quietly through difficult terrains and provide critical real-time video reconnaissance. Optimised for mobility, speed and power, the FSS is specially built to operate in a variety of outdoor environments - dirt-filled, sandy or rocky terrains. The lightweight FSS can be carried around easily and deployed within seconds, moving quickly to areas of interest to carry out covert surveillance. ST Engineering (Singapore Technologies Engineering Ltd) is an integrated engineering group providing solutions and services in the aerospace, electronics, land systems and marine sectors. Headquartered in Singapore, the Group reported revenues of S$6.38b in FY2012 and ranks among the largest companies listed on the Singapore Exchange. It is a component stock of the FTSE Straits Times Index, FTSE ASEAN 40 Index, MSCI Singapore and other indices. ST Engineering has more than 22,000 employees worldwide, and over 100 subsidiaries and associated companies in 23 countries and 41 cities. Please visit www.stengg.com .",
    "Smart Solutions for Connected Cities about ST Engineering's smart city solutions in the areas of autonomous mobility, public and cyber security, smart sensor networks, data and video analytics, environmental engineering and robotics. Find out how our smart city solutions help enhance communications, mobility, public safety and security and contribute to a green future. Visit the Smart City cluster at the ST Engineering Pavilion to learn how our solutions address pressing challenges posed by a rapidly urbanising and connected world. Read on to and follow our news and videos ! Smart Solutions for Connected Cities about ST Engineering's smart city solutions in the areas of autonomous mobility, public and cyber security, smart sensor networks, data and video analytics, environmental engineering and robotics. Find out how our smart city solutions help enhance communications, mobility, public safety and security and contribute to a green future. Visit the Smart City cluster at the ST Engineering Pavilion to learn how our solutions address pressing challenges posed by a rapidly urbanising and connected world. Read on to and follow our news and videos ! Transforming Transportation with Smart Technology City transportation is an important pillar for quality of life. The next-generations technologies embedded in our products and solutions such as our intelligent transport management systems, autonomous vehicles, and maritime surveillance systems, play a critical role in strengthening the reliability and efficiency of land and sea transportation networks. Transforming Transportation with Smart Technology City transportation is an important pillar for quality of life. The next-generations technologies embedded in our products and solutions such as our intelligent transport management systems, autonomous vehicles, and maritime surveillance systems, play a critical role in strengthening the reliability and efficiency of land and sea transportation networks. Autonomous Mini-Bus Our autonomous mini-bus can serve as on-demand shuttle buses for low-ridership routes that are dynamic and responsive to riders' real-time demand, or regular routes during off-peak hours. They are able to sense and recognise its surroundings and avoid obstacles such as vehicles and pedestrians in a safe and reliable way, without compromising passengers' safety. Autonomous Mini-Bus Our autonomous mini-bus can serve as on-demand shuttle buses for low-ridership routes that are dynamic and responsive to riders' real-time demand, or regular routes during off-peak hours. They are able to sense and recognise its surroundings and avoid obstacles such as vehicles and pedestrians in a safe and reliable way, without compromising passengers' safety. Our autonomous mini-bus can serve as on-demand shuttle buses for low-ridership routes that are dynamic and responsive to riders' real-time demand, or regular routes during off-peak hours. They are able to sense and recognise its surroundings and avoid obstacles such as vehicles and pedestrians in a safe and reliable way, without compromising passengers' safety. New Technologies that Secure Airports As public security continues to be a pressing concern for built-up cities worldwide, enhancing aviation security worldwide is critical in keeping the traveling public safe and secure. Smart technologies which make our airports safer including counter drone capabilities to aid decision and sense making; biometrics technologies to manage mass secure access to restricted airport areas; intelligent video analytics technology to ease manual and labour-intensive airport security operations - are featured at the ST Engineering Smart City Showcase. New Technologies that Secure Airports As public security continues to be a pressing concern for built-up cities worldwide, enhancing aviation security worldwide is critical in keeping the traveling public safe and secure. Smart technologies which make our airports safer including counter drone capabilities to aid decision and sense making; biometrics technologies to manage mass secure access to restricted airport areas; intelligent video analytics technology to ease manual and labour-intensive airport security operations - are featured at the ST Engineering Smart City Showcase. Airport Identity Verification System The Airport Identity Verification System will help airports go beyond the use of smartcards. The multi-modal authentication system complements the standard smartcard system by using proven biometrics technologies in facial, iris and contactless palm vein recognition. With our easy to use self-registration kiosk, visitors and staff can enroll their facial, iris and palm biometrics in just a few minutes. This helps to reduce the manpower required to manage visitor passes registration. Airport Operations Centre System The Airport Operations Centre System presents a unique solution for smooth and effective airport management with a comprehensive overview of critical operations in the dynamic airport environment. Developed to manage complex situations through collaborative decision-making with multiple stakeholders, the system empowers users to fully optimise operations, resources and capacity through smart information use. Air Traffic Control Simulator The Air Traffic Control (ATC) simulator provides realistic training for air traffic controllers to manage traffic flows in a safe, expeditious and orderly manner, as well as to handle emergency situations in accordance with the standards and procedures set by the International Civil Aviation Organisation (ICAO). The environments of airports and airspaces are created to facilitate realistic training in the full spectrum of ATC operations, including approach, en-route and departure phases of flights, as well as ground movement at airports. AgilFence BIDS On showcase for the first time is our AgilFence Buried Intrusion Detection System (BIDS) for Border Security & Pipeline Protection. A buried fibre optics sensing solution, it secures perimeters by detecting a range of threats above and below ground, for example illegal cross-border immigrants, oil pipeline theft attempt, and mechanised digging that could potentially damage underground services or pipelines. Hidden Early Detection Long Range Mobile (HELM) HELM is a smart scanner that uses radar-based entry control point technology capable of detecting both metallic or non-metallic objects and electronics components hidden in a person in different environment. AeroSat Terminal The AeroSat Terminal is a state-of-the-art satellite antenna system that provides enhanced broadband connectivity for the commercial and business aviation industry. The terminal uses Digital Beam Forming technology that enables seamless and simultaneous communications with multiple satellites, at higher performance and lower SWAP (Size, Weight and Power). Through this technology, airlines will enjoy increased fuel efficiency and on-flight passengers will be able to access TV feeds and the Internet at the same time, enjoying a seamless and uninterrupted data experience. Airport Identity Verification System The Airport Identity Verification System will help airports go beyond the use of smartcards. The multi-modal authentication system complements the standard smartcard system by using proven biometrics technologies in facial, iris and contactless palm vein recognition. With our easy to use self-registration kiosk, visitors and staff can enroll their facial, iris and palm biometrics in just a few minutes. This helps to reduce the manpower required to manage visitor passes registration. Airport Identity Verification System The Airport Identity Verification System will help airports go beyond the use of smartcards. The multi-modal authentication system complements the standard smartcard system by using proven biometrics technologies in facial, iris and contactless palm vein recognition. With our easy to use self-registration kiosk, visitors and staff can enroll their facial, iris and palm biometrics in just a few minutes. This helps to reduce the manpower required to manage visitor passes registration. Airport Operations Centre System The Airport Operations Centre System presents a unique solution for smooth and effective airport management with a comprehensive overview of critical operations in the dynamic airport environment. Developed to manage complex situations through collaborative decision-making with multiple stakeholders, the system empowers users to fully optimise operations, resources and capacity through smart information use. Airport Operations Centre System The Airport Operations Centre System presents a unique solution for smooth and effective airport management with a comprehensive overview of critical operations in the dynamic airport environment. Developed to manage complex situations through collaborative decision-making with multiple stakeholders, the system empowers users to fully optimise operations, resources and capacity through smart information use. Air Traffic Control Simulator The Air Traffic Control (ATC) simulator provides realistic training for air traffic controllers to manage traffic flows in a safe, expeditious and orderly manner, as well as to handle emergency situations in accordance with the standards and procedures set by the International Civil Aviation Organisation (ICAO). The environments of airports and airspaces are created to facilitate realistic training in the full spectrum of ATC operations, including approach, en-route and departure phases of flights, as well as ground movement at airports. Air Traffic Control Simulator The Air Traffic Control (ATC) simulator provides realistic training for air traffic controllers to manage traffic flows in a safe, expeditious and orderly manner, as well as to handle emergency situations in accordance with the standards and procedures set by the International Civil Aviation Organisation (ICAO). The environments of airports and airspaces are created to facilitate realistic training in the full spectrum of ATC operations, including approach, en-route and departure phases of flights, as well as ground movement at airports. AgilFence BIDS On showcase for the first time is our AgilFence Buried Intrusion Detection System (BIDS) for Border Security & Pipeline Protection. A buried fibre optics sensing solution, it secures perimeters by detecting a range of threats above and below ground, for example illegal cross-border immigrants, oil pipeline theft attempt, and mechanised digging that could potentially damage underground services or pipelines. On showcase for the first time is our AgilFence Buried Intrusion Detection System (BIDS) for Border Security & Pipeline Protection. A buried fibre optics sensing solution, it secures perimeters by detecting a range of threats above and below ground, for example illegal cross-border immigrants, oil pipeline theft attempt, and mechanised digging that could potentially damage underground services or pipelines. Hidden Early Detection Long Range Mobile (HELM) HELM is a smart scanner that uses radar-based entry control point technology capable of detecting both metallic or non-metallic objects and electronics components hidden in a person in different environment. Hidden Early Detection Long Range Mobile (HELM) HELM is a smart scanner that uses radar-based entry control point technology capable of detecting both metallic or non-metallic objects and electronics components hidden in a person in different environment. AeroSat Terminal The AeroSat Terminal is a state-of-the-art satellite antenna system that provides enhanced broadband connectivity for the commercial and business aviation industry. The terminal uses Digital Beam Forming technology that enables seamless and simultaneous communications with multiple satellites, at higher performance and lower SWAP (Size, Weight and Power). Through this technology, airlines will enjoy increased fuel efficiency and on-flight passengers will be able to access TV feeds and the Internet at the same time, enjoying a seamless and uninterrupted data experience. The AeroSat Terminal is a state-of-the-art satellite antenna system that provides enhanced broadband connectivity for the commercial and business aviation industry. The terminal uses Digital Beam Forming technology that enables seamless and simultaneous communications with multiple satellites, at higher performance and lower SWAP (Size, Weight and Power). Through this technology, airlines will enjoy increased fuel efficiency and on-flight passengers will be able to access TV feeds and the Internet at the same time, enjoying a seamless and uninterrupted data experience. Powering Smart Cities with Intelligent and Secure Connectivity As smart cities focus on improving the quality of life for its citizens by harnessing smart technology to connect infrastructures, resources and services, ensuring the reliability and security of communications network and data will be key for governments and companies. In addition to featuring our capabilities in smart street lighting, aero satellite communications, our robust and industry-leading cyber security capabilities will also be on special preview to delegates. Powering Smart Cities with Intelligent and Secure Connectivity As smart cities focus on improving the quality of life for its citizens by harnessing smart technology to connect infrastructures, resources and services, ensuring the reliability and security of communications network and data will be key for governments and companies. In addition to featuring our capabilities in smart street lighting, aero satellite communications, our robust and industry-leading cyber security capabilities will also be on special preview to delegates. WISX Smart Street Lighting System On showcase for the first time is our enhanced WISX Smart Street Lighting System, which provides a secure end-to-end smart city solution on a single platform that enables full awareness of street lights' performance. It is enabled with intelligent monitoring and remote control in response to varying environmental conditions, as a result, helping to reduce energy consumption. It has the ability to enable flood (water level) detection, public security warnings, vehicle monitoring, automated and remote light management. Black Computer Our new Black Computer L100, the first-of-its kind cybersecurity solution in the industry, is built with a dual operating system, allowing users to safely access secured and unsecured networks at the same time, from a single computer. The Black Computer prevents malwares from spreading into the network by performing a network isolation, and removing the malwares from the infected network with a simple reboot of the system. The Black Computer is a unique hardware-based cybersecurity solution that offers a customised and secure platform and network security capabilities to its customers. WISX Smart Street Lighting System On showcase for the first time is our enhanced WISX Smart Street Lighting System, which provides a secure end-to-end smart city solution on a single platform that enables full awareness of street lights' performance. It is enabled with intelligent monitoring and remote control in response to varying environmental conditions, as a result, helping to reduce energy consumption. It has the ability to enable flood (water level) detection, public security warnings, vehicle monitoring, automated and remote light management. WISX Smart Street Lighting System On showcase for the first time is our enhanced WISX Smart Street Lighting System, which provides a secure end-to-end smart city solution on a single platform that enables full awareness of street lights' performance. It is enabled with intelligent monitoring and remote control in response to varying environmental conditions, as a result, helping to reduce energy consumption. It has the ability to enable flood (water level) detection, public security warnings, vehicle monitoring, automated and remote light management. Black Computer Our new Black Computer L100, the first-of-its kind cybersecurity solution in the industry, is built with a dual operating system, allowing users to safely access secured and unsecured networks at the same time, from a single computer. The Black Computer prevents malwares from spreading into the network by performing a network isolation, and removing the malwares from the infected network with a simple reboot of the system. The Black Computer is a unique hardware-based cybersecurity solution that offers a customised and secure platform and network security capabilities to its customers. Our new Black Computer L100, the first-of-its kind cybersecurity solution in the industry, is built with a dual operating system, allowing users to safely access secured and unsecured networks at the same time, from a single computer. The Black Computer prevents malwares from spreading into the network by performing a network isolation, and removing the malwares from the infected network with a simple reboot of the system. The Black Computer is a unique hardware-based cybersecurity solution that offers a customised and secure platform and network security capabilities to its customers. Robotics Technologies to Drive Industrial Operations Leveraging innovation and robotics technology, our TUG® smart autonomous mobile robots automate routine work processes which sound mundane but offer potentially dramatic rewards for companies and global cities. Robotics Technologies to Drive Industrial Operations Leveraging innovation and robotics technology, our TUG® smart autonomous mobile robots automate routine work processes which sound mundane but offer potentially dramatic rewards for companies and global cities. TUG Autonomous Mobile Robots TUG robots connect islands of automation and enable Industry 4.0 transformation by automating physical tasks such as transporting supplies and components to their point-of-use. Hospitals and companies in hospitality have successfully used the TUG platform to deliver materials, meals, medications, laundries & linens and remove waste. The TUG T2RX is a popular choice for hospitals where it can deliver medication and lab specimens safely and reliably. It is also capable of docking itself automatically to recharge at a charging dock when its battery level is low. TUG Autonomous Mobile Robots TUG robots connect islands of automation and enable Industry 4.0 transformation by automating physical tasks such as transporting supplies and components to their point-of-use. Hospitals and companies in hospitality have successfully used the TUG platform to deliver materials, meals, medications, laundries & linens and remove waste. The TUG T2RX is a popular choice for hospitals where it can deliver medication and lab specimens safely and reliably. It is also capable of docking itself automatically to recharge at a charging dock when its battery level is low. TUG Autonomous Mobile Robots TUG robots connect islands of automation and enable Industry 4.0 transformation by automating physical tasks such as transporting supplies and components to their point-of-use. Hospitals and companies in hospitality have successfully used the TUG platform to deliver materials, meals, medications, laundries & linens and remove waste. The TUG T2RX is a popular choice for hospitals where it can deliver medication and lab specimens safely and reliably. It is also capable of docking itself automatically to recharge at a charging dock when its battery level is low. Enabling Smart and Green Cities A smart city's infrastructural development plays an important role in the efficient and sustainable management of our fast-growing urban environments. Our large- scale environmental engineering solutions incorporate innovation such as Internet-of-Things technologies to drive smart analytics for green projects in water, wastewater, solid waste and renewable energy sectors. Enabling Smart and Green Cities A smart city's infrastructural development plays an important role in the efficient and sustainable management of our fast-growing urban environments. Our large- scale environmental engineering solutions incorporate innovation such as Internet-of-Things technologies to drive smart analytics for green projects in water, wastewater, solid waste and renewable energy sectors. Kranji NEWater Factory Expansion 3 The expansion of Kranji NEWater Factory adds an additional 5 MiGD (22,730 m3 / day) of NEWater to the existing Kranji NEWater Factory to treat secondary effluent from Kranji Water Reclamation Plant to produce NEWater, which is delivered to the existing product water tanks through new connections. This plant treats secondary effluent from Kranji Water Reclamation Plant to produce high-grade reclaimed water that exceeded both local and WHO drinking water standard. Desalination Plant on Jurong Island Jurong Island Desalination Plant (JIDP) is developed by TP-STM Water Resources Pte Ltd, a consortium between ST Marine (40%) and Tuas Power (60%) to generate and sell potable water to PUB under a 25-years Water Purchase Agreement for PUB. Using IoT to drive smart analytics for this project, sensor nodes will be attached to each reverse osmosis pressure vessel for conductivity profiling. These sensor nodes will then feed real-time data to Command & Control Operations Centre dashboard for an integrated overview of daily operations. We can then use data analytics for predictive maintenance to optimise productivity and efficiency. Kranji NEWater Factory Expansion 3 The expansion of Kranji NEWater Factory adds an additional 5 MiGD (22,730 m3 / day) of NEWater to the existing Kranji NEWater Factory to treat secondary effluent from Kranji Water Reclamation Plant to produce NEWater, which is delivered to the existing product water tanks through new connections. This plant treats secondary effluent from Kranji Water Reclamation Plant to produce high-grade reclaimed water that exceeded both local and WHO drinking water standard. Kranji NEWater Factory Expansion 3 The expansion of Kranji NEWater Factory adds an additional 5 MiGD (22,730 m3 / day) of NEWater to the existing Kranji NEWater Factory to treat secondary effluent from Kranji Water Reclamation Plant to produce NEWater, which is delivered to the existing product water tanks through new connections. This plant treats secondary effluent from Kranji Water Reclamation Plant to produce high-grade reclaimed water that exceeded both local and WHO drinking water standard. Desalination Plant on Jurong Island Jurong Island Desalination Plant (JIDP) is developed by TP-STM Water Resources Pte Ltd, a consortium between ST Marine (40%) and Tuas Power (60%) to generate and sell potable water to PUB under a 25-years Water Purchase Agreement for PUB. Using IoT to drive smart analytics for this project, sensor nodes will be attached to each reverse osmosis pressure vessel for conductivity profiling. These sensor nodes will then feed real-time data to Command & Control Operations Centre dashboard for an integrated overview of daily operations. We can then use data analytics for predictive maintenance to optimise productivity and efficiency. Desalination Plant on Jurong Island Jurong Island Desalination Plant (JIDP) is developed by TP-STM Water Resources Pte Ltd, a consortium between ST Marine (40%) and Tuas Power (60%) to generate and sell potable water to PUB under a 25-years Water Purchase Agreement for PUB. Using IoT to drive smart analytics for this project, sensor nodes will be attached to each reverse osmosis pressure vessel for conductivity profiling. These sensor nodes will then feed real-time data to Command & Control Operations Centre dashboard for an integrated overview of daily operations. We can then use data analytics for predictive maintenance to optimise productivity and efficiency.",
    "About Us Overview Global Presence Board of Directors Organisation Structure Awards Milestones Group of Companies Corporate Information Our Business Aerospace Electronics Land Systems Marine Other Businesses Defence Commercial Products & Solutions Listing by Alphabetical Order Listing by Sector Listing by Product Category Listing by Alphabetical Order Listing by Product Category Sustainability Corporate Values Code of Conduct & Ethics Corporate Governance Corporate Citizenship Code of Conduct & Ethics Investor Relations Results Presentations & Webcasts 5-Year Financial Data Stock Charts Dividend History Shareholding Statistics Analysts Coverage IR Calendar Annual Reports FAQ and US ADR Disclaimer Contact Results Presentations & Webcasts FAQ and US ADR Disclaimer Press Centre Press Releases Press Contact Photo Gallery Mailing List Subscription Careers Life at ST Engineering People at ST Engineering Career Opportunities Scholarships What Our Scholars Say Life at ST Engineering People at ST Engineering What Our Scholars Say ST Engineering is committed to being an exemplary citizen of each community where we operate and to actively participate in achieving community goals. The Group is a member of the Singapore Compact for CSR, a national society aimed at broadening the base for collaboration among stakeholders to develop effective strategies to promote corporate citizenship in Singapore. Balancing profits and principles, ST Engineering will continue to demonstrate sensitivity and respect for people, communities and the environment, through the following initiatives: Ensure full compliance with all regulatory and environmental requirements. Achieve OHSAS 18001 and ISO 14001 certification / accreditation in all of our operating companies. Use energy, water and other resources efficiently. Fully support Singapore's National Service and National Defence initiatives. Support and actively participate in Singapore's Ministry of Defence (MINDEF) activities (e.g. PRIDE Day, Exhibitions, Open Houses, etc.). Support and participate in all National Programmes (e.g. the National Day Parade, Quality & Productivity Programs, Business Excellence initiatives). Actively participate in regional and international forums, exhibitions, seminars, research and related activities. Contribute to tertiary institutions. Encourage our employees to take responsibility for and support their communities by sharing their time and financial resources. Support community-based programmes and provide funding and equipment to the groups and charities supported by our employees. Provide support in emergencies and disaster situations. Promote Sports, the Arts and National Education programmes. to read the Community Relations section in our Annual Report 2013. Copyright Singapore Technologies Engineering Ltd | Regn No: 199706274H & Conditions of Use | Sitemap",
    "All News Releases Products The warfighter plays an increasingly important role in a battlefield that is digitally connected in the future. By providing him with increased protection, convenience and connectivity, his capabilities are enhanced as part of a force-multiplier effect. ST Engineering's soldier system ranges from lightweight armour to energy systems that convert a soldier's walking motion into electrical energy. In our quest to optimise the capabilities of the future soldier, the ARIELE (Army Individual Eco-Lightweight Equipment) system addresses the challenges of warfighters in the modern battlefield with four key sub-systems. Clothing & Protection Equipment Superior weight reduction with advanced materials Ergonomic design based on Human Factors Engineering Analysis Market leading performance in thermal and evaporative Resistance Power & Energy Management Integrated system for wireless charging, power management and supply Highest density fuel cell system for longest endurance Market leading efficiency for all-orientation wireless charging Complete power and data management system for intuitive interface with soldier devices Sensors & Individual Equipment Seamless interface to Power & Energy Management System Multiple integrated sensors for situational awareness World's lightest and most compact Augmented Reality C2 system for the battlefield Most advanced lightweight personal cooling system Medtech & Human Augmentation Breakthrough solution for real-time condition monitoring and alert system Integrated data analytics for training improvement and mission profiling Lightweight and passive exoskeleton system for load reduction and performance enhancement The warfighter plays an increasingly important role in a battlefield that is digitally connected in the future. By providing him with increased protection, convenience and connectivity, his capabilities are enhanced as part of a force-multiplier effect. ST Engineering's soldier system ranges from lightweight armour to energy systems that convert a soldier's walking motion into electrical energy. In our quest to optimise the capabilities of the future soldier, the ARIELE (Army Individual Eco-Lightweight Equipment) system addresses the challenges of warfighters in the modern battlefield with four key sub-systems. Clothing & Protection Equipment Superior weight reduction with advanced materials Ergonomic design based on Human Factors Engineering Analysis Market leading performance in thermal and evaporative Resistance Power & Energy Management Integrated system for wireless charging, power management and supply Highest density fuel cell system for longest endurance Market leading efficiency for all-orientation wireless charging Complete power and data management system for intuitive interface with soldier devices Sensors & Individual Equipment Seamless interface to Power & Energy Management System Multiple integrated sensors for situational awareness World's lightest and most compact Augmented Reality C2 system for the battlefield Most advanced lightweight personal cooling system Medtech & Human Augmentation Breakthrough solution for real-time condition monitoring and alert system Integrated data analytics for training improvement and mission profiling Lightweight and passive exoskeleton system for load reduction and performance enhancement ARIELE Soldier System Protec Load Bearing System Protec Load Bearing System"
  ]
}