{
  "company": "www.necam.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 36,
    "0": 26
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.2048929663608562,
    "framing_surveillance": 0.1957186544342507,
    "framing_market": 0.599388379204893,
    "num_docs": 62
  },
  "topic_timeline": {
    "20": {
      "-1": 36,
      "0": 26
    }
  },
  "sample_docs": [
    "Please note that s users to access and manage all of their messages, whether they arein the office or on the road. This powerful suite includes: The UM8700 can seamlessly be integrated into existing systems and it operates reliably on centralized, distributed and mixed infrastructures. Rely on the UM8700 to enhance the efficiency of mobile and remote workers as much as those in the office, and it can be scaled to support the new objectives of a growing organization. The variety of options for deploying the UM8700 gives organizations multiple ways to depend on the continuous high-availability and disaster recovery the UM8700 offers. UM8700 Personal Assistant Sales Sheet Migrate to UNIVERGE UM8700 Sales Sheet UM8700 High Availability & Disaster Recovery Sales Sheet Request a Quote > Top of this page Application/Messaging Systems UNIVERGE® UM4730 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 Servers UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System UNIVERGE® UM4730 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 Unified Messaging for Hospitality UNIVERGE® UM8700 Servers UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System DSX40 DSX80/DSX160 SL1100 Communications System DSX80/DSX160 SL1100 Communications System NEC Corporation of America NEC In The News NEC Foundation of America Events and Trade Shows Executive Briefing Center (EBC) Video Gallery/Video Case Studies Copyright © NEC Corporation of America 2012. .",
    "Please note that JavaScript and style sheet are used in this website, Due to unadaptability of the style sheet with the browser used in your computer, pages may not look as original. Even in such a case, however, the contents can be used safely. Change Country Global Global North America Canada USA Latin America Argentina Brazil Chile Colombia Mexico Venezuela Europe / Middle East / Africa Algeria Egypt France Germany Greece Hungary Iran Italy Kenya Libya Netherlands Nigeria Poland Portugal Russia Saudi Arabia South Africa Spain Sweden Switzerland Turkey United Kingdom Uzbekistan Asia Pacific / Greater China Australia Bangladesh China Hong Kong India Indonesia Japan Korea Malaysia New Zealand Pakistan Philippines Singapore Taiwan Thailand Viet Nam Global Global North America Canada USA Latin America Argentina Brazil Chile Colombia Mexico Venezuela Europe / Middle East / Africa Algeria Egypt France Germany Greece Hungary Iran Italy Kenya Libya Netherlands Nigeria Poland Portugal Russia Saudi Arabia South Africa Spain Sweden Switzerland Turkey United Kingdom Uzbekistan Asia Pacific / Greater China Australia Bangladesh China Hong Kong India Indonesia Japan Korea Malaysia New Zealand Pakistan Philippines Singapore Taiwan Thailand Viet Nam Solutions Finance Government Healthcare Higher Ed Hospitality K-12 Manufacturing Retail Small & Medium Business Finance Government Healthcare Higher Ed Hospitality K-12 Manufacturing Retail Small & Medium Business Small & Medium Business Services Cloud Consulting & Integration Information Analytics IT Infrastructure Services Maintenance & Support Cloud Consulting & Integration Information Analytics IT Infrastructure Services Maintenance & Support Products Administration Biometrics Cloud Solutions Communication Platforms Conferencing & Recording Contact Center Data Networking Document Solutions Emergency Notification Enterprise Software Financial Services Information Analytics Integrated IT Infrastructure Interactive Voice Response Microwave Radio Mobility OEM (NEC Corp.) Optical Networking Phones Servers Storage Unified Communications Unified Messaging & Voicemail Video Communications Virtual PC Center Administration Biometrics Cloud Solutions Communication Platforms Conferencing & Recording Contact Center Data Networking Document Solutions Emergency Notification Enterprise Software Financial Services Information Analytics Integrated IT Infrastructure Interactive Voice Response Microwave Radio Mobility OEM (NEC Corp.) Optical Networking Phones Servers Storage Unified Communications Unified Messaging & Voicemail Video Communications Virtual PC Center Unified Messaging & Voicemail How To Buy Communications IT Services Support Communications & Networking Document Solutions IT Platforms Microwave Radio Optical Networking Communications & Networking Document Solutions IT Platforms Microwave Radio Optical Networking Partners Channel Partners Strategic Alliances Industry Standards Group Channel Partners Strategic Alliances Industry Standards Group Unified Messaging - UNIVERGE ® VM8000 InMail Small and medium-sized businesses cannot afford to incorrectly route calls, lose messages or make customers stay on hold for an extended period of time. NEC's UNIVERGE VM8000 InMail is the ideal solution for small and medium-sized businesses that want to ensure all callers quickly and reliably reach the people and information they seek. It is an embedded solution for NEC's UNIVERGE SV8100 Communication Server that provides digitally-integrated voice messaging capabilities and automated attendant features. With VM8000 InMail, an SMB can achieve its communication needs now and well into the future. Improve customer satisfaction by ensuring customer calls get routed to the appropriate person and are answered quickly and efficiently Increase employee productivity by helping employees better manage their messages and calls Benefit from an intuitive user-interface which simplifies employees' learning curve through a step-by-step guide with pre-recorded voice prompts Installation, setup and maintenance is simplified through its online online, HTML-based programming access with easy-to-follow wizards that streamline programming Share one voicemail system between two or more communication systems so employees can access voice mail from any location and configuration costs can be reduced Integrate seamlessly with UC Desktop Suite Client for quick and easy access to messages Request a Quote > Top of this page Application/Messaging Systems UNIVERGE® UM4730 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 Servers UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System UNIVERGE® UM4730 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 UNIVERGE® VM8000-InMail UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 UNIVERGE® UM8000-Mail Unified Messaging for Hospitality UNIVERGE® UM8700 Unified Messaging for Hospitality UNIVERGE® UM8700 Servers UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System UNIVERGE® SV8100 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 UNIVERGE 3C UNIVERGE® SV8300 UNIVERGE® SV8500 UNIVERGE® SV8300 UNIVERGE® SV8500 Communications Systems DSX40 DSX80/DSX160 SL1100 Communications System DSX40 DSX80/DSX160 SL1100 Communications System DSX80/DSX160 SL1100 Communications System NEC Corporation of America NEC In The News NEC Foundation of America Events and Trade Shows Executive Briefing Center (EBC) Video Gallery/Video Case Studies Copyright © NEC Corporation of America 2012. .",
    "Please note that JavaScript and style sheet are used in this website, Due to unadaptability of the style sheet with the browser used in your computer, pages may not look as original. Even in such a case, however, the contents can be used safely. Change Country Global Global North America Canada USA Latin America Argentina Brazil Chile Colombia Mexico Venezuela Europe / Middle East / Africa Algeria Egypt France Germany Greece Hungary Iran Italy Kenya Libya Netherlands Nigeria Poland Portugal Russia Saudi Arabia South Africa Spain Sweden Switzerland Turkey United Kingdom Uzbekistan Asia Pacific / Greater China Australia Bangladesh China Hong Kong India Indonesia Japan Korea Malaysia New Zealand Pakistan Philippines Singapore Taiwan Thailand Viet Nam Global Global North America Canada USA Latin America Argentina Brazil Chile Colombia Mexico Venezuela Europe / Middle East / Africa Algeria Egypt France Germany Greece Hungary Iran Italy Kenya Libya Netherlands Nigeria Poland Portugal Russia Saudi Arabia South Africa Spain Sweden Switzerland Turkey United Kingdom Uzbekistan Asia Pacific / Greater China Australia Bangladesh China Hong Kong India Indonesia Japan Korea Malaysia New Zealand Pakistan Philippines Singapore Taiwan Thailand Viet Nam Solutions Finance Government Healthcare Higher Ed Hospitality K-12 Manufacturing Retail Small & Medium Business Finance Government Healthcare Higher Ed Hospitality K-12 Manufacturing Retail Small & Medium Business Small & Medium Business Services Cloud Consulting & Integration Information Analytics IT Infrastructure Services Maintenance & Support Cloud Consulting & Integration Information Analytics IT Infrastructure Services Maintenance & Support Products Administration Biometrics Cloud Solutions Communication Platforms Conferencing & Recording Contact Center Data Networking Document Solutions Emergency Notification Enterprise Software Financial Services Information Analytics Integrated IT Infrastructure Interactive Voice Response Microwave Radio Mobility OEM (NEC Corp.) Optical Networking Phones Servers Storage Unified Communications Unified Messaging & Voicemail Video Communications Virtual PC Center Administration Biometrics Cloud Solutions Communication Platforms Conferencing & Recording Contact Center Data Networking Document Solutions Emergency Notification Enterprise Software Financial Services Information Analytics Integrated IT Infrastructure Interactive Voice Response Microwave Radio Mobility OEM (NEC Corp.) Optical Networking Phones Servers Storage Unified Communications Unified Messaging & Voicemail Video Communications Virtual PC Center Unified Messaging & Voicemail How To Buy Communications IT Services Support Communications & Networking Document Solutions IT Platforms Microwave Radio Optical Networking Communications & Networking Document Solutions IT Platforms Microwave Radio Optical Networking Partners Channel Partners Strategic Alliances Industry Standards Group Channel Partners Strategic Alliances Industry Standards Group NEC Hosted Collaboration Services The ability to participate in multimedia presentations is critical to keeping your business competitive. It can dramatically improve the type and quality of the information transmitted. NEC's Hosted Collaboration Service provides the innovative, cost-effective help that your enterprise requires. NEC Hosted Collaboration Service is a browser-based subscription solution that offers the ability to provide feature-rich web conferences with up to 16 video windows per conference. It supports an unlimited number of attendees for both voice and video conferencing. Because this service is hosted, no installation and setup are needed – all your server and software needs are taken care of. By using NEC Hosted Collaboration Service for web conferences, your workers can collaborate seamlessly from any location. Participants can jointly modify documents, spreadsheets, presentations and other work without having to pass files back and forth. Additionally, there is no upfront cost or capital equipment that must be purchased to implement this solution. Your business pays a flat rate monthly for unlimited access. You can use standard computers, video cameras, and web browsers – nothing proprietary is required. Request a Quote > Top of this page Why NEC Hosted Collaboration Services: Video Conferencing NEC Hosted Collaboration Services Business Video Conferencing Polycom® Video Conferencing Solutions NEC Hosted Collaboration Services Business Video Conferencing Polycom® Video Conferencing Solutions Business Video Conferencing Polycom® Video Conferencing Solutions Polycom® Video Conferencing Solutions NEC Corporation of America NEC In The News NEC Foundation of America Events and Trade Shows Executive Briefing Center (EBC) Video Gallery/Video Case Studies Copyright © NEC Corporation of America 2012. .",
    "NEC Thin Client System with NEC Virtual PC Servers Offers Unparalleled Multimedia User Experience; Increases Data Security While Reducing PC Support and Management Costs Santa Clara, Calif., April 23, 2007 - NEC Corporation of America, a premier provider of IT, network and identity management solutions, today announced the introduction of the NEC Virtual PC Center (VPCC), a complete thin client and server solution. NEC's VPCC is the first thin client solution to truly replace the personal computer, supporting all existing PC applications with high quality multimedia delivery that replicates the familiar desktop environment. Moving the PC off of the desktop and into the data center ensures that an individual's data resides securely in the data center. Using NEC's VPCC, with virtualization software from VMware and a thin client operating system from Wyse Technology, enterprises large and small can realize substantial reductions in support and maintenance costs, resulting in a lower total cost of ownership as compared to traditional desktop PCs. Though desktop PCs are incredibly productive for individual users and as application client workstations, they also come with a very high cost. Untrained end-users must often manage their own systems, and IT must provide costly help desk services to better support those end-users. IT must also provide numerous expensive software solutions on PCs to better prevent loss or theft of data. NEC's solution is the Virtual PC Center, a complete thin client personal computer product line with full PC functionality and including multimedia capability, designed to replace the desktop PC. The NEC solution offers a full virtual PC environment, combining the thin client device with NEC Virtual PC Servers and an NEC VPCC Management Server in the data center. The entire VPCC system is called \"virtual\" because a user can access any VPCC workstation and work as if using a traditional PC with its familiar Microsoft ® Windows ® desktop multimedia environment. Because it is compatible PC functionality, existing PC applications are supported so additional user training is not required. \"The extensive use of desktop PCs directly impacts the total cost to run and support PC applications,\" said Dave Davenport, senior vice president, NEC Corporation of America. \"It also may run a major security risk if some company data is not adequately protected on that desktop. The thin client architecture solves these problems, but is only viable if the multimedia problem is solved. NEC's VPCC meets the multimedia requirement, supporting all PC applications. The result is a true alternative for the enterprise, with a radical decrease of the overall cost of enterprise personal computing by as much as 50 percent without compromising on desktop functionality.\" Thin client solutions are an effective PC alternative, better protecting enterprise data because the data is maintained on controlled servers in the data center and not on uncontrolled desktop PC hard disks. However, most traditional thin client solutions also come with a cost: they cannot support multimedia content. Common PC applications utilizing multimedia - such as computer-based training, corporate video messaging, voice-over-IP (VoIP) telephony solutions, and DVD or music playback - have not traditionally been supported on thin client architectures. Because the de-encoding of multimedia files is accomplished on the client-side with the NEC VPPC, the multimedia content can efficiently reach the thin client device through existing network bandwidth. The multimedia accelerator on the NEC US100 thin client device decodes the data at the desktop, ensuring PC-quality audio and video. \"Retaining the full functionality of a PC is recognized as a major challenge when moving to a thin client architecture and virtualizing PC desktop systems,\" said Bob O'Donnell, vice president of Clients and Displays, IDC. \"This is particularly true in the area of multimedia and IP telephony. One way to solve this is to shift the multimedia decoding to the 'edge' using an 'enhanced' thin client device.\" NEC Virtual PC Servers utilize another important NEC technology called the NEC SigmaSystemCenter™ management system. SigmaSystemCenter provides a unified and scalable management solution on top of the VMware ® Virtual Desktop Infrastructure (VDI) that simplifies the NEC Virtual PC Server's management and monitoring. NEC's server heritage is evident in its management software technology, including built-in integration with the server hardware and virtual operating system platform, ensuring high availability. It also includes an easy-to-use interface to manage PC user session creation and monitoring, server utilization profiling, system policies, security, expandability, auditing, account management, deployment functionality, client brokering and more. NEC customers are anticipating significant cost reductions due to their VPCC implementation. \"By integrating NEC's VPCC into our contact center and utilizing the management capabilities of SigmaSystemCenter, we anticipate a positive impact to ASI's total cost of ownership,\" said Benjamin Woo, vice president of sales and marketing, ASI System Integration. \"Further, it ensures that our data will stay secure while still providing a comfortable user experience that will not decrease the productivity of our teams.\" For larger enterprise customers, SigmaSystemCenter also provides automatic load balancing of user sessions across multiple NEC Virtual PC Servers. A Storage Area Network (SAN) is added for load balance purposes, as well as to extend user storage capacity. NEC US100 Thin Client First announced in November of 2006, the US100 is the first thin client device to provide rich PC-quality high-speed video and audio processing delivering the next-generation in thin client technology. Improving space efficiency, the palm-sized device can be placed on the desktop or mounted behind the LCD screen. The US100 is powered by Wyse ® Thin OS running on the ServerEngines ® NetClient processor, along with Wyse's multimedia acceleration enhancements. \"Wyse is pleased with the result of our collaboration with NEC,\" said Ricardo Antuna, vice president of Business Development and Alliances for Wyse Technology. \"The combination of the US100 hardware with our Wyse Thin OS provides an ideal solution for end-users looking for a complete PC experience with no compromises.\" NEC Virtual PC Server The NEC Virtual PC Server is powered by NEC SigmaSystemCenter to manage VMware VDI client sessions, client workstations and hardware servers. The NEC Virtual PC Server comes in two hardware configurations: 20 or 50 users for each server. A customer can install one or more Virtual PC Servers to meet or exceed the total number of PC users. Each configuration is designed to provide the maximum end-user performance, with all necessary system software preinstalled. \"VMware VDI and NEC's VPCC help to simplify IT administration, leverage existing computing investments, and respond faster to changing business demands,\" said Brian Byun, vice president of global partners and solutions at VMware. \"With VMware's industry-leading virtualization software as the platform for VPCC, the system can be installed and fully operational in a shorter timeframe.\" NEC VPCC Management Server The NEC VPCC Management Server provides centralized IT management interfaces and monitoring tools for the entire VPCC system through SigmaSystemCenter's console. A dedicated server significantly simplifies PC administrative tasks compared to traditional desktop system management functions. Features such as reallocation of VPCC resources, addition of application software, bulk application of security patches, and automatic load balancing provide system administrators enhanced efficiency and flexibility. Pricing and Availability The cost between a straight change-over to VPCC when replacing desktops PC is about the same as compared to buying new desktops PC for the enterprise. However, NEC's VPCC provides added features that cannot be achieved using a desktops PC, including lower servicing and support costs. As a result, organizations can expect a significant reduction in the total cost of ownership for VPCC, as compared to continuing to use traditional desktops PC over the life of the system. The NEC Virtual PC Center is available now through selected resellers and direct from NEC Corporation of America. About NEC Corporation of America NEC Corporation of America is a leading technology provider of network, IT and identity management solutions. Headquartered in Irving, Texas, NEC Corporation of America is the North America subsidiary of NEC Corporation (NASDAQ: NIPNY), a Global 200 company founded in 1899, which delivers technology and professional services ranging from server and storage technologies, virtualization and digital cinema solutions to biometric security, optical network, radio communications and IP voice and data systems. NEC Corporation of America serves carrier, SMB and large enterprise clients across multiple vertical industries. For more information, please visit www.necam.com. NEC is a registered trademark of NEC Corporation. Other product or service marks mentioned herein are the trademarks of their respective owners. . . . . . . . . . . . . . . . . . . . NEC Corporation of America Contacts: Beth Makosey NEC Corporation of America beth.makosey@necam.com (408) 844-1320 Syreeta Mussante NEC Corporation of America Syreeta@sparkpr.com (415) 321-1865 Contacts: Beth Makosey NEC Corporation of America beth.makosey@necam.com (408) 844-1320 Syreeta Mussante NEC Corporation of America Syreeta@sparkpr.com (415) 321-1865",
    "Aiming to strengthen security and reduce operational costs by 30% Tokyo, September 29, 2009 – NEC Corporation today announced the beginning of construction of one of Japan's largest virtual PC thin client systems as part of strengthening information security and reducing total cost of ownership (TCO) for Tokio Marine & Nichido Fire Insurance Co., Ltd. (Tokio Marine; President: Shuzo Sumi). Trial deployment of the system will begin in 2009 and installation of approximately 30,000 units is scheduled to start in 2010. The system will utilize NEC's uniquely advanced virtual PC thin client system, the \"Virtual PC Center.\" Tokio Marine has implemented comprehensive internal security controls in order to constantly monitor and comply with each of the wide reaching management regulations that apply to information security. Within this framework, business and staff workload related to the storage of important information, and the procedures for managing the transport of information externally, have become challenging issues. Thin client systems enable companies to significantly reduce the financial costs and employee burdens associated with strengthening and maintaining high security environments. Since the management and operation of thin client terminals is concentrated on a server, the terminals do not carry internal data or software. This means that burdensome implementation of management rules and monitoring that formerly took place on individual terminals is largely unnecessary. Furthermore, this enables employees to concentrate greater on their specific jobs, rather than computer maintenance, which is connected to improved work quality and higher customer satisfaction. It is expected that the operational costs of using PCs (the full range of costs associated with operational management, including configuration of each device, corresponding layout changes, asset management, repairs, security patches, etc.) may be reduced by approximately 30%. Looking forward, Tokio Marine may capitalize on its thin client system to implement such work-style reforms as telecommuting, business continuity plans for natural disasters and others. NEC aims to utilize the deployment of this thin client system to accelerate its provision of future systems, which will contribute to the streamlining of customer business with strengthened corporate security, business continuity plans, work-style reforms, reduced system TCO and more. About NEC Corporation NEC Corporation is one of the world's leading providers of Internet, broadband network and enterprise business solutions dedicated to meeting the specialized needs of a diversified global base of customers. NEC delivers tailored solutions in the key fields of computer, networking and electron devices, by integrating its technical strengths in IT and Networks, and by providing advanced semiconductor solutions through NEC Electronics Corporation. The NEC Group employs more than 140,000 people worldwide. For additional information, please visit the NEC website at: http://www.nec.com . NEC is a registered trademark of NEC Corporation. . Other product or service marks mentioned herein are the trademarks of their respective owners. NEC Corporation. Press Release - For immediate use September 29, 2009 NEC Press Contact (Japan) NEC Press Contact (U.S.) Joseph Jasper Linda Goncalves NEC Corporation NEC Corporation of America j-jasper@ax.jp.nec.com linda.goncalves@necam.com +81-3-3798-6511 408-844-1325"
  ]
}