{
  "company": "www.clearme.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 8,
    "-1": 7
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.3125,
    "framing_surveillance": 0.125,
    "framing_market": 0.5625,
    "num_docs": 15
  },
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 8
    }
  },
  "sample_docs": [
    "Download the free CLEAR app today to find locations and more. Fast. Secure. Innovative. Now you're CLEAR. Creating safe, seamless travel experiences for 10+ years. CLEAR is on a Mission to Make Travel Easier Travel is back, putting pressure on existing systems and infrastructure, and CLEAR is on a mission to help. CLEAR's proven identity verification system helps the TSA and airport partners manage security checkpoints while giving travelers a predictable, frictionless airport experience. Our Commitment to Security Our smart and simple ID verification check is backed by a rigorous multilayered enrollment process that includes next-generation technology and knowledge-based authentication. CLEAR is a certified Department of Homeland Security Qualified Anti-Terrorism Technology (QATT), and we comply with stringent government regulations, requirements, and audits. CLEAR is Delivering Innovation to the Airport CLEAR's innovative identity technology enables faster, easier, and more secure experiences. Our engineers are at the cutting edge as we work to help our government and airport partners deliver a safe and seamless airport security process. Our Commitment to Partnership CLEAR is proud to partner with the Department of Homeland Security, the TSA and [50] U.S. airports nationwide to keep air travel safe and secure. While powering great experiences for travelers, we are also creating jobs and helping our partners in airport security manage their resources and services. Our CLEAR Ambassadors Our security and hospitality-focused Ambassadors show up every day to take care of our Members and the airport communities they serve. Rose, FLL Airport Ed, LAX Airport Feaolina, SFO Airport CLEAR is on a Mission to Make Travel Easier Travel is back, putting pressure on existing systems and infrastructure, and CLEAR is on a mission to help. CLEAR's proven identity verification system helps the TSA and airport partners manage security checkpoints while giving travelers a predictable, frictionless airport experience. CLEAR is on a Mission to Make Travel Easier Travel is back, putting pressure on existing systems and infrastructure, and CLEAR is on a mission to help. CLEAR's proven identity verification system helps the TSA and airport partners manage security checkpoints while giving travelers a predictable, frictionless airport experience. Our Commitment to Security Our smart and simple ID verification check is backed by a rigorous multilayered enrollment process that includes next-generation technology and knowledge-based authentication. CLEAR is a certified Department of Homeland Security Qualified Anti-Terrorism Technology (QATT), and we comply with stringent government regulations, requirements, and audits. Our Commitment to Security Our smart and simple ID verification check is backed by a rigorous multilayered enrollment process that includes next-generation technology and knowledge-based authentication. CLEAR is a certified Department of Homeland Security Qualified Anti-Terrorism Technology (QATT), and we comply with stringent government regulations, requirements, and audits. CLEAR is Delivering Innovation to the Airport CLEAR's innovative identity technology enables faster, easier, and more secure experiences. Our engineers are at the cutting edge as we work to help our government and airport partners deliver a safe and seamless airport security process. CLEAR is Delivering Innovation to the Airport CLEAR's innovative identity technology enables faster, easier, and more secure experiences. Our engineers are at the cutting edge as we work to help our government and airport partners deliver a safe and seamless airport security process. Our Commitment to Partnership CLEAR is proud to partner with the Department of Homeland Security, the TSA and [50] U.S. airports nationwide to keep air travel safe and secure. While powering great experiences for travelers, we are also creating jobs and helping our partners in airport security manage their resources and services. Our Commitment to Partnership CLEAR is proud to partner with the Department of Homeland Security, the TSA and [50] U.S. airports nationwide to keep air travel safe and secure. While powering great experiences for travelers, we are also creating jobs and helping our partners in airport security manage their resources and services. Our CLEAR Ambassadors Our security and hospitality-focused Ambassadors show up every day to take care of our Members and the airport communities they serve. Rose, FLL Airport Ed, LAX Airport Feaolina, SFO Airport Our security and hospitality-focused Ambassadors show up every day to take care of our Members and the airport communities they serve. It's simple to start—enroll in CLEAR Plus today. GET CLEAR PLUS It's simple to start—enroll in CLEAR Plus today.",
    "Introducing eGates— Be Unstoppable Enjoy the most frictionless airport experience yet. Verify instantly and go directly to bag screening with our new eGates. This was the fastest we've gone through security. Joel, CLEAR+ Member Join CLEAR+ Upload Your Passport to the CLEAR App Be travel ready by uploading your passport to the app. Identity For Your Business From airports to enterprises—maximize security and minimize friction with CLEAR1. Introducing eGates— Be Unstoppable Enjoy the most frictionless airport experience yet. Verify instantly and go directly to bag screening with our new eGates. Upload Your Passport to the CLEAR App Be travel ready by uploading your passport to the app. Identity For Your Business From airports to enterprises—maximize security and minimize friction with CLEAR1. In the Airport CLEAR helps you win the day of travel—from home to gate and back again. CLEAR+ Speed through airport security with our annual Membership by getting access to 150+ CLEAR Lanes —simply by verifying you are you. Better Way to Travel Faster, easier airport security when you travel. Add Family Save time and money together— add up to three people to your account. CLEAR Concierge Our premium service for a direct path through the CLEAR+ Lane. CLEAR Perks Unlock $500+ in partner benefits, from expedited passport services to easier luggage shipment. Join CLEAR+ TSA PreCheck ® Enrollment Provided by CLEAR Enroll or renew TSA PreCheck ® through CLEAR for easier security screening—no appointment necessary. ENROLL OR RENEW CLEAR Mobile Enjoy more predictable security through our app-based Lane—now at select airports. GET STARTED Faster, easier airport security when you travel. Save time and money together— add up to three people to your account. Our premium service for a direct path through the CLEAR+ Lane. Unlock $500+ in partner benefits, from expedited passport services to easier luggage shipment. Join CLEAR+ TSA PreCheck ® Enrollment Provided by CLEAR In Your Pocket Download the free CLEAR App to unlock frictionless experiences. Track your flights and know exactly when to leave for the airport Find CLEAR locations near you Upload your passport to the app before the REAL ID deadline to keep moving fast at the airport gET real ID READY Get REAL ID Ready Track your flights and know exactly when to leave for the airport Find CLEAR locations near you Upload your passport to the app before the REAL ID deadline to keep moving fast at the airport gET real ID READY And Beyond With secure identity, CLEAR makes everyday experiences better— from sports games to rideshare apps. 15 stadiums nationwide Do game day the right way with CLEAR: Show your QR code in the CLEAR App to get into the action faster at sports stadiums and arenas. FIND LOCATIONS Build trust online so your connections know that you're really you by verifying with CLEAR. Easily verify your identity with CLEAR to get a \"Verified Badge\"—giving drivers confidence that riders are who they say they are. Skip the counter and go straight to your rental car by verifying you are you with CLEAR. Identity For Your Business Maximize security and minimize friction with CLEAR1—the new standard in identity. Identity For Your Business Scan to download app Apple Store Google Play Get It On Google Play Download on the app store For You CLEAR+ TSA PreCheck ® CLEAR Perks CLEAR Concierge CLEAR Mobile Sports Where to Use CLEAR Support & FAQs Gift Cards Who We Are Careers Privacy Commitment Investor Relations Newsroom Blog Featured Partners LinkedIn Delta Air Lines United Airlines Atmos Rewards Avis Public Allstate CLEAR Perks Travel Planning Airport Essentials Luggage Experiences Wellness Identity For Your Business Maximize security and minimize friction with CLEAR1—the new standard in identity. Member Your Privacy Choices Credential Policies WA Reserve CLEAR Mobile Cookie Usage of Use . Scan to download app Where to Use CLEAR",
    "Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Allegiant Stadium Las Vegas, NV Austin–Bergstrom International Airport Austin, TX BMO Stadium Los Angeles, CA Ball Arena Denver, CO Baltimore/Washington International Thurgood Marshall Airport Baltimore, MD Barclays Center New York City, NY Birmingham-Shuttlesworth International Airport Birmingham, AL Boise Airport Boise, ID Boston Logan International Airport Boston, MA Bradley International Airport Hartford, CT Buffalo Niagara International Airport Buffalo, NY Capital One Arena Washington, DC Chase Center San Francisco Bay Area, CA Chicago Midway International Airport Chicago, IL Chicago O'Hare International Airport Chicago, IL Cincinnati/Northern Kentucky International Airport Northern Kentucky (Cincinnati), OH Cleveland Hopkins International Airport Cleveland, OH Coors Field Denver, CO Dallas Love Field Airport Dallas, TX Dallas/Fort Worth International Airport Dallas, TX Daniel K. Inouye International Airport Honolulu, HI Denver International Airport Denver, CO Detroit Metro Airport Detroit, MI Fort Lauderdale-Hollywood International Airport Fort Lauderdale, FL George Bush Intercontinental Airport Houston, TX Gerald R. Ford International Airport Grand Rapids, MI Greenville-Spartanburg International Airport Greenville-Spartanburg, SC Harry Reid International Airport Las Vegas, NV Hartsfield–Jackson Atlanta International Airport Atlanta, GA John F. Kennedy International Airport New York City, NY John Glenn Columbus International Airport Columbus, OH Kahului Airport Maui, HI Kansas City International Airport Kansas City, MO Kaseya Center Miami, FL LaGuardia Airport New York City, NY Long Beach Airport Long Beach, CA Los Angeles International Airport Los Angeles, CA Louis Armstrong New Orleans International Airport New Orleans, LA Louisville Muhammad Ali International Airport Louisville, KY Luis Muñoz Marin International Airport San Juan, PR Lumen Field Seattle, WA Madison Square Garden New York City, NY Miami International Airport Miami, FL Milwaukee Mitchell International Airport Milwaukee, WI Minneapolis−Saint Paul International Airport Minneapolis, MN Nashville International Airport Nashville, TN Nationals Park Washington, DC Newark Liberty International Airport Newark, NJ Norman Y. Mineta San Jose International Airport San Jose, CA Oakland International Airport Oakland, CA Ontario International Airport Ontario, CA Oracle Park San Francisco Bay Area, CA Orlando International Airport Orlando, FL Palm Beach International Airport Palm Beach, FL Palm Springs International Airport Palm Springs, CA Phoenix Sky Harbor International Airport Phoenix, AZ Pittsburgh International Airport Pittsburgh, PA Portland International Airport Portland, OR Raleigh-Durham International Airport Raleigh, NC Rhode Island T.F. Green International Airport Warwick (Providence), RI Ronald Reagan Washington National Airport Washington, DC Sacramento International Airport Sacramento, CA Salt Lake City International Airport Salt Lake City, UT San Antonio International Airport San Antonio, TX San Diego International Airport San Diego, CA San Francisco International Airport San Francisco Bay Area, CA Sarasota Bradenton International Airport Sarasota, FL Savannah/Hilton Head International Airport Savannah, GA Seattle-Tacoma International Airport Seattle, WA St. Louis Lambert International Airport St. Louis, MO State Farm Arena Atlanta, GA T-Mobile Arena Las Vegas, NV Tulsa International Airport Tulsa, OK Washington Dulles International Airport Washington, DC Westchester County Airport New York City, NY Will Rogers World Airport Oklahoma City, OK William P. Hobby Airport Houston, TX Yankee Stadium New York City, NY No Results Found Please try again and search by city, state, and airport name or code. No items found. No results found show more locations Be the first to hear about new CLEAR Lane locations near you and receive exclusive offers— for our mailing list below. Be the first to hear about new CLEAR Lane locations near you and receive exclusive offers— for our mailing list below. Scan to download app Apple Store Google Play Get It On Google Play Download on the app store For You CLEAR+ TSA PreCheck ® CLEAR Perks CLEAR Concierge CLEAR Mobile Sports Where to Use CLEAR Support & FAQs Gift Cards Who We Are Careers Privacy Commitment Investor Relations Newsroom Blog Featured Partners LinkedIn Delta Air Lines United Airlines Alaska Airlines Hawaiian Airlines Avis Public Allstate CLEAR Perks Travel Planning Airport Essentials Luggage Experiences Wellness Identity For Your Business Maximize security and minimize friction with CLEAR1—the new standard in identity. Member Your Privacy Choices Credential Policies WA Reserve CLEAR Mobile Cookie Usage of Use . Scan to download app Where to Use CLEAR",
    "Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Allegiant Stadium Las Vegas, NV Austin–Bergstrom International Airport Austin, TX BMO Stadium Los Angeles, CA Ball Arena Denver, CO Baltimore/Washington International Thurgood Marshall Airport Baltimore, MD Barclays Center New York City, NY Birmingham-Shuttlesworth International Airport Birmingham, AL Boise Airport Boise, ID Boston Logan International Airport Boston, MA Bradley International Airport Hartford, CT Buffalo Niagara International Airport Buffalo, NY Capital One Arena Washington, DC Chase Center San Francisco Bay Area, CA Chicago Midway International Airport Chicago, IL Chicago O'Hare International Airport Chicago, IL Cincinnati/Northern Kentucky International Airport Northern Kentucky (Cincinnati), OH Cleveland Hopkins International Airport Cleveland, OH Coors Field Denver, CO Dallas Love Field Airport Dallas, TX Dallas/Fort Worth International Airport Dallas, TX Daniel K. Inouye International Airport Honolulu, HI Denver International Airport Denver, CO Detroit Metro Airport Detroit, MI Fort Lauderdale-Hollywood International Airport Fort Lauderdale, FL George Bush Intercontinental Airport Houston, TX Gerald R. Ford International Airport Grand Rapids, MI Greenville-Spartanburg International Airport Greenville-Spartanburg, SC Harry Reid International Airport Las Vegas, NV Hartsfield–Jackson Atlanta International Airport Atlanta, GA John F. Kennedy International Airport New York City, NY John Glenn Columbus International Airport Columbus, OH John Wayne Airport Orange County, CA Kahului Airport Maui, HI Kansas City International Airport Kansas City, MO Kaseya Center Miami, FL LaGuardia Airport New York City, NY Long Beach Airport Long Beach, CA Los Angeles International Airport Los Angeles, CA Louis Armstrong New Orleans International Airport New Orleans, LA Louisville Muhammad Ali International Airport Louisville, KY Luis Muñoz Marin International Airport San Juan, PR Lumen Field Seattle, WA Madison Square Garden New York City, NY Miami International Airport Miami, FL Milwaukee Mitchell International Airport Milwaukee, WI Minneapolis−Saint Paul International Airport Minneapolis, MN Nashville International Airport Nashville, TN Nationals Park Washington, DC Newark Liberty International Airport Newark, NJ Norman Y. Mineta San Jose International Airport San Jose, CA Oakland International Airport Oakland, CA Ontario International Airport Ontario, CA Oracle Park San Francisco Bay Area, CA Orlando International Airport Orlando, FL Palm Beach International Airport Palm Beach, FL Palm Springs International Airport Palm Springs, CA Phoenix Sky Harbor International Airport Phoenix, AZ Pittsburgh International Airport Pittsburgh, PA Portland International Airport Portland, OR Raleigh-Durham International Airport Raleigh, NC Rhode Island T.F. Green International Airport Warwick (Providence), RI Ronald Reagan Washington National Airport Washington, DC Sacramento International Airport Sacramento, CA Salt Lake City International Airport Salt Lake City, UT San Antonio International Airport San Antonio, TX San Diego International Airport San Diego, CA San Francisco International Airport San Francisco Bay Area, CA Sarasota Bradenton International Airport Sarasota, FL Savannah/Hilton Head International Airport Savannah, GA Seattle-Tacoma International Airport Seattle, WA St. Louis Lambert International Airport St. Louis, MO State Farm Arena Atlanta, GA T-Mobile Arena Las Vegas, NV Tulsa International Airport Tulsa, OK Washington Dulles International Airport Washington, DC Westchester County Airport New York City, NY Will Rogers World Airport Oklahoma City, OK William P. Hobby Airport Houston, TX Yankee Stadium New York City, NY No Results Found Please try again and search by city, state, and airport name or code. No items found. No results found show more locations Be the first to hear about new CLEAR Lane locations near you and receive exclusive offers— for our mailing list below. Be the first to hear about new CLEAR Lane locations near you and receive exclusive offers— for our mailing list below. Scan to download app Apple Store Google Play Get It On Google Play Download on the app store For You CLEAR+ TSA PreCheck ® CLEAR Perks CLEAR Concierge CLEAR Mobile Sports Where to Use CLEAR Support & FAQs Gift Cards Who We Are Careers Privacy Commitment Investor Relations Newsroom Blog Featured Partners LinkedIn Delta Air Lines United Airlines Atmos Rewards Avis Public Allstate CLEAR Perks Travel Planning Airport Essentials Luggage Experiences Wellness Identity For Your Business Maximize security and minimize friction with CLEAR1—the new standard in identity. Member Your Privacy Choices Credential Policies WA Reserve CLEAR Mobile Cookie Usage of Use . Scan to download app Where to Use CLEAR",
    "Start Online Pre-enroll or renew today in minutes. Pick your plan Finish at the Airport A CLEAR Ambassador will help you complete your TSA PreCheck ® application at the airport near you 1 —no appointment needed. 1 Currently available at a select number of airports. Enjoy the Journey If approved, keep your shoes, belts, and light jackets on—and laptops and 3-1-1 liquids stay in your bag—at 200+ airports nationwide. ‍ How CLEAR Plus Works Enroll Enroll at an airport near you and start using your CLEAR Plus Membership right away. You can even speed up the process by answering a few questions online before you go. PICK YOUR PLAN How to Get TSA PreCheck ® Through CLEAR Start Online Pre-enroll or renew today in minutes. See pricing How to Get TSA PreCheck ® Through CLEAR Finish at the Airport A CLEAR Ambassador will help you complete your TSA PreCheck ® application at an airport near you¹—no appointment needed. 1 Currently available at a select number of airports. See pricing How to Get TSA PreCheck ® Through CLEAR Enjoy the Journey If approved, keep your shoes, belts, and light jackets on—and laptops and 3-1-1 liquids stay in your bag—at 200+ airports nationwide. See pricing apply renew Apply for TSA PreCheck ® $77 .95 for 5 years No need to remove shoes, belts, 3-1-1 liquids, laptops, or light jackets Available with 90+ airlines at 200+ airports nationwide Kids 17 and under join you free when booked on the same reservation and when indicated on the child's boarding pass apply now Renew TSA PreCheck ® $68 .95 for 5 years when you renew online Or $77.95 for 5 years when you complete your renewal in-person. Renew Now Bundle with CLEAR Plus For the fastest way to your gate at the best value. $266.95 $199 .95 Get both services for one low price: Save 35% off your first year ¹ of CLEAR Plus ² when you bundle with TSA PreCheck ® . Get the bundle 1 Offer only available to new CLEAR Plus Members. After the first year, CLEAR Plus Membership renews at $189 annually. ‍ 2 This service is not associated with the TSA PreCheck ® Application Program. CLEAR Plus is currently only available to U.S. citizens and legal permanent residents 18 and older with a valid government-issued photo I.D. Frequently Asked Questions Do I need to make an appointment to enroll in TSA PreCheck® through CLEAR? Nope! Save time by pre-enrolling online and complete your registration at the nearest participating CLEAR location . No appointment is necessary. Don't forget to bring all required documentation . Our friendly ambassadors will be there to help you every step of the way. What documents are required to enroll for TSA PreCheck®? For TSA PreCheck ® , the following documentation is required to meet identity and citizenship requirements - see below: ‍ List A – ONE document is acceptable from the following forms of identification: Unexpired U.S. Passport (book or card) - demonstrates U.S. Citizenship Unexpired Enhanced Tribal Card (ETC) - demonstrates U.S. Citizenship Unexpired Free and Secure Trade (FAST) Card - designates U.S. Citizenship if indicated on the FAST card Unexpired U.S. Enhanced Driver's License (EDL) or Unexpired Enhanced Identification Card (EID) - designates U.S. Citizenship if indicated on the EDL or EIC Permanent Resident Card (I-551) often referred to as a \"Green Card\" - demonstrates Lawful Permanent Resident (LPR) status Unexpired Foreign Passport AND immigrant visa with I-551 annotation of \"Upon Endorsement Serves as Temporary I-551 Evidencing Permanent Residence of 1 Year\" - demonstrates LPR status Unexpired Re-entry Permit (I-327) - demonstrates LPR status A passport cannot be used as a List A document if it is expired. If it has expired within the past 12 months, it can be used, but only as a proof of citizenship (List B). ‍ ‍ List B – At least two documents are required if you do not have a document from List A to present. The name on both documents must match. The documents must include 1.) A valid photo ID, and 2.) A document that meets citizenship requirements (i.e., one document from each column below). Please note, the name on both required documents must match. ‍ Valid Photo ID Unexpired driver's license issued by a State or outlying possession of the U.S. Unexpired temporary driver's license plus expired driver's license (constitutes one document) Unexpired photo ID card issued by the Federal government or by a State or outlying possession of the U.S. This must include a federal agency, State or State agency seal or logo (such as a State university ID). Permits are not considered valid identity documents (such as gun permits). Unexpired U.S. military ID card Unexpired U.S. retired military ID card Unexpired U.S. military dependent's card Native American tribal document with photo Unexpired Department of Homeland Security(DHS)/ Transportation Security Administration (TSA) Transportation Worker Identification Credential (TWIC) Unexpired Merchant Mariner Credential (MMC) Valid Proof of Citizenship U.S. Birth Certificate * U.S. Certificate of Citizenship (N-560 or N-561) U.S. Certificate of Naturalization (N-550 or N-570) U.S. Citizen Identification Card (I-179 or I-197) Consular Report of Birth Abroad (FS-240) Certification of Report of Birth Abroad (DS-1350 or FS-545) Expired U.S. passport within 12 months of expiration ** * An original or certified copy of a document must be issued by a Federal, State, Tribal, county, municipal authority, or outlying possession bearing an official seal. Short form or abstract birth certificates and notarized copies of documents are not acceptable. ** A passport cannot be used as a List A document if it is expired. If it has expired within the past 12 months, it can be used, but only as a proof of citizenship (List B). Additionally, an expired U.S. passport may not be presented by itself. It must be presented with at least one other List B document. If you are also enrolling in CLEAR Plus, a valid, unexpired government-issued ID is required. Examples include: U.S. Passport Book or Card U.S. Driver's License State Issued ID ‍ I originally enrolled in TSA PreCheck® with another company. Can I renew with CLEAR? Yes! Anyone with an existing TSA PreCheck® membership can renew through CLEAR. You may begin the renewal process as early as 6 months prior to expiration. What is the difference between CLEAR Plus and TSA PreCheck®? Do I need both? CLEAR Plus allows for a quick identity verification experience at the airport. Step right up to a CLEAR pod and verify you are you with your eyes or fingerprints. TSA PreCheck® is a U.S. government program that identifies travelers deemed low-risk by the Transportation Security Administration (TSA). Once approved to participate in the program, it allows travelers to pass through expedited security screening at U.S. airports nationwide with no need to remove shoes, laptops, 3-1-1 liquids, belts or light jackets. This allows travelers to enjoy a more convenient and efficient experience at airport security.Many of our members find that these two services complement each other — providing the quickest, surest route through the airport. Do any credit card companies offer discounts for TSA PreCheck®? The following credit cards listed here , cover the TSA PreCheck® application fee as a member benefit. Check to see if your credit card participates. See all F.A.Q.s Start Online Pre-enroll or renew today in minutes. Pick your plan Finish at the Airport A CLEAR Ambassador will help you complete your TSA PreCheck ® application at the airport near you 1 —no appointment needed. 1 Currently available at a select number of airports. Enjoy the Journey If approved, keep your shoes, belts, and light jackets on—and laptops and 3-1-1 liquids stay in your bag—at 200+ airports nationwide. ‍ Pre-enroll or renew today in minutes. Finish at the Airport A CLEAR Ambassador will help you complete your TSA PreCheck ® application at the airport near you 1 —no appointment needed. If approved, keep your shoes, belts, and light jackets on—and laptops and 3-1-1 liquids stay in your bag—at 200+ airports nationwide. ‍ Enroll at an airport near you and start using your CLEAR Plus Membership right away. You can even speed up the process by answering a few questions online before you go. How to Get TSA PreCheck ® Through CLEAR Pre-enroll or renew today in minutes. How to Get TSA PreCheck ® Through CLEAR A CLEAR Ambassador will help you complete your TSA PreCheck ® application at an airport near you¹—no appointment needed. 1 Currently available at a select number of airports. How to Get TSA PreCheck ® Through CLEAR If approved, keep your shoes, belts, and light jackets on—and laptops and 3-1-1 liquids stay in your bag—at 200+ airports nationwide. Apply for TSA PreCheck ® No need to remove shoes, belts, 3-1-1 liquids, laptops, or light jackets Available with 90+ airlines at 200+ airports nationwide Kids 17 and under join you free when booked on the same reservation and when indicated on the child's boarding pass Renew TSA PreCheck ® when you renew online Or $77.95 for 5 years when you complete your renewal in-person. Bundle with CLEAR Plus For the fastest way to your gate at the best value. Get both services for one low price: Save 35% off your first year ¹ of CLEAR Plus ² when you bundle with TSA PreCheck ® . Do I need to make an appointment to enroll in TSA PreCheck® through CLEAR? Nope! Save time by pre-enrolling online and complete your registration at the nearest participating CLEAR location . No appointment is necessary. Don't forget to bring all required documentation . Our friendly ambassadors will be there to help you every step of the way. What documents are required to enroll for TSA PreCheck®? For TSA PreCheck ® , the following documentation is required to meet identity and citizenship requirements - see below: List A – ONE document is acceptable from the following forms of identification: Unexpired U.S. Passport (book or card) - demonstrates U.S. Citizenship Unexpired Enhanced Tribal Card (ETC) - demonstrates U.S. Citizenship Unexpired Free and Secure Trade (FAST) Card - designates U.S. Citizenship if indicated on the FAST card Unexpired U.S. Enhanced Driver's License (EDL) or Unexpired Enhanced Identification Card (EID) - designates U.S. Citizenship if indicated on the EDL or EIC Permanent Resident Card (I-551) often referred to as a \"Green Card\" - demonstrates Lawful Permanent Resident (LPR) status Unexpired Foreign Passport AND immigrant visa with I-551 annotation of \"Upon Endorsement Serves as Temporary I-551 Evidencing Permanent Residence of 1 Year\" - demonstrates LPR status Unexpired Re-entry Permit (I-327) - demonstrates LPR status A passport cannot be used as a List A document if it is expired. If it has expired within the past 12 months, it can be used, but only as a proof of citizenship (List B). List B – At least two documents are required if you do not have a document from List A to present. The name on both documents must match. The documents must include 1.) A valid photo ID, and 2.) A document that meets citizenship requirements (i.e., one document from each column below). Please note, the name on both required documents must match. Unexpired driver's license issued by a State or outlying possession of the U.S. Unexpired temporary driver's license plus expired driver's license (constitutes one document) Unexpired photo ID card issued by the Federal government or by a State or outlying possession of the U.S. This must include a federal agency, State or State agency seal or logo (such as a State university ID). Permits are not considered valid identity documents (such as gun permits). Unexpired U.S. military ID card Unexpired U.S. retired military ID card Unexpired U.S. military dependent's card Native American tribal document with photo Unexpired Department of Homeland Security(DHS)/ Transportation Security Administration (TSA) Transportation Worker Identification Credential (TWIC) Unexpired Merchant Mariner Credential (MMC) Valid Proof of Citizenship U.S. Birth Certificate * U.S. Certificate of Citizenship (N-560 or N-561) U.S. Certificate of Naturalization (N-550 or N-570) U.S. Citizen Identification Card (I-179 or I-197) Consular Report of Birth Abroad (FS-240) Certification of Report of Birth Abroad (DS-1350 or FS-545) Expired U.S. passport within 12 months of expiration ** * An original or certified copy of a document must be issued by a Federal, State, Tribal, county, municipal authority, or outlying possession bearing an official seal. Short form or abstract birth certificates and notarized copies of documents are not acceptable. ** A passport cannot be used as a List A document if it is expired. If it has expired within the past 12 months, it can be used, but only as a proof of citizenship (List B). Additionally, an expired U.S. passport may not be presented by itself. It must be presented with at least one other List B document. If you are also enrolling in CLEAR Plus, a valid, unexpired government-issued ID is required. Examples include: U.S. Passport Book or Card I originally enrolled in TSA PreCheck® with another company. Can I renew with CLEAR? Yes! Anyone with an existing TSA PreCheck® membership can renew through CLEAR. You may begin the renewal process as early as 6 months prior to expiration. What is the difference between CLEAR Plus and TSA PreCheck®? Do I need both? CLEAR Plus allows for a quick identity verification experience at the airport. Step right up to a CLEAR pod and verify you are you with your eyes or fingerprints. TSA PreCheck® is a U.S. government program that identifies travelers deemed low-risk by the Transportation Security Administration (TSA). Once approved to participate in the program, it allows travelers to pass through expedited security screening at U.S. airports nationwide with no need to remove shoes, laptops, 3-1-1 liquids, belts or light jackets. This allows travelers to enjoy a more convenient and efficient experience at airport security.Many of our members find that these two services complement each other — providing the quickest, surest route through the airport. Do any credit card companies offer discounts for TSA PreCheck®? The following credit cards listed here , cover the TSA PreCheck® application fee as a member benefit. Check to see if your credit card participates."
  ]
}