{
  "company": "www.orcam.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Empowering Accessibility with AI OrCam leverages AI for handheld and wearable assistive solutions, catering to the visually impaired and those with reading challenges. Contact Us Find Us Near You OrCam Update: Commitment to Our Low Vision Community OrCam remains committed to providing our Low Vision users with the highest quality, most advanced, and robust products. We remain focused on our Low Vision users by providing advancements and support to our users. We are working closely with our US-based distributors to best address your needs seamlessly. Customer Support, Research & Development, Manufacturing, and Operations continue to function and respond to our users' needs. Our devices are warehoused in the United States to ship out directly and we look to further minimize delay in getting our products out to our users. We are excited to announce that with the use of our OrCam App, available on both Android and iOS, users will experience software updates regularly and seamlessly without additional steps for the appropriate devices. We appreciate your support and commitment to our Read and MyEye products to support greater independence for our low-vision and blind users. For further information or support please reach out to our US distributors or on the website for your direct contact. As seen on The Balancing Act on Lifetime Network Award Winning Innovations Accessibility Solutions Designed to Meet Your Unique Needs OrCam MyEye 3 Pro For the Blind & Visually Impaired Provides visual and text descriptions along with an AI assistant all in a wearable device. OrCam MyEye 2 Pro For the Blind & Visually Impaired Wearable solution, instantly read text from any book & screen, seamlessly recognize faces & more. New! OrCam Read 5 For Low Vision & Reading Fatigue Read, ask, and interact naturally—plus a Smart Magnifier for screens. OrCam Read 3 For Low Vision & Reading Fatigue A handheld device equipped with an AI-powered Smart Reading Magnifier that reads any text. Enhanced Independence Experience a newfound sense of freedom in your daily life with OrCam's cutting-edge AI technology that makes the devices both powerful and user-friendly Effortless Reading Contextual Clarity Sleek Elegance Customized Solutions Discover OrCam's assistive technology, tailored to your needs. Enjoy added flexibility and independence with wearable and handheld solutions, enhanced by exceptional support and a vibrant community Enhanced Vision Support Empowering Dyslexia & ADHD Aid Customizable Reading Community and Support Discover OrCam's unmatched customer support and dynamic, resource-rich community, collectively enhancing your experience Join Our Community Dedicated Support Ask & Answer Questions Personalized Experience Life With OrCam Across 50 countries and in 25 languages, OrCam's technology is empowering tens of thousands of users every day. Their stories speak for themselves – Dive into the firsthand accounts of our amazing users OrCam Read 3 OrCam MyEye OrCam Read Empowering Accessibility with AI OrCam leverages AI for handheld and wearable assistive solutions, catering to the visually impaired and those with reading challenges. OrCam Update: Commitment to Our Low Vision Community OrCam remains committed to providing our Low Vision users with the highest quality, most advanced, and robust products. We remain focused on our Low Vision users by providing advancements and support to our users. We are working closely with our US-based distributors to best address your needs seamlessly. Customer Support, Research & Development, Manufacturing, and Operations continue to function and respond to our users' needs. Our devices are warehoused in the United States to ship out directly and we look to further minimize delay in getting our products out to our users. We are excited to announce that with the use of our OrCam App, available on both Android and iOS, users will experience software updates regularly and seamlessly without additional steps for the appropriate devices. We appreciate your support and commitment to our Read and MyEye products to support greater independence for our low-vision and blind users. For further information or support please reach out to our US distributors or on the website for your direct contact. As seen on The Balancing Act on Lifetime Network Accessibility Solutions Designed to Meet Your Unique Needs OrCam MyEye 3 Pro For the Blind & Visually Impaired Provides visual and text descriptions along with an AI assistant all in a wearable device. OrCam MyEye 2 Pro For the Blind & Visually Impaired Wearable solution, instantly read text from any book & screen, seamlessly recognize faces & more. For Low Vision & Reading Fatigue Read, ask, and interact naturally—plus a Smart Magnifier for screens. For Low Vision & Reading Fatigue A handheld device equipped with an AI-powered Smart Reading Magnifier that reads any text. Experience a newfound sense of freedom in your daily life with OrCam's cutting-edge AI technology that makes the devices both powerful and user-friendly Discover OrCam's assistive technology, tailored to your needs. Enjoy added flexibility and independence with wearable and handheld solutions, enhanced by exceptional support and a vibrant community Discover OrCam's unmatched customer support and dynamic, resource-rich community, collectively enhancing your experience Ask & Answer Questions Across 50 countries and in 25 languages, OrCam's technology is empowering tens of thousands of users every day. Their stories speak for themselves – Dive into the firsthand accounts of our amazing users"
  ]
}