{
  "company": "www.inreality.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Products Engagement Tracker Analytic platform Understand and Optimize Shopper Engagement Measure Stopping Power and Expose Loss Revenue. Schedule a Demo Understand and Optimize Shopper Engagement Measure Stopping Power and Expose Loss Revenue. Schedule a Demo Understand and Optimize Shopper Engagement Measure Stopping Power and Expose Loss Revenue. Our technology helps retailers like you answer the questions that affect your bottom line: Are people engaging with my product displays? Do those product engagements lead to sales? How do I use those engagement insights to optimize my shopper experience for better profits? Our technology helps retailers like you answer the questions that affect your bottom line: Our technology helps retailers like you answer the questions that affect your bottom line: Are people engaging with my product displays? Do those product engagements lead to sales? How do I use those engagement insights to optimize my shopper experience for better profits? You can only improve what you Measure! Measure Stopping Power Expose Loss Revenue When it comes to in-store shopper engagement, you want to know your product displays are stopping people in their tracks – and actually leading to sales. You can only improve what you Measure! Measure Stopping Power Expose Loss Revenue When it comes to in-store shopper engagement, you want to know your product displays are stopping people in their tracks – and actually leading to sales. You can only improve what you Measure! When it comes to in-store shopper engagement, you want to know your product displays are stopping people in their tracks – and actually leading to sales. How do inReality's Technology Applications help my retail business? Door Counter Fixture Engagement Digital Signage How do inReality's Technology Applications help my retail business? Door Counter Fixture Engagement Digital Signage Enabling the move from Gut-feel to Data Driven decision making \"This changes everything!\" \"Amazing - all my footfall data on one platform\" \"Finally, a way to get in-store behavioral metrics at scale!\" Enabling the move from Gut-feel to Data Driven decision making Enabling the move from Gut-feel to Data Driven decision making \"This changes everything!\" \"Amazing - all my footfall data on one platform\" \"Finally, a way to get in-store behavioral metrics at scale!\" Brands Who Have Benefited From inReality's Technology Brands Who Have Benefited From inReality's Technology Why inReality's Engagement Tracker? Simplicity Our industry-leading technology supplies the crucial insights for understanding and optimizing in-store product engagement. Our sensors and software are easy to install and everything syncs seamlessly within our secure cloud platform. Security inReality retail technology does not rely on any technology associated with consumer privacy risk – like cameras or phone data. By using our radar-based products, your patrons' privacy is always protected and any associated legal risk is removed. Savings As opposed to the stereoscopic cameras our competitors use, inReality products are 100% radar-based. Because our materials cost less to produce (yet are equally effective), we are able to pass along those cost savings to our retail partners. Why inReality's Engagement Tracker? Simplicity Our industry-leading technology supplies the crucial insights for understanding and optimizing in-store product engagement. Our sensors and software are easy to install and everything syncs seamlessly within our secure cloud platform. Security inReality retail technology does not rely on any technology associated with consumer privacy risk – like cameras or phone data. By using our radar-based products, your patrons' privacy is always protected and any associated legal risk is removed. Savings As opposed to the stereoscopic cameras our competitors use, inReality products are 100% radar-based. Because our materials cost less to produce (yet are equally effective), we are able to pass along those cost savings to our retail partners. Our industry-leading technology supplies the crucial insights for understanding and optimizing in-store product engagement. Our sensors and software are easy to install and everything syncs seamlessly within our secure cloud platform. inReality retail technology does not rely on any technology associated with consumer privacy risk – like cameras or phone data. By using our radar-based products, your patrons' privacy is always protected and any associated legal risk is removed. As opposed to the stereoscopic cameras our competitors use, inReality products are 100% radar-based. Because our materials cost less to produce (yet are equally effective), we are able to pass along those cost savings to our retail partners. inReality's Retail Analytics platform simplifies measuring traffic and engagement at key points of decision. Products Analytics Platform Engagement Tracker Contact Contact Form Return Refund Policy Shipping Policy"
  ]
}