{
  "company": "www.trac-tech.co.za",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 9,
    "0": 8
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 17
  },
  "topic_timeline": {
    "20": {
      "-1": 9,
      "0": 8
    }
  },
  "sample_docs": [
    "Time & Attendance: With the rising cost of labour, it is essential for companies both large and small to accurately manage their employees time keeping. An effective time and attendance solution will assist you to control overtime, manage tardiness, eliminate payroll fraud and reduce processing time. Trac-Tech has time and attendance solutions for organizations with only 5 employees right up to corporations with 100,000+ employees spread across 1,000's of branches. Access Control: In order to secure your people and assets an electronic access control solution is an essential part of knowing and controlling who has access to your site, where and when. Trac-Tech has access control solutions for stand-alone doors, multi point online real-time configurations and centrally managed enterprise wide applications. Biometric Technology: Identity Management is an integral factor in the success of any Time and Access control project. Fingerprint and Face recognition technologies offer both convenience and security. Trac-Tech has been implementing ViRDI™, SAGEM / MORPHO™, HANDPUNCH™, ANVIZ™ & ZKTeco™ since 1999. Trac-Tech: Trac-Tech (Pty) Ltd is a market leader specializing in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has supplied technology and implemented solutions at over 10000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. 25 Year Anniversary: Trac-Tech was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 25 years the business has evolved into a solutions based business. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. Sage VIP Payroll: Trac-Tech's TNA solutions integrate with over 40 different Payroll Products. Although we do not provide payroll products, we work very closely with South Africa's leading Payroll Company, Sage VIP and for the last few years have been their top partner in a number of regions. Our TNA solution is the only WEB based technology with full bi-directional integration. With the rising cost of labour, it is essential for companies both large and small to accurately manage their employees time keeping. An effective time and attendance solution will assist you to control overtime, manage tardiness, eliminate payroll fraud and reduce processing time. Trac-Tech has time and attendance solutions for organizations with only 5 employees right up to corporations with 100,000+ employees spread across 1,000's of branches. In order to secure your people and assets an electronic access control solution is an essential part of knowing and controlling who has access to your site, where and when. Trac-Tech has access control solutions for stand-alone doors, multi point online real-time configurations and centrally managed enterprise wide applications. Identity Management is an integral factor in the success of any Time and Access control project. Fingerprint and Face recognition technologies offer both convenience and security. Trac-Tech has been implementing ViRDI™, SAGEM / MORPHO™, HANDPUNCH™, ANVIZ™ & ZKTeco™ since 1999. Trac-Tech (Pty) Ltd is a market leader specializing in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has supplied technology and implemented solutions at over 10000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. Trac-Tech was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 25 years the business has evolved into a solutions based business. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. Trac-Tech's TNA solutions integrate with over 40 different Payroll Products. Although we do not provide payroll products, we work very closely with South Africa's leading Payroll Company, Sage VIP and for the last few years have been their top partner in a number of regions. Our TNA solution is the only WEB based technology with full bi-directional integration.",
    "Biometric Technology Biometric Identification / Authentication is used to enhance Access and Time Management implementations by accurately identify users, eliminating ghost employees, preventing identity theft and provides the added convenience of a form of ID which cannot be forgotten, lost or duplicated. ​ Trac-Tech has been successfully implementing ViRDI Biometric technology since 2007. The products are in use on 1000's of sites in more than 40 industries by market leading organisations. Africa's largest Retailer, the Shoprite Group has 1000+ Sites, 128 000+ Active Employees, 1 400 000+ Fingerprint Template Database and Processes 200 000+ Transactions per day. The Fingerprint Enrolment Success Rate is 99.1% and system uptime since 2012 is 99.99+%. ViRDI Devices have the following Standard Features: Advantages: Live and Fake Finger Detection Worlds Best Commercial Embedded Fingerprint Algorithm Sapphire Crystal Optical Sensor Similar Fingerprint Database Check Key Features: 10 Fingerprint Enrolment Per User User Identification on both Terminal and Server Terminals \"PUSH\" data to Server. Embedded ID Card Readers (RFID / Mifare / Desfire / HID / Felica) Visit the ViRDI Website for detailed product info Biometric Technology Biometric Identification / Authentication is used to enhance Access and Time Management implementations by accurately identify users, eliminating ghost employees, preventing identity theft and provides the added convenience of a form of ID which cannot be forgotten, lost or duplicated. ​ Trac-Tech has been successfully implementing ViRDI Biometric technology since 2007. The products are in use on 1000's of sites in more than 40 industries by market leading organisations. Africa's largest Retailer, the Shoprite Group has 1000+ Sites, 128 000+ Active Employees, 1 400 000+ Fingerprint Template Database and Processes 200 000+ Transactions per day. The Fingerprint Enrolment Success Rate is 99.1% and system uptime since 2012 is 99.99+%. ViRDI Devices have the following Standard Features: Advantages: Live and Fake Finger Detection Worlds Best Commercial Embedded Fingerprint Algorithm Sapphire Crystal Optical Sensor Similar Fingerprint Database Check Key Features: 10 Fingerprint Enrolment Per User User Identification on both Terminal and Server Terminals \"PUSH\" data to Server. Embedded ID Card Readers (RFID / Mifare / Desfire / HID / Felica) Visit the ViRDI Website for detailed product info Biometric Identification / Authentication is used to enhance Access and Time Management implementations by accurately identify users, eliminating ghost employees, preventing identity theft and provides the added convenience of a form of ID which cannot be forgotten, lost or duplicated. Trac-Tech has been successfully implementing ViRDI Biometric technology since 2007. The products are in use on 1000's of sites in more than 40 industries by market leading organisations. Africa's largest Retailer, the Shoprite Group has 1000+ Sites, 128 000+ Active Employees, 1 400 000+ Fingerprint Template Database and Processes 200 000+ Transactions per day. The Fingerprint Enrolment Success Rate is 99.1% and system uptime since 2012 is 99.99+%. ViRDI Devices have the following Standard Features: Live and Fake Finger Detection Live and Fake Finger Detection Worlds Best Commercial Embedded Fingerprint Algorithm Worlds Best Commercial Embedded Fingerprint Algorithm Sapphire Crystal Optical Sensor Sapphire Crystal Optical Sensor Similar Fingerprint Database Check Similar Fingerprint Database Check 10 Fingerprint Enrolment Per User 10 Fingerprint Enrolment Per User User Identification on both Terminal and Server User Identification on both Terminal and Server Terminals \"PUSH\" data to Server. Terminals \"PUSH\" data to Server. Embedded ID Card Readers (RFID / Mifare / Desfire / HID / Felica) Embedded ID Card Readers (RFID / Mifare / Desfire / HID / Felica)",
    "Time & Attendance: With the rising cost of labour, it is essential for companies both large and small to accurately manage their employees time keeping. An effective time and attendance solution will assist you to control overtime, manage tardiness, eliminate payroll fraud and reduce processing time. Trac-Tech has time and attendance solutions for organizations with only 5 employees right up to corporations with 100,000+ employees spread across 1,000's of branches. Access Control: In order to secure your people and assets an electronic access control solution is an essential part of knowing and controlling who has access to your site, where and when. Trac-Tech has access control solutions for stand-alone doors, multi point online real-time configurations and centrally managed enterprise wide applications. Biometric Technology: Identity Management is an integral factor in the success of any Time and Access control project. Fingerprint and Face recognition technologies offer both convenience and security. Trac-Tech has been implementing ViRDI™, SAGEM / MORPHO™, HANDPUNCH™, ANVIZ™ & ZKTeco™ since 1999. Trac-Tech: Trac-Tech (Pty) Ltd is a market leader specializing in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has supplied technology and implemented solutions at over 10000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. 25 Year Anniversary: Trac-Tech was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 25 years the business has evolved into a solutions based business. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. Sage VIP Payroll: Trac-Tech's TNA solutions integrate with over 40 different Payroll Products. Although we do not provide payroll products, we work very closely with South Africa's leading Payroll Company, Sage VIP and for the last few years have been their top partner in a number of regions. Our TNA solution is the only WEB based technology with full bi-directional integration. With the rising cost of labour, it is essential for companies both large and small to accurately manage their employees time keeping. An effective time and attendance solution will assist you to control overtime, manage tardiness, eliminate payroll fraud and reduce processing time. Trac-Tech has time and attendance solutions for organizations with only 5 employees right up to corporations with 100,000+ employees spread across 1,000's of branches. In order to secure your people and assets an electronic access control solution is an essential part of knowing and controlling who has access to your site, where and when. Trac-Tech has access control solutions for stand-alone doors, multi point online real-time configurations and centrally managed enterprise wide applications. Identity Management is an integral factor in the success of any Time and Access control project. Fingerprint and Face recognition technologies offer both convenience and security. Trac-Tech has been implementing ViRDI™, SAGEM / MORPHO™, HANDPUNCH™, ANVIZ™ & ZKTeco™ since 1999. Trac-Tech (Pty) Ltd is a market leader specializing in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has supplied technology and implemented solutions at over 10000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. Trac-Tech was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 25 years the business has evolved into a solutions based business. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. Trac-Tech's TNA solutions integrate with over 40 different Payroll Products. Although we do not provide payroll products, we work very closely with South Africa's leading Payroll Company, Sage VIP and for the last few years have been their top partner in a number of regions. Our TNA solution is the only WEB based technology with full bi-directional integration.",
    "Perimeter Security Employees transact at the perimeter security barrier, where the biometric terminal / card reader confirms their identity, time zone validity and anti-pass-back status. Vehicle Barrier Vehicle access is limited to employees with access rights and can incorporate control for visitors. Visitor Management Visitors are registered on the system & are either assigned a visitors card, or have their fingers scanned for a biometric template. Visitors may only transact at assigned readers, or can be hosted by an employee. \"Access Rights\" expire at the end of a visit. Elevator Control Control lift access for apartments and offices by interfacing either RFID or biometric technology with the lift control panel. Meal Management Monitor access to the canteen and limit the number of subsidised meals served to each employee, or use the technology for a cashless payment environment. High Security Areas Limit access to your server room with biometric readers and stand-alone electronic door locks. Monitor the activities of the personnel and the movement of equipment with integrated digital CCTV. Integrated Applications Manage the access control rights and time management of your office employees. By integrating biometric technology with your access controller, you are able to ensure that only authorised employees are able to enter restricted areas. Over and above the access control functionality, you are able to incorporate full blown time & attendance control for selected employees. Parameter Driven Configuration Each individual access / time recording point has a specific set of pre-defined business rules catering for that points security requirements. Time zones, anti-pass-back, rules and intrusion detection are individually defined. With built in TCP/IP communications configurations settings can be uploaded on the fly. Central Control With a fully integrated access control / building management solution incorporation digital CCTV and intrusion detection, security personnel can track and manage all security incidents on-line & real-time. Perimeter Security Employees transact at the perimeter security barrier, where the biometric terminal / card reader confirms their identity, time zone validity and anti-pass-back status. Vehicle Barrier Vehicle access is limited to employees with access rights and can incorporate control for visitors. Visitor Management Visitors are registered on the system & are either assigned a visitors card, or have their fingers scanned for a biometric template. Visitors may only transact at assigned readers, or can be hosted by an employee. \"Access Rights\" expire at the end of a visit. Employees transact at the perimeter security barrier, where the biometric terminal / card reader confirms their identity, time zone validity and anti-pass-back status. Vehicle access is limited to employees with access rights and can incorporate control for visitors. Visitors are registered on the system & are either assigned a visitors card, or have their fingers scanned for a biometric template. Visitors may only transact at assigned readers, or can be hosted by an employee. \"Access Rights\" expire at the end of a visit. Elevator Control Control lift access for apartments and offices by interfacing either RFID or biometric technology with the lift control panel. Meal Management Monitor access to the canteen and limit the number of subsidised meals served to each employee, or use the technology for a cashless payment environment. High Security Areas Limit access to your server room with biometric readers and stand-alone electronic door locks. Monitor the activities of the personnel and the movement of equipment with integrated digital CCTV. Control lift access for apartments and offices by interfacing either RFID or biometric technology with the lift control panel. Monitor access to the canteen and limit the number of subsidised meals served to each employee, or use the technology for a cashless payment environment. Limit access to your server room with biometric readers and stand-alone electronic door locks. Monitor the activities of the personnel and the movement of equipment with integrated digital CCTV. Integrated Applications Manage the access control rights and time management of your office employees. By integrating biometric technology with your access controller, you are able to ensure that only authorised employees are able to enter restricted areas. Over and above the access control functionality, you are able to incorporate full blown time & attendance control for selected employees. Parameter Driven Configuration Each individual access / time recording point has a specific set of pre-defined business rules catering for that points security requirements. Time zones, anti-pass-back, rules and intrusion detection are individually defined. With built in TCP/IP communications configurations settings can be uploaded on the fly. Central Control With a fully integrated access control / building management solution incorporation digital CCTV and intrusion detection, security personnel can track and manage all security incidents on-line & real-time. Manage the access control rights and time management of your office employees. By integrating biometric technology with your access controller, you are able to ensure that only authorised employees are able to enter restricted areas. Over and above the access control functionality, you are able to incorporate full blown time & attendance control for selected employees. Each individual access / time recording point has a specific set of pre-defined business rules catering for that points security requirements. Time zones, anti-pass-back, rules and intrusion detection are individually defined. With built in TCP/IP communications configurations settings can be uploaded on the fly. With a fully integrated access control / building management solution incorporation digital CCTV and intrusion detection, security personnel can track and manage all security incidents on-line & real-time.",
    "Trac-Tech (Pty) Ltd was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 31 years the business has evolved into a solutions based business. Today, Trac-Tech is a market leader specialising in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. ​ Trac-Tech has supplied technology and implemented solutions at over 10 000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. Trac-Tech (Pty) Ltd was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 31 years the business has evolved into a solutions based business. Today, Trac-Tech is a market leader specialising in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. ​ Trac-Tech has supplied technology and implemented solutions at over 10 000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you. Trac-Tech (Pty) Ltd was established in 1989 as an electronic and software design company focusing on solutions for managing workforces. Over the last 31 years the business has evolved into a solutions based business. Today, Trac-Tech is a market leader specialising in implementing Workforce Management Solutions, Time & Attendance, Access Control and Biometric Technology with full Payroll integration. Trac-Tech has one of the most experienced management teams who collectively have over 200 man years in the workforce management industry and was a pioneer in the implementation of biometric solutions with the first sites installed in 1999. Trac-Tech has supplied technology and implemented solutions at over 10 000 sites in Southern Africa with branches in Cape Town, Johannesburg and Durban. Our well trained and highly experienced teams are able to design, plan, implement and service a solution for you."
  ]
}