{
  "company": "www.vinai.io",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Bringing Intelligence to Every Drive 01 InteriorSense Driver Monitoring System Our Driver Monitoring System offers accurate, real-time in-cabin monitoring to enhance driver safety and help OEMs meet regulatory requirements. It detects signs of fatigue, distraction, and risky behaviors, making every journey safer and smarter. Watch Demo 02 InteriorSense DrunkSense DrunkSense is the world's first passive drunk impairment detection system that works without a breathalyzer. It has a 85% sensitivity. Watch Demo 02 InteriorSense MirrorSense MirrorSense is the world's first AI-driven automatic mirror adjustment technology that has been honored with the Innovation Award Honoree at CES 2024. This technology can be easily expanded to enhance safety applications while driving, such as augmented reality heads-up displays and auto-adjust seat settings. Watch Demo 03 SurroundSense Smart Parking - Touch2Park Touch2Park is the winner of the 2024 AutoTech Breakthrough Award. This Level 2 smart parking solution enables effortless parking by a simple touch. It can adapt to diverse parking situations. Watch Demo 04 SurroundSense Advanced Surround View Monitoring System Our multi-camera system provides drivers with a complete real-time view around the vehicle and the ability to see through the entire car body. Watch Demo 04 SurroundSense JellyView JellyView allows drivers to gain a clear view beneath their vehicle. The view is constructed using images from sensors and cameras, enabling JellyView to be seamlessly integrated into existing vehicles without additional hardware. Watch Demo Bringing Intelligence to Every Drive Our Driver Monitoring System offers accurate, real-time in-cabin monitoring to enhance driver safety and help OEMs meet regulatory requirements. It detects signs of fatigue, distraction, and risky behaviors, making every journey safer and smarter. DrunkSense is the world's first passive drunk impairment detection system that works without a breathalyzer. It has a 85% sensitivity. MirrorSense is the world's first AI-driven automatic mirror adjustment technology that has been honored with the Innovation Award Honoree at CES 2024. This technology can be easily expanded to enhance safety applications while driving, such as augmented reality heads-up displays and auto-adjust seat settings. Smart Parking - Touch2Park Touch2Park is the winner of the 2024 AutoTech Breakthrough Award. This Level 2 smart parking solution enables effortless parking by a simple touch. It can adapt to diverse parking situations. Advanced Surround View Monitoring System Our multi-camera system provides drivers with a complete real-time view around the vehicle and the ability to see through the entire car body. JellyView allows drivers to gain a clear view beneath their vehicle. The view is constructed using images from sensors and cameras, enabling JellyView to be seamlessly integrated into existing vehicles without additional hardware. AI Talent At VinAI, we believe that great things happen when passionate individuals come together. We're constantly on the lookout for talented, motivated, and creative individuals who can contribute to our success. If you're looking for a dynamic and rewarding career in the technology industry, you've come to the right place. Join Our Team At VinAI, we believe that great things happen when passionate individuals come together. We're constantly on the lookout for talented, motivated, and creative individuals who can contribute to our success. If you're looking for a dynamic and rewarding career in the technology industry, you've come to the right place. Recognized by Global Partners and Media Recognized by Global Partners and Media"
  ]
}