{
  "company": "www.tuya.com",
  "dominant_topics": [
    19,
    17,
    0
  ],
  "topic_counts": {
    "19": 12,
    "17": 1,
    "0": 1
  },
  "topic_descriptions": {
    "19": "energy, software, water, management, grid",
    "17": "hid, think, like, know, really",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.8117647058823529,
    "framing_surveillance": 0.1529411764705882,
    "framing_market": 0.0352941176470588,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "17": 1,
      "19": 12
    }
  },
  "sample_docs": [
    "And of course, Tuya Smart takes data security and privacy of personal information very seriously. To this end, we have adapted advanced security technology, including military-grade encryption, full-web HTTPS, virtual device, dynamic password, dual password and encrypted communication. 4655 Old Ironsides Dr., Ste 100, Santa Clara, CA 95054, USA 7 Floor, 3 Blvd., More Centre, 87 Gudun Rd., Xihu District, Hangzhou, PRC. Tel: +86 (571) 56038587 213, H Blvd., Bao'an ZhiGu Technology Park, Xixiang Rd., Bao'an District, Shenzhen, PRC. Tel: +86 (400) 159 4688",
    "Solutions & Products Power Accessories Smart Plug Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioner Heater Water Heater Heated Blanket Smart Fan Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance Equipment Security Camera Kitchen Applicances Milk Maker Smart Oven Water Cup Kettle About Us About Tuya Smart Advantage Cooperation Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building China-based Tuya Smart launches the fully upgraded global IoT platform Chinese IoT solutions provider Tuya Smart delivers insights into what the future portends at the World Internet Conference Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07",
    "Wi-Fi-enabled IP Security Camera The camera supports voice control via Amazon Echo and features machine-learning and facial recognition capabilities. The device sends out alerts to users upon detecting movement, allowing the easy monitoring of a building or room from smartphones. Preview and playback functions Download and install the Tuya Smart app from the App Store or Google Play to control the device. Record HD video and watch it from anywhere. Your life moments are securely stored. You can play back the video anytime you want. The camera has a mic and a speaker. You can broadcast your voice using your smartphone. When any motion is detected, you will receive an alert on your smartphone and a picture of the room when the device was set off. Tuya Smart , 650 California Street, 7th Fl, San Francisco, CA 94111 7 Floor, 3 Blvd., More Centre, 87 Gudun Rd., Xihu District, Hangzhou, PRC. Tel: +86 (571) 56038587 213, H Blvd., Bao'an ZhiGu Technology Park, Xixiang Rd., Bao'an District, Shenzhen, PRC. Tel: +86 (400) 159 4688",
    "Solutions & Products Power Accessories Smart Plug Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioner Heater Water Heater Heated Blanket Smart Fan Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance Equipment Security Camera Kitchen Applicances Milk Maker Smart Oven Water Cup Kettle About Us About Tuya Smart Advantage Cooperation Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification The General Data Protection Regulation (GDPR) is an integrated law framework that focuses on protecting basic privacy and personal data of EU data subject. It imposes stringent regulations to improve data protection, security, and compliance standards. As the most important legislation transformation in the past 20 years in privacy and data protection field, the GDPR ushers in the new order of personal data protection in the Big Data era. It bestows new rights to people and puts forward high grade enterprise responsibility system. GDPR will come to effect on May 25, 2018. As a global IoT platform and a world leading voice AI interaction platform, Tuya Smart will integrate the demands of customers, brand manufacturers, OEM, factories and retail chain stores in intelligence and provides one-stop AI IoT solutions. Tuya Smart will use industry standard and optimal practices to protect personal data to ensure that the privacy practices of Tuya comply with laws and regulations. Tuya will focus on policies in all countries and timely follow up any changes to provide our customers and partners with more secure and reliable services. So far, Tuya has passed GDPR compliance verification. In order to meet the requirements of GDPR, Tuya has improved in the following aspects: We consider how to minimize the collection of data that is only necessary for our products during the design of our product to ensure that we do not excessively collect and process users' personal information. Besides, the technical personnel will take proper measures to secure the personal data of our users during the development and implementation of the system, such as: encryption storage of sensitive data, setting up strict access authority to ensure the safety of personal data of our users. Measures above have been strictly implemented into the design and development process of our products. Each product has undergone rigorous review before publishing. We are completely transparent about the collection and use of users' personal data. We have clearly stated in the that what kind of user data we collect, the purpose of the collection, the storage period, and ensure that the data is used within the user's expectations. Support for User Rights We put premium on users' individual rights to ensure that users can access the data collected by us and can properly modify the data. When users do not demand for our service any more, they can delete their individual data through the App. According to the lifecycle of data, the data security system of Tuya is developed for comprehensive and systematic construction by management and technical means. Every link of the lifecycle of data (data production, storage, use, transmission, data spread and elimination) is under data security management and control to realize the objective of data security. Please refer to the Tuya Smart White Paper for details. Only part of our works are listed here, but we do more than that. Moreover, Tuya has reached a cooperation plan with TrustArc. TrustArc will provide Tuya with a set of verified tools and solutions to implement the GDPR compliance plan. TurstArc's third-party assessment report is expected to be provided in the near future. Note: For more information about TrustArc, see its official website https://www.trustarc.com. TrustArc has more than 20 years' experience in privacy compliance and risk management, and can help the enterprises in the U.S.A., Europe and Asia to provide comprehensive assessment and certification for privacy policies and control actions. TrustArc has helped some world-class enterprises by providing data privacy and platform security audit, including Xiaomi, Aliyun, AWS, IBM, Apple, Cisco, Oracle and Wmware. TrustArc will also provide Tuya with the compliance to EU GDPR, and the compliance on personal information collection in the U.S.A. and other regions.",
    "Solutions & Products Power Accessories Smart Plug Switch Smart LED Lighting Light Bulb Household Appliances Air Conditioner Heater Water Heater Heated Blanket Smart Fan Environmental Health Air Purifier Dehumidifier Water Purifier Robotic Vacuum Cleaner Surveillance Equipment Security Camera Kitchen Applicances Milk Maker Smart Oven Water Cup Kettle About Us About Tuya Smart Advantage Cooperation China's Tuya Smart Announces Smart IoT Solution for U.S. Market New Security Solution from Tuya Smart Empowers Video Surveillance Manufactures with Easy Access to Echo Show Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Passes EU General Data Protection Regulation (GDPR) Compliance Verification 2018-05-23 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Makes its Presence in Light+Building; Smart Lighting Solution Enjoys a Popularity Boom 2018-04-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 Tuya Smart Promoting the Development of Global Smart Lighting Industry at Light + Building 2018-03-17 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 China-based Tuya Smart launches the fully upgraded global IoT platform 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 Tuya Smart's Global Strategy Empowers Global Manufacturers With AI 2018-01-10 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 China's Tuya Smart Announces Smart IoT Solution for U.S. Market 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Former Aliyun founding team develops global IoT platform to help traditional manufacturers embrace AI effortlessly 2018-01-08 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07 Tuya Smart is to announce the new website at CES2018, a breakthrough for the world-wide \"smart\" platform 2018-01-07"
  ]
}