{
  "company": "www.secureye.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 3
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 3
    }
  },
  "sample_docs": [
    "Copyright . Tech-Smart School Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Read More Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Perfect service system and deep service consciousness are our guarantee to meet the customers' demands. Tech Smart Home Access Control Wifi Enviroment Parking Management Smart Home Alarm system Tech-Smart Hospital coming soon Tech Smart Hotel Visitor Management System CCTV in Hotel Room Lighting Control system Mobile App for Customer Tech-Smart bank coming soon",
    "Copyright . Visitor Management Tech Smart Visitor Management has been designed specifically to offer a faster, smarter and more secure way to manage the visitors in your premises, companies, Society, schools, colleges etc. Front office and security guards in most of places are still using uncertain, inaccurate and dubious paper based entry system. Tech Smart visitor management is main application for processing visitors, including ID scanning, record creation, badge printing, watch list screening, check-in and check-out, email notifications among other features. Tech Smart offers complete integration with hardware products to provide a all-inclusive solutions to schools. This integration is the USP and added advantage that separates Tech Smart from other competition. Tech Smart Visitor Management has been designed specifically to offer a faster, smarter and more secure way to manage the visitors in your premises, companies, Society, schools, colleges etc. Front office and security guards in most of places are still using uncertain, inaccurate and dubious paper based entry system. Tech Smart visitor management is main application for processing visitors, including ID scanning, record creation, badge printing, watch list screening, check-in and check-out, email notifications among other features. Tech Smart offers complete integration with hardware products to provide a all-inclusive solutions to schools. This integration is the USP and added advantage that separates Tech Smart from other competition. Day wise create Prescheduled appointments Guard makes the visitor entry along with photo in guard console which get uploaded on Server or AWS Cloud Concerned staff can view the records from the software Email/SMS to concerned employee of visitor's arrival Email/SMS notifications request, approval & rejection Approve or reject appointment Block/ Red flag visitor & organization Capture image, fingerprint, signature & ID Card of visitor Master form for visitor's complete details Create material information with visitor Print pass of visitor Create user id & password and assign to employee and security personnel View all activities from employee and security View master report & appointment report Appointment history report of visitor Fast logging for frequent visitors Quick check-in and check-out for faculty and staff Integration with ERP for automated data sharing Day wise create Prescheduled appointments Guard makes the visitor entry along with photo in guard console which get uploaded on Server or AWS Cloud Concerned staff can view the records from the software Email/SMS to concerned employee of visitor's arrival Email/SMS notifications request, approval & rejection Approve or reject appointment Block/ Red flag visitor & organization Capture image, fingerprint, signature & ID Card of visitor Master form for visitor's complete details Create material information with visitor Print pass of visitor Create user id & password and assign to employee and security personnel View all activities from employee and security View master report & appointment report Appointment history report of visitor Fast logging for frequent visitors Quick check-in and check-out for faculty and staff Integration with ERP for automated data sharing Salient Features: Vis Record Modules Administrator module Security gate module Employee module Contractee Employee Module Multi company option Multi location, department, designation Import employee/contractee employee detail from excel/csv file Create prescheduled appointments(Day wise) Block visitor and / or organisation Approve or reject appointment Capture the image, fingerprint, signature and business card of visitor Create material information of visitor Print Pass of visitor Email Notification on request, approvals and rejections Admin: Create user Id and password and assign to employee and security Create appointment for employee View all activity from employee and security View the master report and appointment report Block visitor and / or organisation Create contractee employee also Employee/Contractee Employee: Create prescheduled appointments(Day wise) Modify Appointment Delete Appointment Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Vis Record Modules Administrator module Security gate module Employee module Contractee Employee Module Multi location, department, designation Import employee/contractee employee detail from excel/csv file Create prescheduled appointments(Day wise) Block visitor and / or organisation Approve or reject appointment Capture the image, fingerprint, signature and business card of visitor Create material information of visitor Print Pass of visitor Email Notification on request, approvals and rejections Create user Id and password and assign to employee and security Create appointment for employee View all activity from employee and security View the master report and appointment report Block visitor and / or organisation Create contractee employee also Create prescheduled appointments(Day wise) Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Master Form: Purpose master e.g. official, meeting etc. Priority master (High,Low,Medium) Type master (VIPs, General, Temporary, Permanent) Material master (e.g. Camera, Laptop, pen drive etc.) Material code(Nikon, Lenovo etc ) Status Master(Pending-Active-close) Security: Create prescheduled appointments(Day wise) Modify Appointment Delete Appointment Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Purpose master e.g. official, meeting etc. Type master (VIPs, General, Temporary, Permanent) Material master (e.g. Camera, Laptop, pen drive etc.) Material code(Nikon, Lenovo etc ) Create prescheduled appointments(Day wise) Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Min. Hardware Requirements: P-IV and Above with 1 GB RAM Windows XP / Vista / Windows 7 Windows 8 / Windows Server 2008 Database - SQL Express 2005,SQL Server 2005 or Above Reporting Tool - Crystal Report 10 Screen Resolution - 1024x768px Report: Purpose master e.g. official, meeting etc. Priority master (High,Low,Medium) Type master (VIPs, General, Temporary, Permanent) Material master (Camera, Laptop, pen drive etc) Material code(Nikon, Lenovo etc) Status Master(Pending-Active-close) Organisation Master P-IV and Above with 1 GB RAM Windows XP / Vista / Windows 7 Windows 8 / Windows Server 2008 Database - SQL Express 2005,SQL Server 2005 or Above Reporting Tool - Crystal Report 10 Screen Resolution - 1024x768px Purpose master e.g. official, meeting etc. Type master (VIPs, General, Temporary, Permanent) Material master (Camera, Laptop, pen drive etc) Material code(Nikon, Lenovo etc) Integrated Hardwares USB Biometric Device Web Camera Business Card Reader PVC & RFID Card PVC & RFID Card",
    "Secureye Visitor Management software is the main application for processing visitors, including ID scanning, record creation, badge printing, watch list screening, check-in and check-out and email notification, among other features. The solution improves security by enabling organisations to identify exactly who is in their facilities, while enhancing the professionalism of an organisation by streamlining the visitor check-in process and providing high quality visitor badges. Salient Features Vis Record Modules Administrator module Security gate module Employee module Contractee Employee Module Multi company option Multi location, department, designation Import employee/contractee employee detail from excel/csv file Create prescheduled appointments(Day wise) Block visitor and / or organisation Approve or reject appointment Capture the image, fingerprint, signature and business card of visitor Create material information of visitor Print Pass of visitor Email Notification on request, approvals and rejections Admin Employee/Contractee Employee Create user Id and password and assign to employee and security Create appointment for employee View all activity from employee and security View the master report and appointment report Block visitor and / or organisation Create contractee employee also Create prescheduled appointments(Day wise) Modify Appointment Delete Appointment Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Security Master Form Create non-appointment Create appointment request Create material information of visitor Print visitor badges Block visitor and organisation View the master report and appointment report Capture the image, fingerprint, signature and business card of visitor Purpose master e.g. official, meeting etc. Priority master (High,Low,Medium) Type master (VIPs, General, Temporary, Permanent) Material master (e.g. Camera, Laptop, pen drive etc.) Material code(Nikon, Lenovo etc ) Status Master(Pending-Active-close) Min.Hardware Requirements Report P-IV and Above with 1 GB RAM Windows XP / Vista / Windows 7 Windows 8 / Windows Server 2008 Database - SQL Express 2005,SQL Server 2005 or Above Reporting Tool - Crystal Report 10 Screen Resolution - 1024x768px Purpose master e.g. official, meeting etc. Priority master (High,Low,Medium) Type master (VIPs, General, Temporary, Permanent) Material master (Camera, Laptop, pen drive etc) Material code(Nikon, Lenovo etc) Status Master(Pending-Active-close) Organisation Master Contractee and other Employee, Visitor Master Appointment History Report Multi location, department, designation Import employee/contractee employee detail from excel/csv file Create prescheduled appointments(Day wise) Block visitor and / or organisation Approve or reject appointment Capture the image, fingerprint, signature and business card of visitor Create material information of visitor Print Pass of visitor Email Notification on request, approvals and rejections Create user Id and password and assign to employee and security Create appointment for employee View all activity from employee and security View the master report and appointment report Block visitor and / or organisation Create contractee employee also Create prescheduled appointments(Day wise) Approve or reject appointment request from security Block visitor and / or organisation View the master report and appointment report Create material information of visitor Block visitor and organisation View the master report and appointment report Capture the image, fingerprint, signature and business card of visitor Purpose master e.g. official, meeting etc. Type master (VIPs, General, Temporary, Permanent) Material master (e.g. Camera, Laptop, pen drive etc.) Material code(Nikon, Lenovo etc ) P-IV and Above with 1 GB RAM Windows XP / Vista / Windows 7 Windows 8 / Windows Server 2008 Database - SQL Express 2005,SQL Server 2005 or Above Reporting Tool - Crystal Report 10 Screen Resolution - 1024x768px Purpose master e.g. official, meeting etc. Type master (VIPs, General, Temporary, Permanent) Material master (Camera, Laptop, pen drive etc) Material code(Nikon, Lenovo etc) Contractee and other Employee, Visitor Master"
  ]
}