{
  "company": "www.facetrom.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 4,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 4
    }
  },
  "sample_docs": [
    "The core of any business is its customers, and finding and maintaining the right customers involves precision targeting, at the right time. There is no doubt that today, the market offers a wealth of advertising options, each with their own unique benefits, strategy, and methods. To top it off, you are able to measure the success of these campaigns using a variety of metrics including PPC, CPA, CTR, CPM and CPC. At the foundation of these traditional forms of advertising is a focus on the analytics of customers' behavior and cookies. These methods also use broad targeting and segmentation techniques. Imagine though if you could take this a step further and elevate the accuracy and strategy of your advertising by building your campaigns and target the right customers solely on customers' biological parameters, extracted from their facial photos. This is where Facetrom SPS AD takes center stage. Is your advertising really producing the results you want? Facetrom AdTech – Advertising based on users' biology. MAR-TECH EFFECTIVENESS OF THE STRATEGY CUSTOMIZATION LANDING PAGE CPM (COST PER MILLE) A major expense for any company is their marketing. Quality campaigns can cost up to millions of dollars and before a company invests in campaigns, surely they should have insight into the possible impact that the different advertising strategies will have? With Facetrom SPS AD, companies can have a clear understanding beforehand of the potential effectiveness and how it will contribute to customer acquisition. Each person is unique in their own way so why do companies persist in using the same ad, brochure or newsletter for their entire customer base? In order to truly 'speak' to potential customers, you need to be delivering ads that will have the greatest impact on the individual, based on their individual biological characteristics. Using Facetrom SPS AD, matches specific ads to a client's biological makeup, resulting in increased accuracy and engagement and ultimately, increased revenue. Why are different customers redirected to the same landing pages of a site? This 'one-size-fits-all' approach is ineffective as it reduces the impact of advertising based on people's individuality. Each customer should be directed to a customized landing page, with content and pictures that match their biological makeup. This will expand user engagement with the company's site, while also enhancing advertising possibilities and revenues. In order to increase the CPM value of a company, the 1000 ads used would need to be as effective as possible. With SPS AD, advertising companies will now have access to customized data that shows the optimal ad for each user, thereby increasing the power of these ads. With optimized advertising, ad agencies, networks and exchanges can charge higher fees for CPM, while also increasing the CPM value for each company. CPC (COST PER CLICK) Interestingly, research has shown that when ads have presenters, people or models in them, these ads are more effective and produce higher results. Now, imagine if we could identify exactly which presenters, people or models should be used in each ad in order to produce a higher CPC. This is exactly what Facetrom SPS AD does. As a result, your company will achieve a higher CPC rate, build a greater awareness to your brand, obtain more qualified leads and most importantly, achieve improved revenue. EMAIL MARKETING The approach in most companies today is to send similar and generalized emails to the company's customer base. In addition, the A/B testing system is often used, however, this method often causes companies to lose those potential clients who are more engaged to the A or B option and who are more likely to increase the CTR on these company emails. With SPS AD, the most appropriate content can be sent to each user based on their biological parameters. By finetuning company communications with their clients, businesses can achieve a higher call to action. SMART TV The next generation of personalized advertisements will be on the Smart TV and Digital shows. Ads presented on this medium should not be created and then presented simply based on a user's behavior as this provides limited, subjective information that exists within an environment that has a lot of 'noise'. SPS AD is a powerful and effective tool that enables companies to quickly customize ads based on their user's favorite models or actors that appear on the Smart TV and Digital shows as well as in the company's branding campaigns. By presenting customized ads that match the user's biological makeup, your marketing quickly 'speaks' directly to each user, thereby enhancing their effectiveness. RETARGETING In the digital world today, most marketing is based on targeting the right audience at the right time. The question is, is this method the most effective? On the positive side, the marketing tactics used today are more successful than those used in the past as well as than those used on TV and print. On the down side, most advertising campaigns only achieve a CPC average of 2.7%. To top it off, even when a specific market is retargeted, these users are probably also being targeted by other advertisers within the same vertical. As a result, your ad campaigns are only reaching a small percentage of your target market. With SPS AD, retargeting your audience is streamlined based on the biological makeup of the users, enabling your company to achieve a far greater retargeting effectiveness. DATE MANAGEMENT PLATFORM Over 75% of the decisions people make are based on their sight; what they see. Let's now shift into the digital world, that is inundated with information, and understand that the data that is collected about these online users is 'noisy' and is based on subjective parameters that can be changed within seconds. Using Facetrom SPS AD ensures that all data provided about users is objective and based solely on the user's facial features and biological makeup. SPS AD provides accurate user data that is based on how a user 'sees' the world and it then goes a step further by predicting how the user's brain transfers and analyzes the information they obtained from their sense of sight. In this way, over 75% of a user's decisions can be accurately predicted, simply based on their facial features. ​FACETROM SPS AD IS EVOLVING THE ADVERTISING LANDSCAPE BASED ON USER'S BIOLOGY TRY OUR DEMO CONTACT US The core of any business is its customers, and finding and maintaining the right customers involves precision targeting, at the right time. There is no doubt that today, the market offers a wealth of advertising options, each with their own unique benefits, strategy, and methods. To top it off, you are able to measure the success of these campaigns using a variety of metrics including PPC, CPA, CTR, CPM and CPC. At the foundation of these traditional forms of advertising is a focus on the analytics of customers' behavior and cookies. These methods also use broad targeting and segmentation techniques. Imagine though if you could take this a step further and elevate the accuracy and strategy of your advertising by building your campaigns and target the right customers solely on customers' biological parameters, extracted from their facial photos. This is where Facetrom SPS AD takes center stage. The core of any business is its customers, and finding and maintaining the right customers involves precision targeting, at the right time. There is no doubt that today, the market offers a wealth of advertising options, each with their own unique benefits, strategy, and methods. To top it off, you are able to measure the success of these campaigns using a variety of metrics including PPC, CPA, CTR, CPM and CPC. At the foundation of these traditional forms of advertising is a focus on the analytics of customers' behavior and cookies. These methods also use broad targeting and segmentation techniques. Imagine though if you could take this a step further and elevate the accuracy and strategy of your advertising by building your campaigns and target the right customers solely on customers' biological parameters, extracted from their facial photos. This is where Facetrom SPS AD takes center stage. Is your advertising really producing the results you want? Facetrom AdTech – Advertising based on users' biology. A major expense for any company is their marketing. Quality campaigns can cost up to millions of dollars and before a company invests in campaigns, surely they should have insight into the possible impact that the different advertising strategies will have? With Facetrom SPS AD, companies can have a clear understanding beforehand of the potential effectiveness and how it will contribute to customer acquisition. Each person is unique in their own way so why do companies persist in using the same ad, brochure or newsletter for their entire customer base? In order to truly 'speak' to potential customers, you need to be delivering ads that will have the greatest impact on the individual, based on their individual biological characteristics. Using Facetrom SPS AD, matches specific ads to a client's biological makeup, resulting in increased accuracy and engagement and ultimately, increased revenue. Why are different customers redirected to the same landing pages of a site? This 'one-size-fits-all' approach is ineffective as it reduces the impact of advertising based on people's individuality. Each customer should be directed to a customized landing page, with content and pictures that match their biological makeup. This will expand user engagement with the company's site, while also enhancing advertising possibilities and revenues. In order to increase the CPM value of a company, the 1000 ads used would need to be as effective as possible. With SPS AD, advertising companies will now have access to customized data that shows the optimal ad for each user, thereby increasing the power of these ads. With optimized advertising, ad agencies, networks and exchanges can charge higher fees for CPM, while also increasing the CPM value for each company. Interestingly, research has shown that when ads have presenters, people or models in them, these ads are more effective and produce higher results. Now, imagine if we could identify exactly which presenters, people or models should be used in each ad in order to produce a higher CPC. This is exactly what Facetrom SPS AD does. As a result, your company will achieve a higher CPC rate, build a greater awareness to your brand, obtain more qualified leads and most importantly, achieve improved revenue. The approach in most companies today is to send similar and generalized emails to the company's customer base. In addition, the A/B testing system is often used, however, this method often causes companies to lose those potential clients who are more engaged to the A or B option and who are more likely to increase the CTR on these company emails. With SPS AD, the most appropriate content can be sent to each user based on their biological parameters. By finetuning company communications with their clients, businesses can achieve a higher call to action. The next generation of personalized advertisements will be on the Smart TV and Digital shows. Ads presented on this medium should not be created and then presented simply based on a user's behavior as this provides limited, subjective information that exists within an environment that has a lot of 'noise'. SPS AD is a powerful and effective tool that enables companies to quickly customize ads based on their user's favorite models or actors that appear on the Smart TV and Digital shows as well as in the company's branding campaigns. By presenting customized ads that match the user's biological makeup, your marketing quickly 'speaks' directly to each user, thereby enhancing their effectiveness. In the digital world today, most marketing is based on targeting the right audience at the right time. The question is, is this method the most effective? On the positive side, the marketing tactics used today are more successful than those used in the past as well as than those used on TV and print. On the down side, most advertising campaigns only achieve a CPC average of 2.7%. To top it off, even when a specific market is retargeted, these users are probably also being targeted by other advertisers within the same vertical. As a result, your ad campaigns are only reaching a small percentage of your target market. With SPS AD, retargeting your audience is streamlined based on the biological makeup of the users, enabling your company to achieve a far greater retargeting effectiveness. Over 75% of the decisions people make are based on their sight; what they see. Let's now shift into the digital world, that is inundated with information, and understand that the data that is collected about these online users is 'noisy' and is based on subjective parameters that can be changed within seconds. Using Facetrom SPS AD ensures that all data provided about users is objective and based solely on the user's facial features and biological makeup. SPS AD provides accurate user data that is based on how a user 'sees' the world and it then goes a step further by predicting how the user's brain transfers and analyzes the information they obtained from their sense of sight. In this way, over 75% of a user's decisions can be accurately predicted, simply based on their facial features. ​FACETROM SPS AD IS EVOLVING THE ADVERTISING LANDSCAPE BASED ON USER'S BIOLOGY TRY OUR DEMO CONTACT US ​FACETROM SPS AD IS EVOLVING THE ADVERTISING LANDSCAPE BASED ON USER'S BIOLOGY",
    "OUR STORY Decision making is a fundamental activity that everyone does, hundreds of times daily. However, many of the decisions we make are often inaccurate. This was proven in the research done by Prof. Barry Schwartz, in his study, \"Paradox of Choice\". The result is we all could be living better lives by modifying our decision making. Armed with this knowledge and research, the Facetrom team was driven to develop a technology that would give people and companies the ability to make better decisions, avoid costly mistakes and most importantly, enhance their lives. Facetrom was born to find that cure... The Facetrom team has a passionate motivation and unrelenting desire to understand why every person has a different appearance and how these differences affect a person's character, the decisions they make, their capabilities, talents, shortcomings and more. Based on this, we focused our attention on the correlation between biological and facial features and the decision-making process. The Facetrom team have extensive knowledge and experience in computer vision, image processing, machine learning, deep learning, AI, statistics, software engineering, psychology, evolutionary psychology, criminology, architecture, foundations of Chinese Medicine, management, economics and more. Today, Facetrom technology is being incorporated into various fields and sectors, such as human resources management, social networking, advertising and marketing, sports and many more. While we have been taught from a very young age that we should not \"judge a book by its cover\", Facetrom is disrupting this way of thinking and has successfully proven that our appearance is a critical component that enables us to make better decisions and to reach maximum achievements. We are merely scratching the surface of the potential of Facetrom technology, which evidently holds a key to unlocking the true potential of each person in the world. FACETROM IS A BREAKTHROUGH, CROSS-PLATFORM TECHNOLOGY THAT BUILDS A PERSON'S PROFILE FROM A SINGLE FACIAL IMAGE TRY OUR DEMO CONTACT US OUR TECHNOLOGY 90% of the brain is involved in collecting information from the sense of sight 50% of the human brain is programmed to dealing with sight 33% of the brain deals with facial recognition 75% of human decisions depend on the sight sense A BRIEF HISTORY OF FACIAL FEATURE STUDIES The concept of studying facial features and trying to correlate these with their personality and capabilities is something we as humans have been trying to do for thousands of years. Ancient Greek scientists and philosophers explored these concepts and Aristotle was one of them who compiled a volume of how your looks affect your personality. As time has gone by, there have been many studies relating to the topic and there is substantial statistical data to back up much of this. One of the more recent studies was performed by Carmen LeFevre at Northumbria University who started to show that our biology, including our genes and hormone levels, influence our growth and features, and in the same way, this affects our characters. On a daily basis, we all form impressions and opinions based on other people's looks; we try to decrypt who the person really is, what their character is, their abilities, who can be a great match for him and much more, but until now these assessments were completely subjective and were never accurate. Facetrom Super Personalized System (SPS) now takes assessment to a completely new level… HOW FACETROM TECHNOLOGY WORKS With a single photo of a person's face, Facetrom tracks 69 key facial parameter landmarks and distinguishes more than 200 biological features including factors like hormones, immune system and more. This data is then subjected to 6,500 inequalities that compare the subjects' features against a database of historical data that allows the features to be matched on a biological level. The use of Facetrom predictions based on facial features is truly limitless… The entire process takes place in a mere 0.39 seconds, approximately the same amount of time it takes the human brain to process seeing an object. The result of all of this is the ability to build a detailed profile of a person with 89% accuracy. To back up the numbers and the data, Facetrom SPS was tested across 7 different academic institutions with more than 150,000 test subjects , which yielded an accuracy rate of 90.20%. HOW TO USE FACETROM SPS The process of using Facetrom SPS is simple and we offer various ways to work with our technology: ​ ​​ MANUAL UPLOAD Upload facial photographs manually via our website AUTOMATED Easily embed Facetrom into your site or applications CLOUD SaaS Connect your database via the cloud and get results in real time Decision making is a fundamental activity that everyone does, hundreds of times daily. However, many of the decisions we make are often inaccurate. This was proven in the research done by Prof. Barry Schwartz, in his study, \"Paradox of Choice\". The result is we all could be living better lives by modifying our decision making. Armed with this knowledge and research, the Facetrom team was driven to develop a technology that would give people and companies the ability to make better decisions, avoid costly mistakes and most importantly, enhance their lives. Facetrom was born to find that cure... The Facetrom team has a passionate motivation and unrelenting desire to understand why every person has a different appearance and how these differences affect a person's character, the decisions they make, their capabilities, talents, shortcomings and more. Based on this, we focused our attention on the correlation between biological and facial features and the decision-making process. The Facetrom team have extensive knowledge and experience in computer vision, image processing, machine learning, deep learning, AI, statistics, software engineering, psychology, evolutionary psychology, criminology, architecture, foundations of Chinese Medicine, management, economics and more. Today, Facetrom technology is being incorporated into various fields and sectors, such as human resources management, social networking, advertising and marketing, sports and many more. While we have been taught from a very young age that we should not \"judge a book by its cover\", Facetrom is disrupting this way of thinking and has successfully proven that our appearance is a critical component that enables us to make better decisions and to reach maximum achievements. We are merely scratching the surface of the potential of Facetrom technology, which evidently holds a key to unlocking the true potential of each person in the world. FACETROM IS A BREAKTHROUGH, CROSS-PLATFORM TECHNOLOGY THAT BUILDS A PERSON'S PROFILE FROM A SINGLE FACIAL IMAGE TRY OUR DEMO CONTACT US FACETROM IS A BREAKTHROUGH, CROSS-PLATFORM TECHNOLOGY THAT BUILDS A PERSON'S PROFILE FROM A SINGLE FACIAL IMAGE of the brain is involved in collecting information from the sense of sight of the human brain is programmed to dealing of the brain deals with of human decisions depend on the sight sense A BRIEF HISTORY OF FACIAL FEATURE STUDIES The concept of studying facial features and trying to correlate these with their personality and capabilities is something we as humans have been trying to do for thousands of years. Ancient Greek scientists and philosophers explored these concepts and Aristotle was one of them who compiled a volume of how your looks affect your personality. As time has gone by, there have been many studies relating to the topic and there is substantial statistical data to back up much of this. One of the more recent studies was performed by Carmen LeFevre at Northumbria University who started to show that our biology, including our genes and hormone levels, influence our growth and features, and in the same way, this affects our characters. On a daily basis, we all form impressions and opinions based on other people's looks; we try to decrypt who the person really is, what their character is, their abilities, who can be a great match for him and much more, but until now these assessments were completely subjective and were never accurate. Facetrom Super Personalized System (SPS) now takes assessment to a completely new level… HOW FACETROM TECHNOLOGY WORKS With a single photo of a person's face, Facetrom tracks 69 key facial parameter landmarks and distinguishes more than 200 biological features including factors like hormones, immune system and more. This data is then subjected to 6,500 inequalities that compare the subjects' features against a database of historical data that allows the features to be matched on a biological level. The use of Facetrom predictions based on facial features is truly limitless… The entire process takes place in a mere 0.39 seconds, approximately the same amount of time it takes the human brain to process seeing an object. The result of all of this is the ability to build a detailed profile of a person with 89% accuracy. To back up the numbers and the data, Facetrom SPS was tested across 7 different academic institutions with more than 150,000 test subjects , which yielded an accuracy rate of 90.20%. HOW TO USE FACETROM SPS The process of using Facetrom SPS is simple and we offer various ways to work with our technology: manually via our website into your site or applications Connect your database via the cloud and get results in real time",
    "Democratize credit, We help ~2B unbanked people move forward and promote their lives 1. ~ 85% of the unbanked and underbanked will be rejected by finance & insurance companies. Facetrom increases the number of trustworthy customers by more than 2.5 times 2. ~5% of the approved customers turn out to be non-paying subscribers (defaults or fraudsters). Facetrom decreases the number of fraudsters out of approved customers by more than 20%. Our charter is to bank the unbanked About two billion adults in the world are unbanked or underbanked, i.e., they have no credit history or very limited bank account. This huge population practically cannot get any financial or insurance services from formal channels. The main alternative for these people to promote their lives, acquire education for their children, purchase health services, etc., is to borrow loans from non-formal channels (P2P, NBFCs, NBFIs, etc.). Eighty-seven percent of current loans in emerging countries are received from such channels. Nevertheless, out of the only ~15% of loan requests confirmed, ~5% turn out to be defaults or fraudsters (i.e., non-paying subscribers). The unbanked market has been noticed by many experts as 'the next trillion-dollar opportunity in fintech'. ​ Facetrom has developed a pioneering technology that predicts the financial risk of a potential customer requesting a loan, out of a single black and white image. The company's vision is to help unbanked and underbanked people achieve loans and insurance, while assisting the financial institutes to largely decrease the rate of non-paying subscribers. Facetrom disregards all discriminating factors such as race, gender, age, demography, hair color, skin texture, tattoo, scar and more. All images analyzed by Facetrom are totally anonymous, and data privacy of the subject is strictly maintained. Facetrom creates an equal opportunity for all the people in the world. About us About us For many years, Facetrom has been exploring the correlation between biological characteristics, on one hand, and facial morphology and personality traits, on the other hand. The Facetrom team has a passionate motivation and unrelenting desire to understand why every person has a different appearance and how these differences affect a person's character, the decisions taken, the capabilities, talents, shortcomings and more. We focused our attention on implementing a novel technology that turns the insights revealed in one's face into business values. Facetrom has acquired extensive knowledge and experience in computer vision, image processing, machine learning, deep learning, AI, statistics, software engineering, evolutionary psychology, management, and more . While we have been taught from a very young age that we should not \"judge a book by its cover\", Facetrom is disrupting this paradigm; thus far, we have successfully proven that our appearance is a critical component, allowing us to make better and more accurate decisions. No doubt, we are merely scratching the surface of the enormous markets and use cases, of which Facetrom technology may unlock the true potential of each individual in the world. \"We cannot solve our problems with the same thinking we used when we created them\" Albert Einstein Who we are Today discrimination Large groups in the population are often discriminated by financial and insurance institutes (just a few widely known examples) \"Blacks pay for auto insurance premiums an average of 70% more than similar white drivers, regardless of driving history, population density, and income\" \" 67% of companies charged at least 10% more in ZIP codes where more people of color live\" \"Single drivers who had merely good scores paid $68 to $526 more per year than similar drivers with the best scores, depending on the state they called home\" \"Drivers without a college degree pay at least 10% higher car insurance rates than college degree holders\" \"Driver under the age of 25 and over 70 pay higher rates than drivers in other age groups, with teens paying the most\" \"Blue-collar and lower-paying jobs get quoted higher car insurance premiums than higher-paying jobs\" Facetrom is changing the paradigm From active to passive data collection Current technologies - Subjective Severe invasion of privacy, data is collected from up to 10K data sources Internet browsing behavior Smartphone touch behavior Geolocation Questioners Comments Shares Posts Likes Facetrom's technology - Objective data Objected data, collected from a SINGLE data source The future Biometrics We discovered that the intercorrelations of predicted factors tend to be stronger than the intercorrelations of self-report questionnaire scales used to train the model This finding suggests a potential biological basis of GFP Our technology Our tchnology Facetrom provides financial & insurance institutes, with valuable insights about trustworthy (low-risk) customers. ​ Facetrom offers a novel analytical technology that can open banking opportunities and financial services to the greater population, while simultaneously protecting financial and insurance companies from fraudulent risk. Facetrom's pioneering technology predicts a user risk, based upon biological indicators extracted from a single two-dimensional black and white image of the subscriber. The accuracy of prediction, of both safe and default customers, is much higher than that achieved by other tools. ​ Moreover, Facetrom technology has \"zero\" friction with the user. No personal data whatsoever (questionnaire, interview, home visit nor permission to observe user activity within the smartphone) is required within the KYC process; just a single facial image. ​ ​ Facetrom's innovative technology uses more than 65 landmarks in order to extract 275+ anatomically-oriented indicators using thousands of equations. Facetrom increases revenue by ~11% per user Case study Case study Added Business Values (for any given number of unbanked/underbanked people) ~X3.5 ~X8 ~80% THE PROOF IS IN THE TESTING, ACTUALLY, IT'S HIDDEN IN THE FACE Facetrom technology offers a wealth of solutions in a variety of industries and fields. The power of information that can be extracted from a facial image of a person is undeniable, and it has helped enormous people and companies globally make the right decisions, when it really mattered. ​ To date, institutes that use Facetrom see a vast increase in their business value, revenue, engagement, traction and retention. With accurate decision-making, institutes have been able to achieve their goals and increase their revenues with ease. about some of the success stories of Facetrom, and how a single facial image contains a wealth of knowledge that can now be transformed into powerful insights. Prediction of ~85% of the fraudsters Up Democratize credit, We help ~2B unbanked people move forward and promote their lives 1. ~ 85% of the unbanked and underbanked will be rejected by finance & insurance companies. Facetrom increases the number of trustworthy customers by more than 2.5 times 2. ~5% of the approved customers turn out to be non-paying subscribers (defaults or fraudsters). Facetrom decreases the number of fraudsters out of approved customers by more than 20%. Democratize credit, We help ~2B unbanked people move forward and promote their lives ~ 85% of the unbanked and underbanked will be rejected by finance & insurance companies. Facetrom increases the number of trustworthy customers by more than 2.5 times ~5% of the approved customers turn out to be non-paying subscribers (defaults or fraudsters). Facetrom decreases the number of fraudsters out of approved customers by more than 20%. Our charter is to bank the unbanked About two billion adults in the world are unbanked or underbanked, i.e., they have no credit history or very limited bank account. This huge population practically cannot get any financial or insurance services from formal channels. The main alternative for these people to promote their lives, acquire education for their children, purchase health services, etc., is to borrow loans from non-formal channels (P2P, NBFCs, NBFIs, etc.). Eighty-seven percent of current loans in emerging countries are received from such channels. Nevertheless, out of the only ~15% of loan requests confirmed, ~5% turn out to be defaults or fraudsters (i.e., non-paying subscribers). The unbanked market has been noticed by many experts as 'the next trillion-dollar opportunity in fintech'. ​ Facetrom has developed a pioneering technology that predicts the financial risk of a potential customer requesting a loan, out of a single black and white image. The company's vision is to help unbanked and underbanked people achieve loans and insurance, while assisting the financial institutes to largely decrease the rate of non-paying subscribers. Facetrom disregards all discriminating factors such as race, gender, age, demography, hair color, skin texture, tattoo, scar and more. All images analyzed by Facetrom are totally anonymous, and data privacy of the subject is strictly maintained. Our charter is to bank the unbanked About two billion adults in the world are unbanked or underbanked, i.e., they have no credit history or very limited bank account. This huge population practically cannot get any financial or insurance services from formal channels. The main alternative for these people to promote their lives, acquire education for their children, purchase health services, etc., is to borrow loans from non-formal channels (P2P, NBFCs, NBFIs, etc.). Eighty-seven percent of current loans in emerging countries are received from such channels. Nevertheless, out of the only ~15% of loan requests confirmed, ~5% turn out to be defaults or fraudsters (i.e., non-paying subscribers). The unbanked market has been noticed by many experts as 'the next trillion-dollar opportunity in fintech'. Facetrom has developed a pioneering technology that predicts the financial risk of a potential customer requesting a loan, out of a single black and white image. The company's vision is to help unbanked and underbanked people achieve loans and insurance, while assisting the financial institutes to largely decrease the rate of non-paying subscribers. Facetrom disregards all discriminating factors such as race, gender, age, demography, hair color, skin texture, tattoo, scar and more. All images analyzed by Facetrom are totally anonymous, and data privacy of the subject is strictly maintained. Facetrom creates an equal opportunity for all the people in the world. Facetrom creates an equal opportunity for all the people in the world. About us About us For many years, Facetrom has been exploring the correlation between biological characteristics, on one hand, and facial morphology and personality traits, on the other hand. The Facetrom team has a passionate motivation and unrelenting desire to understand why every person has a different appearance and how these differences affect a person's character, the decisions taken, the capabilities, talents, shortcomings and more. We focused our attention on implementing a novel technology that turns the insights revealed in one's face into business values. Facetrom has acquired extensive knowledge and experience in computer vision, image processing, machine learning, deep learning, AI, statistics, software engineering, evolutionary psychology, management, and more . While we have been taught from a very young age that we should not \"judge a book by its cover\", Facetrom is disrupting this paradigm; thus far, we have successfully proven that our appearance is a critical component, allowing us to make better and more accurate decisions. No doubt, we are merely scratching the surface of the enormous markets and use cases, of which Facetrom technology may unlock the true potential of each individual in the world. \"We cannot solve our problems with the same thinking we used when we created them\" Albert Einstein Who we are For many years, Facetrom has been exploring the correlation between biological characteristics, on one hand, and facial morphology and personality traits, on the other hand. The Facetrom team has a passionate motivation and unrelenting desire to understand why every person has a different appearance and how these differences affect a person's character, the decisions taken, the capabilities, talents, shortcomings and more. We focused our attention on implementing a novel technology that turns the insights revealed in one's face into business values. Facetrom has acquired extensive knowledge and experience in computer vision, image processing, machine learning, deep learning, AI, statistics, software engineering, evolutionary psychology, management, and more . While we have been taught from a very young age that we should not \"judge a book by its cover\", Facetrom is disrupting this paradigm; thus far, we have successfully proven that our appearance is a critical component, allowing us to make better and more accurate decisions. No doubt, we are merely scratching the surface of the enormous markets and use cases, of which Facetrom technology may unlock the true potential of each individual in the world. \"We cannot solve our problems with the same thinking we used when we created them\" Albert Einstein Today discrimination Large groups in the population are often discriminated by financial and insurance institutes (just a few widely known examples) \"Blacks pay for auto insurance premiums an average of 70% more than similar white drivers, regardless of driving history, population density, and income\" \" 67% of companies charged at least 10% more in ZIP codes where more people of color live\" \"Single drivers who had merely good scores paid $68 to $526 more per year than similar drivers with the best scores, depending on the state they called home\" \"Drivers without a college degree pay at least 10% higher car insurance rates than college degree holders\" \"Driver under the age of 25 and over 70 pay higher rates than drivers in other age groups, with teens paying the most\" \"Blue-collar and lower-paying jobs get quoted higher car insurance premiums than higher-paying jobs\" Large groups in the population are often discriminated by financial and insurance institutes (just a few widely known examples) \"Blacks pay for auto insurance premiums an average of 70% more than similar white drivers, regardless of driving history, population density, and income\" \" 67% of companies charged at least 10% more in ZIP codes where more people of color live\" \"Single drivers who had merely good scores paid $68 to $526 more per year than similar drivers with the best scores, depending on the state they called home\" \"Drivers without a college degree pay at least 10% higher car insurance rates than college degree holders\" \"Driver under the age of 25 and over 70 pay higher rates than drivers in other age groups, with teens paying the most\" \"Blue-collar and lower-paying jobs get quoted higher car insurance premiums than higher-paying jobs\" Facetrom is changing the paradigm From active to passive data collection Current technologies - Subjective Severe invasion of privacy, data is collected from up to 10K data sources Internet browsing behavior Smartphone touch behavior Geolocation Questioners Comments Shares Posts Likes Facetrom's technology - Objective data Objected data, collected from a SINGLE data source The future Biometrics We discovered that the intercorrelations of predicted factors tend to be stronger than the intercorrelations of self-report questionnaire scales used to train the model This finding suggests a potential biological basis of GFP Facetrom is changing the paradigm From active to passive data collection Current technologies - Subjective Severe invasion of privacy, data is collected from up to 10K data sources Facetrom's technology - Objective data Objected data, collected from a SINGLE data source We discovered that the intercorrelations of predicted factors tend to be stronger than the intercorrelations of self-report questionnaire scales used to train the model This finding suggests a potential biological basis of GFP Our technology Our tchnology Facetrom provides financial & insurance institutes, with valuable insights about trustworthy (low-risk) customers. ​ Facetrom offers a novel analytical technology that can open banking opportunities and financial services to the greater population, while simultaneously protecting financial and insurance companies from fraudulent risk. Facetrom's pioneering technology predicts a user risk, based upon biological indicators extracted from a single two-dimensional black and white image of the subscriber. The accuracy of prediction, of both safe and default customers, is much higher than that achieved by other tools. ​ Moreover, Facetrom technology has \"zero\" friction with the user. No personal data whatsoever (questionnaire, interview, home visit nor permission to observe user activity within the smartphone) is required within the KYC process; just a single facial image. ​ ​ Facetrom's innovative technology uses more than 65 landmarks in order to extract 275+ anatomically-oriented indicators using thousands of equations. Facetrom increases revenue by ~11% per user Facetrom provides financial & insurance institutes, with valuable insights about trustworthy (low-risk) customers. Facetrom offers a novel analytical technology that can open banking opportunities and financial services to the greater population, while simultaneously protecting financial and insurance companies from fraudulent risk. Facetrom's pioneering technology predicts a user risk, based upon biological indicators extracted from a single two-dimensional black and white image of the subscriber. The accuracy of prediction, of both safe and default customers, is much higher than that achieved by other tools. Moreover, Facetrom technology has \"zero\" friction with the user. No personal data whatsoever (questionnaire, interview, home visit nor permission to observe user activity within the smartphone) is required within the KYC process; just a single facial image. ​ Facetrom's innovative technology uses more than 65 landmarks in order to extract 275+ anatomically-oriented indicators using thousands of equations. Facetrom increases revenue by ~11% per user Case study Case study Added Business Values (for any given number of unbanked/underbanked people) ~X3.5 ~X8 ~80% THE PROOF IS IN THE TESTING, ACTUALLY, IT'S HIDDEN IN THE FACE Facetrom technology offers a wealth of solutions in a variety of industries and fields. The power of information that can be extracted from a facial image of a person is undeniable, and it has helped enormous people and companies globally make the right decisions, when it really mattered. ​ To date, institutes that use Facetrom see a vast increase in their business value, revenue, engagement, traction and retention. With accurate decision-making, institutes have been able to achieve their goals and increase their revenues with ease. about some of the success stories of Facetrom, and how a single facial image contains a wealth of knowledge that can now be transformed into powerful insights. (for any given number of unbanked/underbanked people) THE PROOF IS IN THE TESTING, ACTUALLY, IT'S HIDDEN IN THE FACE Facetrom technology offers a wealth of solutions in a variety of industries and fields. The power of information that can be extracted from a facial image of a person is undeniable, and it has helped enormous people and companies globally make the right decisions, when it really mattered. To date, institutes that use Facetrom see a vast increase in their business value, revenue, engagement, traction and retention. With accurate decision-making, institutes have been able to achieve their goals and increase their revenues with ease. about some of the success stories of Facetrom, and how a single facial image contains a wealth of knowledge that can now be transformed into powerful insights. Prediction of ~85% of the fraudsters Up Prediction of ~85% of the fraudsters",
    "One of the greatest assets of a company is their human capital: Facetrom HR - Matches candidates and builds optimal teams based on human biology. No company can succeed without human talent. One of the key challenges for human resources is finding the right people for the job. A resume and interview can tell you only a part of the candidate's abilities. Candidates always put their best foot forward and often give the answers that they think HR wants to hear. Annually, companies lose billions of dollars by hiring the wrong people, but the cost is even greater than the dollars spent; the impact can be projects fail, client loss, reputation and brand damage, and time that can never be recovered. THE IMPACT OF BAD HR: Up to 30% of staff lack the abilities and communication skills for the job On average, the direct cost to a company is equal to 30% of the individual's first year's potential earnings 18% of incorrect HR hiring negatively impacts client relationships and results in a decrease in sales Often, the urgency to replace incorrect staff results in hiring more incorrect people and the cycle continues Average cost to a company in replacing a bad employee is around $25,000 Now, with Facetrom SPS HR, human resources personnel can validate and predict, with far greater accuracy, whether a candidate has the abilities, skills and even their suitability for the company teams. HUMAN RESOURCES BUILD THE OPTIMAL TEAM Building a productive and efficient team is challenging; with Facetrom it becomes easy and far more effective. When building a team, you want to be sure that the entire team is capable of interacting and suited to working together. ​ Now, with Facetrom, you can analyze each team member, predict any potential problems and advantages beforehand, to build a winning team. IDENTIFY MANAGEMENT CAPABILITIES Every person has different abilities and management capabilities. For any team to thrive, this requires a strong manager or team leader. SPS HR gives you the necessary insights to establish who is the optimal manager. CHOOSE THE RIGHT INTERVIEWER The interaction between interviewer and candidate is crucial and having the wrong interviewer, can result in the company losing out on potentially the best employees. SPS HR helps to ensure a better match and interaction between interviewer and candidate, with far more objectivity. Avoid losing your next star employee! EVALUATE A CANDIDATE'S FIT FOR YOUR COMPANY & TEAM You may have the ideal candidate, with all the right credentials, management qualities and more but if they don't fit the culture of the company, or will clash with existing staff, they simply won't cut it. SPS HR allows you to evaluate how well the candidate will fit the company's C level, team leaders, and teams' members on multiple levels. USE THE RIGHT CONSULTANTS AND FREELANCERS RESULT: 46% CTR INCREASE It has become common practice today for companies to use outside consultants or freelancers to perform projects that don't require full-time employees. There isn't always the time to evaluate these 3rd parties to the extent of a candidate being hired as a full-time employee. Now you can choose a 3rd party service provider quicker and with far greater accuracy to fit your business requirements. TRY OUR DEMO CONTACT US TRY OUR DEMO CONTACT US THE POTENTIAL OF FACETROM SPS HR IS UNLIMITED TRY OUR DEMO CONTACT US One of the greatest assets of a company is their human capital: Facetrom HR - Matches candidates and builds optimal teams based on human biology. One of the greatest assets of a company is their human capital: Facetrom HR - Matches candidates and builds optimal teams based on human biology. No company can succeed without human talent. One of the key challenges for human resources is finding the right people for the job. A resume and interview can tell you only a part of the candidate's abilities. Candidates always put their best foot forward and often give the answers that they think HR wants to hear. Annually, companies lose billions of dollars by hiring the wrong people, but the cost is even greater than the dollars spent; the impact can be projects fail, client loss, reputation and brand damage, and time that can never be recovered. THE IMPACT OF BAD HR: Up to 30% of staff lack the abilities and communication skills for the job Up to 30% of staff lack the abilities and communication skills for the job On average, the direct cost to a company is equal to 30% of the individual's first year's potential earnings On average, the direct cost to a company is equal to 30% of the individual's first year's potential earnings 18% of incorrect HR hiring negatively impacts client relationships and results in a decrease in sales 18% of incorrect HR hiring negatively impacts client relationships and results in a decrease in sales Often, the urgency to replace incorrect staff results in hiring more incorrect people and the cycle continues Often, the urgency to replace incorrect staff results in hiring more incorrect people and the cycle continues Average cost to a company in replacing a bad employee is around $25,000 Average cost to a company in replacing a bad employee is around $25,000 Now, with Facetrom SPS HR, human resources personnel can validate and predict, with far greater accuracy, whether a candidate has the abilities, skills and even their suitability for the company teams. Building a productive and efficient team is challenging; with Facetrom it becomes easy and far more effective. When building a team, you want to be sure that the entire team is capable of interacting and suited to working together. Now, with Facetrom, you can analyze each team member, predict any potential problems and advantages beforehand, to build a winning team. Every person has different abilities and management capabilities. For any team to thrive, this requires a strong manager or team leader. SPS HR gives you the necessary insights to establish who is the optimal manager. The interaction between interviewer and candidate is crucial and having the wrong interviewer, can result in the company losing out on potentially the best employees. SPS HR helps to ensure a better match and interaction between interviewer and candidate, with far more objectivity. Avoid losing your next star employee! You may have the ideal candidate, with all the right credentials, management qualities and more but if they don't fit the culture of the company, or will clash with existing staff, they simply won't cut it. SPS HR allows you to evaluate how well the candidate will fit the company's C level, team leaders, and teams' members on multiple levels. It has become common practice today for companies to use outside consultants or freelancers to perform projects that don't require full-time employees. There isn't always the time to evaluate these 3rd parties to the extent of a candidate being hired as a full-time employee. Now you can choose a 3rd party service provider quicker and with far greater accuracy to fit your business requirements. THE POTENTIAL OF FACETROM SPS HR IS UNLIMITED TRY OUR DEMO CONTACT US THE POTENTIAL OF FACETROM SPS HR IS UNLIMITED",
    "Facetrom Ltd. (the \"Company\", \"We\" or \"Us\") provides financial services to customers and partners (the \"Clients\" or \"Data Controllers\") as a Business-to-Business (\"B2B\" or \"Data Processor\") entity. We recognize the importance of maintaining the confidentiality, integrity, and security of Personal Information (\"PI\") and Sensitive Personal Data or Information (\"SPDI\") of natural persons (\"Data Subjects\" or \"Users\"), whose data is being received from the Data Controllers. We are committed to protecting the privacy and confidentiality of PI and SPDI we store and process. This outlines how we collect, process and protect PI and SPDI in our capacity. Personal Information We DO NOT collect, store nor process PI. ​ Data collection and processing scope as a B2B Data Processor We DO NOT collect SPDI directly from Users. We store and process SPDI on behalf of our Clients only, in accordance with their instructions or our privacy procedures in case our Clients provide no specific instructions. ​ The types of SPDI we may store and process include: - A facial image of an anonymous User. - Financial transaction-related data: loan id, loan created date, loan amount, loan currency, loan interest rate, loan number of installments, and other information related to financial transactions. - User-related data: User gender, User age, User account id, and other non-personal- information related to the User. ​ We store and process SPDI for the following purposes: - Provide B2B financial services, or other lawful purposes defined in contractual agreements with our Clients. - Research, develop, train, validate, improve, optimize, tune and certify our B2B services. - Communicate with our Clients and potential Clients regarding inquiries, quality checks of their SPDI, proof of concept, updates, and administrative matters. ​ Data accuracy and User rights We wish to maintain our SPDI as accurately as possible. Since we cannot identify any of the Users our services store and process, we act only on behalf of the Data Controllers regarding SPI accuracy and Users' rights. If you are a User and wish to exercise your rights, please contact the relevant Data Controller. We will assist our Data Controllers in responding to your request in accordance with contractual agreements and applicable laws and regulations. If you are a Data Controller and wish to make changes in the SPDI provided earlier, please contact our DPPO in the email address listed below. ​ ​ Data retention We retain SPDI in accordance with our Data Controllers' instructions or applicable laws and regulations and for the duration determined by our contractual agreements. We do not retain SPDI longer than necessary by our Clients and/or by our business goals and requirements. ​ ​ Data sharing and disclosure We do not share, transfer, sell, rent, or lease SPDI to any third party, including not with a third-party service provider, unless explicit written consent is granted by the Data Controller or as required by law. If data is shared with any third party, we will set agreements in place, requiring such a third party to ensure data protection and confidentiality of SPDI, as instructed by the Data Controller or by us. ​ ​ Data security We implement industry-grade measures to protect SPDI against unauthorized access, loss, alteration, or destruction. We strive to maintain the confidentiality, integrity, and availability of the SPDI we store and process. We regularly review and enhance our security practices to ensure SPDI protection. ​ ​ Risk management We established a privacy risk management methodology, which evaluates the risks and manages them regularly, to ensure they are kept at an acceptable level at any time. In case we encounter a high-level risk or detection of a privacy incident, we will establish and manage a mitigation plan and provide a report to the Data Controllers, as applicable. ​ Staff competency We train our employees who handle SPDI and continuously keep them aware of our and the relevant privacy procedures. We communicate our to all stakeholders in the Company. ​ ​ International data transfers As a global B2B service provider, we may transfer and/or process SPDI outside the jurisdiction of the Data Controller, given that local privacy laws and regulations and contractual agreements permit doing so. In such cases, we will take appropriate measures to ensure that such international transfers comply with applicable data privacy laws and regulations, including the use of standard contractual clauses or relying on other lawful transfer mechanisms. ​ ​ Changes in our We monitor and review our data privacy compliance, our and our privacy procedures on a yearly basis, to ensure they are updated based on changing privacy regulations and new/modified contractual agreements. We may update this from time to time to reflect changes in our practices or legal obligations. We encourage you to review this periodically. ​ ​ Contact us If you have any questions, concerns, or inquiries regarding this , please contact Ronen Zagron, our data protection and privacy officer (who also serves as a grievance officer), at DPPO@facetrom.com . By engaging with our services or providing SPDI to us, you acknowledge that you have read and understood this and agree to the collection, processing, and disclosure of SPDI as described herein. Facetrom Ltd. Appendix A - glossary of Data Controller - any organization that determines the means and purposes of processing the personal information. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.3 and GDPR Art. 4 (7)] Data Processor - any organization that processes PI on behalf of and in accordance with the instructions of a Data Controller. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.5 and GDPR Art. 4 (8)] Data Subject - any natural person to whom the personal information relates. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.6 and GDPR Art. 4 (1)] Non-personal Information - any information that is not personal information (as per personal information defined below) or any information that is freely available or accessible in public domain [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.8] Personal Information (\"PI\") - any information that (a) can be used to identify the Individual to whom such information relates to, or (b) is or might be directly or indirectly linked to an Individual. Examples: telephone number, date of birth, email ID, address, metadata such as telephone call logs or weblogs, identification numbers such as Aadhaar, PAN and Social Security Number. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.14 and GDPR Art. 4 (1)] Sensitive Personal Data and Information (\"SPDI\") or Sensitive Personal Information (\"SPI\") - a special category of personal information, whose nature is either sensitive, such as those that relate to the individual's most intimate sphere, or that might have a significant impact on the individual. Examples: health records, biometrics, passwords, financial information, sexual orientation. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.22 and GDPR Art. 4 (13) (14) (15)] Facetrom Ltd. (the \"Company\", \"We\" or \"Us\") provides financial services to customers and partners (the \"Clients\" or \"Data Controllers\") as a Business-to-Business (\"B2B\" or \"Data Processor\") entity. We recognize the importance of maintaining the confidentiality, integrity, and security of Personal Information (\"PI\") and Sensitive Personal Data or Information (\"SPDI\") of natural persons (\"Data Subjects\" or \"Users\"), whose data is being received from the Data Controllers. We are committed to protecting the privacy and confidentiality of PI and SPDI we store and process. This outlines how we collect, process and protect PI and SPDI in our capacity. Personal Information We DO NOT collect, store nor process PI. ​ Data collection and processing scope as a B2B Data Processor We DO NOT collect SPDI directly from Users. We store and process SPDI on behalf of our Clients only, in accordance with their instructions or our privacy procedures in case our Clients provide no specific instructions. ​ The types of SPDI we may store and process include: - A facial image of an anonymous User. - Financial transaction-related data: loan id, loan created date, loan amount, loan currency, loan interest rate, loan number of installments, and other information related to financial transactions. - User-related data: User gender, User age, User account id, and other non-personal- information related to the User. ​ We store and process SPDI for the following purposes: - Provide B2B financial services, or other lawful purposes defined in contractual agreements with our Clients. - Research, develop, train, validate, improve, optimize, tune and certify our B2B services. - Communicate with our Clients and potential Clients regarding inquiries, quality checks of their SPDI, proof of concept, updates, and administrative matters. ​ Data accuracy and User rights We wish to maintain our SPDI as accurately as possible. Since we cannot identify any of the Users our services store and process, we act only on behalf of the Data Controllers regarding SPI accuracy and Users' rights. If you are a User and wish to exercise your rights, please contact the relevant Data Controller. We will assist our Data Controllers in responding to your request in accordance with contractual agreements and applicable laws and regulations. If you are a Data Controller and wish to make changes in the SPDI provided earlier, please contact our DPPO in the email address listed below. ​ ​ Data retention We retain SPDI in accordance with our Data Controllers' instructions or applicable laws and regulations and for the duration determined by our contractual agreements. We do not retain SPDI longer than necessary by our Clients and/or by our business goals and requirements. ​ ​ Data sharing and disclosure We do not share, transfer, sell, rent, or lease SPDI to any third party, including not with a third-party service provider, unless explicit written consent is granted by the Data Controller or as required by law. If data is shared with any third party, we will set agreements in place, requiring such a third party to ensure data protection and confidentiality of SPDI, as instructed by the Data Controller or by us. ​ ​ Data security We implement industry-grade measures to protect SPDI against unauthorized access, loss, alteration, or destruction. We strive to maintain the confidentiality, integrity, and availability of the SPDI we store and process. We regularly review and enhance our security practices to ensure SPDI protection. ​ ​ Risk management We established a privacy risk management methodology, which evaluates the risks and manages them regularly, to ensure they are kept at an acceptable level at any time. In case we encounter a high-level risk or detection of a privacy incident, we will establish and manage a mitigation plan and provide a report to the Data Controllers, as applicable. ​ Staff competency We train our employees who handle SPDI and continuously keep them aware of our and the relevant privacy procedures. We communicate our to all stakeholders in the Company. ​ ​ International data transfers As a global B2B service provider, we may transfer and/or process SPDI outside the jurisdiction of the Data Controller, given that local privacy laws and regulations and contractual agreements permit doing so. In such cases, we will take appropriate measures to ensure that such international transfers comply with applicable data privacy laws and regulations, including the use of standard contractual clauses or relying on other lawful transfer mechanisms. ​ ​ Changes in our We monitor and review our data privacy compliance, our and our privacy procedures on a yearly basis, to ensure they are updated based on changing privacy regulations and new/modified contractual agreements. We may update this from time to time to reflect changes in our practices or legal obligations. We encourage you to review this periodically. ​ ​ Contact us If you have any questions, concerns, or inquiries regarding this , please contact Ronen Zagron, our data protection and privacy officer (who also serves as a grievance officer), at DPPO@facetrom.com . By engaging with our services or providing SPDI to us, you acknowledge that you have read and understood this and agree to the collection, processing, and disclosure of SPDI as described herein. Facetrom Ltd. Appendix A - glossary of Data Controller - any organization that determines the means and purposes of processing the personal information. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.3 and GDPR Art. 4 (7)] Data Processor - any organization that processes PI on behalf of and in accordance with the instructions of a Data Controller. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.5 and GDPR Art. 4 (8)] Data Subject - any natural person to whom the personal information relates. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.6 and GDPR Art. 4 (1)] Non-personal Information - any information that is not personal information (as per personal information defined below) or any information that is freely available or accessible in public domain [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.8] Personal Information (\"PI\") - any information that (a) can be used to identify the Individual to whom such information relates to, or (b) is or might be directly or indirectly linked to an Individual. Examples: telephone number, date of birth, email ID, address, metadata such as telephone call logs or weblogs, identification numbers such as Aadhaar, PAN and Social Security Number. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.14 and GDPR Art. 4 (1)] Sensitive Personal Data and Information (\"SPDI\") or Sensitive Personal Information (\"SPI\") - a special category of personal information, whose nature is either sensitive, such as those that relate to the individual's most intimate sphere, or that might have a significant impact on the individual. Examples: health records, biometrics, passwords, financial information, sexual orientation. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.22 and GDPR Art. 4 (13) (14) (15)] Facetrom Ltd. (the \"Company\", \"We\" or \"Us\") provides financial services to customers and partners (the \"Clients\" or \"Data Controllers\") as a Business-to-Business (\"B2B\" or \"Data Processor\") entity. We recognize the importance of maintaining the confidentiality, integrity, and security of Personal Information (\"PI\") and Sensitive Personal Data or Information (\"SPDI\") of natural persons (\"Data Subjects\" or \"Users\"), whose data is being received from the Data Controllers. We are committed to protecting the privacy and confidentiality of PI and SPDI we store and process. This outlines how we collect, process and protect PI and SPDI in our capacity. Personal Information We DO NOT collect, store nor process PI. ​ Data collection and processing scope as a B2B Data Processor We DO NOT collect SPDI directly from Users. We store and process SPDI on behalf of our Clients only, in accordance with their instructions or our privacy procedures in case our Clients provide no specific instructions. ​ The types of SPDI we may store and process include: - A facial image of an anonymous User. - Financial transaction-related data: loan id, loan created date, loan amount, loan currency, loan interest rate, loan number of installments, and other information related to financial transactions. - User-related data: User gender, User age, User account id, and other non-personal- information related to the User. ​ We store and process SPDI for the following purposes: - Provide B2B financial services, or other lawful purposes defined in contractual agreements with our Clients. - Research, develop, train, validate, improve, optimize, tune and certify our B2B services. - Communicate with our Clients and potential Clients regarding inquiries, quality checks of their SPDI, proof of concept, updates, and administrative matters. ​ Data accuracy and User rights We wish to maintain our SPDI as accurately as possible. Since we cannot identify any of the Users our services store and process, we act only on behalf of the Data Controllers regarding SPI accuracy and Users' rights. If you are a User and wish to exercise your rights, please contact the relevant Data Controller. We will assist our Data Controllers in responding to your request in accordance with contractual agreements and applicable laws and regulations. If you are a Data Controller and wish to make changes in the SPDI provided earlier, please contact our DPPO in the email address listed below. ​ ​ Data retention We retain SPDI in accordance with our Data Controllers' instructions or applicable laws and regulations and for the duration determined by our contractual agreements. We do not retain SPDI longer than necessary by our Clients and/or by our business goals and requirements. ​ ​ Data sharing and disclosure We do not share, transfer, sell, rent, or lease SPDI to any third party, including not with a third-party service provider, unless explicit written consent is granted by the Data Controller or as required by law. If data is shared with any third party, we will set agreements in place, requiring such a third party to ensure data protection and confidentiality of SPDI, as instructed by the Data Controller or by us. ​ ​ Data security We implement industry-grade measures to protect SPDI against unauthorized access, loss, alteration, or destruction. We strive to maintain the confidentiality, integrity, and availability of the SPDI we store and process. We regularly review and enhance our security practices to ensure SPDI protection. ​ ​ Risk management We established a privacy risk management methodology, which evaluates the risks and manages them regularly, to ensure they are kept at an acceptable level at any time. In case we encounter a high-level risk or detection of a privacy incident, we will establish and manage a mitigation plan and provide a report to the Data Controllers, as applicable. ​ Staff competency We train our employees who handle SPDI and continuously keep them aware of our and the relevant privacy procedures. We communicate our to all stakeholders in the Company. ​ ​ International data transfers As a global B2B service provider, we may transfer and/or process SPDI outside the jurisdiction of the Data Controller, given that local privacy laws and regulations and contractual agreements permit doing so. In such cases, we will take appropriate measures to ensure that such international transfers comply with applicable data privacy laws and regulations, including the use of standard contractual clauses or relying on other lawful transfer mechanisms. ​ ​ Changes in our We monitor and review our data privacy compliance, our and our privacy procedures on a yearly basis, to ensure they are updated based on changing privacy regulations and new/modified contractual agreements. We may update this from time to time to reflect changes in our practices or legal obligations. We encourage you to review this periodically. ​ ​ Contact us If you have any questions, concerns, or inquiries regarding this , please contact Ronen Zagron, our data protection and privacy officer (who also serves as a grievance officer), at DPPO@facetrom.com . By engaging with our services or providing SPDI to us, you acknowledge that you have read and understood this and agree to the collection, processing, and disclosure of SPDI as described herein. Facetrom Ltd. Appendix A - glossary of Data Controller - any organization that determines the means and purposes of processing the personal information. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.3 and GDPR Art. 4 (7)] Data Processor - any organization that processes PI on behalf of and in accordance with the instructions of a Data Controller. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.5 and GDPR Art. 4 (8)] Data Subject - any natural person to whom the personal information relates. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.6 and GDPR Art. 4 (1)] Non-personal Information - any information that is not personal information (as per personal information defined below) or any information that is freely available or accessible in public domain [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.8] Personal Information (\"PI\") - any information that (a) can be used to identify the Individual to whom such information relates to, or (b) is or might be directly or indirectly linked to an Individual. Examples: telephone number, date of birth, email ID, address, metadata such as telephone call logs or weblogs, identification numbers such as Aadhaar, PAN and Social Security Number. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.14 and GDPR Art. 4 (1)] Sensitive Personal Data and Information (\"SPDI\") or Sensitive Personal Information (\"SPI\") - a special category of personal information, whose nature is either sensitive, such as those that relate to the individual's most intimate sphere, or that might have a significant impact on the individual. Examples: health records, biometrics, passwords, financial information, sexual orientation. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.22 and GDPR Art. 4 (13) (14) (15)] Facetrom Ltd. (the \"Company\", \"We\" or \"Us\") provides financial services to customers and partners (the \"Clients\" or \"Data Controllers\") as a Business-to-Business (\"B2B\" or \"Data Processor\") entity. We recognize the importance of maintaining the confidentiality, integrity, and security of Personal Information (\"PI\") and Sensitive Personal Data or Information (\"SPDI\") of natural persons (\"Data Subjects\" or \"Users\"), whose data is being received from the Data Controllers. We are committed to protecting the privacy and confidentiality of PI and SPDI we store and process. This outlines how we collect, process and protect PI and SPDI in our capacity. We DO NOT collect, store nor process PI. Data collection and processing scope as a B2B Data Processor Data collection and processing scope as a B2B Data Processor We DO NOT collect SPDI directly from Users. We store and process SPDI on behalf of our Clients only, in accordance with their instructions or our privacy procedures in case our Clients provide no specific instructions. The types of SPDI we may store and process include: - A facial image of an anonymous User. - Financial transaction-related data: loan id, loan created date, loan amount, loan currency, loan interest rate, loan number of installments, and other information related to financial transactions. - User-related data: User gender, User age, User account id, and other non-personal- information related to the User. We store and process SPDI for the following purposes: - Provide B2B financial services, or other lawful purposes defined in contractual agreements with our Clients. - Research, develop, train, validate, improve, optimize, tune and certify our B2B services. - Communicate with our Clients and potential Clients regarding inquiries, quality checks of their SPDI, proof of concept, updates, and administrative matters. Data accuracy and User rights Data accuracy and User rights We wish to maintain our SPDI as accurately as possible. Since we cannot identify any of the Users our services store and process, we act only on behalf of the Data Controllers regarding SPI accuracy and Users' rights. If you are a User and wish to exercise your rights, please contact the relevant Data Controller. We will assist our Data Controllers in responding to your request in accordance with contractual agreements and applicable laws and regulations. If you are a Data Controller and wish to make changes in the SPDI provided earlier, please contact our DPPO in the email address listed below. We retain SPDI in accordance with our Data Controllers' instructions or applicable laws and regulations and for the duration determined by our contractual agreements. We do not retain SPDI longer than necessary by our Clients and/or by our business goals and requirements. Data sharing and disclosure Data sharing and disclosure We do not share, transfer, sell, rent, or lease SPDI to any third party, including not with a third-party service provider, unless explicit written consent is granted by the Data Controller or as required by law. If data is shared with any third party, we will set agreements in place, requiring such a third party to ensure data protection and confidentiality of SPDI, as instructed by the Data Controller or by us. We implement industry-grade measures to protect SPDI against unauthorized access, loss, alteration, or destruction. We strive to maintain the confidentiality, integrity, and availability of the SPDI we store and process. We regularly review and enhance our security practices to ensure SPDI protection. We established a privacy risk management methodology, which evaluates the risks and manages them regularly, to ensure they are kept at an acceptable level at any time. In case we encounter a high-level risk or detection of a privacy incident, we will establish and manage a mitigation plan and provide a report to the Data Controllers, as applicable. We train our employees who handle SPDI and continuously keep them aware of our and the relevant privacy procedures. We communicate our to all stakeholders in the Company. As a global B2B service provider, we may transfer and/or process SPDI outside the jurisdiction of the Data Controller, given that local privacy laws and regulations and contractual agreements permit doing so. In such cases, we will take appropriate measures to ensure that such international transfers comply with applicable data privacy laws and regulations, including the use of standard contractual clauses or relying on other lawful transfer mechanisms. Changes in our Changes in our We monitor and review our data privacy compliance, our and our privacy procedures on a yearly basis, to ensure they are updated based on changing privacy regulations and new/modified contractual agreements. We may update this from time to time to reflect changes in our practices or legal obligations. We encourage you to review this periodically. If you have any questions, concerns, or inquiries regarding this , please contact Ronen Zagron, our data protection and privacy officer (who also serves as a grievance officer), at DPPO@facetrom.com . By engaging with our services or providing SPDI to us, you acknowledge that you have read and understood this and agree to the collection, processing, and disclosure of SPDI as described herein. Appendix A - glossary of Data Controller - any organization that determines the means and purposes of processing the personal information. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.3 and GDPR Art. 4 (7)] Data Controller - any organization that determines the means and purposes of processing the personal information. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.3 and GDPR Art. 4 (7)] Data Processor - any organization that processes PI on behalf of and in accordance with the instructions of a Data Controller. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.5 and GDPR Art. 4 (8)] Data Processor - any organization that processes PI on behalf of and in accordance with the instructions of a Data Controller. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.5 and GDPR Art. 4 (8)] Data Subject - any natural person to whom the personal information relates. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.6 and GDPR Art. 4 (1)] Data Subject - any natural person to whom the personal information relates. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.6 and GDPR Art. 4 (1)] Non-personal Information - any information that is not personal information (as per personal information defined below) or any information that is freely available or accessible in public domain [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.8] Non-personal Information - any information that is not personal information (as per personal information defined below) or any information that is freely available or accessible in public domain [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.8] Personal Information (\"PI\") - any information that (a) can be used to identify the Individual to whom such information relates to, or (b) is or might be directly or indirectly linked to an Individual. Examples: telephone number, date of birth, email ID, address, metadata such as telephone call logs or weblogs, identification numbers such as Aadhaar, PAN and Social Security Number. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.14 and GDPR Art. 4 (1)] Personal Information (\"PI\") - any information that (a) can be used to identify the Individual to whom such information relates to, or (b) is or might be directly or indirectly linked to an Individual. Examples: telephone number, date of birth, email ID, address, metadata such as telephone call logs or weblogs, identification numbers such as Aadhaar, PAN and Social Security Number. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.14 and GDPR Art. 4 (1)] Sensitive Personal Data and Information (\"SPDI\") or Sensitive Personal Information (\"SPI\") - a special category of personal information, whose nature is either sensitive, such as those that relate to the individual's most intimate sphere, or that might have a significant impact on the individual. Examples: health records, biometrics, passwords, financial information, sexual orientation. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.22 and GDPR Art. 4 (13) (14) (15)] Sensitive Personal Data and Information (\"SPDI\") or Sensitive Personal Information (\"SPI\") - a special category of personal information, whose nature is either sensitive, such as those that relate to the individual's most intimate sphere, or that might have a significant impact on the individual. Examples: health records, biometrics, passwords, financial information, sexual orientation. [Follows Bureau of Indian Standards, IS 17428 (part 1), Section 3.22 and GDPR Art. 4 (13) (14) (15)]"
  ]
}