{
  "company": "www.supercom.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 55,
    "-1": 17
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 17,
      "0": 55
    }
  },
  "sample_docs": [
    "Corporate Corporate Overview Our Vision Corporate Management Global Management Board of Directors Ethical Code Solutions Education Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Supply Chain Transportation & Logistics Homeland Security Case Studies Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Companion Wander Detection Solution Divisions SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record RFID PureRFâ\"¢ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record ∑ID Systems & Applications RFID PureRFâ\"¢ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program PureMonitor Offender Monitoring Software Domestic Violence Victim Protection Implementing an EM program Services Professional Services Support Tools Products PureRFâ\"¢ Readers PureRFâ\"¢ Tags IR Corporate Profile Corporate Governance The General Assembly Articles of Association Board of Directors Press Releases SEC Filing Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Contact CRO Corporate Governance The General Assembly Articles of Association Board of Directors Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Semi-annual - 2014 - XBRL Contact Us Career Israel USA SuperCom Ltd. Announces Proposed Public Offering of Ordinary Shares SuperCom Ltd. (NASDAQ: SPCB) (\"SuperCom\" or \"the Company\"), a provider of secure solutions for e-Government, Public Safety, HealtchCare, and Finance sectors, today announced that it intends to offer and sell, subject to market and other conditions, shares of its ordinary shares in an underwritten public offering. SuperCom also expects to grant the underwriters a 30-day option to purchase additional shares of its ordinary shares to cover overallotments, if any. Cowen and Company, LLC is acting as sole book-runner for the offering. The offering is subject to market and other conditions, and there can be no assurance as to whether or when the offering may be completed, or as to the actual size or of the offering. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement describing the of the offering will be filed with the SEC and will form a part of the effective registration statement. Copies of the preliminary prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. The final of the offering will be disclosed in a final prospectus supplement to be filed with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. Cowen and Company, LLC is acting as sole book-runner for the offering. The offering is subject to market and other conditions, and there can be no assurance as to whether or when the offering may be completed, or as to the actual size or of the offering. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement describing the of the offering will be filed with the SEC and will form a part of the effective registration statement. Copies of the preliminary prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. The final of the offering will be disclosed in a final prospectus supplement to be filed with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement describing the of the offering will be filed with the SEC and will form a part of the effective registration statement. Copies of the preliminary prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. The final of the offering will be disclosed in a final prospectus supplement to be filed with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement describing the of the offering will be filed with the SEC and will form a part of the effective registration statement. Copies of the preliminary prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. The final of the offering will be disclosed in a final prospectus supplement to be filed with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.",
    "GLOBAL LEADER IN SECURED DIGITAL SOLUTIONS CHINA ECUADOR ETHIOPIA HONG KONG ICELAND ISRAEL PANAMA POLAND TANZANIA UK USA ZANZIBAR AND MORE... WHO WE ARE We are a global secure solutions integrator and technology provider for governments and other consumers facing organizations around the world. We bring over 26 years of experience and a track record of successful end-to-end deployments in over 20 countries and 5 continents. FIND OUT WHAT S UPER C OM CAN DO FOR YOU GOVERNMENT State-of-the-art biometric identification and cyber security solutions to protect your nation HEALTHCARE Improve efficiency with real-time data on your patients and medical assets TRANSPORTATION Real-time location tracking of your valuable cargo and inventory in transport HOMELAND SECURITY Provide monitoring , tracking and rehabilitation programs for offenders to promote public safety RETAIL Comprehensive and robust mobile payment and POS solutions INVESTORS Stay up-to-date through transparent reporting and investor communications SUCCESS STORIES CONTACT US SuperCom Ltd. (×¡×•×¤×¨×§×•× ×'×¢\"מ) 20, Lincoln St., Tel Aviv 6713412, Israel Email: general@supercom.com Tel: +972.9.889.0880 ​ SuperCom Inc. 200 Park Avenue South, 9th Floor, NY, NY 10003 Email : general@supercom.com Tel : +212.675.4606 GLOBAL LEADER IN SECURED DIGITAL SOLUTIONS CHINA ECUADOR ETHIOPIA HONG KONG ICELAND ISRAEL PANAMA POLAND TANZANIA UK USA ZANZIBAR AND MORE... IN SECURED DIGITAL SOLUTIONS We are a global secure solutions integrator and technology provider for governments and other consumers facing organizations around the world. We bring over 26 years of experience and a track record of successful end-to-end deployments in over 20 countries and 5 continents. FIND OUT WHAT S UPER C OM CAN DO FOR YOU GOVERNMENT State-of-the-art biometric identification and cyber security solutions to protect your nation HEALTHCARE Improve efficiency with real-time data on your patients and medical assets TRANSPORTATION Real-time location tracking of your valuable cargo and inventory in transport HOMELAND SECURITY Provide monitoring , tracking and rehabilitation programs for offenders to promote public safety RETAIL Comprehensive and robust mobile payment and POS solutions INVESTORS Stay up-to-date through transparent reporting and investor communications FIND OUT WHAT S UPER C OM CAN DO FOR YOU State-of-the-art biometric identification and cyber security solutions to protect your nation Improve efficiency with real-time data on your patients and medical assets Real-time location tracking of your valuable cargo and inventory in transport Comprehensive and robust mobile payment and POS solutions CONTACT US SuperCom Ltd. (×¡×•×¤×¨×§×•× ×'×¢\"מ) 20, Lincoln St., Tel Aviv 6713412, Israel Email: general@supercom.com Tel: +972.9.889.0880 ​ SuperCom Inc. 200 Park Avenue South, 9th Floor, NY, NY 10003 Email : general@supercom.com Tel : +212.675.4606 20, Lincoln St., Tel Aviv 6713412, Israel Email: general@supercom.com Tel: +972.9.889.0880 200 Park Avenue South, 9th Floor, NY, NY 10003 Email : general@supercom.com Tel : +212.675.4606",
    "Corporate Corporate Overview Our Vision Corporate Management Global Management Board of Directors Ethical Code Solutions Education Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Supply Chain Transportation & Logistics Homeland Security Case Studies Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Companion Wander Detection Solution Divisions SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record RFID PureRFâ\"¢ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record ∑ID Systems & Applications RFID PureRFâ\"¢ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program PureMonitor Offender Monitoring Software Domestic Violence Victim Protection Implementing an EM program Services Professional Services Support Tools Products PureRFâ\"¢ Readers PureRFâ\"¢ Tags IR Corporate Profile Corporate Governance The General Assembly Articles of Association Board of Directors Press Releases SEC Filing Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Contact CRO Corporate Governance The General Assembly Articles of Association Board of Directors Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Semi-annual - 2014 - XBRL Contact Us Career Israel USA SuperCom to Expand Market Share with $7 Million in New Contracts SuperCom (NASDAQ: SPCB ), a leading provider of secure solutions for e-Government, Public Safety, HealthCare, and Finance sectors, announced today that it has been selected to implement new contracts representing more than $7 million in size. SuperCom will provide various core elements of its flexible electronic-ID solutions, with potential for additional follow-on orders in the future as is commonly realized with these types of solutions. SuperCom expects the majority of the revenue from the implementation of these contracts to be recognized within the next 2 quarters. Arie Trabelsi, President and CEO of SuperCom, commented, \"We believe that these new successes demonstrate SuperCom´s leadership in the e-ID segment and underscore our capabilities. These types of contracts represent the continuation of a mutually productive long-term relationship with our customers, and as the needs of our customers evolve, we expect additional orders in the future. We continue to see growth in demand for e-ID and M2M solutions globally.\" SuperCom will provide various core elements of its flexible electronic-ID solutions, with potential for additional follow-on orders in the future as is commonly realized with these types of solutions. SuperCom expects the majority of the revenue from the implementation of these contracts to be recognized within the next 2 quarters. Arie Trabelsi, President and CEO of SuperCom, commented, \"We believe that these new successes demonstrate SuperCom´s leadership in the e-ID segment and underscore our capabilities. These types of contracts represent the continuation of a mutually productive long-term relationship with our customers, and as the needs of our customers evolve, we expect additional orders in the future. We continue to see growth in demand for e-ID and M2M solutions globally.\" Arie Trabelsi, President and CEO of SuperCom, commented, \"We believe that these new successes demonstrate SuperCom´s leadership in the e-ID segment and underscore our capabilities. These types of contracts represent the continuation of a mutually productive long-term relationship with our customers, and as the needs of our customers evolve, we expect additional orders in the future. We continue to see growth in demand for e-ID and M2M solutions globally.\"",
    "Corporate Corporate Overview Our Vision Corporate Management Global Management Board of Directors Ethical Code Solutions Education Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Supply Chain Transportation & Logistics Homeland Security Case Studies Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Companion Wander Detection Solution Divisions SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record RFID PureRF™ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record ∑ID Systems & Applications RFID PureRF™ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program PureMonitor Offender Monitoring Software Domestic Violence Victim Protection Implementing an EM program Services Professional Services Support Tools Products PureRF™ Readers PureRF™ Tags IR Corporate Profile Corporate Governance The General Assembly Articles of Association Board of Directors Press Releases SEC Filing Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Contact CRO Corporate Governance The General Assembly Articles of Association Board of Directors Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Semi-annual - 2014 - XBRL Contact Us Career Israel USA SuperCom Wins Electronic Offender Monitoring Contract in a European Country HERZLIYA, Israel, July 6, 2015 /PRNewswire/ -- SuperCom ( SPCB ), a Global provider of secure solutions for e-Government, Public Safety, HealthCare, and Finance sectors announced today that its M2M division has signed a contract with a new European government to deploy a new Electronic Monitoring solution that aims to establish a more comprehensive and transparent Electronic Surveillance platform to effectively track and monitor hundreds of enrollees in the country´s new Probation Program. SuperCom expects to deploy this system in the next two months and continue to operate it for the next five years. SuperCom´s PureSecurity Suite is a best-of-breed electronic monitoring and tracking platform which introduces a long list of innovative features including secure communication, advanced security, anti-tamper mechanisms, voice communication, unique touch screens, fingerprint biometrics and extended battery life. \"We are excited with this new contract, another vote of confidence in our solutions to enhance public safety measured by reducing crime while reducing government cost, propelling us forward in the rapidly growing global Electronic Monitoring for public safety market projected to be in excess of $6 billion by 2018,\" commented Mr. Arie Trabelsi, President and CEO of SuperCom. \"Furthermore, we are happy bring on a new country and national government customer to SuperCom´s growing customer base, which we are looking forward to working with closely over the next years as we offer our rapidly growing array of innovate government solutions.\" SuperCom ( SPCB ), a Global provider of secure solutions for e-Government, Public Safety, HealthCare, and Finance sectors announced today that its M2M division has signed a contract with a new European government to deploy a new Electronic Monitoring solution that aims to establish a more comprehensive and transparent Electronic Surveillance platform to effectively track and monitor hundreds of enrollees in the country´s new Probation Program. SuperCom expects to deploy this system in the next two months and continue to operate it for the next five years. SuperCom´s PureSecurity Suite is a best-of-breed electronic monitoring and tracking platform which introduces a long list of innovative features including secure communication, advanced security, anti-tamper mechanisms, voice communication, unique touch screens, fingerprint biometrics and extended battery life. \"We are excited with this new contract, another vote of confidence in our solutions to enhance public safety measured by reducing crime while reducing government cost, propelling us forward in the rapidly growing global Electronic Monitoring for public safety market projected to be in excess of $6 billion by 2018,\" commented Mr. Arie Trabelsi, President and CEO of SuperCom. \"Furthermore, we are happy bring on a new country and national government customer to SuperCom´s growing customer base, which we are looking forward to working with closely over the next years as we offer our rapidly growing array of innovate government solutions.\" SuperCom expects to deploy this system in the next two months and continue to operate it for the next five years. SuperCom´s PureSecurity Suite is a best-of-breed electronic monitoring and tracking platform which introduces a long list of innovative features including secure communication, advanced security, anti-tamper mechanisms, voice communication, unique touch screens, fingerprint biometrics and extended battery life. \"We are excited with this new contract, another vote of confidence in our solutions to enhance public safety measured by reducing crime while reducing government cost, propelling us forward in the rapidly growing global Electronic Monitoring for public safety market projected to be in excess of $6 billion by 2018,\" commented Mr. Arie Trabelsi, President and CEO of SuperCom. \"Furthermore, we are happy bring on a new country and national government customer to SuperCom´s growing customer base, which we are looking forward to working with closely over the next years as we offer our rapidly growing array of innovate government solutions.\" SuperCom´s PureSecurity Suite is a best-of-breed electronic monitoring and tracking platform which introduces a long list of innovative features including secure communication, advanced security, anti-tamper mechanisms, voice communication, unique touch screens, fingerprint biometrics and extended battery life. \"We are excited with this new contract, another vote of confidence in our solutions to enhance public safety measured by reducing crime while reducing government cost, propelling us forward in the rapidly growing global Electronic Monitoring for public safety market projected to be in excess of $6 billion by 2018,\" commented Mr. Arie Trabelsi, President and CEO of SuperCom. \"Furthermore, we are happy bring on a new country and national government customer to SuperCom´s growing customer base, which we are looking forward to working with closely over the next years as we offer our rapidly growing array of innovate government solutions.\" \"We are excited with this new contract, another vote of confidence in our solutions to enhance public safety measured by reducing crime while reducing government cost, propelling us forward in the rapidly growing global Electronic Monitoring for public safety market projected to be in excess of $6 billion by 2018,\" commented Mr. Arie Trabelsi, President and CEO of SuperCom. \"Furthermore, we are happy bring on a new country and national government customer to SuperCom´s growing customer base, which we are looking forward to working with closely over the next years as we offer our rapidly growing array of innovate government solutions.\"",
    "Corporate Corporate Overview Our Vision Corporate Management Global Management Board of Directors Ethical Code Solutions Education Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Supply Chain Transportation & Logistics Homeland Security Case Studies Healthcare Asset Tracking Secure Communication Resident Safety Companion Wander Detection Solution Staff Safety Companion Wander Detection Solution Divisions SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record RFID PureRF™ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program SuperPay SuperPay PureMoney SuperPOS SafeMoney ∑ID ∑ID Solutions ∑ID Technologies ∑ID Systems & Applications ∑ID Services ∑ID Track Record ∑ID Systems & Applications RFID PureRF™ Suite Parking Management Anti-Wandering System Asset Management Weapon Management Lock Alert Lands & GIS GIS Secured Land Title Lands Mapping EM GPS Offender Tracking House Arrest Monitoring PureTag RF Bracelet PureMonitor Offender Monitoring Software Inmate Monitoring Solution Domestic Violence Victim Protection Why choose SuperCom? Glossary of Implementing an EM program PureMonitor Offender Monitoring Software Domestic Violence Victim Protection Implementing an EM program Services Professional Services Support Tools Products PureRF™ Readers PureRF™ Tags IR Corporate Profile Corporate Governance The General Assembly Articles of Association Board of Directors Press Releases SEC Filing Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Contact CRO Corporate Governance The General Assembly Articles of Association Board of Directors Annual Reports (XBRL) 2011 - XBRL 2012 - XBRL 2013-F1 - XBRL 2013-F1/A - XBRL 2013 - XBRL Semi-annual - 2014 - XBRL 2014 - XBRL Download XBRL Files Semi-annual - 2014 - XBRL Contact Us Career Israel USA SuperCom Ltd. Announces Pricing of Public Offering of Ordinary Shares SuperCom Ltd. (NASDAQ: SPCB ) (\"SuperCom\" or \"the Company\"), a provider of secure solutions for e-Government, Public Safety, HealthCare, and Finance sectors, today announced the pricing of an underwritten public offering of 2,100,000 shares of its ordinary shares at a price to the public of $12.00 per share for total gross proceeds, before underwriting commissions and offering expenses, of $25,200,000. The offering is expected to close on or about June 23, 2015, subject to customary closing conditions. SuperCom has granted the underwriters a 30-day option to purchase up to 315,000 additional shares of ordinary shares to cover overallotments, if any. Cowen and Company, LLC is acting as sole book-runner for the offering, and B. Riley & Co., LLC, Craig-Hallum Capital Group LLC and Feltl and Company, Inc. are acting as co-managers. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement relating to the offering was filed with the SEC on June 17, 2015 and is available on the SEC´s website located at http://www.sec.gov . Copies of the final prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. Cowen and Company, LLC is acting as sole book-runner for the offering, and B. Riley & Co., LLC, Craig-Hallum Capital Group LLC and Feltl and Company, Inc. are acting as co-managers. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement relating to the offering was filed with the SEC on June 17, 2015 and is available on the SEC´s website located at http://www.sec.gov . Copies of the final prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. The Company intends to use the net proceeds from this offering for general corporate purposes, including working capital. The Company may also use a portion of the net proceeds for the acquisition of, or investment in, technologies, solutions or businesses that complement its business, although the Company has no present commitments or agreements to enter into any acquisitions or investments. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement relating to the offering was filed with the SEC on June 17, 2015 and is available on the SEC´s website located at http://www.sec.gov . Copies of the final prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. A shelf registration statement on Form F-3 relating to the public offering of the shares of ordinary shares described above was filed with the Securities and Exchange Commission (\"SEC\") and was declared effective on July 25, 2014. A preliminary prospectus supplement relating to the offering was filed with the SEC on June 17, 2015 and is available on the SEC´s website located at http://www.sec.gov . Copies of the final prospectus supplement and accompanying prospectus relating to the offering may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY, 11717, Attn: Prospectus Department, or by calling (631) 274-2806. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction."
  ]
}