{
  "company": "www.smartsearch.com",
  "dominant_topics": [
    5,
    -1,
    0,
    1,
    6
  ],
  "topic_counts": {
    "5": 162,
    "-1": 25,
    "0": 11,
    "1": 4,
    "6": 2
  },
  "topic_descriptions": {
    "5": "aml, smartsearch, money, laundering, money laundering",
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.3014477766287487,
    "framing_surveillance": 0.0334367459496725,
    "framing_market": 0.6651154774215787,
    "num_docs": 204
  },
  "topic_timeline": {
    "20": {
      "-1": 25,
      "0": 11,
      "1": 4,
      "5": 162,
      "6": 2
    }
  },
  "sample_docs": [
    "Submit To Search Engines Low Cost Internet Service The Internet's best WEBSITE SEARCH ENGINES web sites - Sponsored Listings Website Search Engines Fast to Deploy. Easy to Manage. Get Google For Your Website. www.google.com/enterprise/ MS-website search engine Full control for good integration. Search words highlighted. XML API. www.findinsite.com/ $7.95/mo Web Hosting Over 93% Customer Satisfaction Reliable and 24/7 Live Support www.core.com/ Engines Engines for sale. aff Check out the deals now! www.ebay.com/ Search the Web No pop-ups. No cookies. No Invasion of Privacy - Just quick results! www.yoohaha.com/search/",
    "& Conditions We are SmartCredit Limited T/As SmartSearch, (\"SmartCredit/SmartSearch\" / \"we\" / \"us\" / \"our\") a company registered in England and Wales under registered number 05534508 and our registered office is at Mayfield House, Lower Railway Road, Ilkley, Leeds, LS29 8FL. Your access and use of this website with domain name www.smartsearch.com (\"Website\") is subject to the in this document (\" \"). By using this Website, you agree to be bound by these , which shall take effect immediately on your first use of this Website. If you do not agree to be bound by all of these , you must leave this Website immediately. We may change these at any time by publishing revised or new on this Website. By using this Website after we change the , you accept and will be bound by them. We notify you of the date the changes were last made by including the date of these changes in the 'Latest Version' section below, so it is important that you check this page from time to time to take notice of any changes that we make. A number of our services are available at this Website and specific contractual apply to each of these services. Nothing on this Website shall constitute an offer by us to provide any services to any person accessing this Website. Intellectual Property Rights All copyrights, trade marks, design rights, patents and other intellectual property (registered and unregistered) in and on the Website and all content (including all applications) located on this Website shall remain vested in SmartCredit or its licensors. You may not modify, copy, reproduce, republish, upload, post, transmit, reverse engineer or distribute, in any manner, the material on the Website, including text, graphics, code and / or software. You may print and download portions of material from the different areas of the Website solely for your own non-commercial use provided that you agree not to change or delete any copyright or proprietary notices from the material. You may not attempt to introduce any malicious code or virus to any of our systems, or to damage them or this Website in any way. Other product or company names mentioned in the Website may be the trade marks of their respective owners. Nothing in these in any way confers on you any licence or right under any trade marks, names or logos of SmartCredit/SmartSearch or any third party. You may not use, frame or utilise framing techniques to enclose any SmartCredit and/or SmartSearch trade mark, logo or other proprietary information, including the images found at this Website, the content of any text or the layout / design of any page or form contained on a page without our written permission. Except as noted above, you are not conveyed any right or license by implication, estoppel, or otherwise in or under any patent, trade mark, copyright, or proprietary right of SmartCredit and/or SmartSearch or any third party. Disclaimer Nothing in these limits or excludes our liability for death or personal injury caused by our negligence. Subject to the foregoing, we shall not be liable for any of the following losses or damage (whether such damage or losses were foreseen, foreseeable, known or otherwise): (a) loss of data; (b) loss of revenue or anticipated profits; (c) loss of business; (d) loss of opportunity; (e) loss of goodwill or injury to reputation; (f) losses suffered by third parties; or (g) any indirect, consequential, special or exemplary damages arising from the use of this Website regardless of the form of action. We do not warrant the completeness, timeliness or accuracy of any of the input or output data and / or programs (\"Information\") available at this Website. The Information is provided \"as is\" and we give no warranties, conditions, guarantees or representations, express or implied, that this Website will be available without interruption or that it is error, virus or bug free. You acknowledge that it is your responsibility to implement sufficient procedures and virus checks (including anti-virus and other security checks) to satisfy your particular requirements for the accuracy of Information. Link Policy This Website may contain hypertext links to web pages operated and maintained by third parties. These links are provided for your convenience only and we do not control and are not responsible for the contents of such web pages. Our inclusion of such links does not imply any endorsement of the material contained therein or of the owners. If you use the links to visit third party web pages, you do so at your own risk. You must not link to our Website without first getting our written permission. Confidentiality Comments, suggestions or materials sent or transmitted to us (collectively \"Feedback\"), shall be deemed to be non-confidential. We shall have no obligation of any kind with respect to such Feedback. By sending us Feedback you grant us an unrestricted, irrevocable license to use, reproduce, distribute, display and otherwise exploit the Feedback without limitation, including but not limited to developing and marketing products incorporating such Feedback. We will not without your written permission release your name or otherwise publicise the fact that you have submitted Feedback, unless we are required to do so by law. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo to our newsletter to receive news, resources and updates straight into your inbox! By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our . & Conditions We are SmartCredit Limited T/As SmartSearch, (\"SmartCredit/SmartSearch\" / \"we\" / \"us\" / \"our\") a company registered in England and Wales under registered number 05534508 and our registered office is at Mayfield House, Lower Railway Road, Ilkley, Leeds, LS29 8FL. Your access and use of this website with domain name www.smartsearch.com (\"Website\") is subject to the in this document (\" \"). By using this Website, you agree to be bound by these , which shall take effect immediately on your first use of this Website. If you do not agree to be bound by all of these , you must leave this Website immediately. We may change these at any time by publishing revised or new on this Website. By using this Website after we change the , you accept and will be bound by them. We notify you of the date the changes were last made by including the date of these changes in the 'Latest Version' section below, so it is important that you check this page from time to time to take notice of any changes that we make. A number of our services are available at this Website and specific contractual apply to each of these services. Nothing on this Website shall constitute an offer by us to provide any services to any person accessing this Website. Intellectual Property Rights All copyrights, trade marks, design rights, patents and other intellectual property (registered and unregistered) in and on the Website and all content (including all applications) located on this Website shall remain vested in SmartCredit or its licensors. You may not modify, copy, reproduce, republish, upload, post, transmit, reverse engineer or distribute, in any manner, the material on the Website, including text, graphics, code and / or software. You may print and download portions of material from the different areas of the Website solely for your own non-commercial use provided that you agree not to change or delete any copyright or proprietary notices from the material. You may not attempt to introduce any malicious code or virus to any of our systems, or to damage them or this Website in any way. Other product or company names mentioned in the Website may be the trade marks of their respective owners. Nothing in these in any way confers on you any licence or right under any trade marks, names or logos of SmartCredit/SmartSearch or any third party. You may not use, frame or utilise framing techniques to enclose any SmartCredit and/or SmartSearch trade mark, logo or other proprietary information, including the images found at this Website, the content of any text or the layout / design of any page or form contained on a page without our written permission. Except as noted above, you are not conveyed any right or license by implication, estoppel, or otherwise in or under any patent, trade mark, copyright, or proprietary right of SmartCredit and/or SmartSearch or any third party. Disclaimer Nothing in these limits or excludes our liability for death or personal injury caused by our negligence. Subject to the foregoing, we shall not be liable for any of the following losses or damage (whether such damage or losses were foreseen, foreseeable, known or otherwise): (a) loss of data; (b) loss of revenue or anticipated profits; (c) loss of business; (d) loss of opportunity; (e) loss of goodwill or injury to reputation; (f) losses suffered by third parties; or (g) any indirect, consequential, special or exemplary damages arising from the use of this Website regardless of the form of action. We do not warrant the completeness, timeliness or accuracy of any of the input or output data and / or programs (\"Information\") available at this Website. The Information is provided \"as is\" and we give no warranties, conditions, guarantees or representations, express or implied, that this Website will be available without interruption or that it is error, virus or bug free. You acknowledge that it is your responsibility to implement sufficient procedures and virus checks (including anti-virus and other security checks) to satisfy your particular requirements for the accuracy of Information. Link Policy This Website may contain hypertext links to web pages operated and maintained by third parties. These links are provided for your convenience only and we do not control and are not responsible for the contents of such web pages. Our inclusion of such links does not imply any endorsement of the material contained therein or of the owners. If you use the links to visit third party web pages, you do so at your own risk. You must not link to our Website without first getting our written permission. Confidentiality Comments, suggestions or materials sent or transmitted to us (collectively \"Feedback\"), shall be deemed to be non-confidential. We shall have no obligation of any kind with respect to such Feedback. By sending us Feedback you grant us an unrestricted, irrevocable license to use, reproduce, distribute, display and otherwise exploit the Feedback without limitation, including but not limited to developing and marketing products incorporating such Feedback. We will not without your written permission release your name or otherwise publicise the fact that you have submitted Feedback, unless we are required to do so by law. We are SmartCredit Limited T/As SmartSearch, (\"SmartCredit/SmartSearch\" / \"we\" / \"us\" / \"our\") a company registered in England and Wales under registered number 05534508 and our registered office is at Mayfield House, Lower Railway Road, Ilkley, Leeds, LS29 8FL. Your access and use of this website with domain name www.smartsearch.com (\"Website\") is subject to the in this document (\" \"). By using this Website, you agree to be bound by these , which shall take effect immediately on your first use of this Website. If you do not agree to be bound by all of these , you must leave this Website immediately. We may change these at any time by publishing revised or new on this Website. By using this Website after we change the , you accept and will be bound by them. We notify you of the date the changes were last made by including the date of these changes in the 'Latest Version' section below, so it is important that you check this page from time to time to take notice of any changes that we make. A number of our services are available at this Website and specific contractual apply to each of these services. Nothing on this Website shall constitute an offer by us to provide any services to any person accessing this Website. All copyrights, trade marks, design rights, patents and other intellectual property (registered and unregistered) in and on the Website and all content (including all applications) located on this Website shall remain vested in SmartCredit or its licensors. You may not modify, copy, reproduce, republish, upload, post, transmit, reverse engineer or distribute, in any manner, the material on the Website, including text, graphics, code and / or software. You may print and download portions of material from the different areas of the Website solely for your own non-commercial use provided that you agree not to change or delete any copyright or proprietary notices from the material. You may not attempt to introduce any malicious code or virus to any of our systems, or to damage them or this Website in any way. Other product or company names mentioned in the Website may be the trade marks of their respective owners. Nothing in these in any way confers on you any licence or right under any trade marks, names or logos of SmartCredit/SmartSearch or any third party. You may not use, frame or utilise framing techniques to enclose any SmartCredit and/or SmartSearch trade mark, logo or other proprietary information, including the images found at this Website, the content of any text or the layout / design of any page or form contained on a page without our written permission. Except as noted above, you are not conveyed any right or license by implication, estoppel, or otherwise in or under any patent, trade mark, copyright, or proprietary right of SmartCredit and/or SmartSearch or any third party. Nothing in these limits or excludes our liability for death or personal injury caused by our negligence. Subject to the foregoing, we shall not be liable for any of the following losses or damage (whether such damage or losses were foreseen, foreseeable, known or otherwise): (a) loss of data; (b) loss of revenue or anticipated profits; (c) loss of business; (d) loss of opportunity; (e) loss of goodwill or injury to reputation; (f) losses suffered by third parties; or (g) any indirect, consequential, special or exemplary damages arising from the use of this Website regardless of the form of action. We do not warrant the completeness, timeliness or accuracy of any of the input or output data and / or programs (\"Information\") available at this Website. The Information is provided \"as is\" and we give no warranties, conditions, guarantees or representations, express or implied, that this Website will be available without interruption or that it is error, virus or bug free. You acknowledge that it is your responsibility to implement sufficient procedures and virus checks (including anti-virus and other security checks) to satisfy your particular requirements for the accuracy of Information. This Website may contain hypertext links to web pages operated and maintained by third parties. These links are provided for your convenience only and we do not control and are not responsible for the contents of such web pages. Our inclusion of such links does not imply any endorsement of the material contained therein or of the owners. If you use the links to visit third party web pages, you do so at your own risk. You must not link to our Website without first getting our written permission. Comments, suggestions or materials sent or transmitted to us (collectively \"Feedback\"), shall be deemed to be non-confidential. We shall have no obligation of any kind with respect to such Feedback. By sending us Feedback you grant us an unrestricted, irrevocable license to use, reproduce, distribute, display and otherwise exploit the Feedback without limitation, including but not limited to developing and marketing products incorporating such Feedback. We will not without your written permission release your name or otherwise publicise the fact that you have submitted Feedback, unless we are required to do so by law. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product to our newsletter to receive news, resources and updates straight into your inbox! By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our . By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our .",
    "Product Overview Features Benefits Pricing Features BSA compliant customer checks on individuals and businesses from a single platform Quick, reliable customer identification without paper documents A fully comprehensive Customer Identification Program SmartSearch completes a full BSA compliant check in one simple step. Simply enter the individual's name, address, date of birth and social security number and SmartSearch will verify their identity, and screen for Sanctions and PEPs in a matter of seconds. Multiple data sources By integrating leading global data sources, Experian and Dow Jones, we verify US and international customers, offering an efficient, cost-effective and fully comprehensive BSA compliant solution with the highest match and pass rates on the market. Complete result breakdown For every identity and Sanctions check you complete, SmartSearch will produce a detailed online report of that person or business, ensuring you have everything you need to know about all your customers. Clear identity verification & Sanction results in seconds Sanction, PEP, SIP and RCA screening Unlike other CIP solutions which offer either identity verification or Sanction and PEP screening, SmartSearch performs all checks needed to meet the CDD Final Rule from one place. SmartSearch automatically performs Sanction, PEP, SIP and RCA screening to ensure you are always fully compliant. Automatic Enhanced Due Diligence SmartSearch automatically performs Enhanced Due Diligence (EDD) on any identity checks that match with a Sanction, PEP, SIP or RCA record to remove any false positives. You are alerted to cases that require manual intervention, saving your business time and money. Daily monitoring Our unique monitoring service takes data from the Dow Jones Factiva Watchlist every night which will send you an alert if there are any changes to the status of your clients. You are notified if action needs to be taken. Verify corporate customers in under two minutes Know Your Business (KYB) checks Just enter the name and zip code of your corporate customers and SmartSearch will run a comprehensive business check in a matter of minutes including identifying and screening executives and owners. Validate the corporate structure A SmartSearch business check will confirm the existence of the business, validate its corporate structure, and automatically perform OFAC and Global sanction screening on the company and its executives, providing detailed information on any matches.. Remain fully compliant for the life of your contract Every business check is saved automatically onto SmartSearch and monitored daily. Our email alert system then warns you of any risks, enabling you to protect your business right from the start of your corporate relationships with just one, single platform. SmartSearch checks on both US & International customers Perform full identity checks & Sanction Screening on customers from more than 200 countries. Get started Run identity checks on the move with our integrated app Complete identity checks & Sanction Screening whenever, wherever With our fully integrated app you can verify your customers' identity remotely. Just scan their photo ID or enter their details into your handheld device, and you will receive the results in under two seconds. Automated ID checks Optical Character Recognition (OCR) extracts all the information needed to enable a full identity check & document validation with Sanction and PEP screening. Just scan the individual's photo ID and SmartSearch will do the rest. Manual data-entry backup Want to run a check with the SmartSearch app and manually input their data? Just enter the individuals' details and SmartSearch will automatically perform the full ID check, document validation and Sanction & PEP Screening. Simplify your BSA/AML Program Full visibility of all searches Thanks to SmartSearch's simple interface, team members at any level can run searches on individuals and businesses, while central compliance teams have full visibility of all activity and can download individual reports quickly and easily. Run retrospective and historic checks Our retrospective check service enables you to batch upload current and past individual and corporate client records giving you the certainty there are no compliance gaps in your program and record-keeping is always up to date. Always audit ready SmartSearch automatically keeps records of all search results while ongoing monitoring ensures every entry is always up to date. Any information needed for audits or regulatory checks will be easily and immediately accessible, any time. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo to our newsletter to receive news, resources and updates straight into your inbox! By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our . Features BSA compliant customer checks on individuals and businesses from a single platform BSA compliant customer checks on individuals and businesses from a single platform Quick, reliable customer identification without paper documents A fully comprehensive Customer Identification Program SmartSearch completes a full BSA compliant check in one simple step. Simply enter the individual's name, address, date of birth and social security number and SmartSearch will verify their identity, and screen for Sanctions and PEPs in a matter of seconds. Multiple data sources By integrating leading global data sources, Experian and Dow Jones, we verify US and international customers, offering an efficient, cost-effective and fully comprehensive BSA compliant solution with the highest match and pass rates on the market. Complete result breakdown For every identity and Sanctions check you complete, SmartSearch will produce a detailed online report of that person or business, ensuring you have everything you need to know about all your customers. Quick, reliable customer identification without paper documents A fully comprehensive Customer Identification Program SmartSearch completes a full BSA compliant check in one simple step. Simply enter the individual's name, address, date of birth and social security number and SmartSearch will verify their identity, and screen for Sanctions and PEPs in a matter of seconds. SmartSearch completes a full BSA compliant check in one simple step. Simply enter the individual's name, address, date of birth and social security number and SmartSearch will verify their identity, and screen for Sanctions and PEPs in a matter of seconds. Multiple data sources By integrating leading global data sources, Experian and Dow Jones, we verify US and international customers, offering an efficient, cost-effective and fully comprehensive BSA compliant solution with the highest match and pass rates on the market. By integrating leading global data sources, Experian and Dow Jones, we verify US and international customers, offering an efficient, cost-effective and fully comprehensive BSA compliant solution with the highest match and pass rates on the market. Complete result breakdown For every identity and Sanctions check you complete, SmartSearch will produce a detailed online report of that person or business, ensuring you have everything you need to know about all your customers. For every identity and Sanctions check you complete, SmartSearch will produce a detailed online report of that person or business, ensuring you have everything you need to know about all your customers. Clear identity verification & Sanction results in seconds Sanction, PEP, SIP and RCA screening Unlike other CIP solutions which offer either identity verification or Sanction and PEP screening, SmartSearch performs all checks needed to meet the CDD Final Rule from one place. SmartSearch automatically performs Sanction, PEP, SIP and RCA screening to ensure you are always fully compliant. Automatic Enhanced Due Diligence SmartSearch automatically performs Enhanced Due Diligence (EDD) on any identity checks that match with a Sanction, PEP, SIP or RCA record to remove any false positives. You are alerted to cases that require manual intervention, saving your business time and money. Daily monitoring Our unique monitoring service takes data from the Dow Jones Factiva Watchlist every night which will send you an alert if there are any changes to the status of your clients. You are notified if action needs to be taken. Clear identity verification & Sanction results in seconds Sanction, PEP, SIP and RCA screening Unlike other CIP solutions which offer either identity verification or Sanction and PEP screening, SmartSearch performs all checks needed to meet the CDD Final Rule from one place. SmartSearch automatically performs Sanction, PEP, SIP and RCA screening to ensure you are always fully compliant. Unlike other CIP solutions which offer either identity verification or Sanction and PEP screening, SmartSearch performs all checks needed to meet the CDD Final Rule from one place. SmartSearch automatically performs Sanction, PEP, SIP and RCA screening to ensure you are always fully compliant. Automatic Enhanced Due Diligence SmartSearch automatically performs Enhanced Due Diligence (EDD) on any identity checks that match with a Sanction, PEP, SIP or RCA record to remove any false positives. You are alerted to cases that require manual intervention, saving your business time and money. SmartSearch automatically performs Enhanced Due Diligence (EDD) on any identity checks that match with a Sanction, PEP, SIP or RCA record to remove any false positives. You are alerted to cases that require manual intervention, saving your business time and money. Daily monitoring Our unique monitoring service takes data from the Dow Jones Factiva Watchlist every night which will send you an alert if there are any changes to the status of your clients. You are notified if action needs to be taken. Our unique monitoring service takes data from the Dow Jones Factiva Watchlist every night which will send you an alert if there are any changes to the status of your clients. You are notified if action needs to be taken. Verify corporate customers in under two minutes Know Your Business (KYB) checks Just enter the name and zip code of your corporate customers and SmartSearch will run a comprehensive business check in a matter of minutes including identifying and screening executives and owners. Validate the corporate structure A SmartSearch business check will confirm the existence of the business, validate its corporate structure, and automatically perform OFAC and Global sanction screening on the company and its executives, providing detailed information on any matches.. Remain fully compliant for the life of your contract Every business check is saved automatically onto SmartSearch and monitored daily. Our email alert system then warns you of any risks, enabling you to protect your business right from the start of your corporate relationships with just one, single platform. Verify corporate customers in under two minutes Know Your Business (KYB) checks Just enter the name and zip code of your corporate customers and SmartSearch will run a comprehensive business check in a matter of minutes including identifying and screening executives and owners. Just enter the name and zip code of your corporate customers and SmartSearch will run a comprehensive business check in a matter of minutes including identifying and screening executives and owners. Validate the corporate structure A SmartSearch business check will confirm the existence of the business, validate its corporate structure, and automatically perform OFAC and Global sanction screening on the company and its executives, providing detailed information on any matches.. A SmartSearch business check will confirm the existence of the business, validate its corporate structure, and automatically perform OFAC and Global sanction screening on the company and its executives, providing detailed information on any matches.. Remain fully compliant for the life of your contract Every business check is saved automatically onto SmartSearch and monitored daily. Our email alert system then warns you of any risks, enabling you to protect your business right from the start of your corporate relationships with just one, single platform. Every business check is saved automatically onto SmartSearch and monitored daily. Our email alert system then warns you of any risks, enabling you to protect your business right from the start of your corporate relationships with just one, single platform. SmartSearch checks on both US & International customers Perform full identity checks & Sanction Screening on customers from more than 200 countries. Get started SmartSearch checks on both US & International customers Run identity checks on the move with our integrated app Complete identity checks & Sanction Screening whenever, wherever With our fully integrated app you can verify your customers' identity remotely. Just scan their photo ID or enter their details into your handheld device, and you will receive the results in under two seconds. Automated ID checks Optical Character Recognition (OCR) extracts all the information needed to enable a full identity check & document validation with Sanction and PEP screening. Just scan the individual's photo ID and SmartSearch will do the rest. Manual data-entry backup Want to run a check with the SmartSearch app and manually input their data? Just enter the individuals' details and SmartSearch will automatically perform the full ID check, document validation and Sanction & PEP Screening. Run identity checks on the move with our integrated app Complete identity checks & Sanction Screening whenever, wherever With our fully integrated app you can verify your customers' identity remotely. Just scan their photo ID or enter their details into your handheld device, and you will receive the results in under two seconds. With our fully integrated app you can verify your customers' identity remotely. Just scan their photo ID or enter their details into your handheld device, and you will receive the results in under two seconds. Automated ID checks Optical Character Recognition (OCR) extracts all the information needed to enable a full identity check & document validation with Sanction and PEP screening. Just scan the individual's photo ID and SmartSearch will do the rest. Optical Character Recognition (OCR) extracts all the information needed to enable a full identity check & document validation with Sanction and PEP screening. Just scan the individual's photo ID and SmartSearch will do the rest. Manual data-entry backup Want to run a check with the SmartSearch app and manually input their data? Just enter the individuals' details and SmartSearch will automatically perform the full ID check, document validation and Sanction & PEP Screening. Want to run a check with the SmartSearch app and manually input their data? Just enter the individuals' details and SmartSearch will automatically perform the full ID check, document validation and Sanction & PEP Screening. Simplify your BSA/AML Program Full visibility of all searches Thanks to SmartSearch's simple interface, team members at any level can run searches on individuals and businesses, while central compliance teams have full visibility of all activity and can download individual reports quickly and easily. Run retrospective and historic checks Our retrospective check service enables you to batch upload current and past individual and corporate client records giving you the certainty there are no compliance gaps in your program and record-keeping is always up to date. Always audit ready SmartSearch automatically keeps records of all search results while ongoing monitoring ensures every entry is always up to date. Any information needed for audits or regulatory checks will be easily and immediately accessible, any time. Simplify your BSA/AML Program Full visibility of all searches Thanks to SmartSearch's simple interface, team members at any level can run searches on individuals and businesses, while central compliance teams have full visibility of all activity and can download individual reports quickly and easily. Thanks to SmartSearch's simple interface, team members at any level can run searches on individuals and businesses, while central compliance teams have full visibility of all activity and can download individual reports quickly and easily. Run retrospective and historic checks Our retrospective check service enables you to batch upload current and past individual and corporate client records giving you the certainty there are no compliance gaps in your program and record-keeping is always up to date. Our retrospective check service enables you to batch upload current and past individual and corporate client records giving you the certainty there are no compliance gaps in your program and record-keeping is always up to date. Always audit ready SmartSearch automatically keeps records of all search results while ongoing monitoring ensures every entry is always up to date. Any information needed for audits or regulatory checks will be easily and immediately accessible, any time. SmartSearch automatically keeps records of all search results while ongoing monitoring ensures every entry is always up to date. Any information needed for audits or regulatory checks will be easily and immediately accessible, any time. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product to our newsletter to receive news, resources and updates straight into your inbox! By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our . By submitting your email address, you consent to us sending you emails about news, case studies, resources and updates. To find out more, visit our .",
    "WHAT WE DO Individual and business KYC checks made easy Are your customers who they say they are? How can you be sure? With SmartSearch you can be certain. Our innovative online Customer Identification Program (CIP) enables financial institutions to onboard customers, fight fraud and meet KYC due diligence requirements, all from one platform. The SmartSearch CIP identifies and verifies customers, screens against sanctions and PEPs and automatically triggers enhanced due diligence on any positive matches. Financial institutions can also run checks on corporations with our business reporting service - just enter the name and zip code and SmartSearch will confirm the existence of the business, identify and verify its executives and owners and validate the corporate structure. SmartSearch hosts all search data automatically, while our ongoing monitoring service ensures clients only ever need one CIP platform to onboard customers quickly and securely and maintain a risk-based AML program. US and International KYC checks on individuals and corporates Identify and verify Ultimate Business Owners Sanctions and PEP screening on all checks Adverse media and enhanced due diligence Customer data hosting and ongoing monitoring WHAT WE DO TripleCheck - Identity verification, facial recognition, and digital fraud checks in one solution By using three highly advanced identity verification methods, TripleCheck takes KYC to a new level to provide you with the only Customer Identification Program you will ever need. Our pioneering solution combines identification, verification and screening with facial recognition and liveness tests and digital fraud checks to create the most robust, reliable and secure all-in-one CIP, KYC, AML anti-fraud platform on the market. Level 1 Identification verification ensures the customer's details are legitimate and automatically screens against worldwide sanctions and PEP lists to identify bad actors Level 2 Facial recognition, document capture and liveness checks confirm the customer and their documents match, reducing ID-fraud and ensuring you know exactly who your customers are Level 3 Digital fraud checks and data referencing creates an overall fraud risk profile of each and every customer Discover TripleCheck HOW WE DO IT KYC made easy US AML rules are constantly changing, and it can be challenging to keep pace with all the latest requirements, but with SmartSearch you never need to worry about being caught out. Our easy-to-use online CIP platform makes running KYC checks easy, but not only that, it hosts all search data and checks it every night against the Dow Jones WatchList to ensure a fully compliant position at all times. SmartSearch uses multiple data sources to verify identities and screen for bad actors, while the latest facial recognition and liveness technology gives financial institutions the confidence that your customers are who they say they are. What's more, the platform is constantly being updated to ensure it meets the latest regulations meaning you never have to worry about updating your system to meet requirements. See our Product WHO WE WORK WITH Serving financial institutions across the US Which US businesses need to run identity verification checks? Under the Bank Secrecy Act (BSA) all US financial institutions are required to work with Government agencies to detect, deter, prevent and disrupt money laundering. They must have a risk-based AML program in place, consisting of appropriate customer due diligence (CDD), record-keeping and ongoing monitoring, a key part of which is a secure and reliable Customer Identification Program. Why is identity verification so important? Under the USA Patriot Act, all financial institutions must have a Customer Identification Program (CIP) to verify the identity of any individuals or businesses wishing to conduct financial transactions with them. These verification checks are an essential part of a risk-based AML program in order to identify potential high-risk clients that could make the financial institution vulnerable to money laundering and other financial crime. How is SmartSearch different from other Customer Identification Programs? SmartSearch is an innovative online identification verification solution that makes customer onboarding fast, effective and secure. Our automated online CIP platform enables financial institutions to verify the identities of all customers - individual and corporate - and screen against Global Watchlists in a matter of seconds, enabling clients to onboard customers and meet BSA and Patriot Act requirements all from one system. We can help you to… Meet BSA regulations Our platform helps financial institutions understand FinCEN anti money laundering requirements ensuring they take a risk-based approach to meet BSA, CCD Final Rule, AMLA and USA Patriot Act obligations. Verify Identities SmartSearch identifies and verifies customers, screening for sanctions and PEPs and then automatically runs enhanced due diligence if any warnings are highlighted, ensuring you are always aware of any potential risks to your business. Onboard customers SmartSearch can be integrated with your existing CIP and you can run KYC checks from your cell phone or tablet, enabling you to complete the required customer due diligence at onboarding, cutting costs, saving time and improving customer experience. Automatic data hosting Every KYC search you complete is automatically hosted on the system to ensure water-tight record keeping. We can even retrospectively upload client data to your CIP to ensure there are no gaps in your compliance record. Monitor clients Initial identity verification, screening and KYC checks are essential, but they are not enough to stay compliant - you also need to be aware of any changes in the risk profile of your customers. That is why SmartSearch monitors all search data every night to guarantee a fully compliant CIP. Prevent fraud SmartSearch offers a range of anti-fraud services that can be tailored to any financial institution's needs, while our facial recognition and liveness technology checks ensure ID fraud is never an issue. Identify bad actors Our comprehensive KYC program enables you to identify and verify customers, using the latest facial recognition and liveness technology to ensure the ID matches the person. We then screen against sanctions and PEPs to weed out any bad actors. Identify Ultimate Business Owners The SmartSearch business checks service not only enables you to run KYC checks on corporate customers but can also identify and verify the Ultimate Business Owners ensuring financial institutions know exactly who they are transacting with. HEAR IT FROM OUR HAPPY CUSTOMERS There's a reason we have a 98% client retention rate Our processes have been streamlined; we get all the information we need in one search and we no longer need to take so much time to connect the dots. We are always kept up to date with the latest developments. It is good to know they are always looking to help and simplify things for us, particularly with updates such as API integration. This is an excellent idea and would benefit many businesses to use a familiar system. We would recommend SmartSearch as an AML provider. Martina Hopgood Client liaison at US Tax and Financial Services We're most impressed with the service provided by SmartSearch. As a global business, we place high importance on our ability to identify all our clients. The [ongoing] monitoring service provides peace of mind that we are fully compliant with our legal obligations and the enhanced screening for Sanctions and PEPs provides added screening throughout the client journey. This is an excellent service and we are only too happy to recommend. Ken Deamer Director at Jones Lang LaSalle Ltd See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo WHAT WE DO Individual and business KYC checks made easy Are your customers who they say they are? How can you be sure? With SmartSearch you can be certain. Our innovative online Customer Identification Program (CIP) enables financial institutions to onboard customers, fight fraud and meet KYC due diligence requirements, all from one platform. The SmartSearch CIP identifies and verifies customers, screens against sanctions and PEPs and automatically triggers enhanced due diligence on any positive matches. Financial institutions can also run checks on corporations with our business reporting service - just enter the name and zip code and SmartSearch will confirm the existence of the business, identify and verify its executives and owners and validate the corporate structure. SmartSearch hosts all search data automatically, while our ongoing monitoring service ensures clients only ever need one CIP platform to onboard customers quickly and securely and maintain a risk-based AML program. US and International KYC checks on individuals and corporates Identify and verify Ultimate Business Owners Sanctions and PEP screening on all checks Adverse media and enhanced due diligence Customer data hosting and ongoing monitoring Individual and business KYC checks made easy Are your customers who they say they are? How can you be sure? With SmartSearch you can be certain. Our innovative online Customer Identification Program (CIP) enables financial institutions to onboard customers, fight fraud and meet KYC due diligence requirements, all from one platform. The SmartSearch CIP identifies and verifies customers, screens against sanctions and PEPs and automatically triggers enhanced due diligence on any positive matches. Financial institutions can also run checks on corporations with our business reporting service - just enter the name and zip code and SmartSearch will confirm the existence of the business, identify and verify its executives and owners and validate the corporate structure. SmartSearch hosts all search data automatically, while our ongoing monitoring service ensures clients only ever need one CIP platform to onboard customers quickly and securely and maintain a risk-based AML program. US and International KYC checks on individuals and corporates Identify and verify Ultimate Business Owners Sanctions and PEP screening on all checks Adverse media and enhanced due diligence Customer data hosting and ongoing monitoring WHAT WE DO TripleCheck - Identity verification, facial recognition, and digital fraud checks in one solution By using three highly advanced identity verification methods, TripleCheck takes KYC to a new level to provide you with the only Customer Identification Program you will ever need. Our pioneering solution combines identification, verification and screening with facial recognition and liveness tests and digital fraud checks to create the most robust, reliable and secure all-in-one CIP, KYC, AML anti-fraud platform on the market. Level 1 Identification verification ensures the customer's details are legitimate and automatically screens against worldwide sanctions and PEP lists to identify bad actors Level 2 Facial recognition, document capture and liveness checks confirm the customer and their documents match, reducing ID-fraud and ensuring you know exactly who your customers are Level 3 Digital fraud checks and data referencing creates an overall fraud risk profile of each and every customer Discover TripleCheck TripleCheck - Identity verification, facial recognition, and digital fraud checks in one solution By using three highly advanced identity verification methods, TripleCheck takes KYC to a new level to provide you with the only Customer Identification Program you will ever need. Our pioneering solution combines identification, verification and screening with facial recognition and liveness tests and digital fraud checks to create the most robust, reliable and secure all-in-one CIP, KYC, AML anti-fraud platform on the market. Level 1 Identification verification ensures the customer's details are legitimate and automatically screens against worldwide sanctions and PEP lists to identify bad actors Identification verification ensures the customer's details are legitimate and automatically screens against worldwide sanctions and PEP lists to identify bad actors Level 2 Facial recognition, document capture and liveness checks confirm the customer and their documents match, reducing ID-fraud and ensuring you know exactly who your customers are Facial recognition, document capture and liveness checks confirm the customer and their documents match, reducing ID-fraud and ensuring you know exactly who your customers are Level 3 Digital fraud checks and data referencing creates an overall fraud risk profile of each and every customer Digital fraud checks and data referencing creates an overall fraud risk profile of each and every customer HOW WE DO IT KYC made easy US AML rules are constantly changing, and it can be challenging to keep pace with all the latest requirements, but with SmartSearch you never need to worry about being caught out. Our easy-to-use online CIP platform makes running KYC checks easy, but not only that, it hosts all search data and checks it every night against the Dow Jones WatchList to ensure a fully compliant position at all times. SmartSearch uses multiple data sources to verify identities and screen for bad actors, while the latest facial recognition and liveness technology gives financial institutions the confidence that your customers are who they say they are. What's more, the platform is constantly being updated to ensure it meets the latest regulations meaning you never have to worry about updating your system to meet requirements. See our Product US AML rules are constantly changing, and it can be challenging to keep pace with all the latest requirements, but with SmartSearch you never need to worry about being caught out. Our easy-to-use online CIP platform makes running KYC checks easy, but not only that, it hosts all search data and checks it every night against the Dow Jones WatchList to ensure a fully compliant position at all times. SmartSearch uses multiple data sources to verify identities and screen for bad actors, while the latest facial recognition and liveness technology gives financial institutions the confidence that your customers are who they say they are. What's more, the platform is constantly being updated to ensure it meets the latest regulations meaning you never have to worry about updating your system to meet requirements. WHO WE WORK WITH Serving financial institutions across the US Which US businesses need to run identity verification checks? Under the Bank Secrecy Act (BSA) all US financial institutions are required to work with Government agencies to detect, deter, prevent and disrupt money laundering. They must have a risk-based AML program in place, consisting of appropriate customer due diligence (CDD), record-keeping and ongoing monitoring, a key part of which is a secure and reliable Customer Identification Program. Why is identity verification so important? Under the USA Patriot Act, all financial institutions must have a Customer Identification Program (CIP) to verify the identity of any individuals or businesses wishing to conduct financial transactions with them. These verification checks are an essential part of a risk-based AML program in order to identify potential high-risk clients that could make the financial institution vulnerable to money laundering and other financial crime. How is SmartSearch different from other Customer Identification Programs? SmartSearch is an innovative online identification verification solution that makes customer onboarding fast, effective and secure. Our automated online CIP platform enables financial institutions to verify the identities of all customers - individual and corporate - and screen against Global Watchlists in a matter of seconds, enabling clients to onboard customers and meet BSA and Patriot Act requirements all from one system. Serving financial institutions across the US Which US businesses need to run identity verification checks? Under the Bank Secrecy Act (BSA) all US financial institutions are required to work with Government agencies to detect, deter, prevent and disrupt money laundering. They must have a risk-based AML program in place, consisting of appropriate customer due diligence (CDD), record-keeping and ongoing monitoring, a key part of which is a secure and reliable Customer Identification Program. Under the Bank Secrecy Act (BSA) all US financial institutions are required to work with Government agencies to detect, deter, prevent and disrupt money laundering. They must have a risk-based AML program in place, consisting of appropriate customer due diligence (CDD), record-keeping and ongoing monitoring, a key part of which is a secure and reliable Customer Identification Program. Why is identity verification so important? Under the USA Patriot Act, all financial institutions must have a Customer Identification Program (CIP) to verify the identity of any individuals or businesses wishing to conduct financial transactions with them. These verification checks are an essential part of a risk-based AML program in order to identify potential high-risk clients that could make the financial institution vulnerable to money laundering and other financial crime. Under the USA Patriot Act, all financial institutions must have a Customer Identification Program (CIP) to verify the identity of any individuals or businesses wishing to conduct financial transactions with them. These verification checks are an essential part of a risk-based AML program in order to identify potential high-risk clients that could make the financial institution vulnerable to money laundering and other financial crime. How is SmartSearch different from other Customer Identification Programs? SmartSearch is an innovative online identification verification solution that makes customer onboarding fast, effective and secure. Our automated online CIP platform enables financial institutions to verify the identities of all customers - individual and corporate - and screen against Global Watchlists in a matter of seconds, enabling clients to onboard customers and meet BSA and Patriot Act requirements all from one system. SmartSearch is an innovative online identification verification solution that makes customer onboarding fast, effective and secure. Our automated online CIP platform enables financial institutions to verify the identities of all customers - individual and corporate - and screen against Global Watchlists in a matter of seconds, enabling clients to onboard customers and meet BSA and Patriot Act requirements all from one system. We can help you to… Meet BSA regulations Our platform helps financial institutions understand FinCEN anti money laundering requirements ensuring they take a risk-based approach to meet BSA, CCD Final Rule, AMLA and USA Patriot Act obligations. Verify Identities SmartSearch identifies and verifies customers, screening for sanctions and PEPs and then automatically runs enhanced due diligence if any warnings are highlighted, ensuring you are always aware of any potential risks to your business. Onboard customers SmartSearch can be integrated with your existing CIP and you can run KYC checks from your cell phone or tablet, enabling you to complete the required customer due diligence at onboarding, cutting costs, saving time and improving customer experience. Automatic data hosting Every KYC search you complete is automatically hosted on the system to ensure water-tight record keeping. We can even retrospectively upload client data to your CIP to ensure there are no gaps in your compliance record. Monitor clients Initial identity verification, screening and KYC checks are essential, but they are not enough to stay compliant - you also need to be aware of any changes in the risk profile of your customers. That is why SmartSearch monitors all search data every night to guarantee a fully compliant CIP. Prevent fraud SmartSearch offers a range of anti-fraud services that can be tailored to any financial institution's needs, while our facial recognition and liveness technology checks ensure ID fraud is never an issue. Identify bad actors Our comprehensive KYC program enables you to identify and verify customers, using the latest facial recognition and liveness technology to ensure the ID matches the person. We then screen against sanctions and PEPs to weed out any bad actors. Identify Ultimate Business Owners The SmartSearch business checks service not only enables you to run KYC checks on corporate customers but can also identify and verify the Ultimate Business Owners ensuring financial institutions know exactly who they are transacting with. We can help you to… Identify Ultimate Business Owners HEAR IT FROM OUR HAPPY CUSTOMERS There's a reason we have a 98% client retention rate Our processes have been streamlined; we get all the information we need in one search and we no longer need to take so much time to connect the dots. We are always kept up to date with the latest developments. It is good to know they are always looking to help and simplify things for us, particularly with updates such as API integration. This is an excellent idea and would benefit many businesses to use a familiar system. We would recommend SmartSearch as an AML provider. Martina Hopgood Client liaison at US Tax and Financial Services There's a reason we have a 98% client retention rate We're most impressed with the service provided by SmartSearch. As a global business, we place high importance on our ability to identify all our clients. The [ongoing] monitoring service provides peace of mind that we are fully compliant with our legal obligations and the enhanced screening for Sanctions and PEPs provides added screening throughout the client journey. This is an excellent service and we are only too happy to recommend. Ken Deamer Director at Jones Lang LaSalle Ltd See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product",
    "Product Overview Features Benefits Pricing Benefits Ensure a smooth, efficient Customer Identification Program (CIP) Enter your details to get personalised pricing that suits the needs of your business. Simplify your systems A one-stop-shop for all your CIP requirements Our innovative identity verification platform is the only CIP that also performs full Sanction and PEP Screening and ongoing monitoring on individuals and corporates in the US and internationally. Save time and reduce costs by switching to our all-in-one solution. Know Your Customers (KYC) SmartSearch ensures you never waste time screening the wrong person or business. Our platform verifies your client's identity in one easy check, so you always know exactly who your customers are. Instant notifications on anything suspicious Thanks to our unique daily monitoring service, manually checking Sanction and PEP lists is a thing of the past. Our partnership with the Dow Jones Factiva Watchlist will notify you if the status of your customers changes over night, ensuring you always remain fully compliant. SmartSearch can facilitate your processes, saving you time and money Intuitive system with integrated app Get your compliance done sooner: SmartSearch is so easy to use that team members at any level can successfully run identity and business checks, either through the main platform or via the app. Clear and simple reports With SmartSearch no time is wasted picking through complex documents for what you need. Our results appear in a single report which is easy to understand and can be downloaded in seconds. You'll never need to upgrade your AML software again Regardless of contract size, all our customers have access to the same central platform, which we are continually improving and updating in line with the latest FinCEN, BSA/AML regulations, meaning you'll never need to upgrade to stay compliant. You'll always be ready for audits and regulatory visits 24/7 access to the platform Access your customer data quickly and easily, whenever you need to. Every check you do is saved automatically onto SmartSearch and monitored daily against Sanction and PEP lists ensuring it is always up to date. Boost productivity, efficiency and service SmartSearch makes customer onboarding quick and easy and enables you to create efficient workflows that boost your teams' productivity and improve your customers' experience. Export the information you need quickly and easily, whenever you need it. Upload all your existing customers in one batch We can batch upload all your existing and historical customer data to SmartSearch and perform an up-to-date identity, Sanction and PEP check on each. Give yourself a fresh start with a clean, compliant position and guarantee your compliance for the duration of your contract. Streamline processes and improve your customers' experience 95% pass rate Thanks to agreements with leading Global data suppliers, we can deliver a match-and-pass rate of 95% and clear up 75% of your failed Sanction cases automatically, making your entire Customer Identification Program quicker, easier and more efficient and ensuring you don't waste any time on false positives. No need for documents With SmartSearch, you will never need to rely on slow, unreliable manual checks again. Just enter the name, address, date of birth and social security number and in two seconds, SmartSearch will complete a full ID check and Sanction and PEP Screening. For corporate checks just enter the name and zip code and SmartSearch will identify and verify the business, its structure, and its executives. Carry out identity & Sanction checks whenever, wherever Our fully integrated app gives you access to SmartSearch remotely via your cell phone or tablet. Perform customer identification and verification checks whenever you need to, from wherever you are. We are here to help you Training tailored to your needs SmartSearch is designed to be user-friendly, making it simple and easy to use. This, combined with our comprehensive training which can be tailored to your requirements, means team members at any level will be able to successfully run the CIP and BSA/AML checks. Dedicated Customer Success Manager Every SmartSearch customer has their own dedicated customer success manager; they will be your main point of contact and be able to immediately answer any questions or queries you have. You will also have access to our full customer services team for any additional support. Comprehensive offline support In addition to our expert customer services team, our detailed offline guides offer step-by-step instructions on how to use the system and product sheets will tell you all about our services. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo Benefits Ensure a smooth, efficient Customer Identification Program (CIP) Enter your details to get personalised pricing that suits the needs of your business. Ensure a smooth, efficient Customer Identification Program (CIP) Enter your details to get personalised pricing that suits the needs of your business. Simplify your systems A one-stop-shop for all your CIP requirements Our innovative identity verification platform is the only CIP that also performs full Sanction and PEP Screening and ongoing monitoring on individuals and corporates in the US and internationally. Save time and reduce costs by switching to our all-in-one solution. Know Your Customers (KYC) SmartSearch ensures you never waste time screening the wrong person or business. Our platform verifies your client's identity in one easy check, so you always know exactly who your customers are. Instant notifications on anything suspicious Thanks to our unique daily monitoring service, manually checking Sanction and PEP lists is a thing of the past. Our partnership with the Dow Jones Factiva Watchlist will notify you if the status of your customers changes over night, ensuring you always remain fully compliant. Our innovative identity verification platform is the only CIP that also performs full Sanction and PEP Screening and ongoing monitoring on individuals and corporates in the US and internationally. Save time and reduce costs by switching to our all-in-one solution. SmartSearch ensures you never waste time screening the wrong person or business. Our platform verifies your client's identity in one easy check, so you always know exactly who your customers are. Thanks to our unique daily monitoring service, manually checking Sanction and PEP lists is a thing of the past. Our partnership with the Dow Jones Factiva Watchlist will notify you if the status of your customers changes over night, ensuring you always remain fully compliant. SmartSearch can facilitate your processes, saving you time and money Intuitive system with integrated app Get your compliance done sooner: SmartSearch is so easy to use that team members at any level can successfully run identity and business checks, either through the main platform or via the app. Clear and simple reports With SmartSearch no time is wasted picking through complex documents for what you need. Our results appear in a single report which is easy to understand and can be downloaded in seconds. You'll never need to upgrade your AML software again Regardless of contract size, all our customers have access to the same central platform, which we are continually improving and updating in line with the latest FinCEN, BSA/AML regulations, meaning you'll never need to upgrade to stay compliant. SmartSearch can facilitate your processes, saving you time and money Get your compliance done sooner: SmartSearch is so easy to use that team members at any level can successfully run identity and business checks, either through the main platform or via the app. With SmartSearch no time is wasted picking through complex documents for what you need. Our results appear in a single report which is easy to understand and can be downloaded in seconds. Regardless of contract size, all our customers have access to the same central platform, which we are continually improving and updating in line with the latest FinCEN, BSA/AML regulations, meaning you'll never need to upgrade to stay compliant. You'll always be ready for audits and regulatory visits 24/7 access to the platform Access your customer data quickly and easily, whenever you need to. Every check you do is saved automatically onto SmartSearch and monitored daily against Sanction and PEP lists ensuring it is always up to date. Boost productivity, efficiency and service SmartSearch makes customer onboarding quick and easy and enables you to create efficient workflows that boost your teams' productivity and improve your customers' experience. Export the information you need quickly and easily, whenever you need it. Upload all your existing customers in one batch We can batch upload all your existing and historical customer data to SmartSearch and perform an up-to-date identity, Sanction and PEP check on each. Give yourself a fresh start with a clean, compliant position and guarantee your compliance for the duration of your contract. You'll always be ready for audits and regulatory visits Access your customer data quickly and easily, whenever you need to. Every check you do is saved automatically onto SmartSearch and monitored daily against Sanction and PEP lists ensuring it is always up to date. SmartSearch makes customer onboarding quick and easy and enables you to create efficient workflows that boost your teams' productivity and improve your customers' experience. Export the information you need quickly and easily, whenever you need it. We can batch upload all your existing and historical customer data to SmartSearch and perform an up-to-date identity, Sanction and PEP check on each. Give yourself a fresh start with a clean, compliant position and guarantee your compliance for the duration of your contract. Streamline processes and improve your customers' experience 95% pass rate Thanks to agreements with leading Global data suppliers, we can deliver a match-and-pass rate of 95% and clear up 75% of your failed Sanction cases automatically, making your entire Customer Identification Program quicker, easier and more efficient and ensuring you don't waste any time on false positives. No need for documents With SmartSearch, you will never need to rely on slow, unreliable manual checks again. Just enter the name, address, date of birth and social security number and in two seconds, SmartSearch will complete a full ID check and Sanction and PEP Screening. For corporate checks just enter the name and zip code and SmartSearch will identify and verify the business, its structure, and its executives. Carry out identity & Sanction checks whenever, wherever Our fully integrated app gives you access to SmartSearch remotely via your cell phone or tablet. Perform customer identification and verification checks whenever you need to, from wherever you are. Streamline processes and improve your customers' experience Thanks to agreements with leading Global data suppliers, we can deliver a match-and-pass rate of 95% and clear up 75% of your failed Sanction cases automatically, making your entire Customer Identification Program quicker, easier and more efficient and ensuring you don't waste any time on false positives. With SmartSearch, you will never need to rely on slow, unreliable manual checks again. Just enter the name, address, date of birth and social security number and in two seconds, SmartSearch will complete a full ID check and Sanction and PEP Screening. For corporate checks just enter the name and zip code and SmartSearch will identify and verify the business, its structure, and its executives. Our fully integrated app gives you access to SmartSearch remotely via your cell phone or tablet. Perform customer identification and verification checks whenever you need to, from wherever you are. We are here to help you Training tailored to your needs SmartSearch is designed to be user-friendly, making it simple and easy to use. This, combined with our comprehensive training which can be tailored to your requirements, means team members at any level will be able to successfully run the CIP and BSA/AML checks. Dedicated Customer Success Manager Every SmartSearch customer has their own dedicated customer success manager; they will be your main point of contact and be able to immediately answer any questions or queries you have. You will also have access to our full customer services team for any additional support. Comprehensive offline support In addition to our expert customer services team, our detailed offline guides offer step-by-step instructions on how to use the system and product sheets will tell you all about our services. We are here to help you SmartSearch is designed to be user-friendly, making it simple and easy to use. This, combined with our comprehensive training which can be tailored to your requirements, means team members at any level will be able to successfully run the CIP and BSA/AML checks. Every SmartSearch customer has their own dedicated customer success manager; they will be your main point of contact and be able to immediately answer any questions or queries you have. You will also have access to our full customer services team for any additional support. In addition to our expert customer services team, our detailed offline guides offer step-by-step instructions on how to use the system and product sheets will tell you all about our services. See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product Get a free demo See it in action Let one of our highly-trained sales team demonstrate the multi-award winning SmartSearch AML product"
  ]
}