{
  "company": "www.tankhapay.com",
  "dominant_topics": [
    10,
    -1
  ],
  "topic_counts": {
    "10": 12,
    "-1": 2
  },
  "topic_descriptions": {
    "10": "deputy, workforce, payroll, scheduling, employees"
  },
  "framing_scores": {
    "framing_ethical": 0.6071428571428571,
    "framing_surveillance": 0.0,
    "framing_market": 0.3928571428571428,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "10": 12
    }
  },
  "sample_docs": [
    "Salary payments in 3 easy steps Add Employees Add employees to start paying them salaries with social security Approve Attendance Access geolocation and approve attendance Payouts Ensure secure payouts on the set payout date Salary payments in 3 easy steps Add Employees Add employees to start paying them salaries with social security Add employees to start paying them salaries with social security Approve Attendance Access geolocation and approve attendance Access geolocation and approve attendance Payouts Ensure secure payouts on the set payout date Ensure secure payouts on the set payout date How does it work? When you pay your employees using the TankhaPay, your employees receive their salaries in two parts- Their in-hand salary, which is directly transferred into their bank accounts and can be used for daily expenses. Contributions to government social security schemes of ESIC & EPF, through which they can receive benefits such as healthcare, retirement, insurance etc. The employer can calculate the in-hand salary, contributions to social security benefits, and total expense of each employee in seconds using our payout calculator. How does it work? When you pay your employees using the TankhaPay, your employees receive their salaries in two parts- Their in-hand salary, which is directly transferred into their bank accounts and can be used for daily expenses. Their in-hand salary, which is directly transferred into their bank accounts and can be used for daily expenses. Contributions to government social security schemes of ESIC & EPF, through which they can receive benefits such as healthcare, retirement, insurance etc. Contributions to government social security schemes of ESIC & EPF, through which they can receive benefits such as healthcare, retirement, insurance etc. The employer can calculate the in-hand salary, contributions to social security benefits, and total expense of each employee in seconds using our payout calculator. A seamless employee management experience Our unique technology ensures that you can retain, manage and secure your employees, all by paying them through the TankhaPay app Verify KYC Your employees will need to complete KYC in order to receive salaries through the TankhaPay app Payout Calculator Salary calculator allows you to create accurate salary structures for your employees in seconds Attendance Management Approve or bypass attendance, access the employees' geolocations and choose to pay them each month on your selected date. Auto Payouts Monthly payouts disbursed automatically on the selected date, directly in the employees' bank accounts Social Security Registration All employees will be automatically enrolled in government social security of PF and ESIC and therefore become eligible for benefits of medical, pension and insurance. Salary Slips Your employees will receive a salary slip, with a bifurcation of salary, social security benefits and taxes, thereby ensuring transparency A seamless employee management experience Our unique technology ensures that you can retain, manage and secure your employees, all by paying them through the TankhaPay app Your employees will need to complete KYC in order to receive salaries through the TankhaPay app Salary calculator allows you to create accurate salary structures for your employees in seconds Approve or bypass attendance, access the employees' geolocations and choose to pay them each month on your selected date. Monthly payouts disbursed automatically on the selected date, directly in the employees' bank accounts All employees will be automatically enrolled in government social security of PF and ESIC and therefore become eligible for benefits of medical, pension and insurance. Your employees will receive a salary slip, with a bifurcation of salary, social security benefits and taxes, thereby ensuring transparency Ensure a happier and more productive workplace! Use the TankhaPay app to pay salaries to your employees and ensure more regular and productive employees who want to stay longer and are more motivated to work. Ensure a happier and more productive workplace! Use the TankhaPay app to pay salaries to your employees and ensure more regular and productive employees who want to stay longer and are more motivated to work. Latest News The Economic Times Implementing labour reforms, expanding social security coverage for informal workers to be focus areas in 2023 The Times of India India to push for gig economy's social protection at G20 The Economic Times 94% of domestic workers worldwide lack comprehensive social security: ILO The Times of India",
    "EPF Glossary Having a regular source of income and an emergency fund as one ages and retires is crucial. It helps maintain one's quality of life and standard of living, ensuring that retirees aren't forced into poverty or forced to work even when their age doesn't permit. This is where government retirement and insurance benefits schemes like Employees' Provident Fund (EPF) scheme are extremely beneficial. Employees' Provident Fund (EPF) scheme is a self-financed, contribution-based long-term retirement, saving and insurance scheme. Glossary of Important EPF Employees The Employees' Provident Funds and Miscellaneous Provisions (EPF) Act, 1952 defines an employee as someone who is employed for wages/ salary in any kind of work, manual or clerical, in a company or establishment covered under the Act. The employee could get paid directly or indirectly by the employer. So, both permanent and temporary employees are included in the definition and so are those employed through a contractor. The Act also covers certain categories of workers such as apprentices, trainees, and casual laborers, provided they are engaged in work covered under the Act. Employers As per the EPF Act, an employer is any person who employs 20 or more employees in an establishment, engaged either directly or through a contractor. In some cases, an employer is also an establishment/ factory that employs less than 20 people as per the Act. The employer directly or indirectly pays the employees for their services. The employer is responsible for making contributions to the Employees' Provident Fund (EPF) on behalf of their employees, deducting the employee's share of the contribution from their salary, and depositing both the employer and employee contributions into the EPF account. In addition, the employer also contributes to the Employees' Pension Scheme (EPS) and the Employees' Deposit Linked Insurance Scheme (EDLI) for the benefit of their employees. Member The term member refers to an employee registered in the EPF scheme and is eligible to receive the benefits under the scheme. Nominee Nominee is the person nominated by the member to receive the benefits of EPF Scheme in the event of the member's death. The nominee could be a spouse, children, parents or dependent siblings. It is also possible to nominate more than one person as a nominee and specify their percentage share in the accumulated balance of the fund. Legal Heir If a member does not have a nominee, then the EPF Act specifies that the accumulated balance and benefits of the scheme will be transferred to the member's legal heir(s) after the member's death. The legal heir(s) can be determined based on the member's personal laws, such as the Hindu Succession Act, 1956, or the Indian Succession Act, 1925. The legal heirs can include the spouse, children, parents, and in some cases, dependent siblings of the deceased member. If there is more than one legal heir, the accumulated balance of the provident fund will be distributed among them as per the rules and regulations of the EPF scheme. The distribution of the provident fund may also be affected by the personal laws applicable to the deceased member. In such cases, the legal heirs may need to provide appropriate documentation and undertake legal formalities to claim the accumulated balance of the provident fund. Minor and Guardian A minor is a person who has not attained the age of majority, which is 18 years in India. If a member of the EPF scheme nominates a minor as a nominee, then an adult member of the family should be appointed as the guardian of the minor. In case of a member's death, the guardian will receive the accumulated balance of the provident fund on behalf of the minor. The guardian can be either a natural guardian, such as the father or mother, or a court-appointed guardian. If a member does not have a nominee and his/her legal heirs include a minor, then the legal heir who is appointed as the guardian of the minor will receive the accumulated balance of the provident fund on behalf of the minor. It is important to note that the guardian appointed for a minor should be an adult member of the family who is capable of acting as the guardian and is approved by the EPFO. The guardian is responsible for managing and utilizing the accumulated balance of the provident fund for the benefit of the minor until he/she attains majority. Establishment/ Factory Under the EPF Act, an establishment or factory is any place of business where 20 or more persons are employed. In certain specified cases, even those premises with less employees are considered establishments/ factories. The definition of an establishment or factory includes: Any office, including a branch office, or department of a factory or establishment, which is located within the premises of the factory or establishment or at any other place. Any establishment engaged in any industry specified in the First Schedule to the Act, such as manufacturing, mining, electricity generation, or construction. Any other establishment notified in the Official Gazette. It is important to note that establishments or factories with less than 20 employees can also voluntarily register themselves under the EPF Act and provide the benefits of the provident fund to their employees. Once registered, such establishments or factories will have to comply with all the rules and regulations of the EPF Act. EPFO The EPFO or Employees' Provident Fund Organisation is the statutory body established by the Government of India under the Employees' Provident Fund and Miscellaneous Provisions Act, 1952. Launched in 1951, this body is governed by the Ministry of Labour and Employment and is one of the largest social security organizations globally. The EPFO is responsible for managing and administering the EPF and other schemes for extending retirement, insurance and survivorship benefits to Indian and international workers while promoting savings. The 3 important schemes offered by the EPFO are: Employees' Provident Funds Scheme 1952 Employees' Pension Scheme 1995 Employees' Deposit Linked Insurance Scheme 1976 The EPFO is responsible for collecting contributions from the employers and employees of establishments and factories covered under the EPF Act, maintaining records of the contributions, and managing the investments of the contributions in a secure and efficient manner. The EPFO has regional offices and sub-regional offices across India to ensure efficient and effective implementation of the EPF scheme and other social security schemes. The EPFO also provides various services to the employees such as online access to EPF accounts, transfer of EPF accounts when changing jobs, partial or full withdrawal of funds for emergencies, etc. UAN The Universal Account Number (UAN) is a unique 12-digit number that is assigned by the EPFO to every member of the EPF scheme upon registration. Employers are required to register their employees for the UAN and provide the UAN to them within a specified time period. The UAN acts as a centralized number that links together all the member IDs of the EPF scheme that an employee may have during their career. It remains the same throughout an employee's career, irrespective of whether they change jobs or locations within India. The UAN enables the EPFO to provide various services to the members of the EPF scheme, such as: Online access to their EPF account, which includes details such as the accumulated balance, contributions made, and withdrawals. Easy transfer of their EPF account when changing jobs. Seamless withdrawal of their EPF account balance when they retire or leave the workforce. Linking of other EPF-related services, such as the Employee's Pension Scheme (EPS) and the Employees' Deposit Linked Insurance (EDLI) Scheme. Contribution Contributions under the EPF Act refer to the contribution payable by the employer and employee towards the EPF and other schemes. Being a self-financed, contribution-based scheme, EPF contributions are mandatory for both employers and employees, but the rate of contribution varies. For all employees earning upto Rs.15000 (basic wage + dearness allowance), employer and employee contributions are compulsory. When an employee is already an EPFO member but earns more than Rs.15000 as monthly income, the contributions are made only for the first Rs.15000. Contributions are voluntary for non-members earning more than Rs.15000. The rate of contribution for employees is fixed at 12% on the total of basic wage, dearness allowance and retaining allowance. While 12% is the mandatory rate, they can choose to contribute higher too. The employer's contribution is 13%, divided as: 8.33% towards the Employees' Pension Scheme 3.67% towards the EPF scheme 0.5% contribution towards EDLI 0.5% towards admin charges If the organization has less than 20 employees and meets certain conditions, then the contribution can be limited to 10% for both employees and employers. Coverage The EPF scheme applies to all factories and establishments with 20 or more employees (in notified industries less than 20 employees) across the whole territory of India except for Jammu and Kashmir. International workers and contract workers who are working in establishments or factories covered under the EPF Act are also covered under the scheme. It is important to note that the EPF Act does not apply to certain categories of employees, such as apprentices, casual workers, daily wage workers and household workers. However, employers can voluntarily extend the benefits of the EPF scheme to these employees using the TankhaPay app. The app enables even individual households and small home businesses to enrol their employees to the EPF scheme and help them secure their future. EPF Deduction The EPF scheme mandates employers to deduct 12% of an employee's monthly income (basic wages + dearness allowances + retaining allowance) and deposit it into their EPFO account as the employee's contribution. This is known as the EPF deduction. Together with the deposit of the EPF deduction, the employer contributes 13% into the employee's EPF account. The EPF deduction is a valuable benefit for employees as it helps them save for their retirement and socio-economic eventualities, and the interest earned on the contributions is tax-free. Strategic Asset Allocation The EPFO is responsible for managing the investments of the corpus funds in a secure and efficient manner. To generate optimal returns while maintaining a reasonable level of risk, the contributions are invested in various asset classes, including equities, debt securities, and government bonds, among others. The EPFO decides the strategic asset allocation among these different asset classes based on a number of factors like the current economic environment, market conditions, corpus size, etc. As of 2021, the EPFO invests up to 15% of the EPF corpus in equities, while the rest is invested in debt securities, government bonds, and other fixed-income instruments. The EPFO periodically reviews the strategic asset allocation and may make changes based on market conditions and other factors. Basic Wage Basic wages under the EPF Act refer to all emoluments paid to the employee as per the of their contract of employment, excluding allowances and other emoluments such as – food concessions, overtime allowances, commissions, bonuses, house-rent allowances, medical allowances, presents, etc. The basic wages together with dearness and retaining allowances are used to calculate the contributions to be made. Wage period Wage period is the time period for which wages are paid to the employee as specified in the of the employment contract. This could be weekly, monthly, daily or even for a contract period. Withdrawal The EPF scheme allows full withdrawal of funds only upon retirement or unemployment that exceeds a period of 2 months. However, partial withdrawal of funds, upto 75%, is possible under the following conditions: Education or marriage of children Marriage of self/ sibling Housing loan repayment – partial or full Home repairs or alterations Construction or purchase of a house Medical treatment of member or their family members So, EPF serves as an emergency fund for members in times of personal emergencies or socio-economic eventualities such as the Covid pandemic or a natural disaster. Monthly Interest Rate The EPF Scheme ensures capital appreciation for its members by providing a tax-free, pre-fixed interest on the deposits held by EPFO. The government sets and revises this interest rate from time to time based on the revenues earned by the EPFO. Pensions Pensions are an important retirement benefit offered by the EPF scheme. In India, the Employees' Provident Fund (EPF) scheme provides a pension scheme known as the Employees' Pension Scheme (EPS). Every month 8.33% of the employee's earnings go into this scheme. To be eligible for an EPS pension, an employee must have been a member of the EPF for at least 10 years and have reached the age of 58 years. The pension amount is based on the employee's years of service and their average salary in the last 12 months of service. The minimum pension amount guaranteed under the scheme is Rs. 1,000 per month. The pension amount is calculated as a percentage of the average monthly salary and is subject to a maximum limit. The pensionable salary is limited to Rs. 15,000 per month, and the maximum pension amount that can be received is Rs. 7,500 per month. Life Insurance Each month the employer contributes 0.5% of the basic wages into the Employees' Deposit Linked Insurance (EDLI) Scheme to extend life insurance benefits to employees. On the death of an EPFO member (in service), their nominee gets a lumpsum life insurance of up to Rs. 7 lakhs. In addition, the widow/widower and dependent children of the deceased EPFO member receive monthly pensions of Rs.1000 each. Transfers The EPF scheme allows for the transfer of EPF accounts between employers, thereby ensuring continuity of retirement savings for employees who change jobs. EPF transfers can be initiated by the employee or the employer. When an employee joins a new organization, they are required to provide their EPF account details to the new employer. The new employer then initiates a transfer request to the EPF organization, requesting the transfer of the employee's EPF account from the previous employer to the new employer. The EPF transfer process can be done either online or offline. Transfers can be completed within a few weeks of the transfer request being initiated. The EPF organization provides an online facility to track the status of the transfer request. Penalties In case of non-compliance, the employer is required to pay a penalty to the EPFO. Conclusion In India, 90% of the workforce is employed in the informal sector. A large part of the meagre income of these workers goes into sustenance, medical bills and debts, leaving them with very little savings and emergency funds. Government retirement and insurance scheme such as the EPF provide these workers with a guaranteed source of retirement income and a safety cushion to face personal emergencies and contingencies, reducing financial vulnerabilities and the instances of poverty among the elderly population. However, the scheme is not accessible to these informal workers, especially those working in households and home-based businesses. With the TankhaPay app, even households and smaller businesses can make retirement and insurance benefits accessible to all their workers and support staff. Download the app now and help secure the future of all your employees. Having a regular source of income and an emergency fund as one ages and retires is crucial. It helps maintain one's quality of life and standard of living, ensuring that retirees aren't forced into poverty or forced to work even when their age doesn't permit. This is where government retirement and insurance benefits schemes like Employees' Provident Fund (EPF) scheme are extremely beneficial. Employees' Provident Fund (EPF) scheme is a self-financed, contribution-based long-term retirement, saving and insurance scheme. Glossary of Important EPF The Employees' Provident Funds and Miscellaneous Provisions (EPF) Act, 1952 defines an employee as someone who is employed for wages/ salary in any kind of work, manual or clerical, in a company or establishment covered under the Act. The employee could get paid directly or indirectly by the employer. So, both permanent and temporary employees are included in the definition and so are those employed through a contractor. The Act also covers certain categories of workers such as apprentices, trainees, and casual laborers, provided they are engaged in work covered under the Act. As per the EPF Act, an employer is any person who employs 20 or more employees in an establishment, engaged either directly or through a contractor. In some cases, an employer is also an establishment/ factory that employs less than 20 people as per the Act. The employer directly or indirectly pays the employees for their services. The employer is responsible for making contributions to the Employees' Provident Fund (EPF) on behalf of their employees, deducting the employee's share of the contribution from their salary, and depositing both the employer and employee contributions into the EPF account. In addition, the employer also contributes to the Employees' Pension Scheme (EPS) and the Employees' Deposit Linked Insurance Scheme (EDLI) for the benefit of their employees. The term member refers to an employee registered in the EPF scheme and is eligible to receive the benefits under the scheme. Nominee is the person nominated by the member to receive the benefits of EPF Scheme in the event of the member's death. The nominee could be a spouse, children, parents or dependent siblings. It is also possible to nominate more than one person as a nominee and specify their percentage share in the accumulated balance of the fund. If a member does not have a nominee, then the EPF Act specifies that the accumulated balance and benefits of the scheme will be transferred to the member's legal heir(s) after the member's death. The legal heir(s) can be determined based on the member's personal laws, such as the Hindu Succession Act, 1956, or the Indian Succession Act, 1925. The legal heirs can include the spouse, children, parents, and in some cases, dependent siblings of the deceased member. If there is more than one legal heir, the accumulated balance of the provident fund will be distributed among them as per the rules and regulations of the EPF scheme. The distribution of the provident fund may also be affected by the personal laws applicable to the deceased member. In such cases, the legal heirs may need to provide appropriate documentation and undertake legal formalities to claim the accumulated balance of the provident fund. A minor is a person who has not attained the age of majority, which is 18 years in India. If a member of the EPF scheme nominates a minor as a nominee, then an adult member of the family should be appointed as the guardian of the minor. In case of a member's death, the guardian will receive the accumulated balance of the provident fund on behalf of the minor. The guardian can be either a natural guardian, such as the father or mother, or a court-appointed guardian. If a member does not have a nominee and his/her legal heirs include a minor, then the legal heir who is appointed as the guardian of the minor will receive the accumulated balance of the provident fund on behalf of the minor. It is important to note that the guardian appointed for a minor should be an adult member of the family who is capable of acting as the guardian and is approved by the EPFO. The guardian is responsible for managing and utilizing the accumulated balance of the provident fund for the benefit of the minor until he/she attains majority. Under the EPF Act, an establishment or factory is any place of business where 20 or more persons are employed. In certain specified cases, even those premises with less employees are considered establishments/ factories. The definition of an establishment or factory includes: Any office, including a branch office, or department of a factory or establishment, which is located within the premises of the factory or establishment or at any other place. Any office, including a branch office, or department of a factory or establishment, which is located within the premises of the factory or establishment or at any other place. Any establishment engaged in any industry specified in the First Schedule to the Act, such as manufacturing, mining, electricity generation, or construction. Any establishment engaged in any industry specified in the First Schedule to the Act, such as manufacturing, mining, electricity generation, or construction. Any other establishment notified in the Official Gazette. Any other establishment notified in the Official Gazette. It is important to note that establishments or factories with less than 20 employees can also voluntarily register themselves under the EPF Act and provide the benefits of the provident fund to their employees. Once registered, such establishments or factories will have to comply with all the rules and regulations of the EPF Act. The EPFO or Employees' Provident Fund Organisation is the statutory body established by the Government of India under the Employees' Provident Fund and Miscellaneous Provisions Act, 1952. Launched in 1951, this body is governed by the Ministry of Labour and Employment and is one of the largest social security organizations globally. The EPFO is responsible for managing and administering the EPF and other schemes for extending retirement, insurance and survivorship benefits to Indian and international workers while promoting savings. The 3 important schemes offered by the EPFO are: Employees' Provident Funds Scheme 1952 Employees' Provident Funds Scheme 1952 Employees' Pension Scheme 1995 Employees' Pension Scheme 1995 Employees' Deposit Linked Insurance Scheme 1976 Employees' Deposit Linked Insurance Scheme 1976 The EPFO is responsible for collecting contributions from the employers and employees of establishments and factories covered under the EPF Act, maintaining records of the contributions, and managing the investments of the contributions in a secure and efficient manner. The EPFO has regional offices and sub-regional offices across India to ensure efficient and effective implementation of the EPF scheme and other social security schemes. The EPFO also provides various services to the employees such as online access to EPF accounts, transfer of EPF accounts when changing jobs, partial or full withdrawal of funds for emergencies, etc. The Universal Account Number (UAN) is a unique 12-digit number that is assigned by the EPFO to every member of the EPF scheme upon registration. Employers are required to register their employees for the UAN and provide the UAN to them within a specified time period. The UAN acts as a centralized number that links together all the member IDs of the EPF scheme that an employee may have during their career. It remains the same throughout an employee's career, irrespective of whether they change jobs or locations within India. The UAN enables the EPFO to provide various services to the members of the EPF scheme, such as: Online access to their EPF account, which includes details such as the accumulated balance, contributions made, and withdrawals. Online access to their EPF account, which includes details such as the accumulated balance, contributions made, and withdrawals. Easy transfer of their EPF account when changing jobs. Easy transfer of their EPF account when changing jobs. Seamless withdrawal of their EPF account balance when they retire or leave the workforce. Seamless withdrawal of their EPF account balance when they retire or leave the workforce. Linking of other EPF-related services, such as the Employee's Pension Scheme (EPS) and the Employees' Deposit Linked Insurance (EDLI) Scheme. Linking of other EPF-related services, such as the Employee's Pension Scheme (EPS) and the Employees' Deposit Linked Insurance (EDLI) Scheme. Contributions under the EPF Act refer to the contribution payable by the employer and employee towards the EPF and other schemes. Being a self-financed, contribution-based scheme, EPF contributions are mandatory for both employers and employees, but the rate of contribution varies. For all employees earning upto Rs.15000 (basic wage + dearness allowance), employer and employee contributions are compulsory. When an employee is already an EPFO member but earns more than Rs.15000 as monthly income, the contributions are made only for the first Rs.15000. Contributions are voluntary for non-members earning more than Rs.15000. The rate of contribution for employees is fixed at 12% on the total of basic wage, dearness allowance and retaining allowance. While 12% is the mandatory rate, they can choose to contribute higher too. The employer's contribution is 13%, divided as: 8.33% towards the Employees' Pension Scheme 8.33% towards the Employees' Pension Scheme 3.67% towards the EPF scheme 3.67% towards the EPF scheme 0.5% contribution towards EDLI 0.5% contribution towards EDLI 0.5% towards admin charges 0.5% towards admin charges If the organization has less than 20 employees and meets certain conditions, then the contribution can be limited to 10% for both employees and employers. The EPF scheme applies to all factories and establishments with 20 or more employees (in notified industries less than 20 employees) across the whole territory of India except for Jammu and Kashmir. International workers and contract workers who are working in establishments or factories covered under the EPF Act are also covered under the scheme. It is important to note that the EPF Act does not apply to certain categories of employees, such as apprentices, casual workers, daily wage workers and household workers. However, employers can voluntarily extend the benefits of the EPF scheme to these employees using the TankhaPay app. The app enables even individual households and small home businesses to enrol their employees to the EPF scheme and help them secure their future. The EPF scheme mandates employers to deduct 12% of an employee's monthly income (basic wages + dearness allowances + retaining allowance) and deposit it into their EPFO account as the employee's contribution. This is known as the EPF deduction. Together with the deposit of the EPF deduction, the employer contributes 13% into the employee's EPF account. The EPF deduction is a valuable benefit for employees as it helps them save for their retirement and socio-economic eventualities, and the interest earned on the contributions is tax-free. The EPFO is responsible for managing the investments of the corpus funds in a secure and efficient manner. To generate optimal returns while maintaining a reasonable level of risk, the contributions are invested in various asset classes, including equities, debt securities, and government bonds, among others. The EPFO decides the strategic asset allocation among these different asset classes based on a number of factors like the current economic environment, market conditions, corpus size, etc. As of 2021, the EPFO invests up to 15% of the EPF corpus in equities, while the rest is invested in debt securities, government bonds, and other fixed-income instruments. The EPFO periodically reviews the strategic asset allocation and may make changes based on market conditions and other factors. Basic wages under the EPF Act refer to all emoluments paid to the employee as per the of their contract of employment, excluding allowances and other emoluments such as – food concessions, overtime allowances, commissions, bonuses, house-rent allowances, medical allowances, presents, etc. The basic wages together with dearness and retaining allowances are used to calculate the contributions to be made. Wage period is the time period for which wages are paid to the employee as specified in the of the employment contract. This could be weekly, monthly, daily or even for a contract period. The EPF scheme allows full withdrawal of funds only upon retirement or unemployment that exceeds a period of 2 months. However, partial withdrawal of funds, upto 75%, is possible under the following conditions: Education or marriage of children Education or marriage of children Marriage of self/ sibling Marriage of self/ sibling Housing loan repayment – partial or full Housing loan repayment – partial or full Home repairs or alterations Home repairs or alterations Construction or purchase of a house Construction or purchase of a house Medical treatment of member or their family members Medical treatment of member or their family members So, EPF serves as an emergency fund for members in times of personal emergencies or socio-economic eventualities such as the Covid pandemic or a natural disaster. The EPF Scheme ensures capital appreciation for its members by providing a tax-free, pre-fixed interest on the deposits held by EPFO. The government sets and revises this interest rate from time to time based on the revenues earned by the EPFO. Pensions are an important retirement benefit offered by the EPF scheme. In India, the Employees' Provident Fund (EPF) scheme provides a pension scheme known as the Employees' Pension Scheme (EPS). Every month 8.33% of the employee's earnings go into this scheme. To be eligible for an EPS pension, an employee must have been a member of the EPF for at least 10 years and have reached the age of 58 years. The pension amount is based on the employee's years of service and their average salary in the last 12 months of service. The minimum pension amount guaranteed under the scheme is Rs. 1,000 per month. The pension amount is calculated as a percentage of the average monthly salary and is subject to a maximum limit. The pensionable salary is limited to Rs. 15,000 per month, and the maximum pension amount that can be received is Rs. 7,500 per month. Each month the employer contributes 0.5% of the basic wages into the Employees' Deposit Linked Insurance (EDLI) Scheme to extend life insurance benefits to employees. On the death of an EPFO member (in service), their nominee gets a lumpsum life insurance of up to Rs. 7 lakhs. In addition, the widow/widower and dependent children of the deceased EPFO member receive monthly pensions of Rs.1000 each. The EPF scheme allows for the transfer of EPF accounts between employers, thereby ensuring continuity of retirement savings for employees who change jobs. EPF transfers can be initiated by the employee or the employer. When an employee joins a new organization, they are required to provide their EPF account details to the new employer. The new employer then initiates a transfer request to the EPF organization, requesting the transfer of the employee's EPF account from the previous employer to the new employer. The EPF transfer process can be done either online or offline. Transfers can be completed within a few weeks of the transfer request being initiated. The EPF organization provides an online facility to track the status of the transfer request. In case of non-compliance, the employer is required to pay a penalty to the EPFO. In India, 90% of the workforce is employed in the informal sector. A large part of the meagre income of these workers goes into sustenance, medical bills and debts, leaving them with very little savings and emergency funds. Government retirement and insurance scheme such as the EPF provide these workers with a guaranteed source of retirement income and a safety cushion to face personal emergencies and contingencies, reducing financial vulnerabilities and the instances of poverty among the elderly population. However, the scheme is not accessible to these informal workers, especially those working in households and home-based businesses. With the TankhaPay app, even households and smaller businesses can make retirement and insurance benefits accessible to all their workers and support staff. Download the app now and help secure the future of all your employees.",
    "A secure, organised way to collect, store, and update employee information—from onboarding to exit. It reduces errors, supports compliance, and ensures accurate data is always at hand for better HR decisions. What is Employee Data Management? Employee Data Management keeps essential records organised, secure, and easy to access. Modern HR systems replace paper files and spreadsheets with digital tools that reduce paperwork, improve accuracy, and simplify daily HR tasks. Why Is It Important? Managing employee data is more than just about keeping records. It helps HR handle payroll, benefits, compliance, and performance tracking. A good system positively minimises issues like Repeated or missing data Payroll or benefits delays Missed steps during audits Hard to track employee updates Key Aspects of Employee Data Management Who Can See What Maintain a comprehensive, single source of truth for every employee. Personal and contact details Bank and statutory information Employment history and job role Skills, certifications, and experience Store and access employee documents securely from one place. Offer letters and contracts. ID proofs and compliance forms Performance reviews and exit documents Secure upload and version tracking Who Can See What Ensure data privacy and restrict visibility based on roles. HR sees all records Managers see their team's data Logs track every change Employees update their own info (if permitted) Keep records current throughout the employee lifecycle. Update status during transfers or exits Reflect changes in role, salary, or team Connect data between attendance, payroll, and compliance Maintain statutory records required under employment laws. Address proof, PAN, Aadhaar, and UAN PF, ESI, and income tax records Historical logs of changes Auto-alerts for missing or outdated data Quickly locate employee data or generate reports as needed. Configurable dashboards for HR insights Exportable formats for audit, payroll, or MIS Quickly locate employee data or generate reports as needed. Benefits of a Robust Employee Data Management System Managing employee data well keeps HR smooth and reliable. A single system saves time, improves accuracy, and supports compliance. Accurate payroll and attendance Time saved for HR teams What Kind of Data Is Typically Managed? An employee data management system covers a wide range of information, including: Things to Consider When Choosing a Data Management System When picking a system to manage employee data, choose one that suits your needs. Make sure it keeps data secure, makes daily tasks simpler, and can grow with your business. Data should be updated in real time as changes occur, such as promotions, address changes, or benefit updates. Many systems allow employees to update their own basic details. Yes. Most systems offer self-service portals where employees can view or request updates to their records. Exit data is stored securely for record-keeping, final settlements, and audit purposes. Retention periods may vary based on company policy and legal requirements While India does not yet have a standalone data protection law, companies are expected to handle employee data responsibly under various labour regulations and upcoming data protection guidelines. With synced records of working days, attendance, and statutory details, payroll calculations are based on real-time, accurate inputs.s",
    "Why Do You Need a Payroll Software? The world has become such that every minute counts, manual payroll processing is the old ball and chain holding you back. TankhaPay is your key to unlocking a world where payroll is not a headache but a breeze. Here's why you need this revolutionary payrolling software: Precision and Accuracy Bid farewell to calculation errors and tedious manual entries. TankhaPay ensures that every digit aligns seamlessly, leaving no room for payroll mishaps. Time is Money Stop drowning in paperwork. TankhaPay automates the entire payroll process, letting you focus on what matters – growing your business. Save time, save effort, and save money. Tax Hassles? No More TankhaPay keeps you tax-compliant effortlessly. Say goodbye to the headache of tax calculations and filings – our software ensures you're always on the right side of the taxman. Employee Happiness Happy employees make a thriving business. TankhaPay ensures timely and accurate salary disbursals, contributing to a positive work environment. Stay Ahead of Regulations In a world of ever-changing regulations, TankhaPay is your compass. Stay ahead of compliance requirements without breaking a sweat. Data Security is Paramount Your data is your treasure. TankhaPay employs state-of-the-art security measures, keeping your payroll data safe and sound. Embrace the future of payroll management with TankhaPay – where simplicity meets efficiency, and your payroll becomes a strategic asset rather than a liability. Say yes to progress. Say yes to TankhaPay! Why Do You Need a Payroll Software? The world has become such that every minute counts, manual payroll processing is the old ball and chain holding you back. TankhaPay is your key to unlocking a world where payroll is not a headache but a breeze. Here's why you need this revolutionary payrolling software: Bid farewell to calculation errors and tedious manual entries. TankhaPay ensures that every digit aligns seamlessly, leaving no room for payroll mishaps. Stop drowning in paperwork. TankhaPay automates the entire payroll process, letting you focus on what matters – growing your business. Save time, save effort, and save money. TankhaPay keeps you tax-compliant effortlessly. Say goodbye to the headache of tax calculations and filings – our software ensures you're always on the right side of the taxman. Happy employees make a thriving business. TankhaPay ensures timely and accurate salary disbursals, contributing to a positive work environment. In a world of ever-changing regulations, TankhaPay is your compass. Stay ahead of compliance requirements without breaking a sweat. Your data is your treasure. TankhaPay employs state-of-the-art security measures, keeping your payroll data safe and sound. Embrace the future of payroll management with TankhaPay – where simplicity meets efficiency, and your payroll becomes a strategic asset rather than a liability. Say yes to progress. Say yes to TankhaPay! Why is TankhaPay Your Ultimate Payrolling Software Choice? There is an abundance in the market for Payrolling Software, but here's why TankhaPay stands tall as an unrivalled choice: Seamless Integration TankhaPay effortlessly integrates with your existing systems, making the transition smooth and painless. There are no more disruptions – just pure payroll synergy. User-Friendly Interface Say goodbye to complexity. TankhaPay boasts a user-friendly interface designed for ease of use. Navigate through your payroll tasks with simplicity and speed. Tailored to Your Business Every business is unique, and TankhaPay understands that. Enjoy the flexibility of customisation, ensuring that your payrolling processes align perfectly with your business requirements. Easy Compliance EPF and ESI laws and regulations can be a maze, but TankhaPay is your guide. Stay compliant effortlessly, with the software staying updated to the latest regulatory changes. Comprehensive Support Your success is our priority. TankhaPay offers the best customer support, promptly addressing any query or concern. Constant Innovation The tech world is dynamic, and TankhaPay doesn't stand still. Benefit from regular updates and innovative features, keeping your payroll system future-proof. Choosing a payrolling software isn't just a decision – it's an investment in the efficiency and success of your business. Opt for TankhaPay and make the smart choice today! Why is TankhaPay Your Ultimate Payrolling Software Choice? There is an abundance in the market for Payrolling Software, but here's why TankhaPay stands tall as an unrivalled choice: TankhaPay effortlessly integrates with your existing systems, making the transition smooth and painless. There are no more disruptions – just pure payroll synergy. Say goodbye to complexity. TankhaPay boasts a user-friendly interface designed for ease of use. Navigate through your payroll tasks with simplicity and speed. Tailored to Your Business Every business is unique, and TankhaPay understands that. Enjoy the flexibility of customisation, ensuring that your payrolling processes align perfectly with your business requirements. EPF and ESI laws and regulations can be a maze, but TankhaPay is your guide. Stay compliant effortlessly, with the software staying updated to the latest regulatory changes. Your success is our priority. TankhaPay offers the best customer support, promptly addressing any query or concern. The tech world is dynamic, and TankhaPay doesn't stand still. Benefit from regular updates and innovative features, keeping your payroll system future-proof. Choosing a payrolling software isn't just a decision – it's an investment in the efficiency and success of your business. Opt for TankhaPay and make the smart choice today! What Do We Do? TankhaPay ensures efficiency, accuracy, and peace of mind for your business. User-Friendly Onboarding Make your payrolling journey effortlessly. TankhaPay's user-friendly onboarding process ensures a smooth transition with minimal disruption to your ongoing operations. Real-Time Data Accessibility Stay informed and in control. TankhaPay provides real-time access to crucial payroll data, empowering you to make informed decisions and respond promptly to any changes. Automated Payroll Processing Say goodbye to manual calculations and hello to efficiency. TankhaPay automates payroll processing, ensuring accurate and timely salary calculations, tax deductions, and compliance with regulatory requirements. Compliance Made Easy Ensure your business stays compliant by staying updated with the latest regulations, minimising the risk of penalties and legal complications. TankhaPay is your ally in streamlining EPF and ESI compliance for a hassle-free payroll management experience. Secure Payouts Security is non-negotiable. TankhaPay guarantees secure automated payouts, providing your employees with peace of mind while ensuring that payments are made swiftly. Managing payroll has never been this seamless. TankhaPay's payrolling software is your trusted partner. Revolutionise your payrolling experience with TankhaPay today! What Do We Do? TankhaPay ensures efficiency, accuracy, and peace of mind for your business. Make your payrolling journey effortlessly. TankhaPay's user-friendly onboarding process ensures a smooth transition with minimal disruption to your ongoing operations. Stay informed and in control. TankhaPay provides real-time access to crucial payroll data, empowering you to make informed decisions and respond promptly to any changes. Say goodbye to manual calculations and hello to efficiency. TankhaPay automates payroll processing, ensuring accurate and timely salary calculations, tax deductions, and compliance with regulatory requirements. Ensure your business stays compliant by staying updated with the latest regulations, minimising the risk of penalties and legal complications. TankhaPay is your ally in streamlining EPF and ESI compliance for a hassle-free payroll management experience. Security is non-negotiable. TankhaPay guarantees secure automated payouts, providing your employees with peace of mind while ensuring that payments are made swiftly. Managing payroll has never been this seamless. TankhaPay's payrolling software is your trusted partner. Revolutionise your payrolling experience with TankhaPay today! Some of our prestigious customers Some of our prestigious customers Frequently Asked Questions about HR & Payroll Software How Does Payroll Software Work? Payroll Software automates various payroll tasks by processing employee data, calculating salaries, and ensuring compliance with tax regulations. It simplifies the payroll process, minimising manual efforts and reducing the likelihood of errors. What is the Purpose of Payroll Software? The primary purpose of Payroll Software is to simplify and enhance payroll management. It saves time, reduces errors, and ensures businesses stay compliant with tax regulations, allowing them to focus on strategic activities. How Does Payroll Software Help Startup Businesses? Payroll Software is particularly beneficial for startups, offering a cost-effective and efficient solution. Automating payroll tasks eliminates manual work, reduces errors, and ensures startups comply with tax regulations. What are the Benefits of Payroll Software? Efficiency: Streamlines the payroll process, saving time. Accuracy: Minimizes errors associated with manual calculations. Compliance: Keeps businesses up-to-date with tax regulations. Integration: Seamlessly integrates with other business systems. Security: Ensures secure handling of sensitive salary information. What are the Main Features of Payroll Software? Automated Payroll Processing Tax Compliance Tools Employee Self-Service Portals Customisable Reporting Data Security Measures Which is the Best Payroll Software? Selecting the best payroll software depends on specific business needs. Consider user-friendly interfaces, customisable features, and continuous innovation when choosing the right solution. How Do Small Businesses Do Payroll? Small businesses can leverage payroll software by inputting employee data, setting up parameters, and letting the software automate the process. It offers scalability to adapt to changing business needs. What Are the Four Types of Payroll? Full-Service Payroll Self-Service Payroll Online Payroll In-House Payroll Each type caters to different business requirements, providing flexibility and customisation options. Frequently Asked Questions about HR & Payroll Software How Does Payroll Software Work? Payroll Software automates various payroll tasks by processing employee data, calculating salaries, and ensuring compliance with tax regulations. It simplifies the payroll process, minimising manual efforts and reducing the likelihood of errors. What is the Purpose of Payroll Software? The primary purpose of Payroll Software is to simplify and enhance payroll management. It saves time, reduces errors, and ensures businesses stay compliant with tax regulations, allowing them to focus on strategic activities. How Does Payroll Software Help Startup Businesses? Payroll Software is particularly beneficial for startups, offering a cost-effective and efficient solution. Automating payroll tasks eliminates manual work, reduces errors, and ensures startups comply with tax regulations. What are the Benefits of Payroll Software? Efficiency: Streamlines the payroll process, saving time. Efficiency: Streamlines the payroll process, saving time. Accuracy: Minimizes errors associated with manual calculations. Accuracy: Minimizes errors associated with manual calculations. Compliance: Keeps businesses up-to-date with tax regulations. Compliance: Keeps businesses up-to-date with tax regulations. Integration: Seamlessly integrates with other business systems. Integration: Seamlessly integrates with other business systems. Security: Ensures secure handling of sensitive salary information. Security: Ensures secure handling of sensitive salary information. What are the Main Features of Payroll Software? Which is the Best Payroll Software? Selecting the best payroll software depends on specific business needs. Consider user-friendly interfaces, customisable features, and continuous innovation when choosing the right solution. How Do Small Businesses Do Payroll? Small businesses can leverage payroll software by inputting employee data, setting up parameters, and letting the software automate the process. It offers scalability to adapt to changing business needs. What Are the Four Types of Payroll? Each type caters to different business requirements, providing flexibility and customisation options.",
    "Tailor-made HR solutions for Large Enterprises Enhance your organisation's capabilities with customised HR tech designed to meet the complex needs of large-scale operations Tailored Functionality Get exactly what you need from your HRMS, with features designed to match your unique business requirements. Competitive Advantage Stand out in the marketplace by leveraging HR tech that supports strategic business advantages and innovation. Scalable Growth Prepare for future expansion with an HRIS that scales alongside your business, adapting to changing demands. Enhanced Efficiency Streamline processes and reduce manual efforts with an HR cloud customised to your operational needs. Tailor-made HR solutions for Large Enterprises Enhance your organisation's capabilities with customised HR tech designed to meet the complex needs of large-scale operations Get exactly what you need from your HRMS, with features designed to match your unique business requirements. Stand out in the marketplace by leveraging HR tech that supports strategic business advantages and innovation. Prepare for future expansion with an HRIS that scales alongside your business, adapting to changing demands. Streamline processes and reduce manual efforts with an HR cloud customised to your operational needs. Consulting Services Have a custom HRMS built to your needs with our expert consulting services. We'll assess your business needs, meticulously define the scope of your project, and strategize the perfect implementation plan. Optimise your workflows through business process reengineering before they're automated or customised in your system, setting the stage for seamless efficiency. Have a custom HRMS built to your needs with our expert consulting services. We'll assess your business needs, meticulously define the scope of your project, and strategize the perfect implementation plan. Optimise your workflows through business process reengineering before they're automated or customised in your system, setting the stage for seamless efficiency. Custom Development Enhance HR by using our software tailored to your business's specific needs. We can add custom features, modify workflows, or develop new modules to align more closely with your operational requirements. Our flexible platform ensures that your HR cloud evolves with your business, providing scalability and continued relevance. Enhance HR by using our software tailored to your business's specific needs. We can add custom features, modify workflows, or develop new modules to align more closely with your operational requirements. Our flexible platform ensures that your HR cloud evolves with your business, providing scalability and continued relevance. Integrations Integrate Tankha Pay with your ERP, CRM, biometric or face recognition devices, and other software systems for smoother workflows. We offer custom solutions to ensure seamless connectivity across your operational ecosystem. Enhance your workflow efficiency with tailored integrations. Integrate Tankha Pay with your ERP, CRM, biometric or face recognition devices, and other software systems for smoother workflows. We offer custom solutions to ensure seamless connectivity across your operational ecosystem. Enhance your workflow efficiency with tailored integrations. Support and Maintenance Ensure your custom HRIS performs optimally with our ongoing support and maintenance services. We're here to address issues, update functionalities, and continuously adapt to your evolving business needs. Stay ahead with reliable support. Ensure your custom HRIS performs optimally with our ongoing support and maintenance services. We're here to address issues, update functionalities, and continuously adapt to your evolving business needs. Stay ahead with reliable support. Training and Implementation Maximise the effectiveness of your HR cloud with our comprehensive training and implementation services. We provide user training, detailed documentation, and support during the rollout of new features to ensure a smooth transition and optimal use. Maximise the effectiveness of your HR cloud with our comprehensive training and implementation services. We provide user training, detailed documentation, and support during the rollout of new features to ensure a smooth transition and optimal use. Frequently Asked Questions What are custom HR solutions? Tankha Pay offers custom HR solutions tailored to your business requirements. Our services include customising our HR cloud to fit your specific needs, whether it involves adding new features, modifying existing ones, or integrating with other systems. Additionally, we provide consulting services and training to ensure your HR software operates effectively and meets your organisational goals. How can tailor-made HR solutions benefit my organisation? Customising HRMS allows you to optimise your processes according to your specific business needs, leading to enhanced efficiency and scalable growth. This tailored approach not only improves operational effectiveness but also provides a competitive edge in your industry. What does the customisation process involve? The customisation process begins with a thorough understanding of your HR software needs, followed by suggesting and implementing appropriate solutions. Once these solutions are in place, our team will ensure that you and your team are fully trained to operate the system effectively. Can you integrate your HR solutions with other software? Yes, Tankha Pay can be integrated with other softwares including, CRMs, ERPs, and even biometric, retina and face recognition machines. What kind of support can I expect after implementation? Our dedicated team will be on hand to provide support for any issues you encounter and assist in maintaining your system. We also offer comprehensive training to ensure you can fully leverage the capabilities of the HRIS, optimising its effectiveness for your business. What are custom HR solutions? Tankha Pay offers custom HR solutions tailored to your business requirements. Our services include customising our HR cloud to fit your specific needs, whether it involves adding new features, modifying existing ones, or integrating with other systems. Additionally, we provide consulting services and training to ensure your HR software operates effectively and meets your organisational goals. How can tailor-made HR solutions benefit my organisation? Customising HRMS allows you to optimise your processes according to your specific business needs, leading to enhanced efficiency and scalable growth. This tailored approach not only improves operational effectiveness but also provides a competitive edge in your industry. What does the customisation process involve? The customisation process begins with a thorough understanding of your HR software needs, followed by suggesting and implementing appropriate solutions. Once these solutions are in place, our team will ensure that you and your team are fully trained to operate the system effectively. Can you integrate your HR solutions with other software? Yes, Tankha Pay can be integrated with other softwares including, CRMs, ERPs, and even biometric, retina and face recognition machines. What kind of support can I expect after implementation? Our dedicated team will be on hand to provide support for any issues you encounter and assist in maintaining your system. We also offer comprehensive training to ensure you can fully leverage the capabilities of the HRIS, optimising its effectiveness for your business. Tailor your HR software to fit your business requirements! Unlock the full potential of your workforce with HR tech that's customised to align perfectly with your business objectives Request a Demo Tailor your HR software to fit your business requirements! Unlock the full potential of your workforce with HR tech that's customised to align perfectly with your business objectives"
  ]
}