{
  "company": "www.vaultid.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5714285714285714,
    "framing_surveillance": 0.0,
    "framing_market": 0.4285714285714285,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Enabling Financial Inclusion for the Unbanked Enabling Financial Inclusion for the Unbanked fingerprint myVault Using myVault I build and manage my personal footprint. send Verify me Using myVaultID I authorise who can verify my details for KYC and AML. merge_type Global Customer Onboarding VaultID brings traditional and innovative on traditional KYC and AML solutions to your Customer onboarding program. merge_type Global Customer Onboarding blur_on Building a verification Footprint VaultID's revolutionary biometric footprinting technology. blur_on Building a verification Footprint No Consumer digital footprint Half the world's population (2 billion people) has NO digital footprint. They are excluded by the traditional banking system from accessing financial services. They are forced to rely on expensive risky alternative means to manage their money in the cash economy. They consequently leave little or no digital footprint from which to verify themselves when required to do so as part your Know Your Customer / Anti Money Laundering legal compliance requirements. Consider the impact in the knowledge that 6 out of 10 top growing economies have more than a 30% unbanked population. The Existing Consumer digital footprint is fading Consumers have lost trust in Verification Platforms that involve Third Party Data Suppliers. Their Consumers personal data is often outdated, limited and disclosed without their consent to inappropriate third-party data users like Cambridge Analytica. Consumers are now restricting the dissemination of their personal data opting out of the use of their data. Their digital footprint is fading. Compliance In country and cross boarder legislative compliance has increased greatly over the last 5 years. An excellent example of this is the EU General Data Protection Regulation (GDPR). The introduction of GDPR is the most important change in data privacy regulation in 20 years. Third parts verification services are now finding it hard to obtain Consumer data to maintain their service accuracy and coverage. Again, the Consumer digital footprint is fading. Understanding the industry When you the Consumer interact with a business it needs to confirm you are who you say you are. A number of third-party companies source your personal data from marketing and transaction databases or link directly into government databases (Passport office etc) in order to try to verify you. You don't know the accuracy of the information held about you, where it come from and where it is going to. VaultID lets you create a myVault account that YOU control. When a company wants to confirm your details, they look at your myVault details BUT only after you have approved that they may do so. You manage your details keeping them up to date and accurate and you DO NOT allow your personal details to be handed to anybody. VaultID is a fully transparent system controlled by you. We log all requests to see your details and all access granted to your details for you to see. With VaultID you have taken back control of your personal details from third party data sales merchants. Common Language - Use the VaultID common profile language across all your consumer touchpoints, offline, machine ID, cookies etc. Merge in third party VaultID data pool datasets and model across into marketing channels in order to identify \"look-a-likes\" or existing customers for upsell targeting. VaultID has built its platform around with the concept of continual improvement applied to data quality. This means our verification services provide both base data quality of your customer details but also confirms the contectability of the records and can enhance that contection capability through field enhancement appends. Create a biometric wallet to validate your identity utilising both traditional and non-traditional details. Using the myVault application you will create a financial and digital footprint that will qualify you for onboarding and utilising traditional finances. You as the owner control requests to verify your details and onboard you to financial services. Manage who sees your information. VaultID brings traditional and innovative on traditional KYC and AML solutions to your Customer onboarding program."
  ]
}