{
  "company": "www.irisid.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "PRODUCTS & SOLUTIONS IrisAccess System IrisAccess 7000 IrisAccess 4000 Integration Operation Modes Standards Hardware Products iCAM D1000 iCAM7 series R100 series OU75 OU7S-AK ICU7000-2 iCAM TD100A iCAM T10 Software Products iData EAC TimeReport™ iData SDK iData CMA IrisAccelerator INSiDE iCAM Manager SDK iCAM Entry Solutions Access Control Time & Attendance Public Safety & Justice Transportation & Immigration National Identity Technology Iris Recognition Technology How it Works How it Compares Current & Future Use IrisAccess Case Studies IrisAccess Adoption Literature IrisAccess System IrisAccess 7000 IrisAccess 4000 Integration Operation Modes Standards Hardware Products iCAM D1000 iCAM7 series R100 series OU75 OU7S-AK ICU7000-2 iCAM TD100A iCAM T10 Software Products iData EAC TimeReport™ iData SDK iData CMA IrisAccelerator INSiDE iCAM Manager SDK iCAM Entry Solutions Access Control Time & Attendance Public Safety & Justice Transportation & Immigration National Identity Public Safety & Justice Technology Iris Recognition Technology How it Works How it Compares Current & Future Use Current & Future Use NEWS & EVENTS Blog News Press Release Events Videos Newsletter IrisID Radio En Español SUPPORT Knowledge Base Product Registration RMA Request Software Upgrade Request Software, Drivers & Documentation Training Software, Drivers & Documentation ABOUT Corporate Overview History Certifications IrisAccess@ Corporate Identity CONTACT US Directions Careers Contact Iris Recognition from IRIS ID. Leading the World of Identity Authentication. Since 1997, Iris ID has been the key developer and driver of the commercialization of iris recognition technology. IrisAccess, now in a sixth generation, is the world's most deployed iris recognition platform. The technology is found on six continents and in thousands of locations, daily authenticating the identities of millions of persons. More people in more places authenticate with IrisAccess than with all other iris recognition products combined. See how our expertise and Advanced Identity Authentication can add security, convenience, privacy and productivity to your enterprise operations. AST Names 2019 'ASTORS' Homeland Security Awards Winners at the Javits Center in NYC Thousands of government and security industry and security and public safety professionals convened in New York City last week to meet with Iris ID Introduces IrisTime™ – a New Biometric Time and Attendance Solution Cranbury, N.J. USA – October 2, 2019 – Iris ID, the global leader in iris recognition technology for 20 years, Intersec Middle East 2020 NSA Winter Conference 2020"
  ]
}