{
  "company": "www.revealmedia.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 73,
    "-1": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.6797853309481217,
    "framing_surveillance": 0.2486583184257602,
    "framing_market": 0.071556350626118,
    "num_docs": 76
  },
  "topic_timeline": {
    "20": {
      "-1": 3,
      "0": 73
    }
  },
  "sample_docs": [
    "Reveal Media – Body Worn Video Camera Solutions is committed to protecting your privacy and developing technology that gives you the most powerful and safe online experience. This Statement of Privacy applies to the Reveal Media – Body Worn Video Camera Solutions Web site and governs data collection and usage. By using the Reveal Media – Body Worn Video Camera Solutions website, you consent to the data practices described in this statement. Collection of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects personally identifiable information, such as your e-mail address, name, home or work address or telephone number. Reveal Media – Body Worn Video Camera Solutions also collects anonymous demographic information, which is not unique to you, such as your ZIP code, age, gender, preferences, interests and favorites. There is also information about your computer hardware and software that is automatically collected by Reveal Media – Body Worn Video Camera Solutions. This information can include: your IP address, browser type, domain names, access times and referring Web site addresses. This information is used by Reveal Media UK – Body Worn Video Camera Solutions for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Reveal Media – Body Worn Video Camera Solutions Web site. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Reveal Media – Body Worn Video Camera Solutions public message boards, this information may be collected and used by others. Note: Reveal Media – Body Worn Video Camera Solutions does not read any of your private online communications. Reveal Media – Body Worn Video Camera Solutions encourages you to review the privacy statements of Web sites you choose to link to from Reveal Media – Body Worn Video Camera Solutions so that you can understand how those Web sites collect, use and share your information. Reveal Media – Body Worn Video Camera Solutions is not responsible for the privacy statements or other content on Web sites outside of the Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions family of Web sites. Use of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects and uses your personal information to operate the Reveal Media – Body Worn Video Camera Solutions Web site and deliver the services you have requested. Reveal Media – Body Worn Video Camera Solutions also uses your personally identifiable information to inform you of other products or services available from Reveal Media – Body Worn Video Camera Solutions and its affiliates. Reveal Media – Body Worn Video Camera Solutions may also contact you via surveys to conduct research about your opinion of current services or of potential new services that may be offered. Reveal Media – Body Worn Video Camera Solutions does not sell, rent or lease its customer lists to third parties. Reveal Media – Body Worn Video Camera Solutions may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is not transferred to the third party. In addition, Reveal Media – Body Worn Video Camera Solutions may share data with trusted partners to help us perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to Reveal Media – Body Worn Video Camera Solutions, and they are required to maintain the confidentiality of your information. Reveal Media – Body Worn Video Camera Solutions does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. Reveal Media – Body Worn Video Camera Solutions keeps track of the Web sites and pages our customers visit within Reveal Media – Body Worn Video Camera Solutions, in order to determine what Reveal Media – Body Worn Video Camera Solutions services are the most popular. This data is used to deliver customized content and advertising within Reveal Media – Body Worn Video Camera Solutions to customers whose behavior indicates that they are interested in a particular subject area. Reveal Media – Body Worn Video Camera Solutions Web sites will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Reveal Media – Body Worn Video Camera Solutions or the site; (b) protect and defend the rights or property of Reveal Media – Body Worn Video Camera Solutions; and, (c) act under exigent circumstances to protect the personal safety of users of Reveal Media – Body Worn Video Camera Solutions, or the public. Use of Cookies The Reveal Media – Body Worn Video Camera Solutions Web site use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a Web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize Reveal Media – Body Worn Video Camera Solutions pages, or register with Reveal Media – Body Worn Video Camera Solutions site or services, a cookie helps Reveal Media – Body Worn Video Camera Solutions to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same Reveal Media – Body Worn Video Camera Solutions Web site, the information you previously provided can be retrieved, so you can easily use the Reveal Media – Body Worn Video Camera Solutions features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the Reveal Media – Body Worn Video Camera Solutions services or Web sites you visit. Security of your Personal Information Reveal Media – Body Worn Video Camera Solutions secures your personal information from unauthorized access, use or disclosure. Reveal Media – Body Worn Video Camera Solutions secures the personally identifiable information you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When personal information (such as a credit card number) is transmitted to other Web sites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. Changes to this Statement Reveal Media – Body Worn Video Camera Solutions will occasionally update this Statement of Privacy to reflect company and customer feedback. Reveal Media – Body Worn Video Camera Solutions encourages you to periodically review this Statement to be informed of how Reveal Media – Body Worn Video Camera Solutions is protecting your information. Contact Information Reveal Media – Body Worn Video Camera Solutions welcomes your comments regarding this Statement of Privacy. If you believe that Reveal Media – Body Worn Video Camera Solutions has not adhered to this Statement, please contact Reveal Media – Body Worn Video Camera Solutions at vj@revealmedia.com . We will use commercially reasonable efforts to promptly determine and remedy the problem. Reveal Media – Body Worn Video Camera Solutions is committed to protecting your privacy and developing technology that gives you the most powerful and safe online experience. This Statement of Privacy applies to the Reveal Media – Body Worn Video Camera Solutions Web site and governs data collection and usage. By using the Reveal Media – Body Worn Video Camera Solutions website, you consent to the data practices described in this statement. Collection of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects personally identifiable information, such as your e-mail address, name, home or work address or telephone number. Reveal Media – Body Worn Video Camera Solutions also collects anonymous demographic information, which is not unique to you, such as your ZIP code, age, gender, preferences, interests and favorites. There is also information about your computer hardware and software that is automatically collected by Reveal Media – Body Worn Video Camera Solutions. This information can include: your IP address, browser type, domain names, access times and referring Web site addresses. This information is used by Reveal Media UK – Body Worn Video Camera Solutions for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Reveal Media – Body Worn Video Camera Solutions Web site. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Reveal Media – Body Worn Video Camera Solutions public message boards, this information may be collected and used by others. Note: Reveal Media – Body Worn Video Camera Solutions does not read any of your private online communications. Reveal Media – Body Worn Video Camera Solutions encourages you to review the privacy statements of Web sites you choose to link to from Reveal Media – Body Worn Video Camera Solutions so that you can understand how those Web sites collect, use and share your information. Reveal Media – Body Worn Video Camera Solutions is not responsible for the privacy statements or other content on Web sites outside of the Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions family of Web sites. Use of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects and uses your personal information to operate the Reveal Media – Body Worn Video Camera Solutions Web site and deliver the services you have requested. Reveal Media – Body Worn Video Camera Solutions also uses your personally identifiable information to inform you of other products or services available from Reveal Media – Body Worn Video Camera Solutions and its affiliates. Reveal Media – Body Worn Video Camera Solutions may also contact you via surveys to conduct research about your opinion of current services or of potential new services that may be offered. Reveal Media – Body Worn Video Camera Solutions does not sell, rent or lease its customer lists to third parties. Reveal Media – Body Worn Video Camera Solutions may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is not transferred to the third party. In addition, Reveal Media – Body Worn Video Camera Solutions may share data with trusted partners to help us perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to Reveal Media – Body Worn Video Camera Solutions, and they are required to maintain the confidentiality of your information. Reveal Media – Body Worn Video Camera Solutions does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. Reveal Media – Body Worn Video Camera Solutions keeps track of the Web sites and pages our customers visit within Reveal Media – Body Worn Video Camera Solutions, in order to determine what Reveal Media – Body Worn Video Camera Solutions services are the most popular. This data is used to deliver customized content and advertising within Reveal Media – Body Worn Video Camera Solutions to customers whose behavior indicates that they are interested in a particular subject area. Reveal Media – Body Worn Video Camera Solutions Web sites will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Reveal Media – Body Worn Video Camera Solutions or the site; (b) protect and defend the rights or property of Reveal Media – Body Worn Video Camera Solutions; and, (c) act under exigent circumstances to protect the personal safety of users of Reveal Media – Body Worn Video Camera Solutions, or the public. The Reveal Media – Body Worn Video Camera Solutions Web site use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a Web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize Reveal Media – Body Worn Video Camera Solutions pages, or register with Reveal Media – Body Worn Video Camera Solutions site or services, a cookie helps Reveal Media – Body Worn Video Camera Solutions to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same Reveal Media – Body Worn Video Camera Solutions Web site, the information you previously provided can be retrieved, so you can easily use the Reveal Media – Body Worn Video Camera Solutions features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the Reveal Media – Body Worn Video Camera Solutions services or Web sites you visit. Security of your Personal Information Reveal Media – Body Worn Video Camera Solutions secures your personal information from unauthorized access, use or disclosure. Reveal Media – Body Worn Video Camera Solutions secures the personally identifiable information you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When personal information (such as a credit card number) is transmitted to other Web sites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. Changes to this Statement Reveal Media – Body Worn Video Camera Solutions will occasionally update this Statement of Privacy to reflect company and customer feedback. Reveal Media – Body Worn Video Camera Solutions encourages you to periodically review this Statement to be informed of how Reveal Media – Body Worn Video Camera Solutions is protecting your information. Reveal Media – Body Worn Video Camera Solutions welcomes your comments regarding this Statement of Privacy. If you believe that Reveal Media – Body Worn Video Camera Solutions has not adhered to this Statement, please contact Reveal Media – Body Worn Video Camera Solutions at vj@revealmedia.com . We will use commercially reasonable efforts to promptly determine and remedy the problem.",
    "& Conditions AGREEMENT BETWEEN USER AND Reveal Media – Body Worn Video Camera Solutions The Reveal Media – Body Worn Video Camera Solutions Web Site is comprised of various Web pages operated by Reveal Media – Body Worn Video Camera Solutions. The Reveal Media – Body Worn Video Camera Solutions Web Site is offered to you conditioned on your acceptance without modification of the , conditions, and notices contained herein. Your use of the Reveal Media – Body Worn Video Camera Solutions Web Site constitutes your agreement to all such , conditions, and notices. MODIFICATION OF THESE OF USE Reveal Media – Body Worn Video Camera Solutions reserves the right to change the , conditions, and notices under which the Reveal Media – Body Worn Video Camera Solutions Web Site is offered, including but not limited to the charges associated with the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. LINKS TO THIRD PARTY SITES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain links to other Web Sites (\"Linked Sites\"). The Linked Sites are not under the control of Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions is not responsible for the contents of any Linked Site, including without limitation any link contained in a Linked Site, or any changes or updates to a Linked Site. Reveal Media – Body Worn Video Camera Solutions is not responsible for webcasting or any other form of transmission received from any Linked Site. Reveal Media – Body Worn Video Camera Solutions is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Reveal Media – Body Worn Video Camera Solutions of the site or any association with its operators. NO UNLAWFUL OR PROHIBITED USE As a condition of your use of the Reveal Media – Body Worn Video Camera Solutions Web Site, you warrant to Reveal Media – Body Worn Video Camera Solutions that you will not use the Reveal Media – Body Worn Video Camera Solutions Web Site for any purpose that is unlawful or prohibited by these , conditions, and notices. You may not use the Reveal Media – Body Worn Video Camera Solutions Web Site in any manner which could damage, disable, overburden, or impair the Reveal Media – Body Worn Video Camera Solutions Web Site or interfere with any other party's use and enjoyment of the Reveal Media – Body Worn Video Camera Solutions Web Site. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available or provided for through the Reveal Media – Body Worn Video Camera Solutions Web Sites. USE OF COMMUNICATION SERVICES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain bulletin board services, chat areas, news groups, forums, communities, personal web pages, calendars, and/or other message or communication facilities designed to enable you to communicate with the public at large or with a group (collectively, \"Communication Services\"), you agree to use the Communication Services only to post, send and receive messages and material that are proper and related to the particular Communication Service. By way of example, and not as a limitation, you agree that when using a Communication Service, you will not: Defame, abuse, harass, stalk, threaten or otherwise violate the legal rights (such as rights of privacy and publicity) of others. Publish, post, upload, distribute or disseminate any inappropriate, profane, defamatory, infringing, obscene, indecent or unlawful topic, name, material or information. Upload files that contain software or other material protected by intellectual property laws (or by rights of privacy of publicity) unless you own or control the rights thereto or have received all necessary consents. Upload files that contain viruses, corrupted files, or any other similar software or programs that may damage the operation of another's computer. Advertise or offer to sell or buy any goods or services for any business purpose, unless such Communication Service specifically allows such messages. Conduct or forward surveys, contests, pyramid schemes or chain letters. Download any file posted by another user of a Communication Service that you know, or reasonably should know, cannot be legally distributed in such manner. Falsify or delete any author attributions, legal or other proper notices or proprietary designations or labels of the origin or source of software or other material contained in a file that is uploaded. Restrict or inhibit any other user from using and enjoying the Communication Services. Violate any code of conduct or other guidelines which may be applicable for any particular Communication Service. Harvest or otherwise collect information about others, including e-mail addresses, without their consent. Violate any applicable laws or regulations. Reveal Media – Body Worn Video Camera Solutions has no obligation to monitor the Communication Services. However, Reveal Media – Body Worn Video Camera Solutions reserves the right to review materials posted to a Communication Service and to remove any materials in its sole discretion. Reveal Media – Body Worn Video Camera Solutions reserves the right to terminate your access to any or all of the Communication Services at any time without notice for any reason whatsoever. Reveal Media – Body Worn Video Camera Solutions reserves the right at all times to disclose any information as necessary to satisfy any applicable law, regulation, legal process or governmental request, or to edit, refuse to post or to remove any information or materials, in whole or in part, in Reveal Media – Body Worn Video Camera Solutions's sole discretion. Always use caution when giving out any personally identifying information about yourself or your children in any Communication Service. Reveal Media – Body Worn Video Camera Solutions does not control or endorse the content, messages or information found in any Communication Service and, therefore, Reveal Media – Body Worn Video Camera Solutions specifically disclaims any liability with regard to the Communication Services and any actions resulting from your participation in any Communication Service. Managers and hosts are not authorized Reveal Media – Body Worn Video Camera Solutions spokespersons, and their views do not necessarily reflect those of Reveal Media – Body Worn Video Camera Solutions. Materials uploaded to a Communication Service may be subject to posted limitations on usage, reproduction and/or dissemination. You are responsible for adhering to such limitations if you download the materials. MATERIALS PROVIDED TO Reveal Media – Body Worn Video Camera Solutions OR POSTED AT ANY Reveal Media – Body Worn Video Camera Solutions WEB SITE Reveal Media – Body Worn Video Camera Solutions does not claim ownership of the materials you provide to Reveal Media – Body Worn Video Camera Solutions (including feedback and suggestions) or post, upload, input or submit to any Reveal Media – Body Worn Video Camera Solutions Web Site or its associated services (collectively \"Submissions\"). However, by posting, uploading, inputting, providing or submitting your Submission you are granting Reveal Media – Body Worn Video Camera Solutions, its affiliated companies and necessary sublicensees permission to use your Submission in connection with the operation of their Internet businesses including, without limitation, the rights to: copy, distribute, transmit, publicly display, publicly perform, reproduce, edit, translate and reformat your Submission; and to publish your name in connection with your Submission. No compensation will be paid with respect to the use of your Submission, as provided herein. Reveal Media – Body Worn Video Camera Solutions is under no obligation to post or use any Submission you may provide and may remove any Submission at any time in Reveal Media – Body Worn Video Camera Solutions's sole discretion. By posting, uploading, inputting, providing or submitting your Submission you warrant and represent that you own or otherwise control all of the rights to your Submission as described in this section including, without limitation, all the rights necessary for you to provide, post, upload, input or submit the Submissions. LIABILITY DISCLAIMER THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE Reveal Media – Body Worn Video Camera Solutions WEB SITE AT ANY TIME. ADVICE RECEIVED VIA THE Reveal Media – Body Worn Video Camera Solutions WEB SITE SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS AND YOU SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO YOUR SITUATION. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED ON THE Reveal Media – Body Worn Video Camera Solutions WEB SITE FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WITH THE DELAY OR INABILITY TO USE THE Reveal Media – Body Worn Video Camera Solutions WEB SITE OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF Reveal Media – Body Worn Video Camera Solutions OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR WITH ANY OF THESE OF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE Reveal Media – Body Worn Video Camera Solutions WEB SITE. SERVICE CONTACT : helpdesk@revealmedia.com TERMINATION/ACCESS RESTRICTION Reveal Media – Body Worn Video Camera Solutions reserves the right, in its sole discretion, to terminate your access to the Reveal Media – Body Worn Video Camera Solutions Web Site and the related services or any portion thereof at any time, without notice. GENERAL To the maximum extent permitted by law, this agreement is governed by the laws of the State of Washington, U.S.A. and you hereby consent to the exclusive jurisdiction and venue of courts in King County, Washington, U.S.A. in all disputes arising out of or relating to the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Use of the Reveal Media – Body Worn Video Camera Solutions Web Site is unauthorized in any jurisdiction that does not give effect to all provisions of these , including without limitation this paragraph. You agree that no joint venture, partnership, employment, or agency relationship exists between you and Reveal Media – Body Worn Video Camera Solutions as a result of this agreement or use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Reveal Media – Body Worn Video Camera Solutions's performance of this agreement is subject to existing laws and legal process, and nothing contained in this agreement is in derogation of Reveal Media – Body Worn Video Camera Solutions's right to comply with governmental, court and law enforcement requests or requirements relating to your use of the Reveal Media – Body Worn Video Camera Solutions Web Site or information provided to or gathered by Reveal Media – Body Worn Video Camera Solutions with respect to such use. If any part of this agreement is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of the agreement shall continue in effect. Unless otherwise specified herein, this agreement constitutes the entire agreement between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site and it supersedes all prior or contemporaneous communications and proposals, whether electronic, oral or written, between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site. A printed version of this agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to this agreement to the same extent an d subject to the same conditions as other business documents and records originally generated and maintained in printed form. It is the express wish to the parties that this agreement and all related documents be drawn up in English. COPYRIGHT AND TRADEMARK NOTICES: All contents of the Reveal Media – Body Worn Video Camera Solutions Web Site are: (c)2014 Reveal Media Ltd | A limited company registered in the UK | No 4470201 and/or its suppliers. . TRADEMARKS The names of actual companies and products mentioned herein may be the trademarks of their respective owners. The example companies, organizations, products, people and events depicted herein are fictitious. No association with any real company, organization, product, person, or event is intended or should be inferred. Any rights not expressly granted herein are reserved. NOTICES AND PROCEDURE FOR MAKING CLAIMS OF COPYRIGHT INFRINGEMENT Pursuant to Title 17, United States Code, Section 512(c)(2), notifications of claimed copyright infringement under United States copyright law should be sent to Service Provider's Designated Agent. ALL INQUIRIES NOT RELEVANT TO THE FOLLOWING PROCEDURE WILL RECEIVE NO RESPONSE. See Notice and Procedure for Making Claims of Copyright Infringement. AGREEMENT BETWEEN USER AND Reveal Media – Body Worn Video Camera Solutions The Reveal Media – Body Worn Video Camera Solutions Web Site is comprised of various Web pages operated by Reveal Media – Body Worn Video Camera Solutions. The Reveal Media – Body Worn Video Camera Solutions Web Site is offered to you conditioned on your acceptance without modification of the , conditions, and notices contained herein. Your use of the Reveal Media – Body Worn Video Camera Solutions Web Site constitutes your agreement to all such , conditions, and notices. MODIFICATION OF THESE OF USE Reveal Media – Body Worn Video Camera Solutions reserves the right to change the , conditions, and notices under which the Reveal Media – Body Worn Video Camera Solutions Web Site is offered, including but not limited to the charges associated with the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. LINKS TO THIRD PARTY SITES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain links to other Web Sites (\"Linked Sites\"). The Linked Sites are not under the control of Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions is not responsible for the contents of any Linked Site, including without limitation any link contained in a Linked Site, or any changes or updates to a Linked Site. Reveal Media – Body Worn Video Camera Solutions is not responsible for webcasting or any other form of transmission received from any Linked Site. Reveal Media – Body Worn Video Camera Solutions is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Reveal Media – Body Worn Video Camera Solutions of the site or any association with its operators. NO UNLAWFUL OR PROHIBITED USE As a condition of your use of the Reveal Media – Body Worn Video Camera Solutions Web Site, you warrant to Reveal Media – Body Worn Video Camera Solutions that you will not use the Reveal Media – Body Worn Video Camera Solutions Web Site for any purpose that is unlawful or prohibited by these , conditions, and notices. You may not use the Reveal Media – Body Worn Video Camera Solutions Web Site in any manner which could damage, disable, overburden, or impair the Reveal Media – Body Worn Video Camera Solutions Web Site or interfere with any other party's use and enjoyment of the Reveal Media – Body Worn Video Camera Solutions Web Site. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available or provided for through the Reveal Media – Body Worn Video Camera Solutions Web Sites. USE OF COMMUNICATION SERVICES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain bulletin board services, chat areas, news groups, forums, communities, personal web pages, calendars, and/or other message or communication facilities designed to enable you to communicate with the public at large or with a group (collectively, \"Communication Services\"), you agree to use the Communication Services only to post, send and receive messages and material that are proper and related to the particular Communication Service. By way of example, and not as a limitation, you agree that when using a Communication Service, you will not: Defame, abuse, harass, stalk, threaten or otherwise violate the legal rights (such as rights of privacy and publicity) of others. Publish, post, upload, distribute or disseminate any inappropriate, profane, defamatory, infringing, obscene, indecent or unlawful topic, name, material or information. Upload files that contain software or other material protected by intellectual property laws (or by rights of privacy of publicity) unless you own or control the rights thereto or have received all necessary consents. Upload files that contain viruses, corrupted files, or any other similar software or programs that may damage the operation of another's computer. Advertise or offer to sell or buy any goods or services for any business purpose, unless such Communication Service specifically allows such messages. Conduct or forward surveys, contests, pyramid schemes or chain letters. Download any file posted by another user of a Communication Service that you know, or reasonably should know, cannot be legally distributed in such manner. Falsify or delete any author attributions, legal or other proper notices or proprietary designations or labels of the origin or source of software or other material contained in a file that is uploaded. Restrict or inhibit any other user from using and enjoying the Communication Services. Violate any code of conduct or other guidelines which may be applicable for any particular Communication Service. Harvest or otherwise collect information about others, including e-mail addresses, without their consent. Violate any applicable laws or regulations. Reveal Media – Body Worn Video Camera Solutions has no obligation to monitor the Communication Services. However, Reveal Media – Body Worn Video Camera Solutions reserves the right to review materials posted to a Communication Service and to remove any materials in its sole discretion. Reveal Media – Body Worn Video Camera Solutions reserves the right to terminate your access to any or all of the Communication Services at any time without notice for any reason whatsoever. Reveal Media – Body Worn Video Camera Solutions reserves the right at all times to disclose any information as necessary to satisfy any applicable law, regulation, legal process or governmental request, or to edit, refuse to post or to remove any information or materials, in whole or in part, in Reveal Media – Body Worn Video Camera Solutions's sole discretion. Always use caution when giving out any personally identifying information about yourself or your children in any Communication Service. Reveal Media – Body Worn Video Camera Solutions does not control or endorse the content, messages or information found in any Communication Service and, therefore, Reveal Media – Body Worn Video Camera Solutions specifically disclaims any liability with regard to the Communication Services and any actions resulting from your participation in any Communication Service. Managers and hosts are not authorized Reveal Media – Body Worn Video Camera Solutions spokespersons, and their views do not necessarily reflect those of Reveal Media – Body Worn Video Camera Solutions. Materials uploaded to a Communication Service may be subject to posted limitations on usage, reproduction and/or dissemination. You are responsible for adhering to such limitations if you download the materials. MATERIALS PROVIDED TO Reveal Media – Body Worn Video Camera Solutions OR POSTED AT ANY Reveal Media – Body Worn Video Camera Solutions WEB SITE Reveal Media – Body Worn Video Camera Solutions does not claim ownership of the materials you provide to Reveal Media – Body Worn Video Camera Solutions (including feedback and suggestions) or post, upload, input or submit to any Reveal Media – Body Worn Video Camera Solutions Web Site or its associated services (collectively \"Submissions\"). However, by posting, uploading, inputting, providing or submitting your Submission you are granting Reveal Media – Body Worn Video Camera Solutions, its affiliated companies and necessary sublicensees permission to use your Submission in connection with the operation of their Internet businesses including, without limitation, the rights to: copy, distribute, transmit, publicly display, publicly perform, reproduce, edit, translate and reformat your Submission; and to publish your name in connection with your Submission. No compensation will be paid with respect to the use of your Submission, as provided herein. Reveal Media – Body Worn Video Camera Solutions is under no obligation to post or use any Submission you may provide and may remove any Submission at any time in Reveal Media – Body Worn Video Camera Solutions's sole discretion. By posting, uploading, inputting, providing or submitting your Submission you warrant and represent that you own or otherwise control all of the rights to your Submission as described in this section including, without limitation, all the rights necessary for you to provide, post, upload, input or submit the Submissions. THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE Reveal Media – Body Worn Video Camera Solutions WEB SITE AT ANY TIME. ADVICE RECEIVED VIA THE Reveal Media – Body Worn Video Camera Solutions WEB SITE SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS AND YOU SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO YOUR SITUATION. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED ON THE Reveal Media – Body Worn Video Camera Solutions WEB SITE FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WITH THE DELAY OR INABILITY TO USE THE Reveal Media – Body Worn Video Camera Solutions WEB SITE OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF Reveal Media – Body Worn Video Camera Solutions OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR WITH ANY OF THESE OF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE Reveal Media – Body Worn Video Camera Solutions WEB SITE. SERVICE CONTACT : helpdesk@revealmedia.com Reveal Media – Body Worn Video Camera Solutions reserves the right, in its sole discretion, to terminate your access to the Reveal Media – Body Worn Video Camera Solutions Web Site and the related services or any portion thereof at any time, without notice. GENERAL To the maximum extent permitted by law, this agreement is governed by the laws of the State of Washington, U.S.A. and you hereby consent to the exclusive jurisdiction and venue of courts in King County, Washington, U.S.A. in all disputes arising out of or relating to the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Use of the Reveal Media – Body Worn Video Camera Solutions Web Site is unauthorized in any jurisdiction that does not give effect to all provisions of these , including without limitation this paragraph. You agree that no joint venture, partnership, employment, or agency relationship exists between you and Reveal Media – Body Worn Video Camera Solutions as a result of this agreement or use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Reveal Media – Body Worn Video Camera Solutions's performance of this agreement is subject to existing laws and legal process, and nothing contained in this agreement is in derogation of Reveal Media – Body Worn Video Camera Solutions's right to comply with governmental, court and law enforcement requests or requirements relating to your use of the Reveal Media – Body Worn Video Camera Solutions Web Site or information provided to or gathered by Reveal Media – Body Worn Video Camera Solutions with respect to such use. If any part of this agreement is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of the agreement shall continue in effect. Unless otherwise specified herein, this agreement constitutes the entire agreement between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site and it supersedes all prior or contemporaneous communications and proposals, whether electronic, oral or written, between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site. A printed version of this agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to this agreement to the same extent an d subject to the same conditions as other business documents and records originally generated and maintained in printed form. It is the express wish to the parties that this agreement and all related documents be drawn up in English. COPYRIGHT AND TRADEMARK NOTICES: All contents of the Reveal Media – Body Worn Video Camera Solutions Web Site are: (c)2014 Reveal Media Ltd | A limited company registered in the UK | No 4470201 and/or its suppliers. . The names of actual companies and products mentioned herein may be the trademarks of their respective owners. The example companies, organizations, products, people and events depicted herein are fictitious. No association with any real company, organization, product, person, or event is intended or should be inferred. Any rights not expressly granted herein are reserved. NOTICES AND PROCEDURE FOR MAKING CLAIMS OF COPYRIGHT INFRINGEMENT Pursuant to Title 17, United States Code, Section 512(c)(2), notifications of claimed copyright infringement under United States copyright law should be sent to Service Provider's Designated Agent. ALL INQUIRIES NOT RELEVANT TO THE FOLLOWING PROCEDURE WILL RECEIVE NO RESPONSE. See Notice and Procedure for Making Claims of Copyright Infringement.",
    "News Reveal Exhibiting at the National Sheriff's Association | Booth #537 26-06-2015 The National Sheriff's Association is taking place from June 21st - July 1st in Baltimore, Maryland. Reveal will be there, showcasing our range of award-winning body worn cameras and evidence management software. There will be over 60 Seminars and Workshops at the expo, covering all aspects of the duties and responsibilities for sheriffs' offices, including, but not limited to Law Enforcement, Jail Operations, Service of Process, Transportation of Prisoners, and Court & Judicial Security. The exhibit hall will present close to 500 exhibit booths and will include a very diverse group ranging from weapons, universities, electronics, vehicles, clothing, commissary, forensics, government agencies, and more. Exhibitions provide a platform for lively debate on body worn video, and are a fantastic way to meet Reveal and take a look first hand at the equipment we provide. We are body worn video experts, having worked on projects of all sizes for almost a decade - from start-up programmes with a handful of cameras, to deploying and project managing 2800 camera roll outs. We'd be delighted to meet you at the show and walk you through the solutions we offer, but it can get busy for us at exhibitions so do get in touch before hand by emailing gary@revealmedia.com to arrange a meeting. Register here to attend Reveal Exhibiting at the National Sheriff's Association | Booth #537 26-06-2015 The National Sheriff's Association is taking place from June 21st - July 1st in Baltimore, Maryland. Reveal will be there, showcasing our range of award-winning body worn cameras and evidence management software. There will be over 60 Seminars and Workshops at the expo, covering all aspects of the duties and responsibilities for sheriffs' offices, including, but not limited to Law Enforcement, Jail Operations, Service of Process, Transportation of Prisoners, and Court & Judicial Security. The exhibit hall will present close to 500 exhibit booths and will include a very diverse group ranging from weapons, universities, electronics, vehicles, clothing, commissary, forensics, government agencies, and more. Exhibitions provide a platform for lively debate on body worn video, and are a fantastic way to meet Reveal and take a look first hand at the equipment we provide. We are body worn video experts, having worked on projects of all sizes for almost a decade - from start-up programmes with a handful of cameras, to deploying and project managing 2800 camera roll outs. We'd be delighted to meet you at the show and walk you through the solutions we offer, but it can get busy for us at exhibitions so do get in touch before hand by emailing gary@revealmedia.com to arrange a meeting. Register here to attend Reveal Exhibiting at the National Sheriff's Association | Booth #537 The National Sheriff's Association is taking place from June 21st - July 1st in Baltimore, Maryland. Reveal will be there, showcasing our range of award-winning body worn cameras and evidence management software. There will be over 60 Seminars and Workshops at the expo, covering all aspects of the duties and responsibilities for sheriffs' offices, including, but not limited to Law Enforcement, Jail Operations, Service of Process, Transportation of Prisoners, and Court & Judicial Security. The exhibit hall will present close to 500 exhibit booths and will include a very diverse group ranging from weapons, universities, electronics, vehicles, clothing, commissary, forensics, government agencies, and more. Exhibitions provide a platform for lively debate on body worn video, and are a fantastic way to meet Reveal and take a look first hand at the equipment we provide. We are body worn video experts, having worked on projects of all sizes for almost a decade - from start-up programmes with a handful of cameras, to deploying and project managing 2800 camera roll outs. We'd be delighted to meet you at the show and walk you through the solutions we offer, but it can get busy for us at exhibitions so do get in touch before hand by emailing gary@revealmedia.com to arrange a meeting. Register here to attend The National Sheriff's Association is taking place from June 21st - July 1st in Baltimore, Maryland. Reveal will be there, showcasing our range of award-winning body worn cameras and evidence management software. There will be over 60 Seminars and Workshops at the expo, covering all aspects of the duties and responsibilities for sheriffs' offices, including, but not limited to Law Enforcement, Jail Operations, Service of Process, Transportation of Prisoners, and Court & Judicial Security. The exhibit hall will present close to 500 exhibit booths and will include a very diverse group ranging from weapons, universities, electronics, vehicles, clothing, commissary, forensics, government agencies, and more. Exhibitions provide a platform for lively debate on body worn video, and are a fantastic way to meet Reveal and take a look first hand at the equipment we provide. We are body worn video experts, having worked on projects of all sizes for almost a decade - from start-up programmes with a handful of cameras, to deploying and project managing 2800 camera roll outs. We'd be delighted to meet you at the show and walk you through the solutions we offer, but it can get busy for us at exhibitions so do get in touch before hand by emailing gary@revealmedia.com to arrange a meeting. Register here to attend",
    "Case Studies Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us.",
    "Police Body Cameras We supply smart, efficient and secure police body cameras to police forces all around the world Reveal has been making award-winning, smart, efficient and secure police body camears for over a decade. With the majority of police and fire customers in the UK, as well as in over 40 countries around the world, our commitment has been to lead the way through collaboration and innovation. The D-series body worn camera is built on the same fundamental philosophies but with its host of new features, it is best in its class across video quality, battery life, functionality and ease of use. View our products Police Body Cameras Articulated camera head ​ Capture the right images Being able to direct the head allows the D-Series body camera to be worn in various places on people of all shapes and sizes, or head mounted on a helmet or cap. The body camera can also be used in vehicle, as an interview recorder or a handheld camera. Front-facing screen We focus strongly on deterrence of incidents This signature Reveal body camera feature has a proven calming effect on people being recorded and maximises transparency with the public. When appropriate, the screen can also be used to view video back in the field, without needing a smart phone or a PC. Intuitive design Designed from your perspective Having a single, quick and simple action to turn the camera on has always been an essential feature in our body cameras. Our intuitive red sliding switch is a positive action that confirms activation by the physical position change on the camera and is easy to operate for officers on the go. Reveal has always put design at the forefront of our product philosophy. We understand that users want to feel an affinity with what they wear and the equipment they use. Really good design takes time and meticulous attention to every detail. Not only are our police body cameras supremely easy to use, they are also designed to be products that users are proud to wear. View the D-Series Body Camera DEMS 360 - Simply manage all your digital evidence. Anywhere. ​ Built from your point of view DEMS 360 is our most advanced digital evidence management solution yet that allows you to manage all media types. Available on cloud or on premises. Your choice. DEMS 360 has its roots in the first ground breaking software Reveal developed back in 2002, which was first adopted by Major Crimes units in the UK to manage all types of digital evidence files. In 2006, as UK police looked to pioneer the use of body worn cameras, Reveal's existing software was adapted to efficiently manage police body camera footage and DEMS was born. DEMS 360 is the latest generation of Reveal's award-winning DEMS, with a host of features including the ability to upload, access and share all media types, automatic redaction, case support and In-Field Annotation. Contact us to discuss your requirements We supply smart, efficient and secure police body cameras to police forces all around the world Reveal has been making award-winning, smart, efficient and secure police body camears for over a decade. With the majority of police and fire customers in the UK, as well as in over 40 countries around the world, our commitment has been to lead the way through collaboration and innovation. The D-series body worn camera is built on the same fundamental philosophies but with its host of new features, it is best in its class across video quality, battery life, functionality and ease of use. Capture the right images Being able to direct the head allows the D-Series body camera to be worn in various places on people of all shapes and sizes, or head mounted on a helmet or cap. The body camera can also be used in vehicle, as an interview recorder or a handheld camera. We focus strongly on deterrence of incidents This signature Reveal body camera feature has a proven calming effect on people being recorded and maximises transparency with the public. When appropriate, the screen can also be used to view video back in the field, without needing a smart phone or a PC. Designed from your perspective Having a single, quick and simple action to turn the camera on has always been an essential feature in our body cameras. Our intuitive red sliding switch is a positive action that confirms activation by the physical position change on the camera and is easy to operate for officers on the go. Reveal has always put design at the forefront of our product philosophy. We understand that users want to feel an affinity with what they wear and the equipment they use. Really good design takes time and meticulous attention to every detail. Not only are our police body cameras supremely easy to use, they are also designed to be products that users are proud to wear. View the D-Series Body Camera DEMS 360 - Simply manage all your digital evidence. Anywhere. Built from your point of view DEMS 360 is our most advanced digital evidence management solution yet that allows you to manage all media types. Available on cloud or on premises. Your choice. DEMS 360 has its roots in the first ground breaking software Reveal developed back in 2002, which was first adopted by Major Crimes units in the UK to manage all types of digital evidence files. In 2006, as UK police looked to pioneer the use of body worn cameras, Reveal's existing software was adapted to efficiently manage police body camera footage and DEMS was born. DEMS 360 is the latest generation of Reveal's award-winning DEMS, with a host of features including the ability to upload, access and share all media types, automatic redaction, case support and In-Field Annotation. Contact us to discuss your requirements Get exclusive monthly body camera news and resources (your email is safe with us)"
  ]
}