{
  "company": "www.transunion.com",
  "dominant_topics": [
    0,
    -1,
    1
  ],
  "topic_counts": {
    "0": 150,
    "-1": 43,
    "1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information",
    "1": "module, students, year, level, grade"
  },
  "framing_scores": {
    "framing_ethical": 0.777292576419214,
    "framing_surveillance": 0.0021834061135371,
    "framing_market": 0.2205240174672489,
    "num_docs": 194
  },
  "topic_timeline": {
    "20": {
      "-1": 43,
      "0": 150,
      "1": 1
    }
  },
  "sample_docs": [
    "We noticed that you started signing up but did not complete your order. Do you wish to continue? Continue We noticed that you started signing up but did not complete your order. Do you wish to continue? *Offer Details: Your TransUnion Score & Report are available as part of our subscription credit monitoring service. You will be billed at the low monthly cost of $24.95 per month (plus tax where applicable). Would you like to see your credit score now? Yes, show me my score Would you like to see your credit score now? Credit Protection TransUnion's exclusive TU Credit Lock puts control of your TransUnion Credit Report at your fingertips. Lock your TransUnion Credit Report to prevent criminals from using it to get credit in your name. Unlock it when you need to apply for credit. All it takes to lock and unlock your report with TU Credit Lock is a single smartphone swipe or a mouse click. It's that easy! Consumer Assistance Find out how to dispute an item on your credit report. Visit our Credit Education page to learn about important credit topics. Learn about the Fair and Accurate Credit Reporting Act (FACT ACT) and other ways to get a free credit report. ATTENTION: the parent or legal guardian of a minor or medically incapacitated consumer may have the right to add a Protected Consumer Freeze. More for Business TransUnion strengthens digital marketing solutions with agreement to acquire TruSignal Understand the auto, credit card, mortgage and personal loan markets with Industry Insights Reports Refine your strategies by using alternative data across the lending lifecycle Deliver a seamless and safe customer experience, while protecting your business against evolving fraud TransUnion's exclusive TU Credit Lock puts control of your TransUnion Credit Report at your fingertips. Lock your TransUnion Credit Report to prevent criminals from using it to get credit in your name. Unlock it when you need to apply for credit. All it takes to lock and unlock your report with TU Credit Lock is a single smartphone swipe or a mouse click. It's that easy! Find out how to dispute an item on your credit report. Visit our Credit Education page to learn about important credit topics. Learn about the Fair and Accurate Credit Reporting Act (FACT ACT) and other ways to get a free credit report. ATTENTION: the parent or legal guardian of a minor or medically incapacitated consumer may have the right to add a Protected Consumer Freeze. TransUnion strengthens digital marketing solutions with agreement to acquire TruSignal Understand the auto, credit card, mortgage and personal loan markets with Industry Insights Reports Refine your strategies by using alternative data across the lending lifecycle Deliver a seamless and safe customer experience, while protecting your business against evolving fraud About Us About TransUnion Corporate social responsibility Investor relations Newsroom Careers Client Support Client technical services Compliance and permissible purpose Data reporting FAQs Data security Information for Data reporting Credit data resellers Do not sell my personal information - CA residents only Have questions? Consumer Business Privacy of use Sitemap FCPA policy © Copyright 2019 TransUnion LLC. . Compliance and permissible purpose Do not sell my personal information - CA residents only",
    "The industry is quickly moving from fee-for-service to value-based or managed care payment models. By 2018, HHS has declared that 50% of payments must be value-based. Now is the time to evaluate your data submission incentives and required analytics to ensure you're prepared to make the shift to value-based payment models. TransUnion Payer Solutions leverage more than 25 years of experience in managing the \"capitated\" or managed care data required for these new payment models. Additionally, as a national EDI clearinghouse, TransUnion delivers: One platform for processing encounters and claims data Clinical outcome data from your providers groups delivered to your \"doorstep\" in an actionable format A full suite of HIPAA-compliant EDI solutions (270/271, 274, 276/277, 278, 835, 837P, 837I, 977/277U) Health plan membership file hosting Provider file management (EDI 274 processing) Other health insurance discovery to identify first-in-line coverage for your medical claims A low cost solution—more cost-effective than performing it internally Products For Healthcare Payer Solutions Clinical and EDI Clearinghouse Improve operational efficiency with HIPAA-compliant EDI transaction sets and clinical outcome data exchange Encounters and Claims Processing Access a best in KLAS platform for capturing maximum encounter data quality and quantity Hosted Membership Automate your provider interactions with real time insurance, eligibility, benefits & claim status information Other Health Insurance Discovery Discover first-in-line insurance coverage for your medical claims – including what others miss About Us About TransUnion Corporate social responsibility Investor relations Newsroom Careers Contact us Client Support Client technical services Compliance and legislative updates Data reporting FAQs Data security Information for Data reporting Credit data resellers Criminal and evictions data resellers Contact Us Have questions? Blog of use Sitemap © Copyright 2016 TransUnion LLC. . Compliance and legislative updates Criminal and evictions data resellers",
    "What Is a Collection Agency? Share This Page What Is a Collection Agency? What is a collection agency? If you've been contacted by a collection agency, you may be wondering, \"what is a collection agency?\" Not everyone knows the answer, especially if they've always paid off debts on time. When you're delinquent on a debt (at least 60 days past due), a collection agency may begin to contact you to collect. This can happen with credit cards, medical bills, mortgages, and personal and auto loans. You might even hear from a collector for outstanding utility and cell phone bills. How do collection agencies work? How collection agencies work can vary. In some instances, they may act as middlemen on behalf of the creditor to collect your debt. In others, they might purchase your debt from the creditor at a discount. This can happen when the creditor has decided it's unlikely to collect payment and chooses to cut its losses by selling your debt to a collection agency or other debt buyer. Typically, creditors package up similar debts, for instance bundling debts that are old and unlikely to pay separately from newer debts that have better odds of paying. Collection agencies can then purchase these debts. If and when you ultimately pay, the agency keeps the amount collected. What can I expect from a collection agency? A collection agency may send you letters and call you repeatedly to try to get you to pay off your debt. Some frequent ways debt collectors may contact you are by phone, letter, email or text message. It is important to note that a debt collector should not contact you at inconvenient times of the day or night, such as before 8 in the morning or after 9 at night, unless you agree to it. Additionally, debt collectors should not contact you at inconvenient places, such as your work, provided that the debt collectors are told that you're not allowed to receive calls at work. Within five days after the debt collection agency first makes contact, you should receive a written validation notice telling you how much money you owe, the name of the creditor to whom you owe the money, and how to proceed if you don't think you owe the money. Do debt collectors have any restrictions? If you're being contacted by a collection agency, you may want to look out for some of these general off limit practices: Harass or threaten you; Use obscene or profane language when speaking to you; Provide false credit information about you to anyone, including a credit reporting company; Publish your name in a list of people who refuse to pay their debts; Mislead you with false statements, such as that you have committed a crime or owe more than you do in reality; and Try to collect any interest, fee, or other charge on top of the amount you owe unless state law or the contract that created your debt allows the charge. If you do not believe that you owe the money the debt collector is contacting you about, you may send the debt collector a letter stating that you do not owe any or all of the money. If you are uncertain as to whether you owe the debt, you may send the debt collector a letter asking for verification of the debt. How do I work with a collection agency? There are a few general rules of thumb to keep in mind when navigating how to work with a collection agency: Even if you are unable to repay the debt immediately or believe that you do not owe the debt, you may want to talk to the debt collector initially to try to come to a resolution. Matters may worsen over time if left unresolved, so work directly or with an attorney to try to come to a resolution with the debt collector. Keep It Short and Simple When first contacted by a collection agency, it's best to keep things as short as possible. Request the information in writing (within five days of contacting you, a collector must send you written notice detailing the amount owed, the creditor's name, and how to dispute if applicable) and end the conversation. Beyond disputes, it's important to document any communication related to debt collection. This may include: Keeping copies of all written correspondence to and from the collector; Documenting all phone calls in notes, including date, time, and a summary of the conversation; and Saving voicemails from collectors. Disclaimer: The information posted to this blog was accurate at the time it was initially published. We do not guarantee the accuracy or completeness of the information provided. The information contained in the TransUnion blog is provided for educational purposes only and does not constitute legal or financial advice. You should consult your own attorney or financial adviser regarding your particular situation. For complete details of any product mentioned, visit transunion.com. This site is governed by the TransUnion Interactive located here. Wait-what about my credit? I want my TransUnion Report & Score A credit score is a three-digit number calculated from the information contained in your credit report. Credit myths and credit misconceptions are plentiful. Don't let incorrect information influence your credit behavior. Take the next step toward financial health See yours now Advertiser Disclosure: TransUnion Interactive may have a financial relationship with one or more of the institutions whose advertisements are being displayed on this site. In the event you enter into a product or service relationship with any such institution through the links provided on the site, TransUnion Interactive may be compensated by such institution. This compensation may impact how and where products appear on this site including, for example, the order in which they appear. TransUnion Interactive does not include all credit card companies or all available credit card offers. Advertiser Disclosure: TransUnion Interactive may have a financial relationship with one or more of the institutions whose advertisements are being displayed on this site. In the event you enter into a product or service relationship with any such institution through the links provided on the site, TransUnion Interactive may be compensated by such institution. This compensation may impact how and where products appear on this site including, for example, the order in which they appear. TransUnion Interactive does not include all credit card companies or all available credit card offers. About Us About TransUnion Corporate social responsibility Investor relations Newsroom Careers Contact us Client Support Client technical services Compliance and permissible purpose Data reporting FAQs Data security Information for Data reporting Credit data resellers Contact Us Have questions? of use Sitemap FCPA policy © Copyright 2019 TransUnion LLC. . Compliance and permissible purpose",
    "Engage patients early to increase payment transparency and satisfaction — and improve cash flow A healthy bottom line depends on earned revenue getting paid. As patients become the new payer , it's more important than ever to engage them early in the financial process. TransUnion Healthcare offers patient access solutions with guided workflows to improve patient engagement. Our solutions — which provide rich, consumer data assets and insights into consumer financial behaviors — increase registration process accuracy and create a more transparent and positive patient experience. It's a win-win: Patients understand the costs associated with care in advance, and you get streamlined processes that often result in higher propensity for payment from patients up front. A healthy bottom line depends on earned revenue getting paid. As patients become the new payer , it's more important than ever to engage them early in the financial process. TransUnion Healthcare offers patient access solutions with guided workflows to improve patient engagement. Our solutions — which provide rich, consumer data assets and insights into consumer financial behaviors — increase registration process accuracy and create a more transparent and positive patient experience. It's a win-win: Patients understand the costs associated with care in advance, and you get streamlined processes that often result in higher propensity for payment from patients up front. Patient access solutions to improve profitability Patient Identity Verification Improve registration accuracy and collection efforts by verifying patient contact information at the point of service. Our Identity Verification solution validates patient demographic information in real time against our robust proprietary sources, and helps confirm patient identity, reduce mail costs and helping ensure HIPAA compliance. Healthcare Insurance Eligibility Avoid processing errors and denials, eliminate costly reworks and ensure earned revenue gets paid. Insurance Eligibility helps verify patients' insurance in real time, including copays, coinsurance and deductible information. Claims Status helps accelerate claim resolution with up-to-date status information. Healthcare Authorizations Confirm payer rules and requirements to identify potential coverage issues in advance of a medical procedure and prevent denials. Our healthcare authorizations solutions automatically screen for Medicare medical necessity requirements and commercial, payer-specific prior authorization rules. Patient Payment Estimation Increase payment transparency by accurately estimating patients' out-of-pocket costs prior to treatment. Patient Payment Estimation enables staff to have up front conversations with patients about their financial responsibilities, increasing point-of-service collections. Patient Financial Clearance Make quick, informed decisions about a patient's propensity to pay or likelihood to qualify for financial assistance during registration and financial counseling. Patient Financial Clearance solutions provide a complete picture of a patient's identity and monetary situation through financial estimates, along with an objective, automated charity program enrollment process. TransUnion Healthcare's patient access solutions improve your workflows and ensure a more stress-free patient experience — leaving you better equipped to collect more cash up front. Request a demo Improve registration accuracy and collection efforts by verifying patient contact information at the point of service. Our Identity Verification solution validates patient demographic information in real time against our robust proprietary sources, and helps confirm patient identity, reduce mail costs and helping ensure HIPAA compliance. Avoid processing errors and denials, eliminate costly reworks and ensure earned revenue gets paid. Insurance Eligibility helps verify patients' insurance in real time, including copays, coinsurance and deductible information. Claims Status helps accelerate claim resolution with up-to-date status information. Confirm payer rules and requirements to identify potential coverage issues in advance of a medical procedure and prevent denials. Our healthcare authorizations solutions automatically screen for Medicare medical necessity requirements and commercial, payer-specific prior authorization rules. Increase payment transparency by accurately estimating patients' out-of-pocket costs prior to treatment. Patient Payment Estimation enables staff to have up front conversations with patients about their financial responsibilities, increasing point-of-service collections. Make quick, informed decisions about a patient's propensity to pay or likelihood to qualify for financial assistance during registration and financial counseling. Patient Financial Clearance solutions provide a complete picture of a patient's identity and monetary situation through financial estimates, along with an objective, automated charity program enrollment process. TransUnion Healthcare's patient access solutions improve your workflows and ensure a more stress-free patient experience — leaving you better equipped to collect more cash up front. Quick Facts 42% increase in point-of-service collections from 2013 to 2017* $31.8 million increase in point-of-service collections* 98% of U.S. insured lives covered by our Insurance Eligibility solution** *After Patient Payment Estimation solution implemented at Banner Health. View the case study. ** TransUnion Healthcare analysis 42% increase in point-of-service collections from 2013 to 2017* $31.8 million increase in point-of-service collections* 98% of U.S. insured lives covered by our Insurance Eligibility solution** *After Patient Payment Estimation solution implemented at Banner Health. View the case study. ** TransUnion Healthcare analysis Accreditations ClearIQ Insurance Eligibility ClearIQ Patient Payment Estimation ClearIQ Insurance Eligibility Revenue Manager Insurance Eligibility 1 HFMA staff and volunteers determined that these products met specific criteria developed under the HFMA Peer Review process. HFMA does not endorse or guaranty the use of these products. ClearIQ Patient Payment Estimation 1 HFMA staff and volunteers determined that these products met specific criteria developed under the HFMA Peer Review process. HFMA does not endorse or guaranty the use of these products. Products For Healthcare Patient Access All All Featured 6 of 6 Healthcare Authorizations Verify prior authorization and medical necessity upfront to ensure procedures are approved prior to service Healthcare Claim Status Receive timely feedback on outstanding claims, reduce cost-to-collect and improve cash flow Identity Verification Improve registration accuracy by verifying patient identity and contact information. Insurance Eligibility Verify patients' insurance eligibility and benefits to increase point-of-service collections Patient Financial Clearance Get a complete picture of a patient's ability and willingness to pay in order to improve collection efforts Patient Payment Estimation Increase point-of-service collections and improve staff productivity with accurate patient payment estimates View All Insights And Events Video Uncover Hidden Revenue to Maximize Your Recovery Reward Watch now Case Study A Year-End Bad Debt File Review See more Blog MACs Getting Tougher on Cost Report Reopenings: What it Means for Your Hospital Read more Blog Optimizing the Patient Bill Lifecycle: Best Practices for Billing and Collection Policies Read more Uncover Hidden Revenue to Maximize Your Recovery Reward A Year-End Bad Debt File Review MACs Getting Tougher on Cost Report Reopenings: What it Means for Your Hospital Optimizing the Patient Bill Lifecycle: Best Practices for Billing and Collection Policies About Us About TransUnion Corporate social responsibility Investor relations Newsroom Careers Contact us Client Support Client technical services Compliance and permissible purpose Data reporting FAQs Data security Information for Data reporting Credit data resellers Contact Us Have questions? of use Sitemap FCPA policy © Copyright 2019 TransUnion LLC. . Compliance and permissible purpose",
    "Our revenue cycle management (RCM) solutions help optimize the consumer reimbursement process and reduce uncompensated care to improve cash flow. What is revenue cycle management? Revenue cycle management is the financial process that begins when a patient walks through the door and ends when payment is successfully collected. Revenue cycle management encompasses everything from patient estimates at the point of service (POS), to insurance eligibility verification (including copays and deductibles), financial counseling (including for charity care ), pre-authorizations, coding claims, denials, reimbursements, billing and collections. In short, revenue cycle management is the financial lifeblood for the healthcare industry and hospitals . Why is revenue cycle management important? Healthcare is expensive—and healthcare providers rely on incoming revenue to pay for it. But collecting revenue is highly complex and difficult. Consider the fact that healthcare providers uniquely must contend with: Multiple payers (employers, health insurance carriers, Medicare and Medicaid, to name just a few) each with their own needs and incentives. Complicated state and federal regulations , and a myriad of insurance policies, copays and deductibles. Financially strapped patients —as of Q1 2016, approximately 51% of patients owe more than $1,000 to their healthcare providers. Nearly eight in 10 patients (77%) owe more than $500. (See the 2016 TransUnion Healthcare Report .) Revenue cycle management's aim, therefore, is to help healthcare providers: Automate as much of the revenue cycle as possible Mitigate the complexity from multiple payers and complicated regulations Collect much more revenue for healthcare services provided—at a lower cost Revenue cycle management trends Revenue cycle starts at the point of service: It pays to start the revenue cycle right when the patient walks in the door. Clear, accurate estimates, encouraging staff to ask for payment upfront, financial counseling, insurance discovery—these are just a few ways to increase revenue at the point of service. Automation: Computer automation offers important efficiencies in revenue cycle management. As a rule of thumb, if staff must repeat complex manual tasks, it's a good place to look for automated solutions. For example, TransUnion eScan's patented data mining technology finds hidden third-party, Medicaid and Medicare coverage. Patient is the new payer SM : Large copays and deductibles mean that for the first time patients now must shoulder more of the burden of healthcare costs. For revenue cycle management, that means healthcare providers will need to become far more consumer-friendly and price transparent. TransUnion offers cost-effective solutions for all of these revenue cycle management trends and challenges. The key is to maximize reimbursements both in the front- and back-end of the revenue cycle. On the front-end, ClearIQ , an intelligent, exception-based platform, enables providers to improve the patient access experience and maximize staff efficiency with task-driven, user-defined work queues. On the back-end, eScan , a post-service eligibility system, recovers reimbursements from third-party payers. Both platforms integrate our HFMA peer-reviewed solutions and use TransUnion's comprehensive consumer data and analytics to provide a clear picture of a patient's financial health: Patient access solutions more accurately verify patient identity, insurance eligibility, benefits and authorization requirements, and are rated highest by KLAS for accuracy in determining patient payment estimates Collections and reimbursement solutions help you more accurately predict a patient's ability to pay and likelihood to qualify for financial aid, as well as uncover unidentified sources of third–party insurance coverage Healthcare resellers and channel partners solutions deliver easy-to-integrate revenue cycle data solutions to provider clients for deeper insight into their patients' identity, financial and insurance situations Let TransUnion Healthcare's revenue cycle management solutions help you better understand your patients' true financial situation and efficiently move them through a stressful aspect of being a patient. With access to data on an estimated 500 million consumers worldwide, get highly accurate registration and eligibility data. Products For Healthcare Revenue Cycle Management All All Featured Collections & Reimbursement Patient Access 10 of 10 Charity and Financial Aid Screening Objectively qualify more patients for the right financial assistance or charity programs ClearIQ Predict patients' financial behavior at point of sale for efficient revenue-cycle management Healthcare Data Breach Services Help protect your patients against medical identity theft Identity Verification Quickly verify patient identity and demographic data against third party sources to improve registration Insurance Eligibility Verify your patients' insurance benefit information electronically Patient Payment Estimation Get credible patient payment estimates for medical costs at or before the point of service Propensity to Pay Make objective propensity to pay decisions—and collect more Self-Pay Collections Solutions Optimize revenue recovery by using data and analytics at multiple points in the patient account life cycle Transfer DRG Underpayment Recovery Our experts will find and recover underpayments for you—and we don't get paid until Medicare reimburses you eScan Find hidden coverage to reduce uncompensated care, charity care and bad debt with Insurance Coverage Discovery View All Insights And Events Video FinTechs differentiate through a better customer experience Watch Now Video Learn how FinTech leaders foster an innovative culture Watch Now Video What do FinTechs look for in a data partner? Watch Now White paper Prepare to pivot: Getting ahead of ACA disruptive forces FinTechs differentiate through a better customer experience Learn how FinTech leaders foster an innovative culture What do FinTechs look for in a data partner? Prepare to pivot: Getting ahead of ACA disruptive forces About Us About TransUnion Corporate social responsibility Investor relations Newsroom Careers Contact us Client Support Client technical services Compliance and permissible purpose Data reporting FAQs Data security Information for Data reporting Credit data resellers Criminal and evictions data resellers Contact Us Have questions? Blog of use Sitemap © Copyright 2017 TransUnion LLC. . Compliance and permissible purpose Criminal and evictions data resellers"
  ]
}