{
  "company": "www.bitmain.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.9545454545454546,
    "framing_surveillance": 0.0,
    "framing_market": 0.0454545454545454,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 3
    }
  },
  "sample_docs": [
    "ASIC VS GPU miner In of mining, there are numerous methods used in order to mine cryptocurrencies. The two most popular method of mining is done through the method of ASIC and GPU mining. ASIC miners are purpose-built to do one thing and one thing it does best, mine cryptocurrencies based on the algorithm it utilizes. Such as the popular cryptocurrency Bitcoin (BTC) or Bitcoin Cash (BCH), which both utilizes the SHA256 algorithm. ASIC miners are able to solve complex mathematical problems needed that is an integral part that ensures fairness while keeping the network stable, safe and secure. Other cryptocurrencies utilize different algorithms, and there are specific ASIC miners produced to mine those most efficiently. Graphic processing units (GPU) is a computer chip that can calculate cryptocurrencies regardless of the algorithm it uses, making more flexible in the market, however the hash power it possesses is a less compared to ASIC miners running on the network. Superb Hash Power for mining cryptocurrencies Advanced nanometer chip process Cutting-Edge Heat Dissipation Technology Optimal Power Efficiency (Electricity to Power Ratio) Truly Dedicated for Cryptocurrency Mining ASIC VS GPU miner In of mining, there are numerous methods used in order to mine cryptocurrencies. The two most popular method of mining is done through the method of ASIC and GPU mining. ASIC miners are purpose-built to do one thing and one thing it does best, mine cryptocurrencies based on the algorithm it utilizes. Such as the popular cryptocurrency Bitcoin (BTC) or Bitcoin Cash (BCH), which both utilizes the SHA256 algorithm. ASIC miners are able to solve complex mathematical problems needed that is an integral part that ensures fairness while keeping the network stable, safe and secure. Other cryptocurrencies utilize different algorithms, and there are specific ASIC miners produced to mine those most efficiently. Graphic processing units (GPU) is a computer chip that can calculate cryptocurrencies regardless of the algorithm it uses, making more flexible in the market, however the hash power it possesses is a less compared to ASIC miners running on the network. Superb Hash Power for mining cryptocurrencies Superb Hash Power for mining cryptocurrencies Advanced nanometer chip process Advanced nanometer chip process Cutting-Edge Heat Dissipation Technology Cutting-Edge Heat Dissipation Technology Optimal Power Efficiency (Electricity to Power Ratio) Optimal Power Efficiency (Electricity to Power Ratio) Truly Dedicated for Cryptocurrency Mining Truly Dedicated for Cryptocurrency Mining Evolution of Antminer Antimers have a long history in providing miners in the market. Starting from 2013 by laughing the very first miner (Antminer S1) and succeeding new miners which have an enhanced hash power and efficiency, mainly popularized by the Antminer S9. Antiners have been providing the market with reliable and stable hardware products. 2013/11 S1 2014/7 S3 2014/9 L1 2014/11 S5 2015/11 S7 2016/6 S9 2016/12 L3 2017/4 L3+ 2017/8 D3 2018/3 X3 2018/4 E3 2018/5 Z9Mini 2018/7 Z9 2018/8 S9Hydro 2018/9 DR3 2018/11 D5 2018/11 DR5 2018/11 S15/T15 2019/3 Z11 2019/4 S17Pro/S17/T17 2019/6 S9/SE/S9K 2019/9 S17E/T17E 2019/10 S17+/T17+ Antimers have a long history in providing miners in the market. Starting from 2013 by laughing the very first miner (Antminer S1) and succeeding new miners which have an enhanced hash power and efficiency, mainly popularized by the Antminer S9. Antiners have been providing the market with reliable and stable hardware products.",
    "The Bitmain Privacy Statement Bitmain Group and its global affiliates (collectively, \"Bitmain\", \"we\", \"us\", and \"our\") respect your privacy. Therefore, we have developed a Privacy Statement (hereinafter referred to as \"this Statement\") that covers how we collect, use, disclose, protect, store and transfer your personal data when using our websites, products or services. Please take a moment to read and understand our Privacy Statement and let us know if you have any questions. Personal data means any electronic or other information which alone or jointly with other information can be used to identify a natural person or make him/her identifiable. This Statement explains how Bitmain processes your personal data, but does not cover all processing scenarios as you will be informed in specific processing activity. Therefore, before using a specific product or service, it is recommended that you read the privacy notice or supplementary statement released by Bitmain for that product or service to understand how it processes your personal data. This Statement applies only to websites, product and services that display or mention this Statement. This Statement describes: How Bitmain Collects and Uses Your Personal Data How Bitmain Uses Cookies and Similar Technologies How Bitmain Shares Your Personal Data How Bitmain Protects Your Personal Data How You Can Manage Your Personal Data How Bitmain Protects Children's Personal Data Links to Third-Party Websites, Products, and Services International Transfers of Your Personal Data Updates to This Statement How to Contact Us I. How Bitmain Collects and Uses Your Personal Data A. Personal Data Collected by Bitmain Personal data means any data that, either on its own or jointly with other data, can be used to identify a natural person. You directly provide us with such data when you use our websites, products, or services, or interact with us by, for example, creating a Bitmain account or contacting us for support. We may also obtain data by recording how you interact with our websites, products, or services. For example, we may use technologies like cookies or receive use data from software running on your device. As permitted by law, we may also obtain data from public and commercial third-party sources, for example, purchasing statistics from other companies to support our services. The personal data we collect includes name, enterprise name, postal and email addresses, phone number, login information (account and password), photos, and certificate information, etc., depending on how you interact with Bitmain, for example, the website you visit or the products and services that you use. We also collect the information you provide to us and the content of messages you send us, such as the query information you provide, or the questions or information you provide for customer service support. In addition, we may also collect Non-identifiable data, which refers to data that cannot be used to identify an individual, for example, the statistics on website visits, application downloads, and product sales volume. Before using our products or services, you may need to provide personal data. You do not have to provide your personal data to Bitmain, but in some cases, the non-provision of certain personal data will cause the inability to provide you with some related products or services. B. How Bitmain Uses Your Personal Data Bitmain may use your personal data for the following purposes: (1) Register a Bitmain ID. (2) Information relating to e-commerce orders may be used for processing the purchase order and related after-sales services, including customer support and re-delivery. In addition, the order number is used to cross check the order with the delivery partner as well as the actual delivery of the parcel. The receipt details, including name, address, phone number and postal code are for delivery purposes. The email address is used to send parcel tracking information to the user. The list of purchased item(s) is used for printing the invoice and allowing users to see what is in the parcel. (3) Deliver, activate, or verify the products and services you have requested, or perform changes and provide technical support and after-sales services for the foregoing products and services based on your requirements. (4) Send you important notifications. (5) Provide personalized user experience and content. (6) Send you information about products and services you might be interested in, invite you to Bitmain's promotional activities and market surveys, or send marketing information to you. If you do not want to receive such information, you can opt out at any time. (7) Collect user feedback. The feedback you choose to provide is important to help Bitmain improve its services. To process your feedback, we may use the personal information you provide to contact you and keep records. (8) Carry out internal auditing, data analysis, and research; analyze business operation efficiency and measure market shares; and improve Bitmain's products and services. (9) Troubleshooting when you send us error reports. (10) Ensuring the security of our products, services and customers or users. (11) Process pursuant to laws and regulations, e.g. tax, authority requests. (12) Other purposes within specific services or with your consent. II.How Bitmain Uses Cookies and Similar Technologies Bitmain's websites, online services, interactive applications, email messages, and advertisements may use \"cookies\" and other technologies such as pixel tags and web beacons. These technologies help us better understand user behavior, tell us which parts of our websites people have visited, and facilitate and measure the effectiveness of advertisements and web searches. We treat information collected by cookies and other technologies as non‑personal information. However, to the extent that Internet Protocol (IP) addresses or similar identifiers are considered personal information by local law, we also treat these identifiers as personal information. A. Cookie A cookie is a text file stored by a web server on a computer or mobile device, and the content of a cookie can be retrieved and read only by the server that created the cookie. Cookies are unique to the browser or mobile application you are using. The text in a cookie often consists of identifiers, site names, and some numbers and characters. Sometimes, Bitmain stores cookies on computers or mobile devices for the purpose of improving user experience, including the following scenarios: (1) Technical cookies: Login and verification. When you use a Bitmain ID to to a website, the \"session-based\" cookies ensure that your visit to this site functions as smoothly as possible. (2) Personalization cookies: Storage of your preferences and settings. A website can use cookies to save settings, such as the language setting and font size on your computer or mobile device, items in your shopping cart, and other browser preferences. (3) Advertising cookies. Bitmain uses cookies to collect information about your online activities and interests and provide you with advertisements that correlate most highly with you. (4) Statistical cookies. With cookies, Bitmain can collect information about your use of our websites and other applications, either for a single visit (using a session cookie) or for repeated visits (using a persistent cookie). You can manage or delete cookies at your own preference. For details, visit AboutCookies.org . You can clear all the cookies stored on your computer, and most current web browsers provide the option of blocking cookies. However, blocking cookies will require you to change your user settings every time you visit our website. Find out how to manage for your browser here: Internet Explorer > Google Chrome > Mozilla Firefox > Safari > Opera . If you clear cookies, you will need to change your settings the next time you visit Bitmain's websites. Note that some Bitmain's services require the use of cookies. Disabling cookies may affect your use of some or all functions of these services. B. Web Beacons and Pixel Tags In addition to cookies, Bitmain and some third parties may also use web beacons and pixel tags on websites. A web beacon is usually an electronic graphic image embedded into a website or email to identify your device cookies when you browse the website or email. Pixel tags allow Bitmain to send emails in a way that is readable to you and find out whether an email is opened. Bitmain and some third parties use these technologies for various purposes, including analysing service usage (together with cookies) and providing more satisfactory content and advertisements to you. For example, when you receive an email from Bitmain, it may contain a click-through URL which links to a Bitmain web page. If you click the link, Bitmain will track your visit to help us learn about your preferences for products and services and improve our customer service. You can unsubscribe from the mailing list of Bitmain at any time if you do not want to be tracked in this manner. C. Other Local Storage Bitmain and some third parties may use other local storage technologies, for example, local shared objects (also called \"Flash cookies\") and HTML5 local storage, in certain products and services. Similar to cookies, these technologies store information on your device and can record some information about your activities and preferences. However, these technologies may use different media from cookies. Therefore, you may not be able to control them using standard browser tools and settings. For details about how to disable or delete information contained in Flash cookies, . D. Do Not Track Many web browsers provide a Do Not Track function that can release Do Not Track requests to websites. Currently, major Internet standardization organizations have not established policies to specify how websites should handle these requests. If you enable Do Not Track in your browser, all Bitmain's websites will respect your selection. III. How Bitmain Shares Your Personal Data We do not share personal data with other companies, organizations and individuals unless one of the following circumstances applies: (1) Sharing with consent: After obtaining your consent, Bitmain will share the information that you have authorized with specified third parties or categories of third parties. (2) Sharing pursuant to laws and regulations: Bitmain may share your information as required by laws and regulations, for resolving legal disputes, or as required by administrative or judiciary authorities pursuant to law. (3) Sharing with Bitmain's affiliates: Your information may be shared within Bitmain's affiliates only for explicit, and legitimate purposes, and the sharing is limited only to information required by services. For example, we verify the global uniqueness of accounts before allowing them to be registered. (4) Sharing with business partners: Some products and/or services are provided to you directly by our partners. Bitmain also may share your information with them, they may use your information to provide you with products and/or services you request (e.g., products sold by third-party seller through Bitmain's e-commerce platform, video content provided by other companies through Bitmain's applications), make predictions about your interests and may provide you with advertisements, promotional materials and other materials (5) Sharing with service providers: Bitmain also may disclose your information to companies that provide services for or on behalf of us. Examples of these service providers include companies that provide hotline services, send email, or provide technical support on behalf of Bitmain. The service providers can use your information only for the purpose of providing services to you on behalf of Bitmain. (6) Bitmain will share your information when there is a reasonable requirement to do so, for example, to meet request of applicable law, regulation, legal process or enforceable government. In scenarios 3 to 6, Bitmain will ensure that the lawfulness of this sharing and sign stringent non-disclosure agreements (NDAs) and/or data processing clauses with the companies, organizations, and individuals with whom personal data is shared, requiring them to comply with this Statement and take appropriate confidentiality and security measures when processing personal data. IV. How Bitmain Protects Your Personal Data Bitmain attaches great importance to the security of your personal data and has adopted standard industry practices to protect your personal data and prevent it from unauthorized access, disclosure, use, modification, damage, or loss. To this end, Bitmain takes the following measures: (1) We take reasonable and feasible measures to ensure that the personal data collected is minimal and relevant to what is necessary in relation to the purposes for which they are processed. We retain your personal data for no longer than is necessary for the purposes stated in this Statement and privacy notice of specific product or service, unless extending the retention period is required or permitted by law. (2) We use a range of technologies such as cryptographic technologies to ensure the confidentiality of data in transmission. We implement trusted protection mechanisms to protect data and data storage servers from attacks. (3) We deploy access control mechanisms to ensure that only authorized personnel can access your personal data. In addition, we control the number of authorized personnel and implement hierarchical permission management on them based on service requirements and personnel levels. (4) We strictly select business partners and service providers and incorporate personal data protection requirements into commercial contracts, audits, and appraisal activities. (5) We hold security and privacy protection training courses, tests, and publicity activities to raise employees' personal data protection awareness. Bitmain is committed to protecting your personal data. Nevertheless, no security measure is perfect and no product, service, website, data transfer, computing system, or network connection is absolutely secure. To cope with possible risks, such as personal data leakage, damage, and loss, Bitmain has developed several mechanisms and control measures, clearly defined the rating standards of security incidents and vulnerabilities and corresponding processing procedure. Bitmain has established a dedicated emergency response team to implement security planning, loss reduction, analysis, locating, and remediation, and to perform tracking operations with related departments based on security incident handling regulations and requirements. If any personal data incident occurs, Bitmain will notify you, pursuant to relevant legal and regulatory requirements, of the basic information about the security incident and its possible impact, measures that Bitmain has taken or will take, suggestions about active defense and risk mitigation, and remedial measures. The notification may take the form of an email, text message, push notification, etc. If it is difficult to notify data subjects one by one, we will take appropriate and effective measures to release a Security Notice. In addition, we will also report the handling status of personal data security incidents as required by supervisory authorities. V. How You Can Manage Your Personal Data A. Access, rectification, deletion, data portability, restriction of processing, objection to processing. Legislation in some countries and regions to which Bitmain provides products and services or from where Bitmain processes personal data, provides that data subjects the rights request (hereinafter referred to as \"requests\") in regards to the accessing, rectifying, deleting or erasure, porting, restricting, and objecting, the processing of related personal data by Bitmain retains. Requesting modes and channels Data subjects' requests must be submitted in accordance with Bitmain designated privacy channels. The requests are valid even when the requester does not specify the laws on which the requests are based. If you would like to request access to your personal data held by us or if you believe any information we are holding on you is incorrect or incomplete, please submit your request to our online service. A copy of your personal data collected and processed by us will be provided to you upon your request free of charge. For any extra requests of the same information, we may charge a reasonable fee based on actual administrative costs according to the applicable laws. Validity of requests Most laws require data subjects to comply with specific requirements when they initiate requests. This Statement requires data subjects to: (1) Submit requests to our online service. (2) Provide sufficient information for Bitmain to verify their identities (to ensure those who initiate the requests are the data subjects themselves or those authorized by them). (3) Ensure that their requests are specific and feasible. There are some circumstances, provided by laws and regulations, in which Bitmain may not have to comply with the request in full or at all. B. Consent withdrawal You can change the authorized personal data collection scope or withdraw your consent without affecting the lawfulness of the processing activities based on the consent and prior to such withdraw. Your rights can be exercised by deleting information, disabling related functions, or setting privacy options on your Bitmain's product. Bitmain will release the methods for withdrawing consent for specific products and services in the privacy notice or supplementary statement of those products and services or upon request according to section A above. C. Deregistering a Bitmain ID You can deregister your account in Bitmain ID-related products. After you deregister your account, we will stop providing products and services, and delete your personal data unless otherwise stipulated by law. Your account cannot be restored after deregistration. You need to register a new Bitmain ID if you want to use related Bitmain's products or services again. You can submit a deregistration application and complete the process in setting menu after logging in to your Bitmain ID on related devices, applications or official website. VI. How Bitmain Protects Children's Personal Data We consider it the responsibility of parents to monitor their children's use of our products and services. Nevertheless, it is our policy not to require personal information from children or offer to send any promotional materials to persons in that category. Bitmain does not seek or intend to seek to receive any personal information from children. Should a parent or guardian have reasons to believe that a child has provided Bitmain with personal information without their prior consent, please contact us to ensure that the personal information is removed and the child unsubscribes from any of the applicable Bitmain's services. VII. Links to Third-Party Websites, Products, and Services Bitmain's websites, application software, products, and services may contain links to third-party websites, products, and services. Bitmain's products and services may also use or provide products or services from third parties. All links to third-party websites, products, and services are provided for users' convenience only. We are not responsible for and cannot control how third-parties use personal information which they collect from you. Our does not apply to other sites linked from our services. You need to determine your interaction with such links on your own. Before submitting your personal data to third parties, please read and refer to these third parties' privacy policies. VIII. International Transfers of Your Personal Data Our products and services are delivered through resources and servers located in different places, to offer our products and services, we may need to transfer your personal data among several countries. Authorized Bitmain personnel and third parties acting on our behalf may access, use and process personal data collected from you in a country/region that is different from the country/region where you entered the personal data, which may have less stringent data protection laws. When we transfer your personal data to other countries/regions, we will protect that the personal data as described in this statement or as otherwise disclosed to you at the time the data is collected (e.g. via privacy notice or supplementary statement of specific product or service). Bitmain has implemented global privacy practices for processing personal data protected under various data protection laws. Bitmain transfers personal data between the countries in which we operate in accordance with the standards and conditions of applicable data protection laws, including standards and conditions related to security and processing. With respect to personal data coming from the EU, we comply with applicable legal requirements providing adequate safeguards for the transfer of personal data to countries outside of the European Economic Area (\"EEA\"). We use a variety of legal mechanisms, such as standard contractual clauses to implement the cross-border transfer of your personal data; or implement other safeguards provided for in the GDPR. IX. Updates to This Statement Bitmain reserves the right to update this Statement at any time. Should this Statement be revised from time to time, Bitmain will release the change notice via various channels, for example, posting the latest version on our official website: https://www.bitmain.com.If we make any material changes we may notify you by means of a notice on this website. \"Material changes\" in this Statement include but are not limited to: (1) Material changes in our service modes, for example, purposes of personal data processing, types of processed personal data, and ways of using personal data (2) Material changes in our ownership structure, organizational structure, etc., for example, ownership changes caused by business adjustment, bankruptcy, or acquisition (3) Changes in the main objects of personal data sharing, transfer, or disclosure (4) Material changes in your rights regarding personal data processing and the ways in which you can enjoy those rights (5) Changes of Bitmain's departments, contacts, and complaint channels responsible for the security of personal data processing (6) High risks identified in personal data security impact assessment reports X. How to Contact Us If you have any questions or concerns about our Sites, Products or Services, our use of your information or this Policy, please contact our Online Service or contact us by visiting https://www.bitmain.com/contact or submitting it to account-help@bitmain.com . Note: Due to differences in local laws and languages, the local versions of Bitmain's Privacy Statement may be different from this version. In the case of any conflicts, the local versions shall prevail. Copyright . The Bitmain Privacy Statement Bitmain Group and its global affiliates (collectively, \"Bitmain\", \"we\", \"us\", and \"our\") respect your privacy. Therefore, we have developed a Privacy Statement (hereinafter referred to as \"this Statement\") that covers how we collect, use, disclose, protect, store and transfer your personal data when using our websites, products or services. Please take a moment to read and understand our Privacy Statement and let us know if you have any questions. Personal data means any electronic or other information which alone or jointly with other information can be used to identify a natural person or make him/her identifiable. This Statement explains how Bitmain processes your personal data, but does not cover all processing scenarios as you will be informed in specific processing activity. Therefore, before using a specific product or service, it is recommended that you read the privacy notice or supplementary statement released by Bitmain for that product or service to understand how it processes your personal data. This Statement applies only to websites, product and services that display or mention this Statement. This Statement describes: How Bitmain Collects and Uses Your Personal Data How Bitmain Uses Cookies and Similar Technologies How Bitmain Shares Your Personal Data How Bitmain Protects Your Personal Data How You Can Manage Your Personal Data How Bitmain Protects Children's Personal Data Links to Third-Party Websites, Products, and Services International Transfers of Your Personal Data Updates to This Statement How to Contact Us I. How Bitmain Collects and Uses Your Personal Data A. Personal Data Collected by Bitmain Personal data means any data that, either on its own or jointly with other data, can be used to identify a natural person. You directly provide us with such data when you use our websites, products, or services, or interact with us by, for example, creating a Bitmain account or contacting us for support. We may also obtain data by recording how you interact with our websites, products, or services. For example, we may use technologies like cookies or receive use data from software running on your device. As permitted by law, we may also obtain data from public and commercial third-party sources, for example, purchasing statistics from other companies to support our services. The personal data we collect includes name, enterprise name, postal and email addresses, phone number, login information (account and password), photos, and certificate information, etc., depending on how you interact with Bitmain, for example, the website you visit or the products and services that you use. We also collect the information you provide to us and the content of messages you send us, such as the query information you provide, or the questions or information you provide for customer service support. In addition, we may also collect Non-identifiable data, which refers to data that cannot be used to identify an individual, for example, the statistics on website visits, application downloads, and product sales volume. Before using our products or services, you may need to provide personal data. You do not have to provide your personal data to Bitmain, but in some cases, the non-provision of certain personal data will cause the inability to provide you with some related products or services. B. How Bitmain Uses Your Personal Data Bitmain may use your personal data for the following purposes: (1) Register a Bitmain ID. (2) Information relating to e-commerce orders may be used for processing the purchase order and related after-sales services, including customer support and re-delivery. In addition, the order number is used to cross check the order with the delivery partner as well as the actual delivery of the parcel. The receipt details, including name, address, phone number and postal code are for delivery purposes. The email address is used to send parcel tracking information to the user. The list of purchased item(s) is used for printing the invoice and allowing users to see what is in the parcel. (3) Deliver, activate, or verify the products and services you have requested, or perform changes and provide technical support and after-sales services for the foregoing products and services based on your requirements. (4) Send you important notifications. (5) Provide personalized user experience and content. (6) Send you information about products and services you might be interested in, invite you to Bitmain's promotional activities and market surveys, or send marketing information to you. If you do not want to receive such information, you can opt out at any time. (7) Collect user feedback. The feedback you choose to provide is important to help Bitmain improve its services. To process your feedback, we may use the personal information you provide to contact you and keep records. (8) Carry out internal auditing, data analysis, and research; analyze business operation efficiency and measure market shares; and improve Bitmain's products and services. (9) Troubleshooting when you send us error reports. (10) Ensuring the security of our products, services and customers or users. (11) Process pursuant to laws and regulations, e.g. tax, authority requests. (12) Other purposes within specific services or with your consent. II.How Bitmain Uses Cookies and Similar Technologies Bitmain's websites, online services, interactive applications, email messages, and advertisements may use \"cookies\" and other technologies such as pixel tags and web beacons. These technologies help us better understand user behavior, tell us which parts of our websites people have visited, and facilitate and measure the effectiveness of advertisements and web searches. We treat information collected by cookies and other technologies as non‑personal information. However, to the extent that Internet Protocol (IP) addresses or similar identifiers are considered personal information by local law, we also treat these identifiers as personal information. A. Cookie A cookie is a text file stored by a web server on a computer or mobile device, and the content of a cookie can be retrieved and read only by the server that created the cookie. Cookies are unique to the browser or mobile application you are using. The text in a cookie often consists of identifiers, site names, and some numbers and characters. Sometimes, Bitmain stores cookies on computers or mobile devices for the purpose of improving user experience, including the following scenarios: (1) Technical cookies: Login and verification. When you use a Bitmain ID to to a website, the \"session-based\" cookies ensure that your visit to this site functions as smoothly as possible. (2) Personalization cookies: Storage of your preferences and settings. A website can use cookies to save settings, such as the language setting and font size on your computer or mobile device, items in your shopping cart, and other browser preferences. (3) Advertising cookies. Bitmain uses cookies to collect information about your online activities and interests and provide you with advertisements that correlate most highly with you. (4) Statistical cookies. With cookies, Bitmain can collect information about your use of our websites and other applications, either for a single visit (using a session cookie) or for repeated visits (using a persistent cookie). You can manage or delete cookies at your own preference. For details, visit AboutCookies.org . You can clear all the cookies stored on your computer, and most current web browsers provide the option of blocking cookies. However, blocking cookies will require you to change your user settings every time you visit our website. Find out how to manage for your browser here: Internet Explorer > Google Chrome > Mozilla Firefox > Safari > Opera . If you clear cookies, you will need to change your settings the next time you visit Bitmain's websites. Note that some Bitmain's services require the use of cookies. Disabling cookies may affect your use of some or all functions of these services. B. Web Beacons and Pixel Tags In addition to cookies, Bitmain and some third parties may also use web beacons and pixel tags on websites. A web beacon is usually an electronic graphic image embedded into a website or email to identify your device cookies when you browse the website or email. Pixel tags allow Bitmain to send emails in a way that is readable to you and find out whether an email is opened. Bitmain and some third parties use these technologies for various purposes, including analysing service usage (together with cookies) and providing more satisfactory content and advertisements to you. For example, when you receive an email from Bitmain, it may contain a click-through URL which links to a Bitmain web page. If you click the link, Bitmain will track your visit to help us learn about your preferences for products and services and improve our customer service. You can unsubscribe from the mailing list of Bitmain at any time if you do not want to be tracked in this manner. C. Other Local Storage Bitmain and some third parties may use other local storage technologies, for example, local shared objects (also called \"Flash cookies\") and HTML5 local storage, in certain products and services. Similar to cookies, these technologies store information on your device and can record some information about your activities and preferences. However, these technologies may use different media from cookies. Therefore, you may not be able to control them using standard browser tools and settings. For details about how to disable or delete information contained in Flash cookies, . D. Do Not Track Many web browsers provide a Do Not Track function that can release Do Not Track requests to websites. Currently, major Internet standardization organizations have not established policies to specify how websites should handle these requests. If you enable Do Not Track in your browser, all Bitmain's websites will respect your selection. III. How Bitmain Shares Your Personal Data We do not share personal data with other companies, organizations and individuals unless one of the following circumstances applies: (1) Sharing with consent: After obtaining your consent, Bitmain will share the information that you have authorized with specified third parties or categories of third parties. (2) Sharing pursuant to laws and regulations: Bitmain may share your information as required by laws and regulations, for resolving legal disputes, or as required by administrative or judiciary authorities pursuant to law. (3) Sharing with Bitmain's affiliates: Your information may be shared within Bitmain's affiliates only for explicit, and legitimate purposes, and the sharing is limited only to information required by services. For example, we verify the global uniqueness of accounts before allowing them to be registered. (4) Sharing with business partners: Some products and/or services are provided to you directly by our partners. Bitmain also may share your information with them, they may use your information to provide you with products and/or services you request (e.g., products sold by third-party seller through Bitmain's e-commerce platform, video content provided by other companies through Bitmain's applications), make predictions about your interests and may provide you with advertisements, promotional materials and other materials (5) Sharing with service providers: Bitmain also may disclose your information to companies that provide services for or on behalf of us. Examples of these service providers include companies that provide hotline services, send email, or provide technical support on behalf of Bitmain. The service providers can use your information only for the purpose of providing services to you on behalf of Bitmain. (6) Bitmain will share your information when there is a reasonable requirement to do so, for example, to meet request of applicable law, regulation, legal process or enforceable government. In scenarios 3 to 6, Bitmain will ensure that the lawfulness of this sharing and sign stringent non-disclosure agreements (NDAs) and/or data processing clauses with the companies, organizations, and individuals with whom personal data is shared, requiring them to comply with this Statement and take appropriate confidentiality and security measures when processing personal data. IV. How Bitmain Protects Your Personal Data Bitmain attaches great importance to the security of your personal data and has adopted standard industry practices to protect your personal data and prevent it from unauthorized access, disclosure, use, modification, damage, or loss. To this end, Bitmain takes the following measures: (1) We take reasonable and feasible measures to ensure that the personal data collected is minimal and relevant to what is necessary in relation to the purposes for which they are processed. We retain your personal data for no longer than is necessary for the purposes stated in this Statement and privacy notice of specific product or service, unless extending the retention period is required or permitted by law. (2) We use a range of technologies such as cryptographic technologies to ensure the confidentiality of data in transmission. We implement trusted protection mechanisms to protect data and data storage servers from attacks. (3) We deploy access control mechanisms to ensure that only authorized personnel can access your personal data. In addition, we control the number of authorized personnel and implement hierarchical permission management on them based on service requirements and personnel levels. (4) We strictly select business partners and service providers and incorporate personal data protection requirements into commercial contracts, audits, and appraisal activities. (5) We hold security and privacy protection training courses, tests, and publicity activities to raise employees' personal data protection awareness. Bitmain is committed to protecting your personal data. Nevertheless, no security measure is perfect and no product, service, website, data transfer, computing system, or network connection is absolutely secure. To cope with possible risks, such as personal data leakage, damage, and loss, Bitmain has developed several mechanisms and control measures, clearly defined the rating standards of security incidents and vulnerabilities and corresponding processing procedure. Bitmain has established a dedicated emergency response team to implement security planning, loss reduction, analysis, locating, and remediation, and to perform tracking operations with related departments based on security incident handling regulations and requirements. If any personal data incident occurs, Bitmain will notify you, pursuant to relevant legal and regulatory requirements, of the basic information about the security incident and its possible impact, measures that Bitmain has taken or will take, suggestions about active defense and risk mitigation, and remedial measures. The notification may take the form of an email, text message, push notification, etc. If it is difficult to notify data subjects one by one, we will take appropriate and effective measures to release a Security Notice. In addition, we will also report the handling status of personal data security incidents as required by supervisory authorities. V. How You Can Manage Your Personal Data A. Access, rectification, deletion, data portability, restriction of processing, objection to processing. Legislation in some countries and regions to which Bitmain provides products and services or from where Bitmain processes personal data, provides that data subjects the rights request (hereinafter referred to as \"requests\") in regards to the accessing, rectifying, deleting or erasure, porting, restricting, and objecting, the processing of related personal data by Bitmain retains. Requesting modes and channels Data subjects' requests must be submitted in accordance with Bitmain designated privacy channels. The requests are valid even when the requester does not specify the laws on which the requests are based. If you would like to request access to your personal data held by us or if you believe any information we are holding on you is incorrect or incomplete, please submit your request to our online service. A copy of your personal data collected and processed by us will be provided to you upon your request free of charge. For any extra requests of the same information, we may charge a reasonable fee based on actual administrative costs according to the applicable laws. Validity of requests Most laws require data subjects to comply with specific requirements when they initiate requests. This Statement requires data subjects to: (1) Submit requests to our online service. (2) Provide sufficient information for Bitmain to verify their identities (to ensure those who initiate the requests are the data subjects themselves or those authorized by them). (3) Ensure that their requests are specific and feasible. There are some circumstances, provided by laws and regulations, in which Bitmain may not have to comply with the request in full or at all. B. Consent withdrawal You can change the authorized personal data collection scope or withdraw your consent without affecting the lawfulness of the processing activities based on the consent and prior to such withdraw. Your rights can be exercised by deleting information, disabling related functions, or setting privacy options on your Bitmain's product. Bitmain will release the methods for withdrawing consent for specific products and services in the privacy notice or supplementary statement of those products and services or upon request according to section A above. C. Deregistering a Bitmain ID You can deregister your account in Bitmain ID-related products. After you deregister your account, we will stop providing products and services, and delete your personal data unless otherwise stipulated by law. Your account cannot be restored after deregistration. You need to register a new Bitmain ID if you want to use related Bitmain's products or services again. You can submit a deregistration application and complete the process in setting menu after logging in to your Bitmain ID on related devices, applications or official website. VI. How Bitmain Protects Children's Personal Data We consider it the responsibility of parents to monitor their children's use of our products and services. Nevertheless, it is our policy not to require personal information from children or offer to send any promotional materials to persons in that category. Bitmain does not seek or intend to seek to receive any personal information from children. Should a parent or guardian have reasons to believe that a child has provided Bitmain with personal information without their prior consent, please contact us to ensure that the personal information is removed and the child unsubscribes from any of the applicable Bitmain's services. VII. Links to Third-Party Websites, Products, and Services Bitmain's websites, application software, products, and services may contain links to third-party websites, products, and services. Bitmain's products and services may also use or provide products or services from third parties. All links to third-party websites, products, and services are provided for users' convenience only. We are not responsible for and cannot control how third-parties use personal information which they collect from you. Our does not apply to other sites linked from our services. You need to determine your interaction with such links on your own. Before submitting your personal data to third parties, please read and refer to these third parties' privacy policies. VIII. International Transfers of Your Personal Data Our products and services are delivered through resources and servers located in different places, to offer our products and services, we may need to transfer your personal data among several countries. Authorized Bitmain personnel and third parties acting on our behalf may access, use and process personal data collected from you in a country/region that is different from the country/region where you entered the personal data, which may have less stringent data protection laws. When we transfer your personal data to other countries/regions, we will protect that the personal data as described in this statement or as otherwise disclosed to you at the time the data is collected (e.g. via privacy notice or supplementary statement of specific product or service). Bitmain has implemented global privacy practices for processing personal data protected under various data protection laws. Bitmain transfers personal data between the countries in which we operate in accordance with the standards and conditions of applicable data protection laws, including standards and conditions related to security and processing. With respect to personal data coming from the EU, we comply with applicable legal requirements providing adequate safeguards for the transfer of personal data to countries outside of the European Economic Area (\"EEA\"). We use a variety of legal mechanisms, such as standard contractual clauses to implement the cross-border transfer of your personal data; or implement other safeguards provided for in the GDPR. IX. Updates to This Statement Bitmain reserves the right to update this Statement at any time. Should this Statement be revised from time to time, Bitmain will release the change notice via various channels, for example, posting the latest version on our official website: https://www.bitmain.com.If we make any material changes we may notify you by means of a notice on this website. \"Material changes\" in this Statement include but are not limited to: (1) Material changes in our service modes, for example, purposes of personal data processing, types of processed personal data, and ways of using personal data (2) Material changes in our ownership structure, organizational structure, etc., for example, ownership changes caused by business adjustment, bankruptcy, or acquisition (3) Changes in the main objects of personal data sharing, transfer, or disclosure (4) Material changes in your rights regarding personal data processing and the ways in which you can enjoy those rights (5) Changes of Bitmain's departments, contacts, and complaint channels responsible for the security of personal data processing (6) High risks identified in personal data security impact assessment reports X. How to Contact Us If you have any questions or concerns about our Sites, Products or Services, our use of your information or this Policy, please contact our Online Service or contact us by visiting https://www.bitmain.com/contact or submitting it to account-help@bitmain.com . Note: Due to differences in local laws and languages, the local versions of Bitmain's Privacy Statement may be different from this version. In the case of any conflicts, the local versions shall prevail. Copyright . The Bitmain Privacy Statement Bitmain Group and its global affiliates (collectively, \"Bitmain\", \"we\", \"us\", and \"our\") respect your privacy. Therefore, we have developed a Privacy Statement (hereinafter referred to as \"this Statement\") that covers how we collect, use, disclose, protect, store and transfer your personal data when using our websites, products or services. Please take a moment to read and understand our Privacy Statement and let us know if you have any questions. Personal data means any electronic or other information which alone or jointly with other information can be used to identify a natural person or make him/her identifiable. This Statement explains how Bitmain processes your personal data, but does not cover all processing scenarios as you will be informed in specific processing activity. Therefore, before using a specific product or service, it is recommended that you read the privacy notice or supplementary statement released by Bitmain for that product or service to understand how it processes your personal data. This Statement applies only to websites, product and services that display or mention this Statement. How Bitmain Collects and Uses Your Personal Data How Bitmain Uses Cookies and Similar Technologies How Bitmain Shares Your Personal Data How Bitmain Protects Your Personal Data How You Can Manage Your Personal Data How Bitmain Protects Children's Personal Data Links to Third-Party Websites, Products, and Services International Transfers of Your Personal Data Updates to This Statement How to Contact Us I. How Bitmain Collects and Uses Your Personal Data A. Personal Data Collected by Bitmain Personal data means any data that, either on its own or jointly with other data, can be used to identify a natural person. You directly provide us with such data when you use our websites, products, or services, or interact with us by, for example, creating a Bitmain account or contacting us for support. We may also obtain data by recording how you interact with our websites, products, or services. For example, we may use technologies like cookies or receive use data from software running on your device. As permitted by law, we may also obtain data from public and commercial third-party sources, for example, purchasing statistics from other companies to support our services. The personal data we collect includes name, enterprise name, postal and email addresses, phone number, login information (account and password), photos, and certificate information, etc., depending on how you interact with Bitmain, for example, the website you visit or the products and services that you use. We also collect the information you provide to us and the content of messages you send us, such as the query information you provide, or the questions or information you provide for customer service support. In addition, we may also collect Non-identifiable data, which refers to data that cannot be used to identify an individual, for example, the statistics on website visits, application downloads, and product sales volume. Before using our products or services, you may need to provide personal data. You do not have to provide your personal data to Bitmain, but in some cases, the non-provision of certain personal data will cause the inability to provide you with some related products or services. B. How Bitmain Uses Your Personal Data Bitmain may use your personal data for the following purposes: (1) Register a Bitmain ID. (2) Information relating to e-commerce orders may be used for processing the purchase order and related after-sales services, including customer support and re-delivery. In addition, the order number is used to cross check the order with the delivery partner as well as the actual delivery of the parcel. The receipt details, including name, address, phone number and postal code are for delivery purposes. The email address is used to send parcel tracking information to the user. The list of purchased item(s) is used for printing the invoice and allowing users to see what is in the parcel. (3) Deliver, activate, or verify the products and services you have requested, or perform changes and provide technical support and after-sales services for the foregoing products and services based on your requirements. (4) Send you important notifications. (5) Provide personalized user experience and content. (6) Send you information about products and services you might be interested in, invite you to Bitmain's promotional activities and market surveys, or send marketing information to you. If you do not want to receive such information, you can opt out at any time. (7) Collect user feedback. The feedback you choose to provide is important to help Bitmain improve its services. To process your feedback, we may use the personal information you provide to contact you and keep records. (8) Carry out internal auditing, data analysis, and research; analyze business operation efficiency and measure market shares; and improve Bitmain's products and services. (9) Troubleshooting when you send us error reports. (10) Ensuring the security of our products, services and customers or users. (11) Process pursuant to laws and regulations, e.g. tax, authority requests. (12) Other purposes within specific services or with your consent. II.How Bitmain Uses Cookies and Similar Technologies Bitmain's websites, online services, interactive applications, email messages, and advertisements may use \"cookies\" and other technologies such as pixel tags and web beacons. These technologies help us better understand user behavior, tell us which parts of our websites people have visited, and facilitate and measure the effectiveness of advertisements and web searches. We treat information collected by cookies and other technologies as non‑personal information. However, to the extent that Internet Protocol (IP) addresses or similar identifiers are considered personal information by local law, we also treat these identifiers as personal information. A cookie is a text file stored by a web server on a computer or mobile device, and the content of a cookie can be retrieved and read only by the server that created the cookie. Cookies are unique to the browser or mobile application you are using. The text in a cookie often consists of identifiers, site names, and some numbers and characters. Sometimes, Bitmain stores cookies on computers or mobile devices for the purpose of improving user experience, including the following scenarios: (1) Technical cookies: Login and verification. When you use a Bitmain ID to to a website, the \"session-based\" cookies ensure that your visit to this site functions as smoothly as possible. (2) Personalization cookies: Storage of your preferences and settings. A website can use cookies to save settings, such as the language setting and font size on your computer or mobile device, items in your shopping cart, and other browser preferences. (3) Advertising cookies. Bitmain uses cookies to collect information about your online activities and interests and provide you with advertisements that correlate most highly with you. (4) Statistical cookies. With cookies, Bitmain can collect information about your use of our websites and other applications, either for a single visit (using a session cookie) or for repeated visits (using a persistent cookie). You can manage or delete cookies at your own preference. For details, visit AboutCookies.org . You can clear all the cookies stored on your computer, and most current web browsers provide the option of blocking cookies. However, blocking cookies will require you to change your user settings every time you visit our website. Find out how to manage for your browser here: Internet Explorer > Google Chrome > Mozilla Firefox > Safari > Opera . If you clear cookies, you will need to change your settings the next time you visit Bitmain's websites. Note that some Bitmain's services require the use of cookies. Disabling cookies may affect your use of some or all functions of these services. B. Web Beacons and Pixel Tags In addition to cookies, Bitmain and some third parties may also use web beacons and pixel tags on websites. A web beacon is usually an electronic graphic image embedded into a website or email to identify your device cookies when you browse the website or email. Pixel tags allow Bitmain to send emails in a way that is readable to you and find out whether an email is opened. Bitmain and some third parties use these technologies for various purposes, including analysing service usage (together with cookies) and providing more satisfactory content and advertisements to you. For example, when you receive an email from Bitmain, it may contain a click-through URL which links to a Bitmain web page. If you click the link, Bitmain will track your visit to help us learn about your preferences for products and services and improve our customer service. You can unsubscribe from the mailing list of Bitmain at any time if you do not want to be tracked in this manner. C. Other Local Storage Bitmain and some third parties may use other local storage technologies, for example, local shared objects (also called \"Flash cookies\") and HTML5 local storage, in certain products and services. Similar to cookies, these technologies store information on your device and can record some information about your activities and preferences. However, these technologies may use different media from cookies. Therefore, you may not be able to control them using standard browser tools and settings. For details about how to disable or delete information contained in Flash cookies, . D. Do Not Track Many web browsers provide a Do Not Track function that can release Do Not Track requests to websites. Currently, major Internet standardization organizations have not established policies to specify how websites should handle these requests. If you enable Do Not Track in your browser, all Bitmain's websites will respect your selection. III. How Bitmain Shares Your Personal Data We do not share personal data with other companies, organizations and individuals unless one of the following circumstances applies: (1) Sharing with consent: After obtaining your consent, Bitmain will share the information that you have authorized with specified third parties or categories of third parties. (2) Sharing pursuant to laws and regulations: Bitmain may share your information as required by laws and regulations, for resolving legal disputes, or as required by administrative or judiciary authorities pursuant to law. (3) Sharing with Bitmain's affiliates: Your information may be shared within Bitmain's affiliates only for explicit, and legitimate purposes, and the sharing is limited only to information required by services. For example, we verify the global uniqueness of accounts before allowing them to be registered. (4) Sharing with business partners: Some products and/or services are provided to you directly by our partners. Bitmain also may share your information with them, they may use your information to provide you with products and/or services you request (e.g., products sold by third-party seller through Bitmain's e-commerce platform, video content provided by other companies through Bitmain's applications), make predictions about your interests and may provide you with advertisements, promotional materials and other materials (5) Sharing with service providers: Bitmain also may disclose your information to companies that provide services for or on behalf of us. Examples of these service providers include companies that provide hotline services, send email, or provide technical support on behalf of Bitmain. The service providers can use your information only for the purpose of providing services to you on behalf of Bitmain. (6) Bitmain will share your information when there is a reasonable requirement to do so, for example, to meet request of applicable law, regulation, legal process or enforceable government. In scenarios 3 to 6, Bitmain will ensure that the lawfulness of this sharing and sign stringent non-disclosure agreements (NDAs) and/or data processing clauses with the companies, organizations, and individuals with whom personal data is shared, requiring them to comply with this Statement and take appropriate confidentiality and security measures when processing personal data. IV. How Bitmain Protects Your Personal Data Bitmain attaches great importance to the security of your personal data and has adopted standard industry practices to protect your personal data and prevent it from unauthorized access, disclosure, use, modification, damage, or loss. To this end, Bitmain takes the following measures: (1) We take reasonable and feasible measures to ensure that the personal data collected is minimal and relevant to what is necessary in relation to the purposes for which they are processed. We retain your personal data for no longer than is necessary for the purposes stated in this Statement and privacy notice of specific product or service, unless extending the retention period is required or permitted by law. (2) We use a range of technologies such as cryptographic technologies to ensure the confidentiality of data in transmission. We implement trusted protection mechanisms to protect data and data storage servers from attacks. (3) We deploy access control mechanisms to ensure that only authorized personnel can access your personal data. In addition, we control the number of authorized personnel and implement hierarchical permission management on them based on service requirements and personnel levels. (4) We strictly select business partners and service providers and incorporate personal data protection requirements into commercial contracts, audits, and appraisal activities. (5) We hold security and privacy protection training courses, tests, and publicity activities to raise employees' personal data protection awareness. Bitmain is committed to protecting your personal data. Nevertheless, no security measure is perfect and no product, service, website, data transfer, computing system, or network connection is absolutely secure. To cope with possible risks, such as personal data leakage, damage, and loss, Bitmain has developed several mechanisms and control measures, clearly defined the rating standards of security incidents and vulnerabilities and corresponding processing procedure. Bitmain has established a dedicated emergency response team to implement security planning, loss reduction, analysis, locating, and remediation, and to perform tracking operations with related departments based on security incident handling regulations and requirements. If any personal data incident occurs, Bitmain will notify you, pursuant to relevant legal and regulatory requirements, of the basic information about the security incident and its possible impact, measures that Bitmain has taken or will take, suggestions about active defense and risk mitigation, and remedial measures. The notification may take the form of an email, text message, push notification, etc. If it is difficult to notify data subjects one by one, we will take appropriate and effective measures to release a Security Notice. In addition, we will also report the handling status of personal data security incidents as required by supervisory authorities. V. How You Can Manage Your Personal Data A. Access, rectification, deletion, data portability, restriction of processing, objection to processing. Legislation in some countries and regions to which Bitmain provides products and services or from where Bitmain processes personal data, provides that data subjects the rights request (hereinafter referred to as \"requests\") in regards to the accessing, rectifying, deleting or erasure, porting, restricting, and objecting, the processing of related personal data by Bitmain retains. Requesting modes and channels Data subjects' requests must be submitted in accordance with Bitmain designated privacy channels. The requests are valid even when the requester does not specify the laws on which the requests are based. If you would like to request access to your personal data held by us or if you believe any information we are holding on you is incorrect or incomplete, please submit your request to our online service. A copy of your personal data collected and processed by us will be provided to you upon your request free of charge. For any extra requests of the same information, we may charge a reasonable fee based on actual administrative costs according to the applicable laws. Most laws require data subjects to comply with specific requirements when they initiate requests. This Statement requires data subjects to: (1) Submit requests to our online service. (2) Provide sufficient information for Bitmain to verify their identities (to ensure those who initiate the requests are the data subjects themselves or those authorized by them). (3) Ensure that their requests are specific and feasible. There are some circumstances, provided by laws and regulations, in which Bitmain may not have to comply with the request in full or at all. You can change the authorized personal data collection scope or withdraw your consent without affecting the lawfulness of the processing activities based on the consent and prior to such withdraw. Your rights can be exercised by deleting information, disabling related functions, or setting privacy options on your Bitmain's product. Bitmain will release the methods for withdrawing consent for specific products and services in the privacy notice or supplementary statement of those products and services or upon request according to section A above. C. Deregistering a Bitmain ID You can deregister your account in Bitmain ID-related products. After you deregister your account, we will stop providing products and services, and delete your personal data unless otherwise stipulated by law. Your account cannot be restored after deregistration. You need to register a new Bitmain ID if you want to use related Bitmain's products or services again. You can submit a deregistration application and complete the process in setting menu after logging in to your Bitmain ID on related devices, applications or official website. VI. How Bitmain Protects Children's Personal Data We consider it the responsibility of parents to monitor their children's use of our products and services. Nevertheless, it is our policy not to require personal information from children or offer to send any promotional materials to persons in that category. Bitmain does not seek or intend to seek to receive any personal information from children. Should a parent or guardian have reasons to believe that a child has provided Bitmain with personal information without their prior consent, please contact us to ensure that the personal information is removed and the child unsubscribes from any of the applicable Bitmain's services. VII. Links to Third-Party Websites, Products, and Services Bitmain's websites, application software, products, and services may contain links to third-party websites, products, and services. Bitmain's products and services may also use or provide products or services from third parties. All links to third-party websites, products, and services are provided for users' convenience only. We are not responsible for and cannot control how third-parties use personal information which they collect from you. Our does not apply to other sites linked from our services. You need to determine your interaction with such links on your own. Before submitting your personal data to third parties, please read and refer to these third parties' privacy policies. VIII. International Transfers of Your Personal Data Our products and services are delivered through resources and servers located in different places, to offer our products and services, we may need to transfer your personal data among several countries. Authorized Bitmain personnel and third parties acting on our behalf may access, use and process personal data collected from you in a country/region that is different from the country/region where you entered the personal data, which may have less stringent data protection laws. When we transfer your personal data to other countries/regions, we will protect that the personal data as described in this statement or as otherwise disclosed to you at the time the data is collected (e.g. via privacy notice or supplementary statement of specific product or service). Bitmain has implemented global privacy practices for processing personal data protected under various data protection laws. Bitmain transfers personal data between the countries in which we operate in accordance with the standards and conditions of applicable data protection laws, including standards and conditions related to security and processing. With respect to personal data coming from the EU, we comply with applicable legal requirements providing adequate safeguards for the transfer of personal data to countries outside of the European Economic Area (\"EEA\"). We use a variety of legal mechanisms, such as standard contractual clauses to implement the cross-border transfer of your personal data; or implement other safeguards provided for in the GDPR. IX. Updates to This Statement Bitmain reserves the right to update this Statement at any time. Should this Statement be revised from time to time, Bitmain will release the change notice via various channels, for example, posting the latest version on our official website: https://www.bitmain.com.If we make any material changes we may notify you by means of a notice on this website. \"Material changes\" in this Statement include but are not limited to: (1) Material changes in our service modes, for example, purposes of personal data processing, types of processed personal data, and ways of using personal data (2) Material changes in our ownership structure, organizational structure, etc., for example, ownership changes caused by business adjustment, bankruptcy, or acquisition (3) Changes in the main objects of personal data sharing, transfer, or disclosure (4) Material changes in your rights regarding personal data processing and the ways in which you can enjoy those rights (5) Changes of Bitmain's departments, contacts, and complaint channels responsible for the security of personal data processing (6) High risks identified in personal data security impact assessment reports X. How to Contact Us If you have any questions or concerns about our Sites, Products or Services, our use of your information or this Policy, please contact our Online Service or contact us by visiting https://www.bitmain.com/contact or submitting it to account-help@bitmain.com . Note: Due to differences in local laws and languages, the local versions of Bitmain's Privacy Statement may be different from this version. In the case of any conflicts, the local versions shall prevail. Copyright .",
    "Antminer is an application-specific integrated circuit (ASIC) mining hardware series launched in 2013, perfect for mining cryptocurrencies. Antminer is proudly designed and manufactured by Bitmain and has established itself as a household name in the blockchain community. The Antminer brand signifies leading technical specifications and excellence in product quality for ASIC mining. Antminer,with its superior performance and power efficiency ,is the market loader in the blockchain mining industry. SHOP NOW Antminer is an application-specific integrated circuit (ASIC) mining hardware series launched in 2013, perfect for mining cryptocurrencies. Antminer is proudly designed and manufactured by Bitmain and has established itself as a household name in the blockchain community. The Antminer brand signifies leading technical specifications and excellence in product quality for ASIC mining. Antminer,with its superior performance and power efficiency ,is the market loader in the blockchain mining industry. ANTBOX Antbox is an independent mining farm that reduces the lengthy cycle of constructing data facilities. It is easily deployable and can be moved at any time to any place, making it advantageous for large scale deployment. The AntBox assembly design structure supports stacking (three stackable layers and six arrays distancing from left to right), which optimizes mining operations. It features an eco-friendly and energy-saving design structure, heat dissipation technology, and advanced safety measure protocols. Perfect fit for the Antminer 19/17 Series and is compatible with older series miners. SHOP NOW Antbox is an independent mining farm that reduces the lengthy cycle of constructing data facilities. It is easily deployable and can be moved at any time to any place, making it advantageous for large scale deployment. The AntBox assembly design structure supports stacking (three stackable layers and six arrays distancing from left to right), which optimizes mining operations. It features an eco-friendly and energy-saving design structure, heat dissipation technology, and advanced safety measure protocols. Perfect fit for the Antminer 19/17 Series and is compatible with older series miners. ANTRACK AntRack is a rack-style mining hardware that adopts a pioneering hot-swappable modularized configuration. The hash board, control panel, power supply unit (PSU), and fans, are essential parts that are hot-swappable for continuous and optimized operations. AntRack is easily upgradable. When the new generation chipsets are released, the current hash boards can be easily replaced with the latest ones, effectively upgrading the current AntRack with the most efficient hash rates and power efficiency. COMING SOON AntRack is a rack-style mining hardware that adopts a pioneering hot-swappable modularized configuration. The hash board, control panel, power supply unit (PSU), and fans, are essential parts that are hot-swappable for continuous and optimized operations. AntRack is easily upgradable. When the new generation chipsets are released, the current hash boards can be easily replaced with the latest ones, effectively upgrading the current AntRack with the most efficient hash rates and power efficiency. ASIC VS GPU miner In of mining, there are numerous methods used in order to mine cryptocurrencies. The two most popular method of mining is done through the method of ASIC and GPU mining. ASIC miners are purpose-built to do one thing and one thing it does best, mine cryptocurrencies based on the algorithm it utilizes. Such as the popular cryptocurrency Bitcoin (BTC) or Bitcoin Cash (BCH), which both utilizes the SHA256 algorithm. ASIC miners are able to solve complex mathematical problems needed that is an integral part that ensures fairness while keeping the network stable, safe and secure. Other cryptocurrencies utilize different algorithms, and there are specific ASIC miners produced to mine those most efficiently. ASIC VS GPU miner In of mining, there are numerous methods used in order to mine cryptocurrencies. The two most popular method of mining is done through the method of ASIC and GPU mining. ASIC miners are purpose-built to do one thing and one thing it does best, mine cryptocurrencies based on the algorithm it utilizes. Such as the popular cryptocurrency Bitcoin (BTC) or Bitcoin Cash (BCH), which both utilizes the SHA256 algorithm. ASIC miners are able to solve complex mathematical problems needed that is an integral part that ensures fairness while keeping the network stable, safe and secure. Other cryptocurrencies utilize different algorithms, and there are specific ASIC miners produced to mine those most efficiently. ANTMINER S19 SERIES The next-generation of Antminers. The Antminer 19 Series (Antminer T19/S19/S19 Pro) are the latest models from the Antminer brand. Designed with new custom-built chips and a new software interface, the 19 Series achieves industry-leading hash rates. Specifications Antminer T19 Antminer S19 Antminer S19 Pro Rated Hash Rate 84 TH/s 95 TH/s 110 TH/s Power Consumption 3150 W ± 5% 3250 W ± 5% 3250 W ± 5% Power Efficiency 37.5 J/T ± 5% 34.5 J/T ± 5% 29.5 J/T ± 5% Net weight 14.2 kg 14.4 kg 13.2 kg Dimensions 400mm*195.5mm*290mm 400mm*195.5mm*290mm 370mm*195.5mm*290mm The next-generation of Antminers. The Antminer 19 Series (Antminer T19/S19/S19 Pro) are the latest models from the Antminer brand. Designed with new custom-built chips and a new software interface, the 19 Series achieves industry-leading hash rates. 19 Series Technology New Generation Custom Built Chip The Antminer 19 series is equipped with a new generation custom-built chip designed by Bitmain, achieving a power efficiency as low as 23 J/TH. This was achieved by enhancing the circuit architecture, greatly improving power efficiency. Industry-Leading Hash Rates, Reaching Over 100 TH/s The next-generation Antminer T19 is equipped with a hash rate of 84 TH/s and the S19 is equipped with a hash rate of 95 TH/s. The Antminer S19 Pro version is further improved, featuring a hash rate of 110 TH/s. Efficient Power Supply The new APW12 high-conversion energy-efficient power supply offers enhanced stability. The new power supply, in conjunction with the 19 Series, work to deliver superior performance, enabling miners to optimize earnings and is designed for better operations ensuring long-term operations. Advanced Firmware New firmware also introduces faster startup speed and an intelligent control mechanism to ensure the best mining experience. New Generation Custom Built Chip The Antminer 19 series is equipped with a new generation custom-built chip designed by Bitmain, achieving a power efficiency as low as 23 J/TH. This was achieved by enhancing the circuit architecture, greatly improving power efficiency. New Generation Custom Built Chip The Antminer 19 series is equipped with a new generation custom-built chip designed by Bitmain, achieving a power efficiency as low as 23 J/TH. This was achieved by enhancing the circuit architecture, greatly improving power efficiency. Industry-Leading Hash Rates, Reaching Over 100 TH/s The next-generation Antminer T19 is equipped with a hash rate of 84 TH/s and the S19 is equipped with a hash rate of 95 TH/s. The Antminer S19 Pro version is further improved, featuring a hash rate of 110 TH/s. Industry-Leading Hash Rates, Reaching Over 100 TH/s The next-generation Antminer T19 is equipped with a hash rate of 84 TH/s and the S19 is equipped with a hash rate of 95 TH/s. The Antminer S19 Pro version is further improved, featuring a hash rate of 110 TH/s. Efficient Power Supply The new APW12 high-conversion energy-efficient power supply offers enhanced stability. The new power supply, in conjunction with the 19 Series, work to deliver superior performance, enabling miners to optimize earnings and is designed for better operations ensuring long-term operations. The new APW12 high-conversion energy-efficient power supply offers enhanced stability. The new power supply, in conjunction with the 19 Series, work to deliver superior performance, enabling miners to optimize earnings and is designed for better operations ensuring long-term operations. Advanced Firmware New firmware also introduces faster startup speed and an intelligent control mechanism to ensure the best mining experience. New firmware also introduces faster startup speed and an intelligent control mechanism to ensure the best mining experience. Evolution of Antminer The Antminer brand has a long history of providing the most reliable and power-efficient ASIC miners in the market. Launching the very first miner (Antminer S1) in 2013, every succeeding new miner which followed has delivered enhanced hash rates and power efficiency, mainly popularized by the Antminer S9. Antminers have been providing the market with reliable and stable hardware products. The most latest series, the Antminer 19 series, leads the market through the Antminer T19, Antminer S19, and the Antminer S19 Pro. Antimers have a long history in providing miners in the market. Starting from 2013 by launching the very first miner (Antminer S1) and succeeding new miners which have an enhanced hash power and efficiency, mainly popularized by the Antminers. Antiners have been providing the market with reliable and stable hardware products. The Antminer brand has a long history of providing the most reliable and power-efficient ASIC miners in the market. Launching the very first miner (Antminer S1) in 2013, every succeeding new miner which followed has delivered enhanced hash rates and power efficiency, mainly popularized by the Antminer S9. Antminers have been providing the market with reliable and stable hardware products. The most latest series, the Antminer 19 series, leads the market through the Antminer T19, Antminer S19, and the Antminer S19 Pro. Antimers have a long history in providing miners in the market. Starting from 2013 by launching the very first miner (Antminer S1) and succeeding new miners which have an enhanced hash power and efficiency, mainly popularized by the Antminers. Antiners have been providing the market with reliable and stable hardware products. ANTBOX Say hello to your own independent mining farm Perfect fit for the Antminer 19/17 Series and is compatible with older series miners. The AntBox assembly design structure supports stacking (three stackable layers and six arrays distancing from left to right), which optimizes mining operations. Vertical Assembly: Up to 3 connected units Horizontal Assembly: Up to 6 connected units Say hello to your own independent mining farm Perfect fit for the Antminer 19/17 Series and is compatible with older series miners. The AntBox assembly design structure supports stacking (three stackable layers and six arrays distancing from left to right), which optimizes mining operations. Vertical Assembly: Up to 3 connected units Horizontal Assembly: Up to 6 connected units ANTRACK Hot-Swappable Design The AntRack's Hash Board, Control Board, Power Supply Unit, and Fans are all hot-swappable for optimized operations Design Modules The AntRack includes five modules: 1 Rack, 1 Power Distribution Unit, 4 Servers, 1 Management Unit, and 1 Water Cooling Unit Easy to Deploy The AntRack utilizes a 3-phase AC power cable, 1 network cable, and 1 inlet & 1 outlet for the water cooling system that can easily be deployed. Easy to Upgrade The hot-swappable design of the AntRack allows replacing the hash board with new generation chipsets (7nm to 5nm, 3nm, and 1nm), each upgrade improves the overall computing power while maintaining the same power consumption. Power Supply Reliability Every server of the AntRack has PSU's which provide 3+1 redundant operations to ensure that mining is never interrupted. The AntRack's Hash Board, Control Board, Power Supply Unit, and Fans are all hot-swappable for optimized operations The AntRack includes five modules: 1 Rack, 1 Power Distribution Unit, 4 Servers, 1 Management Unit, and 1 Water Cooling Unit The AntRack utilizes a 3-phase AC power cable, 1 network cable, and 1 inlet & 1 outlet for the water cooling system that can easily be deployed. The hot-swappable design of the AntRack allows replacing the hash board with new generation chipsets (7nm to 5nm, 3nm, and 1nm), each upgrade improves the overall computing power while maintaining the same power consumption. Every server of the AntRack has PSU's which provide 3+1 redundant operations to ensure that mining is never interrupted.",
    "Cutting-edge ASIC chips technology Our R&D team, containing some of the world's foremost experts in ASIC design, continues to lead the industry in the development of bitcoin transaction processing technology. Since 2013, Bitmain has maintained an exception track record producing and delivering top of the line bitcoin miners to consumers and enterprise users alike. Our ASIC chips continue to set the industry standard. The most comprehensive hardware and service provider in bitcion mining industry We provide state-of-the-art ASIC chips, hardware, software solutions, cloud mining, and one of the world's largest mining pools to customers in more than 100 countries. We make it easy to mine bitcoin, any time and any place. Empowering the next generation of money Bitcoin is the world's first truly open global payments network; it makes transacting money safer, faster, and cheaper than legacy payments systems. Since we got started in 2013, Bitmain has been dedicated to helping maintain the transparency and security of the Bitcoin network. Cutting-edge ASIC chips technology Our R&D team, containing some of the world's foremost experts in ASIC design, continues to lead the industry in the development of bitcoin transaction processing technology. Since 2013, Bitmain has maintained an exception track record producing and delivering top of the line bitcoin miners to consumers and enterprise users alike. Our ASIC chips continue to set the industry standard. The most comprehensive hardware and service provider in bitcion mining industry We provide state-of-the-art ASIC chips, hardware, software solutions, cloud mining, and one of the world's largest mining pools to customers in more than 100 countries. We make it easy to mine bitcoin, any time and any place. Empowering the next generation of money Bitcoin is the world's first truly open global payments network; it makes transacting money safer, faster, and cheaper than legacy payments systems. Since we got started in 2013, Bitmain has been dedicated to helping maintain the transparency and security of the Bitcoin network. Products and Services The AntMiner S5, our latest generation of miner, is outfitted with our new 28nm ASIC chips. The S5 features a 30% higher hashrate and a 20% lower power consumption over the previous generation of AntMiner. Learn More AntPool has maintained its position as one of the largest mining pools in the world. Offering PPLNS payouts, real-time miner monitoring, and no pool fees, AntPool makes mining bitcoin efficient and easy. The world's largest and most trusted cloud mining platform. Hashnest lets you participate in bitcoin mining without maintaining the hardware yourself. Our mining data centers are distributed around the world and have a 99.9% uptime. The first remote miner monitoring tool. It's free to use, and allows you to monitor and control your individual miner units in real-time. The AntMiner S5, our latest generation of miner, is outfitted with our new 28nm ASIC chips. The S5 features a 30% higher hashrate and a 20% lower power consumption over the previous generation of AntMiner. AntPool has maintained its position as one of the largest mining pools in the world. Offering PPLNS payouts, real-time miner monitoring, and no pool fees, AntPool makes mining bitcoin efficient and easy. The world's largest and most trusted cloud mining platform. Hashnest lets you participate in bitcoin mining without maintaining the hardware yourself. Our mining data centers are distributed around the world and have a 99.9% uptime. The first remote miner monitoring tool. It's free to use, and allows you to monitor and control your individual miner units in real-time. Bitmain is a global company We operate several large bitcoin mining data centers throughout the United States and China. Our headquarters are located in Beijing, with additional offices in Hong Kong, San Francisco, and Chengdu. Our factory is located in Shenzhen Bitmain is a global company We have the most market share in the bitcoin mining industry customers in 100+ countries Global market share of bitcoin miners 56% Cloud mining global rank 1st Mining pool global rank 2nd We have the most market share in the bitcoin mining industry Global market share of bitcoin miners Cloud mining global rank Mining pool global rank"
  ]
}