{
  "company": "www.ambarella.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. Explore our Technologies Automotive Security Consumer Industrial & Robotics People Signs Objects Vehicles Environment & depth 360-degree object detection At long range And short range From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Discover now Smart Surveillance Solutions Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Discover now News & Events Nov 25 Ambarella, Inc. Announces Third Quarter and Fiscal Year 2020 Financial Results Nov 15 Ambarella to Present at the Deutsche Bank 2019 Auto Tech Conference December 10, 2019 Nov 08 Ambarella to Present at the 41st NASDAQ Investor Conference Dec. 3rd AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. Explore our Technologies Automotive Security Consumer Industrial & Robotics People Signs Objects Vehicles Environment & depth AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. 360-degree object detection At long range And short range From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Discover now From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Smart Surveillance Solutions Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Discover now Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Nov 25 Ambarella, Inc. Announces Third Quarter and Fiscal Year 2020 Financial Results Nov 15 Ambarella to Present at the Deutsche Bank 2019 Auto Tech Conference December 10, 2019 Nov 08 Ambarella to Present at the 41st NASDAQ Investor Conference Dec. 3rd Nov 25 Ambarella, Inc. Announces Third Quarter and Fiscal Year 2020 Financial Results Ambarella, Inc. Announces Third Quarter and Fiscal Year 2020 Financial Results Nov 15 Ambarella to Present at the Deutsche Bank 2019 Auto Tech Conference December 10, 2019 Ambarella to Present at the Deutsche Bank 2019 Auto Tech Conference December 10, 2019 Nov 08 Ambarella to Present at the 41st NASDAQ Investor Conference Dec. 3rd Ambarella to Present at the 41st NASDAQ Investor Conference Dec. 3rd",
    "AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. Explore our Technologies Automotive Security Consumer IoT, Industrial & Robotics People Signs Objects Vehicles Environment & depth 360-degree object detection At long range And short range From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Discover now Smart Surveillance Solutions Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Discover now News & Events Aug 28 Ambarella, Inc. Announces Second Quarter Fiscal Year 2026 Financial Results May 29 Ambarella, Inc. Announces First Quarter Fiscal Year 2026 Financial Results Mar 31 Ambarella Debuts Next-Generation Edge GenAI Technology at ISC West, Including Reasoning Models Running on its CVflow速 Edge AI SoCs AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. Explore our Technologies Automotive Security Consumer IoT, Industrial & Robotics People Signs Objects Vehicles Environment & depth AI Vision Processors For Edge Applications Our solutions make cameras smarter by extracting valuable data from high-resolution video streams. 360-degree object detection At long range And short range From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Discover now From ADAS to Autonomy With advanced driver assistance systems, smart electronic mirrors, drive recorders, autonomous vehicles and more, Ambarella is committed to preparing you for the road ahead. Smart Surveillance Solutions Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Discover now Our intelligent video devices use face detection, analytics, and multi-object CNN classification to enhance security in businesses and homes, without the need for the cloud. Aug 28 Ambarella, Inc. Announces Second Quarter Fiscal Year 2026 Financial Results May 29 Ambarella, Inc. Announces First Quarter Fiscal Year 2026 Financial Results Mar 31 Ambarella Debuts Next-Generation Edge GenAI Technology at ISC West, Including Reasoning Models Running on its CVflow速 Edge AI SoCs Aug 28 Ambarella, Inc. Announces Second Quarter Fiscal Year 2026 Financial Results Ambarella, Inc. Announces Second Quarter Fiscal Year 2026 Financial Results May 29 Ambarella, Inc. Announces First Quarter Fiscal Year 2026 Financial Results Ambarella, Inc. Announces First Quarter Fiscal Year 2026 Financial Results Mar 31 Ambarella Debuts Next-Generation Edge GenAI Technology at ISC West, Including Reasoning Models Running on its CVflow速 Edge AI SoCs Ambarella Debuts Next-Generation Edge GenAI Technology at ISC West, Including Reasoning Models Running on its CVflow速 Edge AI SoCs"
  ]
}