{
  "company": "www.multivutech.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1
    }
  },
  "sample_docs": [
    "If you are reading this, it is because your browser does not support the HTML5 video element. MultiVu is developing a single sensor 3D imaging solution, which can take 3D color images and function as a traditional camera with enhanced features. The technology is comprised of a single modified digital sensor accompanied by advanced AI algorithms. The result is a 3D camera, which is both compact, cost effective and energy efficient. While our initial use case is face authentication, our camera has applications in the medical, automotive, secured access and industrial markets. Depth sensing technology has become essential in a multitude of applications where 2D images present significant disadvantages. The leading example of this is facial recognition, which has become a key part of high-end smartphones and secure access systems, in which the use of 2D images can be hacked. The advantage of 3D imaging for intrusive medical devices is apparent. This can be achieved with MultiVu's low footprint camera module. MultiVu's lower cost solution for 3D imaging paves the way for implementation in a wide range of applications that could not bear the costs associated with existing 3D technologies using multiple sensors and a projector. Here's how it works Our patented lens replacement gathers the angular information of the light Our patented optical filter encodes the light passing through the system The information is sampled from one digital sensor Deep learning algorithms reconstruct the depth information The new module dimensions do not change. A lower cost solution (single sensor) Low power consumption (passive solution) Off the shelf sensor A single sensor providing 3D imaging (color and Depth) Doron Nevo CEO Israeli entrepreneur - Doron founded and served as CEO of several high-tech companies, such as: KiloLambda - an optical nanotechnology component company, NKO, Inc. and Barak 013 - an Israeli international carrier. Ido Yovel VP R&D Ido earned his B.Sc. and M.Sc. in Electrical Engineering from Tel Aviv University with honors, and is a Ph.D. candidate under the supervision of Prof. David Mendlovic. Ido specialized in optical systems, computational photography, computer vision and machine learning. Ira Sokirianski VP Product Ira occupied different positions throughout her career, starting as an embedded software engineer and system architect followed by project/product management and business development in several companies such as RadVision, Emblaze and Texas Instruments. Ira is a seasoned professional with a strong technical background as well as customer management skills. Israeli entrepreneur - Doron founded and served as CEO of several high-tech companies, such as: KiloLambda - an optical nanotechnology component company, NKO, Inc. and Barak 013 - an Israeli international carrier. Ido Yovel VP R&D Ido earned his B.Sc. and M.Sc. in Electrical Engineering from Tel Aviv University with honors, and is a Ph.D. candidate under the supervision of Prof. David Mendlovic. Ido specialized in optical systems, computational photography, computer vision and machine learning. Ira Sokirianski VP Product Ira occupied different positions throughout her career, starting as an embedded software engineer and system architect followed by project/product management and business development in several companies such as RadVision, Emblaze and Texas Instruments. Ira is a seasoned professional with a strong technical background as well as customer management skills. Ido earned his B.Sc. and M.Sc. in Electrical Engineering from Tel Aviv University with honors, and is a Ph.D. candidate under the supervision of Prof. David Mendlovic. Ido specialized in optical systems, computational photography, computer vision and machine learning. Ira Sokirianski VP Product Ira occupied different positions throughout her career, starting as an embedded software engineer and system architect followed by project/product management and business development in several companies such as RadVision, Emblaze and Texas Instruments. Ira is a seasoned professional with a strong technical background as well as customer management skills. Ira occupied different positions throughout her career, starting as an embedded software engineer and system architect followed by project/product management and business development in several companies such as RadVision, Emblaze and Texas Instruments. Ira is a seasoned professional with a strong technical background as well as customer management skills. 3D imaging co MultiVu completes $7m financing round Globes 2019 Facial Recognition Startup MultiVu Raises $7 Million Calcalist 2019 MultiVu raises $7M seed round for its next-gen 3D sensor TechCrunch 2019 Event - ChipEx2020, The major annual event of the Israeli semiconductor industry HTVD - Hightech Venture Days Next-Gen 3D Single Sensor Camera Development with Micro AM HaBarzel 38B Tel Aviv 6971054 Israel",
    "Home Contact Us The Team MultiVu Simplifying 3D technologies What is MultiVu MultiVu is a 3D imaging solution with a single lens camera, designed to advance your face authentication process. With eye safety, power saving and maximum security for your biometric data, MultiVu introduces our patented light field technology, applicable to any mobile or stationed device, with no additional hardware required. Our technology lets you take quick, 3D snap shots in broad daylight, and all at a fraction of the leading brands` costs. How it works Our revolutionary image acquisition method is based on state of the art deep learning algorithms, which makes it a 100% passive solution (no illumination), operating as a front facing camera, using depth and RGB data, all in a single shot. Our process combines face and depth recognition, enabling a variable set of 3D applications, and an enhanced user experience, which can be implemented in most any digital interfaces. Bottom line A lower cost solution (single sensor) Compact (less components) Low power consumption (passive solution) Off the shelf sensor Enhanced Features A single sensor providing 3D imaging (color and Depth) MultiVu is a 3D imaging solution with a single lens camera, designed to advance your face authentication process. With eye safety, power saving and maximum security for your biometric data, MultiVu introduces our patented light field technology, applicable to any mobile or stationed device, with no additional hardware required. Our technology lets you take quick, 3D snap shots in broad daylight, and all at a fraction of the leading brands` costs. Our revolutionary image acquisition method is based on state of the art deep learning algorithms, which makes it a 100% passive solution (no illumination), operating as a front facing camera, using depth and RGB data, all in a single shot. Our process combines face and depth recognition, enabling a variable set of 3D applications, and an enhanced user experience, which can be implemented in most any digital interfaces. A lower cost solution (single sensor) Compact (less components) Low power consumption (passive solution) Off the shelf sensor Enhanced Features A single sensor providing 3D imaging (color and Depth) A lower cost solution (single sensor) Low power consumption (passive solution) Off the shelf sensor A single sensor providing 3D imaging (color and Depth) Copyright . Powered by GoDaddy GoCentral Website Builder Copyright ."
  ]
}