{
  "company": "www.verint.com",
  "dominant_topics": [
    12,
    3,
    -1,
    2,
    7
  ],
  "topic_counts": {
    "12": 25,
    "3": 11,
    "-1": 4,
    "2": 3,
    "7": 3
  },
  "topic_descriptions": {
    "12": "camera, lens, usb, video, 4k",
    "3": "vantage, development, document, ai, prioxis",
    "2": "demand, cctv, camera, ca, verkada",
    "7": "ramco, payroll, aviation, en, ramco systems"
  },
  "framing_scores": {
    "framing_ethical": 0.3914728682170542,
    "framing_surveillance": 0.1308139534883721,
    "framing_market": 0.4777131782945736,
    "num_docs": 49
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 1,
      "2": 3,
      "3": 11,
      "6": 1,
      "7": 3,
      "10": 1,
      "12": 25
    }
  },
  "sample_docs": [
    "Nextiva Video Management Software An array of Verint video management applications, from video viewing and distribution to system health monitoring and investigation management Powerful, fully-integrated video management software suite for more efficient operation and lower cost of ownership Automated system health monitoring and diagnostics to improve system uptime and streamline maintenance Feature-rich video viewing and policy-based video distribution to improve situational awareness and emergency management Virtual matrix (switching) software for efficiently routing video Searchable database of case-related video, audio, and data to make investigations faster and more productive Address Strategic Video Security Challenges Nextiva video management software promotes a more proactive, effective approach to security and emergency management. These software applications helps organizations of virtually any size and scope address a wide array of strategic video security challenges ? How to manage large, geographically-distributed video operations more efficiently and cost effectively and how to make the most of limited security and loss prevention staff How to find the most important information in the huge volumes of video and data that organizations collect How to detect threats more quickly and accurately, expedite communications when emergencies occur, and ensure that the appropriate people and agencies are notified How to improve video security system uptime, streamline maintenance, and reduce costs of ownership and operation A Robust Video Management Software Suite Verint Nextiva features a wide array of powerful, fully integrated video management software applications. These applications streamline video management and help organizations make sense of vast volumes of video and data. Full Nextiva Integration for Superior Performance and Lower Costs Nextiva video management software applications are fully integrated with the Nextiva portfolio of networked IP video solutions. This integration eliminates many of the deployment and operational issues associated with standalone video management products. Designed to work seamlessly together, Nextiva video management software helps organizations make sense of the vast amount of video and data they collect, streamline video system management, reduce operating costs, and act more proactively and effectively.",
    "Nextiva Intelligent Video Analytics System Integrated. Simplifies security administration with powerful notification and response processes. With one system for managing and viewing event activity, video analytics rules can be easily created and rapidly applied within the video management environment. And alerts can be intelligently distributed virtually anywhere according to your organization's security policies. Analytics \"on-the edge\". Nextiva analyzes video surveillance at the point of capture, providing higher accuracy and fewer false positives. Nextiva edge devices eliminate the need to transmit all captured video to centralized servers for analysis, dramatically reducing servers required and optimizing network use. With Nextiva Intelligent Edge Devices, analytics are affordable and practical to use with virtually every camera in your organization. Powerful forensics. For locating events and patterns in stored video, expediting investigations and making them more productive.",
    "The Global Leader In Actionable Intelligence Solutions Enhance call center performance with workforce optimization and more. Branch & Remote Office Solutions Drive profitability, service consistency, and effectiveness across your branch network. Retail Financial Services Solutions Hosted & Community Bank Solutions FREE Cost Management Check-Up for Retail Banks Improve throughput, reduce expenses, and achieve operational excellence. Enhance the security of people and facilities with our award-winning video solutions portfolio. Video Management Software Intelligent DVRs Edge Devices Encoders & Decoders IP Cameras Wireless Video Solutions Video Analytics Financial & Retail Transit & Critical Infrastructure Enterprise & Campus Communications Interception & Analytics Solutions Gather intelligence from communications networks to deter and investigate terrorism and crime. Communications Service Providers Law Enforcement Agencies National Security Agencies Intelligence Agencies Civilian Government Agencies Enhance the performance of emergency response, public safety, and control room operations. Recording, Playback, and Storage Solutions Verint. Powering Actionable Intelligence. Verint helps government and industry make sense of information overload, transforming it into actionable intelligence for better decisions and optimum performance. | Learn More .",
    "Nextiva Encoders, Decoders, & IP Cameras Capture Video Virtually Anywhere Nextiva features one of the industry's broadest arrays of wireline and wireless edge devices, with solutions to address the needs of virtually every organization, application, and environment. Nextiva Intelligent Edge Devices capture images practically everywhere that impacts security and performance, with a portfolio that includes: encoders, decoders, and IP cameras for indoor and outdoor use; wireless transmitters; and analytics-embedded edge devices that reduce data transport and storage requirements, while enabling organizations to expand their analytic capabilities without adding costly servers. Analytics at the Edge Nextiva edge devices are available with on-board analytics, eliminating the need to send all video to centralized servers for analysis. These analytics-embedded edge devices are designed for superior analytic accuracy and high scalability, and they can significantly reduce data transport and storage requirements. Nextiva Single-Port Encoders and Decoders Nextiva S1900e : Compact DVD-quality encoder with on-board analytics. Download Data Sheet Nextiva S1900e-Vicon : DVD-quality Ethernet video module for Vicon SurveyorVFT PTZ camera domes. Download Data Sheet Nextiva S1950e: High-resolution encoder with cost-optimized feature set for affordable CCTV migration to IP networks. Download Data Sheet Nextiva S1970e: DVD-quality encoder for single-camera applications requiring optimal image quality. Download Data Sheet Nextiva S1970e-R : The Nextiva S1970e-R is a highly compact, single-output decoder that helps organizations leverage the power of IP-based digital video without sacrificing investments in analog technology. Download Data Sheet Nextiva S1704e: Powerful, DVD-quality Ethernet Video Server with on-board analytics with 4 video inputs. Download Data Sheet Nextiva S1708e: Multiport, DVD-quality Ethernet Video Server with on-board analytics with 8 video inputs. Download Data Sheet Nextiva S1712e: Ethernet Video Server optimized for high port count applications with 12 video inputs. Download Data Sheet Nextiva S1724e: Ethernet Video Server optimized for high port count applications with 24 video inputs. Download Data Sheet Nextiva S1100w: Multi-band wireless video transmitter for outdoor applications. Download Data Sheet Nextiva S1100 – Video encoder, transmitter, and receiver for point-to-point wireless applications. Download Data Sheet Nextiva S3100 – Multi-band outdoor wireless bridge, access point, and repeater. Download Data Sheet Nextiva S4100 – A point-to-point wireless solution that helps organizations transmit images from virtually anywhere with high reliability, superior scalability, and lower operational costs. Download Data Sheet Nextiva S4200 - Combines video encoding and wireless transmission in a single, compact device, enabling organizations to transmit images from virtually anywhere with high reliability, superior scalability, and lower operational costs. Download Data Sheet Nextiva S4300 – A versatile outdoor wireless video solution that may be used as a wireless access point to aggregate traffic from multiple Nextiva S4200 wireless transmitters for point-to-multipoint deployments. Download Data Sheet Nextiva S4300-BR - A versatile outdoor wireless video solution that is used as a wireless bridge to transfer video surveillance data between two LANs when a wired connection is not available or too costly to install. Download Data Sheet Nextiva S4300-RP - An outdoor wireless repeater that is comprised of two S4300 units. Download Data Sheet Nextiva S2600e: Wide dynamic range IP camera with on-board analytics and color or day-to-night functionality. Download Data Sheet Nextiva S2700e: DVD-quality, IP mini-dome camera with day-to-night function and triple axis lens rotation. Download Data Sheet Nextiva S2700 Vandal-proof IP camera: Full-featured, vandal-resistant IP mini-dome camera designed for both indoor and outdoor environments. Download Data Sheet Nextiva S2750e: Versatile, IP mini-dome camera that provides excellent image quality and a robust feature set at an attractive price. Download Data Sheet SmartAccess Wireless Point-to-Multipoint Solutions",
    "Nextiva Turnkey IP Video Packages Nextiva EZ, Nextiva Basic, and Nextiva Foundation, with everything you need for IP video deployment Nextiva Video Packages at a Glance Comprehensive IP video packages designed for simple installation, low cost of ownership, and long-term ROI Nextiva EZ 36-channel IP video starter kit Nextiva Basic 64-channel, entry-level enterprise IP video package Nextiva Foundation 100-channel, full-function enterprise IP video system Nextiva EZ 36-channel IP video starter kit Nextiva Basic 64-channel, entry-level enterprise IP video package Nextiva Foundation 100-channel, full-function enterprise IP video system Everything you need for successful IP video implementation: hardware, software, cabling, instructions, and a Quick Start install guide Scalable and modular, so you can deploy IP video at your own pace and expand your system as needed Works with your analog and IP video cameras From the global leader in networked video, with the industry's broadest IP video solution portfolio and 100,000 deployments worldwide Select the Nextiva video package that's right for you Nextiva EZ IP Video Starter Kit Nextiva Basic Entry-Level Enterprise IP Video Package Nextiva Foundation Full-Function Enterprise IP Video System Select the Nextiva Video Package That's Right For You Nextiva EZ IP Video Starter Kit Nextiva EZ is a 36-channel IP video starter kit that is especially useful for retail, branch office, banking, education, and small campus environments. Each Nextiva EZ video package includes virtually everything you need to get your IP video system rapidly up and running, with: Nextiva master server software 36 Nextiva camera licenses 1 Nextiva review license 3 Nextiva S1712e encoders plus power supplies 1 24-port network switch 1 Nextiva EZ Quick Start Installation Guide 1 Nextiva EZ Quick Start Review Guide 3-year hardware warranty and first year software support Nextiva Basic Entry-Level Enterprise IP Video Package Nextiva Basic is a 64-channel IP video solution designed for mid-size retail, campus, critical infrastructure, and government environments. Each Nextiva Basic video package provides virtually everything you need for a successful IP video deployment, including: Nextiva master server software 64 Nextiva camera licenses 2 Nextiva Review licenses 8 Nextiva S1708e encoders plus power supplies 1 24-port network switch 1 Nextiva Basic Quick Start Installation Guide 1 Nextiva Basic Quick Start Review Guide 3-year hardware warranty and first year software support Nextiva Foundation Full-Function Enterprise IP Video System Nextiva Foundation is a scalable, 100-channel full-function enterprise IP video system and is especially appropriate for mass transit (air, ground), ports, municipalities, and federal and military environments. Each Nextiva Foundation video package provides the key components for your IP video deployment, including: Nextiva master server software 100 Nextiva camera licenses 5 Nextiva Review licenses 13 Nextiva S1708e encoders plus power supplies 1 24-port network switch 3-year hardware warranty and first year software support Improving Your IP Expertise IP video is quickly becoming the standard for video security initiatives. But while it can create an array of opportunities, IP video also presents tough challenges that can drain resources and add layers of complexity to video surveillance. Verint offers a practical, more profitable approach that simplifies IP video migration and helps our partners successfully guide their customers through the sales, design, and implementation processes. Our 4-track, value-based approach includes turnkey IP video solutions for rapid implementation; interoperability with complementary security and IT systems for enhanced situational awareness and more trouble-free operation; partner enablement services to support the entire product life cycle; and education and training to help our partners and their customers derive optimum value from their Nextiva IP video products. At Verint, we are dedicated to providing our partners with the solutions and services they need to maintain their competitive edge, produce satisfied customers, and sustain business growth. For more information, contact your Verint representative."
  ]
}