{
  "company": "www.eyesight-tech.com",
  "dominant_topics": [
    2,
    3,
    -1,
    0,
    1
  ],
  "topic_counts": {
    "2": 17,
    "3": 3,
    "-1": 2,
    "0": 2,
    "1": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "3": "vantage, development, document, ai, prioxis",
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.96875,
    "framing_surveillance": 0.0,
    "framing_market": 0.03125,
    "num_docs": 25
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 2,
      "1": 1,
      "2": 17,
      "3": 3
    }
  },
  "sample_docs": [
    "Eyesight's ViewerSense brings edge-based, fully secure and private, computer vision & AI to broadcasting and audience measurement industries. The sensing technology provides real-time viewer analytic data, enabling insights which previously were not available. Eyesight's real-time data revolutionizes the media measurement industry by providing accurate viewership information, opening new revenue streams for the various industry segments (content providers, advertising and more). ViewerSense edge-based software solution provides viewership data in a fully secure and private manner, as all processing is done cloud-free, locally, on-device. No images or videos are stored. Our viewer analytics and audience measurement solution provides the following insights: Detecting the presence of viewers for accurate real-time audience measurement per household. Real-time detection of the gender and the age of the users/viewers. Tracking the user's head pose / direction of sight to determine in real-time if the user is indeed looking at the screen or not. This information allows accurate attentiveness monitoring which enables a true-count of engaged viewers, based on the actual number of people looking at the screen and not just the number of people in the room. Recognizing the face of an enrolled or returning users to apply the respective user's profile. Eyesight enhances the end-user's viewing experience by giving them an intuitive and simple way to interact with their devices - by using touch-free gesture control. Users can enjoy changing a channel, controlling volume and more using simple hand gestures. Our gesture recognition technology includes finger and palm tracking, as well as the detection of universal hand signs such as shush (mute) or wave (turn on/off).",
    "Eyesight's DeviceSense is an edge-based computer vision solution which enables interactions with a range of consumer electronic devices using touch-free hand gestures. DeviceSense is a software solution, it is based on years of R&D and offers state-of-the-art tracking and detection of the hand and finger. DeviceSense augments the existing interface of the device by adding computer vision based interaction capabilities to the existing ones. The technology is available for smart speakers, PCs, TVs, Set-Top-Boxes, tablets, among other devices. It uses the devices existing camera or a standard CMOS sensor to deliver it's advance sensing capabilities. DeviceSense was designed to complement other interaction modalities such as voice control, touch, keys and mouse, to allow a natural choice for the best control to be used in accordance to the user scenario and preference. DeviceSense capabilities include the following: Gesture Recognition Finger Tracking Hand Treaking Universal Hand Signs User Awareness Face Detection User Presence Face Count Facial analysis Age Estimation Gender Detection Face Recognition User Awareness Face Detection User Presence Face Count Facial analysis Age Estimation Gender Detection Face Recognition Facial analysis Age Estimation Gender Detection Face Recognition DeviceSense offers simple and natural touch-free control over device functions by detecting the user's finger or hand motions and converting them into commands. Our team of application engineers offer the expertise of tailoring the computer vision capabilities to various use cases, such as controlling a Smart TV's (menu, volume, channels, etc.), advancing through PowerPoint slides on a PC, or taking selfie pictures with the mobile phone – touch free. With the detection of predefined hand signs, such as \"shush\" motion to mute, we are able to provide the quickest and most convenient way to control key features of the device. Our user awareness capabilities enable smarter interactions with home devices. For example, by detecting absence of a user in front of a device, automatic mute or \"sleep mode\" can be prompted, while the detection of the presence can prompt the device to \"wake-up\" triggering last state of activity. Our facial analysis technology detects distinct user features such as age, gender, and recognition of enlisted household members to cater personalized experiences with the device. By detecting the user's age relevant content can be suggested (such as ads and programs). Face recognition further personalizes the user experience by loading user-specific content or profile based on the specific user that is recognized.",
    "Eyesight Technologies and Ariel University deploying mobile laboratory to research the drivers state behind the wheel From the article in Automotive World : Eyesight Technologies, an AI computer vision solutions leader, and Ariel University, today announced an ongoing collaboration on the university's 'Mobile Laboratory' (M-Lab). The collaboration is part of Ariel University's wider study, and will provide Eyesight Technologies with unique datasets to study the state of drivers behind the wheel. The M-Lab test vehicle is equipped with Eyesight Technologies Driver Sense, a driver monitoring system which provides the lab with accurate monitoring data related to the driver's face and eyes. The vision layer of the company's technology monitors eye openness, blink rate, the direction of the driver's gaze, and head pose, among other factors to determine the state of the driver behind the wheel. Eyesight Technologies is utilizing M-Lab's field tests and the data from the various sensors to extract valuable insight about the state of the driver, allowing the company to further evaluate, monitor and improve its driver monitoring solution. The sensor fusion and data collaboration between all available systems provide Eyesight Technologies with crucial information beyond what is available using the driver Monitoring sensor data alone. to read the full article. November 12, 2019 Eyesight Technologies Awarded New Design Win From US OEM OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] November 11, 2019 Council of the European Union Adopts New Regulations to Significantly Reduce Road Casualties EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] August 18, 2020 Eyesight Technologies Partners with GloboConnect to Provide Driver Monitoring Solutions for Fleets in Oil & Gas Industry Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […] Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […]",
    "eyeSight Technologies Collaborates with Soling to Bring Next Generation Driver Monitoring Systems to the Chinese Automotive Market Herzeliya, Israel – Jun 20, 2018 – eyeSight Technologies, a leading provider of embedded computer vision and AI solutions, has joined forces with Soling Industrial Co. (Stock Code: 002766), a Shenzhen-based Automotive Tier-1 enterprise specializing in research and development, production and sales of software and hardware for the entire industry chain,to bring together advanced driver monitoring technology to the Chinese Automotive market. The two companies have entered a strategic cooperation aimed at utilizing eyeSight's driver monitoring technology to optimize vehicle safety systems in real-time. The joint solution will tackle the widespread driving hazard ofblind spots, by using eyeSight's advanced gaze detection capabilities to track the driver's gaze trajectory in order to understand when the driver's vision is hindered by a blind spot. With this advanced solution, safety mechanisms can be triggered in real-time to compensate for driver's blind-spots and avoid hazardous situations on the road. In addition, eyeSight's sensing technology can provide a real-time assessment of the driver's state by tracking the driver's head position and gaze trajectory to determine if thedriver isdistracted, for example when using the phone or speaking to another passenger, allowing to trigger systems alerts accordingly. The demand for driver monitoring in China is increasing, and the joint Soling-eyeSight Driver Monitoring solution is ideal toanswer this risingneed.The joint solution is already requested by several OEMs and is expected to be launched in China in two vehicle models by 2020, hitting the market in thousands of new vehicles every quarter. \"We are excited to collaboratewith Soling and bring to the market an advanced solution that can help save lives by tracking the driver's state in real-time\"said Gideon Shmuel, CEO of eyesight, \"Our market leading edge-based computer vision technology will improve the driving experience and create a safer driving environment\" As a leading company in the automobile manufacturer solution industry, Soling's advanced hardware products include CID, full LCD cluster and advanced driver assist systems that are sold in more than 60 countries. Soling has been successfully providing professional services and components to leading automobile manufacturers such as Mazda, GAC Group, Toyota, Fiat, among others. November 12, 2019 Eyesight Technologies Awarded New Design Win From US OEM OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] November 11, 2019 Council of the European Union Adopts New Regulations to Significantly Reduce Road Casualties EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] August 18, 2020 Eyesight Technologies Partners with GloboConnect to Provide Driver Monitoring Solutions for Fleets in Oil & Gas Industry Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […] Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […]",
    "eyeSight wins HMI Award at Car HMI 2017 in Berlin! eyeSight's Automotive solution was selected as the first-place winner of the \"Most-User Friendly HMI Feature\" award category. The Car HMI award honors top projects and recognize companies demonstrating excellence in the field of car HMI. eyeSight's automotive solution was selected as the first-place winner of the \"Most-User Friendly HMI Feature \" category. The judging panel included esteemed members of the industry belonging to BMW Group, Jaguar Land Rover Group, and the German Research Center for AI. Check out our winning moment in the video below: November 12, 2019 Eyesight Technologies Awarded New Design Win From US OEM OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] OEM to deploy DriverSense driver monitoring solution in new models by 2021 Tel Aviv- November 12, 2019 – Eyesight Technologies, Driver monitoring and AI computer vision solutions leader, today announced a design win for its Driver Monitoring System – DriverSense, from a well known US OEM. The order is for integration of the […] November 11, 2019 Council of the European Union Adopts New Regulations to Significantly Reduce Road Casualties EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] EU mandates adoption of Advanced Safety Systems by 2022 Tel Aviv – November 11, 2019 – The Council of the European Union voted to adopt regulations proposed by the European Parliament in March to mandate the presence of advanced safety systems in automobiles by mid 2022. Under the new rules, all motor vehicles […] August 18, 2020 Eyesight Technologies Partners with GloboConnect to Provide Driver Monitoring Solutions for Fleets in Oil & Gas Industry Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […] Partnership offers integrated telematics and driver monitoring for fleets in Europe and Africa August 18, 2020 – Tel Aviv – Eyesight Technologies, an AI computer vision solutions leader, today announced a partnership with GloboConnect, a leading provider of telematics systems for fleets, to develop a driver monitoring telematics device targeted for the Oil […]"
  ]
}