{
  "company": "www.dermalog.com",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 15
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.088235294117647,
    "framing_surveillance": 0.7352941176470589,
    "framing_market": 0.1764705882352941,
    "num_docs": 15
  },
  "topic_timeline": {
    "20": {
      "1": 15
    }
  },
  "sample_docs": [
    "Welcome to the World of DERMALOG. DERMALOG Identification Systems is Germanys largest Biometrics Company and Innovation Leader. New Biometric Driver's License for the Philippines. DERMALOG supplied the new biometric Driver's License system to the Republic of the Philippines. Show Story Border Control innovations for Singapore. DERMALOGs system that verifies travellers' identities is proving to be an effective security measure. Show Story State of Rio de Janeiro Identification System. DERMALOG implemented the countrys first and largest combined AFIS in Rio de Janeiro. Show Story National Registration and Smart ID Card System Cambodia. DERMALOG supplied the National Registration and ID Card System as well as an ePassport for the cambodian population. Show Story Biometric Banking in Nigeria. DERMALOG completed the world's largest installation for biometric banking. Show Story Modern biometric System for the Maldives. DERMALOG supplied the new biometric ePassports and Border Control System for the Republic of Maldives. Show Story National Identity Card in Brunei. DERMALOG provided a biometric national ID Card to Brunei - the first of its kind. Show Story Welcome to the World of DERMALOG. DERMALOG Identification Systems is Germanys largest Biometrics Company and Innovation Leader. Welcome to the World of DERMALOG. DERMALOG Identification Systems is Germanys largest Biometrics Company and Innovation Leader. New Biometric Driver's License for the Philippines. DERMALOG supplied the new biometric Driver's License system to the Republic of the Philippines. Show Story New Biometric Driver's License for the Philippines. DERMALOG supplied the new biometric Driver's License system to the Republic of the Philippines. Border Control innovations for Singapore. DERMALOGs system that verifies travellers' identities is proving to be an effective security measure. Show Story Border Control innovations for Singapore. DERMALOGs system that verifies travellers' identities is proving to be an effective security measure. State of Rio de Janeiro Identification System. DERMALOG implemented the countrys first and largest combined AFIS in Rio de Janeiro. Show Story State of Rio de Janeiro Identification System. DERMALOG implemented the countrys first and largest combined AFIS in Rio de Janeiro. National Registration and Smart ID Card System Cambodia. DERMALOG supplied the National Registration and ID Card System as well as an ePassport for the cambodian population. Show Story National Registration and Smart ID Card System Cambodia. DERMALOG supplied the National Registration and ID Card System as well as an ePassport for the cambodian population. Biometric Banking in Nigeria. DERMALOG completed the world's largest installation for biometric banking. Show Story Biometric Banking in Nigeria. DERMALOG completed the world's largest installation for biometric banking. Modern biometric System for the Maldives. DERMALOG supplied the new biometric ePassports and Border Control System for the Republic of Maldives. Show Story Modern biometric System for the Maldives. DERMALOG supplied the new biometric ePassports and Border Control System for the Republic of Maldives. National Identity Card in Brunei. DERMALOG provided a biometric national ID Card to Brunei - the first of its kind. Show Story National Identity Card in Brunei. DERMALOG provided a biometric national ID Card to Brunei - the first of its kind. Press Releases Read more 11/18/2019 Zambian delegation visits DERMALOG Successful meeting focusing on the enhancement of national registration. Read more 01/31/2019 IDnow and DERMALOG cooperate on secure identification New partnership for fast and secure identity verification in the digital economy. Read more 11/18/2019 Zambian delegation visits DERMALOG Successful meeting focusing on the enhancement of national registration. Zambian delegation visits DERMALOG Successful meeting focusing on the enhancement of national registration. Read more 01/31/2019 IDnow and DERMALOG cooperate on secure identification New partnership for fast and secure identity verification in the digital economy. IDnow and DERMALOG cooperate on secure identification New partnership for fast and secure identity verification in the digital economy. Read more 07/02/2018 The next level of secure identification Read more Read more 06/25/2018 Leading iris recognition from DERMALOG Read more Read more 06/08/2018 DERMALOG at CEBIT 2018 Read more show all Read more 07/02/2018 The next level of secure identification Read more The next level of secure identification Read more 06/25/2018 Leading iris recognition from DERMALOG Read more Leading iris recognition from DERMALOG Read more 06/08/2018 DERMALOG at CEBIT 2018 Read more DERMALOG at CEBIT 2018 The Biometrics Innovation Leader 200 employees 24 years of successful business 230 + large-scale installations in more than 90 countries 52 international awards The Biometrics Innovation Leader 24 years of successful business years of successful business 230 + large-scale installations in more than 90 countries large-scale installations in more than 90 countries DERMALOG Services Project Management DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Show More Training Our Service-Team provides comprehensive training programs for newly appointed staff. Show More Installation Service Our service-team will be present on-site during the entire phase of soft- and hardware installation. Show More Customization Our hard- and software-experts are available for your requests about our AFIS & biometric solutions at all times. Show More Maintenance & Support Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. Show More Project Management DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Show More DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Training Our Service-Team provides comprehensive training programs for newly appointed staff. Show More Our Service-Team provides comprehensive training programs for newly appointed staff. Installation Service Our service-team will be present on-site during the entire phase of soft- and hardware installation. Show More Our service-team will be present on-site during the entire phase of soft- and hardware installation. Customization Our hard- and software-experts are available for your requests about our AFIS & biometric solutions at all times. Show More Our hard- and software-experts are available for your requests about our AFIS & biometric solutions at all times. Maintenance & Support Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. Show More Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. All-in-One Scanner VF1 The world's first combined scanner for fingerprints and documents. The DERMALOG's VF1 is the world's first multipurpose scanner for fingerprints and ePassports capturing both using the same device. DERMALOGs latest sensor technology results in one single device for both. For the first time, all capabilities of an optical tenprint scanner (4-4-2 scanner) and a full-color passport scanner (with RFID) are fully integrated. To make this device even more versatile, the VF1 can capture barcodes, flight tickets and signatures in the same scanning area. View Product All-in-One Scanner VF1 The world's first combined scanner for fingerprints and documents. The DERMALOG's VF1 is the world's first multipurpose scanner for fingerprints and ePassports capturing both using the same device. DERMALOGs latest sensor technology results in one single device for both. For the first time, all capabilities of an optical tenprint scanner (4-4-2 scanner) and a full-color passport scanner (with RFID) are fully integrated. To make this device even more versatile, the VF1 can capture barcodes, flight tickets and signatures in the same scanning area. View Product The world's first combined scanner for fingerprints and documents. The DERMALOG's VF1 is the world's first multipurpose scanner for fingerprints and ePassports capturing both using the same device. DERMALOGs latest sensor technology results in one single device for both. For the first time, all capabilities of an optical tenprint scanner (4-4-2 scanner) and a full-color passport scanner (with RFID) are fully integrated. To make this device even more versatile, the VF1 can capture barcodes, flight tickets and signatures in the same scanning area. ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. All-in-One Scanner VF1 DERMALOG ePassport Discover our ePassport System ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. All-in-One Scanner VF1 DERMALOG ePassport Discover our ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. Events and Exhibitions 19 January Intersec Dubai 04 February European Police Congress Berlin 11 March Connect:ID Washington, D.C. 25 March Seamless Middle East Dubai show all events 19 January Intersec Dubai 19 January Intersec Dubai 04 February European Police Congress Berlin 04 February European Police Congress Berlin 11 March Connect:ID Washington, D.C. 11 March Connect:ID Washington, D.C. 25 March Seamless Middle East Dubai 25 March Seamless Middle East Dubai Contact us Phone: +49 (0)40 413 227 - 0 E-Mail: info@dermalog.com Contact us Phone: +49 (0)40 413 227 - 0 E-Mail: info@dermalog.com Phone: +49 (0)40 413 227 - 0",
    "Success Stories and International Projects Success Stories and International Projects 85 + countries in which we operate 220 + large-scale installations worldwide 85 + countries in which we operate countries in which we operate 220 + large-scale installations worldwide DERMALOGs latest Success Stories. As a pioneer in the development of biometric products and solutions, DERMALOG has shaped the world of security for over 20 years. We have been and keep on revolutionizing biometric security products for law enforcement, civil governmental agencies like national registration, voter and driver registrations, health agencies, security agencies and develop solutions for access and data security, authorization and authentication services as well as mobile security. Governmental organizations as well as public and private businesses all over the world trust DERMALOG's expertise and state of the art biometric products. DERMALOG Identification Systems GmbH, based in Hamburg, is the largest German biometrics manufacturer and is known as the Biometrics Innovation Leader. A team of scientists is constantly developing our 'Automatic Biometric Identification Systems' (ABIS) and 'Automatic Fingerprint Identification Systems' (AFIS), including cutting-edge fingerprint scanning devices. The product portfolio is complemented by biometric border control systems and biometric ID cards and passports as well as biometric voting systems. DERMALOGs latest Success Stories. As a pioneer in the development of biometric products and solutions, DERMALOG has shaped the world of security for over 20 years. We have been and keep on revolutionizing biometric security products for law enforcement, civil governmental agencies like national registration, voter and driver registrations, health agencies, security agencies and develop solutions for access and data security, authorization and authentication services as well as mobile security. Governmental organizations as well as public and private businesses all over the world trust DERMALOG's expertise and state of the art biometric products. DERMALOG Identification Systems GmbH, based in Hamburg, is the largest German biometrics manufacturer and is known as the Biometrics Innovation Leader. A team of scientists is constantly developing our 'Automatic Biometric Identification Systems' (ABIS) and 'Automatic Fingerprint Identification Systems' (AFIS), including cutting-edge fingerprint scanning devices. The product portfolio is complemented by biometric border control systems and biometric ID cards and passports as well as biometric voting systems. As a pioneer in the development of biometric products and solutions, DERMALOG has shaped the world of security for over 20 years. We have been and keep on revolutionizing biometric security products for law enforcement, civil governmental agencies like national registration, voter and driver registrations, health agencies, security agencies and develop solutions for access and data security, authorization and authentication services as well as mobile security. Governmental organizations as well as public and private businesses all over the world trust DERMALOG's expertise and state of the art biometric products. DERMALOG Identification Systems GmbH, based in Hamburg, is the largest German biometrics manufacturer and is known as the Biometrics Innovation Leader. A team of scientists is constantly developing our 'Automatic Biometric Identification Systems' (ABIS) and 'Automatic Fingerprint Identification Systems' (AFIS), including cutting-edge fingerprint scanning devices. The product portfolio is complemented by biometric border control systems and biometric ID cards and passports as well as biometric voting systems. show Biometric Banking in Nigeria DERMALOG completed the world's largest installation for biometric banking. show show Border Control in Singapore DERMALOG supplied the new BioScreen System that verifies traveller's identities. show show Biometric Banking in Nigeria DERMALOG completed the world's largest installation for biometric banking. show Biometric Banking in Nigeria DERMALOG completed the world's largest installation for biometric banking. show Border Control in Singapore DERMALOG supplied the new BioScreen System that verifies traveller's identities. show Border Control in Singapore DERMALOG supplied the new BioScreen System that verifies traveller's identities.",
    "New Biometric Driver's License for the Philippines. New Biometric Driver's License for the Philippines. New Biometric Driver's License for the Philippines. The new Driver's License System. In early 2017 the Republic of the Philippines Land Transportation Office (LTO) called for an upgrade of its current Driver's License cards consisting of Professional, Non-professional and Conductors Licenses. The deliverables for this project included durable polycarbonate cards and card artwork, AFIS System, printing workstations, laser engraver card printers, high definition web cameras as well as fingerprint scanners and digital signature pads for 265 LTO district offices. Due to many outstanding Driver's License cards pending to be issued, time was very crucial for this project. In an international tender for this project DERMALOG was able to assert itself against all competitors and accepted the challenge of this demanding Driver's License system comprising of a High Speed AFIS (Automatic Fingerprint Identification System) and all corresponding hardware to be fully deployed and commissioned within a very tight time schedule. The new Driver's License System. In early 2017 the Republic of the Philippines Land Transportation Office (LTO) called for an upgrade of its current Driver's License cards consisting of Professional, Non-professional and Conductors Licenses. The deliverables for this project included durable polycarbonate cards and card artwork, AFIS System, printing workstations, laser engraver card printers, high definition web cameras as well as fingerprint scanners and digital signature pads for 265 LTO district offices. Due to many outstanding Driver's License cards pending to be issued, time was very crucial for this project. In an international tender for this project DERMALOG was able to assert itself against all competitors and accepted the challenge of this demanding Driver's License system comprising of a High Speed AFIS (Automatic Fingerprint Identification System) and all corresponding hardware to be fully deployed and commissioned within a very tight time schedule. The new Driver's License System. In early 2017 the Republic of the Philippines Land Transportation Office (LTO) called for an upgrade of its current Driver's License cards consisting of Professional, Non-professional and Conductors Licenses. The deliverables for this project included durable polycarbonate cards and card artwork, AFIS System, printing workstations, laser engraver card printers, high definition web cameras as well as fingerprint scanners and digital signature pads for 265 LTO district offices. Due to many outstanding Driver's License cards pending to be issued, time was very crucial for this project. In an international tender for this project DERMALOG was able to assert itself against all competitors and accepted the challenge of this demanding Driver's License system comprising of a High Speed AFIS (Automatic Fingerprint Identification System) and all corresponding hardware to be fully deployed and commissioned within a very tight time schedule. A DERMALOG Turnkey Solution comprising of all corresponding software, hardware and training. Effective protection against identity fraud through biometric authentication of highest accuracy. Vastly improved service to the public through instant card issuance within 5-10 Minutes. Complete project execution within only 4,5 months after contract signing. A DERMALOG Turnkey Solution comprising of all corresponding software, hardware and training. Effective protection against identity fraud through biometric authentication of highest accuracy. Vastly improved service to the public through instant card issuance within 5-10 Minutes. Complete project execution within only 4,5 months after contract signing. System Implemetation. The new Driver's License system first went live on the 29th August 2017 in Manila, the nation's capital, replacing the former system after only 3,5 months. A total of 32 security features, plus integrated fingerprint biometrics make the new Philippines driver's license one of the most secure in the world today. Thanks to this Turnkey Solution supplied by DERMALOG the cards can now be issued within only 5 to 10 minutes, vastly improving public service in the Philippines. Boasting a total of 32 security features plus integrated fingerprint biometrics, the new Philippines driver's license is now one of the most secure in the world. Thanks to the DERMALOG system cards can now be issued within 5 to 10 minutes. System Implemetation. The new Driver's License system first went live on the 29th August 2017 in Manila, the nation's capital, replacing the former system after only 3,5 months. A total of 32 security features, plus integrated fingerprint biometrics make the new Philippines driver's license one of the most secure in the world today. Thanks to this Turnkey Solution supplied by DERMALOG the cards can now be issued within only 5 to 10 minutes, vastly improving public service in the Philippines. Boasting a total of 32 security features plus integrated fingerprint biometrics, the new Philippines driver's license is now one of the most secure in the world. Thanks to the DERMALOG system cards can now be issued within 5 to 10 minutes. The new Driver's License system first went live on the 29th August 2017 in Manila, the nation's capital, replacing the former system after only 3,5 months. A total of 32 security features, plus integrated fingerprint biometrics make the new Philippines driver's license one of the most secure in the world today. Thanks to this Turnkey Solution supplied by DERMALOG the cards can now be issued within only 5 to 10 minutes, vastly improving public service in the Philippines. Boasting a total of 32 security features plus integrated fingerprint biometrics, the new Philippines driver's license is now one of the most secure in the world. Thanks to the DERMALOG system cards can now be issued within 5 to 10 minutes. Related Success Stories show Maldives Citizen Screening System DERMALOG developed new biometric ePassport and Border Control System. show show National Identity Card in Brunei DERMALOG provided a microprocessor card in Brunei - the first of its kind. show show Maldives Citizen Screening System DERMALOG developed new biometric ePassport and Border Control System. show Maldives Citizen Screening System DERMALOG developed new biometric ePassport and Border Control System. show National Identity Card in Brunei DERMALOG provided a microprocessor card in Brunei - the first of its kind. show National Identity Card in Brunei DERMALOG provided a microprocessor card in Brunei - the first of its kind.",
    "English English Deutsch Français Español Welcome to the World of Secure Biometrics DERMALOG Identification Systems is Germany's largest biometrics company and innovation leader. About DERMALOG New Biometric Driver's License for the Philippines DERMALOG supplied the new biometric driver's license system to the Republic of the Philippines. Success Story Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Press release Latest News Read more September 16, 2025 DERMALOG wins leading global iris recognition benchmark At LivDet-Iris 2025, DERMALOG takes first place in all categories with 99.99% fraud detection accuracy. Read more Read more August 07, 2025 Mobile Palm Scanner Makes its U.S. Debut Combining mobility, durability and intuitive operation, LIVETOUCH PALM opens up new possibilities for on-site biometric identification in law enforcement. Read more Read more July 01, 2025 Innovation Award for Self-Service-Registration DERMALOG sets new standards for security and efficiency. Read more Read more June 05, 2025 Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Read more Read more December 04, 2024 DERMALOG's Biometric System Secures 64M Bank Accounts More than 64 million Nigerians benefit from biometric technology that streamlines banking processes. Read more show all The Biometrics Innovation Leader 347 Employees 30 Years of Successful Business 300 + Large-Scale Installations in more than 100 Countries 71 International Awards DERMALOG Services Project Management DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Show More Training Our service team provides comprehensive training programs for newly appointed staff. Show More Installation Service Our service team will be present on-site during the entire phase of software and hardware installation. Show More Customization Our hardware and software experts are available for your requests regarding our biometric solutions at all times. Show More Maintenance & Support Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. Show More E-Government for the Philippines LTMS prevents identity fraud by biometric authentication The Land Transportation Office (LTO) of the Philippines launched a new system to digitize and centralize its services. DERMALOG supplied the agency with its latest technology. The system stores and processes all relevant data of Philippine citizens for driver's license, car registration and even for penalty payment of committed offenses in one single system. The new online portal of LTO is combined with a so-called Land Transport Management System (LTMS) and integrates all LTO services in a single database and digital platform. The system is designed to allow stakeholders to connect directly to the LTMS via customized online portals. read more ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. Discover our ePassport System Welcome to the World of Secure Biometrics DERMALOG Identification Systems is Germany's largest biometrics company and innovation leader. About DERMALOG New Biometric Driver's License for the Philippines DERMALOG supplied the new biometric driver's license system to the Republic of the Philippines. Success Story Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Press release Welcome to the World of Secure Biometrics DERMALOG Identification Systems is Germany's largest biometrics company and innovation leader. About DERMALOG Welcome to the World of Secure Biometrics DERMALOG Identification Systems is Germany's largest biometrics company and innovation leader. New Biometric Driver's License for the Philippines DERMALOG supplied the new biometric driver's license system to the Republic of the Philippines. Success Story New Biometric Driver's License for the Philippines DERMALOG supplied the new biometric driver's license system to the Republic of the Philippines. Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Press release Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Read more September 16, 2025 DERMALOG wins leading global iris recognition benchmark At LivDet-Iris 2025, DERMALOG takes first place in all categories with 99.99% fraud detection accuracy. Read more Read more August 07, 2025 Mobile Palm Scanner Makes its U.S. Debut Combining mobility, durability and intuitive operation, LIVETOUCH PALM opens up new possibilities for on-site biometric identification in law enforcement. Read more Read more July 01, 2025 Innovation Award for Self-Service-Registration DERMALOG sets new standards for security and efficiency. Read more Read more June 05, 2025 Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Read more Read more December 04, 2024 DERMALOG's Biometric System Secures 64M Bank Accounts More than 64 million Nigerians benefit from biometric technology that streamlines banking processes. Read more show all Read more September 16, 2025 DERMALOG wins leading global iris recognition benchmark At LivDet-Iris 2025, DERMALOG takes first place in all categories with 99.99% fraud detection accuracy. Read more DERMALOG wins leading global iris recognition benchmark At LivDet-Iris 2025, DERMALOG takes first place in all categories with 99.99% fraud detection accuracy. Read more August 07, 2025 Mobile Palm Scanner Makes its U.S. Debut Combining mobility, durability and intuitive operation, LIVETOUCH PALM opens up new possibilities for on-site biometric identification in law enforcement. Read more Mobile Palm Scanner Makes its U.S. Debut Combining mobility, durability and intuitive operation, LIVETOUCH PALM opens up new possibilities for on-site biometric identification in law enforcement. Read more July 01, 2025 Innovation Award for Self-Service-Registration DERMALOG sets new standards for security and efficiency. Read more Innovation Award for Self-Service-Registration DERMALOG sets new standards for security and efficiency. Read more June 05, 2025 Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Read more Biometric passport for the DR Congo DERMALOG provides the complete biometric system for the new passport. Read more December 04, 2024 DERMALOG's Biometric System Secures 64M Bank Accounts More than 64 million Nigerians benefit from biometric technology that streamlines banking processes. Read more DERMALOG's Biometric System Secures 64M Bank Accounts More than 64 million Nigerians benefit from biometric technology that streamlines banking processes. The Biometrics Innovation Leader 347 Employees 30 Years of Successful Business 300 + Large-Scale Installations in more than 100 Countries 71 International Awards 30 Years of Successful Business Years of Successful Business 300 + Large-Scale Installations in more than 100 Countries Large-Scale Installations in more than 100 Countries Project Management DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Show More Training Our service team provides comprehensive training programs for newly appointed staff. Show More Installation Service Our service team will be present on-site during the entire phase of software and hardware installation. Show More Customization Our hardware and software experts are available for your requests regarding our biometric solutions at all times. Show More Maintenance & Support Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. Show More Project Management DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Show More DERMALOG provides excellent project management to ensure all our clients' requirements are fulfilled. Training Our service team provides comprehensive training programs for newly appointed staff. Show More Our service team provides comprehensive training programs for newly appointed staff. Installation Service Our service team will be present on-site during the entire phase of software and hardware installation. Show More Our service team will be present on-site during the entire phase of software and hardware installation. Customization Our hardware and software experts are available for your requests regarding our biometric solutions at all times. Show More Our hardware and software experts are available for your requests regarding our biometric solutions at all times. Maintenance & Support Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. Show More Reliable and fast support are the pillars of our services. We provide 24/7 support throughout all time zones. E-Government for the Philippines LTMS prevents identity fraud by biometric authentication The Land Transportation Office (LTO) of the Philippines launched a new system to digitize and centralize its services. DERMALOG supplied the agency with its latest technology. The system stores and processes all relevant data of Philippine citizens for driver's license, car registration and even for penalty payment of committed offenses in one single system. The new online portal of LTO is combined with a so-called Land Transport Management System (LTMS) and integrates all LTO services in a single database and digital platform. The system is designed to allow stakeholders to connect directly to the LTMS via customized online portals. read more E-Government for the Philippines LTMS prevents identity fraud by biometric authentication The Land Transportation Office (LTO) of the Philippines launched a new system to digitize and centralize its services. DERMALOG supplied the agency with its latest technology. The system stores and processes all relevant data of Philippine citizens for driver's license, car registration and even for penalty payment of committed offenses in one single system. The new online portal of LTO is combined with a so-called Land Transport Management System (LTMS) and integrates all LTO services in a single database and digital platform. The system is designed to allow stakeholders to connect directly to the LTMS via customized online portals. read more E-Government for the Philippines LTMS prevents identity fraud by biometric authentication The Land Transportation Office (LTO) of the Philippines launched a new system to digitize and centralize its services. DERMALOG supplied the agency with its latest technology. The system stores and processes all relevant data of Philippine citizens for driver's license, car registration and even for penalty payment of committed offenses in one single system. The new online portal of LTO is combined with a so-called Land Transport Management System (LTMS) and integrates all LTO services in a single database and digital platform. The system is designed to allow stakeholders to connect directly to the LTMS via customized online portals. ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. Discover our ePassport System ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. Discover our ePassport System DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts. DERMALOG offers an extensive portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. The solution includes complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance, and verification of documents: complete end-to-end tailor-made and modular solutions based on in-depth knowledge of identity experts.",
    "Secure travel documents. In a globalized world, increasing mobility creates a need for secure travel documents which adapt to new security threats. New ICAO (International Civil Aviation Organization) standards and transition from conventional to ePassports is in progress for over a decade - presenting new challenges to government agencies. DERMALOG's ePassports comply with ICAO guidelines (Doc 9303) and protect the citizen's privacy by securing biometric and demographic data. The electronic documents contain encrypted data stored on a chip. This allows the automated, secure and fast processing of passengers crossing borders. DERMALOG offers a wide portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. Including: complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance and verification of documents: complete end-to-end tailor made and modular solutions based on in-depth knowledge of identity experts. In a globalized world, increasing mobility creates a need for secure travel documents which adapt to new security threats. New ICAO (International Civil Aviation Organization) standards and transition from conventional to ePassports is in progress for over a decade - presenting new challenges to government agencies. DERMALOG's ePassports comply with ICAO guidelines (Doc 9303) and protect the citizen's privacy by securing biometric and demographic data. The electronic documents contain encrypted data stored on a chip. This allows the automated, secure and fast processing of passengers crossing borders. DERMALOG offers a wide portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. Including: complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance and verification of documents: complete end-to-end tailor made and modular solutions based on in-depth knowledge of identity experts. In a globalized world, increasing mobility creates a need for secure travel documents which adapt to new security threats. New ICAO (International Civil Aviation Organization) standards and transition from conventional to ePassports is in progress for over a decade - presenting new challenges to government agencies. DERMALOG's ePassports comply with ICAO guidelines (Doc 9303) and protect the citizen's privacy by securing biometric and demographic data. The electronic documents contain encrypted data stored on a chip. This allows the automated, secure and fast processing of passengers crossing borders. DERMALOG offers a wide portfolio of ePassports and corresponding components - meeting a wide range of government agencies' needs. Including: complete ePassport documents as well as electronic components such as inlays or data pages with integrated electronic components. ePassports are equipped with trusted DERMALOG solutions for registration, issuance and verification of documents: complete end-to-end tailor made and modular solutions based on in-depth knowledge of identity experts. Registration A biometric ePassport system by DERMA volves a digital registration process. It provides capturing of biometric data in compliance with ICAO guidelines and ISO/IEC 19794, complemented with country specific information. Relevant biographic and biometric data obtained from fingerprints, face and iris, a digital photo or signatures are captured and stored. Approval/Data Check Scanned fingerprints will be matched against a database - if they are already registered. The applicant's nationality is checked, from an ID Card and the information is e.g. compared with blacklists, and duplicates. Personalization After ePassport application data passes approval process - it is transferred to the personalization database. The ePassport personalization may include the following processes: 1. ePassport Personalization 2. Data Preparation 3. ePassport Quality Check (QC). The DERMALOG VF1 is the world's first scanner for biometrics and documents. Also available the DERMALOG ePassport Scanners XF3 and XF9: Intended for automatic reading and authenticity verification of passports, ID Cards, Visa and other documents. Providing the capability of text data recognition, reading barcodes, RFID tags and Smart Cards. DERMALOG Scanners are ready to be integrated into Biometric Gates. Registration A biometric ePassport system by DERMA volves a digital registration process. It provides capturing of biometric data in compliance with ICAO guidelines and ISO/IEC 19794, complemented with country specific information. Relevant biographic and biometric data obtained from fingerprints, face and iris, a digital photo or signatures are captured and stored. Approval/Data Check Scanned fingerprints will be matched against a database - if they are already registered. The applicant's nationality is checked, from an ID Card and the information is e.g. compared with blacklists, and duplicates. Personalization After ePassport application data passes approval process - it is transferred to the personalization database. The ePassport personalization may include the following processes: 1. ePassport Personalization 2. Data Preparation 3. ePassport Quality Check (QC). The DERMALOG VF1 is the world's first scanner for biometrics and documents. Also available the DERMALOG ePassport Scanners XF3 and XF9: Intended for automatic reading and authenticity verification of passports, ID Cards, Visa and other documents. Providing the capability of text data recognition, reading barcodes, RFID tags and Smart Cards. DERMALOG Scanners are ready to be integrated into Biometric Gates. A biometric ePassport system by DERMA volves a digital registration process. It provides capturing of biometric data in compliance with ICAO guidelines and ISO/IEC 19794, complemented with country specific information. Relevant biographic and biometric data obtained from fingerprints, face and iris, a digital photo or signatures are captured and stored. Scanned fingerprints will be matched against a database - if they are already registered. The applicant's nationality is checked, from an ID Card and the information is e.g. compared with blacklists, and duplicates. After ePassport application data passes approval process - it is transferred to the personalization database. The ePassport personalization may include the following processes: 1. ePassport Personalization 2. Data Preparation 3. ePassport Quality Check (QC). The DERMALOG VF1 is the world's first scanner for biometrics and documents. Also available the DERMALOG ePassport Scanners XF3 and XF9: Intended for automatic reading and authenticity verification of passports, ID Cards, Visa and other documents. Providing the capability of text data recognition, reading barcodes, RFID tags and Smart Cards. DERMALOG Scanners are ready to be integrated into Biometric Gates. DERMALOG delivers state-of-the-art ePassports DERMALOG delivers state-of-the-art ePassports Contactless IC containing a biometric identifier (face, fingerprint, iris) to authenticate Visa Pages: Security features may include laser perforation numberings, different security designs, visible and invisible fluorescent fibers, rainbow printing etc. Available in different materials, such as polycarbonate or paper laminated with security hologram overlay Ecover in different colors with integrated chip inlay, chip operating system (SAC, EAC or BAC) and contactless chip. The surface can be specifically manufactured for the production of machine readable passports The integrated contactless chip stores encrypted, compressed information: biometric data, ICAO photos and biometric facial, iris and fingerprint images or a signature of the ePassport holder that can be retrieved without any loss of information Inlay consist of numerous components such as antennas, IC modules etc. protecting the stored data on the contactless chip Contactless IC containing a biometric identifier (face, fingerprint, iris) to authenticate Visa Pages: Security features may include laser perforation numberings, different security designs, visible and invisible fluorescent fibers, rainbow printing etc. Available in different materials, such as polycarbonate or paper laminated with security hologram overlay Ecover in different colors with integrated chip inlay, chip operating system (SAC, EAC or BAC) and contactless chip. The surface can be specifically manufactured for the production of machine readable passports The integrated contactless chip stores encrypted, compressed information: biometric data, ICAO photos and biometric facial, iris and fingerprint images or a signature of the ePassport holder that can be retrieved without any loss of information Inlay consist of numerous components such as antennas, IC modules etc. protecting the stored data on the contactless chip Related Showcases show ePassports for Maldives DERMALOG developed a new biometric ePassport and Border Control System. show show Large-scale Installation in Cambodia Biometric ePassports and national ID cards for the cambodian population. show show ePassports for Maldives DERMALOG developed a new biometric ePassport and Border Control System. show DERMALOG developed a new biometric ePassport and Border Control System. show Large-scale Installation in Cambodia Biometric ePassports and national ID cards for the cambodian population. show Large-scale Installation in Cambodia Biometric ePassports and national ID cards for the cambodian population."
  ]
}