{
  "company": "www.sz-tripod.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 2
    }
  },
  "sample_docs": [
    "Customization Technology & Skills Design Engineering Manufacturing Quality Management Product Biometrics Critical Communication DY BioPad 8 8\" Multi-modal Biometric Tablet Possessing multi-modal biometric identification and data collection functions, built-in fingerprint sensor, iris camera, NFC, contact card reader, QR code scanner and other modules. Contact Us Possessing multi-modal biometric identification and data collection functions, built-in fingerprint sensor, iris camera, NFC, contact card reader, QR code scanner and other modules. DY BioGrip 5 5\" Biometric Handheld Built-in fingerprint sensor, contact card reader, NFC, QR code scanner and other modules, applied to biometric identification & data collection. Contact Us Built-in fingerprint sensor, contact card reader, NFC, QR code scanner and other modules, applied to biometric identification & data collection. DY BioKit 13 All-in-one Biometric Enrollment Kit Customized mobile biometric enrollment station that integrates multi-functional components such as biometric identification, thermal printer, card reader, and battery management system. Contact Us Customized mobile biometric enrollment station that integrates multi-functional components such as biometric identification, thermal printer, card reader, and battery management system. Committed to providing customers with all-round integrated solutions in the fields of critical communication, biometrics, smart vehicle and other industrial applications. Floor 5, Building A2, Chuangzhiyun City, Xili Street, Nanshan District, Shenzhen",
    "Customization Technology & Skills Design Engineering Manufacturing Quality Management Product Biometrics Critical Communication DY BioPad 8 8\" Multi-modal Biometric Tablet Possessing multi-modal biometric identification and data collection functions, built-in fingerprint sensor, iris camera, NFC, contact card reader, QR code scanner and other modules. Get Quote Possessing multi-modal biometric identification and data collection functions, built-in fingerprint sensor, iris camera, NFC, contact card reader, QR code scanner and other modules. DY BioGrip 5 5\" Biometric Handheld Built-in fingerprint sensor, contact card reader, NFC, QR code scanner and other modules, applied to biometric identification & data collection. Get Quote Built-in fingerprint sensor, contact card reader, NFC, QR code scanner and other modules, applied to biometric identification & data collection. DY BioKit 13 All-in-one Biometric Enrollment Kit Customized mobile biometric enrollment station that integrates multi-functional components such as biometric identification, thermal printer, card reader, and battery management system. Get Quote Customized mobile biometric enrollment station that integrates multi-functional components such as biometric identification, thermal printer, card reader, and battery management system. D85 Dual-mode Smart Radio Supports DMR and Public Cellular Mobile Network, providing users with reliable communication experience. Based on DMR/LTE digital technology, it possess rich applications, and superior sound quality. The artful and sturdy body design is convenient for users to carry for daily work. We also provide motherboard customization services of narrowband and broadband integration. Get Quote Supports DMR and Public Cellular Mobile Network, providing users with reliable communication experience. Based on DMR/LTE digital technology, it possess rich applications, and superior sound quality. The artful and sturdy body design is convenient for users to carry for daily work. We also provide motherboard customization services of narrowband and broadband integration. D80 Dual-mode Smart Radio Supports DMR and Public Cellular Mobile Network, providing users with reliable communication experience. Rich applications, and superior sound quality. The artful and sturdy body design is convenient for users to carry for daily work. We also provide motherboard customization services of narrowband and broadband integration . Get Quote Supports DMR and Public Cellular Mobile Network, providing users with reliable communication experience. Rich applications, and superior sound quality. The artful and sturdy body design is convenient for users to carry for daily work. We also provide motherboard customization services of narrowband and broadband integration . DM0 / DM4 / DM6 LTE modules Industrial-grade Private Network LTE modules It's small in size, light in weight and has rich frequency bands. It supports 340MHz / 400MHz / 450MHz / 500MHz / 1.9GHz / 2.3GHz / 2.6GHz private network and 1.4M / 3M / 5M / 10M / 15M / 20M networking bandwidth. It has rich Hardware interface, suitable for developing IoT communication equipment such as data transmission, MIFI, vehicle-mounted, handheld POS, and industrial routers, etc. Get Quote DM0 / DM4 / DM6 LTE modules It's small in size, light in weight and has rich frequency bands. It supports 340MHz / 400MHz / 450MHz / 500MHz / 1.9GHz / 2.3GHz / 2.6GHz private network and 1.4M / 3M / 5M / 10M / 15M / 20M networking bandwidth. It has rich Hardware interface, suitable for developing IoT communication equipment such as data transmission, MIFI, vehicle-mounted, handheld POS, and industrial routers, etc. TU200 UWB Module The TU200 UWB module communication frequency band is 3.7G~4.2G, supports 500M bandwidth, integrates UWB and Bluetooth® antennas, and has a built-in three-axis gravity sensor. The TU200 module can reduce development costs, improve development efficiency, and reduce the complexity of UWB communication, positioning, and distance measurement. Get Quote The TU200 UWB module communication frequency band is 3.7G~4.2G, supports 500M bandwidth, integrates UWB and Bluetooth® antennas, and has a built-in three-axis gravity sensor. The TU200 module can reduce development costs, improve development efficiency, and reduce the complexity of UWB communication, positioning, and distance measurement. Committed to providing customers with all-round integrated solutions in the fields of critical communication, biometrics, smart vehicle and other industrial applications. Floor 5, Building A2, Chuangzhiyun City, Xili Street, Nanshan District, Shenzhen",
    "Customization Technology & Skills Design Engineering Manufacturing Quality Management Product Biometrics Critical Communication Built-in fingerprint sensor, contact card reader, NFC, QR code scanner and other modules, applied to biometric identification & data collection. Committed to providing customers with all-round integrated solutions in the fields of critical communication, biometrics, smart vehicle and other industrial applications. Floor 5, Building A2, Chuangzhiyun City, Xili Street, Nanshan District, Shenzhen",
    "Customization Technology & Skills Design Engineering Manufacturing Quality Management Product Biometrics Critical Communication Customized mobile biometric enrollment station that integrates multi-functional components such as biometric identification, thermal printer, card reader, and battery management system. Committed to providing customers with all-round integrated solutions in the fields of critical communication, biometrics, smart vehicle and other industrial applications. Floor 5, Building A2, Chuangzhiyun City, Xili Street, Nanshan District, Shenzhen"
  ]
}