{
  "company": "www.getzippin.com",
  "dominant_topics": [
    6,
    0
  ],
  "topic_counts": {
    "6": 9,
    "0": 3
  },
  "topic_descriptions": {
    "6": "stripe, payments, think, really, payment",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.6071428571428571,
    "framing_surveillance": 0.0,
    "framing_market": 0.3928571428571428,
    "num_docs": 12
  },
  "topic_timeline": {
    "20": {
      "0": 3,
      "6": 9
    }
  },
  "sample_docs": [
    "How It Works Platform Overview Zippin Benefits Watch Our Video White Paper About Our Story Meet the Team Visit Our Store Zippin App B The News A Simply Better Way To Shop The idea for Zippin was born when co-founder and CEO, Krishna Motukuri, was sent out to buy organic milk for his young toddler. Finding an excruciatingly long line at his favorite store, he abandoned Plan A, and ended up buying cheap milk at the local corner store. Plan B wasn't received too well at home, and he realized that there had to be a better way. Fast forward to today. Here at Zippin we have developed the next generation of checkout-free technology enabling retailers to quickly deploy frictionless shopping in their stores. Our patent-pending approach uses AI, machine learning and sensor fusion technology to create the best consumer experience. Our vision is to banish checkout lines and self-scanners for good, so shoppers can zip in and out with their purchases. Zippin was founded by industry veterans from Amazon and SRI with deep backgrounds in retail technology, AI, and computer vision. We have received venture funding from some of Silicon Valley's best known firms. We're hiring! Want to join our team? here . We Know Retail and AI Interim VP of Marketing Come Shop at Zippin's Convenience Store 215 Fremont Street #1 (opp. Town Hall restaurant) San Francisco, CA 94105 8am - 2pm Monday to Friday Be sure to download our app before you visit. We sell healthy snacks and drinks, along with lunch items like sandwiches and salads.",
    "PARTNERSHIPS Zippin's partner ecosystem At Zippin, we believe partnerships are the cornerstone of delivering innovative, checkout-free solutions to customers worldwide. By collaborating with industry leaders, we empower businesses to enhance their operations, delight their customers, and drive revenue. We work with a diverse and growing network of technology partners that enhance the Zippin platform. This lets retailers choose their own payment processors, design custom check-in experiences, integrate with their existing loyalty programs, add new shopping experiences like self-service beverages, and much more. Our technology, your store. Since the beginning, Zippin has partnered with forward-thinking operators, foodservice providers, and technology leaders to transform retail and concessions, delivering frictionless shopping experiences that customers love. We are incredibly proud of the partnerships we've cultivated, helping us to deliver the industry's most flexible and extensible checkout-free platform. Together, we empower retailers to streamline operations, maximize profits, and create extraordinary customer experiences every day. Meet our technology partners: about the capabilities our partner ecosystem can bring to the Zippin checkout-free platform by visiting our technology page. > Interested in partnering with us? Let's talk partnerships! Contact our partnership team today so we can enhance the checkout-free shopping experience together. Simply fill out the following information: At Zippin, we believe partnerships are the cornerstone of delivering innovative, checkout-free solutions to customers worldwide. By collaborating with industry leaders, we empower businesses to enhance their operations, delight their customers, and drive revenue. We work with a diverse and growing network of technology partners that enhance the Zippin platform. This lets retailers choose their own payment processors, design custom check-in experiences, integrate with their existing loyalty programs, add new shopping experiences like self-service beverages, and much more. Our technology, your store. Since the beginning, Zippin has partnered with forward-thinking operators, foodservice providers, and technology leaders to transform retail and concessions, delivering frictionless shopping experiences that customers love. We are incredibly proud of the partnerships we've cultivated, helping us to deliver the industry's most flexible and extensible checkout-free platform. Together, we empower retailers to streamline operations, maximize profits, and create extraordinary customer experiences every day. Meet our technology partners: Interested in partnering with us? Contact our partnership team today so we can enhance the checkout-free shopping experience together. Simply fill out the following information:",
    "Zippin featured in We've received media attention from all around the world including the WSJ, Wired, Fast Company and The Nikkei. Read all about us. Read all about us Retail Technology Information Hub April 25, 2025 Zippin announces 15 new stores launched in just 10 weeks, with nearly all of the new stores outperforming the older ones from the get go. The cost of technology and effort and time to install is significantly lower now. Venues Now September 26, 2024 Aramark S+E discusses the success of their first Zippin-powered store last season at Arrowhead Stadium and why they're opening more Zippin stores, including two additional Zippin stores at Frost Bank Center this season. MouseInfo September 22, 2024 A look at the newly opened M&T's on the Go store at Knotts Berry Farms, one of the latest innovations to come to the park. The store, powered by Zippin, is just the second checkout-free store to open at a US theme park. Sports Business Journal September 4, 2024 SBJ looks at four years of success at the US Open with Zippin's checkout-free store. Average daily sales so far up 40% versus last year and 330% when compared with 2021. Primera Hora (The First Hour) August 29, 2024 Airport Shoppes open a new Zippin-powered Quick Bites store at Luis Muñoz Marín International Airport. The store operates 24/7 to serve busy travelers and is the very first checkout-free store in Puerto Rico. Stadium Tech Report August 27, 2024 Two Zippin-powered concession stands open as part of the $200M of upgrades Levi's Stadium is implementing as the stadium gets ready to host the upcoming Super Bowl LX and 2026 World Cup soccer games. News Is My Business August 5, 2024 Luis Muñoz Marín Airport is ready to open the first checkout-free store in Puerto Rico. Quick Bites, powered by Zippin, is the first of multiple stores scheduled to open this year. Retail Technology Information Hub July 4, 2024 MGI Caribe and Zippin partner to bring the first and second checkout-free stores to Puerto Rico. The first store opens at SJU International Airport this July, followed by another in a few months. Sports Business Journal June 12, 2024 The 2024 French Open debuts its first checkout-free store in partnership with Zippin, Sodexo Live!, and Fujitsu. It's the latest premier sporting event that chose Zippin to elevate the fan experience. Retail Technology Information Hub May 21, 2024 Zippin and Aramark UK launch Europe's very first checkout-free theme park store at LEGOLAND Windsor Resort. DUPLO Coffee Co. sells snacks, drinks, and even self-pour coffee checkout-free. Stadium Tech Report April 29, 2024 STR looks at the strong performance of Zippin-powered stores during the 2023 regular NFL season at Allegiant Stadium. (100K+ items sold, 21.4% repeat shoppers, and more) Sports Business Journal April 26, 2024 SBJ highlights Zippin's success during the 2023-24 NBA season, with over $2.5M of drinks and snacks sold checkout-free across 9 venues. Delaware North April 11, 2024 Zippin's checkout-free technology launches at two new stores at Melbourne Cricket Ground, the southern hemisphere's largest stadium. Sports Business Journal February 26, 2024 Krishna Motukuri is shortlisted for SBJ's 2023 Tech Executive of the Year for Zippin's contributions to the fan experience in sports. Stadium Tech Report February 22, 2024 Four new Zippin-powered stores open at Inter Miami CF's Chase Stadium. They are the first outdoor stores converted to Zippin checkout-free shopping. Sports Business Journal February 26, 2024 SBJ shortlists Zippin for the 2023 Venue Ops Tech of the Year for checkout-free age verification launched with IDmission and Aramark S+E. Sports Business Journal February 8, 2024 SBJ reviews the concession upgrades Levy has planned for Super Bowl LVIII, including 10 Zippin-powered concession stands. Stadium Tech Report January 10, 2024 Allegiant Stadium is ready to serve Super Bowl LVIII visitors checkout-free with its ten Zippin-powered stores, more than any other venue. Sports Business Journal December 4, 2023 SBJ showcases the first-ever checkout-free stores with draft beverages, delivered by Zippin, DraftServ, and GS Draft Systems. TECHBLITZ November 22, 2023 TECHBLITZ interviews Zippin to discuss the benefits of checkout-free technology and expansion potential within the Japanese market. Stadium Tech Report November 16, 2023 STR takes a close look at Zippin's integration with digital ID verification to streamline checkout-free at Empower Field. Retail Technology Information Hub November 15, 2023 Zippin is shortlisted in three categories in Retail Technology Innovation Hub' 2023 Innovation Awards. Airports International November 8, 2023 SSP, Zippin, and Planet partner to bring checkout-free stores to Dublin and Oslo International airports Towson University November 3, 2023 Zippin and Atrium Campus partner to bring checkout-free 24/7 convenience to students at Towson University. Sports Business Journal November 1, 2023 SBJ talks about the automated age verification process at checkout-free stores, powered by Zippin and IDmission. Stadium Tech Report October 2, 2023 Zippin is the clear market leader in checkout-free concessions for sports, according to the latest store counts just released. IDC September 29, 2023 Zippin was recently named an IDC Innovator for Computer Vision for Automated and Self-Checkout. Sports Business Journal September 25, 2023 Zippin Walk-Up turns traditional hot food stands into a faster food experience. Stadium Tech Report July 19, 2023 CityPark's blend of technology and all-local food is winning combination. C-Store Dive July 17, 2023 Checkout-free technology becoming increasingly popular inside stadiums. Stadium Tech Report July 12, 2023 Zippin Walk-Up is unveiled at Arrowhead Stadium. Sports Business Journal July 12, 2023 Allegiant Stadium adding six additional Zippin-powered stores. Forbes July 11, 2023 Zippin checkout-free part of the Gillette Stadium upgrades for 2023. Stadium Tech Report June 7, 2023 Zippin joins STR podcast to discuss the power of checkout-free tech. Retail Technology Innovation Hub May 23, 2023 Zippin reached a new milestone: serving 2 million shoppers checkout-free. Kiosk Marketplace May 3, 2023 Fort Worth Magazine boosts convenience with checkout-free Sports Business Journal May 1, 2023 Early data show increased attendance with faster games Stadium Tech Report April 26, 2023 Venues, fans embrace checkout-free concessions Stadium Tech Report April 12, 2023 Zippin adds five checkout-free stores at MLB stadiums Stadium Tech Report November 16, 2023 STR takes a close look at the nine Zippin-powered stores that offer integrated age verification for Bronco's fans in partnership with IDmission and Aramark S+E. Retail Technology Innovation Hub March 27, 2023 Tampa Bay Rays tap Zippin for checkout-free Short Stop store MLB Press Release March 23, 2023 Rays announce new fan experiences, including checkout-free Vending Times February 22, 2023 Checkout-free brings convenience, incremental sales to Dave & Busters Sports Business Journal February 20, 2023 Zippin stores speed checkout times and boost venue per-caps Fintech Nexus News February 7, 2023 Frictionless checkout major hit with airport consumers Stadium Tech Report January 23, 2023 Zippin adds checkout-free design for existing concessions Retail Technology Information Hub January 19, 2023 Zippin Walk-Up offers most accessible way to deploy checkout-free Sports Business Journal December 19, 2022 Year-End Awards: Best Innovation Sports Business Journal December 7, 2022 Zippin opens three stores at St. Louis' CITYPARK Forbes November 21, 2022 Ambient Computing Is At The Heart Of The Frictionless Economy Venues Now October 27, 2022 Zippin Tops F&B Sales at Pacers Arena Axios October 14, 2022 Our cashierless future Sports Business Journal October 12, 2022 New Zippin Lanes open at Toyota Center Eater Dallas October 7, 2022 You No Longer Need to Interact With a Cashier for Drinks and Snacks at DFW Airport FSR Magazine September 15, 2022 Meet Dave & Buster's New, Futuristic Revenue Stream Las Vegas Review-Journal September 14, 2022 Allegiant Stadium offering checkout-less concession transactions Forbes August 29, 2022 The Future Of Air Travel Is Frictionless: Here's Why That Matters ComputerWeekly.com August 1, 2022 Mapping out the rise in checkout-free shopping Sports Business Journal July 19, 2022 Nissan Stadium opening Zippin-powered stores Forbes June 22, 2022 The Frictionless Economy Is Here: How AI Is Actually Liberating Us From Technology Forbes June 22, 2022 Mastercard Strikes Global Deal With Zippin To Scale Up Its 'Shop Anywhere' Platform Sporttechie June 3, 2022 Zippin's Checkout-Free Technology Will Prevent Sports Fans From Missing Out on the Action PYMNTS.com April 26, 2022 Atrium, Zippin Team to Bring Frictionless Commerce to Colleges Retail Technology Innovation Hub March 2, 2022 Zippin launches checkout-free store at Houston's NRG Stadium Chain Store Age March 2, 2022 Houston stadium opens checkout-free stores Sports Business Journal January 24, 2022 Broncos fans take things into their own hands Fast Company January 3, 2022 Shopping will be way less annoying this year. These are the 3 big changes you'll see Forbes December 31, 2021 Zippin Targets 100 Checkout-Free Airport Stores To Rival Amazon Forbes December 21, 2021 7 Stadium Stories To Watch In 2022 Retail Dive December 9, 2021 Zippin brings checkout-free tech to JFK airport store Airport Industry-News December 6, 2021 JFKIAT to Launch an AI-Powered Contactless Retail Concept at JFK T4 Retail Technology Innovation Hub October 19, 2021 Zippin deploys checkout-free tech at Gainbridge Fieldhouse Convenience Store Decisions September 8, 2021 Zippin Raises $30 Million in Funding Round San Francisco Business Times September 2, 2021 Love checkout-free stores? This S.F. company just landed $30M to compete with Amazon Go's technology. The Spoon February 10, 2021 Zippin Launches Cashierless Checkout Store in Yokohama Techno Tower Hotel Hospitality Technology February 10, 2021 Zippin Announces World's First Checkout-Free Hotel Store in Yokohama, Japan Vending Marketwatch January 22, 2021 Zippin hires former SSP and Aramark exec; Jacobus to lead business development Stadium Tech Report January 20, 2021 Zippin checkout-free system debuts at stadiums in Sacramento, Denver Venues Now January 14, 2021 'STADIUMS ARE A PERFECT FIRST-USE CASE' Vending Times December 8. 2020 Fujitsu to distribute Zippin's self-checkout solution in Japan Retail Touchpoints December 8, 2020 Solution Providers Partner to Advance Cashierless Store Technology in Japan Retail Technology Innovation Hub December 8, 2020 Fujitsu to distribute Zippin check-out free tech in Japan The Spoon December 7, 2020 Fujitsu and Zippin Partner to Push Checkout-Free Solution in Japan The Spoon November 24, 2020 Zippin Cashierless Convenience Store Now Open in Mile High Stadium The Athletic November 18, 2020 Temperature check: 10 pandemic changes to sports business that are here to stay Denver Broncos November 18, 2020 How years of embracing new technology prepared Empower Field at Mile High for 2020 and beyond Retail Touchpoints October 8. 2020 Former 7-Eleven Store IT Exec Joins Checkout-Free Solution Provider Zippin Convenience Store Decisions October 8, 2020 Zippin Hires Former 7-Eleven Executive to Oversee Store Systems The Spoon June 29, 2020 Zippin Featured in Food Tech 25 List for 2020 NFCW. June 11, 2020 Russian grocery retailer uses cashierless shopping technology to create an automated store-within-a-store The Spoon May 29, 2020 Cashierless Checkout on Aisle 10. Only Aisle 10 San Francisco Business Times May 22, 2020 Bay Area companies push contactless payments to avoid Covid-19 Retail Technology Innovation Hub May 22, 2020 Zippin teams with Azbuka Vkusa for European debut The Spoon May 21, 2020 With Moscow Store-Within-a-Store, Zippin Shows New Solution for Grocers to Go Cashierless The Spoon March 26, 2020 Zippin Waives Setup Fees for Stores that Want Cashierless Checkout Pop-Ups to Sell Essential and Safety Products Retail Dive February 12, 2020 The appeal of cashierless stores? Speed and short lines The Wall Street Journal October 14, 2019 Silicon Valley Takes On Amazon's Cashierless 'Go' Stores The Spoon August 14, 2019 Zippin Gets Investment from Lojas Americanas, Announces Ame Go Cashierless Store Retail Technology Innovation Hub August 14, 2019 Lojas Americanas goes checkout-free with Zippin Winsight Grocery Business August 14, 2019 Zippin, Brazilian Chain Unveil Checkout-Free Rollout Eater San Francisco June 12, 2019 Zippin Announces Strategic Partnership With Lojas Americanas, Brazil's Largest Retailer, To Power New Checkout-free Stores PYMNTS.com June 11, 2019 Racing Amazon Go To The Cashierless Finish Line The Spoon June 10, 2019 Zippin Re-Launches its Cashierless Checkout Store in San Francisco MarketWatch January 25, 2019 How check-out free retail could save U.S. consumers 118 hours per year Wired November 19, 2018 The WIRED Guide to Online Shopping (and Digital Retail, Too) Retail Dive October 2, 2018 Smart checkouts will process $45B in transactions by 2023, study says CNBC September 21, 2018 San Francisco start-up Zippin is trying to eliminate grocery checkout lines San Francisco Business Times September 4, 2018 As Amazon Go prepares San Francisco launch, this startup wants to help other retailers go cashierless Supermarket News August 22, 2018 Cashier-free tech makes debut in San Francisco KGO TV (ABC) August 22, 2018 New cashier-less store in San Francisco will help you get lunch in 16 seconds Retail Dive August 21, 2018 Store with tech to rival Amazon Go opens next month Convenience Store News August 21, 2018 Zippin Opens San Francisco Concept Store Showcasing New Frictionless Shopping Technology Fast Company August 20, 2018 Zippin is the first Amazon Go rival to open an automated checkout store Wired August 20, 2018 Welcome to Checkout-Free Retail. Don't Mind All the Cameras Venture Beat August 20, 2018 Zippin opens cashierless store in San Francisco Adweek August 20, 2018 San Francisco Has a New Cashierless Store—and It Isn't Amazon Go Retail Touchpoints August 20, 2018 Zippin Opens First Cashierless Concept Store In San Francisco CSP Daily News August 20, 2018 Zippin Opening Checkout-Free Concept Store Trendhunter August 20, 2018 Zippin's Concept Store Shows a Next-Gen AI-Powered Shopping Platform Chain Store Age August 20, 2018 Tech start-up opens 'concept' store to showcase its checkout-free technology Contact our media team media@getzippin.com We've received media attention from all around the world including the WSJ, Wired, Fast Company and The Nikkei. Read all about us. Read all about us Retail Technology Information Hub Zippin announces 15 new stores launched in just 10 weeks, with nearly all of the new stores outperforming the older ones from the get go. The cost of technology and effort and time to install is significantly lower now. Aramark S+E discusses the success of their first Zippin-powered store last season at Arrowhead Stadium and why they're opening more Zippin stores, including two additional Zippin stores at Frost Bank Center this season. A look at the newly opened M&T's on the Go store at Knotts Berry Farms, one of the latest innovations to come to the park. The store, powered by Zippin, is just the second checkout-free store to open at a US theme park. SBJ looks at four years of success at the US Open with Zippin's checkout-free store. Average daily sales so far up 40% versus last year and 330% when compared with 2021. Primera Hora (The First Hour) Airport Shoppes open a new Zippin-powered Quick Bites store at Luis Muñoz Marín International Airport. The store operates 24/7 to serve busy travelers and is the very first checkout-free store in Puerto Rico. Two Zippin-powered concession stands open as part of the $200M of upgrades Levi's Stadium is implementing as the stadium gets ready to host the upcoming Super Bowl LX and 2026 World Cup soccer games. News Is My Business Luis Muñoz Marín Airport is ready to open the first checkout-free store in Puerto Rico. Quick Bites, powered by Zippin, is the first of multiple stores scheduled to open this year. Retail Technology Information Hub MGI Caribe and Zippin partner to bring the first and second checkout-free stores to Puerto Rico. The first store opens at SJU International Airport this July, followed by another in a few months. The 2024 French Open debuts its first checkout-free store in partnership with Zippin, Sodexo Live!, and Fujitsu. It's the latest premier sporting event that chose Zippin to elevate the fan experience. Retail Technology Information Hub Zippin and Aramark UK launch Europe's very first checkout-free theme park store at LEGOLAND Windsor Resort. DUPLO Coffee Co. sells snacks, drinks, and even self-pour coffee checkout-free. STR looks at the strong performance of Zippin-powered stores during the 2023 regular NFL season at Allegiant Stadium. (100K+ items sold, 21.4% repeat shoppers, and more) SBJ highlights Zippin's success during the 2023-24 NBA season, with over $2.5M of drinks and snacks sold checkout-free across 9 venues. Zippin's checkout-free technology launches at two new stores at Melbourne Cricket Ground, the southern hemisphere's largest stadium. Krishna Motukuri is shortlisted for SBJ's 2023 Tech Executive of the Year for Zippin's contributions to the fan experience in sports. Four new Zippin-powered stores open at Inter Miami CF's Chase Stadium. They are the first outdoor stores converted to Zippin checkout-free shopping. SBJ shortlists Zippin for the 2023 Venue Ops Tech of the Year for checkout-free age verification launched with IDmission and Aramark S+E. SBJ reviews the concession upgrades Levy has planned for Super Bowl LVIII, including 10 Zippin-powered concession stands. Allegiant Stadium is ready to serve Super Bowl LVIII visitors checkout-free with its ten Zippin-powered stores, more than any other venue. SBJ showcases the first-ever checkout-free stores with draft beverages, delivered by Zippin, DraftServ, and GS Draft Systems. TECHBLITZ interviews Zippin to discuss the benefits of checkout-free technology and expansion potential within the Japanese market. STR takes a close look at Zippin's integration with digital ID verification to streamline checkout-free at Empower Field. Retail Technology Information Hub Zippin is shortlisted in three categories in Retail Technology Innovation Hub' 2023 Innovation Awards. SSP, Zippin, and Planet partner to bring checkout-free stores to Dublin and Oslo International airports Zippin and Atrium Campus partner to bring checkout-free 24/7 convenience to students at Towson University. SBJ talks about the automated age verification process at checkout-free stores, powered by Zippin and IDmission. Zippin is the clear market leader in checkout-free concessions for sports, according to the latest store counts just released. Zippin was recently named an IDC Innovator for Computer Vision for Automated and Self-Checkout. Zippin Walk-Up turns traditional hot food stands into a faster food experience. CityPark's blend of technology and all-local food is winning combination. Checkout-free technology becoming increasingly popular inside stadiums. Zippin Walk-Up is unveiled at Arrowhead Stadium. Allegiant Stadium adding six additional Zippin-powered stores. Zippin checkout-free part of the Gillette Stadium upgrades for 2023. Zippin joins STR podcast to discuss the power of checkout-free tech. Retail Technology Innovation Hub Zippin reached a new milestone: serving 2 million shoppers checkout-free. Fort Worth Magazine boosts convenience with checkout-free Early data show increased attendance with faster games Venues, fans embrace checkout-free concessions Zippin adds five checkout-free stores at MLB stadiums STR takes a close look at the nine Zippin-powered stores that offer integrated age verification for Bronco's fans in partnership with IDmission and Aramark S+E. Retail Technology Innovation Hub Tampa Bay Rays tap Zippin for checkout-free Short Stop store Rays announce new fan experiences, including checkout-free Checkout-free brings convenience, incremental sales to Dave & Busters Zippin stores speed checkout times and boost venue per-caps Frictionless checkout major hit with airport consumers Zippin adds checkout-free design for existing concessions Retail Technology Information Hub Zippin Walk-Up offers most accessible way to deploy checkout-free Year-End Awards: Best Innovation Zippin opens three stores at St. Louis' CITYPARK Ambient Computing Is At The Heart Of The Frictionless Economy Zippin Tops F&B Sales at Pacers Arena New Zippin Lanes open at Toyota Center You No Longer Need to Interact With a Cashier for Drinks and Snacks at DFW Airport Meet Dave & Buster's New, Futuristic Revenue Stream Allegiant Stadium offering checkout-less concession transactions The Future Of Air Travel Is Frictionless: Here's Why That Matters Mapping out the rise in checkout-free shopping Nissan Stadium opening Zippin-powered stores The Frictionless Economy Is Here: How AI Is Actually Liberating Us From Technology Mastercard Strikes Global Deal With Zippin To Scale Up Its 'Shop Anywhere' Platform Zippin's Checkout-Free Technology Will Prevent Sports Fans From Missing Out on the Action Atrium, Zippin Team to Bring Frictionless Commerce to Colleges Retail Technology Innovation Hub Zippin launches checkout-free store at Houston's NRG Stadium Houston stadium opens checkout-free stores Broncos fans take things into their own hands Shopping will be way less annoying this year. These are the 3 big changes you'll see Zippin Targets 100 Checkout-Free Airport Stores To Rival Amazon 7 Stadium Stories To Watch In 2022 Zippin brings checkout-free tech to JFK airport store JFKIAT to Launch an AI-Powered Contactless Retail Concept at JFK T4 Retail Technology Innovation Hub Zippin deploys checkout-free tech at Gainbridge Fieldhouse Zippin Raises $30 Million in Funding Round San Francisco Business Times Love checkout-free stores? This S.F. company just landed $30M to compete with Amazon Go's technology. Zippin Launches Cashierless Checkout Store in Yokohama Techno Tower Hotel Zippin Announces World's First Checkout-Free Hotel Store in Yokohama, Japan Zippin hires former SSP and Aramark exec; Jacobus to lead business development Zippin checkout-free system debuts at stadiums in Sacramento, Denver 'STADIUMS ARE A PERFECT FIRST-USE CASE' Fujitsu to distribute Zippin's self-checkout solution in Japan Solution Providers Partner to Advance Cashierless Store Technology in Japan Retail Technology Innovation Hub Fujitsu to distribute Zippin check-out free tech in Japan Fujitsu and Zippin Partner to Push Checkout-Free Solution in Japan Zippin Cashierless Convenience Store Now Open in Mile High Stadium Temperature check: 10 pandemic changes to sports business that are here to stay How years of embracing new technology prepared Empower Field at Mile High for 2020 and beyond Former 7-Eleven Store IT Exec Joins Checkout-Free Solution Provider Zippin Zippin Hires Former 7-Eleven Executive to Oversee Store Systems Zippin Featured in Food Tech 25 List for 2020 Russian grocery retailer uses cashierless shopping technology to create an automated store-within-a-store Cashierless Checkout on Aisle 10. Only Aisle 10 San Francisco Business Times Bay Area companies push contactless payments to avoid Covid-19 Retail Technology Innovation Hub Zippin teams with Azbuka Vkusa for European debut With Moscow Store-Within-a-Store, Zippin Shows New Solution for Grocers to Go Cashierless Zippin Waives Setup Fees for Stores that Want Cashierless Checkout Pop-Ups to Sell Essential and Safety Products The appeal of cashierless stores? Speed and short lines The Wall Street Journal Silicon Valley Takes On Amazon's Cashierless 'Go' Stores Zippin Gets Investment from Lojas Americanas, Announces Ame Go Cashierless Store Retail Technology Innovation Hub Lojas Americanas goes checkout-free with Zippin Zippin, Brazilian Chain Unveil Checkout-Free Rollout Zippin Announces Strategic Partnership With Lojas Americanas, Brazil's Largest Retailer, To Power New Checkout-free Stores Racing Amazon Go To The Cashierless Finish Line Zippin Re-Launches its Cashierless Checkout Store in San Francisco How check-out free retail could save U.S. consumers 118 hours per year The WIRED Guide to Online Shopping (and Digital Retail, Too) Smart checkouts will process $45B in transactions by 2023, study says San Francisco start-up Zippin is trying to eliminate grocery checkout lines San Francisco Business Times As Amazon Go prepares San Francisco launch, this startup wants to help other retailers go cashierless Cashier-free tech makes debut in San Francisco New cashier-less store in San Francisco will help you get lunch in 16 seconds Store with tech to rival Amazon Go opens next month Zippin Opens San Francisco Concept Store Showcasing New Frictionless Shopping Technology Zippin is the first Amazon Go rival to open an automated checkout store Welcome to Checkout-Free Retail. Don't Mind All the Cameras Zippin opens cashierless store in San Francisco San Francisco Has a New Cashierless Store—and It Isn't Amazon Go Zippin Opens First Cashierless Concept Store In San Francisco Zippin Opening Checkout-Free Concept Store Zippin's Concept Store Shows a Next-Gen AI-Powered Shopping Platform Tech start-up opens 'concept' store to showcase its checkout-free technology Contact our media team",
    "Zippin Platform Why Zippin? Benefits for Retail How it Works Technology Watch Our Video Pricing White Paper Shoppers Download the Zippin App Receipts Download the Zippin App Resources B The News Media Resources Retailer Dashboard Watch Our Video White Paper What Sets Zippin Apart Zippin is a leader in checkout-free technology. We opened one of the first checkout-free stores in the U.S. in San Francisco in the summer of 2018. We offer the best technology platform available to help retailers transform their operations and take advantage of the new opportunities offered by frictionless shopping. With precision sensors to recognize products and shopper behavior, advanced AI, faster deployment in stores, and advanced eCommerce-style insights, Zippin's technology delivers a superior platform for checkout-free retail. Higher Accuracy : Zippin's checkout-free technology uses a proprietary system of overhead cameras along with smart shelf sensors, combining the powers of smart sensing, vision cognition and machine learning technologies. This gives our platform better visibility into the store environment and highly accurate recognition of shopper behaviors. Smarter Action Recognition : Recent advances in AI technology have helped Zippin's technology get faster and smarter at recognizing shopper's actions in the store. Our AI technology recognizes when customers pick up products and put them back. Handles Crowds : Zippin's technology achieves a high level of precision and confidence even when stores are crowded. Our platform can handle a store's maximum occupancy limit as mandated by local fire department codes. Speed to Deploy : Zippin's technology can be deployed much faster: often within a day or two, whereas other solutions might take up to three months before they are ready to deploy. This means almost minimal disruption to existing store traffic for retailers. Our technology can be programmed in-house at the retailer's location using our compute platforms and algorithms. Change Inventory Faster : Zippin's technology allows retailers to onboard and sell new products faster since retailers don't have to send their products to Zippin for scanning or uploading into the platform's database, and offers more flexibility with inventory management. You can change products as often as you want, and add each new product to the Zippin system on-site at the store. Maximizes Real Estate : Zippin's system does not require on-site server rooms or hog real estate. The system is maintained and managed remotely with 24/7 technical support. Other than ceiling cameras, smart shelf sensors, and store entry scanners, no on-site hardware is required to be installed in the store. Improving Retail Business Performance Zippin's checkout-free technology helps retailers cut costs, boost store efficiency, and create a compelling customer experience: Checkout-free technology lets you reassign your checkout staff to higher-value tasks including personalized customer service, picking items for curbside pickup or delivery, and more. Zippin's platform tracks all of your inventory. Customers and retailers know exactly what item is on each shelf in real-time. Now you can easily give customers directions for where to find products. Zippin provides out-of-stock alerts, making restocking easier than ever. Store staff or direct suppliers simply walk in with products and place them on shelves. The Zippin system provides verification and stock transfer automatically. Retailers receive detailed analytics for deeper customer insights, including time spent looking at a product, whether a shopper looked at marketing signage, which products were picked, and which products were put back on the shelf. Lower Store Operating Expenses Retailers save on store operating costs, as they do not have to dedicate staff to manage checkout, or allocate expensive real estate for cash registers and lines. This dramatically increases their margins. Better Distribution for Omnichannel Retail Checkout-free stores are significantly more efficient to operate, making it possible for retailers to open more stores in more locations. Zippin's platform gives stores the ability to serve as micro-fulfillment centers for e-commerce, enabling a truly multi-channel experience. Zippin's proprietary approach combines vision cognition technology with machine learning to accurately account for shopper behavior and product whereabouts in-store. We do this by combining inputs from overhead cameras with product tracking—using smart shelf sensors—for the highest level of accuracy, even in a crowded store. Unlike other technology solutions, which rely solely on camera-based systems, Zippin fuses information from multiple sensors, including cameras and shelf sensors, resulting in higher accuracy. We deploy our AI algorithms on small edge devices in stores, requiring lower internet bandwidth. Zippin does not impose any limits on the maximum number of customers that can shop simultaneously in the store, unlike other technology solutions that struggle to maintain accuracy and keep track of items when the store gets crowded. Low Total Cost of Ownership By using commodity hardware we keep costs low for retailers. Related support and maintenance costs are also low due to the fact that non-functioning components can be easily and readily replaced. Zippin uses off-the-shelf components making hardware installation simple, and without placing a burden on store owners. Most hardware can be installed within a day or two in the store. Zippin works with existing store formats, existing shelving and coolers, and standard power supply and internet connections. All of our sensors are powered using power over ethernet (POE), significantly reducing the installation labor to wire them. A single CAT6 cable supplies both power and data to all of our sensors. No Servers or Desktops Needed By eliminating the need for servers or desktops, we have also eliminated the need for expensive system administration contracts. There's no need to build out a separate server room or rack. All Zippin hardware is managed in the cloud with state-of-the-art cloud monitoring software and alerts. Shoppers can shop anonymously in our stores thanks to multiple layers of privacy protection. Once the shopper has selected the item they want, they can put it in their shopping bag, purse or pocket. This allows for a level of discreteness and privacy, that may be desired, e.g. if they are buying personal hygiene products, etc. With Zippin, you will always know where your products are located in the store, even if they have been inadvertently put in the wrong location. As a result, you can offer your customers turn-by-turn directions to an item's exact location. Zippin's platform allows customers to pay for their purchases through credit card terminals in store or through their App on the phone. In addition, we provide payment APIs that can be integrated into the retailer's application. With some solutions, retailers have to ship products off-site so each SKU can be scanned, indexed, and added to the platform's database. With Zippin, retailers can add new products to their store instantly, saving time to deploy and making it easy to add new SKUs. See Zippin in Action Pricing is calculated based on each store's needs, square footage, and other factors specific to each customer and retail location. For more information about pricing, let's meet . DOWNLOAD OUR FREE WHITE PAPER The Future of Retail is Checkout-Free",
    "Drive profits with Zippin Zippin's checkout-free technology enables retailers to quickly deploy frictionless shopping, transforming their operations and increasing customer satisfaction and profits. Customer expectations around in-store experience have never been higher. Simultaneously, retailers have to contend with labor scarcity and rising costs. With precision sensors, advanced AI, fast deployment in stores, and advanced e-commerce-style insights, Zippin's technology delivers a superior platform for cashierless stores. We'll help you run a more profitable business that makes your customers happier. Tech that drives profits Increase your throughput Our checkout-free technology enables retailers to quickly deploy frictionless shopping in their stores, kiosks and fast-casual restaurants. We use AI, machine learning and sensor fusion technology to boost retailer profitability by increasing throughput – no waiting in line means more customers can buy more products. Engage your workforce Checkout-free technology frees your employees from the repetitive tasks of checkout, allowing them to engage and focus on higher-value customer-facing work like helping shoppers find the right products. Boost shopper satisfaction Americans spend 37 billion hours a year waiting in lines. Our technology gives retailers the ability to offer your customers the unrivaled gift of time – simply put, a far better customer experience. Drive profits Zippin empowers retailers to maximize their profits per square foot and keep customers happy and coming back. With Zippin you'll better understand customer needs, learn which products actually drive sales, and help drive customer loyalty – all while keeping throughput high and costs low. How Zippin works Zippin harnesses AI and computer vision technology to power an entire checkout-free shopping platform for cashierless stores. Shoppers scan an app or swipe a credit card to enter your store and grab what they need. Our AI software automatically identifies the items and adds them to a virtual cart. Upon exiting, the purchases are automatically charged and a receipt is made available to the shopper. Zippin here Zippin's proprietary approach combines vision cognition technology with machine learning to accurately account for shopper behavior and product whereabouts in-store. We do this by combining inputs from overhead cameras with product tracking – using smart shelf sensors – for the highest level of accuracy, even in a crowded store. Download our white paper Zippin's superior technology Highly accurate Zippin fuses information from multiple sensors, including cameras and shelf sensors, resulting in the highest available accuracy. We deploy our AI algorithms on small edge devices in stores, requiring lower internet bandwidth. High crowd density Zippin does not impose any limits on the maximum number of customers that can shop simultaneously in the store, unlike other technology solutions that struggle to maintain accuracy and keep track of items when the store gets crowded. Low total cost of ownership By using commodity hardware we keep costs low for retailers. Any non-functioning components can be easily and readily replaced, keeping support and maintenance costs low. Ease of installation Zippin uses off-the-shelf components making hardware installation simple. Most hardware can be installed within a few days in the store. Zippin works with existing store formats, existing shelving and coolers, and standard power. Affordable installation All of our sensors are powered using Power over Ethernet (POE), significantly reducing the installation labor to wire them. A single CAT6 cable supplies both power and data to all of our sensors. Small footprint Zippin runs on edge devices, along with a small network rack that fits within your existing server room. Our team provides 24/7 monitoring. Pricing Pricing is calculated based on each store's needs, square footage, and other factors specific to each customer and retail location. For more information about pricing, let's meet. Get in touch The Future of Retail is Checkout-Free U.S. consumers spent an average of 118 hours waiting in line, and one thing is certain: we hate queuing - especially in stores. Find out how you can deliver the best possible customer experience. Drive profits with Zippin Zippin's checkout-free technology enables retailers to quickly deploy frictionless shopping, transforming their operations and increasing customer satisfaction and profits. Customer expectations around in-store experience have never been higher. Simultaneously, retailers have to contend with labor scarcity and rising costs. With precision sensors, advanced AI, fast deployment in stores, and advanced e-commerce-style insights, Zippin's technology delivers a superior platform for cashierless stores. We'll help you run a more profitable business that makes your customers happier. Tech that drives profits Our checkout-free technology enables retailers to quickly deploy frictionless shopping in their stores, kiosks and fast-casual restaurants. We use AI, machine learning and sensor fusion technology to boost retailer profitability by increasing throughput – no waiting in line means more customers can buy more products. Checkout-free technology frees your employees from the repetitive tasks of checkout, allowing them to engage and focus on higher-value customer-facing work like helping shoppers find the right products. Americans spend 37 billion hours a year waiting in lines. Our technology gives retailers the ability to offer your customers the unrivaled gift of time – simply put, a far better customer experience. Zippin empowers retailers to maximize their profits per square foot and keep customers happy and coming back. With Zippin you'll better understand customer needs, learn which products actually drive sales, and help drive customer loyalty – all while keeping throughput high and costs low. Zippin harnesses AI and computer vision technology to power an entire checkout-free shopping platform for cashierless stores. Shoppers scan an app or swipe a credit card to enter your store and grab what they need. Our AI software automatically identifies the items and adds them to a virtual cart. Upon exiting, the purchases are automatically charged and a receipt is made available to the shopper. Zippin's proprietary approach combines vision cognition technology with machine learning to accurately account for shopper behavior and product whereabouts in-store. We do this by combining inputs from overhead cameras with product tracking – using smart shelf sensors – for the highest level of accuracy, even in a crowded store. Zippin fuses information from multiple sensors, including cameras and shelf sensors, resulting in the highest available accuracy. We deploy our AI algorithms on small edge devices in stores, requiring lower internet bandwidth. Zippin does not impose any limits on the maximum number of customers that can shop simultaneously in the store, unlike other technology solutions that struggle to maintain accuracy and keep track of items when the store gets crowded. Low total cost of ownership By using commodity hardware we keep costs low for retailers. Any non-functioning components can be easily and readily replaced, keeping support and maintenance costs low. Zippin uses off-the-shelf components making hardware installation simple. Most hardware can be installed within a few days in the store. Zippin works with existing store formats, existing shelving and coolers, and standard power. All of our sensors are powered using Power over Ethernet (POE), significantly reducing the installation labor to wire them. A single CAT6 cable supplies both power and data to all of our sensors. Zippin runs on edge devices, along with a small network rack that fits within your existing server room. Our team provides 24/7 monitoring. Pricing is calculated based on each store's needs, square footage, and other factors specific to each customer and retail location. For more information about pricing, let's meet. The Future of Retail is Checkout-Free U.S. consumers spent an average of 118 hours waiting in line, and one thing is certain: we hate queuing - especially in stores. Find out how you can deliver the best possible customer experience."
  ]
}