{
  "company": "www.activewitness.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 6,
    "-1": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 6
    }
  },
  "sample_docs": [
    "ACTIVE WITNESS IN THE NEWS SIMA Active Witness Launches AI Powered Access Control Solution Vancouver-based Active Witness recently introduced a multi-factor access control system called SIMA, combining facial recognition with a QR code which is sent to the user's mobile device. According to the company, an identity claim is made by the user, who presents their QR code to the SIMA unit's camera. The claim is verified by matching the code to the person's face before entry is granted. This transaction is processed using Active Witness' cloud-based software and the company's app, available for iOS and Android. Initial user enrolment takes a few minutes. Optional additional features for SIMA include video recording, time and attendance, tailgate tracking and database inquiry. Heath Driscoll, Active Witness' vice-president of business development, said the company is in the process of building a market for its SIMA devices and is signing up dealers, starting in its home base of B.C. as well as Alberta. \"Our networks are pretty broad in Western Canada, so naturally it made the most sense for us to connect with integrators and installers in Western Canada,\" he said, adding that the company plans to expand its dealer network to provinces to the east over time, then into the U.S. for the first quarter of 2022. Dealers can earn recurring revenue for each active device they have installed. The technology is PoE-based, utilizing power and data from the same source, and its cloud architecture lends scalability as well as ease of management to the product, said Driscoll. \"That's where the cloud has really elevated what access control companies can do. It seems to be where the industry is slowly headed, but we think it should be moving a lot faster given the capabilities, the customization, the scalability of the product.\" The primary market for SIMA at launch is small and medium-sized businesses, said Driscoll. Additional target markets include education, industrial, commercial, manufacturing, airports and sports facilities. \"We're definitely in favour of trying to make this a more accessible form of technology,\" said Driscoll. Read Full Article Active Witness Launches AI Powered Access Control Solution Vancouver-based Active Witness recently introduced a multi-factor access control system called SIMA, combining facial recognition with a QR code which is sent to the user's mobile device. According to the company, an identity claim is made by the user, who presents their QR code to the SIMA unit's camera. The claim is verified by matching the code to the person's face before entry is granted. This transaction is processed using Active Witness' cloud-based software and the company's app, available for iOS and Android. Initial user enrolment takes a few minutes. Optional additional features for SIMA include video recording, time and attendance, tailgate tracking and database inquiry. Heath Driscoll, Active Witness' vice-president of business development, said the company is in the process of building a market for its SIMA devices and is signing up dealers, starting in its home base of B.C. as well as Alberta. \"Our networks are pretty broad in Western Canada, so naturally it made the most sense for us to connect with integrators and installers in Western Canada,\" he said, adding that the company plans to expand its dealer network to provinces to the east over time, then into the U.S. for the first quarter of 2022. Dealers can earn recurring revenue for each active device they have installed. The technology is PoE-based, utilizing power and data from the same source, and its cloud architecture lends scalability as well as ease of management to the product, said Driscoll. \"That's where the cloud has really elevated what access control companies can do. It seems to be where the industry is slowly headed, but we think it should be moving a lot faster given the capabilities, the customization, the scalability of the product.\" The primary market for SIMA at launch is small and medium-sized businesses, said Driscoll. Additional target markets include education, industrial, commercial, manufacturing, airports and sports facilities. \"We're definitely in favour of trying to make this a more accessible form of technology,\" said Driscoll.",
    "Active Witness Launches AI Powered Access Control Solution Vancouver-based Active Witness recently introduced a multi-factor access control system called SIMA, combining facial recognition with a QR code which is sent to the user's mobile device. According to the company, an identity claim is made by the user, who presents their QR code to the SIMA unit's camera. The claim is verified by matching the code to the person's face before entry is granted. This transaction is processed using Active Witness' cloud-based software and the company's app, available for iOS and Android. Initial user enrolment takes a few minutes. Optional additional features for SIMA include video recording, time and attendance, tailgate tracking and database inquiry. Heath Driscoll, Active Witness' vice-president of business development, said the company is in the process of building a market for its SIMA devices and is signing up dealers, starting in its home base of B.C. as well as Alberta. \"Our networks are pretty broad in Western Canada, so naturally it made the most sense for us to connect with integrators and installers in Western Canada,\" he said, adding that the company plans to expand its dealer network to provinces to the east over time, then into the U.S. for the first quarter of 2022. Dealers can earn recurring revenue for each active device they have installed. The technology is PoE-based, utilizing power and data from the same source, and its cloud architecture lends scalability as well as ease of management to the product, said Driscoll. \"That's where the cloud has really elevated what access control companies can do. It seems to be where the industry is slowly headed, but we think it should be moving a lot faster given the capabilities, the customization, the scalability of the product.\" The primary market for SIMA at launch is small and medium-sized businesses, said Driscoll. Additional target markets include education, industrial, commercial, manufacturing, airports and sports facilities. \"We're definitely in favour of trying to make this a more accessible form of technology,\" said Driscoll.",
    "ACTIVE WITNESS CASE STUDIES A Higher-Level of Access How a builder of custom homes found success using Active Witness' Sima verification system Building owners and managers have a duty to protect their employees and visitors from physical harm and from theft of property, assets, and data. Many owners and installers have relied on traditional security methods, namely access control systems that require extensive wiring to grant access only to people authorized to be in the building. View more The Innovative Kitchen Space How Coho safeguarded the health of their employees amidst COVID-19 pandemic Coho Commissary quickly realized that they need a security partner that was as innovative in their technology as Coho was in streamlining food services. Coho found their partner with Active Witness, a state-of-the-art, two-step authentication access system that utilizes an artificial intelligent SIMA sensor connected to a powerful access control cloud service. View more A Higher-Level of Access How a builder of custom homes found success using Active Witness' Sima verification system Building owners and managers have a duty to protect their employees and visitors from physical harm and from theft of property, assets, and data. Many owners and installers have relied on traditional security methods, namely access control systems that require extensive wiring to grant access only to people authorized to be in the building. The Innovative Kitchen Space How Coho safeguarded the health of their employees amidst COVID-19 pandemic Coho Commissary quickly realized that they need a security partner that was as innovative in their technology as Coho was in streamlining food services. Coho found their partner with Active Witness, a state-of-the-art, two-step authentication access system that utilizes an artificial intelligent SIMA sensor connected to a powerful access control cloud service.",
    "ACTIVE WITNESS VIDEO RESOURCES Facial Verification vs Facial Recognition - How do they differ? Facial Verification and Facial Recognition sound similar and both use facial biometrics, but how are they different? Active Witness | Building Access Redefined Active Witness is a state-of-the-art 2 Step authentication access system that utilizes artificial intelligent cameras connected to our powerful cloud service. Only authorized personnel are permitted to enter through a door secured by our AI Camera. Active Witness CEO, Rob Bakshi - Product Release 2021 Listen to our interview with Pressful news and Active Witness CEO, Rob Bakshi. Bakshi explains the future of Access Control and why mobile-access and multi-factor authentication will change the world of security as we know it. Eliminate Waste and Reduce Complexity with Sima by Active Witness Way too many businesses are wasting their time administering visitor badges and employee keycards. Key cards get lost, stolen or malfunction which leads to plastic waste. Sima by Active Witness allows you to minimize complexity and improve your security. Facial Verification vs Facial Recognition - How do they differ? Facial Verification and Facial Recognition sound similar and both use facial biometrics, but how are they different? Active Witness | Building Access Redefined Active Witness is a state-of-the-art 2 Step authentication access system that utilizes artificial intelligent cameras connected to our powerful cloud service. Only authorized personnel are permitted to enter through a door secured by our AI Camera. Active Witness CEO, Rob Bakshi - Product Release 2021 Listen to our interview with Pressful news and Active Witness CEO, Rob Bakshi. Bakshi explains the future of Access Control and why mobile-access and multi-factor authentication will change the world of security as we know it. Eliminate Waste and Reduce Complexity with Sima by Active Witness Way too many businesses are wasting their time administering visitor badges and employee keycards. Key cards get lost, stolen or malfunction which leads to plastic waste. Sima by Active Witness allows you to minimize complexity and improve your security.",
    "A Higher-Level of Access How a builder of custom homes found success using Active Witness' Sima verification system Building owners and managers have a duty to protect their employees and visitors from physical harm and from theft of property, assets, and data. Many owners and installers have relied on traditional security methods, namely access control systems that require extensive wiring to grant access only to people authorized to be in the building. The Innovative Kitchen Space How Coho safeguarded the health of their employees amidst COVID-19 pandemic Coho Commissary quickly realized that they need a security partner that was as innovative in their technology as Coho was in streamlining food services. Coho found their partner with Active Witness, a state-of-the-art, two-step authentication access system that utilizes an artificial intelligent SIMA sensor connected to a powerful access control cloud service."
  ]
}