{
  "company": "www.addistechsolution.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 21,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 21
    }
  },
  "sample_docs": [
    "Addistech Security Store has been in business since January 1, 2007. We've provided high-end, quality security systems and components to family homes and businesses across Ethiopia. Thousands of clients and continued customers have taken advantage of our Home & Business Security systems, video surveillance, personal security products, and our new lines of products becoming available on a consistent basis. Aside from our website, you can also visit us on Facebook and Twitter for exclusive deals and promotions. We pride ourselves on providing exceptional customer service to both new customers and existing clients. We are available to answer your questions, simply visit our Show Room . Thank you for visiting AddisTech Security Store! WE HELP ORGANIZATIONS LOCATED IN 10 COUNTRIES OF THE WORLD. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia.",
    "AddisTech Suplies Different Kinds of Laptops for BUsiness, Enterprise and for personal use of laptops with Great quality and price. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Employee Time Attendace System",
    "AddisTech Suplies Network Infrastructure Look to all Addistech Enterprise Networks products and ICT Solutions for a better connected enterprise network. Addistech Delivers Campus Wired Network Design Options. The LAN is the networking infrastructure that provides access to network communication services and resources for end users and devices spread over a single floor or building. Addistech create a campus network by interconnecting a group of LANs that are spread over a small geographic area. Campus network design concepts are inclusive small networks that use a single LAN switch, up to very large networks with thousands of connections. The campus wired LAN enables communications between devices in a building or group of buildings, as well as interconnection to the WAN and Internet edge at the network core. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Employee Time Attendace System",
    "CCTV Security Camera System In Ethiopia WE HELP BUSINESSES EVOLVE WITH REAL TECHNOLOGY. AddisTech is a leading installer supplier of an extensive range of professional CCTV Cameras in Ethiopia including Dome Cameras, IR Cameras, PTZ Cameras, Fire alarm System, Time attendance machine, Access control for your business safety and security. WE HELP ORGANIZATIONS LOCATED IN ETHIOPIA SINCE 2007. HIKIVISION, QSEE, DAHUA, ZKTECO, HONEYWELL, AXIS, LOREX What's Addistech Founders Say Fire Alarm System Association Ethiopia Biometric Time Attendance machine in Ethiopia Great Quality Ip Camera supplier CCTV Store in Addis Ababa, Ethiopia Follow Us On Facebook And Telegeram to Get the latest Products info and Articles. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. AddisTech is known for Simplicity Quality and Technology Work With Us Addistech Partnership program",
    "WE HELP BUSINESSES EVOLVE WITH REAL TECHNOLOGY. Addistech Solution is a Ethiopian-leading video-centric smart IoT solution and service provider. Based on technological innovations, Addistech Solution offers end-to-end security solutions, systems, and services to create values for city operations, corporate management, and consumers. WE HELP ORGANIZATIONS LOCATED IN ETHIOPIA SINCE 2007. Addistech security camera/CCTV/, Home Alarm, Time attendance machine & Fire Alarm system supplier and installer in Addis Ababa, Ethiopia. Security cameras can be found inside every business store and major intersection nowadays. A recent report conducted by IHS in 2014, concluded that there are 245 million security cameras installed around the world. As the technology is developing ever so quickly and the prices are decreasing, the number of cameras are only going to increase exponentially as the years go on. Addistech Security Store has been in business since January 1, 2007. We've provided high-end, quality security systems and components to family homes and businesses across Ethiopia. Thousands of clients and continued customers have taken advantage of our Home & Business Security systems, video surveillance, personal security products, and our new lines of products becoming available on a consistent basis. Aside from our website, you can also visit us on Facebook and Twitter for exclusive deals and promotions. We pride ourselves on providing exceptional customer service to both new customers and existing clients. We are available to answer your questions, simply visit our Show Room . Thank you for visiting AddisTech Security Store! Employee Time Attendace System"
  ]
}