{
  "company": "www.vuzix.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 4,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.8,
    "framing_market": 0.2,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 1
    }
  },
  "sample_docs": [
    "{{item.name}} Quantity: {{item.quantity}} Price: $ {{item.price + item.color.price + item.frame.price | currency : value = \"\"}} {{item.color.name}} {{item.frame.name}} {{item.size.name}} {{item.lenses.name}} Price: $ {{item.lenses.price}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} Vuzix Next Generation Smart Glasses Technology Vuzix NGSG - CES Award Winner Vuzix NGSG - CES Award Winner Vuzix NGSG - Introduction Vuzix NGSG - Introduction Your browser does not support the video tag. STYLE AND COMFORT A sleek exterior leads to a tech-rich interior, delivering style and substance with a trendy, comfortable design, combining easy wearability with even greater utility, for an enhanced connected mobile experience. Vuzix Advanced Optics Smartphone Integration Immersive Sound LED Display Noise-Cancelling Microphones VUZIX ADVANCED OPTICS Ultra-slim, binocular Waveguides powered by a pair of tiny, highly efficient micro-LED projectors, one for each eye, generating crisp video with contextual information. At 1 micron in size, the micro-LED's have one of the highest density pixel arrays available with both monochrome and full color solutions in development. LED DISPLAY AND NOISE-CANCELLING MICROPHONES Advanced micro-LED displays require extremely low power while providing brilliantly bright images with excellent contrast. Self-contained dual temple batteries can power you for hours. Multiple built-in noise-cancelling microphones allow for flawless phone calls and voice/UI integration. IMMERSIVE SOUND Forgot your uncomfortable ear buds? Not to worry, with acoustic chambers fully integrated into the frames we deliver clear stereo, targeted over the ears for privacy, without losing ambient sound around their wearer. SMARTPHONE INTEGRATION Enhancing hands-free operation, the on-board processor wirelessly communicates with your phone and with the built-in LTE cellular option. Using your voice or, tap on the touch-sensitive arm and the displays activate, allowing discrete connectivity to the world. *Vuzix's Next Generation Smart Glasses is covered under multiple Vuzix Corporation patents and patents pending. Contact Us To know more about our products, partner services or investment opportunities, please contact us. General Inquiries Call: +1-585-359-5900 TF: 800-436-7838 Technical Support Call: +1-585-359-5900 Email: technical_support@vuzix.com Contact Us Vuzix NGSG - CES Award Winner Vuzix NGSG - Introduction A sleek exterior leads to a tech-rich interior, delivering style and substance with a trendy, comfortable design, combining easy wearability with even greater utility, for an enhanced connected mobile experience. Ultra-slim, binocular Waveguides powered by a pair of tiny, highly efficient micro-LED projectors, one for each eye, generating crisp video with contextual information. At 1 micron in size, the micro-LED's have one of the highest density pixel arrays available with both monochrome and full color solutions in development. LED DISPLAY AND NOISE-CANCELLING MICROPHONES Advanced micro-LED displays require extremely low power while providing brilliantly bright images with excellent contrast. Self-contained dual temple batteries can power you for hours. Multiple built-in noise-cancelling microphones allow for flawless phone calls and voice/UI integration. Forgot your uncomfortable ear buds? Not to worry, with acoustic chambers fully integrated into the frames we deliver clear stereo, targeted over the ears for privacy, without losing ambient sound around their wearer. Enhancing hands-free operation, the on-board processor wirelessly communicates with your phone and with the built-in LTE cellular option. Using your voice or, tap on the touch-sensitive arm and the displays activate, allowing discrete connectivity to the world. *Vuzix's Next Generation Smart Glasses is covered under multiple Vuzix Corporation patents and patents pending. To know more about our products, partner services or investment opportunities, please contact us.",
    "{{item.name}} Quantity: {{item.quantity}} Price: $ {{item.price + item.color.price + item.frame.price | currency : value = \"\"}} {{item.color.name}} {{item.frame.name}} {{item.size.name}} {{item.lenses.name}} Price: $ {{item.lenses.price}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} & Conditions Legal / & Conditions OF USE Effective Date: December 2015 This website, including any subsite accessible through the homepage (the \"Site\"), is published and maintained by subsidiaries, affiliates, and/or related entities of Vuzix Corporation (\"Vuzix\"). Please note that when you enter any subsite accessible through this homepage or the shopping page, such subsite may have its own of use which are specific to such subsite. When you access, browse, or use this Site you accept, without limitation or qualification, the set forth below and any additional of use set forth in any subsite. Your Right to Use the Site and Its Contents This Site is only for your personal use. You may not distribute, exchange, modify, sell, or transmit anything you copy from this Site, including but not limited to any text, images, audio, and video, for any business, commercial, or public purpose. As long as you comply with the of these of Use, Vuzix grants you a non-exclusive, non- transferable, limited right to enter, display, and use this Site. You agree not to interrupt or attempt to interrupt the operation of this Site in any way. Ownership All materials on this Site, including but not limited to audio, images, software, text, and video clips (the \"Content\"), are protected by copyright under U.S. copyright law, international conventions, and other copyright laws. You cannot use the Content, except as specified herein. You agree to follow all instructions on this Site limiting the way you may use the Content. There are a number of proprietary logos, service marks, and trademarks found on this Site. By making them available on this Site, Vuzix is not granting you any license to utilize those proprietary logos, service marks, or trademarks. Any unauthorized use of the Content may violate copyright laws, trademark laws, the laws of privacy and publicity, and civil and criminal statutes. You may download one (1) copy only of the Content to be used only by you for your personal use at home, unless the subsite you are accessing states that you may not. If you download any Content from this Site, you may not remove any copyright or trademark notices or other notices that go with it. Rules for Chatrooms, Bulletin Boards, and Other User-Supplied Material This website may have an area which allows you to \"chat\" or upload and download materials. When using any of these areas, you agree not to post, send, transmit, upload, or otherwise publish through this Site, any materials that (1) interfere with anyone else's use of the Site; (2) are abusive, illegal, indecent, obscene, offensive, or threatening in any way; (3) encourage anyone to break the law; (4) violate anyone's copyright or other property right; (5) interfere with the privacy of any other user; (6) contain a virus or any other harmful component; or (7) contain false or misleading statements of fact or descriptions of the origin of the material or the communication. You agree to comply with any additional which are referred to on this Site or any subsite within the website. Responsibility for User's Material You are prohibited from posting or transmitting any defamatory, libelous, obscene, pornographic, profane, threatening, or unlawful material or any material that could constitute or encourage conduct that would be considered a criminal offense or give rise to civil liability, or otherwise violate any law. Although Vuzix may from time to time monitor or review bulletin boards, chatrooms, discussions, postings, transmissions, and the like on the Site, Vuzix is under no obligation to do so and assumes no liability or responsibility arising from the contents of any such communications or for any defamation, error, inaccuracy, libel, obscenity, or profanity contained in any such communication. Vuzix may change, edit, or remove any user material or conversations that are illegal, indecent, obscene, or offensive, or that violate Vuzix' policies in any way. Vuzix will fully cooperate with any law enforcement authorities or court order requesting or directing Vuzix to disclose the identity of anyone posting such materials. Vuzix' Rights to User's Material If you send any communications or materials to the Site by electronic mail or otherwise, including any comments, data, questions, suggestions, or the like, all such communications are, and will be treated as, non-confidential and non- proprietary. Thus, you give up any claim that any use of such material violates any of your rights including moral rights, privacy rights, proprietary or other property rights, publicity rights, rights to credit for material or ideas, or any other right, including the right to approve the way Vuzix uses such material. Any material submitted to this Site may be adapted, broadcast, changed, copied, disclosed, licensed, performed, posted, published, sold, transmitted, or used by Vuzix anywhere in the world, in any medium, forever. Furthermore, Vuzix is free to use, without any compensation to you, any concepts, ideas, know-how, or techniques contained in any communication you send to the Site for any purpose whatsoever, including but not limited to developing, manufacturing, and marketing products using such information. However, you agree and understand that Vuzix is not obligated to use any such ideas or materials, and you have no rights to compel such use. Transmitted Material Internet transmissions are never completely private or secure. You understand that any message or information you send to this Site may be read or intercepted by others, unless there is a special notice that a particular message (for example, credit card information) is encrypted (sent in code). Sending a message to Vuzix does not cause Vuzix to have any special responsibility to you. Links This website may contain links to other Internet sites on the World Wide Web. Vuzix provides such links for your convenience only, and is not responsible for the content of any website linked to or from this Site. Links from this Site to any other website do not mean that Vuzix approves of, endorses, or recommends that website. Vuzix disclaims all warranties, express or implied, as to the accuracy, legality, reliability, or validity of any content on any other website. Contests This Site may contain contests that offer prizes or that require you to send in material or information about yourself. Each contest has its own rules, which you must read and agree to before you may enter. Rules for Kids (Under Age 16) If you are under 16, you should ask your parents or a guardian before you: E-mail the Site, or ask us to e-mail anything to you Send in any information Enter any contest or game that requires information about you or offers a prize Join any club or group Post any information on any bulletin board or enter any chatroom or Buy anything online Availability of Products and Services The products and services displayed on the Site may not be available for purchase in your particular country or locality. The reference to such products and services on the Site does not imply or warrant that these products or services will be available at any time in your particular location. You should check with your local Vuzix authorized representative for the availability of specific products and services in your area. Vuzix' Right to Change These of Use or Content on the Site Vuzix may add to, change, or remove any part of these of Use at any time, without notice. Any changes to these of Use or any posted on this Site apply as soon as they are posted. By continuing to use this Site after any changes are posted, you are indicating your acceptance of those changes. Vuzix may add, change, discontinue, remove, or suspend any other Content posted on this Site, including features and specifications of products described or depicted on the Site, temporarily or permanently, at any time, without notice and without liability. Indemnification You agree to indemnify, defend, and hold Vuzix and all of its agents, directors, employees, information providers, licensors and licensees, officers, and parent (collectively, \"Indemnified Parties\"), harmless from and against any and all liability and costs (including, without limitation, attorneys' fees and costs), incurred by the Indemnified Parties in connection with any claim arising out of any breach by you of these of Use or the foregoing representations, warranties, and covenants. You will cooperate as fully as reasonably required in Vuzix' defense of any claim. Vuzix reserves the right, at its own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you and you shall not in any event settle any matter without the written consent of Vuzix. Disclaimer of Warranties and Damages; Limitation of Liability YOUR USE OF THIS SITE IS AT YOUR OWN RISK. THIS SITE (INCLUDING ALL CONTENT AND FUNCTIONS MADE AVAILABLE ON OR ACCESSED THROUGH THIS SITE) IS PROVIDED \"AS IS.\" TO THE FULLEST EXTENT PERMISSIBLE BY LAW, WITH REGARD TO THE CONTENT ON THIS SITE, VUZIX MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER (1) FOR THE ACCURACY, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT OF ANY CONTENT PUBLISHED ON OR AVAILABLE THROUGH THE SITE; (2) THAT THE SERVER THAT MAKES THIS SITE AVAILABLE IS FREE OF VIRUSES OR OTHER COMPONENTS THAT MAY INFECT, HARM, OR CAUSE DAMAGE TO YOUR COMPUTER EQUIPMENT OR ANY OTHER PROPERTY WHEN YOU ACCESS, BROWSE, DOWNLOAD FROM, OR OTHERWISE USE THE SITE. UNDER NO CIRCUMSTANCES, INCLUDING BUT NOT LIMITED TO VUZIX'S NEGLIGENCE, SHALL VUZIX BE LIABLE FOR ANY CONSEQUENTIAL, DIRECT, INCIDENTAL, INDIRECT, PUNITIVE, OR SPECIAL DAMAGES RELATED TO (A) THE USE OF, (B) THE INABILITY TO USE, OR (C) ERRORS OR OMISSIONS IN THE CONTENTS AND FUNCTIONS OF THIS SITE, EVEN IF VUZIX OR AN AUTHORIZED REPRESENTATIVE THEREOF HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CONSEQUENTIAL OR INCIDENTAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. IN NO EVENT SHALL VUZIX'S TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT OR TORT, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE OR OTHERWISE) EXCEED $100.00. General Provisions These of Use and any additional posted on this Site together constitute the entire agreement between Vuzix and you with respect to your use of this Site. Any cause of action you may have with respect to your use of this Site must be commenced within one (1) year after the claim or cause of action arises. If for any reason a court of competent jurisdiction finds any provision of these of Use, or portion thereof, to be unenforceable, that provision shall be enforced to the maximum extent permissible so as to effect the intent of this agreement, and the remainder of these of Use shall continue in full force and effect. These of Use shall be governed by and construed in accordance with the laws of the State of New York, United States of America, without reference to its conflicts of law rules. OF USE Effective Date: December 2015 This website, including any subsite accessible through the homepage (the \"Site\"), is published and maintained by subsidiaries, affiliates, and/or related entities of Vuzix Corporation (\"Vuzix\"). Please note that when you enter any subsite accessible through this homepage or the shopping page, such subsite may have its own of use which are specific to such subsite. When you access, browse, or use this Site you accept, without limitation or qualification, the set forth below and any additional of use set forth in any subsite. Your Right to Use the Site and Its Contents This Site is only for your personal use. You may not distribute, exchange, modify, sell, or transmit anything you copy from this Site, including but not limited to any text, images, audio, and video, for any business, commercial, or public purpose. As long as you comply with the of these of Use, Vuzix grants you a non-exclusive, non- transferable, limited right to enter, display, and use this Site. You agree not to interrupt or attempt to interrupt the operation of this Site in any way. Ownership All materials on this Site, including but not limited to audio, images, software, text, and video clips (the \"Content\"), are protected by copyright under U.S. copyright law, international conventions, and other copyright laws. You cannot use the Content, except as specified herein. You agree to follow all instructions on this Site limiting the way you may use the Content. There are a number of proprietary logos, service marks, and trademarks found on this Site. By making them available on this Site, Vuzix is not granting you any license to utilize those proprietary logos, service marks, or trademarks. Any unauthorized use of the Content may violate copyright laws, trademark laws, the laws of privacy and publicity, and civil and criminal statutes. You may download one (1) copy only of the Content to be used only by you for your personal use at home, unless the subsite you are accessing states that you may not. If you download any Content from this Site, you may not remove any copyright or trademark notices or other notices that go with it. Rules for Chatrooms, Bulletin Boards, and Other User-Supplied Material This website may have an area which allows you to \"chat\" or upload and download materials. When using any of these areas, you agree not to post, send, transmit, upload, or otherwise publish through this Site, any materials that (1) interfere with anyone else's use of the Site; (2) are abusive, illegal, indecent, obscene, offensive, or threatening in any way; (3) encourage anyone to break the law; (4) violate anyone's copyright or other property right; (5) interfere with the privacy of any other user; (6) contain a virus or any other harmful component; or (7) contain false or misleading statements of fact or descriptions of the origin of the material or the communication. You agree to comply with any additional which are referred to on this Site or any subsite within the website. Responsibility for User's Material You are prohibited from posting or transmitting any defamatory, libelous, obscene, pornographic, profane, threatening, or unlawful material or any material that could constitute or encourage conduct that would be considered a criminal offense or give rise to civil liability, or otherwise violate any law. Although Vuzix may from time to time monitor or review bulletin boards, chatrooms, discussions, postings, transmissions, and the like on the Site, Vuzix is under no obligation to do so and assumes no liability or responsibility arising from the contents of any such communications or for any defamation, error, inaccuracy, libel, obscenity, or profanity contained in any such communication. Vuzix may change, edit, or remove any user material or conversations that are illegal, indecent, obscene, or offensive, or that violate Vuzix' policies in any way. Vuzix will fully cooperate with any law enforcement authorities or court order requesting or directing Vuzix to disclose the identity of anyone posting such materials. Vuzix' Rights to User's Material If you send any communications or materials to the Site by electronic mail or otherwise, including any comments, data, questions, suggestions, or the like, all such communications are, and will be treated as, non-confidential and non- proprietary. Thus, you give up any claim that any use of such material violates any of your rights including moral rights, privacy rights, proprietary or other property rights, publicity rights, rights to credit for material or ideas, or any other right, including the right to approve the way Vuzix uses such material. Any material submitted to this Site may be adapted, broadcast, changed, copied, disclosed, licensed, performed, posted, published, sold, transmitted, or used by Vuzix anywhere in the world, in any medium, forever. Furthermore, Vuzix is free to use, without any compensation to you, any concepts, ideas, know-how, or techniques contained in any communication you send to the Site for any purpose whatsoever, including but not limited to developing, manufacturing, and marketing products using such information. However, you agree and understand that Vuzix is not obligated to use any such ideas or materials, and you have no rights to compel such use. Transmitted Material Internet transmissions are never completely private or secure. You understand that any message or information you send to this Site may be read or intercepted by others, unless there is a special notice that a particular message (for example, credit card information) is encrypted (sent in code). Sending a message to Vuzix does not cause Vuzix to have any special responsibility to you. Links This website may contain links to other Internet sites on the World Wide Web. Vuzix provides such links for your convenience only, and is not responsible for the content of any website linked to or from this Site. Links from this Site to any other website do not mean that Vuzix approves of, endorses, or recommends that website. Vuzix disclaims all warranties, express or implied, as to the accuracy, legality, reliability, or validity of any content on any other website. Contests This Site may contain contests that offer prizes or that require you to send in material or information about yourself. Each contest has its own rules, which you must read and agree to before you may enter. Rules for Kids (Under Age 16) If you are under 16, you should ask your parents or a guardian before you: E-mail the Site, or ask us to e-mail anything to you Send in any information Enter any contest or game that requires information about you or offers a prize Join any club or group Post any information on any bulletin board or enter any chatroom or Buy anything online Availability of Products and Services The products and services displayed on the Site may not be available for purchase in your particular country or locality. The reference to such products and services on the Site does not imply or warrant that these products or services will be available at any time in your particular location. You should check with your local Vuzix authorized representative for the availability of specific products and services in your area. Vuzix' Right to Change These of Use or Content on the Site Vuzix may add to, change, or remove any part of these of Use at any time, without notice. Any changes to these of Use or any posted on this Site apply as soon as they are posted. By continuing to use this Site after any changes are posted, you are indicating your acceptance of those changes. Vuzix may add, change, discontinue, remove, or suspend any other Content posted on this Site, including features and specifications of products described or depicted on the Site, temporarily or permanently, at any time, without notice and without liability. Indemnification You agree to indemnify, defend, and hold Vuzix and all of its agents, directors, employees, information providers, licensors and licensees, officers, and parent (collectively, \"Indemnified Parties\"), harmless from and against any and all liability and costs (including, without limitation, attorneys' fees and costs), incurred by the Indemnified Parties in connection with any claim arising out of any breach by you of these of Use or the foregoing representations, warranties, and covenants. You will cooperate as fully as reasonably required in Vuzix' defense of any claim. Vuzix reserves the right, at its own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you and you shall not in any event settle any matter without the written consent of Vuzix. Disclaimer of Warranties and Damages; Limitation of Liability YOUR USE OF THIS SITE IS AT YOUR OWN RISK. THIS SITE (INCLUDING ALL CONTENT AND FUNCTIONS MADE AVAILABLE ON OR ACCESSED THROUGH THIS SITE) IS PROVIDED \"AS IS.\" TO THE FULLEST EXTENT PERMISSIBLE BY LAW, WITH REGARD TO THE CONTENT ON THIS SITE, VUZIX MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER (1) FOR THE ACCURACY, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT OF ANY CONTENT PUBLISHED ON OR AVAILABLE THROUGH THE SITE; (2) THAT THE SERVER THAT MAKES THIS SITE AVAILABLE IS FREE OF VIRUSES OR OTHER COMPONENTS THAT MAY INFECT, HARM, OR CAUSE DAMAGE TO YOUR COMPUTER EQUIPMENT OR ANY OTHER PROPERTY WHEN YOU ACCESS, BROWSE, DOWNLOAD FROM, OR OTHERWISE USE THE SITE. UNDER NO CIRCUMSTANCES, INCLUDING BUT NOT LIMITED TO VUZIX'S NEGLIGENCE, SHALL VUZIX BE LIABLE FOR ANY CONSEQUENTIAL, DIRECT, INCIDENTAL, INDIRECT, PUNITIVE, OR SPECIAL DAMAGES RELATED TO (A) THE USE OF, (B) THE INABILITY TO USE, OR (C) ERRORS OR OMISSIONS IN THE CONTENTS AND FUNCTIONS OF THIS SITE, EVEN IF VUZIX OR AN AUTHORIZED REPRESENTATIVE THEREOF HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CONSEQUENTIAL OR INCIDENTAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. IN NO EVENT SHALL VUZIX'S TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT OR TORT, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE OR OTHERWISE) EXCEED $100.00. General Provisions These of Use and any additional posted on this Site together constitute the entire agreement between Vuzix and you with respect to your use of this Site. Any cause of action you may have with respect to your use of this Site must be commenced within one (1) year after the claim or cause of action arises. If for any reason a court of competent jurisdiction finds any provision of these of Use, or portion thereof, to be unenforceable, that provision shall be enforced to the maximum extent permissible so as to effect the intent of this agreement, and the remainder of these of Use shall continue in full force and effect. These of Use shall be governed by and construed in accordance with the laws of the State of New York, United States of America, without reference to its conflicts of law rules. OF USE Effective Date: December 2015 This website, including any subsite accessible through the homepage (the \"Site\"), is published and maintained by subsidiaries, affiliates, and/or related entities of Vuzix Corporation (\"Vuzix\"). Please note that when you enter any subsite accessible through this homepage or the shopping page, such subsite may have its own of use which are specific to such subsite. When you access, browse, or use this Site you accept, without limitation or qualification, the set forth below and any additional of use set forth in any subsite. Your Right to Use the Site and Its Contents This Site is only for your personal use. You may not distribute, exchange, modify, sell, or transmit anything you copy from this Site, including but not limited to any text, images, audio, and video, for any business, commercial, or public purpose. As long as you comply with the of these of Use, Vuzix grants you a non-exclusive, non- transferable, limited right to enter, display, and use this Site. You agree not to interrupt or attempt to interrupt the operation of this Site in any way. All materials on this Site, including but not limited to audio, images, software, text, and video clips (the \"Content\"), are protected by copyright under U.S. copyright law, international conventions, and other copyright laws. You cannot use the Content, except as specified herein. You agree to follow all instructions on this Site limiting the way you may use the Content. There are a number of proprietary logos, service marks, and trademarks found on this Site. By making them available on this Site, Vuzix is not granting you any license to utilize those proprietary logos, service marks, or trademarks. Any unauthorized use of the Content may violate copyright laws, trademark laws, the laws of privacy and publicity, and civil and criminal statutes. You may download one (1) copy only of the Content to be used only by you for your personal use at home, unless the subsite you are accessing states that you may not. If you download any Content from this Site, you may not remove any copyright or trademark notices or other notices that go with it. Rules for Chatrooms, Bulletin Boards, and Other User-Supplied Material This website may have an area which allows you to \"chat\" or upload and download materials. When using any of these areas, you agree not to post, send, transmit, upload, or otherwise publish through this Site, any materials that (1) interfere with anyone else's use of the Site; (2) are abusive, illegal, indecent, obscene, offensive, or threatening in any way; (3) encourage anyone to break the law; (4) violate anyone's copyright or other property right; (5) interfere with the privacy of any other user; (6) contain a virus or any other harmful component; or (7) contain false or misleading statements of fact or descriptions of the origin of the material or the communication. You agree to comply with any additional which are referred to on this Site or any subsite within the website. Responsibility for User's Material You are prohibited from posting or transmitting any defamatory, libelous, obscene, pornographic, profane, threatening, or unlawful material or any material that could constitute or encourage conduct that would be considered a criminal offense or give rise to civil liability, or otherwise violate any law. Although Vuzix may from time to time monitor or review bulletin boards, chatrooms, discussions, postings, transmissions, and the like on the Site, Vuzix is under no obligation to do so and assumes no liability or responsibility arising from the contents of any such communications or for any defamation, error, inaccuracy, libel, obscenity, or profanity contained in any such communication. Vuzix may change, edit, or remove any user material or conversations that are illegal, indecent, obscene, or offensive, or that violate Vuzix' policies in any way. Vuzix will fully cooperate with any law enforcement authorities or court order requesting or directing Vuzix to disclose the identity of anyone posting such materials. Vuzix' Rights to User's Material If you send any communications or materials to the Site by electronic mail or otherwise, including any comments, data, questions, suggestions, or the like, all such communications are, and will be treated as, non-confidential and non- proprietary. Thus, you give up any claim that any use of such material violates any of your rights including moral rights, privacy rights, proprietary or other property rights, publicity rights, rights to credit for material or ideas, or any other right, including the right to approve the way Vuzix uses such material. Any material submitted to this Site may be adapted, broadcast, changed, copied, disclosed, licensed, performed, posted, published, sold, transmitted, or used by Vuzix anywhere in the world, in any medium, forever. Furthermore, Vuzix is free to use, without any compensation to you, any concepts, ideas, know-how, or techniques contained in any communication you send to the Site for any purpose whatsoever, including but not limited to developing, manufacturing, and marketing products using such information. However, you agree and understand that Vuzix is not obligated to use any such ideas or materials, and you have no rights to compel such use. Internet transmissions are never completely private or secure. You understand that any message or information you send to this Site may be read or intercepted by others, unless there is a special notice that a particular message (for example, credit card information) is encrypted (sent in code). Sending a message to Vuzix does not cause Vuzix to have any special responsibility to you. This website may contain links to other Internet sites on the World Wide Web. Vuzix provides such links for your convenience only, and is not responsible for the content of any website linked to or from this Site. Links from this Site to any other website do not mean that Vuzix approves of, endorses, or recommends that website. Vuzix disclaims all warranties, express or implied, as to the accuracy, legality, reliability, or validity of any content on any other website. This Site may contain contests that offer prizes or that require you to send in material or information about yourself. Each contest has its own rules, which you must read and agree to before you may enter. Rules for Kids (Under Age 16) If you are under 16, you should ask your parents or a guardian before you: E-mail the Site, or ask us to e-mail anything to you Send in any information Enter any contest or game that requires information about you or offers a prize Join any club or group Post any information on any bulletin board or enter any chatroom or Availability of Products and Services The products and services displayed on the Site may not be available for purchase in your particular country or locality. The reference to such products and services on the Site does not imply or warrant that these products or services will be available at any time in your particular location. You should check with your local Vuzix authorized representative for the availability of specific products and services in your area. Vuzix' Right to Change These of Use or Content on the Site Vuzix may add to, change, or remove any part of these of Use at any time, without notice. Any changes to these of Use or any posted on this Site apply as soon as they are posted. By continuing to use this Site after any changes are posted, you are indicating your acceptance of those changes. Vuzix may add, change, discontinue, remove, or suspend any other Content posted on this Site, including features and specifications of products described or depicted on the Site, temporarily or permanently, at any time, without notice and without liability. You agree to indemnify, defend, and hold Vuzix and all of its agents, directors, employees, information providers, licensors and licensees, officers, and parent (collectively, \"Indemnified Parties\"), harmless from and against any and all liability and costs (including, without limitation, attorneys' fees and costs), incurred by the Indemnified Parties in connection with any claim arising out of any breach by you of these of Use or the foregoing representations, warranties, and covenants. You will cooperate as fully as reasonably required in Vuzix' defense of any claim. Vuzix reserves the right, at its own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you and you shall not in any event settle any matter without the written consent of Vuzix. Disclaimer of Warranties and Damages; Limitation of Liability YOUR USE OF THIS SITE IS AT YOUR OWN RISK. THIS SITE (INCLUDING ALL CONTENT AND FUNCTIONS MADE AVAILABLE ON OR ACCESSED THROUGH THIS SITE) IS PROVIDED \"AS IS.\" TO THE FULLEST EXTENT PERMISSIBLE BY LAW, WITH REGARD TO THE CONTENT ON THIS SITE, VUZIX MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER (1) FOR THE ACCURACY, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT OF ANY CONTENT PUBLISHED ON OR AVAILABLE THROUGH THE SITE; (2) THAT THE SERVER THAT MAKES THIS SITE AVAILABLE IS FREE OF VIRUSES OR OTHER COMPONENTS THAT MAY INFECT, HARM, OR CAUSE DAMAGE TO YOUR COMPUTER EQUIPMENT OR ANY OTHER PROPERTY WHEN YOU ACCESS, BROWSE, DOWNLOAD FROM, OR OTHERWISE USE THE SITE. UNDER NO CIRCUMSTANCES, INCLUDING BUT NOT LIMITED TO VUZIX'S NEGLIGENCE, SHALL VUZIX BE LIABLE FOR ANY CONSEQUENTIAL, DIRECT, INCIDENTAL, INDIRECT, PUNITIVE, OR SPECIAL DAMAGES RELATED TO (A) THE USE OF, (B) THE INABILITY TO USE, OR (C) ERRORS OR OMISSIONS IN THE CONTENTS AND FUNCTIONS OF THIS SITE, EVEN IF VUZIX OR AN AUTHORIZED REPRESENTATIVE THEREOF HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CONSEQUENTIAL OR INCIDENTAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. IN NO EVENT SHALL VUZIX'S TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT OR TORT, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE OR OTHERWISE) EXCEED $100.00. These of Use and any additional posted on this Site together constitute the entire agreement between Vuzix and you with respect to your use of this Site. Any cause of action you may have with respect to your use of this Site must be commenced within one (1) year after the claim or cause of action arises. If for any reason a court of competent jurisdiction finds any provision of these of Use, or portion thereof, to be unenforceable, that provision shall be enforced to the maximum extent permissible so as to effect the intent of this agreement, and the remainder of these of Use shall continue in full force and effect. These of Use shall be governed by and construed in accordance with the laws of the State of New York, United States of America, without reference to its conflicts of law rules.",
    "{{item.name}} Quantity: {{item.quantity}} Price: € {{item.price + item.color.price + item.frame.price | currency : value = \"\"}} {{item.color.name}} {{item.frame.name}} {{item.size.name}} {{item.lenses.name}} Price: € {{item.lenses.price}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} Latest Vuzix Blade ® OS is here! Latest Vuzix Blade OS is now available. Make sure to update your Blade and download the new iOS and Android companion apps. See here for more details. 2019 Innovation Award M400 Smart Glasses The Most Advanced Technology From the Vuzix M-Series Vuzix is proud to announce the next step forward for its industry-leading M-Series platform. The next-generation M400 features the newest Qualcomm ® Snapdragon ™ XR1 platform as well as advanced extras. Each pair of M400 smart glasses boasts an HD camera with 4K recording and best-in-class auto-focus (PDAF), built-in GPS, three noise-cancelling microphones and Snapdragon XR1 designed to accelerate high quality video, audio, and interaction experiences on smart glasses. The M400 is already in high demand with its next level performance. M300XL Smart Glasses The firm foundation of the M-Series M300XL smart glasses have earned their positive reputation in workplaces globally. Their systems and applications improve efficiency, safety, and quality of work for staff and management. M300XL Bundles Available Now Whether you are evaluating Smart Glasses, creating a proof of concept, starting your pilot program or deploying to your teams, we now offer M300XL Bundles! about bundles Latest Vuzix Blade ® OS is here! The Most Advanced Technology From the Vuzix M-Series The firm foundation of the M-Series Blade M400 M300XL Blade €912 ,00 (ex VAT: €760,00) BUY NOW More Info M400 €1.704 ,00 (ex VAT: €1.420,00) BUY NOW More Info M300XL €1.140 ,00 (ex VAT: €950,00) BUY NOW More Info Vuzix Blade ® AR Smart Glasses Vuzix Blade ® provides a natural view of the real world while allowing heads up display and location aware augmented reality content to be naturally overlaid on the view without holding onto a tablet or having to deal with the gyrations required for AR to work on a conventional smartphone. Watch Video \"Vuzix smart glasses get automatic facial recognition designed for law enforcement\" By Darrell Etherington \"They're like sunglasses, but you can see a projection of information on the screen inside. There are all sorts of uses, from reading text messages to seeing an incoming call.\" By CNBC \"A hot new gadget, the CES 2019 innovation award winner, the Vuzix Blade Smart Glasses\" By ExtraTV \"If you want AR glasses that will work seamlessly with your life, making everything from shopping to travel to social media that much easier and more enjoyable, then Vuzix Blade smart glasses are the way to go.\" By New York Magazine \"Vuzix Blade seems to be one of the most feature-complete versions of the tech we've seen so far.\" By Mark Jansen \"Move over, fitness trackers and smartwatches. Vuzix's new $1,000 AR Blade smart glasses are ready to shake up the wearables market this year.\" By Genevieve Scarano \"One of the sleekest and most in-demand products should be the Vuzix Blade AR glasses, which allow for hands-free AR overlays on transparent lenses.\" By Blake Morgan \"As you can see from the image above, the Vuzix Blade stands out from other AR glasses – such as Google Glass – by looking as much like a real pair of glasses as possible.\" By Eric Abent \"It was a dream for Google, but Vuzix has actually done it.\" \"I've been using the pre-release version of the Blade for several weeks now and can honestly say it's the only piece of AR Hardware (aside from my Pixel 2) that I have gone back to several times.\" By Charlie Fink View All News COMPANION APP FOR YOUR PHONE Download and install the Vuzix Blade Companion App from the App Store or Google Play. Once installed, tap Start Setup and follow the instructions on the screen to connect your iOS or Android smart phone with your Blade. The Companion App enables easy setup and customization of your Blade and manages the communication link between the Blade and your smart phone. The companion app on the smart phone allows users to manage application notifications for the Blade such as email, messages, navigation and media player control. Vuzix Companion App Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. COMPANION APP FOR YOUR PHONE The companion app for Android and iOS enables easy setup and customization of your M400 and manages the communication link between the M400 and your smart phone. Vuzix Companion App Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. M300XL Value Bundles M300XL 2 Unit Value Bundle Buy 2, save €120, 00 €2.160 ,00 (ex VAT: €1.800,00) View Details 5% Off M300XL 5 Unit Value Bundle Buy 5, save €588, 00 €5.112 ,00 (ex VAT: €4.260,00) View Details 10% Off M300XL 10 Unit Value Bundle Buy 10, save €1746, 00 €9.654 ,00 (ex VAT: €8.045,00) View Details 15% Off M300XL Value Bundles with Accessories M300XL 2 Unit Value Bundle with Accessories €2.502 ,00 (ex VAT: €2.085,00) View Details 15% Off M300XL 5 Unit Value Bundle with Accessories €5.568 ,00 (ex VAT: €4.640,00) View Details 25% Off M300XL 10 Unit Value Bundle with Accessories €10.794 ,00 (ex VAT: €8.995,00) View Details 30% Off View All Bundles M300XL Smart Glasses With several hardware performance upgrades, Vuzix M300XL improves even more the hands-free digital experience. Allowing unique efficient and accurate access to information, data collection, and communication, the M300XL is a complete tool. Its new design and feedback systems bring more agility to the workplace, keeping all the amazing features from the M300. COMPANION APP FOR YOUR PHONE The companion app for Android and iOS enables easy setup and customization and manages the communication link between your M300XL or M300 with your smart phone. Vuzix Companion App Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. Vuzix B terested in the latest news involving AR technologies? Stay up to date on the Vuzix Blog. View All Blogs Vuzix a Global Leader in Healthcare Wearables Published: 23-December-2019 Wearable fitness tech on the rise Remember when getting (and staying) in shape required nothing more than a pair of runners, a t-shirt and breathable ... View article Do you want to work with us? Be at the front of innovation REGISTER AS A PARTNER Vuzix Blade ® AR Smart Glasses COMPANION APP FOR YOUR PHONE Download and install the Vuzix Blade Companion App from the App Store or Google Play. Once installed, tap Start Setup and follow the instructions on the screen to connect your iOS or Android smart phone with your Blade. The Companion App enables easy setup and customization of your Blade and manages the communication link between the Blade and your smart phone. The companion app on the smart phone allows users to manage application notifications for the Blade such as email, messages, navigation and media player control. Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. COMPANION APP FOR YOUR PHONE The companion app for Android and iOS enables easy setup and customization of your M400 and manages the communication link between the M400 and your smart phone. Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. M300XL 2 Unit Value Bundle M300XL 5 Unit Value Bundle M300XL 10 Unit Value Bundle M300XL Value Bundles with Accessories M300XL 2 Unit Value Bundle with Accessories M300XL 5 Unit Value Bundle with Accessories M300XL 10 Unit Value Bundle with Accessories COMPANION APP FOR YOUR PHONE The companion app for Android and iOS enables easy setup and customization and manages the communication link between your M300XL or M300 with your smart phone. Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. Interested in the latest news involving AR technologies? Stay up to date on the Vuzix Blog. Vuzix a Global Leader in Healthcare Wearables Do you want to work with us? Be at the front of innovation",
    "{{item.name}} Quantity: {{item.quantity}} Price: $ {{item.price + item.color.price + item.frame.price | currency : value = \"\"}} {{item.color.name}} {{item.frame.name}} {{item.size.name}} {{item.lenses.name}} Price: $ {{item.lenses.price}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} Vuzix Wi-Fi QR Code Generator SSID Encryption WPA/WPA2 WEP None Password Hidden Network 30s Scan this Wi-Fi QR Code with your Vuzix Glasses Vuzix cares about your privacy and security. By using this tool, our website sends your browser the software to create the QR code. Your confidential data is processed locally on your own device, and never not sent to our servers. Vuzix Wi-Fi QR Code Generator Scan this Wi-Fi QR Code with your Vuzix Glasses Vuzix cares about your privacy and security. By using this tool, our website sends your browser the software to create the QR code. Your confidential data is processed locally on your own device, and never not sent to our servers.",
    "{{item.name}} Quantity: {{item.quantity}} Price: $ {{item.price + item.color.price + item.frame.price | currency : value = \"\"}} {{item.color.name}} {{item.frame.name}} {{item.size.name}} {{item.lenses.name}} Price: $ {{item.lenses.price}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} {{extra.name}} {{extra.price | currency}} x {{extra.quantity}} Vuzix lands two CES Innovation Awards for CES 2022 Honored in the categories of Computer Peripherals & Accessories and Portable Media Players & Accessories Vuzix Shield™ is a revolutionary leap for enterprise AR smart glasses. Lightweight, stylish, prescription ready safety glasses and powerful 8-core CPU combine to deliver a singular wearable experience. Connect to the metaverse accessing IT sensors, instructions, or live remote guidance, leaving your hands free. Scan codes with an advanced reader or wirelessly stream video from the field all enabled through voice or touch. With the world's first miniature uLED stereo displays, Vuzix Shield connects smart workforces with AR systems for optimized performance, safety and operational efficiency. Vuzix Next Generation Technology Continues to Evolve Vuzix Advanced Optics Smartphone Integration Immersive Sound LED Display Noise-Cancelling Microphones VUZIX ADVANCED OPTICS Ultra-slim, binocular Waveguides powered by a pair of tiny, highly efficient micro-LED projectors, one for each eye, generating crisp video with contextual information. At 1 micron in size, the micro-LED's have one of the highest density pixel arrays available with both monochrome and full color solutions in development. LED DISPLAY AND NOISE-CANCELLING MICROPHONES Advanced micro-LED displays require extremely low power while providing brilliantly bright images with excellent contrast. Self-contained dual temple batteries can power you for hours. Multiple built-in noise-cancelling microphones allow for flawless phone calls and voice/UI integration. IMMERSIVE SOUND Forgot your uncomfortable ear buds? Not to worry, with acoustic chambers fully integrated into the frames we deliver clear stereo, targeted over the ears for privacy, without losing ambient sound around their wearer. SMARTPHONE INTEGRATION Enhancing hands-free operation, the on-board processor wirelessly communicates with your phone and with the built-in LTE cellular option. Using your voice or, tap on the touch-sensitive arm and the displays activate, allowing discrete connectivity to the world. about Vuzix Shield™ If you're interested in Vuzix Shield™, fill out the below form. Please read our to see how we manage your data. *Vuzix Shield™ is covered under multiple Vuzix Corporation patents and patents pending. Contact Us To know more about our products, partner services or investment opportunities, please contact us. General Inquiries Call: +1-585-359-5900 TF: 800-436-7838 Technical Support Call: +1-585-359-5900 Email: technical_support@vuzix.com Contact Us Vuzix lands two CES Innovation Awards for CES 2022 Vuzix Shield™ is a revolutionary leap for enterprise AR smart glasses. Lightweight, stylish, prescription ready safety glasses and powerful 8-core CPU combine to deliver a singular wearable experience. Connect to the metaverse accessing IT sensors, instructions, or live remote guidance, leaving your hands free. Scan codes with an advanced reader or wirelessly stream video from the field all enabled through voice or touch. With the world's first miniature uLED stereo displays, Vuzix Shield connects smart workforces with AR systems for optimized performance, safety and operational efficiency. Vuzix Next Generation Technology Continues to Evolve Ultra-slim, binocular Waveguides powered by a pair of tiny, highly efficient micro-LED projectors, one for each eye, generating crisp video with contextual information. At 1 micron in size, the micro-LED's have one of the highest density pixel arrays available with both monochrome and full color solutions in development. LED DISPLAY AND NOISE-CANCELLING MICROPHONES Advanced micro-LED displays require extremely low power while providing brilliantly bright images with excellent contrast. Self-contained dual temple batteries can power you for hours. Multiple built-in noise-cancelling microphones allow for flawless phone calls and voice/UI integration. Forgot your uncomfortable ear buds? Not to worry, with acoustic chambers fully integrated into the frames we deliver clear stereo, targeted over the ears for privacy, without losing ambient sound around their wearer. Enhancing hands-free operation, the on-board processor wirelessly communicates with your phone and with the built-in LTE cellular option. Using your voice or, tap on the touch-sensitive arm and the displays activate, allowing discrete connectivity to the world. about Vuzix Shield™ If you're interested in Vuzix Shield™, fill out the below form. Please read our to see how we manage your data. *Vuzix Shield™ is covered under multiple Vuzix Corporation patents and patents pending. To know more about our products, partner services or investment opportunities, please contact us."
  ]
}