{
  "company": "www.guardforce.com.hk",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 16,
    "-1": 6
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.75,
    "framing_surveillance": 0.25,
    "framing_market": 0.0,
    "num_docs": 22
  },
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 16
    }
  },
  "sample_docs": [
    "Chubb Australia Limited http://www.chubb.com.au Quell Fire & Safety http://www.quell.com.au Fire Fighting Enterprises http://www.ffe.com.au Chubb Thailand Limited http://www.chubb.co.th Chubb Uk Limited http://www.chubb.co.uk Chubb Ireland Limited http://www.chubb.ie North America & Canada World of Security http://www.chubbsecurity.com Chubb Flame Control http://www.chubbfire.nl Chubb Lips Beveiliging http://www.lipsbeveiliging.nl Security and Guarding Services Industry Authority http://www.info.gov.hk/sb/eng/sgsia/index.html Hong Kong Police http://www.info.gov.hk/police/ Crime Prevention Bureau http://www.info.gov.hk/police/aa-home/english/cpb/ Vocational Training Council http://sstb.vtc.edu.hk International Professional Security Association http://www.ipsa.com.hk/ American Society for Industrial Security http://www.asisonline.org.hk/ Hong Kong Security Association http://www.tsa.com.hk/ Asia Professional Security Association http://www.apsahk.org/ Security Industry Training Organization http://www.sito.co.uk/ Association of registered Fire Services http://www.fsica.org.hk Industrial Fire Journal http://www.industrialfirejournal.com/index2.htm Fire and Rescue http://www.fireandrescue.net/index2.htm Asia Automation & Security http://en.asmag.com/magazine/asia.php Architecture & Urbanism http://www.auonline.com/eng/index.htm Construction & Contract News http://www.building.com.hk/ccn/ccnindex.html Hong Kong Federation of Electrical & Mechanical Contractors Limited http://www.hkfemc.org",
    "Chubb China Limited http://www.chubb-china.com.cn Chubb Australia Limited http://www.chubb.com.au Quell Fire & Safety http://www.quell.com.au Fire Fighting Enterprises http://www.ffe.com.au Chubb Thailand Limited http://www.chubb.co.th UK & Ireland & South Africa Chubb Uk Limited http://www.chubb.co.uk Chubb Ireland Limited http://www.chubb.ie North America & Canada World of Security http://www.chubbsecurity.com Chubb Flame Control http://www.chubbfire.nl Chubb Lips Beveiliging http://www.lipsbeveiliging.nl Security and Guarding Services Industry Authority http://www.info.gov.hk/sb/eng/sgsia/index.html Hong Kong Police http://www.info.gov.hk/police/ Crime Prevention Bureau http://www.info.gov.hk/police/aa-home/english/cpb/ Vocational Training Council http://sstb.vtc.edu.hk International Professional Security Association http://www.ipsa.com.hk/ American Society for Industrial Security http://www.asisonline.org.hk/ Hong Kong Security Association http://www.tsa.com.hk/ Asia Professional Security Association http://www.apsahk.org/ Security Industry Training Organization http://www.sito.co.uk/ Association of registered Fire Services http://www.fsica.org.hk Industrial Fire Journal http://www.industrialfirejournal.com/index2.htm Fire and Rescue http://www.fireandrescue.net/index2.htm Asia Automation & Security http://en.asmag.com/magazine/asia.php Architecture & Urbanism http://www.auonline.com/eng/index.htm Construction & Contract News http://www.building.com.hk/ccn/ccnindex.html Hong Kong Federation of Electrical & Mechanical Contractors Limited http://www.hkfemc.org",
    "A leader in ATM cash replenishment, cash collections and processing, security storage and time critical courier. One of the main areas of expertise in the overall success of Guardforce is specialized security transport services. When valuables need to be conveyed from one location to another, Guardforce has the technology, manpower and experience to get the job done right every time. For more details, please call us at 2765-2832. Our Sales & Marketing professionals would be pleased to discuss your needs and provide solutions that will add value to your business. Collection & Delivery Service ATM Management Service Wrapped Coins Supply & Coin Processing Service Security Storage Service Cash Processing Service Pick and Pack Service Sub-Treasury Services International Service Collection & Delivery Service Guardforce can provide highly reliable and secure cash and valuable collection and delivery services to reduce your risk in handling the transportation of cash and valuables. We are able to delivery this quality through the largest armoured fleet in Hong Kong that is equipped with the latest technology, professionally trained security personnel backed by full insurance coverage. ATM Management Service Guardforce provides comprehensive ATM management services, from cash replenishing, deposit envelope processing, cash depositor monitoring to attending alarm response and emergency maintenance service for machine failure. Our highly trained staff and complete ATM service can help you to develop your ATM networks without worrying about logistical problems. Wrapped Coins Supply & Coin Processing Service Exchanging and counting coins is a time consuming process that interferes with the core focus of your business. If you want to improve your company's efficiency, The Guardforce complete coin service can definitely help you. We supply all denominations of coins to meet your daily exchange need. Guardforce also has hi-tech equipment to count and verify high volume of coins. This service is particularly suitable to those business receiving coins on regular basis. Security Storage Service Guardforce's secure storage service offers you peace of mind. Our strongroom is manned 24-hours and 365-days offering over 1500 sq. feet of high security storage that includes advanced electronic access control, sophisticated alarm monitoring and recording system and color digital CCTV monitoring. Our high security storage area is up to Bank Vault standards and offers excellent short or long term secure storage. Cash Processing Service Guardforce provides a solution for handling bulk cash that will reduce your costs of processing cash in your business. Our Cash Processing Centre is in a high security area installed with real-time video recording systems and access control systems. Cash collected from your outlets are sorted, verified and consolidated into one single deposit in this Centre and them promptly deposited into your bank account. Customized management reports will be produced that will meet the requirements of your accounting department. Pick and Pack Service The pick and pack service offers you a total solution to address your need in handling phone cards, gift certificates, cash coupons and other stored value cards. The service includes the collection, packing, storage and distribution as well as inventory management. Sub-Treasury Services The sub treasury service focuses on the outsourcing need of the bank for their treasury function. The service includes the cash forecasting, cash collecting and processing and the supply of the emergency cash.",
    "17 February 2005 Financial Analyst We are seeking high-caliber personnel to join Chubb and you are cordially invited to refer your friends or relatives to be our associates. Being an open and equal opportunity employer, we are strongly support and welcome our staff to apply for internal transfer. Division / Department : Responsibilities: Coordinate the annual budget process and monthly forecast, liaise closely with the department managers to ensure timely and accurate budget and forecast are submitted Coordinate with the business units for improvement of monthly contract review Involved in the refinement of internal control for the revenue billing and costs capturing process to ensure compliance with Sarbanes Oxley perform analytical review on the monthly results before reporting to headquarters, ensure the revenue and associated costs are matched and are recognized with corporate policies Provide financial analytical support to business units to meet their daily operation needs Requirements: Degree holder in Accounting or related disciplines, ACCA / HKSA member Minimum 5 years experience in accounting preferably in international accounting firm Good command of spoken and written English and Chinese Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Coordinate the annual budget process and monthly forecast, liaise closely with the department managers to ensure timely and accurate budget and forecast are submitted Coordinate with the business units for improvement of monthly contract review Involved in the refinement of internal control for the revenue billing and costs capturing process to ensure compliance with Sarbanes Oxley perform analytical review on the monthly results before reporting to headquarters, ensure the revenue and associated costs are matched and are recognized with corporate policies Provide financial analytical support to business units to meet their daily operation needs Coordinate with the business units for improvement of monthly contract review Involved in the refinement of internal control for the revenue billing and costs capturing process to ensure compliance with Sarbanes Oxley perform analytical review on the monthly results before reporting to headquarters, ensure the revenue and associated costs are matched and are recognized with corporate policies Provide financial analytical support to business units to meet their daily operation needs Involved in the refinement of internal control for the revenue billing and costs capturing process to ensure compliance with Sarbanes Oxley perform analytical review on the monthly results before reporting to headquarters, ensure the revenue and associated costs are matched and are recognized with corporate policies Provide financial analytical support to business units to meet their daily operation needs perform analytical review on the monthly results before reporting to headquarters, ensure the revenue and associated costs are matched and are recognized with corporate policies Provide financial analytical support to business units to meet their daily operation needs Provide financial analytical support to business units to meet their daily operation needs Requirements: Degree holder in Accounting or related disciplines, ACCA / HKSA member Minimum 5 years experience in accounting preferably in international accounting firm Good command of spoken and written English and Chinese Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Degree holder in Accounting or related disciplines, ACCA / HKSA member Minimum 5 years experience in accounting preferably in international accounting firm Good command of spoken and written English and Chinese Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Minimum 5 years experience in accounting preferably in international accounting firm Good command of spoken and written English and Chinese Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Good command of spoken and written English and Chinese Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Excellent computer skills particular in MS Office applications especially Excel Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Mature, independent, self-initiative and willing to work under pressure Knowledge of Hyperion is preferable Knowledge of Hyperion is preferable Application please send to : The Human Resources Services Department, Chubb Hong Kong Limited, 1/F., Guardforce Centre, 3 Hok Yuen Street East, Hung Hom, Kowloon or e-mail to hrd@chubb.com.hk or fax to 2764 3098",
    "Offering a professional complete security management solution . Since 1977, Guardforce Security Personnel has grown into one of the market leaders with a highly diverse guarding operation in Hong Kong. We assemble security personnel into teams that are tailor-made to complement your integrated security plan. Teams of uniformed security personnel predominantly serve in an overt, professional and disciplined manner for a wide range of commercial, retail, residential, financial, industrial customers. Plain-clothes personnel are deployed when customers require a more discreet, customer services focus to their security solution. Our Security Personnel Services includes: Shopping Malls Hotels Offices Terminals Special Events Special Events, in particular those involving crowd control, for everything from sports events to commercial exhibitions require a comprehensive package of manpower, electronic and physical security solutions. Fun Fair Fashion Show Road Show Jewelry Show Sports Fashion Show Road Show Jewelry Show Sports Road Show Jewelry Show Sports Classic Gurkha Services Gurkhas have been serving in the British Army since 1816. They are famous for their loyalty, discipline, courteous manner and their tough, pragmatic approach to duty. Guardforce Gurkhas are selected to meet your individual security requirements by our ex-British and Gurkha Commissioned Officers. All Guardforce Gurkhas are full-time employees of the company and are Hong Kong residents vetted by the Hong Kong Police Department prior to employment. 24 hours Control Centre Our 24-hours Control Centre has direct communication to all central Monitoring station, Police Control Rooms and our Keyholding/Alarm response vehicles. Key Holding Services/Alarm Response vehicles. Tele-protection Internal Audit/Mobile Patrol Visits/Inspection Team Tele-protection Internal Audit/Mobile Patrol Visits/Inspection Team Internal Audit/Mobile Patrol Visits/Inspection Team To ensure discipline and comprehensive, tailor-made procedures are fully complied with. Refresher and continuous 'on-the-job' training reinforces procedures. Providing basic and advanced security personnel training (crowd control, fire prevention, customer services, etc.) Security force operations training Security operations supervision Security force operations training Security operations supervision Consultancy & Security Audit Full Threat Assessment & Recommendations Design of a complete security strategy Recruiting of Security Personnel Conducting route and routine analysis and practice Conducting security protection audits Evacuation Policies Design of a complete security strategy Recruiting of Security Personnel Conducting route and routine analysis and practice Conducting security protection audits Evacuation Policies Recruiting of Security Personnel Conducting route and routine analysis and practice Conducting security protection audits Evacuation Policies Conducting route and routine analysis and practice Conducting security protection audits Evacuation Policies Conducting security protection audits Evacuation Policies Guardforce Personnel – We offer the complete solution for security management with pre-event planning, flexible deployment of security teams, VIP protection, special assignment training, key-holding services, mobile patrols, and superior building maintenance supervision. Emergency Contacts Emergency Contact 24 hours Control Centre (852) 2765 6343 or (852) 2765 2847 Email: SSD@guardforce.com.hk"
  ]
}