{
  "company": "www.pxl-vision.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 3,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3684210526315789,
    "framing_surveillance": 0.0526315789473684,
    "framing_market": 0.5789473684210527,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 3
    }
  },
  "sample_docs": [
    "In an age where we increasingly exist and interact online Daego® is a vital gatekeeper in the validation and creation of trusted digital identities for customer onboarding through advanced document and identity verification. Faster OnBoarding Times Faster Onboarding Times Identity Verification & Onboarding Daego® redefines identity verification, making online customer onboarding easier and more reliable than ever. Adapting to customer requirements, Daego® is a completely flexible cross-platform solution which can be integrated into any technical environment. Higher Sales Conversion Lower Onboarding Costs Protection from Fraudsters Identity Verification & Onboarding Daego® redefines identity verification, making online customer onboarding easier and more reliable than ever. Adapting to customer requirements, Daego® is a completely flexible cross-platform solution which can be integrated into any technical environment. Document Verification Daego® uses a machine-based approach, deploying computer vision and machine learning, to efficiently and securely validate document authenticity in real time. ID Capture & Data extraction Fully automated real-time capture of ID documents using mobile or desktop cameras Accurate extraction of machine readable and visual inspection zone Automatic identification of document type with wide document support globally ID Document Authentication Automatic forgery detection and verification of document authenticity Validation of security features such as hologram and lenticular Optional human checks can be included for high-risk environments Identity Verification Daego® deploys powerful biometric face recognition technology and liveness checks to verify in real-time whether the user matches the document photo. Face Verification State-of-the-art facial recognition technology which compares a live \"video selfie\" against the ID document photo Engine optimised for the comparison of 2D photo images and live video selfies 1:1 biometric facial recognition for authentication of existing users Zero-interaction Liveness Check Detects facial biometric fraud such as usage of static images vs. a live person Emotion tracking to assess whether the user is being coerced Intuitive technology – no guided interaction needed Workflow Automation PXL offers peripheral services and tools to support your end-to-end identity verification and onboarding process. Digital signatures Data and text capture from forms/ invoices/ documents Scanning and processing of codes, barcodes, QR codes, etc Background checks (PEP, sanction lists etc.) 1:n facial check against existing user database Additional features on request Daego® uses a machine-based approach, deploying computer vision and machine learning, to efficiently and securely validate document authenticity in real time. ID Capture & Data extraction Fully automated real-time capture of ID documents using mobile or desktop cameras Accurate extraction of machine readable and visual inspection zone Automatic identification of document type with wide document support globally Automatic forgery detection and verification of document authenticity Validation of security features such as hologram and lenticular Optional human checks can be included for high-risk environments Daego® deploys powerful biometric face recognition technology and liveness checks to verify in real-time whether the user matches the document photo. State-of-the-art facial recognition technology which compares a live \"video selfie\" against the ID document photo Engine optimised for the comparison of 2D photo images and live video selfies 1:1 biometric facial recognition for authentication of existing users Detects facial biometric fraud such as usage of static images vs. a live person Emotion tracking to assess whether the user is being coerced Intuitive technology – no guided interaction needed PXL offers peripheral services and tools to support your end-to-end identity verification and onboarding process. Data and text capture from forms/ invoices/ documents Scanning and processing of codes, barcodes, QR codes, etc Background checks (PEP, sanction lists etc.) 1:n facial check against existing user database Additional features on request Your Daego® Solution Every business has different needs and considerations. Daego's powerful document and identity verification technologies can be delivered as plug-and-play off the shelf platforms or customer-tailored solutions. Daego® Go! True Identity as a Service. This plug-and-play solution incorporates our proprietary identity verification modules within a carefully curated user environment for both web and mobile formats. Easy integration: the fastest way to integrate Daego® Includes Daego® Document and Identity Verification Smooth UX for a fast, low-friction onboarding experience Available as a web app via API, or download our mobile version for iOS or Android Daego® Onboard Daego® is also offered as software development kit (SDK) for full flexibility and independence, allowing complete customization of the end-to-end identity verification and onboarding process. Deago can be Integrated into existing client applications or as part of a new white label solution. Access to Daego® document and identity verification SDK Additional workflow automation tools available, such as document scanner, e-signature, bar/QR codes, PEP and sanction list checks Flexible integration and hosting options Business rules definition, consultancy and project management of new solutions Every business has different needs and considerations. Daego's powerful document and identity verification technologies can be delivered as plug-and-play off the shelf platforms or customer-tailored solutions. True Identity as a Service. This plug-and-play solution incorporates our proprietary identity verification modules within a carefully curated user environment for both web and mobile formats. Easy integration: the fastest way to integrate Daego® Includes Daego® Document and Identity Verification Smooth UX for a fast, low-friction onboarding experience Available as a web app via API, or download our mobile version for iOS or Android Daego® is also offered as software development kit (SDK) for full flexibility and independence, allowing complete customization of the end-to-end identity verification and onboarding process. Deago can be Integrated into existing client applications or as part of a new white label solution. Access to Daego® document and identity verification SDK Additional workflow automation tools available, such as document scanner, e-signature, bar/QR codes, PEP and sanction list checks Flexible integration and hosting options Business rules definition, consultancy and project management of new solutions For more information or a product demo with one of our experts, please contact us:",
    "We prepare your business for the digital age by providing fully automated identity verification and customer onboarding solutions Enabling Trust Online Your customers increasingly exist and transact online. With identity fraud at all-time highs, our solutions bring trust to digital interactions between businesses and people by enabling true digital identities. Digitizing your Business Our solutions transform customer onboarding by making the process smoother and faster, delivering improved sales conversion while preparing your business for an increasingly digital landscape. Daego® is a powerful software platform for secure identity verification, efficient customer onboarding and the creation & management of trusted digital identities Document Verification Using an automated approach, Daego® captures and extracts data of identity documents and verifies their authenticity. Identity Verification Daego® verifies the user's identity using our state-of-the art biometric facial recognition and liveness checks. Workflow Automation Daego® offers peripheral services and tools to optimize your end-to-end identity verification and onboarding process. Using an automated approach, Daego® captures and extracts data of identity documents and verifies their authenticity. Daego® verifies the user's identity using our state-of-the art biometric facial recognition and liveness checks. Daego® offers peripheral services and tools to optimize your end-to-end identity verification and onboarding process. Application Areas Daego® can be applied to specific use cases in various industries. Following a few selected examples: Financial Institutions Telecommunications Ecommerce Crypto KYC Shared Economy Travel Industry Government Financial Institutions Having to fulfill strict KYC mandates, this is a traditionally painful process for Financial Institutions with high costs, high friction and long processing times associated with identity verification compliance. Our cutting edge solutions transform this procedure. Daego® performs remote identity authentication in seconds, at a fraction of the cost of traditional methods, while delivering the security essential for this stage in the KYC process. PXL Vision also offers video call verification for markets with stricter KYC requirements. Telecommunications As part of customer onboarding, Telco's are required to perform identity verification. In many instances, these requirements have created cumbersome manual processes, affecting drop-out rates and online sales capabilities, while adding significant costs. Our onboarding solutions have already helped numerous Swiss Telco's prevent fraud, drive down costs and improve customer experience while crucially enabling growth in online sales. Ecommerce E-commerce websites can benefit from the Daego® suite to quickly and efficiently register new customers while protecting their business and customers against potential fraudsters, as well as ensuring GDPR compliance. For some environments, a simple age verification may be required. By combining our cost-effective tools with simple business rules, age verification and multiple other operating considerations can be configured to meet specific operating needs. Crypto KYC As lawmakers and regulators shape the ICO and blockchain ecosystem, KYC and identity verification are becoming increasingly important. Our cutting-edge onboarding solution offers an efficient, low-friction experience while ensuring regulatory mandates are met. Shared Economy It is essential to create trust in the sharing economy ecosystem. From ride or home sharing to reselling marketplaces, identity verification enables a more trustworthy environment in which these economies can thrive. Daego® is this trust enabler. Allow the users of your ecosystem to interact without fear of fraudsters. Travel Industry With document forgeries becoming more and more sophisticated, it is vital the ecosystem is equipped with the right tools to detect fakes. Whether it be our core Daego® solution for service providers, or software and hardware developments for airport and border control, our solutions add an additional layer of security to existing protocols. Government Digital identity verification is also being leveraged by the public sector as many governments are looking to eID schemes to digitize and optimize access to government services. Additionally, public agencies such as police and postal services regularly perform identity verification and checks on government issued documents. Digital identity verification can be used to drive real efficiencies within the public sector, while also providing cost saving benefits. Daego® can be applied to specific use cases in various industries. Following a few selected examples: Having to fulfill strict KYC mandates, this is a traditionally painful process for Financial Institutions with high costs, high friction and long processing times associated with identity verification compliance. Our cutting edge solutions transform this procedure. Daego® performs remote identity authentication in seconds, at a fraction of the cost of traditional methods, while delivering the security essential for this stage in the KYC process. PXL Vision also offers video call verification for markets with stricter KYC requirements. As part of customer onboarding, Telco's are required to perform identity verification. In many instances, these requirements have created cumbersome manual processes, affecting drop-out rates and online sales capabilities, while adding significant costs. Our onboarding solutions have already helped numerous Swiss Telco's prevent fraud, drive down costs and improve customer experience while crucially enabling growth in online sales. E-commerce websites can benefit from the Daego® suite to quickly and efficiently register new customers while protecting their business and customers against potential fraudsters, as well as ensuring GDPR compliance. For some environments, a simple age verification may be required. By combining our cost-effective tools with simple business rules, age verification and multiple other operating considerations can be configured to meet specific operating needs. As lawmakers and regulators shape the ICO and blockchain ecosystem, KYC and identity verification are becoming increasingly important. Our cutting-edge onboarding solution offers an efficient, low-friction experience while ensuring regulatory mandates are met. It is essential to create trust in the sharing economy ecosystem. From ride or home sharing to reselling marketplaces, identity verification enables a more trustworthy environment in which these economies can thrive. Daego® is this trust enabler. Allow the users of your ecosystem to interact without fear of fraudsters. With document forgeries becoming more and more sophisticated, it is vital the ecosystem is equipped with the right tools to detect fakes. Whether it be our core Daego® solution for service providers, or software and hardware developments for airport and border control, our solutions add an additional layer of security to existing protocols. Digital identity verification is also being leveraged by the public sector as many governments are looking to eID schemes to digitize and optimize access to government services. Additionally, public agencies such as police and postal services regularly perform identity verification and checks on government issued documents. Digital identity verification can be used to drive real efficiencies within the public sector, while also providing cost saving benefits. Our Clients and Partners Our Clients and Partners For more information or a product demo with one of our experts, please contact us:",
    "Top expertise to build outstanding solutions for your business PXL Vision has extensive expertise in transforming complex computer vision technologies and research into easy-to-use solutions for end-users. We help companies advance their business by boasting their digital transformation, based on computer vision, AI and other technologies. These technologies, together with PXL's process expertise and integration know-how help PXL to create innovative, reliable and value adding solutions that help streamline business processes. Key Customer Benefits PXL Beam® Technology Stack PXL Beam ® is a software engine based on Computer Vision, AI, Deep Learning and AR/VR technologies that integrates with mobile or stationary devices and AR/VR headset. PXL's technologies enable camera based devices to detect, extract and process content in real time from video streams, leveraging technologies of compute vision and artificial intelligence. SW Development & Deployment PXL has developed and deployed mass market software that is used by more than a million consumers world-wide, always ensuring a high degree of scalability, reliability and usability. PXL's software solutions are mostly based on computer vision and machine learning and include web applications and portals, as well as mobile applications and rich client applications. Business Process & Integration PXL has a proven track record of analyzing business processes and implementing complex SW technologies into existing customer software environments. We have been supporting small and large organisations with their digital transformation by developing a broad range of turnkey solutions from analysis and design to productive use. . Mechatronics & HW Production PXL has deep interdisciplinary know-how in working with complex hardware-software combinations (camera, optics, electronics, mechanics). Having built and launched a range of mass market products with various Original Design Manufactures (ODMs), PXL has gained extensive experience in manufacturing mass productions of HW-SW products. PXL Beam ® is a software engine based on Computer Vision, AI, Deep Learning and AR/VR technologies that integrates with mobile or stationary devices and AR/VR headset. PXL's technologies enable camera based devices to detect, extract and process content in real time from video streams, leveraging technologies of compute vision and artificial intelligence. PXL has developed and deployed mass market software that is used by more than a million consumers world-wide, always ensuring a high degree of scalability, reliability and usability. PXL's software solutions are mostly based on computer vision and machine learning and include web applications and portals, as well as mobile applications and rich client applications. PXL has a proven track record of analyzing business processes and implementing complex SW technologies into existing customer software environments. We have been supporting small and large organisations with their digital transformation by developing a broad range of turnkey solutions from analysis and design to productive use. . PXL has deep interdisciplinary know-how in working with complex hardware-software combinations (camera, optics, electronics, mechanics). Having built and launched a range of mass market products with various Original Design Manufactures (ODMs), PXL has gained extensive experience in manufacturing mass productions of HW-SW products. Consulting & Custom Solutions As PXL works on a wide variety of problems such as image recognition, object detection and tracking, automatic document analysis, face detection and recognition, computational photography, AR/VR and more, we have extensive knowledge and expertise in these fields. PXL offers its know-how Computer Vision, AI, Deep Learning and AR/VR expertise to customers who do not have the knowledge or the capacity to build such solutions in-house. PXL helps clients research and analyze processes and come up with innovative ideas and designs for developing unique solutions, and also builds computer vision based custom solutions that are in line with PXL's technology roadmap. PXLs Data and Object Cores can be flexibly tuned and applied to any other physical content or object, and can be easily integrated into existing processes with reasonable efforts.",
    "Customised identification for various industries and use cases Our fully automated solution verifies identities in less than 30 seconds, ensuring a smooth and efficient user experience. It is easily configurable to your specific use case, offers full white-label flexibility, and complies with the highest standards of data privacy and security. Designed for effortless scalability and optimised to maximise conversion rates, it supports your business growth. Our industries & use cases PXL Vision at a glance: >50 predefined workflows Verification in <30 seconds eIDAS & ZertES compliance 165+ countries supported Why PXL Vision ? Our solutions help you achieve Ultimate Conversion. Because our products feature a superior user interface, unlimited customisation, innovative technology and customer success management. 01 Uniquely User-Friendly Uniquely User-Friendly In under 30 seconds, identity and age verification can be completed using our web-based Auto-ID process. No additional app download required. Clear instructions, as well as Passive Liveness Detection make it easy for customers to verify themselves. 02 Individually Configurable Individually Configurable Our products are adaptable to a wide range of customer needs and use cases. You can choose from SaaS, on-premise, a hybrid solution or purchase individual modules. White label options give you the flexibility to build our products natively in your own design. 03 Future-oriented Technology Future-oriented Identity Verification Technology We develop our own technology, largely independently of third parties. This makes our solutions and processes more flexible, faster and more secure. We are constantly optimising it to ensure that we can offer our customers future-proof products. Our OCR text and screen recognition is of high quality and accuracy. 04 Customer Success Management Continuous Customer Success Management You can rely on a full service package . We take care of everything from consulting, technical installation and configuration to ongoing optimisation and post-implementation support. Your success and successful implementation is our goal. Our products - the basis for your success Saas PXL Ident Simple Plug-and-Play solution with optimised basic functions Web based SaaS Co-Branding or White Label Key Features Do cument & Face Verification Liveness Detection Self-Declaration E-Mail & SMS Verification Document & Barcode Scanning On-Premise Hybrid PXL Pro Flexible mix-and-match toolbox for customisable workflows & integration Web based Hybrid or On-Premise Co-Branding / White Label & Workflows build by Customer Key Features Document & Face Verification Liveness Detection NFC Validation Document & Barcode Scanning Saas PXL Age Standalone age verification solution for age checks in less than 20 seconds Web based SaaS Co-Branding or White Label Key Features Document Verification Optional Face Verification KJM compliant No app download required Saas PXL Edu Standalone identity verification solution specifically for education Web based SaaS Co-Branding or White Label Key Features Document & Face Verification Liveness Detection Self-Declaration Multi-Channel possible - for on-site or remote verification Trust through security and compliance Visit our Trust Center eIDAS / ZertES ISO 27001 Certified ISAE 3402 Type 2 KJM Approved Customer reviews that convince \"We were fully convinced by the solution from PXL Vision. It has enabled us to streamline our processes and provide customers with flexible, secure access to our fleet.†Yannick von Ah Head of Customer Service, Mobility \"Working with PXL Vision has benefitted us and our customers on several levels . Today, we are able to onboard applicants effortlessly, providing them with the insurance they need, when they need it. We create value for them and for our company.\" Jonathan Valour Senior Product Manager, Groupe Mutuel \"The collaboration with PXL Vision was very good. The challenges were solved together and the system is now stable and efficient.†René Ottiger Product Manager Financial Services at SBB \"Because the process is browser-based and there is no need to download an additional application, as is the case with other providers, we achieve a very high conversion rate of 93 % .\" Alfonso Matas Product Manager and Product Owner, Digital Republic \"The integration of PXL Ident was quick and uncomplicated . Even with complex requirements, the cooperation was always very productive and solution-oriented. \" Metin Kabay Co-Founder, COO and CTO at drivemycar AG \"PXL Ident offers an extremely f ast and very smooth verification process for investors on our platform.\" Marc Rinderknecht Co-Managing Director and Product Owner at OOMNIUM \"As national digital identity providers, we rely on the highest possible standard in security and data protection for identity verification. PXL Vision allows us to have full control of the verification process and convey the trust we need for the SwissID.\" Markus Naef CEO at SwissSign AG \"As Well continues to grow, we are convinced that PXL Vision will help us scale and bring our eHealth platform to the masses. The frictionless verification process allows our users to get 24/7 access to online services from anywhere.\" Stephanie Künzli CPO at Well \"Gambling is a socially sensitive product. The player and youth protection must be ensured and implemented consistently. PXL Vision has convinced us immediately. \" Florian Hermann Director Marketing and Operations Novo Interactive \"Thanks to PXL Vision, we've done more than just simplify the identity verification process . We've also significantly raised our quality levels. That was precisely our goal.\" Fabian Baldinger Swiss Life Switzerland \"The flexibility of PXL Visions's platform has completely aligned with our need to provide a multitude of use cases tailored to various regulatory requirements and business preferences. We have built a mutually beneficial partnership and were always supported in any matter to the fullest extent.\" Roger Huber Project Lead Multichannel Management Zürcher Kantonalbank \"Across 17 platforms, Lemonfrog brings people together to exchange services. In PXL Vision we see a strategic partner who helps provide an environment where our users feel safe to interact in a trusted way. T he verification is quick, seamless and widely accepted among our user base . \" Tom Stierli CEO at Lemonfrog Are you looking for a highly flexible identity verification solution? Our experts are eager to show you how we can help digitise and streamline your verification processes. Contact us Customised identification for various industries and use cases Our fully automated solution verifies identities in less than 30 seconds, ensuring a smooth and efficient user experience. It is easily configurable to your specific use case, offers full white-label flexibility, and complies with the highest standards of data privacy and security. Designed for effortless scalability and optimised to maximise conversion rates, it supports your business growth. Our industries & use cases Customised identification for various industries and use cases Our fully automated solution verifies identities in less than 30 seconds, ensuring a smooth and efficient user experience. It is easily configurable to your specific use case, offers full white-label flexibility, and complies with the highest standards of data privacy and security. Designed for effortless scalability and optimised to maximise conversion rates, it supports your business growth. PXL Vision at a glance: Verification in <30 seconds eIDAS & ZertES compliance Why PXL Vision ? Our solutions help you achieve Ultimate Conversion. Because our products feature a superior user interface, unlimited customisation, innovative technology and customer success management. 01 Uniquely User-Friendly Uniquely User-Friendly In under 30 seconds, identity and age verification can be completed using our web-based Auto-ID process. No additional app download required. Clear instructions, as well as Passive Liveness Detection make it easy for customers to verify themselves. 02 Individually Configurable Individually Configurable Our products are adaptable to a wide range of customer needs and use cases. You can choose from SaaS, on-premise, a hybrid solution or purchase individual modules. White label options give you the flexibility to build our products natively in your own design. 03 Future-oriented Technology Future-oriented Identity Verification Technology We develop our own technology, largely independently of third parties. This makes our solutions and processes more flexible, faster and more secure. We are constantly optimising it to ensure that we can offer our customers future-proof products. Our OCR text and screen recognition is of high quality and accuracy. 04 Customer Success Management Continuous Customer Success Management You can rely on a full service package . We take care of everything from consulting, technical installation and configuration to ongoing optimisation and post-implementation support. Your success and successful implementation is our goal. Why PXL Vision ? In under 30 seconds, identity and age verification can be completed using our web-based Auto-ID process. No additional app download required. Clear instructions, as well as Passive Liveness Detection make it easy for customers to verify themselves. Our products are adaptable to a wide range of customer needs and use cases. You can choose from SaaS, on-premise, a hybrid solution or purchase individual modules. White label options give you the flexibility to build our products natively in your own design. Future-oriented Identity Verification Technology We develop our own technology, largely independently of third parties. This makes our solutions and processes more flexible, faster and more secure. We are constantly optimising it to ensure that we can offer our customers future-proof products. Our OCR text and screen recognition is of high quality and accuracy. Continuous Customer Success Management You can rely on a full service package . We take care of everything from consulting, technical installation and configuration to ongoing optimisation and post-implementation support. Your success and successful implementation is our goal. Our products - the basis for your success Saas PXL Ident Simple Plug-and-Play solution with optimised basic functions Web based SaaS Co-Branding or White Label Key Features Do cument & Face Verification Liveness Detection Self-Declaration E-Mail & SMS Verification Document & Barcode Scanning On-Premise Hybrid PXL Pro Flexible mix-and-match toolbox for customisable workflows & integration Web based Hybrid or On-Premise Co-Branding / White Label & Workflows build by Customer Key Features Document & Face Verification Liveness Detection NFC Validation Document & Barcode Scanning Saas PXL Age Standalone age verification solution for age checks in less than 20 seconds Web based SaaS Co-Branding or White Label Key Features Document Verification Optional Face Verification KJM compliant No app download required Saas PXL Edu Standalone identity verification solution specifically for education Web based SaaS Co-Branding or White Label Key Features Document & Face Verification Liveness Detection Self-Declaration Multi-Channel possible - for on-site or remote verification Our products - the basis for your success Simple Plug-and-Play solution with optimised basic functions Co-Branding or White Label Do cument & Face Verification E-Mail & SMS Verification Document & Barcode Scanning Flexible mix-and-match toolbox for customisable workflows & integration Web based Hybrid or On-Premise Co-Branding / White Label & Workflows build by Customer Document & Face Verification Document & Barcode Scanning Standalone age verification solution for age checks in less than 20 seconds Co-Branding or White Label No app download required Standalone identity verification solution specifically for education Co-Branding or White Label Document & Face Verification Multi-Channel possible - for on-site or remote verification Trust through security and compliance Visit our Trust Center eIDAS / ZertES ISO 27001 Certified ISAE 3402 Type 2 KJM Approved Trust through security and compliance Customer reviews that convince \"We were fully convinced by the solution from PXL Vision. It has enabled us to streamline our processes and provide customers with flexible, secure access to our fleet.†Yannick von Ah Head of Customer Service, Mobility \"Working with PXL Vision has benefitted us and our customers on several levels . Today, we are able to onboard applicants effortlessly, providing them with the insurance they need, when they need it. We create value for them and for our company.\" Jonathan Valour Senior Product Manager, Groupe Mutuel \"The collaboration with PXL Vision was very good. The challenges were solved together and the system is now stable and efficient.†René Ottiger Product Manager Financial Services at SBB \"Because the process is browser-based and there is no need to download an additional application, as is the case with other providers, we achieve a very high conversion rate of 93 % .\" Alfonso Matas Product Manager and Product Owner, Digital Republic \"The integration of PXL Ident was quick and uncomplicated . Even with complex requirements, the cooperation was always very productive and solution-oriented. \" Metin Kabay Co-Founder, COO and CTO at drivemycar AG \"PXL Ident offers an extremely f ast and very smooth verification process for investors on our platform.\" Marc Rinderknecht Co-Managing Director and Product Owner at OOMNIUM \"As national digital identity providers, we rely on the highest possible standard in security and data protection for identity verification. PXL Vision allows us to have full control of the verification process and convey the trust we need for the SwissID.\" Markus Naef CEO at SwissSign AG \"As Well continues to grow, we are convinced that PXL Vision will help us scale and bring our eHealth platform to the masses. The frictionless verification process allows our users to get 24/7 access to online services from anywhere.\" Stephanie Künzli CPO at Well \"Gambling is a socially sensitive product. The player and youth protection must be ensured and implemented consistently. PXL Vision has convinced us immediately. \" Florian Hermann Director Marketing and Operations Novo Interactive \"Thanks to PXL Vision, we've done more than just simplify the identity verification process . We've also significantly raised our quality levels. That was precisely our goal.\" Fabian Baldinger Swiss Life Switzerland \"The flexibility of PXL Visions's platform has completely aligned with our need to provide a multitude of use cases tailored to various regulatory requirements and business preferences. We have built a mutually beneficial partnership and were always supported in any matter to the fullest extent.\" Roger Huber Project Lead Multichannel Management Zürcher Kantonalbank \"Across 17 platforms, Lemonfrog brings people together to exchange services. In PXL Vision we see a strategic partner who helps provide an environment where our users feel safe to interact in a trusted way. T he verification is quick, seamless and widely accepted among our user base . \" Tom Stierli CEO at Lemonfrog Customer reviews that convince \"We were fully convinced by the solution from PXL Vision. It has enabled us to streamline our processes and provide customers with flexible, secure access to our fleet.†\"Working with PXL Vision has benefitted us and our customers on several levels . Today, we are able to onboard applicants effortlessly, providing them with the insurance they need, when they need it. We create value for them and for our company.\" \"The collaboration with PXL Vision was very good. The challenges were solved together and the system is now stable and efficient.†\"Because the process is browser-based and there is no need to download an additional application, as is the case with other providers, we achieve a very high conversion rate of 93 % .\" \"The integration of PXL Ident was quick and uncomplicated . Even with complex requirements, the cooperation was always very productive and solution-oriented. \" \"PXL Ident offers an extremely f ast and very smooth verification process for investors on our platform.\" \"As national digital identity providers, we rely on the highest possible standard in security and data protection for identity verification. PXL Vision allows us to have full control of the verification process and convey the trust we need for the SwissID.\" \"As Well continues to grow, we are convinced that PXL Vision will help us scale and bring our eHealth platform to the masses. The frictionless verification process allows our users to get 24/7 access to online services from anywhere.\" \"Gambling is a socially sensitive product. The player and youth protection must be ensured and implemented consistently. PXL Vision has convinced us immediately. \" \"Thanks to PXL Vision, we've done more than just simplify the identity verification process . We've also significantly raised our quality levels. That was precisely our goal.\" \"The flexibility of PXL Visions's platform has completely aligned with our need to provide a multitude of use cases tailored to various regulatory requirements and business preferences. We have built a mutually beneficial partnership and were always supported in any matter to the fullest extent.\" \"Across 17 platforms, Lemonfrog brings people together to exchange services. In PXL Vision we see a strategic partner who helps provide an environment where our users feel safe to interact in a trusted way. T he verification is quick, seamless and widely accepted among our user base . \" Are you looking for a highly flexible identity verification solution? Our experts are eager to show you how we can help digitise and streamline your verification processes. Contact us Are you looking for a highly flexible identity verification solution? Our experts are eager to show you how we can help digitise and streamline your verification processes."
  ]
}