{
  "company": "www.smartvist.com",
  "dominant_topics": [
    2,
    1,
    0
  ],
  "topic_counts": {
    "2": 4,
    "1": 3,
    "0": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 8
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "1": 3,
      "2": 4
    }
  },
  "sample_docs": [
    "Products Technology About us Blog HOME PRODUCTS SOLUTIONS ABOUT US Smartvist Technology SmartVist is founded by a team of specialists inspired from the revolutionary advancements, especially after 2012, in the Computer Vision (CV) and Deep Learning (DL) areas. Team members are dedicated to focusing their extensive experience on the CV and DL domains. ​ ​ Thanks to the recent developments in Deep Learning Technologies, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. ​ We also believe that Deep Learning Technology has detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our SmartFace, Smartix and SmartStore products. With these products we aim to provide new solutions to the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas. ​ Innovation-Lab-for-Smart-City images (1) neural_networking solutions-video-solutions single_layer indir biz_computer_vision cv Your Questions and Feedbacks... Products Technology About us Blog HOME PRODUCTS SOLUTIONS ABOUT US Smartvist Technology SmartVist is founded by a team of specialists inspired from the revolutionary advancements, especially after 2012, in the Computer Vision (CV) and Deep Learning (DL) areas. Team members are dedicated to focusing their extensive experience on the CV and DL domains. ​ ​ Thanks to the recent developments in Deep Learning Technologies, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. ​ We also believe that Deep Learning Technology has detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our SmartFace, Smartix and SmartStore products. With these products we aim to provide new solutions to the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas. ​ Innovation-Lab-for-Smart-City images (1) neural_networking solutions-video-solutions single_layer indir biz_computer_vision cv Your Questions and Feedbacks... SmartVist is founded by a team of specialists inspired from the revolutionary advancements, especially after 2012, in the Computer Vision (CV) and Deep Learning (DL) areas. Team members are dedicated to focusing their extensive experience on the CV and DL domains. Thanks to the recent developments in Deep Learning Technologies, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. We also believe that Deep Learning Technology has detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our SmartFace, Smartix and SmartStore products. With these products we aim to provide new solutions to the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas. Your Questions and Feedbacks...",
    "HOME PRODUCTS SOLUTIONS ABOUT US SmartFace Person Identification via Facial Recognition System Local and Cloud Supported 98.5% accuracy with single reference face image Mobile supported face capture Smartix ​ Video and Photo Person Indexing System Identification via Facial Detection and Recognition Local and Cloud Supported Seconds Based Person Indexing in Videos Person Based Photo Clustering SmartStore ​ Retail in-Store Visitor Analytics System Anonymous Visitor Identification via Facial Recognition Gender and Age Prediction Recording of Anonymously Digitized Visitor Data In-Store Visitor Heat Map Anonymous Visitor Analytics HOME PRODUCTS SOLUTIONS ABOUT US SmartFace Person Identification via Facial Recognition System Local and Cloud Supported 98.5% accuracy with single reference face image Mobile supported face capture Smartix ​ Video and Photo Person Indexing System Identification via Facial Detection and Recognition Local and Cloud Supported Seconds Based Person Indexing in Videos Person Based Photo Clustering SmartStore ​ Retail in-Store Visitor Analytics System Anonymous Visitor Identification via Facial Recognition Gender and Age Prediction Recording of Anonymously Digitized Visitor Data In-Store Visitor Heat Map Anonymous Visitor Analytics Person Identification via Facial Recognition System Local and Cloud Supported 98.5% accuracy with single reference face image Mobile supported face capture Video and Photo Person Indexing System Identification via Facial Detection and Recognition Local and Cloud Supported Seconds Based Person Indexing in Videos Person Based Photo Clustering Retail in-Store Visitor Analytics System Anonymous Visitor Identification via Facial Recognition Gender and Age Prediction Recording of Anonymously Digitized Visitor Data In-Store Visitor Heat Map",
    "HOME PRODUCTS SOLUTIONS ABOUT US Smartvist Technology Smartvist is founded by a team of specialists inspired from the revolutionary advancements in the Computer Vision (CV) and Deep Learning (DL) areas especially after 2012. Team members are dedicated to focusing their extensive experience on the CV and DL domains. ​ ​ Thanks to the recent developments in DL technology, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. ​ As Smartvist, we do believe that DL technology provide us with detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our Smartface, Smartix and SmartStore products. With these products we aim to provide new solutions for the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas. image-net Detection_big neural_networking indir images (1) biz_computer_vision Innovation-Lab-for-Smart-City single_layer Soru ve deÄŸerlendirmeleriniz... HOME PRODUCTS SOLUTIONS ABOUT US Smartvist Technology Smartvist is founded by a team of specialists inspired from the revolutionary advancements in the Computer Vision (CV) and Deep Learning (DL) areas especially after 2012. Team members are dedicated to focusing their extensive experience on the CV and DL domains. ​ ​ Thanks to the recent developments in DL technology, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. ​ As Smartvist, we do believe that DL technology provide us with detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our Smartface, Smartix and SmartStore products. With these products we aim to provide new solutions for the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas. image-net Detection_big neural_networking indir images (1) biz_computer_vision Innovation-Lab-for-Smart-City single_layer Soru ve deÄŸerlendirmeleriniz... Smartvist is founded by a team of specialists inspired from the revolutionary advancements in the Computer Vision (CV) and Deep Learning (DL) areas especially after 2012. Team members are dedicated to focusing their extensive experience on the CV and DL domains. Thanks to the recent developments in DL technology, some recognition successes close to human skills have been achieved in certain areas. These kind of achievements show that the outcomes of academic and commercial studies carried out intensively all over the world in these areas, have a great potential to turn into some products used successfully in our daily lives in the near future. As Smartvist, we do believe that DL technology provide us with detection and recognition skills close to what we have as human beings. So using this cutting-edge technology, we have developed our Smartface, Smartix and SmartStore products. With these products we aim to provide new solutions for the security, media, smart store, smart city, transportation and healthcare areas together with our stakeholders working in these areas.",
    "HOME PRODUCTS SOLUTIONS ABOUT US SmartCity Target Place : Site, school, hospital, apartment ​ Target : To turn camera images into traceable, manageable form ​ ​ Benefits : ​ Safety warnings and share real-time on mobile Developing strategies to increase security and visitor satisfaction Density maps are used to digitize the most used areas based on time and number of visitors Generate intelligent analysis based on visitor behavioral images Plate Recognition Tripwire Motion Detection SmartStore ​ Target Place : Shopping & Business Centers, Shops ​ Target : Visitor behavior analysis ​ Benefits : ​ To graph the average service time of the services provided at payment, control and counseling points on a time basis To provide analytics for strategic decisions and operational efficiency enhancement Visualizing and visualizing the data, generating warnings and real-time monitoring ​Visualize visitor traffic, sales conversions and performance over time Present location-based density maps with time-based diagrams and graphs Customer Traffic Analysis Plate Recognition Lost property Face Detection Heat Map Employee Tracking Density Maps SmartSecure Target Place : Square, Airport and Stations ​ Target : Creating safe spaces ​ Benefits : ​ ​ Analyzing visitors, vehicles, products and behaviors with the information gathered from the sensors in the closest sensitivity in the virtual environment Produce intelligent analyzes based on visitor behavioral images, contribute to the correct presentation of operational and strategic decisions Field Violation Lost property Plate Tracking Intensity Map Face recognition People counting HOME PRODUCTS SOLUTIONS ABOUT US SmartCity Target Place : Site, school, hospital, apartment ​ Target : To turn camera images into traceable, manageable form ​ ​ Benefits : ​ Safety warnings and share real-time on mobile Developing strategies to increase security and visitor satisfaction Density maps are used to digitize the most used areas based on time and number of visitors Generate intelligent analysis based on visitor behavioral images Plate Recognition Tripwire Motion Detection SmartStore ​ Target Place : Shopping & Business Centers, Shops ​ Target : Visitor behavior analysis ​ Benefits : ​ To graph the average service time of the services provided at payment, control and counseling points on a time basis To provide analytics for strategic decisions and operational efficiency enhancement Visualizing and visualizing the data, generating warnings and real-time monitoring ​Visualize visitor traffic, sales conversions and performance over time Present location-based density maps with time-based diagrams and graphs Customer Traffic Analysis Plate Recognition Lost property Face Detection Heat Map Employee Tracking Density Maps SmartSecure Target Place : Square, Airport and Stations ​ Target : Creating safe spaces ​ Benefits : ​ ​ Analyzing visitors, vehicles, products and behaviors with the information gathered from the sensors in the closest sensitivity in the virtual environment Produce intelligent analyzes based on visitor behavioral images, contribute to the correct presentation of operational and strategic decisions Field Violation Lost property Plate Tracking Intensity Map Face recognition People counting Target Place : Site, school, hospital, apartment Target : To turn camera images into traceable, manageable form Safety warnings and share real-time on mobile Safety warnings and share real-time on mobile Developing strategies to increase security and visitor satisfaction Developing strategies to increase security and visitor satisfaction Density maps are used to digitize the most used areas based on time and number of visitors Density maps are used to digitize the most used areas based on time and number of visitors Generate intelligent analysis based on visitor behavioral images Generate intelligent analysis based on visitor behavioral images Target Place : Shopping & Business Centers, Shops Target : Visitor behavior analysis To graph the average service time of the services provided at payment, control and counseling points on a time basis To graph the average service time of the services provided at payment, control and counseling points on a time basis To provide analytics for strategic decisions and operational efficiency enhancement To provide analytics for strategic decisions and operational efficiency enhancement Visualizing and visualizing the data, generating warnings and real-time monitoring Visualizing and visualizing the data, generating warnings and real-time monitoring ​Visualize visitor traffic, sales conversions and performance over time ​Visualize visitor traffic, sales conversions and performance over time Present location-based density maps with time-based diagrams and graphs Present location-based density maps with time-based diagrams and graphs Target Place : Square, Airport and Stations Target : Creating safe spaces Analyzing visitors, vehicles, products and behaviors with the information gathered from the sensors in the closest sensitivity in the virtual environment Analyzing visitors, vehicles, products and behaviors with the information gathered from the sensors in the closest sensitivity in the virtual environment Produce intelligent analyzes based on visitor behavioral images, contribute to the correct presentation of operational and strategic decisions Produce intelligent analyzes based on visitor behavioral images, contribute to the correct presentation of operational and strategic decisions",
    "HOME PRODUCTS SOLUTIONS ABOUT US SmartFace SmartFace is a person identification system based on facial recognition developed by using deep learning technology. It is used to determine if unknown persons are among the people previously defined to the system . Face pictures are detected from the camera images and are transferred to the system in real time. Every transferred face picture is compared with the previously defined reference face pictures in the system. ​ A face picture with a high similarity to any reference face image is saved as a matching record into the system together with it's confidence level. ​ These matching records can be monitored via a web based application, and also real-time alerts can be sent from desired channels according to their confidence level. Alt Smartix ​ Smartix is a video/photo archive system used for classifying, identifying and indexing people appearing in media contents. It is based on a cutting-edge facial detection and recognition technology. ​ People are indexed according to the time intervals (in seconds) they appear in a video content. This provides direct access to scenes of the desired person at the indexed time intervals. In addition, all photos where desired people appear can be filtered and accessed directly from the system. ​ SmartStore SmartStore is a retail in-store visitor analytics system in which visitor information and behavior is anonymously stored, monitored, analyzed and visually reported. Visitor faces detected from in-store camera images are anonymously identified, digitized and recorded. This information is used for gender and age prediction and can be used to recognize the visitor on subsequent visits. ​ In-store location-based heat maps are also extracted from visitor tracking information. HOME PRODUCTS SOLUTIONS ABOUT US SmartFace SmartFace is a person identification system based on facial recognition developed by using deep learning technology. It is used to determine if unknown persons are among the people previously defined to the system . Face pictures are detected from the camera images and are transferred to the system in real time. Every transferred face picture is compared with the previously defined reference face pictures in the system. ​ A face picture with a high similarity to any reference face image is saved as a matching record into the system together with it's confidence level. ​ These matching records can be monitored via a web based application, and also real-time alerts can be sent from desired channels according to their confidence level. Alt Smartix ​ Smartix is a video/photo archive system used for classifying, identifying and indexing people appearing in media contents. It is based on a cutting-edge facial detection and recognition technology. ​ People are indexed according to the time intervals (in seconds) they appear in a video content. This provides direct access to scenes of the desired person at the indexed time intervals. In addition, all photos where desired people appear can be filtered and accessed directly from the system. ​ SmartStore SmartStore is a retail in-store visitor analytics system in which visitor information and behavior is anonymously stored, monitored, analyzed and visually reported. Visitor faces detected from in-store camera images are anonymously identified, digitized and recorded. This information is used for gender and age prediction and can be used to recognize the visitor on subsequent visits. ​ In-store location-based heat maps are also extracted from visitor tracking information. Face pictures are detected from the camera images and are transferred to the system in real time. Every transferred face picture is compared with the previously defined reference face pictures in the system. A face picture with a high similarity to any reference face image is saved as a matching record into the system together with it's confidence level. These matching records can be monitored via a web based application, and also real-time alerts can be sent from desired channels according to their confidence level. Smartix is a video/photo archive system used for classifying, identifying and indexing people appearing in media contents. It is based on a cutting-edge facial detection and recognition technology. People are indexed according to the time intervals (in seconds) they appear in a video content. This provides direct access to scenes of the desired person at the indexed time intervals. In addition, all photos where desired people appear can be filtered and accessed directly from the system. This information is used for gender and age prediction and can be used to recognize the visitor on subsequent visits. In-store location-based heat maps are also extracted from visitor tracking information."
  ]
}