{
  "company": "www.surrey.ac.uk",
  "dominant_topics": [
    1,
    -1,
    0
  ],
  "topic_counts": {
    "1": 125,
    "-1": 22,
    "0": 4
  },
  "topic_descriptions": {
    "1": "module, students, year, level, grade",
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.92548435171386,
    "framing_surveillance": 0.0715350223546944,
    "framing_market": 0.0029806259314456,
    "num_docs": 151
  },
  "topic_timeline": {
    "20": {
      "-1": 22,
      "0": 4,
      "1": 125
    }
  },
  "sample_docs": [
    "Welcome to Surrey For new, confirmed students starting in September 2015 For new, confirmed students starting in September 2015 Latest Freshers' videos from Stag TV What else do I need to know? In this video Sophie brings you all the other little bits of information that you may find useful to know in your first weeks at the University of Surrey. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2015 group Surrey Student page Latest Freshers' videos from Stag TV What else do I need to know? In this video Sophie brings you all the other little bits of information that you may find useful to know in your first weeks at the University of Surrey. Stay in the loop Surrey Freshers 2015 group Help and advice We hope that our Welcome website provides the answers to many of the questions you have as you begin life at the University of Surrey. However, if the website doesn't answer your questions, the Student Services Centre staff will be happy to help. If you have a question relating to the running of your programme, contact your Faculty Student Services Office. First check out our list of popular FAQs If that doesn't answer your question, once you have completed your online initial registration, the quickest way to get help is to submit a question online . If you have a question but you haven't registered yet, you can also get in touch by phone by calling +44 (0)1483 686868. Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website provides the answers to many of the questions you have as you begin life at the University of Surrey. However, if the website doesn't answer your questions, the Student Services Centre staff will be happy to help. If you have a question relating to the running of your programme, contact your Faculty Student Services Office. First check out our list of popular FAQs If that doesn't answer your question, once you have completed your online initial registration, the quickest way to get help is to submit a question online . If you have a question but you haven't registered yet, you can also get in touch by phone by calling +44 (0)1483 686868. Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Monday 12 October 2015 13:42:51 by ks0045 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Fri Oct 23 23:48:25 BST 2015 Content ID: 104477 Revision: 56 Community: 1024",
    "Welcome to Surrey For new, confirmed students starting in September 2016 For new, confirmed students starting in September 2016 Sorry, we need to know what type of course you'll be studying in order to find your timetable. Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2016 group Surrey Student page uniofsurrey @uniofsurrey Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Stay in the loop Surrey Freshers 2016 group Help and advice We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Monday 3 October 2016 15:41:09 by cd0027 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Tue Oct 25 20:52:51 BST 2016 Content ID: 104477 Revision: 72 Community: 1024",
    "Welcome to Surrey For new, confirmed students starting in September 2016 For new, confirmed students starting in September 2016 Featured Welcome Week Events Exhibition Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 12:00 to 16:00 PATS Field The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 10:00 to 18:00, 10:00 to 17:30 Surrey Sports Park Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 16:00 to 18:30 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Exhibition Volunteering Fayre Tuesday 4 Oct. 2016 16:00 to 18:30 Rubix, Students' Union Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Exhibition Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 11:00 to 15:00 PATS Playing Field Marquee The Autumn Careers & Placements Fair is the biggest event in the Employability and Careers Centre's year, offering an exciting opportunity for students to meet graduate employers and placement providers. . Featured Welcome Week Events Exhibition Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 12:00 to 16:00 PATS Field The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 10:00 to 18:00, 10:00 to 17:30 Surrey Sports Park Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 16:00 to 18:30 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Meet and greet event Freshers' Festival: Freshers' Fayre Friday 30 Sep. 2016 Friday 30 Sep. 2016 The Freshers' Fayre is your opportunity to discover a world of activities to get involved in outside of your studies. Hosted by the Students' Union, you'll find Sports Clubs and Societies to join, allowing you to expand on current interests or find new ones. You can also learn about our fulfilling volunteering opportunities or maybe plan a weekend away with our programme of day trips and short breaks. With plenty of freebies and giveaways from our commercial stands, the Freshers' Fayre is a great way to round off your first week - don't miss your chance to find out about all there is on offer during your time here at Surrey. Meet and greet event Freshers' Festival: Active Freshers' Fayre Saturday 1 Oct. 2016 Saturday 1 Oct. 2016 Don't miss out on two days of FREE sport at the Active Freshers' Fayre. Taking place at Surrey Sports Park , you'll get to meet our University sports clubs and get a taster of what it's like to be part of Team Surrey! There's no need to register or have a Sports Park membership – just turn up on the day. Student Enterprise Launch Party Tuesday 4 Oct. 2016 Tuesday 4 Oct. 2016 Student Enterprise Studio, between Santander and Unitemps Want to be your own boss? Start your own business whilst at uni? Learn practical business skills? Join us for our launch party to find out more! Exhibition Volunteering Fayre Tuesday 4 Oct. 2016 16:00 to 18:30 Rubix, Students' Union Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Exhibition Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 11:00 to 15:00 PATS Playing Field Marquee The Autumn Careers & Placements Fair is the biggest event in the Employability and Careers Centre's year, offering an exciting opportunity for students to meet graduate employers and placement providers. . Tuesday 4 Oct. 2016 Tuesday 4 Oct. 2016 Discover new skills and enhance your employability by spending your spare time volunteering for a worthy cause! Volunteering will not only help you add vital skills to your CV, you'll also meet new people and aid your personal development. To find out more, visit the Volunteering Fayre and speak to representatives from a wide range of local and national charities, Students' Union campaign charities, RAG and the Student Media team. However much time you have to give, there's an opportunity for everyone. Autumn Careers & Placements Fair Wednesday 12 Oct. 2016 Wednesday 12 Oct. 2016 PATS Playing Field Marquee Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Show me more Stay in the loop SurreyStudent Tweets by @SurreyStudent @SurreyUnion Surrey Freshers 2016 group Surrey Student page uniofsurrey @uniofsurrey Latest Freshers' videos from Stag TV Fresher's Specials: Places to Eat and Drink At some point whilst you are at the University of Surrey, you are probably going to want to have a drink and a bite to eat. In this video StagTV shows you all the places to eat and drink on campus, at Manor Park and at Surrey Sports Park. Stay in the loop Surrey Freshers 2016 group Help and advice We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. We hope that our Welcome website answers many of the questions you may have as you begin life at the University of Surrey. If you have any further queries, please check out our list of FAQs , for student support queries contact the Student Services Centre on +44 (0)1483 686868 or once you have completed your online initial registration submit a question online . If you have a question relating to the running of your programme, please contact your Faculty Student Services Office . Get to know your campus Download your Welcome Week campus map. Where we are University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Parking information Information for disabled visitors Campus map Virtual tour More contact details University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom T: +44 (0)1483 300800 F: +44 (0)1483 300800 Getting to the campus Finding your way round the campus Information for disabled visitors Accessibility | Contacting the University | Privacy | Cookies | Disclaimer | Freedom of Information © University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom. +44 (0)1483 300800 Page Owner: mf0009 Page Created: Tuesday 11 June 2013 15:29:53 by mf0009 Last Modified: Friday 30 September 2016 09:22:37 by cd0027 Expiry Date: Thursday 11 September 2014 15:29:09 Assembly date: Fri Sep 30 09:25:41 BST 2016 Content ID: 104477 Revision: 72 Community: 1024",
    "Welcome week What's on Fresher's Fayre Registration Welcome Week Timetables Dates for your diary Postgraduate Research in Arts and Human Sciences - Psychology With a busy week ahead, full of activities to look forward to, we have compiled a schedule to pull together everything happening each day that is relevant to you. The presentation, events and activities arranged for you this week will provide you with opportunities to: Register as a student at Surrey Meet students with whom you will be living and studying Meet your academic and support staff Find out vital information about the services and facilities at the University This is an important week. We hope that this schedule will provide you with the opportunities and information that will help you to make new friends, settle in and get the most out of study and life at Surrey. Make sure you don't miss out! This timetable is for students on the following programmes: If you have any questions about the programme or anything else during the week, please contact your Programme Administrator. Monday - Friday. 09:00 - 17:30 Staff at the Welcome Week Information Point may also be able to help. The Information Point can be found in the Student Services Centre. Tuesday 25 September 2012 All speakers of English as a second language are required to take short tests in writing, reading and grammar. The tests identify whether you have any difficulties in your use of English, so that we can offer you assistance through our English Language Support Programme. Wednesday 26 September 2012 Welcome from Associate Dean (PGR), Ask the PGR Director, PGR student testimonies: The challenge and rewards of doctoral study A chance to hear about services to support you and to meet and make friends. Thursday 27 September 2012 Don't forget – you must have pre-registered online before you arrive for University Registration. Please bring with you: The boarding pass that is created when you complete the online registration, either printed or on your smartphone Current photographic proof of identity (driving licence, passport, or national ID card). International students must bring their passport and a photocopy of the picture page and visa. If relevant, your ATAS certificate. If relevant, a copy of your LEA/Student Finance Direct financial assessment. Departmental Technician, Test Library Coordinator of the Postgraduate Demonstrating Programme Friday 28 September 2012 Research Development Team, Library General Induction, Hosted by the Students' Union, this is the biggest and most important part of any Surrey student's social introduction and a great way to round off your first week. Find out about Sports, Societies and Volunteering. MSc Environmental Psychology, Room 21 AC 03 MSc Forensic Psychology, Room 05 AC 03 MSc Health Psychology, Room 08 AC 03 MSc Occupational and Organisational Psychology, Room 19 AC 03 MSc Social Psychology, Room 04 DK 03 Monday 1 October 2012 Please refer to your teaching timetable which will be provided to you during the course of Welcome Week. Contacting the University | Freedom of Information | Page Owner: Penelope Rance, p.rance@surrey.ac.uk Page Created: Friday 8 April 2011 11:50:10 by Penelope Rance Last Modified: Thursday 16 August 2012 16:53:46 by Penelope Rance Expiry Date: Saturday 30 June 2012 10:55:47 Content ID: 53812 Revision: 5 Community: 1466",
    "Welcome week What's on Fresher's Fayre Registration Welcome Week Timetables Dates for your diary LLM Programmes: Postgraduate Taught Programmes With a busy week ahead, full of activities to look forward to, we have compiled a schedule to pull together everything happening each day that is relevant to you. The presentation, events and activities arranged for you this week will provide you with opportunities to: Register as a student at Surrey Meet students with whom you will be living and studying Meet your academic and support staff Find out vital information about the services and facilities at the University This is an important week. We hope that this schedule will provide you with the opportunities and information that will help you to make new friends, settle in and get the most out of study and life at Surrey. Make sure you don't miss out! This timetable is for students on the following programmes: LLM Law LLM International Commercial Law If you have any questions about the programme or anything else during the week, please contact your Programme Administrator. Student Support Office Helpdesk : T: +44 (0)1483 682124 School of Management, 34MS01 Monday to Thursday, 09:15 - 17:00 Friday, 09:15 - 16:45 Staff at the Welcome Week Information Point may also be able to help. The Information Point can be found in the Student Services Centre. Monday 24 September 2012 Introduction to the Programme, meet your Programme Administrator and your Programme Leader, get an overview over your studies and collect your Student Handbook. A briefing for Students on module options and opportunity to meet the teaching staff and ask questions about specific options. Information on pathways and how to choose options. Did you know you can study a language for free at the University of Surrey? Come along to this presentation to find out how languages can help you in your studies, professional training and future work. This presentation will open your eyes to the many opportunities in sport at the University of Surrey and our new world-class facilities. From memberships, coaching and volunteering, to classes, courses and details on the facilities at the new Surrey Sports Park. Tuesday 25 September 2012 Learn about our virtual learning environment. Whatever you are here to study, your Students' Union is here to support you and make your life easier. Come along, meet the President and other officers, and find out how they can help you to make the most of your time at Surrey. Wednesday 26 September 2012 Meet your law librarian and learn about our law library and our electronic data bases and search engines. Registration on your course Surnames beginning A-K from 12-1pm Surnames beginning L-Z from 1-2pm Don't forget – you must have pre-registered online before you arrive for University Registration. Please bring with you: The boarding pass that is created when you complete the online registration, either printed or on your smartphone. Current photographic proof of identity (driving licence, passport, or national ID card). International students must bring their passport and a photocopy of the picture page and visa. If relevant, your ATAS certificate. If relevant, a copy of your LEA/Student Finance Direct financial assessment. Last opportunity to submit your module option choice form. A chance to hear about services to support you and to meet and make friends. For international students only. Thursday 27 September 2012 Learn about Student care and wellbeing Services and how they can support you during your time at Surrey. Important regulations that you need to know about. All speakers of English as a second language are required to take short tests in writing, reading and grammar. The tests identify whether you have any difficulties in your use of English, so that we can offer you assistance through our English Language Support Programme. Friday 28 September 2012 A valuable opportunity to learn about the Careers Service. Hosted by the Students' Union, this is the biggest and most important part of any Surrey student's social introduction and a great way to round off your first week. Find out about Sports, Societies and Volunteering. Please refer to your teaching timetable which will be provided to you during the course of Welcome Week. Contacting the University | Freedom of Information | Page Owner: David Anderson, d.m.anderson@surrey.ac.uk Page Created: Friday 1 April 2011 15:53:22 by Penelope Rance Last Modified: Thursday 16 August 2012 16:22:22 by Penelope Rance Expiry Date: Saturday 30 June 2012 10:55:47 Content ID: 53136 Revision: 4 Community: 1466"
  ]
}