{
  "company": "www.1kosmos.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.2692307692307692,
    "framing_surveillance": 0.0,
    "framing_market": 0.7307692307692307,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "0": 4
    }
  },
  "sample_docs": [
    "The Business Challenge The Zero Trust security model views trust as a vulnerability and strives to re-establish trust in users and devices through authentication and continuous monitoring of each access attempt, with custom security policies that protect every application. Among the many elements of zero trust, verifying identity arguably lies at the core because while understanding what access is being requested, where the system is located, when the user needs access, and perhaps most fundamentally why, the access request starts with the login. When the login is secured to prevent unauthorized access, all that follows becomes more manageable. 1Kosmos BlockID Workforce takes a holistic approach to securing logins. At enrollment and depending on the needs of the business / roles, users can quickly and easily be identity-proofed at various levels of identity assertion. Their live biometric is scanned and matched to government, telecom, banking, and / or corporate credentials. From that point forward, authentication via their biometric matches a live biometric to the one captured at enrollment. This includes a liveness test to eliminate any attempt at facial spoofing. Ultimately, only the user via their biometric match has access and control of their access credentials, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. The BlockID Advantage Real Biometrics Next Gen MFA Biometric Login User biometrics are verified and matched to the identity proofed at enrollment each time, every time Our solutions support a TouchID, FaceID, or Live ID, which is essentially a short selfie video. This is matched to the image on a credential scanned at enrollment, for example, the photo on a driver's license or a passport, used to initially verify a likeness. Because our platform is FIDO2 and NIST 800-63-3 certified, it provides certified identity assurance level 2 (IAL2). We use real biometrics, not just the phone's interpretation. This means that any time LiveID is used, it is compared to the biometric captured during the enrollment process. We do this to verify that the biometric traits of an individual each time they request access matches the test performed during the enrollment process. This does not require any new hardware at the edge. LiveID binds the live selfie with a FIDO2 certified encrypted private-public key pair to form a next generation multi-factor authentication solution Our approach to privacy and security helps ensure anyone accessing systems or data is validated with strong FIDO2 authentication. Because biometric authentication is easy to use, every user and every access attempt can be verified with minimal friction. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform next generation multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element\". We provide certified authentication assurance level 2 (AAL2). Our solutions offer a high degree of interoperability via API / SDK and are easily integrated with just about any operating system, SSO gateway or web-enabled system, enabling organizations to go passwordless with flexible levels of identity assurance on any target system and eliminate the need for 3rd party 2FA, one-time codes, and other external authentication devices. Easy to use QR codes and support across mobile and desktop simplify passwordless access across systems Organizations pursuing a zero trust strategy need to eliminate passwords, and they need to achieve user adoption. The larger and more distributed the workforce, the harder the challenge. Users generally like biometric authentication because it's quick and easy. But, for many it's also new so we allow it to be phased in through the use of a QR code placed alongside the traditional user id and password on their login page. This provides a convenient option to using the QR and biometrics or the traditional way using their credentials. We support biometric authentication via our mobile app, without the app using our \"app-less authentication\" capability, and via the built-in FIDO-compliant capabilities of existing smartphones, laptops, and desktops. Go Passwordless in less than 7 days for 1,000 users. Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different di... 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users May 14, 2021 USE CASES Workforce Employee Onboarding Next Generation MFA Passwordless Enterprise Physical and Logical Access Remote Workforce Single Sign On Zero Trust Customer Customer Onboarding / KYC GDPR Compliance Next Generation MFA Passwordless Authentication Portable Customer Identity Strong Customer Authentication/PSD2 Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management On December 9, 2021 a flaw was publicly disclosed in Apache's Log4j 2, a logging utility used by Java applications. Named Log4Shell (CVE-2021-44228), the vulnerability can be used by attackers to t... What You Need to Know about Log4Shell (CVE-2021-44228) December 20, 2021 Datasheet Our Advantage The 1Kosmos SIM Binding Advantage 1Kosmos BlockID delivers identity-based passwordless access to any business system to ensure that only authorized individuals access data or ... SIM Binding Identity Management Comparing federated identity management and SSO can be tricky if you don't fully understand federation or identity and access management. We're walking through both to help you compare. What is ... Federated Identity Management vs. SSO: Which is Better? December 16, 2021 Ready to go Passwordless? Indisputable identity-proofing, advanced biometrics-powered passwordless authentication and fraud detection in a single application. Get Started Now Experience BlockID Among the many elements of zero trust, verifying identity arguably lies at the core because while understanding what access is being requested, where the system is located, when the user needs access, and perhaps most fundamentally why, the access request starts with the login. When the login is secured to prevent unauthorized access, all that follows becomes more manageable. 1Kosmos BlockID Workforce takes a holistic approach to securing logins. At enrollment and depending on the needs of the business / roles, users can quickly and easily be identity-proofed at various levels of identity assertion. Their live biometric is scanned and matched to government, telecom, banking, and / or corporate credentials. From that point forward, authentication via their biometric matches a live biometric to the one captured at enrollment. This includes a liveness test to eliminate any attempt at facial spoofing. Ultimately, only the user via their biometric match has access and control of their access credentials, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. Our solutions support a TouchID, FaceID, or Live ID, which is essentially a short selfie video. This is matched to the image on a credential scanned at enrollment, for example, the photo on a driver's license or a passport, used to initially verify a likeness. Because our platform is FIDO2 and NIST 800-63-3 certified, it provides certified identity assurance level 2 (IAL2). We use real biometrics, not just the phone's interpretation. This means that any time LiveID is used, it is compared to the biometric captured during the enrollment process. We do this to verify that the biometric traits of an individual each time they request access matches the test performed during the enrollment process. This does not require any new hardware at the edge. Our approach to privacy and security helps ensure anyone accessing systems or data is validated with strong FIDO2 authentication. Because biometric authentication is easy to use, every user and every access attempt can be verified with minimal friction. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform next generation multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element\". We provide certified authentication assurance level 2 (AAL2). Our solutions offer a high degree of interoperability via API / SDK and are easily integrated with just about any operating system, SSO gateway or web-enabled system, enabling organizations to go passwordless with flexible levels of identity assurance on any target system and eliminate the need for 3rd party 2FA, one-time codes, and other external authentication devices. Organizations pursuing a zero trust strategy need to eliminate passwords, and they need to achieve user adoption. The larger and more distributed the workforce, the harder the challenge. Users generally like biometric authentication because it's quick and easy. But, for many it's also new so we allow it to be phased in through the use of a QR code placed alongside the traditional user id and password on their login page. This provides a convenient option to using the QR and biometrics or the traditional way using their credentials. We support biometric authentication via our mobile app, without the app using our \"app-less authentication\" capability, and via the built-in FIDO-compliant capabilities of existing smartphones, laptops, and desktops. Go Passwordless in less than 7 days for 1,000 users. Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different di... 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users May 14, 2021 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users Physical and Logical Access Customer Onboarding / KYC Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management On December 9, 2021 a flaw was publicly disclosed in Apache's Log4j 2, a logging utility used by Java applications. Named Log4Shell (CVE-2021-44228), the vulnerability can be used by attackers to t... What You Need to Know about Log4Shell (CVE-2021-44228) December 20, 2021 What You Need to Know about Log4Shell (CVE-2021-44228) Datasheet Our Advantage The 1Kosmos SIM Binding Advantage 1Kosmos BlockID delivers identity-based passwordless access to any business system to ensure that only authorized individuals access data or ... SIM Binding Identity Management Comparing federated identity management and SSO can be tricky if you don't fully understand federation or identity and access management. We're walking through both to help you compare. What is ... Federated Identity Management vs. SSO: Which is Better? December 16, 2021 Federated Identity Management vs. SSO: Which is Better? Ready to go Passwordless? Indisputable identity-proofing, advanced biometrics-powered passwordless authentication and fraud detection in a single application.",
    "The Business Challenge The Zero Trust security model views trust as a vulnerability and strives to re-establish trust in users and devices through authentication and continuous monitoring of each access attempt, with custom security policies that protect every application. Among the many elements of zero trust, verifying identity arguably lies at the core because while understanding what access is being requested, where the system is located, when the user needs access, and perhaps most fundamentally why, the access request starts with the login. When the login is secured to prevent unauthorized access, all that follows becomes more manageable. 1Kosmos BlockID Workforce takes a holistic approach to securing logins. At enrollment and depending on the needs of the business / roles, users can quickly and easily be identity-proofed at various levels of identity assertion. Their live biometric is scanned and matched to government, telecom, banking, and / or corporate credentials. From that point forward, authentication via their biometric matches a live biometric to the one captured at enrollment. This includes a liveness test to eliminate any attempt at facial spoofing. Ultimately, only the user via their biometric match has access and control of their access credentials, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. The BlockID Advantage Real Biometrics Next Gen MFA Biometric Login User biometrics are verified and matched to the identity proofed at enrollment each time, every time Our solutions support a TouchID, FaceID, or Live ID, which is essentially a short selfie video. This is matched to the image on a credential scanned at enrollment, for example, the photo on a driver's license or a passport, used to initially verify a likeness. Because our platform is FIDO2 and NIST 800-63-3 certified, it provides certified identity assurance level 2 (IAL2). We use real biometrics, not just the phone's interpretation. This means that any time LiveID is used, it is compared to the biometric captured during the enrollment process. We do this to verify that the biometric traits of an individual each time they request access matches the test performed during the enrollment process. This does not require any new hardware at the edge. LiveID binds the live selfie with a FIDO2 certified encrypted private-public key pair to form a next generation multi-factor authentication solution Our approach to privacy and security helps ensure anyone accessing systems or data is validated with strong FIDO2 authentication. Because biometric authentication is easy to use, every user and every access attempt can be verified with minimal friction. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform next generation multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element\". We provide certified authentication assurance level 2 (AAL2). Our solutions offer a high degree of interoperability via API / SDK and are easily integrated with just about any operating system, SSO gateway or web-enabled system, enabling organizations to go passwordless with flexible levels of identity assurance on any target system and eliminate the need for 3rd party 2FA, one-time codes, and other external authentication devices. Easy to use QR codes and support across mobile and desktop simplify passwordless access across systems Organizations pursuing a zero trust strategy need to eliminate passwords, and they need to achieve user adoption. The larger and more distributed the workforce, the harder the challenge. Users generally like biometric authentication because it's quick and easy. But, for many it's also new so we allow it to be phased in through the use of a QR code placed alongside the traditional user id and password on their login page. This provides a convenient option to using the QR and biometrics or the traditional way using their credentials. We support biometric authentication via our mobile app, without the app using our \"app-less authentication\" capability, and via the built-in FIDO-compliant capabilities of existing smartphones, laptops, and desktops. Go Passwordless in less than 7 days for 1,000 users. Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different di... 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users May 14, 2021 USE CASES Workforce Employee Onboarding Next Generation MFA Passwordless Enterprise Physical and Logical Access Remote Workforce Single Sign On Zero Trust Customer Customer Onboarding / KYC GDPR Compliance Next Generation MFA Passwordless Authentication Portable Customer Identity Strong Customer Authentication/PSD2 Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management Trusting no one and verifying everyone is a security measure businesses may not think to take, but this measure becomes the main gatekeeper with zero-trust identity. What is a zero-trust approac... Zero-Trust Identity: Benefits, Implementation & Management November 10, 2021 Identity Management Dealing with complexity Issues with passwords are well documented and education institutions are not immune to the issues and risks that passwords inject. To compound the security issue, these ins... Identity is Shaping the Modern Campus November 8, 2021 Authentication Michael: Good morning, Javed Shah, vice president of product management. Welcome to the 1Kosmos vlog. How are you this morning? Javed: Morning, Michael. I'm doing great. Thank you for having m... How to Onboard a Third-Party with Identity-Based Authentication November 4, 2021 Ready to go Passwordless? Indisputable identity-proofing, advanced biometrics-powered passwordless authentication and fraud detection in a single application. Get Started Now Experience BlockID Among the many elements of zero trust, verifying identity arguably lies at the core because while understanding what access is being requested, where the system is located, when the user needs access, and perhaps most fundamentally why, the access request starts with the login. When the login is secured to prevent unauthorized access, all that follows becomes more manageable. 1Kosmos BlockID Workforce takes a holistic approach to securing logins. At enrollment and depending on the needs of the business / roles, users can quickly and easily be identity-proofed at various levels of identity assertion. Their live biometric is scanned and matched to government, telecom, banking, and / or corporate credentials. From that point forward, authentication via their biometric matches a live biometric to the one captured at enrollment. This includes a liveness test to eliminate any attempt at facial spoofing. Ultimately, only the user via their biometric match has access and control of their access credentials, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. Our solutions support a TouchID, FaceID, or Live ID, which is essentially a short selfie video. This is matched to the image on a credential scanned at enrollment, for example, the photo on a driver's license or a passport, used to initially verify a likeness. Because our platform is FIDO2 and NIST 800-63-3 certified, it provides certified identity assurance level 2 (IAL2). We use real biometrics, not just the phone's interpretation. This means that any time LiveID is used, it is compared to the biometric captured during the enrollment process. We do this to verify that the biometric traits of an individual each time they request access matches the test performed during the enrollment process. This does not require any new hardware at the edge. Our approach to privacy and security helps ensure anyone accessing systems or data is validated with strong FIDO2 authentication. Because biometric authentication is easy to use, every user and every access attempt can be verified with minimal friction. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform next generation multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element\". We provide certified authentication assurance level 2 (AAL2). Our solutions offer a high degree of interoperability via API / SDK and are easily integrated with just about any operating system, SSO gateway or web-enabled system, enabling organizations to go passwordless with flexible levels of identity assurance on any target system and eliminate the need for 3rd party 2FA, one-time codes, and other external authentication devices. Organizations pursuing a zero trust strategy need to eliminate passwords, and they need to achieve user adoption. The larger and more distributed the workforce, the harder the challenge. Users generally like biometric authentication because it's quick and easy. But, for many it's also new so we allow it to be phased in through the use of a QR code placed alongside the traditional user id and password on their login page. This provides a convenient option to using the QR and biometrics or the traditional way using their credentials. We support biometric authentication via our mobile app, without the app using our \"app-less authentication\" capability, and via the built-in FIDO-compliant capabilities of existing smartphones, laptops, and desktops. Go Passwordless in less than 7 days for 1,000 users. Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different di... 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users May 14, 2021 1Kosmos BlockID's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users Physical and Logical Access Customer Onboarding / KYC Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management Trusting no one and verifying everyone is a security measure businesses may not think to take, but this measure becomes the main gatekeeper with zero-trust identity. What is a zero-trust approac... Zero-Trust Identity: Benefits, Implementation & Management November 10, 2021 Zero-Trust Identity: Benefits, Implementation & Management Identity Management Dealing with complexity Issues with passwords are well documented and education institutions are not immune to the issues and risks that passwords inject. To compound the security issue, these ins... Identity is Shaping the Modern Campus November 8, 2021 Identity is Shaping the Modern Campus Authentication Michael: Good morning, Javed Shah, vice president of product management. Welcome to the 1Kosmos vlog. How are you this morning? Javed: Morning, Michael. I'm doing great. Thank you for having m... How to Onboard a Third-Party with Identity-Based Authentication November 4, 2021 How to Onboard a Third-Party with Identity-Based Authentication Ready to go Passwordless? Indisputable identity-proofing, advanced biometrics-powered passwordless authentication and fraud detection in a single application.",
    "The Business Challenge Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While understanding what, where, and potentially why a user needs access, doing so without verifying an identity defeats zero trust principles. All that follows becomes more manageable when the login is secured to prevent unauthorized access. At enrollment and depending on the needs of the business/roles, 1Kosmos Workforce quickly and easily identity-proofs users at various levels of identity assurance. From that point forward, zero trust authentication takes place through biometric matches via a live biometric to the one captured at enrollment. Ultimately, the user becomes the authenticator, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. Whitepapers COVID-19 changed many aspects of our lives—including how and where we work. With the dramatic rise in remote work, previous IT security default options, like using a virtual private network (VPN), ... Zero Trust The 1Kosmos Advantage Identity Based Authentication Biometrics Trusted Authentication Deployment Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... Multi-Factor Authentication Deliver High Assurance of Authenticated Users 1Kosmos is at the forefront of Zero Trust authentication , providing a seamless and secure user experience. Our platform ensures that individuals are who they claim to be by using an identity-based authentication approach, aligning with Zero Trust security's core principles. Through our identity based Zero Trust approach, real biometrics, cryptographic proof of possession, and audit, we provide a secure and user-friendly authentication experience. 1Kosmos is committed to establishing user-controlled identity and proving authentication with previously established identity, making it a leading solution for organizations looking to implement Zero Trust security measures. Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos LiveID Deploy Unrivalled Biometric Authentication FIDO2, NIST 800-63-3, and ISO certifications provide the highest level of digital biometric identity and authentication assurance with superior interoperability. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element.\" Because our platform is certified, it provides certified identity assurance level 2 (IAL2) and certified authentication assurance level 2 (AAL2) and offers a high degree of interoperability via a robust API and SDK. Solution Briefs Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos Authenticators Authenticate with Verified Identity Facial spoofing, whether through a photo, video, or mask, poses a formidable challenge to remote identity verification. To combat this, 1Kosmos presents LiveID , an innovative solution with architectural prowess. Certified to NIST 800-63-3, FIDO2, ISO/IEC 30107-1, and ISO/IEC 30107-3 specifications, LiveID delivers Identity Assertion Level 2 verification. 1Kosmos LiveID is not just a short selfie video; it's a real biometric breakthrough that demands facial movements, providing an architectural advantage Our platform provides tamper evident, and trustworthy digital identity verification and more. by adding an extra layer of security. This randomized element ensures that the captured facial features are genuine and not easily replicated. Unlike mere interpretations of facial features by phones, LiveID leverages this architectural advantage to guarantee authenticity by consistently comparing the biometric data captured during the enrollment process each time it is used. Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos Identity Proofing Deploy What You Need, When You Need It Modernizing identity verification for the rapid onboarding of new employees is essential as more organizations move to a remote or hybrid hiring model. 1Kosmos offers self-service identity verification that accommodates government-issued credentials in 150 countries with over 99% accuracy. Additionally, self-service document verification automates workflow and alleviates administrative overhead. Our platform also supports agent-assisted verification if required. Verified users are bound to their account through a biometric with a liveness check to ensure the enrolled user is the user requesting passwordless access. As a cloud-based identity provider, 1Kosmos comes with several exciting administration features. The administration portal provides easy access to the configuration and management of the platform. Starting with over 50 out-of-the-box integrations and a robust API framework enabling quick and easy integrations into common technologies, including Microsoft Entra ID , Ping , Okta , and more. Alternatively, by implementing our mobile SDK/API, you can securely integrate all functionality into your existing app or service. This approach eliminates silos created when managing multiple apps and services. Contact Us For More Information! Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different digi... 1Kosmos's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users Maureen Trigsted May 14, 2021 Workforce Customer Citizen Industry Use Cases 1Kosmos for Worker Access Worker Onboarding Frontline Worker Access Passwordless Enterprise Identity Verification Use Cases 1Kosmos for Customer Access Know Your Customer User Managed Privacy Customer Authentication Identity Wallet Use Cases 1Kosmos for Citizen Access Trust as a Service Identity Verification Citizen Authentication Use Cases 1Kosmos by Industry Financial Services Government Healthcare Insurance Manufacturing Retail Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management On the cusp of our series B funding, and as I look ahead to many big and bright developments for our company and for Identity and Access Management at large, I can't help but look back at the visio... How 1Kosmos Became the Reference Architecture for Modern Digital Identity Rohan Pinto August 13, 2025 Identity Management When a company's own founders and team members dig deeper into their pockets to invest more of their personal money, you know something big is happening. That's exactly what just occurred at 1Kosmo... Founders and Team Members Are Investing Their Own Personal Capital in the Series B - We're Backing Our Vision! Hemen Vimadalal August 12, 2025 On-Demand Webinars Federal agencies and highly regulated organizations handling sensitive data require cloud security that goes beyond the basics. FedRAMP High authorization is now the benchmark, providing stronger p... Why FedRAMP High Is the New Standard for Secure Digital Identity Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While understanding what, where, and potentially why a user needs access, doing so without verifying an identity defeats zero trust principles. All that follows becomes more manageable when the login is secured to prevent unauthorized access. At enrollment and depending on the needs of the business/roles, 1Kosmos Workforce quickly and easily identity-proofs users at various levels of identity assurance. From that point forward, zero trust authentication takes place through biometric matches via a live biometric to the one captured at enrollment. Ultimately, the user becomes the authenticator, eliminating passwords and user stores to minimize threats from email phishing, insider account takeover, and password-based brute force attacks. Whitepapers COVID-19 changed many aspects of our lives—including how and where we work. With the dramatic rise in remote work, previous IT security default options, like using a virtual private network (VPN), ... Zero Trust Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... Multi-Factor Authentication 1Kosmos is at the forefront of Zero Trust authentication , providing a seamless and secure user experience. Our platform ensures that individuals are who they claim to be by using an identity-based authentication approach, aligning with Zero Trust security's core principles. Through our identity based Zero Trust approach, real biometrics, cryptographic proof of possession, and audit, we provide a secure and user-friendly authentication experience. 1Kosmos is committed to establishing user-controlled identity and proving authentication with previously established identity, making it a leading solution for organizations looking to implement Zero Trust security measures. Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos LiveID FIDO2, NIST 800-63-3, and ISO certifications provide the highest level of digital biometric identity and authentication assurance with superior interoperability. We use the Trusted Platform Module / Secure Enclave of a device (what you have) and a live biometric (what you are) to perform multi-factor authentication. In terminology familiar for Strong Customer Authentication, the device becomes the \"possession element\" and the biometric the \"inherence element.\" Because our platform is certified, it provides certified identity assurance level 2 (IAL2) and certified authentication assurance level 2 (AAL2) and offers a high degree of interoperability via a robust API and SDK. Solution Briefs Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos Authenticators Facial spoofing, whether through a photo, video, or mask, poses a formidable challenge to remote identity verification. To combat this, 1Kosmos presents LiveID , an innovative solution with architectural prowess. Certified to NIST 800-63-3, FIDO2, ISO/IEC 30107-1, and ISO/IEC 30107-3 specifications, LiveID delivers Identity Assertion Level 2 verification. 1Kosmos LiveID is not just a short selfie video; it's a real biometric breakthrough that demands facial movements, providing an architectural advantage Our platform provides tamper evident, and trustworthy digital identity verification and more. by adding an extra layer of security. This randomized element ensures that the captured facial features are genuine and not easily replicated. Unlike mere interpretations of facial features by phones, LiveID leverages this architectural advantage to guarantee authenticity by consistently comparing the biometric data captured during the enrollment process each time it is used. Datasheets Among the many elements of zero trust, verifying identity arguably lies at the core. Why? Because all logins start with identity. While ... 1Kosmos Identity Proofing Modernizing identity verification for the rapid onboarding of new employees is essential as more organizations move to a remote or hybrid hiring model. 1Kosmos offers self-service identity verification that accommodates government-issued credentials in 150 countries with over 99% accuracy. Additionally, self-service document verification automates workflow and alleviates administrative overhead. Our platform also supports agent-assisted verification if required. Verified users are bound to their account through a biometric with a liveness check to ensure the enrolled user is the user requesting passwordless access. As a cloud-based identity provider, 1Kosmos comes with several exciting administration features. The administration portal provides easy access to the configuration and management of the platform. Starting with over 50 out-of-the-box integrations and a robust API framework enabling quick and easy integrations into common technologies, including Microsoft Entra ID , Ping , Okta , and more. Alternatively, by implementing our mobile SDK/API, you can securely integrate all functionality into your existing app or service. This approach eliminates silos created when managing multiple apps and services. Contact Us For More Information! Identity Management The Challenge of Identity Management Identity management has been a challenge for individuals and organizations for years, especially in the digital world. One individual may have a different digi... 1Kosmos's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users Maureen Trigsted May 14, 2021 1Kosmos's NIST 800-63-3 Conformant & FIDO2 Certification Enhances Security with Fully Proofed Users 1Kosmos for Worker Access 1Kosmos for Customer Access 1Kosmos for Citizen Access Trust as a Service Insights Learn how Indisputable Digital Identities are Created with Biometrics and a Blockchain Identity Management On the cusp of our series B funding, and as I look ahead to many big and bright developments for our company and for Identity and Access Management at large, I can't help but look back at the visio... How 1Kosmos Became the Reference Architecture for Modern Digital Identity Rohan Pinto August 13, 2025 How 1Kosmos Became the Reference Architecture for Modern Digital Identity Identity Management When a company's own founders and team members dig deeper into their pockets to invest more of their personal money, you know something big is happening. That's exactly what just occurred at 1Kosmo... Founders and Team Members Are Investing Their Own Personal Capital in the Series B - We're Backing Our Vision! Hemen Vimadalal August 12, 2025 Founders and Team Members Are Investing Their Own Personal Capital in the Series B - We're Backing Our Vision! On-Demand Webinars Federal agencies and highly regulated organizations handling sensitive data require cloud security that goes beyond the basics. FedRAMP High authorization is now the benchmark, providing stronger p... Why FedRAMP High Is the New Standard for Secure Digital Identity Why FedRAMP High Is the New Standard for Secure Digital Identity",
    "\"The 1Kosmos team has been nothing short of transparent and resourceful, while continuously delivering as a valued partner.\" - SR Manager Cyber Security & IAM - Retail \"The 1Kosmos platform enables any organization to confidently validate a user's identity, while streamlining authentication into systems and applications.\" - SR Manager Cyber Security & IAM - Retail \"The team is very willing to help troubleshoot. The product is reliable. They have made improvements to the system based off our recommendations.\" - Human Resources Associate - Software Powerful Solutions Strong Verified Identity and a Secure Digital Wallet for High Assurance Trust For Workers Eliminate passwords and integrate workforce identity verification into account provisioning and credential recovery. For Customers Instantly verify customer identity anywhere, anytime and give returning customers a multi-purpose digital wallet. For Citizens Provide citizens a verified portable digital identity they control and can use to prevent fraud and gain access to government services. FedRAMP High Authorized Why 1Kosmos The 1Kosmos Difference One Unified Platform A distributed identity cloud service that unifies identity verification and passwordless authentication. Frictionless User Experience Simple user onboarding and convenient access anywhere, anytime and on any device. Privacy & Consent Users maintain complete control over their personal data, and decide when to share, and with whom. Developer Friendly Developer-friendly SDK, APIs and over 50 out of the box integrations allow for an easy deployment. Real Biometrics (LiveID) Advanced biometric authentication eliminates spoofing and verifies users with over 99% accuracy. Compliance, Standards and Certifications Certified to NIST 800.63.3, UK-DIATF, FIDO2, ISO/IEC 30107-1 and 30107-3, ISO 27001 and SOC II Type 2. GDPR compliant. Explore Platform Capabilities Why Fortune 500 Enterprises Choose 1Kosmos Workforce Customer Citizen Industry Use Cases 1Kosmos for Worker Access Worker Onboarding Frontline Worker Access Passwordless Enterprise Identity Verification Use Cases 1Kosmos for Customer Access Know Your Customer User Managed Privacy Customer Authentication Identity Wallet Use Cases 1Kosmos for Citizen Access Trust as a Service Identity Verification Citizen Authentication Use Cases 1Kosmos by Industry Financial Services Government Healthcare Insurance Manufacturing Retail 1Kosmos Integrates with a Wide Range of Systems and Applications Explore all Integrations Insights The Architectural Advantage: Real Biometrics and a Private, Permissioned Blockchain Videos Modernizing Identity at Scale: VF Corporation's IAM Journey with Bashira Baset Identity Management Hiring fraud is in the news. Google recently announced it's bringing back in-person job interviews, citing concerns about AI cheating during technical assessments. But there's a bigger issue lurkin... Addressing AI-Enabled Hiring Fraud: The Remote Work Identity Challenge Erica West August 28, 2025 Solution Briefs Contact Center Security Challenges Client contractual security requirements: Highly regulated industries like banking, financial services, healthcare, and insurance increasingly require dedica... The Secure Choice for Contact Centers Identity Management As campuses gear up for another academic year, a quieter — but equally damaging — threat is draining university budgets: direct deposit fraud. This isn't ransomware that makes headlines by shutt... The Silent Payroll Heist Hitting Universities Ashwin Achar August 26, 2025 Identity Management We're proud to share that 1Kosmos has been recognized in the 2025 Gartner Magic Quadrant as a Challenger and for Identity Verification (IDV) — and we've earned the #1 Product Score for Workforce ba... 1Kosmos Ranked #1 in Workforce Product Score by Gartner Huzefa Olia August 25, 2025 Blockchain The Early Days: A Security Obsession I've always been a security geek. Back before Information Security was a thing, I was figuring out ways to get into systems or keep people out. This goes all t... From CISO to Startup Founder: The 1Kosmos Journey Mike Engle August 25, 2025 On-Demand Webinars What happens when one of the world's top ethical hackers takes on the defenses of a modern enterprise? In this live, eye-opening session, renowned social engineer Rachel Tobac exposes how AI-as... Fireside Chat and Live Hacking Demo: How I Would Hack you Live with AI Identity Management Identity has become one of the most vulnerable parts of the digital world. Every week, we see headlines about new attacks: deepfakes tricking people into wiring money, social engineering scams bypa... A New Approach to Identity Huzefa Olia August 21, 2025 Explore the Blog Authentication Biometric Authentication Blockchain Identity Management Experience the Power of Strong Identity With strong identity, business runs more smoothly with less risk of fraud and disruption from cyber incidents. Let 1Kosmos show you how. Book a demo or watch 1Kosmos in action today! Book Demo Watch Demo Strong Verified Identity and a Secure Digital Wallet for High Assurance Trust Compliance, Standards and Certifications Why Fortune 500 Enterprises Choose 1Kosmos 1Kosmos for Worker Access 1Kosmos for Customer Access 1Kosmos for Citizen Access Trust as a Service 1Kosmos Integrates with a Wide Range of Systems and Applications Insights The Architectural Advantage: Real Biometrics and a Private, Permissioned Blockchain Videos Modernizing Identity at Scale: VF Corporation's IAM Journey with Bashira Baset Modernizing Identity at Scale: VF Corporation's IAM Journey with Bashira Baset Identity Management Hiring fraud is in the news. Google recently announced it's bringing back in-person job interviews, citing concerns about AI cheating during technical assessments. But there's a bigger issue lurkin... Addressing AI-Enabled Hiring Fraud: The Remote Work Identity Challenge Erica West August 28, 2025 Addressing AI-Enabled Hiring Fraud: The Remote Work Identity Challenge Solution Briefs Contact Center Security Challenges Client contractual security requirements: Highly regulated industries like banking, financial services, healthcare, and insurance increasingly require dedica... The Secure Choice for Contact Centers The Secure Choice for Contact Centers Identity Management As campuses gear up for another academic year, a quieter — but equally damaging — threat is draining university budgets: direct deposit fraud. This isn't ransomware that makes headlines by shutt... The Silent Payroll Heist Hitting Universities Ashwin Achar August 26, 2025 The Silent Payroll Heist Hitting Universities Identity Management We're proud to share that 1Kosmos has been recognized in the 2025 Gartner Magic Quadrant as a Challenger and for Identity Verification (IDV) — and we've earned the #1 Product Score for Workforce ba... 1Kosmos Ranked #1 in Workforce Product Score by Gartner Huzefa Olia August 25, 2025 1Kosmos Ranked #1 in Workforce Product Score by Gartner Blockchain The Early Days: A Security Obsession I've always been a security geek. Back before Information Security was a thing, I was figuring out ways to get into systems or keep people out. This goes all t... From CISO to Startup Founder: The 1Kosmos Journey Mike Engle August 25, 2025 From CISO to Startup Founder: The 1Kosmos Journey On-Demand Webinars What happens when one of the world's top ethical hackers takes on the defenses of a modern enterprise? In this live, eye-opening session, renowned social engineer Rachel Tobac exposes how AI-as... Fireside Chat and Live Hacking Demo: How I Would Hack you Live with AI Fireside Chat and Live Hacking Demo: How I Would Hack you Live with AI Identity Management Identity has become one of the most vulnerable parts of the digital world. Every week, we see headlines about new attacks: deepfakes tricking people into wiring money, social engineering scams bypa... A New Approach to Identity Huzefa Olia August 21, 2025 A New Approach to Identity Experience the Power of Strong Identity"
  ]
}