{
  "company": "www.indivd.com",
  "dominant_topics": [
    0,
    2,
    6
  ],
  "topic_counts": {
    "0": 24,
    "2": 5,
    "6": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "2": "demand, cctv, camera, ca, verkada",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.6304849884526559,
    "framing_surveillance": 0.0046189376443418,
    "framing_market": 0.3648960739030023,
    "num_docs": 30
  },
  "topic_timeline": {
    "20": {
      "0": 24,
      "2": 5,
      "6": 1
    }
  },
  "sample_docs": [
    "Why Indivd Stores and malls must adapt to the new digital reality We work, we sleep and we shop to live. Exchanging goods and services has always been a natural way to survive and exist. Physical retail will continue to be an important part of our lives in the future, even though e-commerce has taken over an increasing part. But physical retail must adapt to the new and disruptive reality in order to be profitable and to continue to be appreciated. Stores and malls must, just like e-commerce, begin to use data and insights to better understand its visitors and thereby be able to offer more attractive meeting places. But the solutions to get there must simultaneously safeguard data protection and privacy. Today's and future customers demand sustainable retail based on privacy-friendly technology (Data Protection by Design), where privacy has the highest priority. No one will succeed without having created a balance between data and integrity. No one escapes the future. Digitalization is the future. Digitalization is here to stay. Digitalization contributes to creating more efficient, profitable and more sustainable companies. Access to data and new technology, increases the digital innovation, improves governance and supports employees to create better strategies. Studies also show that companies that have come a long way in their digitalization surpass their competitors in all forms of financial performance. Reduce information-intensive costs by up to 90% Increase the understanding of process performance Help you become proactive and act before problems arise Profitable strategies are based on customer- and business data Stores and malls are poorly equipped for the digital society, which is now growing at an ever faster pace. They need to sharpen their strategies and improve their governance by making greater use of customer and business data and more data-driven decision-making. They must also to a greater extent measure the effects of their investments before and after new changes are implemented in order to understand the result. How to create the best customer experience for your visitors Our platform is created for all the stores and malls that: want to achieve more efficient and more profitable customer experiences for their customers. At the same time, it helps to inspire your employees and partners to use the new insights to get there. It also, at the same time, helps to inspire your employees and partners to use the new insights to get there. Discover new valuable insights. Design and implement more profitable strategies. Measure the effectiveness of your experiments. Explore our software Why we do this: We want to create the right balance between man and technology On the one hand, it is technology that inspires and enables a more fun, easier, more comfortable and closer life for ourselves, our friends and family, as well as a more profitable and sustainable future for our companies. On the other hand, technology can also be worrying. It can be abused by forces that do not want us and / or the world well. That is why technological development and innovation need to be both supported and kept in check. A technological harmony in a data-driven society requires a legal balance with a razor-sharp ethical societal control over personal integrity and data security. The key is to find a balance between what inspires and what worries. That is our aspiration, our dream and vision. That is why we have developed Indivd and our anonymisation technology. Indivd constitutes this balance. Why Indivd Stores and malls must adapt to the new digital reality We work, we sleep and we shop to live. Exchanging goods and services has always been a natural way to survive and exist. Physical retail will continue to be an important part of our lives in the future, even though e-commerce has taken over an increasing part. But physical retail must adapt to the new and disruptive reality in order to be profitable and to continue to be appreciated. Stores and malls must, just like e-commerce, begin to use data and insights to better understand its visitors and thereby be able to offer more attractive meeting places. But the solutions to get there must simultaneously safeguard data protection and privacy. Today's and future customers demand sustainable retail based on privacy-friendly technology (Data Protection by Design), where privacy has the highest priority. No one will succeed without having created a balance between data and integrity. Stores and malls must adapt to the new digital reality We work, we sleep and we shop to live. Exchanging goods and services has always been a natural way to survive and exist. Physical retail will continue to be an important part of our lives in the future, even though e-commerce has taken over an increasing part. But physical retail must adapt to the new and disruptive reality in order to be profitable and to continue to be appreciated. Stores and malls must, just like e-commerce, begin to use data and insights to better understand its visitors and thereby be able to offer more attractive meeting places. But the solutions to get there must simultaneously safeguard data protection and privacy. Today's and future customers demand sustainable retail based on privacy-friendly technology (Data Protection by Design), where privacy has the highest priority. No one will succeed without having created a balance between data and integrity. No one escapes the future. Digitalization is the future. Digitalization is here to stay. Digitalization contributes to creating more efficient, profitable and more sustainable companies. Access to data and new technology, increases the digital innovation, improves governance and supports employees to create better strategies. Studies also show that companies that have come a long way in their digitalization surpass their competitors in all forms of financial performance. Reduce information-intensive costs by up to 90% Increase the understanding of process performance Help you become proactive and act before problems arise No one escapes the future. Digitalization is the future. Digitalization is here to stay. Digitalization contributes to creating more efficient, profitable and more sustainable companies. Access to data and new technology, increases the digital innovation, improves governance and supports employees to create better strategies. Studies also show that companies that have come a long way in their digitalization surpass their competitors in all forms of financial performance. Reduce information-intensive costs by up to 90% Increase the understanding of process performance Help you become proactive and act before problems arise Profitable strategies are based on customer- and business data Stores and malls are poorly equipped for the digital society, which is now growing at an ever faster pace. They need to sharpen their strategies and improve their governance by making greater use of customer and business data and more data-driven decision-making. They must also to a greater extent measure the effects of their investments before and after new changes are implemented in order to understand the result. Profitable strategies are based on customer- and business data Stores and malls are poorly equipped for the digital society, which is now growing at an ever faster pace. They need to sharpen their strategies and improve their governance by making greater use of customer and business data and more data-driven decision-making. They must also to a greater extent measure the effects of their investments before and after new changes are implemented in order to understand the result. How to create the best customer experience for your visitors Our platform is created for all the stores and malls that: want to achieve more efficient and more profitable customer experiences for their customers. At the same time, it helps to inspire your employees and partners to use the new insights to get there. It also, at the same time, helps to inspire your employees and partners to use the new insights to get there. Discover new valuable insights. Design and implement more profitable strategies. Measure the effectiveness of your experiments. Explore our software How to create the best customer experience for your visitors Our platform is created for all the stores and malls that: want to achieve more efficient and more profitable customer experiences for their customers. At the same time, it helps to inspire your employees and partners to use the new insights to get there. It also, at the same time, helps to inspire your employees and partners to use the new insights to get there. Discover new valuable insights. Design and implement more profitable strategies. Measure the effectiveness of your experiments. Why we do this: We want to create the right balance between man and technology On the one hand, it is technology that inspires and enables a more fun, easier, more comfortable and closer life for ourselves, our friends and family, as well as a more profitable and sustainable future for our companies. On the other hand, technology can also be worrying. It can be abused by forces that do not want us and / or the world well. That is why technological development and innovation need to be both supported and kept in check. A technological harmony in a data-driven society requires a legal balance with a razor-sharp ethical societal control over personal integrity and data security. The key is to find a balance between what inspires and what worries. That is our aspiration, our dream and vision. That is why we have developed Indivd and our anonymisation technology. Indivd constitutes this balance. Why we do this: We want to create the right balance between man and technology On the one hand, it is technology that inspires and enables a more fun, easier, more comfortable and closer life for ourselves, our friends and family, as well as a more profitable and sustainable future for our companies. On the other hand, technology can also be worrying. It can be abused by forces that do not want us and / or the world well. That is why technological development and innovation need to be both supported and kept in check. A technological harmony in a data-driven society requires a legal balance with a razor-sharp ethical societal control over personal integrity and data security. The key is to find a balance between what inspires and what worries. That is our aspiration, our dream and vision. That is why we have developed Indivd and our anonymisation technology. Indivd constitutes this balance.",
    "LEADING INSIGHTS FOR STORES, MALLS and airports Making locations as smart as websites Our cloud-based, patented AI solution uses 2D cameras to enable locations to understand visitor behavior and improve relevance, just like most companies already do online. Top 33 in Sweden Sweden's leading startup competition has named Indivd one of Sweden's hottest startups in 2021 and 2022. Top 5 in the World Innovation analysts compared 135 anonymisation start-ups worldwide and ranked Indivd in the top 5. One of Europe's Best Indivd is included in AI Landscape, an honor and quality seal for European AI start-up companies. Insights for everyone We are significantly more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. Costs drop by at least 59% Our current customers save between 59-95% by using Indivd's people counter. Everyone else 922 EUR per yr Indivd 377 EUR per yr At least 59% lower cost per yr Our current customers save between 59-95% by using Indivd's people counter. We are much more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. What you can achieve Trustworthy insights Our real-time measurement and forecasting take people counting to a new level. Read more More valuable insights Understand departments and categories, compare data. Our visual editor gives you insights comparable to e-com. Read more GDPR ready. For Real Indivd is the only people counter approved by a European data protection authority. Read more Get started in 30 minutes Our cloud-based solution connects to standard 2D cameras and your locations super quickly. Read more Turning good sites into great experiences Retail Analytics help you create a rich customer experience based on insights from your people counters. The right strategies based on reliable insights Without Indivd You never know for sure if your changes have solved a problem. You lack reliable insights and can't create any actual customer value. Creating the customer value is like driving with your eyes closed. With Indivd Your improvements deliver the results you expect. Modify marketing and sales based on deep and broad insights. Precisely pinpoint improvement opportunities each time. Creates value for the entire ecosystem Stores and Retail Chains Create data driven value for all your departments. For daily operations as well as for your marketing, sales, store design, staffing, and your suppliers. Read more Malls Understand all people flows, through aisles and in and out of the shops. Optimise your sales, marketing, and sharpen your value proposition. Read more Communities Compare your results with others in your commercial space, city centre or retain chain. Improve results, be inspired and create more value. Read more Experience the difference the market's most accurate people counter brings. LEADING INSIGHTS FOR STORES, MALLS and airports Making locations as smart as websites Our cloud-based, patented AI solution uses 2D cameras to enable locations to understand visitor behavior and improve relevance, just like most companies already do online. LEADING INSIGHTS FOR STORES, MALLS and airports Making locations as smart as websites Our cloud-based, patented AI solution uses 2D cameras to enable locations to understand visitor behavior and improve relevance, just like most companies already do online. Top 33 in Sweden Sweden's leading startup competition has named Indivd one of Sweden's hottest startups in 2021 and 2022. Top 5 in the World Innovation analysts compared 135 anonymisation start-ups worldwide and ranked Indivd in the top 5. One of Europe's Best Indivd is included in AI Landscape, an honor and quality seal for European AI start-up companies. Top 33 in Sweden Sweden's leading startup competition has named Indivd one of Sweden's hottest startups in 2021 and 2022. Top 5 in the World Innovation analysts compared 135 anonymisation start-ups worldwide and ranked Indivd in the top 5. One of Europe's Best Indivd is included in AI Landscape, an honor and quality seal for European AI start-up companies. Insights for everyone We are significantly more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. Costs drop by at least 59% Our current customers save between 59-95% by using Indivd's people counter. Everyone else 922 EUR per yr Indivd 377 EUR per yr At least 59% lower cost per yr Our current customers save between 59-95% by using Indivd's people counter. We are much more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. We are significantly more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. Costs drop by at least 59% Our current customers save between 59-95% by using Indivd's people counter. 922 EUR per yr 377 EUR per yr At least 59% lower cost per yr Our current customers save between 59-95% by using Indivd's people counter. We are much more cost-effective than all other people counters thanks to technical advantages, no additional hardware, a completely cloud-based solution and cutting-edge advances. What you can achieve Trustworthy insights Our real-time measurement and forecasting take people counting to a new level. Read more More valuable insights Understand departments and categories, compare data. Our visual editor gives you insights comparable to e-com. Read more GDPR ready. For Real Indivd is the only people counter approved by a European data protection authority. Read more Get started in 30 minutes Our cloud-based solution connects to standard 2D cameras and your locations super quickly. Read more What you can achieve Our real-time measurement and forecasting take people counting to a new level. Understand departments and categories, compare data. Our visual editor gives you insights comparable to e-com. GDPR ready. For Real Indivd is the only people counter approved by a European data protection authority. Get started in 30 minutes Our cloud-based solution connects to standard 2D cameras and your locations super quickly. Turning good sites into great experiences Retail Analytics help you create a rich customer experience based on insights from your people counters. The right strategies based on reliable insights Without Indivd You never know for sure if your changes have solved a problem. You lack reliable insights and can't create any actual customer value. Creating the customer value is like driving with your eyes closed. With Indivd Your improvements deliver the results you expect. Modify marketing and sales based on deep and broad insights. Precisely pinpoint improvement opportunities each time. Turning good sites into great experiences Retail Analytics help you create a rich customer experience based on insights from your people counters. The right strategies based on reliable insights You never know for sure if your changes have solved a problem. You lack reliable insights and can't create any actual customer value. Creating the customer value is like driving with your eyes closed. Your improvements deliver the results you expect. Modify marketing and sales based on deep and broad insights. Precisely pinpoint improvement opportunities each time. Creates value for the entire ecosystem Stores and Retail Chains Create data driven value for all your departments. For daily operations as well as for your marketing, sales, store design, staffing, and your suppliers. Read more Malls Understand all people flows, through aisles and in and out of the shops. Optimise your sales, marketing, and sharpen your value proposition. Read more Communities Compare your results with others in your commercial space, city centre or retain chain. Improve results, be inspired and create more value. Read more Creates value for the entire ecosystem Stores and Retail Chains Create data driven value for all your departments. For daily operations as well as for your marketing, sales, store design, staffing, and your suppliers. Understand all people flows, through aisles and in and out of the shops. Optimise your sales, marketing, and sharpen your value proposition. Compare your results with others in your commercial space, city centre or retain chain. Improve results, be inspired and create more value. Experience the difference the market's most accurate people counter brings. Experience the difference the market's most accurate people counter brings.",
    "Grow better with the right plan Pay for what you need (when you need it). Professional For most companies. 249 SEK per camera per month Get started Enterprise For extra large companies. Large scale deployment Bespoke onboarding & training Custom data destinations Data automation Get started Professional Enterprise Connect your location easily Patented anonymization method No biometric data processed No personal data stored Automatic image data destruction Preconfigured hardware firewall Smooth and seamless installation Secure transfer of image data over IPsec bridge Camera activation management Heartbeat Understand your visitors customer journey Automatic exclusion of store employees Automatic exclusion of mannequins Customer Journey Mapping Custom funnels Total visits Total visitors (coming soon) Number of visitors entering (coming soon) Number of visitors going out (coming soon) Return frequency (coming soon) Gender Age Active visitors in the location Camera to camera duration Total time spent in the location (coming soon) Visualization of all movements at a location Amount of visitors stopping by an object or product Amount of visitors passing by an object or product Most popular areas in location Analyze and optimize your customer experience Location segmentation & comparison Target group segmentation & comparison Date and time segmentation & comparison Category segmentation & comparison Download charts & data Improved recommendations & trends Improved insight quality and granularity Benchmark statistics Improve your value creation Invite unlimited users Invite unlimited partners Role based access restrictions Time based access restrictions Co-create in communities (optional) Data & Destinations European cloud storage Automated staging for multiple destinations Add-on destinations Data warehouse destinations Business intelligence & visualisation destinations Support, Onboarding, Training & Services Email and in-app support Access to knowledge base Free onboarding Bespoke onboarding and training Dedicated success team Professional services (optional) Legal Standard & Conditions Enterprise SLA DPIA Not sure which one is right for you? Talk to us and we will help you. Free demo Grow better with the right plan Pay for what you need (when you need it). Professional For most companies. 249 SEK per camera per month Get started Enterprise For extra large companies. Large scale deployment Bespoke onboarding & training Custom data destinations Data automation Get started Grow better with the right plan Pay for what you need (when you need it). 249 SEK per camera per month For extra large companies. Bespoke onboarding & training Professional Enterprise Connect your location easily Patented anonymization method No biometric data processed No personal data stored Automatic image data destruction Preconfigured hardware firewall Smooth and seamless installation Secure transfer of image data over IPsec bridge Camera activation management Heartbeat Understand your visitors customer journey Automatic exclusion of store employees Automatic exclusion of mannequins Customer Journey Mapping Custom funnels Total visits Total visitors (coming soon) Number of visitors entering (coming soon) Number of visitors going out (coming soon) Return frequency (coming soon) Gender Age Active visitors in the location Camera to camera duration Total time spent in the location (coming soon) Visualization of all movements at a location Amount of visitors stopping by an object or product Amount of visitors passing by an object or product Most popular areas in location Analyze and optimize your customer experience Location segmentation & comparison Target group segmentation & comparison Date and time segmentation & comparison Category segmentation & comparison Download charts & data Improved recommendations & trends Improved insight quality and granularity Benchmark statistics Improve your value creation Invite unlimited users Invite unlimited partners Role based access restrictions Time based access restrictions Co-create in communities (optional) Data & Destinations European cloud storage Automated staging for multiple destinations Add-on destinations Data warehouse destinations Business intelligence & visualisation destinations Support, Onboarding, Training & Services Email and in-app support Access to knowledge base Free onboarding Bespoke onboarding and training Dedicated success team Professional services (optional) Legal Standard & Conditions Enterprise SLA DPIA Not sure which one is right for you? Talk to us and we will help you. Free demo No biometric data processed No personal data stored Automatic image data destruction Smooth and seamless installation Secure transfer of image data over IPsec bridge Automatic exclusion of store employees Automatic exclusion of mannequins Total visitors (coming soon) Number of visitors entering (coming soon) Number of visitors going out (coming soon) Return frequency (coming soon) Active visitors in the location Camera to camera duration Total time spent in the location (coming soon) Visualization of all movements at a location Amount of visitors stopping by an object or product Amount of visitors passing by an object or product Most popular areas in location Location segmentation & comparison Target group segmentation & comparison Date and time segmentation & comparison Category segmentation & comparison Download charts & data Improved recommendations & trends Improved insight quality and granularity Role based access restrictions Time based access restrictions Co-create in communities (optional) Automated staging for multiple destinations Business intelligence & visualisation destinations Email and in-app support Access to knowledge base Bespoke onboarding and training Standard & Conditions Not sure which one is right for you? Talk to us and we will help you.",
    "All that's needed to have market leading people counting method All what's needed to have a first class people counting method Each level gives you more insights and better opportunities to create greater customer value, build a more efficient organisation and become more profitable. 58% Lower price* Know how many visitors you have Advanced 16 EUR per month and entrance/area or 11 EUR/month for 12 months (-30%) Show functions and services Features Number of people entering and exiting Gain reliable insights to how many people come and go through entrances and other areas. Conversion rate Use your POS data alongside your customer statistics to understand what percentage of your customers that actually make purchases. Smart Lines and Zones Create lines and zones to measure or exclude visitors in your locations to get more cost-efficient and detailed insights into your customer journeys. Segmentation by location Compare, analyse, and spot national, regional and local differences between your various stores or sites. Segmentation by date and time Monitor all your insights by the hour, day, week, month, or year. Interpret and use the variations to your advantage. Invitations Build a data-driven culture and increase your results by inviting all your employees, suppliers, and consultants. Calibrate people counters Optimise all your people counters via our platform to get more granular data collection and reliable results. Included services SLA Our SLA commits to an uptime of at least 99.5%, which means maximum unavailability of 21.56 min/month. * Indivd lowers your costs by at least SEK 5,400 per people counter and year. The amount of visitors and their movements Professional 39 EUR per month and entrance/area or 27 EUR/month for 12 month (-30%) Show functions and services Features Everything in Advanced The features that are included for our Advanced People Counter are also included for our Professional People Counter. Smart Areas Create and use areas to measure or exclude visitors in your locations gives you the opportunity to understand the relevance of products, campaigns, or other IoT devices on your premises. Access to Community Learn from the experience of others in your mall or city centre and create more value together or create your own community. Insights from Community Compare the results, insights, and the ROI on your strategies with others in your trading place or city centre and gain a deeper understanding of how good your outcomes are. Customer journeys for all your visitors Optimise your customer experience by understanding how people experience your space. Through their entire visit, from when they enter, shop around and until they leave. Funnels Target a specific area of your premises and get an understanding of how many people go there, what path they take and where you lost some of them along the way. Hot areas Where in your premises do you get many customers? Cold areas Where in your premises do you get fewer visitors? Included services Onboarding Based on your goals, we help you link your premises, manage the installation, safeguard the quality and set up your organisation. Best position We carry out an initial analysis based on your needs to create the best cost-effective and reliable people counting. Create an optimal customer experience Optimal from 119 EUR per month and shop/mall or 83 EUR/month for 12 months (-30%) Talk with a sales rep Show functions and services Features Everything in Professional The features that are included for our Professional People Counter are also included in our Optimal People Counter. Gender distribution Understand how many of your visitors are men or women and use the information in customer journeys, people counting or other insights. Visitors' ages Understand the age of your visitors and use this information for customer journeys, people counting or other insights. Segmentation by target group Compare, analyse, and become aware of differences between the genders and different age groups in all your stores or sites. Benchmark insights Gain a deeper understanding of your results by comparing yourself to the industry. Ensure relevance by segmenting between different industries in physical retail. Activities Log all your strategies that affect the customer experience such as marketing, interior design, new services, or categories to understand the ROI. Reports Create and subscribe to reports for all your stores or malls. Goal setting Create national, regional or local goals to follow and receive notices of your development, how the trends are going and which activities lead to the improvements. ROI for consultants and suppliers Invite your suppliers and consultants to projects that affect the customer experience to see how well their products and services affect the customer experience. ROI for marketing strategies Integrate your marketing channels to see how marketing or specific campaigns increase or decrease visits or conversions on your premises. ROI for sales strategies Integrate your sales strategies to see how specific campaigns or activities affect visitor behavior in your locations. A/B testing Implement several strategies or changes at the same time and understand which of them leads to the highest results. Integrations Become more efficient by integrating your ERP system, POS system, or other systems to enable holistic analysis, online-offline. Coordinate all your data, both online and offline. Included services Extended SLA Extended SLA includes telephone access and a dedicated contact person. Dedicated analyst Get a dedicated analyst to help you create the reports or analyses you need to achieve your goals. Dedicated retail strategist Get a dedicated strategist who, based on previous successful strategies, helps you create the changes, routines or strategies you need to achieve your goals. SOME OF OUR CUSTOMERS Retailers who've been with us from the start Questions and Answers Buy Indivd How do I go about buying a people counter? Click on \"Free trial\" to create an Indivd account That gives you access to the platform. We are happy to provide a payment method that fits your situation and you can choose to pay by invoice, if you like. Is a people counter included? Our people counting is compatible with most people counters on the market, meaning the hardware you already have in your shops or sites is all you need, most of the time. At cost price, you have the option of adding our standard people counter, optimised to most spaces and needs. How many people counters do I need? The number of people counters per shop or mall all depends on your requirements. If you want to count the number of people passing in and out through your entrance, then you only need one. If you wish to measure a customer journey or customer experience, then you need to place people counters elsewhere in your shop/mall as well. We can help you find good spots for the proper counters via our service Optimal Positioning. The service provides you with a report outlining the best position(-s) to meet your requirements at the lowest possible cost. How long is the term under your contracts? Is it possible to up or downgrade the subscription? All our contracts run a month at a time and you can choose to start, stop or make changes to your contract at any time. Try it for free What does a free trial involve? You get access to all features when you for your Indivd trial version. If you wish to trial a specific plan, please simple contact us. What happens at the end of the trial period? At the end of the trial period your data and settings will remain as they are. You can then decide whether you want to move on to a paid version. Is a people counter included during the trial period? Yes, if you wish to use our standard people counter, which is optimised for different requirements and spaces, then we will provide one. Other questions How do you protect the privacy of our visitors? Indivd is the first people counter that's been developed with Data Protection by Design, meaning our systems come with extensive privacy protection and that our research and development always is based on a risk analysis. It further means that Indivd is the first and only people counter that has been subjected to assessments and approval by a European data protection board. If you wish to about our personal data protection work, please contact us at privacy@indivd.com. What resources are available to ensure I get maximum value from Indivd? All customers on a Indivd contract have access to our support, documented guidance to connect premises and adapted training as needed. To ensure you reach your goals, you have the option to access customer journey analyses, reports for optimal placement of people counters, retail strategists, data analysts and many other services we offer through our partners. These optional features incur additional fees. Any questions? Our support is open 24/7. Contact our global support team at support@indivd.com. We are here to help you! Try our market leading people counter All that's needed to have market leading people counting method All what's needed to have a first class people counting method Each level gives you more insights and better opportunities to create greater customer value, build a more efficient organisation and become more profitable. All that's needed to have market leading people counting method All what's needed to have a first class people counting method Each level gives you more insights and better opportunities to create greater customer value, build a more efficient organisation and become more profitable. 58% Lower price* Know how many visitors you have Advanced 16 EUR per month and entrance/area or 11 EUR/month for 12 months (-30%) Show functions and services Features Number of people entering and exiting Gain reliable insights to how many people come and go through entrances and other areas. Conversion rate Use your POS data alongside your customer statistics to understand what percentage of your customers that actually make purchases. Smart Lines and Zones Create lines and zones to measure or exclude visitors in your locations to get more cost-efficient and detailed insights into your customer journeys. Segmentation by location Compare, analyse, and spot national, regional and local differences between your various stores or sites. Segmentation by date and time Monitor all your insights by the hour, day, week, month, or year. Interpret and use the variations to your advantage. Invitations Build a data-driven culture and increase your results by inviting all your employees, suppliers, and consultants. Calibrate people counters Optimise all your people counters via our platform to get more granular data collection and reliable results. Included services SLA Our SLA commits to an uptime of at least 99.5%, which means maximum unavailability of 21.56 min/month. * Indivd lowers your costs by at least SEK 5,400 per people counter and year. The amount of visitors and their movements Professional 39 EUR per month and entrance/area or 27 EUR/month for 12 month (-30%) Show functions and services Features Everything in Advanced The features that are included for our Advanced People Counter are also included for our Professional People Counter. Smart Areas Create and use areas to measure or exclude visitors in your locations gives you the opportunity to understand the relevance of products, campaigns, or other IoT devices on your premises. Access to Community Learn from the experience of others in your mall or city centre and create more value together or create your own community. Insights from Community Compare the results, insights, and the ROI on your strategies with others in your trading place or city centre and gain a deeper understanding of how good your outcomes are. Customer journeys for all your visitors Optimise your customer experience by understanding how people experience your space. Through their entire visit, from when they enter, shop around and until they leave. Funnels Target a specific area of your premises and get an understanding of how many people go there, what path they take and where you lost some of them along the way. Hot areas Where in your premises do you get many customers? Cold areas Where in your premises do you get fewer visitors? Included services Onboarding Based on your goals, we help you link your premises, manage the installation, safeguard the quality and set up your organisation. Best position We carry out an initial analysis based on your needs to create the best cost-effective and reliable people counting. Create an optimal customer experience Optimal from 119 EUR per month and shop/mall or 83 EUR/month for 12 months (-30%) Talk with a sales rep Show functions and services Features Everything in Professional The features that are included for our Professional People Counter are also included in our Optimal People Counter. Gender distribution Understand how many of your visitors are men or women and use the information in customer journeys, people counting or other insights. Visitors' ages Understand the age of your visitors and use this information for customer journeys, people counting or other insights. Segmentation by target group Compare, analyse, and become aware of differences between the genders and different age groups in all your stores or sites. Benchmark insights Gain a deeper understanding of your results by comparing yourself to the industry. Ensure relevance by segmenting between different industries in physical retail. Activities Log all your strategies that affect the customer experience such as marketing, interior design, new services, or categories to understand the ROI. Reports Create and subscribe to reports for all your stores or malls. Goal setting Create national, regional or local goals to follow and receive notices of your development, how the trends are going and which activities lead to the improvements. ROI for consultants and suppliers Invite your suppliers and consultants to projects that affect the customer experience to see how well their products and services affect the customer experience. ROI for marketing strategies Integrate your marketing channels to see how marketing or specific campaigns increase or decrease visits or conversions on your premises. ROI for sales strategies Integrate your sales strategies to see how specific campaigns or activities affect visitor behavior in your locations. A/B testing Implement several strategies or changes at the same time and understand which of them leads to the highest results. Integrations Become more efficient by integrating your ERP system, POS system, or other systems to enable holistic analysis, online-offline. Coordinate all your data, both online and offline. Included services Extended SLA Extended SLA includes telephone access and a dedicated contact person. Dedicated analyst Get a dedicated analyst to help you create the reports or analyses you need to achieve your goals. Dedicated retail strategist Get a dedicated strategist who, based on previous successful strategies, helps you create the changes, routines or strategies you need to achieve your goals. Know how many visitors you have per month and entrance/area or 11 EUR/month for 12 months (-30%) Show functions and services Number of people entering and exiting Gain reliable insights to how many people come and go through entrances and other areas. Use your POS data alongside your customer statistics to understand what percentage of your customers that actually make purchases. Smart Lines and Zones Create lines and zones to measure or exclude visitors in your locations to get more cost-efficient and detailed insights into your customer journeys. Compare, analyse, and spot national, regional and local differences between your various stores or sites. Segmentation by date and time Monitor all your insights by the hour, day, week, month, or year. Interpret and use the variations to your advantage. Build a data-driven culture and increase your results by inviting all your employees, suppliers, and consultants. Optimise all your people counters via our platform to get more granular data collection and reliable results. Our SLA commits to an uptime of at least 99.5%, which means maximum unavailability of 21.56 min/month. * Indivd lowers your costs by at least SEK 5,400 per people counter and year. The amount of visitors and their movements per month and entrance/area or 27 EUR/month for 12 month (-30%) Show functions and services The features that are included for our Advanced People Counter are also included for our Professional People Counter. Create and use areas to measure or exclude visitors in your locations gives you the opportunity to understand the relevance of products, campaigns, or other IoT devices on your premises. Learn from the experience of others in your mall or city centre and create more value together or create your own community. Compare the results, insights, and the ROI on your strategies with others in your trading place or city centre and gain a deeper understanding of how good your outcomes are. Customer journeys for all your visitors Optimise your customer experience by understanding how people experience your space. Through their entire visit, from when they enter, shop around and until they leave. Target a specific area of your premises and get an understanding of how many people go there, what path they take and where you lost some of them along the way. Where in your premises do you get many customers? Where in your premises do you get fewer visitors? Based on your goals, we help you link your premises, manage the installation, safeguard the quality and set up your organisation. We carry out an initial analysis based on your needs to create the best cost-effective and reliable people counting. Create an optimal customer experience per month and shop/mall or 83 EUR/month for 12 months (-30%) Show functions and services The features that are included for our Professional People Counter are also included in our Optimal People Counter. Understand how many of your visitors are men or women and use the information in customer journeys, people counting or other insights. Understand the age of your visitors and use this information for customer journeys, people counting or other insights. Segmentation by target group Compare, analyse, and become aware of differences between the genders and different age groups in all your stores or sites. Gain a deeper understanding of your results by comparing yourself to the industry. Ensure relevance by segmenting between different industries in physical retail. Log all your strategies that affect the customer experience such as marketing, interior design, new services, or categories to understand the ROI. Create and subscribe to reports for all your stores or malls. Create national, regional or local goals to follow and receive notices of your development, how the trends are going and which activities lead to the improvements. ROI for consultants and suppliers Invite your suppliers and consultants to projects that affect the customer experience to see how well their products and services affect the customer experience. ROI for marketing strategies Integrate your marketing channels to see how marketing or specific campaigns increase or decrease visits or conversions on your premises. ROI for sales strategies Integrate your sales strategies to see how specific campaigns or activities affect visitor behavior in your locations. Implement several strategies or changes at the same time and understand which of them leads to the highest results. Become more efficient by integrating your ERP system, POS system, or other systems to enable holistic analysis, online-offline. Coordinate all your data, both online and offline. Extended SLA includes telephone access and a dedicated contact person. Get a dedicated analyst to help you create the reports or analyses you need to achieve your goals. Get a dedicated strategist who, based on previous successful strategies, helps you create the changes, routines or strategies you need to achieve your goals. SOME OF OUR CUSTOMERS Retailers who've been with us from the start SOME OF OUR CUSTOMERS Retailers who've been with us from the start Questions and Answers Buy Indivd How do I go about buying a people counter? Click on \"Free trial\" to create an Indivd account That gives you access to the platform. We are happy to provide a payment method that fits your situation and you can choose to pay by invoice, if you like. Is a people counter included? Our people counting is compatible with most people counters on the market, meaning the hardware you already have in your shops or sites is all you need, most of the time. At cost price, you have the option of adding our standard people counter, optimised to most spaces and needs. How many people counters do I need? The number of people counters per shop or mall all depends on your requirements. If you want to count the number of people passing in and out through your entrance, then you only need one. If you wish to measure a customer journey or customer experience, then you need to place people counters elsewhere in your shop/mall as well. We can help you find good spots for the proper counters via our service Optimal Positioning. The service provides you with a report outlining the best position(-s) to meet your requirements at the lowest possible cost. How long is the term under your contracts? Is it possible to up or downgrade the subscription? All our contracts run a month at a time and you can choose to start, stop or make changes to your contract at any time. Try it for free What does a free trial involve? You get access to all features when you for your Indivd trial version. If you wish to trial a specific plan, please simple contact us. What happens at the end of the trial period? At the end of the trial period your data and settings will remain as they are. You can then decide whether you want to move on to a paid version. Is a people counter included during the trial period? Yes, if you wish to use our standard people counter, which is optimised for different requirements and spaces, then we will provide one. Other questions How do you protect the privacy of our visitors? Indivd is the first people counter that's been developed with Data Protection by Design, meaning our systems come with extensive privacy protection and that our research and development always is based on a risk analysis. It further means that Indivd is the first and only people counter that has been subjected to assessments and approval by a European data protection board. If you wish to about our personal data protection work, please contact us at privacy@indivd.com. What resources are available to ensure I get maximum value from Indivd? All customers on a Indivd contract have access to our support, documented guidance to connect premises and adapted training as needed. To ensure you reach your goals, you have the option to access customer journey analyses, reports for optimal placement of people counters, retail strategists, data analysts and many other services we offer through our partners. These optional features incur additional fees. Any questions? Our support is open 24/7. Contact our global support team at support@indivd.com. We are here to help you! How do I go about buying a people counter? Click on \"Free trial\" to create an Indivd account That gives you access to the platform. We are happy to provide a payment method that fits your situation and you can choose to pay by invoice, if you like. Is a people counter included? Our people counting is compatible with most people counters on the market, meaning the hardware you already have in your shops or sites is all you need, most of the time. At cost price, you have the option of adding our standard people counter, optimised to most spaces and needs. How many people counters do I need? The number of people counters per shop or mall all depends on your requirements. If you want to count the number of people passing in and out through your entrance, then you only need one. If you wish to measure a customer journey or customer experience, then you need to place people counters elsewhere in your shop/mall as well. We can help you find good spots for the proper counters via our service Optimal Positioning. The service provides you with a report outlining the best position(-s) to meet your requirements at the lowest possible cost. How long is the term under your contracts? Is it possible to up or downgrade the subscription? All our contracts run a month at a time and you can choose to start, stop or make changes to your contract at any time. Try it for free What does a free trial involve? You get access to all features when you for your Indivd trial version. If you wish to trial a specific plan, please simple contact us. What happens at the end of the trial period? At the end of the trial period your data and settings will remain as they are. You can then decide whether you want to move on to a paid version. Is a people counter included during the trial period? Yes, if you wish to use our standard people counter, which is optimised for different requirements and spaces, then we will provide one. How do you protect the privacy of our visitors? Indivd is the first people counter that's been developed with Data Protection by Design, meaning our systems come with extensive privacy protection and that our research and development always is based on a risk analysis. It further means that Indivd is the first and only people counter that has been subjected to assessments and approval by a European data protection board. If you wish to about our personal data protection work, please contact us at privacy@indivd.com. What resources are available to ensure I get maximum value from Indivd? All customers on a Indivd contract have access to our support, documented guidance to connect premises and adapted training as needed. To ensure you reach your goals, you have the option to access customer journey analyses, reports for optimal placement of people counters, retail strategists, data analysts and many other services we offer through our partners. These optional features incur additional fees. Our support is open 24/7. Contact our global support team at support@indivd.com. We are here to help you! Try our market leading people counter Try our market leading people counter",
    "swedish patented technology Cutting-edge reliability We bring people counting to an entirely new level. Become aware of how many people come in and out of your shop, their gender and age distribution, their customer journeys and much more - at lower cost. SOME OF OUR CUSTOMERS Retailers that have relied on us since the start The frustrating days of unreliable people counters are behind us Indivd's people counter provides an uncomplicated, yet complete picture, of all your visitors. Remarkable reliability Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Read more Much more cost-effective Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Read more GDPR ready. For real Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Read more Remarkable reliability Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Read more Much more cost-effective Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Read more GDPR ready. For real Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Read more Count all visitors Understanding your people flows, is the first step in creating a more profitable and efficient store or mall. Thanks to several years of research and innovative features, Indivd is proud to offer the market's most reliable people counter. Count visits in your entrances Use Indivd's people counter at you entrances and count how many people come in and out. Indivd has the market's widest detection range, which is why very wide entrances can be screened with a single people counter. Foot traffic in other zones Measure inside your locations and other areas simultaneously. You can, for example, use two lines to measure an entrance, a pathway at the entrance, and a zone you specifically want to measure or exclude. Optimise your conversion rate Quickly create and understand your true conversion rate by using tracking checkouts or integrating POS data. If you then analyse what led to a purchase, you have some great insights to how your sales can be optimised. Understand and grow your ideal customers Target group analysis enables you to streamline and optimise your strategies, investments and implemented changes. Gender distribution Understanding the gender distribution of your foot traffic in and out of your space and what sections they visit. Enables you to optimise the customer experience and understand whether you attract an increased part of your ideal customer group. Knowing the age of the visitors Understanding the visitors' age enables you to know when certain target groups visit your premises. You can even receive an understanding of how their customer journeys differ. That knowledge enables you to create a better customer experience. Optimise the visitor experience Demographic customer insights allow you to continuously streamline your product range to reach the right or a new target group, or to understand how effective your online marketing is in attracting the right target group to the stores. Learn how the visitors perceive your space Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Track the customer journeys Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Get detailed customer journeys Our smart lines and zones provides incredibly detailed insights about your visitors' customer journeys. How they move between campaign areas, products, stores in malls or other areas. Streamline customer journeys When you understand the customer journeys, then it's time to create a better customer experience. Log strategies and changes to see how the outcomes improve. Understand why your visitors come to you Once you understand what people do in your shop/mall, you have all the tools you need to create the ultimate visitor experience. Shop visitors Understand what your visitors walk past, where they stop, what they show an interest in and if they make any purchases or not. Mall visitors Understand how the visitors perceive the mall, how many shops they visit, how much time they spend in your premises and which areas they frequent the most. Lower cost, guaranteed Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other in the industry. Costs drop by at least 59% With Indivd, you lower you costs by at least SEK 5,400 per year . And, you are likely to save even more than that. Alla andra 9229 kr/r Indivd 3770 kr/r At least 59% lower cost per yr With Indivd, you lower your costs by at least SEK 5,400 per year . And, you are likely to save even more than that. Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other people counter on the market. PROFESSIONAL SERVICES We are with you. All the way. Our all-in-one solutions help you get started very quickly. We help you utilise the insights to reach your goals. Upgrade Indivd's people counter If you already have a people counter, then we are more than happy to assist you with any contract matters. Optimal positioning We help you find the best position and ensure the most cost-effective solution while also reaching your goals. Installation and operation Our engineers support you all the way and make sure your locations are connected in a safe way. Training We will help you to get started and begin deriving value from all the insights you gather. The market's safest people counter Anonymisation Indivd's people counting is based on a patented anonymisation method, meaning it's impossible to detect the identity of people. Assessed & approved Indivd is designed based on Data Protection by Design, and is the first people counter to be approved by a European data protection authority. High IT security Indivd always aimed for ISO level for system's integrity, accessibility, security, durability, persistence, and including during our ongoing system tests. Experience the difference the market's most reliable people counter brings swedish patented technology Cutting-edge reliability We bring people counting to an entirely new level. Become aware of how many people come in and out of your shop, their gender and age distribution, their customer journeys and much more - at lower cost. We bring people counting to an entirely new level. Become aware of how many people come in and out of your shop, their gender and age distribution, their customer journeys and much more - at lower cost. SOME OF OUR CUSTOMERS Retailers that have relied on us since the start SOME OF OUR CUSTOMERS Retailers that have relied on us since the start The frustrating days of unreliable people counters are behind us Indivd's people counter provides an uncomplicated, yet complete picture, of all your visitors. Remarkable reliability Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Read more Much more cost-effective Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Read more GDPR ready. For real Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Read more Remarkable reliability Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Read more Much more cost-effective Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Read more GDPR ready. For real Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Read more The frustrating days of unreliable people counters are behind us Indivd's people counter provides an uncomplicated, yet complete picture, of all your visitors. Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Our patented people counters are pioneering new market standards and provide you with entirely new possibilities to finding out more about your visitors. Thanks to groundbreaking research, we have developed a people counter that is far more cost-effective than all other people counters on the market. Indivd's people counter comes with unique built-in data protection and is the only people counter approved by a European data protection authority. Count all visitors Understanding your people flows, is the first step in creating a more profitable and efficient store or mall. Thanks to several years of research and innovative features, Indivd is proud to offer the market's most reliable people counter. Count visits in your entrances Use Indivd's people counter at you entrances and count how many people come in and out. Indivd has the market's widest detection range, which is why very wide entrances can be screened with a single people counter. Foot traffic in other zones Measure inside your locations and other areas simultaneously. You can, for example, use two lines to measure an entrance, a pathway at the entrance, and a zone you specifically want to measure or exclude. Optimise your conversion rate Quickly create and understand your true conversion rate by using tracking checkouts or integrating POS data. If you then analyse what led to a purchase, you have some great insights to how your sales can be optimised. Understanding your people flows, is the first step in creating a more profitable and efficient store or mall. Thanks to several years of research and innovative features, Indivd is proud to offer the market's most reliable people counter. Count visits in your entrances Use Indivd's people counter at you entrances and count how many people come in and out. Indivd has the market's widest detection range, which is why very wide entrances can be screened with a single people counter. Foot traffic in other zones Measure inside your locations and other areas simultaneously. You can, for example, use two lines to measure an entrance, a pathway at the entrance, and a zone you specifically want to measure or exclude. Optimise your conversion rate Quickly create and understand your true conversion rate by using tracking checkouts or integrating POS data. If you then analyse what led to a purchase, you have some great insights to how your sales can be optimised. Understand and grow your ideal customers Target group analysis enables you to streamline and optimise your strategies, investments and implemented changes. Gender distribution Understanding the gender distribution of your foot traffic in and out of your space and what sections they visit. Enables you to optimise the customer experience and understand whether you attract an increased part of your ideal customer group. Knowing the age of the visitors Understanding the visitors' age enables you to know when certain target groups visit your premises. You can even receive an understanding of how their customer journeys differ. That knowledge enables you to create a better customer experience. Optimise the visitor experience Demographic customer insights allow you to continuously streamline your product range to reach the right or a new target group, or to understand how effective your online marketing is in attracting the right target group to the stores. Understand and grow your ideal customers Target group analysis enables you to streamline and optimise your strategies, investments and implemented changes. Understanding the gender distribution of your foot traffic in and out of your space and what sections they visit. Enables you to optimise the customer experience and understand whether you attract an increased part of your ideal customer group. Knowing the age of the visitors Understanding the visitors' age enables you to know when certain target groups visit your premises. You can even receive an understanding of how their customer journeys differ. That knowledge enables you to create a better customer experience. Optimise the visitor experience Demographic customer insights allow you to continuously streamline your product range to reach the right or a new target group, or to understand how effective your online marketing is in attracting the right target group to the stores. Learn how the visitors perceive your space Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Track the customer journeys Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Get detailed customer journeys Our smart lines and zones provides incredibly detailed insights about your visitors' customer journeys. How they move between campaign areas, products, stores in malls or other areas. Streamline customer journeys When you understand the customer journeys, then it's time to create a better customer experience. Log strategies and changes to see how the outcomes improve. Learn how the visitors perceive your space Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Track the customer journeys Optimise your customer experience by understanding how visitors perceive your premises. Through their entire visit, from when they enter, shop around and until they leave. Get detailed customer journeys Our smart lines and zones provides incredibly detailed insights about your visitors' customer journeys. How they move between campaign areas, products, stores in malls or other areas. When you understand the customer journeys, then it's time to create a better customer experience. Log strategies and changes to see how the outcomes improve. Understand why your visitors come to you Once you understand what people do in your shop/mall, you have all the tools you need to create the ultimate visitor experience. Shop visitors Understand what your visitors walk past, where they stop, what they show an interest in and if they make any purchases or not. Mall visitors Understand how the visitors perceive the mall, how many shops they visit, how much time they spend in your premises and which areas they frequent the most. Understand why your visitors come to you Once you understand what people do in your shop/mall, you have all the tools you need to create the ultimate visitor experience. Understand what your visitors walk past, where they stop, what they show an interest in and if they make any purchases or not. Understand how the visitors perceive the mall, how many shops they visit, how much time they spend in your premises and which areas they frequent the most. Lower cost, guaranteed Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other in the industry. Costs drop by at least 59% With Indivd, you lower you costs by at least SEK 5,400 per year . And, you are likely to save even more than that. Alla andra 9229 kr/r Indivd 3770 kr/r At least 59% lower cost per yr With Indivd, you lower your costs by at least SEK 5,400 per year . And, you are likely to save even more than that. Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other people counter on the market. Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other in the industry. Costs drop by at least 59% With Indivd, you lower you costs by at least SEK 5,400 per year . And, you are likely to save even more than that. At least 59% lower cost per yr With Indivd, you lower your costs by at least SEK 5,400 per year . And, you are likely to save even more than that. Thanks to groundbreaking research, we have been able to develop a people counter far more cost-effective than any other people counter on the market. PROFESSIONAL SERVICES We are with you. All the way. Our all-in-one solutions help you get started very quickly. We help you utilise the insights to reach your goals. Upgrade Indivd's people counter If you already have a people counter, then we are more than happy to assist you with any contract matters. Optimal positioning We help you find the best position and ensure the most cost-effective solution while also reaching your goals. Installation and operation Our engineers support you all the way and make sure your locations are connected in a safe way. Training We will help you to get started and begin deriving value from all the insights you gather. We are with you. All the way. Our all-in-one solutions help you get started very quickly. We help you utilise the insights to reach your goals. Upgrade Indivd's people counter If you already have a people counter, then we are more than happy to assist you with any contract matters. We help you find the best position and ensure the most cost-effective solution while also reaching your goals. Our engineers support you all the way and make sure your locations are connected in a safe way. We will help you to get started and begin deriving value from all the insights you gather. The market's safest people counter Anonymisation Indivd's people counting is based on a patented anonymisation method, meaning it's impossible to detect the identity of people. Assessed & approved Indivd is designed based on Data Protection by Design, and is the first people counter to be approved by a European data protection authority. High IT security Indivd always aimed for ISO level for system's integrity, accessibility, security, durability, persistence, and including during our ongoing system tests. The market's safest people counter Indivd's people counting is based on a patented anonymisation method, meaning it's impossible to detect the identity of people. Indivd is designed based on Data Protection by Design, and is the first people counter to be approved by a European data protection authority. Indivd always aimed for ISO level for system's integrity, accessibility, security, durability, persistence, and including during our ongoing system tests. Experience the difference the market's most reliable people counter brings Experience the difference the market's most reliable people counter brings"
  ]
}