{
  "company": "www.ariadnext.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "All our news 08/09/2021 ARIADNEXT announces the launch of YRIS, its new digital identity application accessible through France Connect Rennes France, September 7, 2021 – ARIADNEXT will launch YRIS, its new digital identity application – available by the end of 2021 – during the International Cybersecurity Forum ( FIC ) which will take place from 7 to 9 September 2021 in Lille, France. The YRIS App meets with European regulations (eIDAS, RGPD) and is expecting a substantial level of identity certification by the ANSSI according to the new PVID standard. ARIADNEXT carries out Europe's ambition to create and offer a single, reliable and secure digital identity to its citizens and residents, thus demonstrating its unique position on the European digital identity market. Towards a European Digital Identity with YRIS In a press release dated from June 3rd, 2021, the European Commission announced that it \" proposed a framework for a European Digital Identity which will be available to all EU citizens, residents, and businesses in the EU \". According to the text, \" They will be able to access online services with their national digital identification, which will be recognised throughout Europe .\" ARIADNEXT developed the YRIS mobile app to meet the Commission's ambitions: create and use a digital ID accessible to all european citizens , allow a reliable identification with all public and private online services, guarantee security by eIDAS certification and compliance with both the requirements of the ANSSI PVID reference framework and the new ETSI TS 119 461 standard for the issuance of a substantial level of identity (currently being evaluated). \" The Commission's recent announcements changed the stakes about digital identity in Europe after most national projects were too modestly deployed. It is time to consider the creation of transnational digital identity providers carrying values of security and privacy protection for European citizens. To demonstrate our European commitment, YRIS answers the EU's wish to offer a simple digital identity accessible to all, without any residence constraint and offering everyone the possibility of using the services of the country in which they are located. Our application is currently being evaluated. Once certified, YRIS will, among other things, meet the requirements of the 5th Directive as a self-sufficient measure ,\" explains Marc Norlain, CEO of ARIADNEXT. Yris application d'identité numérique YRIS: the Digital Identity on Mobile In France, YRIS app will be referenced through France Connect and accessible to anyone with a smartphone . Identification will be possible on all service partners in complete security and without any risk of fraud. How does it work? Creating a verified digital identity is simple and easy. The user downloads the app, enters his/her mobile number and sets a unique PIN code. Then he/she proves his/her identity through a hybrid verification with an ID document and a video of his/her face. In less than 5 minutes, the user gets a verified (substantial) digital identity and can easily log on to partner sites by simply typing their unique PIN code on their smartphone each login request. YRIS: mobile app for a reliable identification with all public and private online services If you wish to exchange with Marc Norlain CEO of ARIADNEXT during FIC or get more information, please contact us: Press Contact ariadnext@lagencerp.com Justine Boiramier – 06 50 31 86 24 Camille Bernisson – 07 64 44 14 49 ARIADNEXT announces the launch of YRIS, its new digital identity application accessible through France Connect Rennes France, September 7, 2021 – ARIADNEXT will launch YRIS, its new digital identity application – available by the end of 2021 – during the International Cybersecurity Forum ( FIC ) which will take place from 7 to 9 September 2021 in Lille, France. The YRIS App meets with European regulations (eIDAS, RGPD) and is expecting a substantial level of identity certification by the ANSSI according to the new PVID standard. ARIADNEXT carries out Europe's ambition to create and offer a single, reliable and secure digital identity to its citizens and residents, thus demonstrating its unique position on the European digital identity market. Towards a European Digital Identity with YRIS In a press release dated from June 3rd, 2021, the European Commission announced that it \" proposed a framework for a European Digital Identity which will be available to all EU citizens, residents, and businesses in the EU \". According to the text, \" They will be able to access online services with their national digital identification, which will be recognised throughout Europe .\" ARIADNEXT developed the YRIS mobile app to meet the Commission's ambitions: create and use a digital ID accessible to all european citizens , allow a reliable identification with all public and private online services, guarantee security by eIDAS certification and compliance with both the requirements of the ANSSI PVID reference framework and the new ETSI TS 119 461 standard for the issuance of a substantial level of identity (currently being evaluated). \" The Commission's recent announcements changed the stakes about digital identity in Europe after most national projects were too modestly deployed. It is time to consider the creation of transnational digital identity providers carrying values of security and privacy protection for European citizens. To demonstrate our European commitment, YRIS answers the EU's wish to offer a simple digital identity accessible to all, without any residence constraint and offering everyone the possibility of using the services of the country in which they are located. Our application is currently being evaluated. Once certified, YRIS will, among other things, meet the requirements of the 5th Directive as a self-sufficient measure ,\" explains Marc Norlain, CEO of ARIADNEXT. Yris application d'identité numérique YRIS: the Digital Identity on Mobile In France, YRIS app will be referenced through France Connect and accessible to anyone with a smartphone . Identification will be possible on all service partners in complete security and without any risk of fraud. How does it work? Creating a verified digital identity is simple and easy. The user downloads the app, enters his/her mobile number and sets a unique PIN code. Then he/she proves his/her identity through a hybrid verification with an ID document and a video of his/her face. In less than 5 minutes, the user gets a verified (substantial) digital identity and can easily log on to partner sites by simply typing their unique PIN code on their smartphone each login request. YRIS: mobile app for a reliable identification with all public and private online services If you wish to exchange with Marc Norlain CEO of ARIADNEXT during FIC or get more information, please contact us: Press Contact ariadnext@lagencerp.com Justine Boiramier – 06 50 31 86 24 Camille Bernisson – 07 64 44 14 49",
    "Digital identity solutions are our business ARIADNEXT conceives solutions for digital identity, identity control, document security and digital signatures Instantly check your customers' identity and credentials Find out more Roll out an innovative and mobile substantial or high-level digital identity solution Find out more Make the signature of your contracts and legal documents easy Find out more Secure your document in a cost-effective way using a 2D-DOC Visible Digital Seal. Find out more Discover our book Digital identity solutions are our business ARIADNEXT conceives solutions for digital identity, identity control, document security and digital signatures Roll out an innovative and mobile substantial or high-level digital identity solution Make the signature of your contracts and legal documents easy Secure your document in a cost-effective way using a 2D-DOC Visible Digital Seal. ARIADNEXT develops the best digital solutions for customer onboarding We support you in the digitalisation, security and optimisation of your processes, all while responding to major societal issues. Instant trust with all your users Compliance with regulations Automated fraud detection Reduced acquisition costs Unique & innovative services ARIADNEXT develops the best digital solutions for customer onboarding We support you in the digitalisation, security and optimisation of your processes, all while responding to major societal issues. Instant trust with all your users Unique & innovative services Our mission Our mission is to build the trust that can help our economy to grow in a world that is ever-more digital. Trust is our foundation, identity is what we do. Guillaume DESPAGNE & Marc NORLAIN CEO and co-founders of ARIADNEXT Our mission is to build the trust that can help our economy to grow in a world that is ever-more digital. Trust is our foundation, identity is what we do. News Une nouvelle étape vers l'augmentation du niveau de sécurité dans l'industrie de la vérification d'identité : nous… https://t.co/uPdA6D4961 IDnow among first to announce ETSI TS 119 461 certification The new European standard for identity proofing, electronic signatures and trust services, developed in collaboration with regulatory expertise from the private sector Munich, October 6, 2022 – IDnow, a leading European provider for identity proofing, is one of the first companies to receive the ETSI TS 119 461 certification, a new European technical standard for […] Discover IDnow Announces Collaboration with Adobe Document Cloud to Make Digital Signatures Simpler and More Secure IDnow delivers identity verification and authentication for Adobe Acrobat Sign Digital Identity Gateway Munich, September 29, 2022 – IDnow, a leading identity proofing platform provider in Europe, announces a global collaboration with Adobe Document Cloud, the world's leading PDF and e-signature tools solution, to make identify verification for validated signatures simpler and more secure. Legally […] Discover All our news Une nouvelle étape vers l'augmentation du niveau de sécurité dans l'industrie de la vérification d'identité : nous… https://t.co/uPdA6D4961 IDnow among first to announce ETSI TS 119 461 certification The new European standard for identity proofing, electronic signatures and trust services, developed in collaboration with regulatory expertise from the private sector Munich, October 6, 2022 – IDnow, a leading European provider for identity proofing, is one of the first companies to receive the ETSI TS 119 461 certification, a new European technical standard for […] Discover IDnow among first to announce ETSI TS 119 461 certification The new European standard for identity proofing, electronic signatures and trust services, developed in collaboration with regulatory expertise from the private sector Munich, October 6, 2022 – IDnow, a leading European provider for identity proofing, is one of the first companies to receive the ETSI TS 119 461 certification, a new European technical standard for […] IDnow Announces Collaboration with Adobe Document Cloud to Make Digital Signatures Simpler and More Secure IDnow delivers identity verification and authentication for Adobe Acrobat Sign Digital Identity Gateway Munich, September 29, 2022 – IDnow, a leading identity proofing platform provider in Europe, announces a global collaboration with Adobe Document Cloud, the world's leading PDF and e-signature tools solution, to make identify verification for validated signatures simpler and more secure. Legally […] Discover IDnow Announces Collaboration with Adobe Document Cloud to Make Digital Signatures Simpler and More Secure IDnow delivers identity verification and authentication for Adobe Acrobat Sign Digital Identity Gateway Munich, September 29, 2022 – IDnow, a leading identity proofing platform provider in Europe, announces a global collaboration with Adobe Document Cloud, the world's leading PDF and e-signature tools solution, to make identify verification for validated signatures simpler and more secure. Legally […] Do you have a question? Do you need something? Interested in testing our solutions? Contact us!"
  ]
}