{
  "company": "www.fmetadata.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 19,
    "-1": 4
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 23
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 19
    }
  },
  "sample_docs": [
    "Wisdom canteen 丨 full treasure face recognition solution .. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware and software development. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware >> Product >> Customized Service >> Case >> About us >> Video >> News >> Contact Us Tel : 0086 755 2814 0239 E-mail : vip@fmetadata.com Office Add : Longhorn Hi-tech Park, Dalang, Longhua, Shenzhen, China Better Touch Better Business Better Touch Better Business Contact Sales at Fdata. Contact Sales at Fdata. +86 755 2814 0239 +86 755 2814 0239 Copyright Copyright",
    "When rich, intelligent terminal using 3 d face recognition system 丨 face recognition application in the tank .. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware and software development. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware >> Product >> Customized Service >> Case >> About us >> Video >> News >> Contact Us Tel : 0086 755 2814 0239 E-mail : vip@fmetadata.com Office Add : Longhorn Hi-tech Park, Dalang, Longhua, Shenzhen, China Better Touch Better Business Better Touch Better Business Contact Sales at Fdata. Contact Sales at Fdata. +86 755 2814 0239 +86 755 2814 0239 Copyright Copyright",
    "AI - Page Sitemap wifi-supportive facial recognition scanner high-quality for retail shops wifi-supportive facial recognition scanner high-quality for retail shops You image, We create! Phone size becomes bigger and bigger, TV size becomes bigger and bigger, then how about your MPOS? Since the cost of EMV and PCI certification are getting so high. Here comes our solution: MPOS +Tablet solution. Suitable size, not too big, not too small. 7 inch Tablet with ingenico MPOS Solution Based on Android platform, high-end Qualcomm chipset with 4 in 1 function that supports 3G/4G/WIFI/ BT/ GPS. Development based on Android 7.0 OS Use professional security payment chip Support CUP safety certification EMV LV1 &LV2 ensure payment security Support all payment channels Wifi version with removable battery For example, we also can add printer function inside, then will like this model P705 R, it also integrated the NFC function, with removable battery, working time last around 10H So you image , we create, if you have interest in such kind of combination, contact please! .. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware and software development. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware >> Product >> Customized Service >> Case >> About us >> Video >> News >> Contact Us Tel : 0086 755 2814 0239 E-mail : vip@fmetadata.com Office Add : Longhorn Hi-tech Park, Dalang, Longhua, Shenzhen, China Better Touch Better Business Better Touch Better Business Contact Sales at Fdata. Contact Sales at Fdata. +86 755 2814 0239 +86 755 2814 0239 Copyright Copyright",
    "wifi-supportive mobile pos machine energy-saving best tablet solution Fdata wifi-supportive mobile pos machine energy-saving best tablet solution Fdata Application Scope Fdata's android handheld pos terminal is widely used in many industries.According to different needs of customers, Fdata is capable of providing reasonable, comprehensive and optimal solutions for customers. F803 Product F803 with gateway and access control system is applicable to residential district, school, hotel, scenery spot, transportation junction and other public infrastructure. The product uses industrial grade binocular camera and live detection technique. It is a high-performance and reliable product, supporting various peripherals like fingerprint device. Full angle 8 inches IPS LCD Industrial grade design with waterproof and dustproof function. Stable and reliable. 20000 Face capacity. 1:1 recognition can be 99.7% accurate or above. 1:N recognition can be 96.7% accurate or above (Error rate is under 0.1%). Live detection could be 98.3% accurate or above (Error rate is under 1%). Facial recognition can be finished within 1 second. Binocular wide motion camera; dual fill lights includes LED and infrared light. Powerful quad-core processor, 1.8GHZ. Multiple Peripherals supportable, including NRIC reader, biomini, IC reader, QR reader, etc. Support: system level, APP off-line level, APP+ background network level API docking; document improvement; secondary development. .. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware and software development. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware >> Product >> Customized Service >> Case >> About us >> Video >> News >> Contact Us Tel : 0086 755 2814 0239 E-mail : vip@fmetadata.com Office Add : Longhorn Hi-tech Park, Dalang, Longhua, Shenzhen, China Better Touch Better Business Better Touch Better Business Contact Sales at Fdata. Contact Sales at Fdata. +86 755 2814 0239 +86 755 2814 0239 Copyright Copyright",
    "wholesale product information kiosk series for restaurant Product Comparison Well-chosen in material, fine in workmanship, excellent in quality and favorable in price, Fdata's pos terminal machine is highly competitive in the domestic and foreign markets.Compared with similar products, Fdata's pos terminal machine is more advantageous in the following aspects. Product Details We are confident about the exquisite details of pos terminal manufacturer.Fdata provides diversified choices for customers. pos terminal manufacturer is available in a wide range of types and styles, in good quality and in reasonable price. P1003 Android based 10.1 inch self-ordering kiosk with barcode reader and built in printer Support OEM and ODM The display can be adjusted to vertical or landscape version With the front camera also can do the facial recognition. Rich interface can connect with the barcode reader, cashbox… Built in printer with the paper size of 58MM Metal texture with elegant design, different color available to be customized. .. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware and software development. Fdata Co., Ltd. is a High-tech company specialized in fintech POS hardware >> Product >> Customized Service >> Case >> About us >> Video >> News >> Contact Us Tel : 0086 755 2814 0239 E-mail : vip@fmetadata.com Office Add : Longhorn Hi-tech Park, Dalang, Longhua, Shenzhen, China Better Touch Better Business Better Touch Better Business Contact Sales at Fdata. Contact Sales at Fdata. +86 755 2814 0239 +86 755 2814 0239 Copyright Copyright"
  ]
}