{
  "company": "www.matrixaccesscontrol.com",
  "dominant_topics": [
    1,
    0,
    3,
    6
  ],
  "topic_counts": {
    "1": 53,
    "0": 29,
    "3": 1,
    "6": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "3": "vantage, development, document, ai, prioxis",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.0833333333333333,
    "framing_surveillance": 0.0694444444444444,
    "framing_market": 0.8472222222222222,
    "num_docs": 84
  },
  "topic_timeline": {
    "20": {
      "0": 29,
      "1": 53,
      "3": 1,
      "6": 1
    }
  },
  "sample_docs": [
    "Industries Specific Access Control and Time-Attendance Today's security threats have become more subtle and pervasive. No two industries have identical attendance and access control requirement. Irrespective of your organization's industry, locations, size, layouts, and timings, Matrix Access Control system for business is designed to meet security needs. Matrix COSEC is a comprehensive People Mobility Management solution for Manufacturing, BFSI, Construction, Healthcare, Government, Education, Hospitality, IT, and Transportation. Matrix is one of the very few indigenous companies which is competent in providing complete solution including both hardware and software solutions. Matrix has a wide range of software solutions including Time-Attendance system for business, Access Control for large and small enterprises, Visitor Management, Employee Self Service, Cafeteria Management, Job Processing and Costing, Contract Workers Management, and Field Visit Management. Matrix COSEC hardware solution consists of multiple families of door controllers, readers, and accessories. COSEC hardware solution supports various credentials in the form of RFID Card, Fingerprint, Palm Vein Reader, Face Recognition, and Multispectral Fingerprint. Furthermore, Matrix COSEC can also be integrated with third party hardware and software solutions to meet specific requirements of customers. Best Security Solutions Around! Job Processing and Costing IT and Call Centers Matrix COSEC VYOM – Cloud based People Mobility Solutions COSEC APTA – Mobile Application COSEC SAMAY – Time-Attendance Software for SOHO",
    "Manufacturing is the segment where huge investments are involved be it machinery, raw materials, assembly floor or manpower. Security, safety of assets and employees as well as time management of staff with proper shifts, overtime and timely salary are always vital for any organization in the manufacturing industry. Matrix COSEC advanced security solutions is a range of intelligently designed products to meet all critical requirements of the manufacturing sector. Matrix offers complete security solutions for the manufacturing sector having assembly plant, warehouse, dispatch section, repairing centre and quality control. It's combined security products Access Control, Time-Attendance, Palm Vein Reader and Video Surveillance is a complete solution for protecting people and assets and increases productivity of the organization. Increased Security of Physical Assets and Manpower Prompt Responses on Casualties Increase in Productivity and Minimized Overpayments Easy Interpretation and Decision Making Managing Attendance during Overnight Shifts Most manufacturing industries work in multiple shifts, including overnight shifts. Due to the nature of their job, many times employees have to stay overtime or work continuous shifts. Managing shifts manually leads to a lot of manual work, resulting in errors, improper communication and chaos. Using Matrix advance Shift Management, HR can assign monthly shifts in a simple manner and repeat schedules automatically. They can use features such as auto shift correction, shift schedule on SMS, overtime calculation, tracking available employees, etc. Monitoring Patrolling of Security Guard at Night Time For manufacturing units, it is very common to have security guard for patrolling at night. There is no guarantee that he remains awake and agile throughout the night and actually monitors the premises. It may also be the case where someone enters the premises after harming the guard. To overcome this issue, Matrix Access control solution has Guard Tour feature, which ensures the guard punches at pre-defined time. If he fails to punch, an alarm is generated and the authorized person receives an SMS on his mobile for immediate action. Securing Finished Goods and Raw Materials A manufacturing organization always keeps expensive machinery, raw materials, finished goods and other assets. Security of such materials should not be compromised. With Matrix advanced Access Control solutions, manufacturing can create access zones and multi-layer access control for such areas. They can use features such as access of users only if a specific person's punch is registered, capturing a photo with punch, instant notification on access rule violation, time based access for certain people, etc. Avoid Long Queues for Punching with Faster Response Time Most manufacturing organizations work multiple shifts. Due to poor response time of the attendance device, employees have to stand in a long queue for attendance marking during shift timings. With server based identification feature and high quality optical sensor in COSEC device, users can mark their attendance accurately in less than one second without investing in multiple devices. This will drastically reduce overall punching time and in turn increase employee satisfaction and organizational efficiency. The issue of long queues can be avoided through automatic attendance marking using GPS/Wi-Fi, as the user enters/exits the pre-defined area stored in COSEC server, with the help of mobile based application- COSEC APTA. Synergizing Multiple Systems into One Solution The admin has multiple vendors for different solutions and all work independently. However, they are looking for an integrated solution to reduce complexity and enhance ease of use. To ensure better control on the solution, Matrix offers integrated solution of Access Control and Time-Attendance with Video Surveillance, PBX system, and Fire Alarm system to cater the applications of capturing user photo when he/she punches, and sending user photo when he/she tries to enter in unauthorized area, automatically opening doors during emergency in case of fire, opening door using phone, etc. People Mobility Solution for Manufacturing Best Security Solutions Around! Job Processing and Costing IT and Call Centers Matrix COSEC VYOM – Cloud based People Mobility Solutions COSEC APTA – Mobile Application COSEC SAMAY – Time-Attendance Software for SOHO",
    "COSEC - PEOPLE MOBILITY SOLUTIONS Job Processing and Costing Palm Vein Door Controller Multispectral Fingerprint Door Controller We have installed MATRIX COSEC solution for our Time-Attendance and Access Control needs from M/s. The Advanced Communication Systems & Sevices, Hyderabad. We are happy with the functions, features, reliability and overall performance of the solution. Dr. Reddy's Foundation, Hyderabad We are using MATRIX COSEC solution since last six months. We are extremely happy with the functions, features and reliability of the solution. We would gladly recommend MATRIX COSEC solution to any prospective user. Sterling and Wilson Limited, Mumbai We are using MATRIX COSEC solution since last twelve months. The performance of MATRIX COSEC solution is flawless and we recommend it to others due to its rich functionality and prompt service support rendered by M/s The Advanced Communication Systems & Services, Hyderabad. KNR Constructions Limited, Hyderabad We have installed MATRIX COSEC solution supplied by Team Telesystems. The reliability and overall performance of the solution is unique and the services offered are commendable. Credo Brands Marketing Pvt. Ltd., Mumbai Adani Enterprises Trusted Matrix Access Control and Time-Attendance Solutions for Their Multi Located Ports and Busness Units Read more Shriram Transport Finance Company Trusts Matrix Time-Attendance and Access Control Solutions to Efficiently Manage their Read more Matrix Time-Attendance Solution for Sterling and Wilson Read more Burger King Enhanced Productivity and Reduced Operating Costs Using Matrix Centralized Time-Attendance Solution in 70+ Outlets Read more Matrix has joined Hands with Payroll Software Company Technology Partner GREYTIP Matrix COSEC ARGO bags the coveted India Design Mark Award 2019 Best Security Solutions Around! Job Processing and Costing IT and Call Centers Matrix COSEC VYOM – Cloud based People Mobility Solutions COSEC APTA – Mobile Application COSEC SAMAY – Time-Attendance Software for SOHO",
    "The Call Centre industry is flourishing in this century, with the manpower working 24*7 in different shifts and time schedule. Most of the employees are desk bound and perform their daily work on computers. It is a colossal task for the floor manager to manage time-attendance along with break timings of all the employees. Access restriction to certain areas and real-time monitoring are also essential for higher security and smooth functioning of Call Centres. Matrix COSEC solutions are a range of intelligently designed products to meet all the critical requirements of the Call Centre industry. Matrix supports the Call Centre segment to meet their demand of access control, time-attendance, cafeteria management, roster management, employee self-service and video surveillance. Thus, shift supervisor or floor manager can monitor and record attendance, break timings and leave records of his/her team. Increases Discipline and Morale Easy Interpretation and Decision Making Secured Assets and Manpower Get Error Free Net Working Hours Data IT enterprises are generally flexible with working hours. Matrix Time-Attendance allows configuring flexible timing whereby it checks only total working hours during the month, irrespective of the shift timings. At the same time, it also allows creating user-wise timings and overnight shifts for other users. Enhance Security of Server Room For IT Companies and Call Centres, server room is their main asset. They store large amount of private data for their customers. Security of this data should not be entrusted to any single individual or single layer security. Matrix, with cutting edge Access Control features will give access only after certain access rules' verification and send immediate notifications to the admin in case of a security breach. Matrix offers features such as photo capture when user punches, access based on multiple credentials, time based access, allow access with two authorized persons, alarm in case of door is open for long time, etc. Improve Employee Satisfaction with Attendance and Leave Portal Matrix Employee Self Service portal allows each employee to login into the software and check their attendance and leave details. They can directly apply for leave and their reporting officer can approve or reject it from the same portal. This complete solution reduces large amount of employee's productive time spent after such administrative tasks. Save HR Time by Automated Attendance Process and Payroll Integration Matrix Time-Attendance is a fully integrated solution. Using various integration methods such as Database to Database, Application Programming Interface (API) and offline export, accurate attendance data can be sent to any payroll software such as SAP, ERP, Tally or any Third Party payroll system without manual intervention. This automated process saves lots of time and reduce payroll errors, which leads to timely salary payments to all employees. Matrix People Mobility Solution for IT and BPO Real Image Media Technologies (P) Ltd Best Security Solutions Around! Job Processing and Costing IT and Call Centers Matrix COSEC VYOM – Cloud based People Mobility Solutions COSEC APTA – Mobile Application COSEC SAMAY – Time-Attendance Software for SOHO",
    "Retail industry has evolved tremendously over the past few years. Frequent employee turnover, security of warehouse and staff shuffling makes security and time-attendance management more challenging. Matrix offers its comprehensive and tailored security solution to cater the needs of Retail segment. By providing its cohesive security solutions for both inside and outside of operational areas, Matrix ensures complete attention for retail outlets. Matrix People Mobility solution facilitates advanced features that have been incorporated in the Access Control, which offers solution for a single door through to an integrated solution that enhances security for a network of branches, corporate headquarters and warehouses to meet complex requirements of the organization. Centralized Monitoring, Shift Management, Payroll Integration, PBX System and Video Surveillance Integration with Access Control ensure that the problems are dissolved. Easy and Fast Decision Making Timely and Accurate Employee Salary Proper Shift Scheduling of Staff Roles and Rights Restricted to each Outlet Give Best Shopping Experience to Customers Retail industry works on fixed timings and during this time they want to provide the best shopping experience to customers against prevailing competitions. Absenteeism and irregularities of the staff may dilute their image and sometimes incur loss in the business. With Matrix Time-Attendance policies like Late-In, Early-Out, Grace Time, Break Management, Shift and Scheduling, Leave Management, Overtime and Compensatory Off, organizations can capture accurate attendance data and take early actions if some glitches occur. Secure Warehouse and IT Rooms Warehouse section is one area where expensive products and materials are kept. Such items should not be left sans proper security measures. Matrix Access Control solution will give access to authorized person only after the credentials and access rules of the respective user match. Upon any access rule violation, store manager will get immediate notification to prevent major loss or any mishap. Centralized Planning and Control of Working Hours-Holidays-Leaves Retail chains of Food, Electronic Stores, Departmental Stores, Medical Stores, Apparels and Fashion, Books, Jewelers, Auto-showrooms, etc. operate through multiple units spread across countries, regions or states. Each country/state has its own local/regional laws, timings, festivals and holidays. HR/Admin personnel at the Head Office need to define and monitor organization-wise timings and leave polices to ensure balance between legal compliance, organization's productivity and employee satisfaction. It requires tremendous efforts in planning, communication and monitoring of time-attendance policies. Matrix COSEC Time-Attendance solution encompasses 32 regional diversities with different timings, festivals and holiday schedules. Furthermore, Matrix offers centralized control and monitoring of Time-Attendance and Access Control of multiple employees spread across multiple locations. Employee Satisfaction on Accurate Salary Reception on Time Matrix Time-Attendance is a fully integrated solution. Using various integration methods such as Database to Database, Application Programming Interface (API), and Offline Export, accurate attendance data can be sent to any payroll software such as SAP, ERP, Tally or any Third Party payroll system without any manual intervention. This automated process saves a lot of time and reduces payroll errors. Keep Employee Conduct in Check Retail businesses have threat from both internal as well as external sources. To eliminate the threat from internal sources, integration between Video Surveillance and Access Control solutions can be adapted. This will enhance security at the retail establishment as well as keep the employees under a check. People Mobility Solution for Retail Best Security Solutions Around! Job Processing and Costing IT and Call Centers Matrix COSEC VYOM – Cloud based People Mobility Solutions COSEC APTA – Mobile Application COSEC SAMAY – Time-Attendance Software for SOHO"
  ]
}