{
  "company": "www.parsons.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 1
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "-1": 1
    }
  },
  "sample_docs": [
    "Transformation To The Power Of X Traditional solutions only take you so far – X takes you farther. We're accelerating the world's digital transformation by unifying our services, streamlining our delivery model, and reinforcing the data-driven focus that has fueled our innovation for decades. Parsons X enhances our decades of digital leadership by bringing together innovation from across the company, providing our customers and clients with fast, secure, practical digital solutions that meet their toughest challenges across critical infrastructure and national security. Want to change your world? Here are just a few of our capabilities: Complex Design Capabilities Via iTwin Technology As the design lead for the 183N Mobility project in Texas, we are implementing iTwin technology to meet the owner's extensive 3D deliverable requirements which includes the development of roadway models, bridge models, existing and proposed utilities, and drainage models. 3DOB: Internal R&D To Geospatial Product Our team developed PeARLâ\"¢ Flash, a multi-user, enterprise-level image processing capability for 3D model generation from imagery data. Post-mission, PeARL® Flash processes airborne frame imagery, Wide Area Motion Imagery (WAMI), and Full Motion Video (FMV) data into 3D models. America's Next Top Bridge Model As part of the Brooklyn-Queens Expressway design project, NYCDOT requested that a full 3D BIM model be developed of the existing corridor to help optimize multidisciplinary coordination among the project team, improve accuracy in cost estimation, better assess constructability, act as a tool for clash detection, and develop the preliminary and final designs for the project. AI Guided Spectrum Operations From autonomous vehicles to autonomous markets, it's becoming increasingly clear that solutions consisting of autonomous artificially intelligent (AI) agents are changing the way we get things done. Due to continuing advances in the field of machine learning (ML) and AI, computer systems can now \"discover†hidden insights within data, exposing hidden relationships and conclusions normally obscured by the complexity and enormity of the available data. Strengthening Cyber Protections For Airports And Airlines We're aviation and cyber experts – does your airport need a cyber update? What do you need to know about the latest cyber mandates from TSA? Built Infrastructure – whether a military base or a bridge – is our user interface to the planet. Our mission is to upgrade that interface – securing and improving the infrastructure that is critical to our future in a sustainable way.†How do we do it? With state-of-the-art cyber solutions. By federating data. Leveraging artificial intelligence, machine learning, digital twins, and so much more. Technology Is In Our DNA Contact us to about how we can take your next project to the power of X."
  ]
}