{
  "company": "www.collinsaerospace.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 8,
    "0": 5
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.9625,
    "framing_surveillance": 0.01875,
    "framing_market": 0.01875,
    "num_docs": 13
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 5
    }
  },
  "sample_docs": [
    "Ethics, Compliance and Public Policy Ethics and Compliance Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California Transparency in Supply Chains Act California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. United Kingdom Modern Slavery Act Statement This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement REACH Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Green Products program Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. EH&S policy Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety Supplier policy At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers Accessibility for Ontarians with Disabilities (AODA) The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer feedback form Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan Ethics, Compliance and Public Policy Ethics, Compliance and Public Policy Ethics and Compliance Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California Transparency in Supply Chains Act California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. United Kingdom Modern Slavery Act Statement This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement REACH Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Green Products program Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. EH&S policy Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety Supplier policy At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers Accessibility for Ontarians with Disabilities (AODA) The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer feedback form Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan Ethics and Compliance Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California Transparency in Supply Chains Act California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. California Transparency in Supply Chains Act California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. United Kingdom Modern Slavery Act Statement This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement United Kingdom Modern Slavery Act Statement This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement REACH Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Green Products program Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. EH&S policy Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety Supplier policy At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers Accessibility for Ontarians with Disabilities (AODA) The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer feedback form Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan",
    "The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. Trust Respect Accountability Collaboration Innovation We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share. The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. Trust Respect Accountability Collaboration Innovation The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share. We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share.",
    "The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. Safety Trust Respect Accountability Collaboration Innovation We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share. The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. Safety Trust Respect Accountability Collaboration Innovation The work we do to help shape the future of aviation and defense may be complex, but the values that unite us as a company are not. Simply put, our values reflect who we are and what we commit to – as individuals and as part of a larger, Collins Aerospace and Raytheon Technologies culture. We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share. We trust each other to do the right thing and to keep our word. We welcome and respect each other's backgrounds and perspectives. We hold each other accountable. We work together to tackle big challenges. And we bring our creativity and ingenuity forward in a spirit of innovation. These are the values that guide our work and our personal interactions. They are also foundational to our Collins in the Community programs and our principles of Diversity, Equity & Inclusion , and they serve as a throughline for our Ethics, Compliance & Public Policy practice. Our values make us stronger and help us take care of each other, our communities and the skies we share.",
    "Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Request information I would like more information about this capability. Let's connect! Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Virtual pilot training Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Experience to deliver CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. Request information I would like more information about this capability. Let's connect! CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas. Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Game-changing battlespace awareness to achieve air dominance Zero-G HMDS+ provides a fully immersive, high-definition view of the battlespace with near-zero latency, 360-degree awareness around the aircraft. Pilots can make split decisions at high speeds with superior situational awareness and information/data management capabilities to increase lethality, survivability, and mission effectiveness. The system's game-changing binocular lenses are connected to an advanced multicore processor with a higher graphic refresh rate, enhancing battlefield decision-making to defeat threats both in the immediate vicinity and beyond visual range. The system also eliminates the need for traditional night vision goggles by using a more advanced digital night vision camera (DNVC) to light up dark skies, providing the most accurate and detailed optical view of the battlespace. This enhanced view allows pilots to safely perform intricate missions with pinpoint accuracy and use video recordings to assist in debriefings. Request information I would like more information about this capability. Let's connect! I would like more information about this capability. Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Future-ready technology for fighters , fixed-wing aircraft and trainers Zero-G HMDS+ was designed to interface with multiple aircraft using a modular open systems approach (MOSA) and MOSA-standard hardware including the advanced modular processing unit (AMPU) to enable fast and seamless integration with technology of tomorrow that ensures pilots are successful in the connected battlespace. Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Created by pilots for pilots Designed for comfort and well-being, Zero-G is ultra-lightweight and perfectly balanced to significantly reduce pilot fatigue and enhance performance during longer, more demanding missions. The Zero-G HMDS+ is the latest product partnership from Collins Elbit Vision Systems (CEVS). Virtual pilot training Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Zero-G enables training with augmented reality, allowing pilots to experience a vivid real-world environment with computer-generated battle scenarios for the air and classroom. Experience to deliver CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. CEVS has more than 28 years of proven experience protecting and providing operators with critical information to complete missions and come home safely. Our Zero-G HMDS+ can be upgraded at the speed of relevance, positioning it to be the solution of choice for pilots around the world. Request information I would like more information about this capability. Let's connect! I would like more information about this capability. CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) CEVS in the news U.S. Navy awards RTX and Elbit Systems of America a $16 million contract for improved F/A-18 pilot helmet mounted display system (Defence Procurement, Sept. 2023) CEVS Launches Zero-G HMDS+ in Addressing US Navy's Helmet-Mounted Cueing System Development Contract (European Security and Defence, Sept. 2023) Collins Elbit Vision System launches Zero-G HDMS+ adaptable to 4th and 6th generation fighters (Monch, Sept. 2023) Neues Helmdisplay von Collins Elbit Vision Systems (Flug Revue, Sept. 2023) Collins Elbit JV Unveils New-Generation Helmet-Mounted Display System (Aviation Week, Sept. 2023) CEVS wins US Navy contract for F-18 helmet upgrade (FlightGlobal, Sept. 2023) The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas. The Zero-G HMDS+ is provided by Collins Elbit Vision Systems, LLC, a joint venture between Collins Aerospace and Elbit Systems Ltd. of Israel, through its U.S. subsidiary Elbit Systems of America, of Fort Worth, Texas.",
    "Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We work in a complex and dynamic global business environment that's full of unique challenges and high expectations. And we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer feedback form Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We work in a complex and dynamic global business environment that's full of unique challenges and high expectations. And we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We work in a complex and dynamic global business environment that's full of unique challenges and high expectations. And we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer feedback form Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan Collins Aerospace is committed to maintaining the highest ethical standards and business practices. Doing things the right way, every day – even when it's hard and no one is looking – is at the core of what we do. We take great pride in our strength of character and place ethics and integrity above all else. Raytheon Technologies' (RTX) Code of Conduct (\"The Code\") is an integral part of our culture, is an expression of our fundamental values, and represents an ethical framework for our decision-making and business activities. We expect our employees and business partners to act in a manner consistent with the values and standards set forth in The Code. At Collins Aerospace, we work in a complex and dynamic global business environment that's full of unique challenges and high expectations, and we understand that every employee is united by our core set of values and the commitments we've made to our stakeholders – our customers, competitors, suppliers, shareowners and the communities in which we operate. The way we conduct ourselves throughout the world matters. Visit RTX's Ethics & Compliance site to gain a better understanding of our program and Code of Conduct. California law requires RTX Business Units to disclose their activities regarding monitoring supply chains to prevent human trafficking and slavery. for this disclosure. This is a statement made pursuant to section 54(1) of the Modern Slavery Act 2015. The statement sets out the steps the Collins Aerospace group, through all of its operating companies in the United Kingdom (as listed below), has taken during the financial year ending 30 December 2020 (the \"Reporting Period\") to ensure slavery and human trafficking is not taking place in any part of its own business, or supply chain. View our UK modern slavery act statement Collins Aerospace continues to invest in reducing waste products and eliminating toxic products in all of our manufacturing facilities as well as when we collaborate and work with customers, suppliers and partners. We are committed to meeting the European REACH Regulations which mandate that we communicate information on specific substances used in our products. The information in the Safe Use Instructions below detail these requirements. about REACH and download documents Collins Aerospace is committed to providing our customers with safe and environmentally friendly products that are compliant with all relevant regulations and customer specifications. We assure the Materials of Concern (MOC) used in and on our products are evaluated against all aerospace available alternatives. Compliance to all applicable regulations as well as safety of use for downstream users is our highest priority. To , visit our Green Products Program page. Collins Aerospace is committed to being a leader in Environment, Health and Safety (EH&S) by protecting the health and safety of its employees, its neighbors, its contractors and the natural environment. We will comply with all applicable laws and regulations and will not hesitate to go beyond legal requirements if a higher level of performance is in order. EH&S performance is valued along with all business considerations (e.g., quality, customer satisfaction and cost). We are committed to providing safe working conditions by eliminating hazards and reducing EH&S risks. We will engage our employees to ensure participation in the reduction of EH&S risks at our operations. Business unit and operations management, assisted by EH&S professionals, is responsible for identifying and attaining goals that result in continual improvement of our compliance, employee safety and pollution prevention performance. Each employee is responsible for improving performance, not only by understanding and following established standards and procedures, but also by recommending improved practices where appropriate. We will work with our suppliers, who are expected to meet minimum EH&S requirements, by sharing best practices and offering outreach programs to help improve their EH&S performance. We will also partner with our customers by sharing best practices and, where appropriate, learning from their EH&S achievements. Regulators and other external EH&S customers will be dealt with openly and honestly. Collins Aerospace will strive to meet all of its commitments, perform well on audits, and provide excellent customer satisfaction. We will be a leader in EH&S performance. This policy will be made available to the public upon request. at https://www.rtx.com/social-impact/environment-health-and-safety/environment-health-safety At Collins Aerospace, ensuring a robust and resilient supply chain allows us to meet customer needs and continue safely moving people around the world. Our suppliers are vital to our success and we will continue to find new ways grow and develop our supply chain. at https://www.rtx.com/suppliers The Accessibility for Ontarians with Disabilities Act (AODA) became law in 2005 with the stated purpose of \"recognizing the history of discrimination against persons with disabilities in Ontario\" and to \"achieve accessibility in goods, services, facilities, accommodation, employment, buildings, structures and premises.\" Collins Aerospace is committed to treating all people in a way that allows them to maintain their dignity and independence. We support integration and equal opportunity for all people. Collins is committed to meeting the needs of people with disabilities in a timely manner, and will do so by preventing and removing barriers to accessibility and meeting accessibility requirements under the Accessibility for Ontarians with Disabilities Act. Customer Service Policy - Providing Goods and Services to People with Disabilities Integrated Accessibility Standards AODA - Canada Integrated Accessibility Standards - Multi-year action plan"
  ]
}