{
  "company": "www.bioid.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 14,
    "0": 7
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4042553191489361,
    "framing_surveillance": 0.0212765957446808,
    "framing_market": 0.574468085106383,
    "num_docs": 21
  },
  "topic_timeline": {
    "20": {
      "-1": 14,
      "0": 7
    }
  },
  "sample_docs": [
    "BioID is a revolutionary biometric technology that uses face, voice and lip movement to identify a person. BioID solutions represent an advanced, people-oriented solution: with BioID, instead of typing in a password or using a PIN, the user simply looks into a standard video camera and says his or her name to get authenticated. True multimodality: The ability to analyze three biometric features — face, voice and lip movement simultaneously; Low-cost implementation: Requires only a standard USB camera and microphone; Easy of use and unobtrusive recognition: Users simply look into the camera and say, for example, their name. To protect information on laptop computers, transfered over corporate networks, e-commerce transactions and to provide physical access control. BioID technology provides the basis for many biometric security products and solutions, either existing or under development. Access security for data and programs, in corporate networks, PCs, and laptops; Safeguarding remote access to corporate networks; Safeguarding internet applications such as eMail, e-commerce, and distance learning. And in the following areas: Physical access security to rooms and buildings; Safeguarding cash-machines and financial transactions; Official or government identification of individuals with electronic ID. Based on the core strengths of the BioID technology: True multimodality: The ability to analyse three biometric traits, face, voice and lip movement simultaneously, Low-cost implementation: Requires only a standard USB camera and microphone Easy to use and unobtrusive recognition: Users simply look into the camera and say, for example their name. Service Pack 2 is now available for the BioID SDK V3.1. For registered users it is highly recommended to download the service pack: BioID Updates BioID Downloads Customer Login Copyright 2009 BioID GmbH webmaster@bioid.com Imprint",
    "BioID offers its biometric authentication technology as a software development kit (SDK) for developers who want to integrate BioID capabilities into their applications. The SDK includes the following advanced biometric recognition techniques, which can be used alone or in combination: Fast and accurate face finding and robust face recognition (facial scan) even with low-cost, low-quality video hardware Speaker recognition using speech enhancement for increased robustness in adverse acoustic conditions Fusion of multiple biometric traits The BioID SDK facilitates rapid and flexible integration of some or all of these technologies within customer-specific applications. BioID's biometric authentication is the answer to higher security and higher convenience needs that cannot be met by traditional authentication methods such as PINs, passwords, or tokens. Therefore, BioID's technology provides an easier and more secure way to link real people with their digital identities, for a wide range of applications. User recognition (verification or identification) User template and authorization management Template storage to database, local PC or smart card Supports BioAPI (and thus BAPI, H-API) Provides special BioID functions via BioID API Technology Introduction to biometrics IP & core technologies Advanced capabilities Advantages Privacy of biometric information BioID SDK SDK Version 3.1 BioAPI IP & core technologies Privacy of biometric information BioID SDK SDK Version 3.1 BioAPI",
    "Many years of market experience, technological expertise, patents and trademarks are the basis for our business. IP & core technologies BioID's highly multidisciplinary team incorporates world leading scientists in multimodal biometrics and world-class experts with many years of industrial and scientific experience in pattern recognition, realtime audio and video signal processing, camera calibration, object tracking, face and iris detection, face, voice, and iris recognition, genetic algorithms, multimodal biometrics and security architectures. The key elements of BioID's intellectual property portfolio are patents, trademarks, and trade secrets. As we are the leading technology company in the field of multimodal biometric authentication, we develop pioneering technology and constantly see plenty of opportunities to file patents for new ideas. BioID's core competencies include a broad variety of different key technologies: Technology Introduction to biometrics IP & core technologies Multimodal biometrics Face finder Face recognition Iris finder Iris recognition Voice recognition Advanced capabilities Advantages Privacy of biometric information BioAPI IP & core technologies Multimodal biometrics Face finder Face recognition Iris finder Iris recognition Voice recognition Privacy of biometric information",
    "BioID's solutions were designed with privacy in mind. Privacy of biometric information From the very beginning, BioID's technology was designed with privacy in mind. Our authentication solutions can be configured to match your application-specific legal requirements and your company's security policy. Your template contains only mathematical representations of your unique face, voice, and iris features. It does not contain any raw images or recordings, and cannot be used to reconstruct the raw images. Depending on the application, the encrypted template can be securely stored in different places: Locally on the device On a SIM card, smart card, or USB token With a trusted third party authentication service The type of information transmitted between your device and an external server depends on where the template is stored and where matching takes place, which varies for different applications. All information transmitted for authentication purposes is encrypted, so that only a system with the decryption key can read it. All information is also digitally signed, providing a time stamp, a way to detect tampering, and can bind the information to a legal identity if the digital signature is issued by a legal entity such as a government or authorized service provider. Technology Introduction to biometrics IP & core technologies Advanced capabilities Advantages Privacy of biometric information BioAPI IP & core technologies Privacy of biometric information",
    "BioID's technology supports the BioAPI: the industry standard for The BioAPI Consortium has developed industry standards for biometric application interfaces. According to their specification, a biometric vendor may be called \"BioAPI compatible\" when he supports a certain subset of the functions specified. To use those BioAPI compliant functions, the vendor has to provide a so called \"Biometric Service Provider\" module, abbreviated BSP. BioID provides a BSP which supports, among others, the following major functions for BioAPI 1.1: Identify (with some restrictions) Technology Introduction to biometrics IP & core technologies Advanced capabilities Advantages Privacy of biometric information BioAPI IP & core technologies Privacy of biometric information"
  ]
}