{
  "company": "www.revealmedia.com",
  "dominant_topics": [
    2,
    0
  ],
  "topic_counts": {
    "2": 34,
    "0": 3
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.5492957746478874,
    "framing_surveillance": 0.3004694835680751,
    "framing_market": 0.1502347417840375,
    "num_docs": 37
  },
  "topic_timeline": {
    "20": {
      "0": 3,
      "2": 34
    }
  },
  "sample_docs": [
    "Reveal Media – Body Worn Video Camera Solutions is committed to protecting your privacy and developing technology that gives you the most powerful and safe online experience. This Statement of Privacy applies to the Reveal Media – Body Worn Video Camera Solutions Web site and governs data collection and usage. By using the Reveal Media – Body Worn Video Camera Solutions website, you consent to the data practices described in this statement. Collection of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects personally identifiable information, such as your e-mail address, name, home or work address or telephone number. Reveal Media – Body Worn Video Camera Solutions also collects anonymous demographic information, which is not unique to you, such as your ZIP code, age, gender, preferences, interests and favorites. There is also information about your computer hardware and software that is automatically collected by Reveal Media – Body Worn Video Camera Solutions. This information can include: your IP address, browser type, domain names, access times and referring Web site addresses. This information is used by Reveal Media UK – Body Worn Video Camera Solutions for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Reveal Media – Body Worn Video Camera Solutions Web site. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Reveal Media – Body Worn Video Camera Solutions public message boards, this information may be collected and used by others. Note: Reveal Media – Body Worn Video Camera Solutions does not read any of your private online communications. Reveal Media – Body Worn Video Camera Solutions encourages you to review the privacy statements of Web sites you choose to link to from Reveal Media – Body Worn Video Camera Solutions so that you can understand how those Web sites collect, use and share your information. Reveal Media – Body Worn Video Camera Solutions is not responsible for the privacy statements or other content on Web sites outside of the Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions family of Web sites. Use of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects and uses your personal information to operate the Reveal Media – Body Worn Video Camera Solutions Web site and deliver the services you have requested. Reveal Media – Body Worn Video Camera Solutions also uses your personally identifiable information to inform you of other products or services available from Reveal Media – Body Worn Video Camera Solutions and its affiliates. Reveal Media – Body Worn Video Camera Solutions may also contact you via surveys to conduct research about your opinion of current services or of potential new services that may be offered. Reveal Media – Body Worn Video Camera Solutions does not sell, rent or lease its customer lists to third parties. Reveal Media – Body Worn Video Camera Solutions may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is not transferred to the third party. In addition, Reveal Media – Body Worn Video Camera Solutions may share data with trusted partners to help us perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to Reveal Media – Body Worn Video Camera Solutions, and they are required to maintain the confidentiality of your information. Reveal Media – Body Worn Video Camera Solutions does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. Reveal Media – Body Worn Video Camera Solutions keeps track of the Web sites and pages our customers visit within Reveal Media – Body Worn Video Camera Solutions, in order to determine what Reveal Media – Body Worn Video Camera Solutions services are the most popular. This data is used to deliver customized content and advertising within Reveal Media – Body Worn Video Camera Solutions to customers whose behavior indicates that they are interested in a particular subject area. Reveal Media – Body Worn Video Camera Solutions Web sites will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Reveal Media – Body Worn Video Camera Solutions or the site; (b) protect and defend the rights or property of Reveal Media – Body Worn Video Camera Solutions; and, (c) act under exigent circumstances to protect the personal safety of users of Reveal Media – Body Worn Video Camera Solutions, or the public. Use of Cookies The Reveal Media – Body Worn Video Camera Solutions Web site use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a Web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize Reveal Media – Body Worn Video Camera Solutions pages, or register with Reveal Media – Body Worn Video Camera Solutions site or services, a cookie helps Reveal Media – Body Worn Video Camera Solutions to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same Reveal Media – Body Worn Video Camera Solutions Web site, the information you previously provided can be retrieved, so you can easily use the Reveal Media – Body Worn Video Camera Solutions features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the Reveal Media – Body Worn Video Camera Solutions services or Web sites you visit. Security of your Personal Information Reveal Media – Body Worn Video Camera Solutions secures your personal information from unauthorized access, use or disclosure. Reveal Media – Body Worn Video Camera Solutions secures the personally identifiable information you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When personal information (such as a credit card number) is transmitted to other Web sites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. Changes to this Statement Reveal Media – Body Worn Video Camera Solutions will occasionally update this Statement of Privacy to reflect company and customer feedback. Reveal Media – Body Worn Video Camera Solutions encourages you to periodically review this Statement to be informed of how Reveal Media – Body Worn Video Camera Solutions is protecting your information. Contact Information Reveal Media – Body Worn Video Camera Solutions welcomes your comments regarding this Statement of Privacy. If you believe that Reveal Media – Body Worn Video Camera Solutions has not adhered to this Statement, please contact Reveal Media – Body Worn Video Camera Solutions at vj@revealmedia.com . We will use commercially reasonable efforts to promptly determine and remedy the problem. Reveal Media – Body Worn Video Camera Solutions is committed to protecting your privacy and developing technology that gives you the most powerful and safe online experience. This Statement of Privacy applies to the Reveal Media – Body Worn Video Camera Solutions Web site and governs data collection and usage. By using the Reveal Media – Body Worn Video Camera Solutions website, you consent to the data practices described in this statement. Collection of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects personally identifiable information, such as your e-mail address, name, home or work address or telephone number. Reveal Media – Body Worn Video Camera Solutions also collects anonymous demographic information, which is not unique to you, such as your ZIP code, age, gender, preferences, interests and favorites. There is also information about your computer hardware and software that is automatically collected by Reveal Media – Body Worn Video Camera Solutions. This information can include: your IP address, browser type, domain names, access times and referring Web site addresses. This information is used by Reveal Media UK – Body Worn Video Camera Solutions for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Reveal Media – Body Worn Video Camera Solutions Web site. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Reveal Media – Body Worn Video Camera Solutions public message boards, this information may be collected and used by others. Note: Reveal Media – Body Worn Video Camera Solutions does not read any of your private online communications. Reveal Media – Body Worn Video Camera Solutions encourages you to review the privacy statements of Web sites you choose to link to from Reveal Media – Body Worn Video Camera Solutions so that you can understand how those Web sites collect, use and share your information. Reveal Media – Body Worn Video Camera Solutions is not responsible for the privacy statements or other content on Web sites outside of the Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions family of Web sites. Use of your Personal Information Reveal Media – Body Worn Video Camera Solutions collects and uses your personal information to operate the Reveal Media – Body Worn Video Camera Solutions Web site and deliver the services you have requested. Reveal Media – Body Worn Video Camera Solutions also uses your personally identifiable information to inform you of other products or services available from Reveal Media – Body Worn Video Camera Solutions and its affiliates. Reveal Media – Body Worn Video Camera Solutions may also contact you via surveys to conduct research about your opinion of current services or of potential new services that may be offered. Reveal Media – Body Worn Video Camera Solutions does not sell, rent or lease its customer lists to third parties. Reveal Media – Body Worn Video Camera Solutions may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is not transferred to the third party. In addition, Reveal Media – Body Worn Video Camera Solutions may share data with trusted partners to help us perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to Reveal Media – Body Worn Video Camera Solutions, and they are required to maintain the confidentiality of your information. Reveal Media – Body Worn Video Camera Solutions does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. Reveal Media – Body Worn Video Camera Solutions keeps track of the Web sites and pages our customers visit within Reveal Media – Body Worn Video Camera Solutions, in order to determine what Reveal Media – Body Worn Video Camera Solutions services are the most popular. This data is used to deliver customized content and advertising within Reveal Media – Body Worn Video Camera Solutions to customers whose behavior indicates that they are interested in a particular subject area. Reveal Media – Body Worn Video Camera Solutions Web sites will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Reveal Media – Body Worn Video Camera Solutions or the site; (b) protect and defend the rights or property of Reveal Media – Body Worn Video Camera Solutions; and, (c) act under exigent circumstances to protect the personal safety of users of Reveal Media – Body Worn Video Camera Solutions, or the public. The Reveal Media – Body Worn Video Camera Solutions Web site use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a Web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize Reveal Media – Body Worn Video Camera Solutions pages, or register with Reveal Media – Body Worn Video Camera Solutions site or services, a cookie helps Reveal Media – Body Worn Video Camera Solutions to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same Reveal Media – Body Worn Video Camera Solutions Web site, the information you previously provided can be retrieved, so you can easily use the Reveal Media – Body Worn Video Camera Solutions features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the Reveal Media – Body Worn Video Camera Solutions services or Web sites you visit. Security of your Personal Information Reveal Media – Body Worn Video Camera Solutions secures your personal information from unauthorized access, use or disclosure. Reveal Media – Body Worn Video Camera Solutions secures the personally identifiable information you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When personal information (such as a credit card number) is transmitted to other Web sites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. Changes to this Statement Reveal Media – Body Worn Video Camera Solutions will occasionally update this Statement of Privacy to reflect company and customer feedback. Reveal Media – Body Worn Video Camera Solutions encourages you to periodically review this Statement to be informed of how Reveal Media – Body Worn Video Camera Solutions is protecting your information. Reveal Media – Body Worn Video Camera Solutions welcomes your comments regarding this Statement of Privacy. If you believe that Reveal Media – Body Worn Video Camera Solutions has not adhered to this Statement, please contact Reveal Media – Body Worn Video Camera Solutions at vj@revealmedia.com . We will use commercially reasonable efforts to promptly determine and remedy the problem.",
    "& Conditions AGREEMENT BETWEEN USER AND Reveal Media – Body Worn Video Camera Solutions The Reveal Media – Body Worn Video Camera Solutions Web Site is comprised of various Web pages operated by Reveal Media – Body Worn Video Camera Solutions. The Reveal Media – Body Worn Video Camera Solutions Web Site is offered to you conditioned on your acceptance without modification of the , conditions, and notices contained herein. Your use of the Reveal Media – Body Worn Video Camera Solutions Web Site constitutes your agreement to all such , conditions, and notices. MODIFICATION OF THESE OF USE Reveal Media – Body Worn Video Camera Solutions reserves the right to change the , conditions, and notices under which the Reveal Media – Body Worn Video Camera Solutions Web Site is offered, including but not limited to the charges associated with the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. LINKS TO THIRD PARTY SITES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain links to other Web Sites (\"Linked Sites\"). The Linked Sites are not under the control of Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions is not responsible for the contents of any Linked Site, including without limitation any link contained in a Linked Site, or any changes or updates to a Linked Site. Reveal Media – Body Worn Video Camera Solutions is not responsible for webcasting or any other form of transmission received from any Linked Site. Reveal Media – Body Worn Video Camera Solutions is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Reveal Media – Body Worn Video Camera Solutions of the site or any association with its operators. NO UNLAWFUL OR PROHIBITED USE As a condition of your use of the Reveal Media – Body Worn Video Camera Solutions Web Site, you warrant to Reveal Media – Body Worn Video Camera Solutions that you will not use the Reveal Media – Body Worn Video Camera Solutions Web Site for any purpose that is unlawful or prohibited by these , conditions, and notices. You may not use the Reveal Media – Body Worn Video Camera Solutions Web Site in any manner which could damage, disable, overburden, or impair the Reveal Media – Body Worn Video Camera Solutions Web Site or interfere with any other party's use and enjoyment of the Reveal Media – Body Worn Video Camera Solutions Web Site. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available or provided for through the Reveal Media – Body Worn Video Camera Solutions Web Sites. USE OF COMMUNICATION SERVICES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain bulletin board services, chat areas, news groups, forums, communities, personal web pages, calendars, and/or other message or communication facilities designed to enable you to communicate with the public at large or with a group (collectively, \"Communication Services\"), you agree to use the Communication Services only to post, send and receive messages and material that are proper and related to the particular Communication Service. By way of example, and not as a limitation, you agree that when using a Communication Service, you will not: Defame, abuse, harass, stalk, threaten or otherwise violate the legal rights (such as rights of privacy and publicity) of others. Publish, post, upload, distribute or disseminate any inappropriate, profane, defamatory, infringing, obscene, indecent or unlawful topic, name, material or information. Upload files that contain software or other material protected by intellectual property laws (or by rights of privacy of publicity) unless you own or control the rights thereto or have received all necessary consents. Upload files that contain viruses, corrupted files, or any other similar software or programs that may damage the operation of another's computer. Advertise or offer to sell or buy any goods or services for any business purpose, unless such Communication Service specifically allows such messages. Conduct or forward surveys, contests, pyramid schemes or chain letters. Download any file posted by another user of a Communication Service that you know, or reasonably should know, cannot be legally distributed in such manner. Falsify or delete any author attributions, legal or other proper notices or proprietary designations or labels of the origin or source of software or other material contained in a file that is uploaded. Restrict or inhibit any other user from using and enjoying the Communication Services. Violate any code of conduct or other guidelines which may be applicable for any particular Communication Service. Harvest or otherwise collect information about others, including e-mail addresses, without their consent. Violate any applicable laws or regulations. Reveal Media – Body Worn Video Camera Solutions has no obligation to monitor the Communication Services. However, Reveal Media – Body Worn Video Camera Solutions reserves the right to review materials posted to a Communication Service and to remove any materials in its sole discretion. Reveal Media – Body Worn Video Camera Solutions reserves the right to terminate your access to any or all of the Communication Services at any time without notice for any reason whatsoever. Reveal Media – Body Worn Video Camera Solutions reserves the right at all times to disclose any information as necessary to satisfy any applicable law, regulation, legal process or governmental request, or to edit, refuse to post or to remove any information or materials, in whole or in part, in Reveal Media – Body Worn Video Camera Solutions's sole discretion. Always use caution when giving out any personally identifying information about yourself or your children in any Communication Service. Reveal Media – Body Worn Video Camera Solutions does not control or endorse the content, messages or information found in any Communication Service and, therefore, Reveal Media – Body Worn Video Camera Solutions specifically disclaims any liability with regard to the Communication Services and any actions resulting from your participation in any Communication Service. Managers and hosts are not authorized Reveal Media – Body Worn Video Camera Solutions spokespersons, and their views do not necessarily reflect those of Reveal Media – Body Worn Video Camera Solutions. Materials uploaded to a Communication Service may be subject to posted limitations on usage, reproduction and/or dissemination. You are responsible for adhering to such limitations if you download the materials. MATERIALS PROVIDED TO Reveal Media – Body Worn Video Camera Solutions OR POSTED AT ANY Reveal Media – Body Worn Video Camera Solutions WEB SITE Reveal Media – Body Worn Video Camera Solutions does not claim ownership of the materials you provide to Reveal Media – Body Worn Video Camera Solutions (including feedback and suggestions) or post, upload, input or submit to any Reveal Media – Body Worn Video Camera Solutions Web Site or its associated services (collectively \"Submissions\"). However, by posting, uploading, inputting, providing or submitting your Submission you are granting Reveal Media – Body Worn Video Camera Solutions, its affiliated companies and necessary sublicensees permission to use your Submission in connection with the operation of their Internet businesses including, without limitation, the rights to: copy, distribute, transmit, publicly display, publicly perform, reproduce, edit, translate and reformat your Submission; and to publish your name in connection with your Submission. No compensation will be paid with respect to the use of your Submission, as provided herein. Reveal Media – Body Worn Video Camera Solutions is under no obligation to post or use any Submission you may provide and may remove any Submission at any time in Reveal Media – Body Worn Video Camera Solutions's sole discretion. By posting, uploading, inputting, providing or submitting your Submission you warrant and represent that you own or otherwise control all of the rights to your Submission as described in this section including, without limitation, all the rights necessary for you to provide, post, upload, input or submit the Submissions. LIABILITY DISCLAIMER THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE Reveal Media – Body Worn Video Camera Solutions WEB SITE AT ANY TIME. ADVICE RECEIVED VIA THE Reveal Media – Body Worn Video Camera Solutions WEB SITE SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS AND YOU SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO YOUR SITUATION. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED ON THE Reveal Media – Body Worn Video Camera Solutions WEB SITE FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WITH THE DELAY OR INABILITY TO USE THE Reveal Media – Body Worn Video Camera Solutions WEB SITE OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF Reveal Media – Body Worn Video Camera Solutions OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR WITH ANY OF THESE OF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE Reveal Media – Body Worn Video Camera Solutions WEB SITE. SERVICE CONTACT : helpdesk@revealmedia.com TERMINATION/ACCESS RESTRICTION Reveal Media – Body Worn Video Camera Solutions reserves the right, in its sole discretion, to terminate your access to the Reveal Media – Body Worn Video Camera Solutions Web Site and the related services or any portion thereof at any time, without notice. GENERAL To the maximum extent permitted by law, this agreement is governed by the laws of the State of Washington, U.S.A. and you hereby consent to the exclusive jurisdiction and venue of courts in King County, Washington, U.S.A. in all disputes arising out of or relating to the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Use of the Reveal Media – Body Worn Video Camera Solutions Web Site is unauthorized in any jurisdiction that does not give effect to all provisions of these , including without limitation this paragraph. You agree that no joint venture, partnership, employment, or agency relationship exists between you and Reveal Media – Body Worn Video Camera Solutions as a result of this agreement or use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Reveal Media – Body Worn Video Camera Solutions's performance of this agreement is subject to existing laws and legal process, and nothing contained in this agreement is in derogation of Reveal Media – Body Worn Video Camera Solutions's right to comply with governmental, court and law enforcement requests or requirements relating to your use of the Reveal Media – Body Worn Video Camera Solutions Web Site or information provided to or gathered by Reveal Media – Body Worn Video Camera Solutions with respect to such use. If any part of this agreement is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of the agreement shall continue in effect. Unless otherwise specified herein, this agreement constitutes the entire agreement between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site and it supersedes all prior or contemporaneous communications and proposals, whether electronic, oral or written, between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site. A printed version of this agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to this agreement to the same extent an d subject to the same conditions as other business documents and records originally generated and maintained in printed form. It is the express wish to the parties that this agreement and all related documents be drawn up in English. COPYRIGHT AND TRADEMARK NOTICES: All contents of the Reveal Media – Body Worn Video Camera Solutions Web Site are: (c)2014 Reveal Media Ltd | A limited company registered in the UK | No 4470201 and/or its suppliers. . TRADEMARKS The names of actual companies and products mentioned herein may be the trademarks of their respective owners. The example companies, organizations, products, people and events depicted herein are fictitious. No association with any real company, organization, product, person, or event is intended or should be inferred. Any rights not expressly granted herein are reserved. NOTICES AND PROCEDURE FOR MAKING CLAIMS OF COPYRIGHT INFRINGEMENT Pursuant to Title 17, United States Code, Section 512(c)(2), notifications of claimed copyright infringement under United States copyright law should be sent to Service Provider's Designated Agent. ALL INQUIRIES NOT RELEVANT TO THE FOLLOWING PROCEDURE WILL RECEIVE NO RESPONSE. See Notice and Procedure for Making Claims of Copyright Infringement. AGREEMENT BETWEEN USER AND Reveal Media – Body Worn Video Camera Solutions The Reveal Media – Body Worn Video Camera Solutions Web Site is comprised of various Web pages operated by Reveal Media – Body Worn Video Camera Solutions. The Reveal Media – Body Worn Video Camera Solutions Web Site is offered to you conditioned on your acceptance without modification of the , conditions, and notices contained herein. Your use of the Reveal Media – Body Worn Video Camera Solutions Web Site constitutes your agreement to all such , conditions, and notices. MODIFICATION OF THESE OF USE Reveal Media – Body Worn Video Camera Solutions reserves the right to change the , conditions, and notices under which the Reveal Media – Body Worn Video Camera Solutions Web Site is offered, including but not limited to the charges associated with the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. LINKS TO THIRD PARTY SITES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain links to other Web Sites (\"Linked Sites\"). The Linked Sites are not under the control of Reveal Media – Body Worn Video Camera Solutions and Reveal Media – Body Worn Video Camera Solutions is not responsible for the contents of any Linked Site, including without limitation any link contained in a Linked Site, or any changes or updates to a Linked Site. Reveal Media – Body Worn Video Camera Solutions is not responsible for webcasting or any other form of transmission received from any Linked Site. Reveal Media – Body Worn Video Camera Solutions is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Reveal Media – Body Worn Video Camera Solutions of the site or any association with its operators. NO UNLAWFUL OR PROHIBITED USE As a condition of your use of the Reveal Media – Body Worn Video Camera Solutions Web Site, you warrant to Reveal Media – Body Worn Video Camera Solutions that you will not use the Reveal Media – Body Worn Video Camera Solutions Web Site for any purpose that is unlawful or prohibited by these , conditions, and notices. You may not use the Reveal Media – Body Worn Video Camera Solutions Web Site in any manner which could damage, disable, overburden, or impair the Reveal Media – Body Worn Video Camera Solutions Web Site or interfere with any other party's use and enjoyment of the Reveal Media – Body Worn Video Camera Solutions Web Site. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available or provided for through the Reveal Media – Body Worn Video Camera Solutions Web Sites. USE OF COMMUNICATION SERVICES The Reveal Media – Body Worn Video Camera Solutions Web Site may contain bulletin board services, chat areas, news groups, forums, communities, personal web pages, calendars, and/or other message or communication facilities designed to enable you to communicate with the public at large or with a group (collectively, \"Communication Services\"), you agree to use the Communication Services only to post, send and receive messages and material that are proper and related to the particular Communication Service. By way of example, and not as a limitation, you agree that when using a Communication Service, you will not: Defame, abuse, harass, stalk, threaten or otherwise violate the legal rights (such as rights of privacy and publicity) of others. Publish, post, upload, distribute or disseminate any inappropriate, profane, defamatory, infringing, obscene, indecent or unlawful topic, name, material or information. Upload files that contain software or other material protected by intellectual property laws (or by rights of privacy of publicity) unless you own or control the rights thereto or have received all necessary consents. Upload files that contain viruses, corrupted files, or any other similar software or programs that may damage the operation of another's computer. Advertise or offer to sell or buy any goods or services for any business purpose, unless such Communication Service specifically allows such messages. Conduct or forward surveys, contests, pyramid schemes or chain letters. Download any file posted by another user of a Communication Service that you know, or reasonably should know, cannot be legally distributed in such manner. Falsify or delete any author attributions, legal or other proper notices or proprietary designations or labels of the origin or source of software or other material contained in a file that is uploaded. Restrict or inhibit any other user from using and enjoying the Communication Services. Violate any code of conduct or other guidelines which may be applicable for any particular Communication Service. Harvest or otherwise collect information about others, including e-mail addresses, without their consent. Violate any applicable laws or regulations. Reveal Media – Body Worn Video Camera Solutions has no obligation to monitor the Communication Services. However, Reveal Media – Body Worn Video Camera Solutions reserves the right to review materials posted to a Communication Service and to remove any materials in its sole discretion. Reveal Media – Body Worn Video Camera Solutions reserves the right to terminate your access to any or all of the Communication Services at any time without notice for any reason whatsoever. Reveal Media – Body Worn Video Camera Solutions reserves the right at all times to disclose any information as necessary to satisfy any applicable law, regulation, legal process or governmental request, or to edit, refuse to post or to remove any information or materials, in whole or in part, in Reveal Media – Body Worn Video Camera Solutions's sole discretion. Always use caution when giving out any personally identifying information about yourself or your children in any Communication Service. Reveal Media – Body Worn Video Camera Solutions does not control or endorse the content, messages or information found in any Communication Service and, therefore, Reveal Media – Body Worn Video Camera Solutions specifically disclaims any liability with regard to the Communication Services and any actions resulting from your participation in any Communication Service. Managers and hosts are not authorized Reveal Media – Body Worn Video Camera Solutions spokespersons, and their views do not necessarily reflect those of Reveal Media – Body Worn Video Camera Solutions. Materials uploaded to a Communication Service may be subject to posted limitations on usage, reproduction and/or dissemination. You are responsible for adhering to such limitations if you download the materials. MATERIALS PROVIDED TO Reveal Media – Body Worn Video Camera Solutions OR POSTED AT ANY Reveal Media – Body Worn Video Camera Solutions WEB SITE Reveal Media – Body Worn Video Camera Solutions does not claim ownership of the materials you provide to Reveal Media – Body Worn Video Camera Solutions (including feedback and suggestions) or post, upload, input or submit to any Reveal Media – Body Worn Video Camera Solutions Web Site or its associated services (collectively \"Submissions\"). However, by posting, uploading, inputting, providing or submitting your Submission you are granting Reveal Media – Body Worn Video Camera Solutions, its affiliated companies and necessary sublicensees permission to use your Submission in connection with the operation of their Internet businesses including, without limitation, the rights to: copy, distribute, transmit, publicly display, publicly perform, reproduce, edit, translate and reformat your Submission; and to publish your name in connection with your Submission. No compensation will be paid with respect to the use of your Submission, as provided herein. Reveal Media – Body Worn Video Camera Solutions is under no obligation to post or use any Submission you may provide and may remove any Submission at any time in Reveal Media – Body Worn Video Camera Solutions's sole discretion. By posting, uploading, inputting, providing or submitting your Submission you warrant and represent that you own or otherwise control all of the rights to your Submission as described in this section including, without limitation, all the rights necessary for you to provide, post, upload, input or submit the Submissions. THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE Reveal Media – Body Worn Video Camera Solutions WEB SITE AT ANY TIME. ADVICE RECEIVED VIA THE Reveal Media – Body Worn Video Camera Solutions WEB SITE SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS AND YOU SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO YOUR SITUATION. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED ON THE Reveal Media – Body Worn Video Camera Solutions WEB SITE FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL Reveal Media – Body Worn Video Camera Solutions AND/OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WITH THE DELAY OR INABILITY TO USE THE Reveal Media – Body Worn Video Camera Solutions WEB SITE OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF Reveal Media – Body Worn Video Camera Solutions OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE Reveal Media – Body Worn Video Camera Solutions WEB SITE, OR WITH ANY OF THESE OF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE Reveal Media – Body Worn Video Camera Solutions WEB SITE. SERVICE CONTACT : helpdesk@revealmedia.com Reveal Media – Body Worn Video Camera Solutions reserves the right, in its sole discretion, to terminate your access to the Reveal Media – Body Worn Video Camera Solutions Web Site and the related services or any portion thereof at any time, without notice. GENERAL To the maximum extent permitted by law, this agreement is governed by the laws of the State of Washington, U.S.A. and you hereby consent to the exclusive jurisdiction and venue of courts in King County, Washington, U.S.A. in all disputes arising out of or relating to the use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Use of the Reveal Media – Body Worn Video Camera Solutions Web Site is unauthorized in any jurisdiction that does not give effect to all provisions of these , including without limitation this paragraph. You agree that no joint venture, partnership, employment, or agency relationship exists between you and Reveal Media – Body Worn Video Camera Solutions as a result of this agreement or use of the Reveal Media – Body Worn Video Camera Solutions Web Site. Reveal Media – Body Worn Video Camera Solutions's performance of this agreement is subject to existing laws and legal process, and nothing contained in this agreement is in derogation of Reveal Media – Body Worn Video Camera Solutions's right to comply with governmental, court and law enforcement requests or requirements relating to your use of the Reveal Media – Body Worn Video Camera Solutions Web Site or information provided to or gathered by Reveal Media – Body Worn Video Camera Solutions with respect to such use. If any part of this agreement is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of the agreement shall continue in effect. Unless otherwise specified herein, this agreement constitutes the entire agreement between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site and it supersedes all prior or contemporaneous communications and proposals, whether electronic, oral or written, between the user and Reveal Media – Body Worn Video Camera Solutions with respect to the Reveal Media – Body Worn Video Camera Solutions Web Site. A printed version of this agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to this agreement to the same extent an d subject to the same conditions as other business documents and records originally generated and maintained in printed form. It is the express wish to the parties that this agreement and all related documents be drawn up in English. COPYRIGHT AND TRADEMARK NOTICES: All contents of the Reveal Media – Body Worn Video Camera Solutions Web Site are: (c)2014 Reveal Media Ltd | A limited company registered in the UK | No 4470201 and/or its suppliers. . The names of actual companies and products mentioned herein may be the trademarks of their respective owners. The example companies, organizations, products, people and events depicted herein are fictitious. No association with any real company, organization, product, person, or event is intended or should be inferred. Any rights not expressly granted herein are reserved. NOTICES AND PROCEDURE FOR MAKING CLAIMS OF COPYRIGHT INFRINGEMENT Pursuant to Title 17, United States Code, Section 512(c)(2), notifications of claimed copyright infringement under United States copyright law should be sent to Service Provider's Designated Agent. ALL INQUIRIES NOT RELEVANT TO THE FOLLOWING PROCEDURE WILL RECEIVE NO RESPONSE. See Notice and Procedure for Making Claims of Copyright Infringement.",
    "Case Studies Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green, security manager for Southern Railway, UK Case study introduction Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us. Colin Green is the security manager of Southern Railway who, when first looked at the introduction of body cameras, managed a team of Rail Neighbourhood Officers operating on trains and stations in the south of England. Colin is looking into the feasibility of purchasing more Reveal body cameras in the future to make the equipment personal issue. Why did you turn to body worn video? \"I became aware of the need to gather evidence when on shift and the need to have a tool which would act as a deterrent. We had certain powers as Rail Neighbourhood Officers, but there was only so much we could do – there was a big need for gathering evidence. \"So I did some research looking for the sort of thing we utilise needed and found Reveal Media. I asked them if they had something suitable that could be used to collect evidence and to be used as a deterrent. They did indeed have exactly what we were looking for. \"We quickly realised it wasn't just about cameras, but also about data management, and the software called DEMS that came with the cameras was soon something that we found we couldn't do with without. \"To get the project off the ground, funding was necessary from network rail for the cameras in the first place. Network Rail thought the product was so good they bought some cameras themselves! They started using them for rail crossing patrols after I advised them that the video was secure for prosecutions, had a time saving element, provided good evidence which encourages early guilty pleas and means people can be charged more easily. How have the cameras made a difference? \"There is an increased visibility with the cameras. Our security staff wear hi-vis jackets a bit like the police, which can sometimes be provocative when dealing with drunk or aggressive people, they just don't like the uniform. However, when we introduced the cameras people would ask \"is that on?\" and their behaviour changed, even when the cameras weren't on, so the cameras made a difference immediately. \"The first time we used the footage as evidence, the person concerned was shown the video, pleaded guilty, accepted the penalty notice and that was that. It was all down to the use of the camera. After that, I understood that I could not afford not to have them. \"The volume and quality of sound is superb on the RS3-SX. So is the HD video quality. Even in low light, which is where most of our patrols and work takes place, it doesn't affect the quality. It's a more robust camera too. What do you think of DEMS? \"DEMS is so easy to use – even for non-technical people. It makes data collection so easy and reliable. Things are laid out in a simple way and all you have to do is click the videos you want and press a few buttons. \"The upgrades are fantastic, we're on DEMS 3 now.\" \"The whole thing has been excellent\" What do you think of the front facing screen? \"The front facing screen is brilliant. You know you're being recorded when you can see yourself on a screen. And it's remarkable the difference between CCTV and body cameras. We have CCTV in all trains and on all stations, but it's completely different when somebody is standing in front of you with a camera. Not only does it defuse situations, but people then start apologising. How about the articulated head? \"The articulated camera head is spot on. We have different sized people here, all different builds, shapes and sizes. And all of them are in different situations that change throughout the day. So it's vital that we capture the right images, perfectly framed. We're also able to turn the camera head around if it makes some people feel uncomfortable. \"We had a confrontation where the person in question was very distressed by the camera, so we were able to turn the camera head around and continue recording audio with the option of turning the camera head round again if needed. \"The cameras are fantastic value for money. If you want the best, then you pay for the best, but there are other cameras out there where you pay a similar price but get half the product. What have you learned because of the project? \"There was a big learning curve when we initiated the project. It was a lot more complicated than you might think. It's not just about buying cameras, attaching them to people and filming things. We had to think about policies for everything: data protection, using cameras, when to film, when to stop filming, what to do with the footage once it had been filmed. \"We also quickly learned that we needed the docking stations for a stable filming platform. \"We also needed to train our staff on how to use them. There was some hesitance to use them at first because it was assumed that people would play up to the camera and make confrontations worse. As it turned out, the cameras had the opposite effect. Are you able to share any statistics? \"It's difficult to measure its success because we are in the process of gathering meaningful statistics, but the four times we have used it to prosecute, it's worked. I would say it makes a massive difference and I would not take them away now, I actually am hoping to get some more. How have you found working with Reveal ? \"Reveal have been incredibly helpful all along. They bent over backwards to get a project up and running for us. We originally had some problems mounting the cameras on our uniforms. The glue wasn't strong enough on the klickfast attachment, but we had them sent back and Reveal came up with a much stronger solution for us.",
    "OF USE of website use REVEAL MEDIA LIMITED PLEASE READ THESE CAREFULLY BEFORE USING THIS SITE OF WEBSITE USE This of use document (together with the documents referred to in it) tell you the of use on which you may make use of our website www.Revealmedia.com and any other of our websites (collectively referred to as 'our site'), whether as a guest or a registered user. Use of our site includes accessing, browsing, or registering to use our site. Please read these of use carefully before you start to use our site, as these will apply to your use of our site. We recommend that you print a copy of this for future reference. By using our site, you confirm that you accept these of use and the acceptable use policy which is set out below and that you agree to comply with them. If you do not agree to these of use, you must not use our site. OTHER APPLICABLE These of use refer to the following additional , which also apply to your use of our site: Our , which sets out the on which we process any personal data we collect from you, or that you provide to us. By using our site, you consent to such processing and you warrant that all data provided by you is accurate. This policy also sets out information about the cookies on our site and their use. If you purchase goods from our site, our of sale and/or supply will apply to the sales. INFORMATION ABOUT US www.revealmedia.com is a site operated by Reveal Media Limited (referred to as 'We', 'us', or 'Reveal' ). We are registered in England and Wales under company number 04470201 and have our registered office at C/O Grant Thornton Uk Llp, 300 Pavilion Drive, Northampton, NN4 7YE. Our main trading address Riverview House, 20 Old Bridge Street, Hampton Wick, Kingston upon Thames, KT1 4BU. Our VAT number is GB798532669. We are a limited company. CHANGES TO THESE We may revise these of use at any time by amending this page. Please check this page from time to time to take notice of any changes we made, as they are binding on you. CHANGES TO OUR SITE We may update our site from time to time and may change the content at any time. However, please note that any of the content on our site may be out of date at any given time, and we are under no obligation to update it. We do not guarantee that our site, or any content on it, will be free from errors or omissions. ACCESSING OUR SITE Our site is made available free of charge. We do not guarantee that our site, or any content on it, will always be available or be uninterrupted. Access to our site is permitted on a temporary basis. We may suspend, withdraw, discontinue or change all or any part of our site without notice. We will not be liable to you if for any reason our site is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to our site. You are also responsible for ensuring that all persons who access our site through your internet connection are aware of these of use and other applicable , and that they comply with them. We do not represent that content available on or through our site is appropriate or available in other locations other than the UK. We may limit the availability of our site or any service or product described on our site to any person or geographic area at any time. If you choose to access our site from outside the United Kingdom, you do so at your own risk. YOUR ACCOUNT AND PASSWORD If you choose, or you are provided with, a user identification code, password or any other piece of information as part of our security procedures, you must treat such information as confidential. You must not disclose it to any third party. We have the right to disable any user identification code or password, whether chosen by you or allocated by us, at any time, if in our reasonable opinion you have failed to comply with any of the provisions of these of use. If you know or suspect that anyone other than you knows your user identification code or password, you must promptly notify us at [email protected] . INTELLECTUAL PROPERTY RIGHTS We are the owner or the licensee of all intellectual property rights in our site, and in the material published on it. Those works are protected by copyright laws and treaties around the world. All such rights are reserved. You may print off one copy, and may download extracts, of any page(s) from our site for your personal use and you may draw the attention of others within your organisation to content posted on our site. You must not modify the paper or digital copies of any materials you have printed off or downloaded in any way, and you must not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. You must always acknowledge our status (and that of any identified contributors) as the authors of content on our site. You must not use any part of the content on our site for commercial purposes without obtaining a licence to do so from us or our licensors. If you print off, copy or download any part of our site in breach of these of use, your right to use our site will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. NO RELIANCE ON INFORMATION The content on our site is provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. Although we make reasonable efforts to update the information on our site, we make no representations, warranties or guarantees, whether express or implied, that the content on our site is accurate, complete or up-to-date. LIMITATION OF OUR LIABILITY Nothing in these of use excludes or limits our liability for death or personal injury arising from our negligence, or our fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by English law. To the extent permitted by law, we exclude all conditions, warranties, representations or other which may apply to our site or any content on it, whether express or implied. We will not be liable to any user for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with: use of, or inability to use, our site; or use of or reliance on any content displayed on our site. If you are a business user, please note that in particular, we will not be liable for: loss of profits, sales, business, or revenue; business interruption; loss of anticipated savings; loss of business opportunity, goodwill or reputation; or any indirect or consequential loss or damage. If you are a consumer user, please note that we only provide our site for domestic and private use. You agree not to use our site for any commercial or business purposes, and we have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity. We will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of our site or to your downloading of any content on it, or on any website linked to it. We assume no responsibility for the content of websites linked on our site. Such links should not be interpreted as endorsement by us of those linked websites. We will not be liable for any loss or damage that may arise from your use of them. Different limitations and exclusions of liability will apply to liability arising as a result of the supply of any goods by use to you, which will be set out in our of sale or supply. UPLOADING CONTENT TO OUR SITE Whenever you make use of a feature that allows you to upload content to our site, or to make contact with other users of our site, you must comply with the content standards set out in our Acceptable Use Policy which is set out below. You warrant that any such contribution does comply with those standards, and you will be liable to us and indemnify us for any breach of that warranty. If you are a consumer user, this means you will be responsible for any loss or damage we suffer as a result of your breach of warranty. Any content you upload to our site will be considered non-confidential and non-proprietary. You retain all of your ownership rights in your content, but you are required to grant us and other users of the Site a limited licence to use, store and copy that content and to distribute and make it available to third parties. The rights you license to us are described in the next section ('Rights you licence'). We also have the right to disclose your identity to any third party who is claiming that any content posted or uploaded by you to our site constitutes a violation of their intellectual property rights, or of their right to privacy. We will not be responsible, or liable to any third party, for the content or accuracy of any content posted by you or any other user of our site. We have the right to remove any posting you make on our site if, in our opinion, your post does not comply with the content standards set out in our Acceptable Use Policy (which is set out below) The views expressed by other users on our site do not represent our views or values. You are solely responsible for securing and backing up your content. RIGHTS YOU LICENCE When you upload or post content to our site, you grant a non-exclusive licence to Reveal, its subsidiaries, employees, business partners, suppliers, and subcontractors to use the content for the purposes expressly or by implication permitted by your intention in posting or uploading such content, or as permitted by the of our . VIRUSES We do not guarantee that our site will be secure or free from bugs or viruses. You are responsible for configuring your information technology, computer programmes and platform in order to access our site. You should use your own virus protection software. You must not misuse our site by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorised access to our site, the server on which our site is stored or any server, computer or database connected to our site. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack. By breaching this provision, you would commit a criminal offense under the Computer Misuse Act 1990. We will report any such breach to the relevant law enforcement authorities and we will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use our site will cease immediately. LINKING TO OUR SITE You may link to our home page, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it. You must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part where none exists. You must not establish a link to our site in any website that is not owned by you. Our site must not be framed on any other site, nor may you create a link to any part of our site other than the home page. We reserve the right to withdraw linking permission without notice. The website in which you are linking must comply in all respects with the content standards set out in our Acceptable Use Policy which is set out below. If you wish to make any use of content on our site other than that set out above, please contact [email protected] . THIRD-PARTY LINKS AND RESOURCES IN OUR SITE Where our site contains links to other sites and resources provided by third parties, these links are provided for your information only. We have no control over the contents of those sites or resources. ACCEPTABLE USE POLICY This acceptable use policy applies to all users of, and visitors to, our site. Your use of our site means that you accept, and agree to abide by, all the policies in this policy. Prohibited Uses You may use our site only for lawful purposes. You may not use our site: In any way that breaches any applicable local, national or international law or regulation. In any way that is unlawful or fraudulent, or has any unlawful or fraudulent purpose or effect. For the purpose of harming or attempting to harm minors in any way. To send, knowingly receive, upload, download, use or re-use any material which does not comply with our content standards [INSERT AS LINK TO CONTENT STANDARDS BELOW]. To transmit, or procure the sending of, any unsolicited or unauthorised advertising or promotional material or any other form of similar solicitation (spam). To knowingly transmit any data, send or upload any material that contains viruses, Trojan horses, worms, time-bombs, keystroke loggers, spyware, adware or any other harmful programs or similar computer code designed to adversely affect the operation of any computer software or hardware. You also agree: Not to reproduce, duplicate, copy or re-sell any part of our site in contravention of the provisions of this of website use document (or any document referred to in it) Not to access without authority, interfere with, damage or disrupt: any part of our site; any equipment or network on which our site is stored; any software used in the provision of our site; or any equipment or network or software owned or used by any third party. Content Standards These content standards apply to any and all material which you contribute to our site (contributions), and to any interactive services associated with it. You must comply with the spirit and the letter of the following standards. The standards apply to each part of any contribution as well as to its whole. Contributions must: Be accurate (where they state facts). Be genuinely held (where they state opinions). Comply with applicable law in the UK and in any country from which they are posted. Contributions must not: Contain any material which is defamatory of any person. Contain any material which is obscene, offensive, hateful or inflammatory. Promote sexually explicit material. Promote violence. Promote discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe any copyright, database right or trade mark of any other person. Be likely to deceive any person. Be made in breach of any legal duty owed to a third party, such as a contractual duty or a duty of confidence. Promote any illegal activity. Be threatening, abuse or invade another's privacy, or cause annoyance, inconvenience or needless anxiety. Be likely to harass, upset, embarrass, alarm or annoy any other person. Be used to impersonate any person, or to misrepresent your identity or affiliation with any person. Give the impression that they emanate from us, if this is not the case. Advocate, promote or assist any unlawful act such as (by way of example only) copyright infringement or computer misuse. Suspension And Termination We will determine, in our discretion, whether there has been a breach of this acceptable use policy through your use of our site. When a breach of this policy has occurred, we may take such action as we deem appropriate. Failure to comply with this acceptable use policy constitutes a material breach of this of use document upon which you are permitted to use our site, and may result in our taking all or any of the following actions: Immediate, temporary or permanent withdrawal of your right to use our site. Immediate, temporary or permanent removal of any posting or material uploaded by you to our site. Issue of a warning to you. Legal proceedings against you for reimbursement of all costs on an indemnity basis (including, but not limited to, reasonable administrative and legal costs) resulting from the breach. Further legal action against you. Disclosure of such information to law enforcement authorities as we reasonably feel is necessary. We exclude liability for actions taken in response to breaches of this acceptable use policy. The responses described in this policy are not limited, and we may take any other action we reasonably deem appropriate. Changes To The Acceptable Use Policy We may revise this acceptable use policy at any time by amending this section. You are expected to check this document from time to time to take notice of any changes we make, as they are legally binding on you. Some of the provisions contained in this acceptable use policy may also be superseded by provisions or notices published elsewhere on our site. APPLICABLE LAW If you are a consumer, please note that these of use, its subject matter, and its formation, are governed by English law. You and we both agree to that the courts of England and Wales will have non-exclusive jurisdiction. However, if you are a resident of Northern Ireland you may also bring proceedings in Northern Ireland, and if you are a resident of Scotland, you may also bring proceedings in Scotland. If you are a business, these of use, its subject matter, and its formation (and any non-contractual disputes or claims) are governed by English law. We both agree to the exclusive jurisdiction of the courts of England and Wales. TRADEMARKS The word \"REVEAL\", the device, and \"D E M S\" are UK registered trademarks of REVEAL MEDIA LIMITED and are the subject of similar protection elsewhere in the world. CONTACT US To contact us, please email [email protected] . Thank you for visiting our site. OF USE of website use REVEAL MEDIA LIMITED PLEASE READ THESE CAREFULLY BEFORE USING THIS SITE OF WEBSITE USE This of use document (together with the documents referred to in it) tell you the of use on which you may make use of our website www.Revealmedia.com and any other of our websites (collectively referred to as 'our site'), whether as a guest or a registered user. Use of our site includes accessing, browsing, or registering to use our site. Please read these of use carefully before you start to use our site, as these will apply to your use of our site. We recommend that you print a copy of this for future reference. By using our site, you confirm that you accept these of use and the acceptable use policy which is set out below and that you agree to comply with them. If you do not agree to these of use, you must not use our site. OTHER APPLICABLE These of use refer to the following additional , which also apply to your use of our site: Our , which sets out the on which we process any personal data we collect from you, or that you provide to us. By using our site, you consent to such processing and you warrant that all data provided by you is accurate. This policy also sets out information about the cookies on our site and their use. If you purchase goods from our site, our of sale and/or supply will apply to the sales. INFORMATION ABOUT US www.revealmedia.com is a site operated by Reveal Media Limited (referred to as 'We', 'us', or 'Reveal' ). We are registered in England and Wales under company number 04470201 and have our registered office at C/O Grant Thornton Uk Llp, 300 Pavilion Drive, Northampton, NN4 7YE. Our main trading address Riverview House, 20 Old Bridge Street, Hampton Wick, Kingston upon Thames, KT1 4BU. Our VAT number is GB798532669. We are a limited company. CHANGES TO THESE We may revise these of use at any time by amending this page. Please check this page from time to time to take notice of any changes we made, as they are binding on you. CHANGES TO OUR SITE We may update our site from time to time and may change the content at any time. However, please note that any of the content on our site may be out of date at any given time, and we are under no obligation to update it. We do not guarantee that our site, or any content on it, will be free from errors or omissions. ACCESSING OUR SITE Our site is made available free of charge. We do not guarantee that our site, or any content on it, will always be available or be uninterrupted. Access to our site is permitted on a temporary basis. We may suspend, withdraw, discontinue or change all or any part of our site without notice. We will not be liable to you if for any reason our site is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to our site. You are also responsible for ensuring that all persons who access our site through your internet connection are aware of these of use and other applicable , and that they comply with them. We do not represent that content available on or through our site is appropriate or available in other locations other than the UK. We may limit the availability of our site or any service or product described on our site to any person or geographic area at any time. If you choose to access our site from outside the United Kingdom, you do so at your own risk. YOUR ACCOUNT AND PASSWORD If you choose, or you are provided with, a user identification code, password or any other piece of information as part of our security procedures, you must treat such information as confidential. You must not disclose it to any third party. We have the right to disable any user identification code or password, whether chosen by you or allocated by us, at any time, if in our reasonable opinion you have failed to comply with any of the provisions of these of use. If you know or suspect that anyone other than you knows your user identification code or password, you must promptly notify us at [email protected] . INTELLECTUAL PROPERTY RIGHTS We are the owner or the licensee of all intellectual property rights in our site, and in the material published on it. Those works are protected by copyright laws and treaties around the world. All such rights are reserved. You may print off one copy, and may download extracts, of any page(s) from our site for your personal use and you may draw the attention of others within your organisation to content posted on our site. You must not modify the paper or digital copies of any materials you have printed off or downloaded in any way, and you must not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. You must always acknowledge our status (and that of any identified contributors) as the authors of content on our site. You must not use any part of the content on our site for commercial purposes without obtaining a licence to do so from us or our licensors. If you print off, copy or download any part of our site in breach of these of use, your right to use our site will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. NO RELIANCE ON INFORMATION The content on our site is provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. Although we make reasonable efforts to update the information on our site, we make no representations, warranties or guarantees, whether express or implied, that the content on our site is accurate, complete or up-to-date. LIMITATION OF OUR LIABILITY Nothing in these of use excludes or limits our liability for death or personal injury arising from our negligence, or our fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by English law. To the extent permitted by law, we exclude all conditions, warranties, representations or other which may apply to our site or any content on it, whether express or implied. We will not be liable to any user for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with: use of, or inability to use, our site; or use of or reliance on any content displayed on our site. If you are a business user, please note that in particular, we will not be liable for: loss of profits, sales, business, or revenue; business interruption; loss of anticipated savings; loss of business opportunity, goodwill or reputation; or any indirect or consequential loss or damage. If you are a consumer user, please note that we only provide our site for domestic and private use. You agree not to use our site for any commercial or business purposes, and we have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity. We will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of our site or to your downloading of any content on it, or on any website linked to it. We assume no responsibility for the content of websites linked on our site. Such links should not be interpreted as endorsement by us of those linked websites. We will not be liable for any loss or damage that may arise from your use of them. Different limitations and exclusions of liability will apply to liability arising as a result of the supply of any goods by use to you, which will be set out in our of sale or supply. UPLOADING CONTENT TO OUR SITE Whenever you make use of a feature that allows you to upload content to our site, or to make contact with other users of our site, you must comply with the content standards set out in our Acceptable Use Policy which is set out below. You warrant that any such contribution does comply with those standards, and you will be liable to us and indemnify us for any breach of that warranty. If you are a consumer user, this means you will be responsible for any loss or damage we suffer as a result of your breach of warranty. Any content you upload to our site will be considered non-confidential and non-proprietary. You retain all of your ownership rights in your content, but you are required to grant us and other users of the Site a limited licence to use, store and copy that content and to distribute and make it available to third parties. The rights you license to us are described in the next section ('Rights you licence'). We also have the right to disclose your identity to any third party who is claiming that any content posted or uploaded by you to our site constitutes a violation of their intellectual property rights, or of their right to privacy. We will not be responsible, or liable to any third party, for the content or accuracy of any content posted by you or any other user of our site. We have the right to remove any posting you make on our site if, in our opinion, your post does not comply with the content standards set out in our Acceptable Use Policy (which is set out below) The views expressed by other users on our site do not represent our views or values. You are solely responsible for securing and backing up your content. RIGHTS YOU LICENCE When you upload or post content to our site, you grant a non-exclusive licence to Reveal, its subsidiaries, employees, business partners, suppliers, and subcontractors to use the content for the purposes expressly or by implication permitted by your intention in posting or uploading such content, or as permitted by the of our . VIRUSES We do not guarantee that our site will be secure or free from bugs or viruses. You are responsible for configuring your information technology, computer programmes and platform in order to access our site. You should use your own virus protection software. You must not misuse our site by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorised access to our site, the server on which our site is stored or any server, computer or database connected to our site. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack. By breaching this provision, you would commit a criminal offense under the Computer Misuse Act 1990. We will report any such breach to the relevant law enforcement authorities and we will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use our site will cease immediately. LINKING TO OUR SITE You may link to our home page, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it. You must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part where none exists. You must not establish a link to our site in any website that is not owned by you. Our site must not be framed on any other site, nor may you create a link to any part of our site other than the home page. We reserve the right to withdraw linking permission without notice. The website in which you are linking must comply in all respects with the content standards set out in our Acceptable Use Policy which is set out below. If you wish to make any use of content on our site other than that set out above, please contact [email protected] . THIRD-PARTY LINKS AND RESOURCES IN OUR SITE Where our site contains links to other sites and resources provided by third parties, these links are provided for your information only. We have no control over the contents of those sites or resources. ACCEPTABLE USE POLICY This acceptable use policy applies to all users of, and visitors to, our site. Your use of our site means that you accept, and agree to abide by, all the policies in this policy. Prohibited Uses You may use our site only for lawful purposes. You may not use our site: In any way that breaches any applicable local, national or international law or regulation. In any way that is unlawful or fraudulent, or has any unlawful or fraudulent purpose or effect. For the purpose of harming or attempting to harm minors in any way. To send, knowingly receive, upload, download, use or re-use any material which does not comply with our content standards [INSERT AS LINK TO CONTENT STANDARDS BELOW]. To transmit, or procure the sending of, any unsolicited or unauthorised advertising or promotional material or any other form of similar solicitation (spam). To knowingly transmit any data, send or upload any material that contains viruses, Trojan horses, worms, time-bombs, keystroke loggers, spyware, adware or any other harmful programs or similar computer code designed to adversely affect the operation of any computer software or hardware. You also agree: Not to reproduce, duplicate, copy or re-sell any part of our site in contravention of the provisions of this of website use document (or any document referred to in it) Not to access without authority, interfere with, damage or disrupt: any part of our site; any equipment or network on which our site is stored; any software used in the provision of our site; or any equipment or network or software owned or used by any third party. Content Standards These content standards apply to any and all material which you contribute to our site (contributions), and to any interactive services associated with it. You must comply with the spirit and the letter of the following standards. The standards apply to each part of any contribution as well as to its whole. Contributions must: Be accurate (where they state facts). Be genuinely held (where they state opinions). Comply with applicable law in the UK and in any country from which they are posted. Contributions must not: Contain any material which is defamatory of any person. Contain any material which is obscene, offensive, hateful or inflammatory. Promote sexually explicit material. Promote violence. Promote discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe any copyright, database right or trade mark of any other person. Be likely to deceive any person. Be made in breach of any legal duty owed to a third party, such as a contractual duty or a duty of confidence. Promote any illegal activity. Be threatening, abuse or invade another's privacy, or cause annoyance, inconvenience or needless anxiety. Be likely to harass, upset, embarrass, alarm or annoy any other person. Be used to impersonate any person, or to misrepresent your identity or affiliation with any person. Give the impression that they emanate from us, if this is not the case. Advocate, promote or assist any unlawful act such as (by way of example only) copyright infringement or computer misuse. Suspension And Termination We will determine, in our discretion, whether there has been a breach of this acceptable use policy through your use of our site. When a breach of this policy has occurred, we may take such action as we deem appropriate. Failure to comply with this acceptable use policy constitutes a material breach of this of use document upon which you are permitted to use our site, and may result in our taking all or any of the following actions: Immediate, temporary or permanent withdrawal of your right to use our site. Immediate, temporary or permanent removal of any posting or material uploaded by you to our site. Issue of a warning to you. Legal proceedings against you for reimbursement of all costs on an indemnity basis (including, but not limited to, reasonable administrative and legal costs) resulting from the breach. Further legal action against you. Disclosure of such information to law enforcement authorities as we reasonably feel is necessary. We exclude liability for actions taken in response to breaches of this acceptable use policy. The responses described in this policy are not limited, and we may take any other action we reasonably deem appropriate. Changes To The Acceptable Use Policy We may revise this acceptable use policy at any time by amending this section. You are expected to check this document from time to time to take notice of any changes we make, as they are legally binding on you. Some of the provisions contained in this acceptable use policy may also be superseded by provisions or notices published elsewhere on our site. APPLICABLE LAW If you are a consumer, please note that these of use, its subject matter, and its formation, are governed by English law. You and we both agree to that the courts of England and Wales will have non-exclusive jurisdiction. However, if you are a resident of Northern Ireland you may also bring proceedings in Northern Ireland, and if you are a resident of Scotland, you may also bring proceedings in Scotland. If you are a business, these of use, its subject matter, and its formation (and any non-contractual disputes or claims) are governed by English law. We both agree to the exclusive jurisdiction of the courts of England and Wales. TRADEMARKS The word \"REVEAL\", the device, and \"D E M S\" are UK registered trademarks of REVEAL MEDIA LIMITED and are the subject of similar protection elsewhere in the world. CONTACT US To contact us, please email [email protected] . Thank you for visiting our site. OF USE of website use REVEAL MEDIA LIMITED PLEASE READ THESE CAREFULLY BEFORE USING THIS SITE OF WEBSITE USE This of use document (together with the documents referred to in it) tell you the of use on which you may make use of our website www.Revealmedia.com and any other of our websites (collectively referred to as 'our site'), whether as a guest or a registered user. Use of our site includes accessing, browsing, or registering to use our site. Please read these of use carefully before you start to use our site, as these will apply to your use of our site. We recommend that you print a copy of this for future reference. By using our site, you confirm that you accept these of use and the acceptable use policy which is set out below and that you agree to comply with them. If you do not agree to these of use, you must not use our site. OTHER APPLICABLE These of use refer to the following additional , which also apply to your use of our site: Our , which sets out the on which we process any personal data we collect from you, or that you provide to us. By using our site, you consent to such processing and you warrant that all data provided by you is accurate. This policy also sets out information about the cookies on our site and their use. If you purchase goods from our site, our of sale and/or supply will apply to the sales. INFORMATION ABOUT US www.revealmedia.com is a site operated by Reveal Media Limited (referred to as 'We', 'us', or 'Reveal' ). We are registered in England and Wales under company number 04470201 and have our registered office at C/O Grant Thornton Uk Llp, 300 Pavilion Drive, Northampton, NN4 7YE. Our main trading address Riverview House, 20 Old Bridge Street, Hampton Wick, Kingston upon Thames, KT1 4BU. Our VAT number is GB798532669. We are a limited company. CHANGES TO THESE We may revise these of use at any time by amending this page. Please check this page from time to time to take notice of any changes we made, as they are binding on you. CHANGES TO OUR SITE We may update our site from time to time and may change the content at any time. However, please note that any of the content on our site may be out of date at any given time, and we are under no obligation to update it. We do not guarantee that our site, or any content on it, will be free from errors or omissions. ACCESSING OUR SITE Our site is made available free of charge. We do not guarantee that our site, or any content on it, will always be available or be uninterrupted. Access to our site is permitted on a temporary basis. We may suspend, withdraw, discontinue or change all or any part of our site without notice. We will not be liable to you if for any reason our site is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to our site. You are also responsible for ensuring that all persons who access our site through your internet connection are aware of these of use and other applicable , and that they comply with them. We do not represent that content available on or through our site is appropriate or available in other locations other than the UK. We may limit the availability of our site or any service or product described on our site to any person or geographic area at any time. If you choose to access our site from outside the United Kingdom, you do so at your own risk. YOUR ACCOUNT AND PASSWORD If you choose, or you are provided with, a user identification code, password or any other piece of information as part of our security procedures, you must treat such information as confidential. You must not disclose it to any third party. We have the right to disable any user identification code or password, whether chosen by you or allocated by us, at any time, if in our reasonable opinion you have failed to comply with any of the provisions of these of use. If you know or suspect that anyone other than you knows your user identification code or password, you must promptly notify us at [email protected] . INTELLECTUAL PROPERTY RIGHTS We are the owner or the licensee of all intellectual property rights in our site, and in the material published on it. Those works are protected by copyright laws and treaties around the world. All such rights are reserved. You may print off one copy, and may download extracts, of any page(s) from our site for your personal use and you may draw the attention of others within your organisation to content posted on our site. You must not modify the paper or digital copies of any materials you have printed off or downloaded in any way, and you must not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. You must always acknowledge our status (and that of any identified contributors) as the authors of content on our site. You must not use any part of the content on our site for commercial purposes without obtaining a licence to do so from us or our licensors. If you print off, copy or download any part of our site in breach of these of use, your right to use our site will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. NO RELIANCE ON INFORMATION The content on our site is provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. Although we make reasonable efforts to update the information on our site, we make no representations, warranties or guarantees, whether express or implied, that the content on our site is accurate, complete or up-to-date. LIMITATION OF OUR LIABILITY Nothing in these of use excludes or limits our liability for death or personal injury arising from our negligence, or our fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by English law. To the extent permitted by law, we exclude all conditions, warranties, representations or other which may apply to our site or any content on it, whether express or implied. We will not be liable to any user for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with: use of, or inability to use, our site; or use of or reliance on any content displayed on our site. If you are a business user, please note that in particular, we will not be liable for: loss of profits, sales, business, or revenue; business interruption; loss of anticipated savings; loss of business opportunity, goodwill or reputation; or any indirect or consequential loss or damage. If you are a consumer user, please note that we only provide our site for domestic and private use. You agree not to use our site for any commercial or business purposes, and we have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity. We will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of our site or to your downloading of any content on it, or on any website linked to it. We assume no responsibility for the content of websites linked on our site. Such links should not be interpreted as endorsement by us of those linked websites. We will not be liable for any loss or damage that may arise from your use of them. Different limitations and exclusions of liability will apply to liability arising as a result of the supply of any goods by use to you, which will be set out in our of sale or supply. UPLOADING CONTENT TO OUR SITE Whenever you make use of a feature that allows you to upload content to our site, or to make contact with other users of our site, you must comply with the content standards set out in our Acceptable Use Policy which is set out below. You warrant that any such contribution does comply with those standards, and you will be liable to us and indemnify us for any breach of that warranty. If you are a consumer user, this means you will be responsible for any loss or damage we suffer as a result of your breach of warranty. Any content you upload to our site will be considered non-confidential and non-proprietary. You retain all of your ownership rights in your content, but you are required to grant us and other users of the Site a limited licence to use, store and copy that content and to distribute and make it available to third parties. The rights you license to us are described in the next section ('Rights you licence'). We also have the right to disclose your identity to any third party who is claiming that any content posted or uploaded by you to our site constitutes a violation of their intellectual property rights, or of their right to privacy. We will not be responsible, or liable to any third party, for the content or accuracy of any content posted by you or any other user of our site. We have the right to remove any posting you make on our site if, in our opinion, your post does not comply with the content standards set out in our Acceptable Use Policy (which is set out below) The views expressed by other users on our site do not represent our views or values. You are solely responsible for securing and backing up your content. RIGHTS YOU LICENCE When you upload or post content to our site, you grant a non-exclusive licence to Reveal, its subsidiaries, employees, business partners, suppliers, and subcontractors to use the content for the purposes expressly or by implication permitted by your intention in posting or uploading such content, or as permitted by the of our . VIRUSES We do not guarantee that our site will be secure or free from bugs or viruses. You are responsible for configuring your information technology, computer programmes and platform in order to access our site. You should use your own virus protection software. You must not misuse our site by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorised access to our site, the server on which our site is stored or any server, computer or database connected to our site. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack. By breaching this provision, you would commit a criminal offense under the Computer Misuse Act 1990. We will report any such breach to the relevant law enforcement authorities and we will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use our site will cease immediately. LINKING TO OUR SITE You may link to our home page, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it. You must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part where none exists. You must not establish a link to our site in any website that is not owned by you. Our site must not be framed on any other site, nor may you create a link to any part of our site other than the home page. We reserve the right to withdraw linking permission without notice. The website in which you are linking must comply in all respects with the content standards set out in our Acceptable Use Policy which is set out below. If you wish to make any use of content on our site other than that set out above, please contact [email protected] . THIRD-PARTY LINKS AND RESOURCES IN OUR SITE Where our site contains links to other sites and resources provided by third parties, these links are provided for your information only. We have no control over the contents of those sites or resources. ACCEPTABLE USE POLICY This acceptable use policy applies to all users of, and visitors to, our site. Your use of our site means that you accept, and agree to abide by, all the policies in this policy. Prohibited Uses You may use our site only for lawful purposes. You may not use our site: In any way that breaches any applicable local, national or international law or regulation. In any way that is unlawful or fraudulent, or has any unlawful or fraudulent purpose or effect. For the purpose of harming or attempting to harm minors in any way. To send, knowingly receive, upload, download, use or re-use any material which does not comply with our content standards [INSERT AS LINK TO CONTENT STANDARDS BELOW]. To transmit, or procure the sending of, any unsolicited or unauthorised advertising or promotional material or any other form of similar solicitation (spam). To knowingly transmit any data, send or upload any material that contains viruses, Trojan horses, worms, time-bombs, keystroke loggers, spyware, adware or any other harmful programs or similar computer code designed to adversely affect the operation of any computer software or hardware. You also agree: Not to reproduce, duplicate, copy or re-sell any part of our site in contravention of the provisions of this of website use document (or any document referred to in it) Not to access without authority, interfere with, damage or disrupt: any part of our site; any equipment or network on which our site is stored; any software used in the provision of our site; or any equipment or network or software owned or used by any third party. Content Standards These content standards apply to any and all material which you contribute to our site (contributions), and to any interactive services associated with it. You must comply with the spirit and the letter of the following standards. The standards apply to each part of any contribution as well as to its whole. Contributions must: Be accurate (where they state facts). Be genuinely held (where they state opinions). Comply with applicable law in the UK and in any country from which they are posted. Contributions must not: Contain any material which is defamatory of any person. Contain any material which is obscene, offensive, hateful or inflammatory. Promote sexually explicit material. Promote violence. Promote discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe any copyright, database right or trade mark of any other person. Be likely to deceive any person. Be made in breach of any legal duty owed to a third party, such as a contractual duty or a duty of confidence. Promote any illegal activity. Be threatening, abuse or invade another's privacy, or cause annoyance, inconvenience or needless anxiety. Be likely to harass, upset, embarrass, alarm or annoy any other person. Be used to impersonate any person, or to misrepresent your identity or affiliation with any person. Give the impression that they emanate from us, if this is not the case. Advocate, promote or assist any unlawful act such as (by way of example only) copyright infringement or computer misuse. Suspension And Termination We will determine, in our discretion, whether there has been a breach of this acceptable use policy through your use of our site. When a breach of this policy has occurred, we may take such action as we deem appropriate. Failure to comply with this acceptable use policy constitutes a material breach of this of use document upon which you are permitted to use our site, and may result in our taking all or any of the following actions: Immediate, temporary or permanent withdrawal of your right to use our site. Immediate, temporary or permanent removal of any posting or material uploaded by you to our site. Issue of a warning to you. Legal proceedings against you for reimbursement of all costs on an indemnity basis (including, but not limited to, reasonable administrative and legal costs) resulting from the breach. Further legal action against you. Disclosure of such information to law enforcement authorities as we reasonably feel is necessary. We exclude liability for actions taken in response to breaches of this acceptable use policy. The responses described in this policy are not limited, and we may take any other action we reasonably deem appropriate. Changes To The Acceptable Use Policy We may revise this acceptable use policy at any time by amending this section. You are expected to check this document from time to time to take notice of any changes we make, as they are legally binding on you. Some of the provisions contained in this acceptable use policy may also be superseded by provisions or notices published elsewhere on our site. APPLICABLE LAW If you are a consumer, please note that these of use, its subject matter, and its formation, are governed by English law. You and we both agree to that the courts of England and Wales will have non-exclusive jurisdiction. However, if you are a resident of Northern Ireland you may also bring proceedings in Northern Ireland, and if you are a resident of Scotland, you may also bring proceedings in Scotland. If you are a business, these of use, its subject matter, and its formation (and any non-contractual disputes or claims) are governed by English law. We both agree to the exclusive jurisdiction of the courts of England and Wales. TRADEMARKS The word \"REVEAL\", the device, and \"D E M S\" are UK registered trademarks of REVEAL MEDIA LIMITED and are the subject of similar protection elsewhere in the world. CONTACT US To contact us, please email [email protected] . Thank you for visiting our site. of website use PLEASE READ THESE CAREFULLY BEFORE USING THIS SITE OF WEBSITE USE This of use document (together with the documents referred to in it) tell you the of use on which you may make use of our website www.Revealmedia.com and any other of our websites (collectively referred to as 'our site'), whether as a guest or a registered user. Use of our site includes accessing, browsing, or registering to use our site. Please read these of use carefully before you start to use our site, as these will apply to your use of our site. We recommend that you print a copy of this for future reference. By using our site, you confirm that you accept these of use and the acceptable use policy which is set out below and that you agree to comply with them. If you do not agree to these of use, you must not use our site. These of use refer to the following additional , which also apply to your use of our site: Our , which sets out the on which we process any personal data we collect from you, or that you provide to us. By using our site, you consent to such processing and you warrant that all data provided by you is accurate. This policy also sets out information about the cookies on our site and their use. If you purchase goods from our site, our of sale and/or supply will apply to the sales. www.revealmedia.com is a site operated by Reveal Media Limited (referred to as 'We', 'us', or 'Reveal' ). We are registered in England and Wales under company number 04470201 and have our registered office at C/O Grant Thornton Uk Llp, 300 Pavilion Drive, Northampton, NN4 7YE. Our main trading address Riverview House, 20 Old Bridge Street, Hampton Wick, Kingston upon Thames, KT1 4BU. Our VAT number is GB798532669. We are a limited company. CHANGES TO THESE We may revise these of use at any time by amending this page. Please check this page from time to time to take notice of any changes we made, as they are binding on you. CHANGES TO OUR SITE We may update our site from time to time and may change the content at any time. However, please note that any of the content on our site may be out of date at any given time, and we are under no obligation to update it. We do not guarantee that our site, or any content on it, will be free from errors or omissions. Our site is made available free of charge. We do not guarantee that our site, or any content on it, will always be available or be uninterrupted. Access to our site is permitted on a temporary basis. We may suspend, withdraw, discontinue or change all or any part of our site without notice. We will not be liable to you if for any reason our site is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to our site. You are also responsible for ensuring that all persons who access our site through your internet connection are aware of these of use and other applicable , and that they comply with them. We do not represent that content available on or through our site is appropriate or available in other locations other than the UK. We may limit the availability of our site or any service or product described on our site to any person or geographic area at any time. If you choose to access our site from outside the United Kingdom, you do so at your own risk. YOUR ACCOUNT AND PASSWORD If you choose, or you are provided with, a user identification code, password or any other piece of information as part of our security procedures, you must treat such information as confidential. You must not disclose it to any third party. We have the right to disable any user identification code or password, whether chosen by you or allocated by us, at any time, if in our reasonable opinion you have failed to comply with any of the provisions of these of use. If you know or suspect that anyone other than you knows your user identification code or password, you must promptly notify us at [email protected] . We are the owner or the licensee of all intellectual property rights in our site, and in the material published on it. Those works are protected by copyright laws and treaties around the world. All such rights are reserved. You may print off one copy, and may download extracts, of any page(s) from our site for your personal use and you may draw the attention of others within your organisation to content posted on our site. You must not modify the paper or digital copies of any materials you have printed off or downloaded in any way, and you must not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. You must always acknowledge our status (and that of any identified contributors) as the authors of content on our site. You must not use any part of the content on our site for commercial purposes without obtaining a licence to do so from us or our licensors. If you print off, copy or download any part of our site in breach of these of use, your right to use our site will cease immediately and you must, at our option, return or destroy any copies of the materials you have made. NO RELIANCE ON INFORMATION The content on our site is provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. Although we make reasonable efforts to update the information on our site, we make no representations, warranties or guarantees, whether express or implied, that the content on our site is accurate, complete or up-to-date. LIMITATION OF OUR LIABILITY Nothing in these of use excludes or limits our liability for death or personal injury arising from our negligence, or our fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by English law. To the extent permitted by law, we exclude all conditions, warranties, representations or other which may apply to our site or any content on it, whether express or implied. We will not be liable to any user for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with: use of, or inability to use, our site; or use of or reliance on any content displayed on our site. If you are a business user, please note that in particular, we will not be liable for: loss of profits, sales, business, or revenue; loss of anticipated savings; loss of business opportunity, goodwill or reputation; or any indirect or consequential loss or damage. If you are a consumer user, please note that we only provide our site for domestic and private use. You agree not to use our site for any commercial or business purposes, and we have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity. We will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of our site or to your downloading of any content on it, or on any website linked to it. We assume no responsibility for the content of websites linked on our site. Such links should not be interpreted as endorsement by us of those linked websites. We will not be liable for any loss or damage that may arise from your use of them. Different limitations and exclusions of liability will apply to liability arising as a result of the supply of any goods by use to you, which will be set out in our of sale or supply. UPLOADING CONTENT TO OUR SITE Whenever you make use of a feature that allows you to upload content to our site, or to make contact with other users of our site, you must comply with the content standards set out in our Acceptable Use Policy which is set out below. You warrant that any such contribution does comply with those standards, and you will be liable to us and indemnify us for any breach of that warranty. If you are a consumer user, this means you will be responsible for any loss or damage we suffer as a result of your breach of warranty. Any content you upload to our site will be considered non-confidential and non-proprietary. You retain all of your ownership rights in your content, but you are required to grant us and other users of the Site a limited licence to use, store and copy that content and to distribute and make it available to third parties. The rights you license to us are described in the next section ('Rights you licence'). We also have the right to disclose your identity to any third party who is claiming that any content posted or uploaded by you to our site constitutes a violation of their intellectual property rights, or of their right to privacy. We will not be responsible, or liable to any third party, for the content or accuracy of any content posted by you or any other user of our site. We have the right to remove any posting you make on our site if, in our opinion, your post does not comply with the content standards set out in our Acceptable Use Policy (which is set out below) The views expressed by other users on our site do not represent our views or values. You are solely responsible for securing and backing up your content. When you upload or post content to our site, you grant a non-exclusive licence to Reveal, its subsidiaries, employees, business partners, suppliers, and subcontractors to use the content for the purposes expressly or by implication permitted by your intention in posting or uploading such content, or as permitted by the of our . We do not guarantee that our site will be secure or free from bugs or viruses. You are responsible for configuring your information technology, computer programmes and platform in order to access our site. You should use your own virus protection software. You must not misuse our site by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorised access to our site, the server on which our site is stored or any server, computer or database connected to our site. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack. By breaching this provision, you would commit a criminal offense under the Computer Misuse Act 1990. We will report any such breach to the relevant law enforcement authorities and we will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use our site will cease immediately. LINKING TO OUR SITE You may link to our home page, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it. You must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part where none exists. You must not establish a link to our site in any website that is not owned by you. Our site must not be framed on any other site, nor may you create a link to any part of our site other than the home page. We reserve the right to withdraw linking permission without notice. The website in which you are linking must comply in all respects with the content standards set out in our Acceptable Use Policy which is set out below. If you wish to make any use of content on our site other than that set out above, please contact [email protected] . THIRD-PARTY LINKS AND RESOURCES IN OUR SITE Where our site contains links to other sites and resources provided by third parties, these links are provided for your information only. We have no control over the contents of those sites or resources. This acceptable use policy applies to all users of, and visitors to, our site. Your use of our site means that you accept, and agree to abide by, all the policies in this policy. You may use our site only for lawful purposes. You may not use our site: In any way that breaches any applicable local, national or international law or regulation. In any way that is unlawful or fraudulent, or has any unlawful or fraudulent purpose or effect. For the purpose of harming or attempting to harm minors in any way. To send, knowingly receive, upload, download, use or re-use any material which does not comply with our content standards [INSERT AS LINK TO CONTENT STANDARDS BELOW]. To transmit, or procure the sending of, any unsolicited or unauthorised advertising or promotional material or any other form of similar solicitation (spam). To knowingly transmit any data, send or upload any material that contains viruses, Trojan horses, worms, time-bombs, keystroke loggers, spyware, adware or any other harmful programs or similar computer code designed to adversely affect the operation of any computer software or hardware. Not to reproduce, duplicate, copy or re-sell any part of our site in contravention of the provisions of this of website use document (or any document referred to in it) Not to access without authority, interfere with, damage or disrupt: any part of our site; any equipment or network on which our site is stored; any software used in the provision of our site; or any equipment or network or software owned or used by any third party. any part of our site; any equipment or network on which our site is stored; any software used in the provision of our site; or any equipment or network or software owned or used by any third party. These content standards apply to any and all material which you contribute to our site (contributions), and to any interactive services associated with it. You must comply with the spirit and the letter of the following standards. The standards apply to each part of any contribution as well as to its whole. Be accurate (where they state facts). Be genuinely held (where they state opinions). Comply with applicable law in the UK and in any country from which they are posted. Contain any material which is defamatory of any person. Contain any material which is obscene, offensive, hateful or inflammatory. Promote sexually explicit material. Promote discrimination based on race, sex, religion, nationality, disability, sexual orientation or age. Infringe any copyright, database right or trade mark of any other person. Be likely to deceive any person. Be made in breach of any legal duty owed to a third party, such as a contractual duty or a duty of confidence. Promote any illegal activity. Be threatening, abuse or invade another's privacy, or cause annoyance, inconvenience or needless anxiety. Be likely to harass, upset, embarrass, alarm or annoy any other person. Be used to impersonate any person, or to misrepresent your identity or affiliation with any person. Give the impression that they emanate from us, if this is not the case. Advocate, promote or assist any unlawful act such as (by way of example only) copyright infringement or computer misuse. We will determine, in our discretion, whether there has been a breach of this acceptable use policy through your use of our site. When a breach of this policy has occurred, we may take such action as we deem appropriate. Failure to comply with this acceptable use policy constitutes a material breach of this of use document upon which you are permitted to use our site, and may result in our taking all or any of the following actions: Immediate, temporary or permanent withdrawal of your right to use our site. Immediate, temporary or permanent removal of any posting or material uploaded by you to our site. Issue of a warning to you. Legal proceedings against you for reimbursement of all costs on an indemnity basis (including, but not limited to, reasonable administrative and legal costs) resulting from the breach. Further legal action against you. Disclosure of such information to law enforcement authorities as we reasonably feel is necessary. We exclude liability for actions taken in response to breaches of this acceptable use policy. The responses described in this policy are not limited, and we may take any other action we reasonably deem appropriate. Changes To The Acceptable Use Policy We may revise this acceptable use policy at any time by amending this section. You are expected to check this document from time to time to take notice of any changes we make, as they are legally binding on you. Some of the provisions contained in this acceptable use policy may also be superseded by provisions or notices published elsewhere on our site. If you are a consumer, please note that these of use, its subject matter, and its formation, are governed by English law. You and we both agree to that the courts of England and Wales will have non-exclusive jurisdiction. However, if you are a resident of Northern Ireland you may also bring proceedings in Northern Ireland, and if you are a resident of Scotland, you may also bring proceedings in Scotland. If you are a business, these of use, its subject matter, and its formation (and any non-contractual disputes or claims) are governed by English law. We both agree to the exclusive jurisdiction of the courts of England and Wales. The word \"REVEAL\", the device, and \"D E M S\" are UK registered trademarks of REVEAL MEDIA LIMITED and are the subject of similar protection elsewhere in the world. To contact us, please email [email protected] . Thank you for visiting our site.",
    "Smart & Secure The class-leading feature-set and versatility of the D-Series make it a game-changer in the industry. Explore D-Series Small & Mighty A small, secure body camera with a front facing screen for those working in non-enforcement environments. Explore Calla See the future Our most powerful camera system yet, featuring AI, cellular streaming and touch-screen annotation. Explore K-Series Software Simply manage all of your digital evidence. Anytime. Anywhere. Dems 360 is our most advanced digital evidence management platform with a user-friendly interface streamlined to suit your workflow. Available on cloud, enterprise or standalone. Your choice. Explore DEMS 360 Accessories Choose from our vast collection of quality engineered accessories designed to complement our body-worn camera range. Accessories include: Docking Stations Smart Docks Klickfast Attachments Shoulder Mounts Harnesses Browse Accessories Smart & Secure The class-leading feature-set and versatility of the D-Series make it a game-changer in the industry. Explore D-Series Small & Mighty A small, secure body camera with a front facing screen for those working in non-enforcement environments. Explore Calla See the future Our most powerful camera system yet, featuring AI, cellular streaming and touch-screen annotation. Explore K-Series The class-leading feature-set and versatility of the D-Series make it a game-changer in the industry. A small, secure body camera with a front facing screen for those working in non-enforcement environments. Our most powerful camera system yet, featuring AI, cellular streaming and touch-screen annotation. Software Simply manage all of your digital evidence. Anytime. Anywhere. Dems 360 is our most advanced digital evidence management platform with a user-friendly interface streamlined to suit your workflow. Available on cloud, enterprise or standalone. Your choice. Explore DEMS 360 Simply manage all of your digital evidence. Anytime. Anywhere. Dems 360 is our most advanced digital evidence management platform with a user-friendly interface streamlined to suit your workflow. Available on cloud, enterprise or standalone. Your choice. Accessories Choose from our vast collection of quality engineered accessories designed to complement our body-worn camera range. Accessories include: Docking Stations Smart Docks Klickfast Attachments Shoulder Mounts Harnesses Browse Accessories Choose from our vast collection of quality engineered accessories designed to complement our body-worn camera range. Accessories include:"
  ]
}