{
  "company": "www.anduril.com",
  "dominant_topics": [
    2
  ],
  "topic_counts": {
    "2": 4
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.3,
    "framing_surveillance": 0.4,
    "framing_market": 0.3,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "2": 4
    }
  },
  "sample_docs": [
    "Some companies make software. Some make hardware. We do both. Lattice is an AI backbone that uses computer vision, machine learning and mesh networking to fuse real-time data into a single, autonomous operating picture. Each Anduril product houses a Lattice AI Core that performs sensor fusion, target classification and multi-track reconciliation at the edge. Lattice also integrates third-party data to further expand context for decision-making. Everything communicates through a resilient network to create real-time situational awareness so human operators can respond instantly and accurately with the best information possible. Sentry towers are equipped with the latest sensor and networking technology, using Lattice to fuse data from across the electromagnetic spectrum — from thermal to visible to RF. With a compact footprint, hardened onboard processing and solar power architecture, Sentry can be rapidly deployed and sustained with minimal maintenance in austere conditions. Sensor fusion and object detection are performed onboard in real-time, only sending user-filtered data for optimized communication and cognitive loads. Sentry is extensible and can be customized with mission-specific equipment ranging from sensors to power sources. Ghost 4 is an autonomous VTOL sUAS that operates on the Lattice AI platform. Ghost 4 is modular, man-portable, waterproof, and combines long endurance, high payload capacity and a near-silent acoustic signature for a wide variety of mission capabilities. Ghost 4 is designed and manufactured in the US to meet the needs of our military users. Ghost 4 provides real-time surveillance, intelligence, and reconnaissance capabilities, creating a clearer common operating picture which enables service men and women make more informed decisions. Anvil is the kinetic element of our end-to-end cUAS capability. Cued by Lattice, Anvil navigates autonomously to intercept potential drone threats and provide visual feedback for positive identification by a human operator. Once authorized, Anvil uses physical speed and onboard terminal guidance to deliver kinetic energy to the threat with minimal collateral damage. Our products actively support a wide range of missions. Here are some examples. We work directly with end users to solve their real-life problems and continuously improve our capabilities. We deploy engineers to the field, whether in training or in combat to validate our ideas under actual conditions. US Customs & Border Protection Patrol Agent We had no way to determine just how much traffic our sector really had until we installed the Sentry towers. \" US Northern Command Unified Combatant Command We started at 350 knots and accelerated to 400 knots, then 450 knots, 500 knots. Eventually we had a solid autonomous detection and ID within 1 second on an F-16 at 500 feet going 550 knots. \" UK Royal Marines 40 Commando What's different with Ghost is that it's built for soldiering purposes. It's always searching, it's constantly looking. This isn't just a drone with a camera, it's AI. \"",
    "Autonomy for Every Mission Lattice is an open operating system for defense that brings autonomy to the toughest missions. It enables men and women in uniform to move with machine speed, unparalleled confidence, and military-grade security by turning data into information, information into decisions, and decisions into actions across tactical and strategic operations. Real-Time Understanding Lattice cuts through the noise and creates a shared real-time understanding of the battlespace. It autonomously parses data from thousands of sensors & data sources into an intelligent common operating picture in a single pane of glass. Lattice uses technologies like sensor fusion, computer vision, edge computing, and machine learning and artificial intelligence to detect, track, and classify every object of interest in an operator's vicinity. Lattice cuts through the noise and creates a shared real-time understanding of the battlespace. It autonomously parses data from thousands of sensors & data sources into an intelligent common operating picture in a single pane of glass. Lattice uses technologies like sensor fusion, computer vision, edge computing, and machine learning and artificial intelligence to detect, track, and classify every object of interest in an operator's vicinity. Open & Extensible Software Platform Lattice's open architecture has proven integrations across third-party, legacy, and autonomous systems to work together in a single command and control mission engine. Scaling an infinite number of data sources, Lattice extends across tactical and strategic operations. Secure & Intelligent Mesh Network Lattice's mesh network is built to securely deploy to the most remote and contested areas. It removes the single point of failure risk associated with traditional hub and spoke models. Lattice intelligently categorizes, evaluates, and prioritizes the best path for information to flow, especially when there is limited bandwidth. Simple & Intuitive UI The Lattice User Interface (UI) elegantly allows users to visualize and interact with thousands of sensors and effectors in a single UI. Operators can seamlessly scale from tactical to strategic views. The Lattice UI spans web, desktop, mobile, and VR modalities to fit your need. Lattice OS for JADC2 Joint All-Domain Command and Control (JADC2) is one of the most important modernization priorities to confront challenges posed by strategic competition. Leveraging Lattice, we've approached JADC2 by building an open operating system for defense that is simple, scalable, extensible, and ultimately leverages machine intelligence to accelerate the closing of complex kill chains. Features Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. All-Domain Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Mission Autonomy Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Real-World Experiences Lattice for JADC2 has been built through real-world experiences and exercises Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. All-Domain Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Mission Autonomy Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Real-World Experiences Lattice for JADC2 has been built through real-world experiences and exercises Lattice for JADC2 has been built through real-world experiences and exercises \" Lattice is the eyes in the back of my head. \" Patrol Agent, US Customs & Border Protection \" Lattice helps us react better and more efficiently use the little bit of manpower we have… We need it and it's critically important… vitally important to control intrusions to protect this airspace. \" Marine Corps End User \" The artificial intelligence at the heart of this system has great potential to protect our people and sites. \" General Sir Patrick Sanders, UK Strategic Command \" Anduril's integrated security system is novel, powerful and, if successfully implemented and realized, could be as transformational for the character and conduct of war as the emergence of mechanization, flight and wireless communication. \" \" I believe that the Lattice system, when positioned in key areas, dramatically outpaces our current observation capabilities within the restricted area. \" US Marine Corps End User",
    "The scalable backbone of a rapidly deployable security network Sentry uses artificial intelligence to provide highly accurate, persistent autonomous awareness across land, sea and air. With an AI-enabled edge processing, continuous 360 pan / tilt and a variety of radars and sensors, Sentry can autonomously identify, detect and track objects of interest to bring increased security to borders, military bases, oil and gas pipelines, airports and other critical infrastructure. Green Technology Self powered via solar panels resulting in zero emissions while protecting local habitats & environments. Self powered via solar panels resulting in zero emissions while protecting local habitats & environments. Sensor Fusion at the Edge Sensor fusion and object detection are performed onboard in real-time. Anduril's computer vision algorithms present operators with decision points, not noise. Sensor Fusion at the Edge Sensor fusion and object detection are performed onboard in real-time. Anduril's computer vision algorithms present operators with decision points, not noise. Infrastructure Independent Designed to be used in the most challenging remote & austere conditions, without the need for roads, power sources, or connectivity, Designed to be used in the most challenging remote & austere conditions, without the need for roads, power sources, or connectivity, Customizable Modular and able to be equipped with mission-specific sensors & power sources. Modular and able to be equipped with mission-specific sensors & power sources. Rapidly Deployable Can be built and online in less than three hours. Can be built and online in less than three hours. Standard Range Sentry Tower The Standard Range Sentry Tower provides clear, long range surveillance of ground-based objects of interest day or night. 2.8 km Person; 3.5 km Vehicle 24 ft x 24 ft Long Range Sentry Tower The Long Range Sentry Tower is equipped with an ultra high powered, 360 radar designed to identify, classify and track group 1-3 drone threats. 2–4km for Group 1 threats, ​15km for Group 3+​ threats 16 ft x 16 ft Maritime Sentry Towers include radar designed to detect boats, jet skis, and other water-borne objects. 15 km+ for Surface Vessels​ 24 ft x 24 ft Mobile Sentry brings autonomous fixed site counter UAS and counter intrusion capabilities into a mobile form factor. 2–4km for Group 1 threats, ​15km for Group 3+​ threats 16 ft x 7 ft Cold Weather Sentry Tower Specifically designed for cold weather conditions, Cold Weather Sentry Towers are equipped with a generator & internal lens heaters to prevent frost on cameras. 2.8 km Person; 3.5 km Vehicle; 4.5km Boat 30 ft x 30 ft \"These towers give agents in the field a significant leg up against the criminal networks that facilitate illegal cross-border activity... The more our agents know about what they encounter in the field, the more safely and effectively they can respond.\" \"These towers have been amazing for us, a great asset because they can see what we can't see on the ground.\" Laredo Supervisory Patrol Agent \"Autonomous Surveillance Towers leverage cutting edge tech to improve border security. ASTs are tactically placed along the border, automatically detecting and tracking illegal border crossers. This infusion of technology is a force multiplier, greatly expanding our capabilities.\"",
    "Meet The Team Palmer Luckey Founder Palmer Luckey is an American inventor, innovator, and entrepreneur. He is the Founder of defense technology company Anduril Industries, designer of the Oculus Rift, a virtual reality head-mounted display, and the Founder of Oculus VR, which was acquired by Facebook in 2014 for $2.3b. Palmer founded Anduril Industries in 2017 to radically transform the defense capabilities of the United States and its allies by fusing artificial intelligence with the latest hardware advancements. At Anduril, Palmer integrates a consumer technology business model with mission-driven objectives, enabling rapid product development and deployment, setting the company apart from other players in the defense industry. His deep interest in defense technology was driven by his time at the USC ICT MxR lab, where he built hardware used to research immersive PTSD treatment for US veterans. He continued to support various military applications of VR during his time at Oculus, informing his belief that radical modernization of US military technology is a prerequisite for preserving our way of life. Palmer began attending Golden West College and Long Beach City College at the age of 14, and studied at California State University, Long Beach before dropping out to build Oculus VR. Brian Schimpf Co-Founder and CEO Brian Schimpf is Co-Founder and CEO of Anduril Industries where he drives the strategic direction and product roadmap of the defense technology company. Prior to Anduril, Brian was Director of Engineering at Palantir Technologies, where he led a large engineering organization developing and deploying data integration and analysis products. He served numerous domestic and international government organizations across the intelligence, defense, and law enforcement sectors. Trae' Stephens Co-Founder & Executive Chairman Trae' Stephens is Co-founder and Executive Chairman of Anduril Industries, a defense technology company, and a Partner at venture capital firm Founders Fund, where he invests across sectors with a particular interest in startups operating in the government space. Previously, Trae' was an early employee at Palantir Technologies, where he led teams focused on growth in the intelligence/defense space as well as international expansion, helping large organizations solve their hardest data analysis problems. He was also an integral part of the product team, leading the design and strategy for new product offerings. While at Palantir, Trae' also served as an adjunct faculty member at Georgetown University. Prior to Palantir, Trae' worked as a computational linguist building enterprise solutions to Arabic/Persian name matching and data enrichment within the United States Intelligence community. He began his career working in the office of then Congressman Rob Portman and in the Political Affairs Office at the Embassy of Afghanistan in Washington, DC immediately following the installation of Hamid Karzai's transitional government. Trae' graduated from the School of Foreign Service at Georgetown University. Matt Grimm Co-Founder & COO Matt Grimm is Co-Founder and COO of Anduril Industries where he oversees all global business operations, including procurement, manufacturing and supply chain initiatives, facilities and security, people management and finance. Prior to Anduril, Matt was a Principal at Mithril Capital Management where he invested in growth-stage companies. Previously, Matt was an early hire at Palantir, where he worked in both operational and technical roles. At Palantir, Matt deployed to both Iraq and Afghanistan to ensure U.S. forces had the best technology for the mission. Prior to Palantir, Matt was a consultant for Booz Allen Hamilton where he advised the Defense Intelligence Agency and The United States Navy. While classmates at Cornell University, Matt co-founded with Brian Schimpf the university's autonomous vehicle entry into the DARPA Grand Challenge and Urban Challenge competitions. He graduated from Cornell with both a Bachelor of Science in Mechanical and Aerospace Engineering and a Master of Engineering in Systems Engineering. Joseph Chen Co-Founder After 10 years in engineering and product development, Joseph enlisted in the US Army National Guard to serve his country and community as a paratrooper in the 1-143rd Infantry Battalion (Airborne). Preceding Anduril, Joseph was one of the first employees at Oculus VR, where he contributed to hardware development as Product Lead and led non-gaming developer relations. After Oculus, he continued to develop VR content, focusing on new camera technologies and capture techniques. Joseph graduated from Rice University with a Bachelor of Arts in Electrical Engineering and the University of Southern California with a Master of Business Administration. Matthew Steckman Chief Revenue Officer Matthew Steckman is Chief Revenue Officer for Anduril Industries. He is responsible for new business and customer success with a focus on U.S. and international governments as well as large companies facing infrastructure security challenges. Prior to Anduril, Matt served as Chief Revenue Officer for Zipline International, the world's first drone delivery company focusing on medical and blood products. He divided his time between the U.S. and emerging markets and forged a first-of-its-kind partnership with the U.S. Government to provide Zipline's lifesaving service to rural communities. Previously, Matt held several leadership positions at Palantir Technologies, running internal business operations and owning relationships with the company's largest customers. Matt holds degrees in Computer Science and International Affairs from Georgetown University. Christian Brose Chief Strategy Officer Christian Brose is the Chief Strategy Officer at Anduril Industries, a Senior Fellow at the Carnegie Endowment for International Peace, and author of The Kill Chain: Defending America in the Future of High Tech Warfare . Brose joined Anduril in 2018 from Capitol Hill where he served as staff director of the Senate Armed Services Committee for three years, managing the Committee's staff and overseeing all programs, policies, and resources of the Department of Defense. From 2009-2014, he served as senior policy adviser to Senator John McCain (R-AZ), supporting his work on the Senate Armed Services Committee, the Senate Select Committee on Intelligence, and the Senate Foreign Relations Committee. Prior to that, he served as policy adviser and chief speechwriter to Secretary of State Condoleezza Rice from 2005-2008, working as a member of the Secretary's Policy Planning Staff and supporting the Secretary on regular foreign travel. He began his career in public service as a speechwriter for Secretary of State Colin Powell. He studied political science at Kenyon College and international economics at the Johns Hopkins University's School of Advanced International Studies. He is a member of the Aspen Strategy Group and a former editor of Foreign Policy Magazine. Michael Galvin Chief Financial Officer Michael Galvin is the Chief Financial Officer of Anduril Industries where he oversees all financial operations at the company. Michael joined Anduril in 2021. Prior to Anduril, he served as the Chief Financial Officer of both public and private companies, including Aruba Networks and PlanGrid, and Vice President of Finance at BEA Systems. His experience includes two IPOs and leading his last 3 companies through major acquisitions. Michael began his finance career in investment banking at Merrill Lynch in New York City. Michael holds an MBA in Finance and Accounting from UCLA and a Bachelor of Arts in Economics from the University of Notre Dame. Megan Milam Head of Government Relations Megan Milam is the Head of Government Relations for Anduril Industries. In this role, she is responsible for developing and implementing Anduril's government affairs strategy with the legislative and executive branches. Megan has held multiple roles in the executive and legislative branches of government. She was the Deputy Comptroller (Budget and Appropriations Affairs) at Department of Defense, where she served as the senior advisor to the Secretary of Defense and DoD senior leadership on congressional appropriations matters and the Department's lead interface with the congressional appropriations committees. She was most recently the Director of the Office of Policy and Strategic Planning at Department of Energy/National Nuclear Security Administration (NNSA). Previously, Ms. Milam served as Professional Staff Member for the House Appropriations Committee, Subcommittee on Defense, responsible for overseeing funding and policies related to the Department of Defense and Intelligence Community. She was previously the Appropriations Associate for Congressman Mike Simpson (ID-02). Ms. Milam received her Masters of Science degree from the University of Edinburgh, Scotland and her Bachelor of Arts degree from Princeton University. She also serves on the NDIA Board of Directors. Zachary Mears Head of Strategy Zachary Mears is the head of strategy at Anduril. Previously, Dr. Mears was a senior advisor at Covington and Burling, where he advised companies in the aerospace, defense, and national security sector navigate policy and regulatory challenges involving the U.S. Congress and Executive Branch. Dr. Mears has extensive experience in U.S. national security and defense strategy, planning, and resourcing, most recently serving as Chief of Staff to the Deputy Secretary of Defense and Deputy Chief of Staff to the Secretary of Defense. Dr. Mears also advised the Defense Innovation Unit, which is building bridges between the Pentagon and the high technology centers in Silicon Valley, Boston, and Austin. His substantive areas of expertise include strategic planning, risk assessment and management, and advanced technologies. Dr. Mears is a graduate of The Ohio State University where he earned a Doctorate of Philosophy degree in political science. Shannon Prior Head of Communications Shannon Prior is the Head of Communications at Anduril, where she drives Anduril's global narrative through transparent and informative storytelling. In this role, Shannon oversees corporate communications strategy and execution including product, executive and employee communications, media relations, social media strategy and analyst relations for the defense technology company. Prior to Anduril, Shannon held senior corporate communications roles at Hulu where she led communications for Hulu's business, products, technology, data, strategic partnerships and emerging initiatives. Most notably, Shannon led the communications strategy and execution behind Hulu's successful entrance to the live TV streaming space. ‍ Previously, Shannon held product communications roles at Mozilla where she was responsible for communications around the global releases of Firefox, Firefox for Android and Firefox OS. Shannon is a graduate of California State University, Chico, where she earned a bachelor's degree in journalism with an emphasis in public relations. Babak Siavoshy VP & General Counsel Babak Siavoshy is VP and General Counsel at Anduril Industries, where he advises Anduril's board and management on legal and policy matters and leads the company's legal, regulatory, and procurement functions. Prior to joining Anduril, Babak served in a number of roles at data analytics firm Palantir Technologies, most recently leading Palantir's global data compliance team and managing key commercial and government contracts. Before joining Palantir, Babak worked in various roles focusing on the law and policy of emerging technologies: at the Berkeley Samuelson Law and Technology Clinic; at Georgetown's Center on National Security and the Law; and as an advisor to California Attorney General's office on consumer privacy and technology policy issues. As an associate at O'Melveny & Myers, Babak co-authored the winning brief in United States v. Jones, which resulted in one of the Supreme Court's most notable privacy rulings in a decade. Babak served as a law clerk to the Honorable John T. Noonan, Jr., on the United States Court of Appeals for the Ninth Circuit in San Francisco. He is a graduate of UC Berkeley, earning a law degree and bachelor's degrees in English and in philosophy. Gregory Kausner Head of Global Defense Gregory Kausner joined Anduril Industries as the Head of Global Defense in 2022. Previously, he held leadership roles in the Department of Defense, Department of State, on Capitol Hill, and served in the U.S. Navy as an aviator. At the Department of Defense, Greg performed the duties of Under and Deputy Under Secretary of Defense for Acquisition and Sustainment, served as Executive Director for International Cooperation in the Office of the Secretary of Defense, and was the Deputy Director of the Defense Security Cooperation Agency. At State, he was a Senior Advisor to the Under Secretary for Arms Control and International Security and the Deputy Assistant Secretary for Political Military Affairs. In the Senate, Greg served as a Senior Professional Staff Member on the Foreign Relations Committee. As a Naval Officer, he piloted F-14s and F/A-18s, represented the Navy to Congress as a Senate Liaison, mobilized as the Deputy Director of the Naval and Amphibious Liaison Element, and conducted Reserve assignments to the Defense Innovation Unit, the Office of the Chief of Naval Operations, and the Office of Naval Intelligence. Greg is the recipient of the Defense Medal for Exceptional Civilian Service, the Defense Medal for Meritorious Civilian Service, the Secretary of State's Award for Excellence in International Security Affairs, the Meritorious Service Medal, the Air Medal-Individual Action (with Combat V), and the Air Medal (Strike Flight). He studied International Relations at the University of Delaware and earned an M.A. in Security Studies from Georgetown University Palmer Luckey Founder Palmer Luckey is an American inventor, innovator, and entrepreneur. He is the Founder of defense technology company Anduril Industries, designer of the Oculus Rift, a virtual reality head-mounted display, and the Founder of Oculus VR, which was acquired by Facebook in 2014 for $2.3b. Palmer founded Anduril Industries in 2017 to radically transform the defense capabilities of the United States and its allies by fusing artificial intelligence with the latest hardware advancements. At Anduril, Palmer integrates a consumer technology business model with mission-driven objectives, enabling rapid product development and deployment, setting the company apart from other players in the defense industry. His deep interest in defense technology was driven by his time at the USC ICT MxR lab, where he built hardware used to research immersive PTSD treatment for US veterans. He continued to support various military applications of VR during his time at Oculus, informing his belief that radical modernization of US military technology is a prerequisite for preserving our way of life. Palmer began attending Golden West College and Long Beach City College at the age of 14, and studied at California State University, Long Beach before dropping out to build Oculus VR. Palmer Luckey is an American inventor, innovator, and entrepreneur. He is the Founder of defense technology company Anduril Industries, designer of the Oculus Rift, a virtual reality head-mounted display, and the Founder of Oculus VR, which was acquired by Facebook in 2014 for $2.3b. Palmer founded Anduril Industries in 2017 to radically transform the defense capabilities of the United States and its allies by fusing artificial intelligence with the latest hardware advancements. At Anduril, Palmer integrates a consumer technology business model with mission-driven objectives, enabling rapid product development and deployment, setting the company apart from other players in the defense industry. His deep interest in defense technology was driven by his time at the USC ICT MxR lab, where he built hardware used to research immersive PTSD treatment for US veterans. He continued to support various military applications of VR during his time at Oculus, informing his belief that radical modernization of US military technology is a prerequisite for preserving our way of life. Palmer began attending Golden West College and Long Beach City College at the age of 14, and studied at California State University, Long Beach before dropping out to build Oculus VR. Brian Schimpf Co-Founder and CEO Brian Schimpf is Co-Founder and CEO of Anduril Industries where he drives the strategic direction and product roadmap of the defense technology company. Prior to Anduril, Brian was Director of Engineering at Palantir Technologies, where he led a large engineering organization developing and deploying data integration and analysis products. He served numerous domestic and international government organizations across the intelligence, defense, and law enforcement sectors. Brian Schimpf is Co-Founder and CEO of Anduril Industries where he drives the strategic direction and product roadmap of the defense technology company. Prior to Anduril, Brian was Director of Engineering at Palantir Technologies, where he led a large engineering organization developing and deploying data integration and analysis products. He served numerous domestic and international government organizations across the intelligence, defense, and law enforcement sectors. Trae' Stephens Co-Founder & Executive Chairman Trae' Stephens is Co-founder and Executive Chairman of Anduril Industries, a defense technology company, and a Partner at venture capital firm Founders Fund, where he invests across sectors with a particular interest in startups operating in the government space. Previously, Trae' was an early employee at Palantir Technologies, where he led teams focused on growth in the intelligence/defense space as well as international expansion, helping large organizations solve their hardest data analysis problems. He was also an integral part of the product team, leading the design and strategy for new product offerings. While at Palantir, Trae' also served as an adjunct faculty member at Georgetown University. Prior to Palantir, Trae' worked as a computational linguist building enterprise solutions to Arabic/Persian name matching and data enrichment within the United States Intelligence community. He began his career working in the office of then Congressman Rob Portman and in the Political Affairs Office at the Embassy of Afghanistan in Washington, DC immediately following the installation of Hamid Karzai's transitional government. Trae' graduated from the School of Foreign Service at Georgetown University. Co-Founder & Executive Chairman Trae' Stephens is Co-founder and Executive Chairman of Anduril Industries, a defense technology company, and a Partner at venture capital firm Founders Fund, where he invests across sectors with a particular interest in startups operating in the government space. Previously, Trae' was an early employee at Palantir Technologies, where he led teams focused on growth in the intelligence/defense space as well as international expansion, helping large organizations solve their hardest data analysis problems. He was also an integral part of the product team, leading the design and strategy for new product offerings. While at Palantir, Trae' also served as an adjunct faculty member at Georgetown University. Prior to Palantir, Trae' worked as a computational linguist building enterprise solutions to Arabic/Persian name matching and data enrichment within the United States Intelligence community. He began his career working in the office of then Congressman Rob Portman and in the Political Affairs Office at the Embassy of Afghanistan in Washington, DC immediately following the installation of Hamid Karzai's transitional government. Trae' graduated from the School of Foreign Service at Georgetown University. Matt Grimm Co-Founder & COO Matt Grimm is Co-Founder and COO of Anduril Industries where he oversees all global business operations, including procurement, manufacturing and supply chain initiatives, facilities and security, people management and finance. Prior to Anduril, Matt was a Principal at Mithril Capital Management where he invested in growth-stage companies. Previously, Matt was an early hire at Palantir, where he worked in both operational and technical roles. At Palantir, Matt deployed to both Iraq and Afghanistan to ensure U.S. forces had the best technology for the mission. Prior to Palantir, Matt was a consultant for Booz Allen Hamilton where he advised the Defense Intelligence Agency and The United States Navy. While classmates at Cornell University, Matt co-founded with Brian Schimpf the university's autonomous vehicle entry into the DARPA Grand Challenge and Urban Challenge competitions. He graduated from Cornell with both a Bachelor of Science in Mechanical and Aerospace Engineering and a Master of Engineering in Systems Engineering. Matt Grimm is Co-Founder and COO of Anduril Industries where he oversees all global business operations, including procurement, manufacturing and supply chain initiatives, facilities and security, people management and finance. Prior to Anduril, Matt was a Principal at Mithril Capital Management where he invested in growth-stage companies. Previously, Matt was an early hire at Palantir, where he worked in both operational and technical roles. At Palantir, Matt deployed to both Iraq and Afghanistan to ensure U.S. forces had the best technology for the mission. Prior to Palantir, Matt was a consultant for Booz Allen Hamilton where he advised the Defense Intelligence Agency and The United States Navy. While classmates at Cornell University, Matt co-founded with Brian Schimpf the university's autonomous vehicle entry into the DARPA Grand Challenge and Urban Challenge competitions. He graduated from Cornell with both a Bachelor of Science in Mechanical and Aerospace Engineering and a Master of Engineering in Systems Engineering. Joseph Chen Co-Founder After 10 years in engineering and product development, Joseph enlisted in the US Army National Guard to serve his country and community as a paratrooper in the 1-143rd Infantry Battalion (Airborne). Preceding Anduril, Joseph was one of the first employees at Oculus VR, where he contributed to hardware development as Product Lead and led non-gaming developer relations. After Oculus, he continued to develop VR content, focusing on new camera technologies and capture techniques. Joseph graduated from Rice University with a Bachelor of Arts in Electrical Engineering and the University of Southern California with a Master of Business Administration. Co-Founder After 10 years in engineering and product development, Joseph enlisted in the US Army National Guard to serve his country and community as a paratrooper in the 1-143rd Infantry Battalion (Airborne). Preceding Anduril, Joseph was one of the first employees at Oculus VR, where he contributed to hardware development as Product Lead and led non-gaming developer relations. After Oculus, he continued to develop VR content, focusing on new camera technologies and capture techniques. Joseph graduated from Rice University with a Bachelor of Arts in Electrical Engineering and the University of Southern California with a Master of Business Administration. Matthew Steckman Chief Revenue Officer Matthew Steckman is Chief Revenue Officer for Anduril Industries. He is responsible for new business and customer success with a focus on U.S. and international governments as well as large companies facing infrastructure security challenges. Prior to Anduril, Matt served as Chief Revenue Officer for Zipline International, the world's first drone delivery company focusing on medical and blood products. He divided his time between the U.S. and emerging markets and forged a first-of-its-kind partnership with the U.S. Government to provide Zipline's lifesaving service to rural communities. Previously, Matt held several leadership positions at Palantir Technologies, running internal business operations and owning relationships with the company's largest customers. Matt holds degrees in Computer Science and International Affairs from Georgetown University. Matthew Steckman is Chief Revenue Officer for Anduril Industries. He is responsible for new business and customer success with a focus on U.S. and international governments as well as large companies facing infrastructure security challenges. Prior to Anduril, Matt served as Chief Revenue Officer for Zipline International, the world's first drone delivery company focusing on medical and blood products. He divided his time between the U.S. and emerging markets and forged a first-of-its-kind partnership with the U.S. Government to provide Zipline's lifesaving service to rural communities. Previously, Matt held several leadership positions at Palantir Technologies, running internal business operations and owning relationships with the company's largest customers. Matt holds degrees in Computer Science and International Affairs from Georgetown University. Christian Brose Chief Strategy Officer Christian Brose is the Chief Strategy Officer at Anduril Industries, a Senior Fellow at the Carnegie Endowment for International Peace, and author of The Kill Chain: Defending America in the Future of High Tech Warfare . Brose joined Anduril in 2018 from Capitol Hill where he served as staff director of the Senate Armed Services Committee for three years, managing the Committee's staff and overseeing all programs, policies, and resources of the Department of Defense. From 2009-2014, he served as senior policy adviser to Senator John McCain (R-AZ), supporting his work on the Senate Armed Services Committee, the Senate Select Committee on Intelligence, and the Senate Foreign Relations Committee. Prior to that, he served as policy adviser and chief speechwriter to Secretary of State Condoleezza Rice from 2005-2008, working as a member of the Secretary's Policy Planning Staff and supporting the Secretary on regular foreign travel. He began his career in public service as a speechwriter for Secretary of State Colin Powell. He studied political science at Kenyon College and international economics at the Johns Hopkins University's School of Advanced International Studies. He is a member of the Aspen Strategy Group and a former editor of Foreign Policy Magazine. Christian Brose is the Chief Strategy Officer at Anduril Industries, a Senior Fellow at the Carnegie Endowment for International Peace, and author of The Kill Chain: Defending America in the Future of High Tech Warfare . Brose joined Anduril in 2018 from Capitol Hill where he served as staff director of the Senate Armed Services Committee for three years, managing the Committee's staff and overseeing all programs, policies, and resources of the Department of Defense. From 2009-2014, he served as senior policy adviser to Senator John McCain (R-AZ), supporting his work on the Senate Armed Services Committee, the Senate Select Committee on Intelligence, and the Senate Foreign Relations Committee. Prior to that, he served as policy adviser and chief speechwriter to Secretary of State Condoleezza Rice from 2005-2008, working as a member of the Secretary's Policy Planning Staff and supporting the Secretary on regular foreign travel. He began his career in public service as a speechwriter for Secretary of State Colin Powell. He studied political science at Kenyon College and international economics at the Johns Hopkins University's School of Advanced International Studies. He is a member of the Aspen Strategy Group and a former editor of Foreign Policy Magazine. Michael Galvin Chief Financial Officer Michael Galvin is the Chief Financial Officer of Anduril Industries where he oversees all financial operations at the company. Michael joined Anduril in 2021. Prior to Anduril, he served as the Chief Financial Officer of both public and private companies, including Aruba Networks and PlanGrid, and Vice President of Finance at BEA Systems. His experience includes two IPOs and leading his last 3 companies through major acquisitions. Michael began his finance career in investment banking at Merrill Lynch in New York City. Michael holds an MBA in Finance and Accounting from UCLA and a Bachelor of Arts in Economics from the University of Notre Dame. Michael Galvin is the Chief Financial Officer of Anduril Industries where he oversees all financial operations at the company. Michael joined Anduril in 2021. Prior to Anduril, he served as the Chief Financial Officer of both public and private companies, including Aruba Networks and PlanGrid, and Vice President of Finance at BEA Systems. His experience includes two IPOs and leading his last 3 companies through major acquisitions. Michael began his finance career in investment banking at Merrill Lynch in New York City. Michael holds an MBA in Finance and Accounting from UCLA and a Bachelor of Arts in Economics from the University of Notre Dame. Megan Milam Head of Government Relations Megan Milam is the Head of Government Relations for Anduril Industries. In this role, she is responsible for developing and implementing Anduril's government affairs strategy with the legislative and executive branches. Megan has held multiple roles in the executive and legislative branches of government. She was the Deputy Comptroller (Budget and Appropriations Affairs) at Department of Defense, where she served as the senior advisor to the Secretary of Defense and DoD senior leadership on congressional appropriations matters and the Department's lead interface with the congressional appropriations committees. She was most recently the Director of the Office of Policy and Strategic Planning at Department of Energy/National Nuclear Security Administration (NNSA). Previously, Ms. Milam served as Professional Staff Member for the House Appropriations Committee, Subcommittee on Defense, responsible for overseeing funding and policies related to the Department of Defense and Intelligence Community. She was previously the Appropriations Associate for Congressman Mike Simpson (ID-02). Ms. Milam received her Masters of Science degree from the University of Edinburgh, Scotland and her Bachelor of Arts degree from Princeton University. She also serves on the NDIA Board of Directors. Head of Government Relations Megan Milam is the Head of Government Relations for Anduril Industries. In this role, she is responsible for developing and implementing Anduril's government affairs strategy with the legislative and executive branches. Megan has held multiple roles in the executive and legislative branches of government. She was the Deputy Comptroller (Budget and Appropriations Affairs) at Department of Defense, where she served as the senior advisor to the Secretary of Defense and DoD senior leadership on congressional appropriations matters and the Department's lead interface with the congressional appropriations committees. She was most recently the Director of the Office of Policy and Strategic Planning at Department of Energy/National Nuclear Security Administration (NNSA). Previously, Ms. Milam served as Professional Staff Member for the House Appropriations Committee, Subcommittee on Defense, responsible for overseeing funding and policies related to the Department of Defense and Intelligence Community. She was previously the Appropriations Associate for Congressman Mike Simpson (ID-02). Ms. Milam received her Masters of Science degree from the University of Edinburgh, Scotland and her Bachelor of Arts degree from Princeton University. She also serves on the NDIA Board of Directors. Zachary Mears Head of Strategy Zachary Mears is the head of strategy at Anduril. Previously, Dr. Mears was a senior advisor at Covington and Burling, where he advised companies in the aerospace, defense, and national security sector navigate policy and regulatory challenges involving the U.S. Congress and Executive Branch. Dr. Mears has extensive experience in U.S. national security and defense strategy, planning, and resourcing, most recently serving as Chief of Staff to the Deputy Secretary of Defense and Deputy Chief of Staff to the Secretary of Defense. Dr. Mears also advised the Defense Innovation Unit, which is building bridges between the Pentagon and the high technology centers in Silicon Valley, Boston, and Austin. His substantive areas of expertise include strategic planning, risk assessment and management, and advanced technologies. Dr. Mears is a graduate of The Ohio State University where he earned a Doctorate of Philosophy degree in political science. Zachary Mears is the head of strategy at Anduril. Previously, Dr. Mears was a senior advisor at Covington and Burling, where he advised companies in the aerospace, defense, and national security sector navigate policy and regulatory challenges involving the U.S. Congress and Executive Branch. Dr. Mears has extensive experience in U.S. national security and defense strategy, planning, and resourcing, most recently serving as Chief of Staff to the Deputy Secretary of Defense and Deputy Chief of Staff to the Secretary of Defense. Dr. Mears also advised the Defense Innovation Unit, which is building bridges between the Pentagon and the high technology centers in Silicon Valley, Boston, and Austin. His substantive areas of expertise include strategic planning, risk assessment and management, and advanced technologies. Dr. Mears is a graduate of The Ohio State University where he earned a Doctorate of Philosophy degree in political science. Shannon Prior Head of Communications Shannon Prior is the Head of Communications at Anduril, where she drives Anduril's global narrative through transparent and informative storytelling. In this role, Shannon oversees corporate communications strategy and execution including product, executive and employee communications, media relations, social media strategy and analyst relations for the defense technology company. Prior to Anduril, Shannon held senior corporate communications roles at Hulu where she led communications for Hulu's business, products, technology, data, strategic partnerships and emerging initiatives. Most notably, Shannon led the communications strategy and execution behind Hulu's successful entrance to the live TV streaming space. ‍ Previously, Shannon held product communications roles at Mozilla where she was responsible for communications around the global releases of Firefox, Firefox for Android and Firefox OS. Shannon is a graduate of California State University, Chico, where she earned a bachelor's degree in journalism with an emphasis in public relations. Shannon Prior is the Head of Communications at Anduril, where she drives Anduril's global narrative through transparent and informative storytelling. In this role, Shannon oversees corporate communications strategy and execution including product, executive and employee communications, media relations, social media strategy and analyst relations for the defense technology company. Prior to Anduril, Shannon held senior corporate communications roles at Hulu where she led communications for Hulu's business, products, technology, data, strategic partnerships and emerging initiatives. Most notably, Shannon led the communications strategy and execution behind Hulu's successful entrance to the live TV streaming space. ‍ Previously, Shannon held product communications roles at Mozilla where she was responsible for communications around the global releases of Firefox, Firefox for Android and Firefox OS. Shannon is a graduate of California State University, Chico, where she earned a bachelor's degree in journalism with an emphasis in public relations. Babak Siavoshy VP & General Counsel Babak Siavoshy is VP and General Counsel at Anduril Industries, where he advises Anduril's board and management on legal and policy matters and leads the company's legal, regulatory, and procurement functions. Prior to joining Anduril, Babak served in a number of roles at data analytics firm Palantir Technologies, most recently leading Palantir's global data compliance team and managing key commercial and government contracts. Before joining Palantir, Babak worked in various roles focusing on the law and policy of emerging technologies: at the Berkeley Samuelson Law and Technology Clinic; at Georgetown's Center on National Security and the Law; and as an advisor to California Attorney General's office on consumer privacy and technology policy issues. As an associate at O'Melveny & Myers, Babak co-authored the winning brief in United States v. Jones, which resulted in one of the Supreme Court's most notable privacy rulings in a decade. Babak served as a law clerk to the Honorable John T. Noonan, Jr., on the United States Court of Appeals for the Ninth Circuit in San Francisco. He is a graduate of UC Berkeley, earning a law degree and bachelor's degrees in English and in philosophy. VP & General Counsel Babak Siavoshy is VP and General Counsel at Anduril Industries, where he advises Anduril's board and management on legal and policy matters and leads the company's legal, regulatory, and procurement functions. Prior to joining Anduril, Babak served in a number of roles at data analytics firm Palantir Technologies, most recently leading Palantir's global data compliance team and managing key commercial and government contracts. Before joining Palantir, Babak worked in various roles focusing on the law and policy of emerging technologies: at the Berkeley Samuelson Law and Technology Clinic; at Georgetown's Center on National Security and the Law; and as an advisor to California Attorney General's office on consumer privacy and technology policy issues. As an associate at O'Melveny & Myers, Babak co-authored the winning brief in United States v. Jones, which resulted in one of the Supreme Court's most notable privacy rulings in a decade. Babak served as a law clerk to the Honorable John T. Noonan, Jr., on the United States Court of Appeals for the Ninth Circuit in San Francisco. He is a graduate of UC Berkeley, earning a law degree and bachelor's degrees in English and in philosophy. Gregory Kausner Head of Global Defense Gregory Kausner joined Anduril Industries as the Head of Global Defense in 2022. Previously, he held leadership roles in the Department of Defense, Department of State, on Capitol Hill, and served in the U.S. Navy as an aviator. At the Department of Defense, Greg performed the duties of Under and Deputy Under Secretary of Defense for Acquisition and Sustainment, served as Executive Director for International Cooperation in the Office of the Secretary of Defense, and was the Deputy Director of the Defense Security Cooperation Agency. At State, he was a Senior Advisor to the Under Secretary for Arms Control and International Security and the Deputy Assistant Secretary for Political Military Affairs. In the Senate, Greg served as a Senior Professional Staff Member on the Foreign Relations Committee. As a Naval Officer, he piloted F-14s and F/A-18s, represented the Navy to Congress as a Senate Liaison, mobilized as the Deputy Director of the Naval and Amphibious Liaison Element, and conducted Reserve assignments to the Defense Innovation Unit, the Office of the Chief of Naval Operations, and the Office of Naval Intelligence. Greg is the recipient of the Defense Medal for Exceptional Civilian Service, the Defense Medal for Meritorious Civilian Service, the Secretary of State's Award for Excellence in International Security Affairs, the Meritorious Service Medal, the Air Medal-Individual Action (with Combat V), and the Air Medal (Strike Flight). He studied International Relations at the University of Delaware and earned an M.A. in Security Studies from Georgetown University Head of Global Defense Gregory Kausner joined Anduril Industries as the Head of Global Defense in 2022. Previously, he held leadership roles in the Department of Defense, Department of State, on Capitol Hill, and served in the U.S. Navy as an aviator. At the Department of Defense, Greg performed the duties of Under and Deputy Under Secretary of Defense for Acquisition and Sustainment, served as Executive Director for International Cooperation in the Office of the Secretary of Defense, and was the Deputy Director of the Defense Security Cooperation Agency. At State, he was a Senior Advisor to the Under Secretary for Arms Control and International Security and the Deputy Assistant Secretary for Political Military Affairs. In the Senate, Greg served as a Senior Professional Staff Member on the Foreign Relations Committee. As a Naval Officer, he piloted F-14s and F/A-18s, represented the Navy to Congress as a Senate Liaison, mobilized as the Deputy Director of the Naval and Amphibious Liaison Element, and conducted Reserve assignments to the Defense Innovation Unit, the Office of the Chief of Naval Operations, and the Office of Naval Intelligence. Greg is the recipient of the Defense Medal for Exceptional Civilian Service, the Defense Medal for Meritorious Civilian Service, the Secretary of State's Award for Excellence in International Security Affairs, the Meritorious Service Medal, the Air Medal-Individual Action (with Combat V), and the Air Medal (Strike Flight). He studied International Relations at the University of Delaware and earned an M.A. in Security Studies from Georgetown University"
  ]
}