{
  "company": "www.meerkat.com.br",
  "dominant_topics": [
    1,
    -1,
    0,
    2
  ],
  "topic_counts": {
    "1": 5,
    "-1": 4,
    "0": 4,
    "2": 3
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.7272727272727273,
    "framing_surveillance": 0.0,
    "framing_market": 0.2727272727272727,
    "num_docs": 16
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 4,
      "1": 5,
      "2": 3
    }
  },
  "sample_docs": [
    "We just release version 5.0 of our facial recognition API based on deeplearning techniques. Please checkout our Medium post about it. Facial Recognition See more about it Features Simple No installation required, just start calling the Restful API for training and recognition. GUI Interface The on-premise version comes with an web interface that helps you set up the system in less than 5 minutes. Face Recognition Based on state-of-the-art method that achieves > 98% accuracy in the LFW dataset. Performance The API is easy to use and has a very high performance (up to 30fps). Getting Started (HTTP API) Simple steps to start training and recognizing people. See tutorial API Docs Explore the Swagger documentation and test the API online. Open Swagger Download the complete manual No installation required, just start calling the Restful API for training and recognition. The on-premise version comes with an web interface that helps you set up the system in less than 5 minutes. Based on state-of-the-art method that achieves > 98% accuracy in the LFW dataset. The API is easy to use and has a very high performance (up to 30fps). Getting Started (HTTP API) Simple steps to start training and recognizing people. Explore the Swagger documentation and test the API online. Gallery Mobile at real-time Real-time face recognition for iOS and Android. Single SDK containing face detection, landmark extraction, liveness detection and face verification. Face verification We also provide a verification method in which you can check if two pictures belong to the same person. Web Interface In the on-premise there is a cool web interface in which you can control the whole system, including video streams. Video Stream You can upload videos or connect the system to an IP/USB camera and monitor recognitions happening in real-time. Confidence level Together with the recognition of people in the picture, the algorithm returns the recognition's confidence level. A face that is not in the database will have a low score (Buzz). Smart enroll You can use our interface to setup your database in a couple of minutes using our face clustering approach. Swagger documentation You can start testing in a couple of minutes using our interactive Swagger documentation. Landmarks extraction Our application rapidly extracts the face landmarks to describe the face and keep this info in your database. Surveillance setup The high performance of the method enables to detect who is the field of view of a surveillance camera. Real-time face recognition for iOS and Android. Single SDK containing face detection, landmark extraction, liveness detection and face verification. We also provide a verification method in which you can check if two pictures belong to the same person. In the on-premise there is a cool web interface in which you can control the whole system, including video streams. You can upload videos or connect the system to an IP/USB camera and monitor recognitions happening in real-time. Together with the recognition of people in the picture, the algorithm returns the recognition's confidence level. A face that is not in the database will have a low score (Buzz). You can use our interface to setup your database in a couple of minutes using our face clustering approach. You can start testing in a couple of minutes using our interactive Swagger documentation. Our application rapidly extracts the face landmarks to describe the face and keep this info in your database. The high performance of the method enables to detect who is the field of view of a surveillance camera. Try the API right away People ↑ Upload /detect/landmarks /recognize/people Try the API right away Buy now and start using in less than 5 minutes. Select the plan best suited to you and get your API Key in three easy steps. starter free Calls/month 1000 People in DB 10 Images in DB 100 E-mail support Get API Key standard R$ 99 /mês Approx. U$30 /mo Calls/month 10k People in DB 100 Images in DB 1k E-mail support Buy now pro R$ 469 /mês Approx. U$145 /mo Calls/month 100k People in DB 1k Images in DB 10k Full customer support Buy now on premise Price per appliance Calls/month People in DB Full customer support Support video stream Real-time performance Web interface Contact us Buy now and start using in less than 5 minutes. starter free Calls/month 1000 People in DB 10 Images in DB 100 E-mail support Get API Key People in DB 10 Images in DB 100 standard R$ 99 /mês Approx. U$30 /mo Calls/month 10k People in DB 100 Images in DB 1k E-mail support Buy now People in DB 100 Images in DB 1k pro R$ 469 /mês Approx. U$145 /mo Calls/month 100k People in DB 1k Images in DB 10k Full customer support Buy now People in DB 1k Images in DB 10k on premise Price per appliance Calls/month People in DB Full customer support Support video stream Real-time performance Web interface Contact us Contact us Please contact us if you have any doubts or would like to know more about our custom plans. If you experience any problem in your subscription payment, please also email us using the form below.",
    "Conheça a aplicação State-of-the-art The most recent Deep Learning advancements, yet easy to train and optimized for CPU. Scalability A dozen samples can train a high accuracy logo detector which can run in the cloud and on premise without GPU. Real-time performance In GPU mode we achieve up to 40fps no matter how many logos you're trying to detect. Brand insights The system is coupled with social media crawlers so you can see how your brand is appearing in photos (check our Medium post on that). Use case We made a comprehensive study on six beer brands using Twitter photos. We explore this data to get some cool insights. See our Medium post Mobile support Download our SixBeerDetector app to test our detector trained for the six brands used in our use case: Soon, it will be available in stores. For now, contact us. The most recent Deep Learning advancements, yet easy to train and optimized for CPU. A dozen samples can train a high accuracy logo detector which can run in the cloud and on premise without GPU. In GPU mode we achieve up to 40fps no matter how many logos you're trying to detect. The system is coupled with social media crawlers so you can see how your brand is appearing in photos (check our Medium post on that). We made a comprehensive study on six beer brands using Twitter photos. We explore this data to get some cool insights. Download our SixBeerDetector app to test our detector trained for the six brands used in our use case: Galeria de imagens da aplicação Easy training Detect different logos with high accuracy after a simple training. Real-time Performance up to 40fps for high resolution videos. Analytics Integrated with social media for big data analytics. See our Medium post Face and Gender analysis Besides detecting logos, we detect faces and genders to analyse the audience related to your brand. Galeria de imagens da aplicação Detect different logos with high accuracy after a simple training. Performance up to 40fps for high resolution videos. Integrated with social media for big data analytics. See our Medium post Face and Gender analysis Besides detecting logos, we detect faces and genders to analyse the audience related to your brand. Detect beers! This demo recognizes six brands of beer: Corona, Heineken, Budweiser, Bud Light, Stella Artois and Guinness. Imagens ↑ Subir Imagem Take a photo + Banco de dados POST /detect/logos response",
    "Background Digital Transformation is one of the most recurring topics for fintechs, banking and insurance companies, among others. It means adapting and evolving relationships with clients and also reducing and qualifying business processes. With the emergence of digital platforms and services, processes that used to happen face-to-face are now performed via mobile apps and websites. Process automation and bureaucracy reduction have been implemented in markets as diverse as insurance, telecommunications and logistics. Challenges One of the main client relationship processes that is changing is user registration. Nowadays the process is as easy as snapping a picture of the ID and taking a selfie. However, in many cases, the improvement is only in user experience. The company still needs a backoffice to analyze images. Requiring manual inspection may have a negative impact, both due to the costs of keeping a backoffice and the delay of manually processing documents provided by the user. Solution There are technologies capable of completely automating user onboarding. Meerkat develops the following: Quality Assessment: allows imediate feedback to users about document image quality. If there is blur or reflections that makes the document unreadable, a new image is requested; Document detection: automaticaly detects a document's type, e.g. ID or driver's license, and its orientation. That way, user experience is much more streamlined; Proof of Address Validation: matches input data such as name, adress and date, to the provided proof of address document; Facial Verification: matches the face in a given identification document to a selfie, making sure the person enrolling is the one on the document; about GetOnBoard Digital Transformation is one of the most recurring topics for fintechs, banking and insurance companies, among others. It means adapting and evolving relationships with clients and also reducing and qualifying business processes. With the emergence of digital platforms and services, processes that used to happen face-to-face are now performed via mobile apps and websites. Process automation and bureaucracy reduction have been implemented in markets as diverse as insurance, telecommunications and logistics. One of the main client relationship processes that is changing is user registration. Nowadays the process is as easy as snapping a picture of the ID and taking a selfie. However, in many cases, the improvement is only in user experience. The company still needs a backoffice to analyze images. Requiring manual inspection may have a negative impact, both due to the costs of keeping a backoffice and the delay of manually processing documents provided by the user. There are technologies capable of completely automating user onboarding. Meerkat develops the following: Quality Assessment: allows imediate feedback to users about document image quality. If there is blur or reflections that makes the document unreadable, a new image is requested; Document detection: automaticaly detects a document's type, e.g. ID or driver's license, and its orientation. That way, user experience is much more streamlined; Proof of Address Validation: matches input data such as name, adress and date, to the provided proof of address document; Facial Verification: matches the face in a given identification document to a selfie, making sure the person enrolling is the one on the document; Clients who use Meerkat's onboarding system Clients who use Meerkat's onboarding system Want to develop a project of onboarding with us? Contact us. Email [email protected] Phone +55 (51) 99708-5816 Want to develop a project of onboarding with us? Contact us.",
    "Meerkat's Products frAPI Face detection and recognition in images and video streams. Face Liveness SDK Liveness detection SDK for biometric validation pipelines. Outatime License plate detection and recognition in images and video streams. Emmett API for reading and validating information on documents. Warhol API for logo and product detection in images and video streams. frAPI Face detection and recognition in images and video streams. Face Liveness SDK Liveness detection SDK for biometric validation pipelines. Outatime License plate detection and recognition in images and video streams. Emmett API for reading and validating information on documents. Warhol API for logo and product detection in images and video streams. Face detection and recognition in images and video streams. Liveness detection SDK for biometric validation pipelines. License plate detection and recognition in images and video streams. API for reading and validating information on documents. API for logo and product detection in images and video streams. Face detection and recognition in images and video streams. Liveness detection SDK for biometric validation pipelines. License plate detection and recognition in images and video streams. API for reading and validating information on documents. API for logo and product detection in images and video streams. GetOnBoard Complete solution for user enrollment based on facial recognition and optical character reading of documents Know more about GetOnBoard Complete solution for user enrollment based on facial recognition and optical character reading of documents Our technologies applied to real problems User Onboarding Automatically enroll users with document OCR and face verification. Check Deposit Check deposit on mobile devices using image segmentation and OCR. Access Control Access control using facial recognition. Vehicle Access Control Hands-free access control on parking lots with ALPR. Plate Recognition for Tolls RFID fraud verification and traffic control in toll roads using ALPR on-premise. Augmented Reality Logo and object recognition for augmented reality in marketing campaings. User Onboarding Automatically enroll users with document OCR and face verification. Check Deposit Check deposit on mobile devices using image segmentation and OCR. Access Control Access control using facial recognition. Vehicle Access Control Hands-free access control on parking lots with ALPR. Plate Recognition for Tolls RFID fraud verification and traffic control in toll roads using ALPR on-premise. Augmented Reality Logo and object recognition for augmented reality in marketing campaings. Our technologies applied to real problems Automatically enroll users with document OCR and face verification. Check deposit on mobile devices using image segmentation and OCR. Access control using facial recognition. Hands-free access control on parking lots with ALPR. Plate Recognition for Tolls RFID fraud verification and traffic control in toll roads using ALPR on-premise. Logo and object recognition for augmented reality in marketing campaings. Automatically enroll users with document OCR and face verification. Check deposit on mobile devices using image segmentation and OCR. Access control using facial recognition. Hands-free access control on parking lots with ALPR. Plate Recognition for Tolls RFID fraud verification and traffic control in toll roads using ALPR on-premise. Logo and object recognition for augmented reality in marketing campaings. Clients who trust Meerkat Clients who trust Meerkat Technologies developed in-house Integrate our tecnologies into your products. Provide state-of-the-art artificial intelligence solutions based on Deep Learning to your clients. Our team Our team Integrate our tecnologies into your products. Provide state-of-the-art artificial intelligence solutions based on Deep Learning to your clients. Want to ? Contact us Email [email protected] Phone +55 (51) 99708-5816 Address Porto Alegre - RS Getúlio Vargas Av., 1000/502 ZIP: 90150-004 Want to ? Contact us Porto Alegre - RS Getúlio Vargas Av., 1000/502",
    "Background In the last few years the increase of processing power in computers and smartphones allowed for the use of augmented reality in various applications such as marketing, engineering and medicine. In marketing, augmented reality made the creation of campaigns focused on direct interaction between clients, products and brands possible. Augmented Reality generates highly technological interactions, increasing the brand's value and offering experiences that end up becoming viral for audiences that care about technology. Big players such as Coca-Cola, Nike, among others, already used AR for highly effective marketing campaigns. Challenge In 2017, Nissin was one of the main sponsors of the Rock in Rio music festival. In the festival one of the products being sold was the famous Cup Noodles. Considering the music festival vibe the company decided to develop, together with Dentsu and Meerkat, a market campaign focused on interactivity. Solution Using object and logo detection technologies developed by our engineering team and working with Dentsu, a publicity agency, we turned Cup Noodles into musical instruments. The platform called Cup Band was developed to integrate marketing actions during the festival. Watch the video: Instead of requiring hardware with high processing power, we chose to implement a solution that runs on web browsers and communicates with a Computer Vision engine based on the cloud. That way, there is no need for installing an app or having a high-end smartphone, it's only a matter of accessing the web site directly using the web browser. Cupband allowed consumers to produce a musical composition using Cup Noodles products. When captured by a phone or webcam, each flavor enabled a different musical instrument, using Meerkat's object and logo detection engine. The users had an extra incentive to try new flavors and thus use other instruments. After finishing their music, users could share it on social networks increasing engagement. Our system can also use 3D animation native tools such as ARKit and ARCore. This enables a richer and fun interaction. See below the video with augmented instruments and a dancing Elvis: about our Logo Detection In the last few years the increase of processing power in computers and smartphones allowed for the use of augmented reality in various applications such as marketing, engineering and medicine. In marketing, augmented reality made the creation of campaigns focused on direct interaction between clients, products and brands possible. Augmented Reality generates highly technological interactions, increasing the brand's value and offering experiences that end up becoming viral for audiences that care about technology. Big players such as Coca-Cola, Nike, among others, already used AR for highly effective marketing campaigns. In 2017, Nissin was one of the main sponsors of the Rock in Rio music festival. In the festival one of the products being sold was the famous Cup Noodles. Considering the music festival vibe the company decided to develop, together with Dentsu and Meerkat, a market campaign focused on interactivity. Using object and logo detection technologies developed by our engineering team and working with Dentsu, a publicity agency, we turned Cup Noodles into musical instruments. The platform called Cup Band was developed to integrate marketing actions during the festival. Watch the video: Instead of requiring hardware with high processing power, we chose to implement a solution that runs on web browsers and communicates with a Computer Vision engine based on the cloud. That way, there is no need for installing an app or having a high-end smartphone, it's only a matter of accessing the web site directly using the web browser. Cupband allowed consumers to produce a musical composition using Cup Noodles products. When captured by a phone or webcam, each flavor enabled a different musical instrument, using Meerkat's object and logo detection engine. The users had an extra incentive to try new flavors and thus use other instruments. After finishing their music, users could share it on social networks increasing engagement. Our system can also use 3D animation native tools such as ARKit and ARCore. This enables a richer and fun interaction. See below the video with augmented instruments and a dancing Elvis: Clients who participated in the CupBand with Meerkat Clients who participated in the CupBand with Meerkat Want to develop a project with augmented reality? Contact us. Email [email protected] Phone +55 (51) 99708-5816 Want to develop a project with augmented reality? Contact us."
  ]
}