{
  "company": "www.genvis.co",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 9,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 9
    }
  },
  "sample_docs": [
    "Let's talk If you have CCTV in place or are thinking of investing in it, we can help you get more by turning the visual data it collects into intelligence you can act on. Contact us If you have CCTV in place or are thinking of investing in it, we can help you get more by turning the visual data it collects into intelligence you can act on. .",
    "we help you See Good. Do Good. We are GenVis. We turn visual data into intelligence for public safety teams, helping them do more and be more effective every day. Using a combination of computer vision and machine learning to surface intelligence from live camera feeds or archived video files, we make visual AI accessible to organisations of all sizes, budgets and locations via our easy to use suite of cloud products. We believe in Tech for Good. Our solutions are impactful and matter. Just like the people our customers serve. GenVis is proudly Australian. We help public safety teams do their best work. our products Get started with GenVis Whether you want to respond faster to incidents, close more investigations faster or control access into your country, region or state, our products will make your work easier. Build and present compelling criminal cases underpinned by video forensics. Privacy first, real time video intelligence set up in minutes not months. Access management done right. Simply and effectively. Talk to a human If you're a human who likes speaking to other humans reach out and we will call you. Call me See Good. Do Good. We are GenVis. We turn visual data into intelligence for public safety teams, helping them do more and be more effective every day. Using a combination of computer vision and machine learning to surface intelligence from live camera feeds or archived video files, we make visual AI accessible to organisations of all sizes, budgets and locations via our easy to use suite of cloud products. We believe in Tech for Good. Our solutions are impactful and matter. Just like the people our customers serve. GenVis is proudly Australian. We help public safety teams do their best work. Get started with GenVis Whether you want to respond faster to incidents, close more investigations faster or control access into your country, region or state, our products will make your work easier. Build and present compelling criminal cases underpinned by video forensics. Privacy first, real time video intelligence set up in minutes not months. Access management done right. Simply and effectively. Talk to a human If you're a human who likes speaking to other humans reach out and we will call you. .",
    "do something, today Safe with Milli Family and domestic violence is an escalating social issue plaguing communities across Australia and around the world. It's a complex problem that sees public safety teams working hard to keep victims safe whilst holding perpetrators to account for their actions. The genvis team is commited to playing our part in keeping people and communities around us. Putting our capabilties and resources to work, to help victims of family violence be safe at home was an easy decision. The resulting app Milli is a home safety smartphone app built by genvis in collaboration with the Western Australia Police Force. Milli analyses live home security camera feeds detecting people and vehicles. When any of these events happen, an alert is generated and sent to a user's smartphone, allowing them to quickly review the information and take action if necessary. Milli is in use today across Western Australia via a number of partner organisations. a team effort Safe with Milli supporters about Milli If you have any questions or would like to find out how you or your organisation can work with us to make Milli available to more people, please contact us at hello@genvis.co Family and domestic violence is an escalating social issue plaguing communities across Australia and around the world. It's a complex problem that sees public safety teams working hard to keep victims safe whilst holding perpetrators to account for their actions. The genvis team is commited to playing our part in keeping people and communities around us. Putting our capabilties and resources to work, to help victims of family violence be safe at home was an easy decision. The resulting app Milli is a home safety smartphone app built by genvis in collaboration with the Western Australia Police Force. Milli analyses live home security camera feeds detecting people and vehicles. When any of these events happen, an alert is generated and sent to a user's smartphone, allowing them to quickly review the information and take action if necessary. Milli is in use today across Western Australia via a number of partner organisations. Safe with Milli supporters about Milli If you have any questions or would like to find out how you or your organisation can work with us to make Milli available to more people, please contact us at hello@genvis.co .",
    "we help you See Good. Do Good. At GenVis we love technology and we love happy customers. Seriously. Helping organisations do away with manual tasks and processes, replacing them with AI and/or automation where it makes sense is our jam. That they use our products to keep communities around us safe, makes us very happy. GenVis is very proudly Australian whilst serving global markets. Our team has world-class expertise in computer vision, data science and user centric design, making us the ideal partner for companies needing to process, understand and act on visual data as a core business function. We build modern tooling for high-performing workforces our technology See beyond the pixel Our core engine is powered by an ensemble of state of the art neural network architectures trained with carefully augmented datasets. It combines our own proprietary algorithms with finely tuned variants of other leading techniques. This gives us the ability to deliver solutions for our clients that meet their very different use cases and demands while learning and improving over time. AI alone is not the answer At GenVis we love building AI that frees our customers to do the things that machines can't. We don't believe that AI alone is the future but rather that silicon brains working with human brains are an unbeatable combo. Putting GenVis AI to work for you will not just let you do what you already do faster, it will unlock opportunities and possibilities we can't even begin to imagine today. See Good. Do Good. At GenVis we love technology and we love happy customers. Seriously. Helping organisations do away with manual tasks and processes, replacing them with AI and/or automation where it makes sense is our jam. That they use our products to keep communities around us safe, makes us very happy. GenVis is very proudly Australian whilst serving global markets. Our team has world-class expertise in computer vision, data science and user centric design, making us the ideal partner for companies needing to process, understand and act on visual data as a core business function. We build modern tooling See beyond the pixel Our core engine is powered by an ensemble of state of the art neural network architectures trained with carefully augmented datasets. It combines our own proprietary algorithms with finely tuned variants of other leading techniques. This gives us the ability to deliver solutions for our clients that meet their very different use cases and demands while learning and improving over time. AI alone is not the answer At GenVis we love building AI that frees our customers to do the things that machines can't. We don't believe that AI alone is the future but rather that silicon brains working with human brains are an unbeatable combo. Putting GenVis AI to work for you will not just let you do what you already do faster, it will unlock opportunities and possibilities we can't even begin to imagine today. .",
    "MORE THAN EVER, WE'RE HERE TO HELP G2G PASS Few could have imagined how COVID-19 would change the way we interact, live and work. Within a few short weeks, governments, public safety teams and supporting agencies have had to completely rethink the way they deliver services to support our communities at this crucial time in history. Now more than ever, genvis is here to help, providing tools to government to help them tackle the complex challenges facing them today. G2G PASS is a dedicated website and mobile app built for the Western Australia Police Force and designed to help them manage the travel restrictions in place across the state. The G2G PASS mobile app allows for the easy display and verification of Temporary Travel Permits, facilitating fast tracked and approved movement into and through Western Australia, by plane, sea, rail or road. Helping public safety teams respond to Covid-19 1 + 2 = G2G PASS Our G2G PASS Partners Genvis could not have delivered the G2G PASS solution in the timeframe required without having AWS and RIoT Solutions working in the trenches with us. Contact us Working to keep people, communities and countries safe? Contact us at hello@genvis.co to find out how we can help. MORE THAN EVER, WE'RE HERE TO HELP Few could have imagined how COVID-19 would change the way we interact, live and work. Within a few short weeks, governments, public safety teams and supporting agencies have had to completely rethink the way they deliver services to support our communities at this crucial time in history. Now more than ever, genvis is here to help, providing tools to government to help them tackle the complex challenges facing them today. G2G PASS is a dedicated website and mobile app built for the Western Australia Police Force and designed to help them manage the travel restrictions in place across the state. The G2G PASS mobile app allows for the easy display and verification of Temporary Travel Permits, facilitating fast tracked and approved movement into and through Western Australia, by plane, sea, rail or road. Helping public safety teams respond to Covid-19 1 + 2 = G2G PASS Our G2G PASS Partners Genvis could not have delivered the G2G PASS solution in the timeframe required without having AWS and RIoT Solutions working in the trenches with us. Working to keep people, communities and countries safe? Contact us at hello@genvis.co to find out how we can help. ."
  ]
}