{
  "company": "www.zoloz.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 8,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5454545454545454,
    "framing_surveillance": 0.0,
    "framing_market": 0.4545454545454545,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 2
    }
  },
  "sample_docs": [
    "Become part of a cloud-based, comprehensive identity solution in your country. Be the first to use the ZOLOZ™ Connect identity platform Choose a digital, mobile solution for your identity verification needs. Put the ZOLOZ™ Real ID SDK to work for you Biometrics, Fused and Secured Today, ZOLOZ uses facial recognition combined with industry-leading spoof detection technology to ensure that your customers' identities remain uncompromised. In the future, we'll add other biometrics, behavioral analytics and questions only individual users can answer to further strengthen the customer experience without adding time or frustration. Biometrics, Fused and Secured Today, ZOLOZ uses facial recognition combined with industry-leading spoof detection technology to ensure that your customers' identities remain uncompromised. In the future, we'll add other biometrics, behavioral analytics and questions only individual users can answer to further strengthen the customer experience without adding time or frustration. \"ZOLOZ's state of the art financial grade biometric technology empowers the user to enjoy easy to use, reliable and secure identity verification service in the digital world.\" Jidong Chen, General Manager, Zoloz | 1740 Main St. Suite 100, Kansas City, MO",
    "ZOLOZ's current technology uses: Face recognition – with 99.99%+ accuracy. Optical character recognition (OCR) – transforms a picture of an ID into text that can be compared against a database for real name verification. Spoof detection – also called liveness or anti-attack technology, spoof detection is the key to prevent someone from using a photo or video to hack the biometric. ZOLOZ's current technology uses: Face recognition – with 99.99%+ accuracy. Optical character recognition (OCR) – transforms a picture of an ID into text that can be compared against a database for real name verification. Spoof detection – also called liveness or anti-attack technology, spoof detection is the key to prevent someone from using a photo or video to hack the biometric. What's Next Our vision? We want to use every smartphone sensor to combine identifiers – physical, behavioral analytics, smart environment and more – for constant, maximum protection and connection. And we want to go beyond that. Five or ten years from now, people will use devices that look nothing like what we have today. Whatever technology exists then, we'll be ready. We're not only keeping an eye on trends that can impact digital identity tomorrow, we're working to redefine what's possible when it comes to secure, private and user-centric identity solutions. We want to use every smartphone sensor to combine identifiers – physical, behavioral analytics, smart environment and more – for constant, maximum protection and connection. And we want to go beyond that. Five or ten years from now, people will use devices that look nothing like what we have today. Whatever technology exists then, we'll be ready. We're not only keeping an eye on trends that can impact digital identity tomorrow, we're working to redefine what's possible when it comes to secure, private and user-centric identity solutions. Where is biometric data stored? ZOLOZ prefers to store customer data on servers in each country in which it offers cloud-based solutions, so that customer data is stored in that customers' country, subject to compliance with local laws and best practices in the industry. How do you secure biometrics? Data transmissions are encrypted and digital signatures are verified to ensure secure data transport. Data is stored using AES256 encryption. In addition, we deploy spoof detection technology to ensure someone isn't trying to use a fake biometric sample to commit fraud. What about spoof detection? ZOLOZ's advanced spoof detection technology employs a variety of tactics to ensure that someone isn't attempting to use a photo or video of you to . Multiple algorithms: we review several aspects of the biometric sample, both static and dynamic, to validate the presence of a genuine sample vs a false representation. Decision Engine: we fuse our spoof detection algorithms to ensure the results all make sense when reviewed together, significantly strengthening the overall spoof detection decision. What hardware and software is required? For face recognition on smartphones, our technology works on almost any iOS or Android device with a front-facing camera. What if the user is in a room that is not well lit? For smartphone use, ZOLOZ can use the light from the phone's screen to illuminate the face to facilitate verification. What is Eyeprint ID? Eyeprint ID TM images and pattern matches the visible veins in the whites of the eye. No two people have the same vasculature, even twins. Eyeprint ID is currently used by several financial institutions, and will be incorporated into ZOLOZ's fused biometrics solution in the future. What about alternatives to face recognition? Years of development, prototyping and testing have led us to financial grade face recognition, which we believe balances simplicity and security to create an unparalleled verification solution. Other biometric technology comes up short: Standalone facial recognition, without strong spoof detection technology, can be easily fooled by photos. Iris recognition captures the colored part at the front of the eye; this requires near infrared light cameras, which are not standard on today's smartphones and tablets. Retina solutions, which image the vein patterns on the back inside of the eye, require expensive hardware. The slow speed of retinal identification also requires the user to be very still. (No retina solutions are currently available for smartphones.) Fingerprint solutions require additional hardware. Voice recognition works best when a user is already speaking, such as when calling in to a call center. Where is ZOLOZ technology available? ZOLOZ currently offers its cloud-based solutions in China. Additional countries are being added in late 2017 and throughout 2018. Where is biometric data stored? ZOLOZ prefers to store customer data on servers in each country in which it offers cloud-based solutions, so that customer data is stored in that customers' country, subject to compliance with local laws and best practices in the industry. Where is biometric data stored? ZOLOZ prefers to store customer data on servers in each country in which it offers cloud-based solutions, so that customer data is stored in that customers' country, subject to compliance with local laws and best practices in the industry. ZOLOZ prefers to store customer data on servers in each country in which it offers cloud-based solutions, so that customer data is stored in that customers' country, subject to compliance with local laws and best practices in the industry. How do you secure biometrics? Data transmissions are encrypted and digital signatures are verified to ensure secure data transport. Data is stored using AES256 encryption. In addition, we deploy spoof detection technology to ensure someone isn't trying to use a fake biometric sample to commit fraud. How do you secure biometrics? Data transmissions are encrypted and digital signatures are verified to ensure secure data transport. Data is stored using AES256 encryption. In addition, we deploy spoof detection technology to ensure someone isn't trying to use a fake biometric sample to commit fraud. Data transmissions are encrypted and digital signatures are verified to ensure secure data transport. Data is stored using AES256 encryption. In addition, we deploy spoof detection technology to ensure someone isn't trying to use a fake biometric sample to commit fraud. What about spoof detection? ZOLOZ's advanced spoof detection technology employs a variety of tactics to ensure that someone isn't attempting to use a photo or video of you to . Multiple algorithms: we review several aspects of the biometric sample, both static and dynamic, to validate the presence of a genuine sample vs a false representation. Decision Engine: we fuse our spoof detection algorithms to ensure the results all make sense when reviewed together, significantly strengthening the overall spoof detection decision. What about spoof detection? ZOLOZ's advanced spoof detection technology employs a variety of tactics to ensure that someone isn't attempting to use a photo or video of you to . Multiple algorithms: we review several aspects of the biometric sample, both static and dynamic, to validate the presence of a genuine sample vs a false representation. Decision Engine: we fuse our spoof detection algorithms to ensure the results all make sense when reviewed together, significantly strengthening the overall spoof detection decision. ZOLOZ's advanced spoof detection technology employs a variety of tactics to ensure that someone isn't attempting to use a photo or video of you to . Multiple algorithms: we review several aspects of the biometric sample, both static and dynamic, to validate the presence of a genuine sample vs a false representation. Decision Engine: we fuse our spoof detection algorithms to ensure the results all make sense when reviewed together, significantly strengthening the overall spoof detection decision. What hardware and software is required? For face recognition on smartphones, our technology works on almost any iOS or Android device with a front-facing camera. What hardware and software is required? For face recognition on smartphones, our technology works on almost any iOS or Android device with a front-facing camera. For face recognition on smartphones, our technology works on almost any iOS or Android device with a front-facing camera. What if the user is in a room that is not well lit? For smartphone use, ZOLOZ can use the light from the phone's screen to illuminate the face to facilitate verification. What if the user is in a room that is not well lit? For smartphone use, ZOLOZ can use the light from the phone's screen to illuminate the face to facilitate verification. What is Eyeprint ID? Eyeprint ID TM images and pattern matches the visible veins in the whites of the eye. No two people have the same vasculature, even twins. Eyeprint ID is currently used by several financial institutions, and will be incorporated into ZOLOZ's fused biometrics solution in the future. What is Eyeprint ID? Eyeprint ID TM images and pattern matches the visible veins in the whites of the eye. No two people have the same vasculature, even twins. Eyeprint ID is currently used by several financial institutions, and will be incorporated into ZOLOZ's fused biometrics solution in the future. What about alternatives to face recognition? Years of development, prototyping and testing have led us to financial grade face recognition, which we believe balances simplicity and security to create an unparalleled verification solution. Other biometric technology comes up short: Standalone facial recognition, without strong spoof detection technology, can be easily fooled by photos. Iris recognition captures the colored part at the front of the eye; this requires near infrared light cameras, which are not standard on today's smartphones and tablets. Retina solutions, which image the vein patterns on the back inside of the eye, require expensive hardware. The slow speed of retinal identification also requires the user to be very still. (No retina solutions are currently available for smartphones.) Fingerprint solutions require additional hardware. Voice recognition works best when a user is already speaking, such as when calling in to a call center. What about alternatives to face recognition? Years of development, prototyping and testing have led us to financial grade face recognition, which we believe balances simplicity and security to create an unparalleled verification solution. Other biometric technology comes up short: Standalone facial recognition, without strong spoof detection technology, can be easily fooled by photos. Iris recognition captures the colored part at the front of the eye; this requires near infrared light cameras, which are not standard on today's smartphones and tablets. Retina solutions, which image the vein patterns on the back inside of the eye, require expensive hardware. The slow speed of retinal identification also requires the user to be very still. (No retina solutions are currently available for smartphones.) Fingerprint solutions require additional hardware. Voice recognition works best when a user is already speaking, such as when calling in to a call center. Years of development, prototyping and testing have led us to financial grade face recognition, which we believe balances simplicity and security to create an unparalleled verification solution. Other biometric technology comes up short: Standalone facial recognition, without strong spoof detection technology, can be easily fooled by photos. Iris recognition captures the colored part at the front of the eye; this requires near infrared light cameras, which are not standard on today's smartphones and tablets. Retina solutions, which image the vein patterns on the back inside of the eye, require expensive hardware. The slow speed of retinal identification also requires the user to be very still. (No retina solutions are currently available for smartphones.) Fingerprint solutions require additional hardware. Voice recognition works best when a user is already speaking, such as when calling in to a call center. Where is ZOLOZ technology available? ZOLOZ currently offers its cloud-based solutions in China. Additional countries are being added in late 2017 and throughout 2018. Where is ZOLOZ technology available? ZOLOZ currently offers its cloud-based solutions in China. Additional countries are being added in late 2017 and throughout 2018. ZOLOZ currently offers its cloud-based solutions in China. Additional countries are being added in late 2017 and throughout 2018. | 1740 Main St. Suite 100, Kansas City, MO",
    "ZOLOZ Securing Your Digital Life with ZOLOZ EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. .identity We Are Making Trust Simple EyeVerify has become ZOLOZ to providing a comprehensive, cloud-based identity solution for the underserved and underbanked in Asia. Biometrics Biometrics 101: Why is Spoof Detection Difficult? Spoof detection in biometrics is a big topic this year. Our Chief Scientist, Dr. Reza Derakhshani, provides insight into why. Biometrics Biometrics 101: Verification vs Identification Biometrics can be used for identification or verification. What's the difference? Securing Your Digital Life with ZOLOZ EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. We Are Making Trust Simple EyeVerify has become ZOLOZ to providing a comprehensive, cloud-based identity solution for the underserved and underbanked in Asia. Biometrics 101: Why is Spoof Detection Difficult? Spoof detection in biometrics is a big topic this year. Our Chief Scientist, Dr. Reza Derakhshani, provides insight into why. Biometrics 101: Verification vs Identification Biometrics can be used for identification or verification. What's the difference? | 1740 Main St. Suite 100, Kansas City, MO",
    "October 23, 2017 @ 8:12 AM By Toby Rush EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. In August, I announced that we are launching an identity platform to help people worldwide manage and secure their daily lives. Today, I am excited to announce the official launch of ZOLOZ – the result of the combination of biometrics and authentication expertise from Ant Financial and EyeVerify. People want to connect effortlessly across devices and experiences, and our job is to help them do so securely. Our services fuse biometrics with industry-leading, patented spoof detection technology so people feel secure while they manage their online lives. We are introducing three new products -- ZOLOZ Connect, ZOLOZ Real ID, and ZOLOZ Smile -- that make trust simple for millions of people around the globe. Each day, we are asked the question, 'who are you?' digitally, and we'll be asked this question multiple times a day for the rest of our lives. We are also now using more complex and sophisticated devices and services than ever before, like mobile banking and payments, that make it more challenging to secure our sensitive information online. Our platform helps solve this challenge and answers this question, in all scenarios, regardless of the type of technology, in a way that gives people maximum privacy and control. We are on a mission to make it simple to be known, trusted and safe in the digital world. The new solutions are: ZOLOZ Connect: Enables people to to mobile apps using facial recognition and patented anti-spoof technology with financial grade security, minimizing the potential for fraud and making verification over 99.999% percent accurate with a smartphone alone. ZOLOZ Real ID: An alternative to in-person, real name verification that allows people to use facial recognition and advanced optical character recognition (OCR), to validate their identity with a smartphone's front-facing camera and an ID number or a scan of a government ID. ZOLOZ Smile: People pay for goods and services with a simple face scan and phone number at self-service machines such as kiosks, vending machines, monitors or other devices. Now people can pay at a restaurant, retrieve a parcel, or unlock an account all with just a smile – no smartphone required. Identity should be user-centric, with a focus on privacy, security and user control, which is why we'll be making our technology even more secure by fusing biometrics and adding continuous authentication over time. These services are available in China first to meet the growing market demand for trusted identity solutions in that region, and over 200 million people are using our technology today. With biometrics adoption and identity services in China leapfrogging other regions, people there are quick to embrace mobile as a way to securely access their money. We will launch other markets over the next few months. October 23, 2017 @ 8:12 AM By Toby Rush EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. In August, I announced that we are launching an identity platform to help people worldwide manage and secure their daily lives. Today, I am excited to announce the official launch of ZOLOZ – the result of the combination of biometrics and authentication expertise from Ant Financial and EyeVerify. People want to connect effortlessly across devices and experiences, and our job is to help them do so securely. Our services fuse biometrics with industry-leading, patented spoof detection technology so people feel secure while they manage their online lives. We are introducing three new products -- ZOLOZ Connect, ZOLOZ Real ID, and ZOLOZ Smile -- that make trust simple for millions of people around the globe. Each day, we are asked the question, 'who are you?' digitally, and we'll be asked this question multiple times a day for the rest of our lives. We are also now using more complex and sophisticated devices and services than ever before, like mobile banking and payments, that make it more challenging to secure our sensitive information online. Our platform helps solve this challenge and answers this question, in all scenarios, regardless of the type of technology, in a way that gives people maximum privacy and control. We are on a mission to make it simple to be known, trusted and safe in the digital world. The new solutions are: ZOLOZ Connect: Enables people to to mobile apps using facial recognition and patented anti-spoof technology with financial grade security, minimizing the potential for fraud and making verification over 99.999% percent accurate with a smartphone alone. ZOLOZ Real ID: An alternative to in-person, real name verification that allows people to use facial recognition and advanced optical character recognition (OCR), to validate their identity with a smartphone's front-facing camera and an ID number or a scan of a government ID. ZOLOZ Smile: People pay for goods and services with a simple face scan and phone number at self-service machines such as kiosks, vending machines, monitors or other devices. Now people can pay at a restaurant, retrieve a parcel, or unlock an account all with just a smile – no smartphone required. Identity should be user-centric, with a focus on privacy, security and user control, which is why we'll be making our technology even more secure by fusing biometrics and adding continuous authentication over time. These services are available in China first to meet the growing market demand for trusted identity solutions in that region, and over 200 million people are using our technology today. With biometrics adoption and identity services in China leapfrogging other regions, people there are quick to embrace mobile as a way to securely access their money. We will launch other markets over the next few months. EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. In August, I announced that we are launching an identity platform to help people worldwide manage and secure their daily lives. Today, I am excited to announce the official launch of ZOLOZ – the result of the combination of biometrics and authentication expertise from Ant Financial and EyeVerify. People want to connect effortlessly across devices and experiences, and our job is to help them do so securely. Our services fuse biometrics with industry-leading, patented spoof detection technology so people feel secure while they manage their online lives. We are introducing three new products -- ZOLOZ Connect, ZOLOZ Real ID, and ZOLOZ Smile -- that make trust simple for millions of people around the globe. Each day, we are asked the question, 'who are you?' digitally, and we'll be asked this question multiple times a day for the rest of our lives. We are also now using more complex and sophisticated devices and services than ever before, like mobile banking and payments, that make it more challenging to secure our sensitive information online. Our platform helps solve this challenge and answers this question, in all scenarios, regardless of the type of technology, in a way that gives people maximum privacy and control. We are on a mission to make it simple to be known, trusted and safe in the digital world. The new solutions are: ZOLOZ Connect: Enables people to to mobile apps using facial recognition and patented anti-spoof technology with financial grade security, minimizing the potential for fraud and making verification over 99.999% percent accurate with a smartphone alone. ZOLOZ Real ID: An alternative to in-person, real name verification that allows people to use facial recognition and advanced optical character recognition (OCR), to validate their identity with a smartphone's front-facing camera and an ID number or a scan of a government ID. ZOLOZ Smile: People pay for goods and services with a simple face scan and phone number at self-service machines such as kiosks, vending machines, monitors or other devices. Now people can pay at a restaurant, retrieve a parcel, or unlock an account all with just a smile – no smartphone required. Identity should be user-centric, with a focus on privacy, security and user control, which is why we'll be making our technology even more secure by fusing biometrics and adding continuous authentication over time. These services are available in China first to meet the growing market demand for trusted identity solutions in that region, and over 200 million people are using our technology today. With biometrics adoption and identity services in China leapfrogging other regions, people there are quick to embrace mobile as a way to securely access their money. We will launch other markets over the next few months. In August, I announced that we are launching an identity platform to help people worldwide manage and secure their daily lives. Today, I am excited to announce the official launch of ZOLOZ – the result of the combination of biometrics and authentication expertise from Ant Financial and EyeVerify. People want to connect effortlessly across devices and experiences, and our job is to help them do so securely. Our services fuse biometrics with industry-leading, patented spoof detection technology so people feel secure while they manage their online lives. We are introducing three new products -- ZOLOZ Connect, ZOLOZ Real ID, and ZOLOZ Smile -- that make trust simple for millions of people around the globe. Each day, we are asked the question, 'who are you?' digitally, and we'll be asked this question multiple times a day for the rest of our lives. We are also now using more complex and sophisticated devices and services than ever before, like mobile banking and payments, that make it more challenging to secure our sensitive information online. Our platform helps solve this challenge and answers this question, in all scenarios, regardless of the type of technology, in a way that gives people maximum privacy and control. We are on a mission to make it simple to be known, trusted and safe in the digital world. The new solutions are: ZOLOZ Connect: Enables people to to mobile apps using facial recognition and patented anti-spoof technology with financial grade security, minimizing the potential for fraud and making verification over 99.999% percent accurate with a smartphone alone. ZOLOZ Real ID: An alternative to in-person, real name verification that allows people to use facial recognition and advanced optical character recognition (OCR), to validate their identity with a smartphone's front-facing camera and an ID number or a scan of a government ID. ZOLOZ Smile: People pay for goods and services with a simple face scan and phone number at self-service machines such as kiosks, vending machines, monitors or other devices. Now people can pay at a restaurant, retrieve a parcel, or unlock an account all with just a smile – no smartphone required. Identity should be user-centric, with a focus on privacy, security and user control, which is why we'll be making our technology even more secure by fusing biometrics and adding continuous authentication over time. These services are available in China first to meet the growing market demand for trusted identity solutions in that region, and over 200 million people are using our technology today. With biometrics adoption and identity services in China leapfrogging other regions, people there are quick to embrace mobile as a way to securely access their money. We will launch other markets over the next few months. You Might Also Like ZOLOZ Securing Your Digital Life with ZOLOZ EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. .identity We Are Making Trust Simple EyeVerify has become ZOLOZ to providing a comprehensive, cloud-based identity solution for the underserved and underbanked in Asia. You Might Also Like Securing Your Digital Life with ZOLOZ EyeVerify and Ant Financial launch ZOLOZ. We want to make it simple to be known, trusted and safe in the digital world through biometric identity solutions. We Are Making Trust Simple EyeVerify has become ZOLOZ to providing a comprehensive, cloud-based identity solution for the underserved and underbanked in Asia. | 1740 Main St. Suite 100, Kansas City, MO",
    "Securing Your Digital Life with ZOLOZ In August, I announced that we are launching an identity platform to help people worldwide manage and secure their daily lives. Today, I am excited to announce the official launch of ZOLOZ – the result of the combination of biometrics and authentication expertise from Ant Financial and EyeVerify. People want to connect effortlessly across devices and experiences, and our job is to help them do so securely. Our services fuse biometrics with industry-leading, patented spoof detection technology so people feel secure while they manage their online lives. We are introducing three new products -- ZOLOZ Connect, ZOLOZ Real ID, and ZOLOZ Smile -- that make trust simple for millions of people around the globe. Each day, we are asked the question, 'who are you?' digitally, and we'll be asked this question multiple times a day for the rest of our lives. We are also now using more complex and sophisticated devices and services than ever before, like mobile banking and payments, that make it more challenging to secure our sensitive information online. Our platform helps solve this challenge and answers this question, in all scenarios, regardless of the type of technology, in a way that gives people maximum privacy and control. We are on a mission to make it simple to be known, trusted and safe in the digital world. The new solutions are: ZOLOZ Connect: Enables people to to mobile apps using facial recognition and patented anti-spoof technology with financial grade security, minimizing the potential for fraud and making verification over 99.999% percent accurate with a smartphone alone. ZOLOZ Real ID: An alternative to in-person, real name verification that allows people to use facial recognition and advanced optical character recognition (OCR), to validate their identity with a smartphone's front-facing camera and an ID number or a scan of a government ID. ZOLOZ Smile: People pay for goods and services with a simple face scan and phone number at self-service machines such as kiosks, vending machines, monitors or other devices. Now people can pay at a restaurant, retrieve a parcel, or unlock an account all with just a smile – no smartphone required. Identity should be user-centric, with a focus on privacy, security and user control, which is why we'll be making our technology even more secure by fusing biometrics and adding continuous authentication over time. These services are available in China first to meet the growing market demand for trusted identity solutions in that region, and over 200 million people are using our technology today. With biometrics adoption and identity services in China leapfrogging other regions, people there are quick to embrace mobile as a way to securely access their money. We will launch other markets over the next few months."
  ]
}