{
  "company": "www.remarkholdings.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 10,
    "-1": 4
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.2967741935483871,
    "framing_surveillance": 0.4516129032258064,
    "framing_market": 0.2516129032258064,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 10
    }
  },
  "sample_docs": [
    "AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. Remark Vision Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Remark Vision Provides Remark Vision Provides Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Real-time Situational Awareness Advance noise-filtering –limit false detection ForensicInvestigation Cloud-based or on-premise deployments GDPR Compliant Key Customers & Partners Remark Vision Efficient Operations with Real-time Alerts x Remark Vision Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark Vision Forensic Investigation x Remark Vision Forensic Investigation Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Remark Vision Analytical Dashboards x Remark Vision Analytical Dashboards Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Remark Vision Platform White Paper x Remark Vision Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Remark Vision Identity Recognition White Paper x Remark Vision Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Remark Vision Security PPT x Remark Vision Remark Vision Security PPT Remark Vision Public Security.pptx Remark Vision Retail Intelligence & Customer Analytics Solutions x Remark Vision Retail Intelligence & Customer Analytics Solutions Remark Vision provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. Remark Vision is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. Remark Vision's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Remark Vision FinTech Risk Analysis & Lead Acquisition Solutions x Remark Vision FinTech Risk Analysis & Lead Acquisition Solutions Remark Vision's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. Remark Vision has secured partnerships with several of the largest banks in China. Remark Vision Workplace & Public Safety Management Solutions x Remark Vision Workplace & Public Safety Management Solutions Remark Vision offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. Remark Vision is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Remark Vision Test Cases Investor Relations Sustainability Careers AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. Remark Vision Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Remark Vision Provides Remark Vision Provides Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Real-time Situational Awareness Advance noise-filtering –limit false detection ForensicInvestigation Cloud-based or on-premise deployments GDPR Compliant Key Customers & Partners Remark Vision Efficient Operations with Real-time Alerts x Remark Vision Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark Vision Forensic Investigation x Remark Vision Forensic Investigation Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Remark Vision Analytical Dashboards x Remark Vision Analytical Dashboards Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Remark Vision Platform White Paper x Remark Vision Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Remark Vision Identity Recognition White Paper x Remark Vision Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Remark Vision Security PPT x Remark Vision Remark Vision Security PPT Remark Vision Public Security.pptx Remark Vision Retail Intelligence & Customer Analytics Solutions x Remark Vision Retail Intelligence & Customer Analytics Solutions Remark Vision provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. Remark Vision is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. Remark Vision's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Remark Vision FinTech Risk Analysis & Lead Acquisition Solutions x Remark Vision FinTech Risk Analysis & Lead Acquisition Solutions Remark Vision's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. Remark Vision has secured partnerships with several of the largest banks in China. Remark Vision Workplace & Public Safety Management Solutions x Remark Vision Workplace & Public Safety Management Solutions Remark Vision offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. Remark Vision is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Remark Vision Test Cases Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Advance noise-filtering –limit false detection Cloud-based or on-premise deployments Key Customers & Partners Efficient Operations with Real-time Alerts Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Platform White Paper Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Identity Recognition White Paper Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Security PPT Remark Vision Security PPT Remark Vision Public Security.pptx Retail Intelligence & Customer Analytics Solutions Retail Intelligence & Customer Analytics Solutions Remark Vision provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. Remark Vision is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. Remark Vision's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. FinTech Risk Analysis & Lead Acquisition Solutions FinTech Risk Analysis & Lead Acquisition Solutions Remark Vision's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. Remark Vision has secured partnerships with several of the largest banks in China. Workplace & Public Safety Management Solutions Workplace & Public Safety Management Solutions Remark Vision offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. Remark Vision is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways.",
    "Careers Remark Holdings is known for its focus on developing and deploying cutting-edge technologies. If you are passionate about innovation and want to work on projects involving artificial intelligence (AI), computer vision, data analytics, or other emerging technologies, Remark Holdings offers exciting opportunities in these fields. Remark Holdings has established a presence in various industries, including retail, hospitality, entertainment, and finance. Joining the company will provide you with exposure to diverse sectors and allow you to work on projects with significant impact in these areas. Growth Potential: Remark Holdings offers growth opportunities for its employees. As a growing company, we have room for advancement and the chance to take on new responsibilities. Collaborative Environment: Remark Holdings emphasizes teamwork and collaboration, fostering an environment where employees can work together to solve complex challenges and contribute to the company's success. Impactful Projects: Remark Holdings is involved in projects with real-world applications. From developing AI-powered solutions to enhance customer experiences to leveraging data analytics to provide valuable insights for businesses. If you are interested in working on projects that have tangible impacts, Remark Holdings offers opportunities to do so. Careers Remark Holdings is known for its focus on developing and deploying cutting-edge technologies. If you are passionate about innovation and want to work on projects involving artificial intelligence (AI), computer vision, data analytics, or other emerging technologies, Remark Holdings offers exciting opportunities in these fields. Remark Holdings is known for its focus on developing and deploying cutting-edge technologies. If you are passionate about innovation and want to work on projects involving artificial intelligence (AI), computer vision, data analytics, or other emerging technologies, Remark Holdings offers exciting opportunities in these fields. Remark Holdings has established a presence in various industries, including retail, hospitality, entertainment, and finance. Joining the company will provide you with exposure to diverse sectors and allow you to work on projects with significant impact in these areas. Growth Potential: Remark Holdings offers growth opportunities for its employees. As a growing company, we have room for advancement and the chance to take on new responsibilities. Collaborative Environment: Remark Holdings emphasizes teamwork and collaboration, fostering an environment where employees can work together to solve complex challenges and contribute to the company's success. Impactful Projects: Remark Holdings is involved in projects with real-world applications. From developing AI-powered solutions to enhance customer experiences to leveraging data analytics to provide valuable insights for businesses. If you are interested in working on projects that have tangible impacts, Remark Holdings offers opportunities to do so. Remark Holdings has established a presence in various industries, including retail, hospitality, entertainment, and finance. Joining the company will provide you with exposure to diverse sectors and allow you to work on projects with significant impact in these areas. Growth Potential: Remark Holdings offers growth opportunities for its employees. As a growing company, we have room for advancement and the chance to take on new responsibilities. Collaborative Environment: Remark Holdings emphasizes teamwork and collaboration, fostering an environment where employees can work together to solve complex challenges and contribute to the company's success. Impactful Projects: Remark Holdings is involved in projects with real-world applications. From developing AI-powered solutions to enhance customer experiences to leveraging data analytics to provide valuable insights for businesses. If you are interested in working on projects that have tangible impacts, Remark Holdings offers opportunities to do so.",
    "Sustainability Servicing and Protecting more than 600,000 Families and Aiding Elementary School Efforts along with reductions on CO₂ for a safe and sustainable future. KanKan KanKan AI business has installed its Smart Campus system in more than 300 elementary and secondary schools. The system allows for seamless attendance management, epidemic prevention and control, energy management, campus access control, and notification of risky behaviors. During the ongoing battle with COVID-19 and its variants, the Smart Campus System, with its epidemic prevention and control functionality, has been designed to assist school staff by: Recording body temperature before students enter the campus, thereby allowing staff to monitor health status before students enter classrooms and other buildings. Controlling access to campus using a pre-generated QR code as well as KanKan's computer vision technology to identify that persons trying to enter campus are authorized and are healthy. Reducing manual tasks by automating student attendance management and health screening of students and staff. Using a mobile App to allow for reservation of and touch-free access into private study rooms, classrooms, laboratories, activity rooms and other functional areas. Reducing electricity consumption and greenhouse gas emissions. Sustainability Servicing and Protecting more than 600,000 Families and Aiding Elementary School Efforts along with reductions on CO₂ for a safe and sustainable future. Servicing and Protecting more than 600,000 Families and Aiding Elementary School Efforts along with reductions on CO₂ for a safe and sustainable future. KanKan KanKan AI business has installed its Smart Campus system in more than 300 elementary and secondary schools. The system allows for seamless attendance management, epidemic prevention and control, energy management, campus access control, and notification of risky behaviors. During the ongoing battle with COVID-19 and its variants, the Smart Campus System, with its epidemic prevention and control functionality, has been designed to assist school staff by: Recording body temperature before students enter the campus, thereby allowing staff to monitor health status before students enter classrooms and other buildings. Controlling access to campus using a pre-generated QR code as well as KanKan's computer vision technology to identify that persons trying to enter campus are authorized and are healthy. Reducing manual tasks by automating student attendance management and health screening of students and staff. Using a mobile App to allow for reservation of and touch-free access into private study rooms, classrooms, laboratories, activity rooms and other functional areas. Reducing electricity consumption and greenhouse gas emissions. KanKan AI business has installed its Smart Campus system in more than 300 elementary and secondary schools. The system allows for seamless attendance management, epidemic prevention and control, energy management, campus access control, and notification of risky behaviors. During the ongoing battle with COVID-19 and its variants, the Smart Campus System, with its epidemic prevention and control functionality, has been designed to assist school staff by: Recording body temperature before students enter the campus, thereby allowing staff to monitor health status before students enter classrooms and other buildings. Controlling access to campus using a pre-generated QR code as well as KanKan's computer vision technology to identify that persons trying to enter campus are authorized and are healthy. Reducing manual tasks by automating student attendance management and health screening of students and staff. Using a mobile App to allow for reservation of and touch-free access into private study rooms, classrooms, laboratories, activity rooms and other functional areas. Reducing electricity consumption and greenhouse gas emissions. Smart Campus & Customer-Oriented Services Smart Campus & Customer-Oriented Services KanKan AI's Smart Campus system have quickly taken root in the campus security market. Given the initial success of Smart Campus, KanKan AI will continue its expansion into other locations. Our system frees teachers and staff from repetitive tasks and allowed them to focus on what they do best: teaching. Our product engineers follow up throughout the entire installation process. The after-sales team trains school teachers on the use of products. Finally, the operation team conducts on-going maintenance-oriented monitoring to ensure data accuracy and provide customers with an outstanding experience. Smart Campus & reductions in CO₂ emissions. Smart Campus & reductions in CO₂ emissions. According to United States' Environmental Protection Agency (\"EPA\") calculations, the 4.48 kilowatt.hour of electricity saved per day per classroom by KANKAN AI's Smart Campus System, is equivalent to eight miles driven by an average vehicle, or a savings of 0.357 gallons of gasoline. With the latest update of 150 classrooms there would be an annual reduction of 92.1 tons of CO₂ (a greenhouse gas) emissions and 2.8 tons of SO₂ (a toxic gas) emissions. Schools are seeing both the social and economic benefits of our system. We believe that our continuous dedication to the environment, a system that is customizable to meet the needs of each school and support throughout the entire process will translate to long-term results for our partners and shareholder value for our investors. Schools are seeing both the social and economic benefits of our system. We believe that our continuous dedication to the environment, a system that is customizable to meet the needs of each school and support throughout the entire process will translate to long-term results for our partners and shareholder value for our investors.",
    "AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. KanKan Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Remark Vision Provides Remark Vision Provides Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Real-time Situational Awareness Advance noise-filtering –limit false detection ForensicInvestigation Cloud-based or on-premise deployments GDPR Compliant Key Customers & Partners Remark Vision Efficient Operations with Real-time Alerts x Remark Vision Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark Vision Forensic Investigation x Remark Vision Forensic Investigation Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Remark Vision Analytical Dashboards x Remark Vision Analytical Dashboards Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Remark Vision Platform White Paper x Remark Vision Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Remark Vision Identity Recognition White Paper x Remark Vision Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Remark Vision Security PPT x Remark Vision Remark Vision Security PPT Remark Vision Public Security.pptx Kankan Retail Intelligence & Customer Analytics Solutions x KanKan Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Kankan FinTech Risk Analysis & Lead Acquisition Solutions x KanKan FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Kankan Workplace & Public Safety Management Solutions x KanKan Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Kankan Test Cases More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets including Bikini and Remark Entertainment. The e-boutique showcases a curated collection of chic, one-of-a-kind swim wear and accessories. Remark Entertainment leverages Hollywood to drive brand growth in China. Investor Relations Sustainability AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. KanKan Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Remark Vision Provides Remark Vision Provides Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Real-time Situational Awareness Advance noise-filtering –limit false detection ForensicInvestigation Cloud-based or on-premise deployments GDPR Compliant Key Customers & Partners Remark Vision Efficient Operations with Real-time Alerts x Remark Vision Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark Vision Forensic Investigation x Remark Vision Forensic Investigation Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Remark Vision Analytical Dashboards x Remark Vision Analytical Dashboards Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Remark Vision Platform White Paper x Remark Vision Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Remark Vision Identity Recognition White Paper x Remark Vision Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Remark Vision Security PPT x Remark Vision Remark Vision Security PPT Remark Vision Public Security.pptx Kankan Retail Intelligence & Customer Analytics Solutions x KanKan Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Kankan FinTech Risk Analysis & Lead Acquisition Solutions x KanKan FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Kankan Workplace & Public Safety Management Solutions x KanKan Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Kankan Test Cases Remark Vision is a global leader in Video Analytics with one of the most intelligent, reliable, and fast AI platforms. Our headquarters are in Las Vegas, and we have a global presence with an R&D center in the UK. Top-rated deep learning-based advanced video analytics Top-ranked facial recognition in the western world in NIST Advance noise-filtering –limit false detection Cloud-based or on-premise deployments Key Customers & Partners Efficient Operations with Real-time Alerts Efficient Operations with Real-time Alerts Alert operators of unwarranted activities and potential threats. Behavior Analysis which includes: Disorderly Conduct, Running, Slip, trips,and falls, and Unauthorized Attendance. Site Violation which includes: Intrusion, Loitering, Vandalism, Trespassing, Unattended Baggage Detection, Crowd detection, and people counting. Remark SSP Platform provides extensive search methods for incident investigation. Such searches include: Metadata search for the target person, Metadata search for a vehicle with vehicle attribute and license plate number, Similarity Search (face, pedestrian), Dashboard and Report. Central Command Center for all sites and zones. Features include: Dashboard and Reporting, Custom Analytics, Rule-based alerts, Google map view, Browser-based responsive application, Mobile APP, Integration with major VMS. Remark Vision Platform White Paper Remark Vision Platform White Paper Remark Vision Platform White Paper.pdf Remark Vision Identity Recognition White Paper Remark Vision Identity Recognition White Paper Remark Vision - Identity Recognition White paper.pdf Remark Vision Security PPT Remark Vision Security PPT Remark Vision Public Security.pptx Retail Intelligence & Customer Analytics Solutions Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. FinTech Risk Analysis & Lead Acquisition Solutions FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Workplace & Public Safety Management Solutions Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets including Bikini and Remark Entertainment. The e-boutique showcases a curated collection of chic, one-of-a-kind swim wear and accessories. Remark Entertainment leverages Hollywood to drive brand growth in China. More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets including Bikini and Remark Entertainment. The e-boutique showcases a curated collection of chic, one-of-a-kind swim wear and accessories. Remark Entertainment leverages Hollywood to drive brand growth in China.",
    "AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. KanKan KanKan's easy-to-install AI products are being utilized across a wide range of applications within the retail, financial, public safety, and workplace arenas. Defined by rapid deployment, low maintenance costs, and highly-accurate and actionable results, KanKan is AI simplified. MegaFace TOP 10 Global Facial Recognition See List TUPUTECH V1 TUPUTECH V2 BingMMLab V1 Orion Star Technology iBUG_DeepInsight ULUFace MTDP_ITC EM-DATA SuningUS_AILab Kankan AI Lab Current as of July 25, 2018. ALI ENTERPRISE 2017 Partner of the Year Kankan Retail Intelligence & Customer Analytics Solutions x KanKan Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Kankan FinTech Risk Analysis & Lead Acquisition Solutions x KanKan FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Kankan Workplace & Public Safety Management Solutions x KanKan Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Kankan Test Cases Vegas.com Vegas.com is a premiere destination site that attracts a diverse set of consumers looking to purchase show tickets and reserve hotel rooms. Vegas.com Ticketing x Vegas.com Ticketing From mega concerts to comedy shows to record-breaking artist engagements to the best in magic, dancing and theater, Vegas.com delivers access to the vast selection of live entertainment events that define Vegas. Vegas.com Hotel & Travel Booking x Vegas.com Hotel & Travel Booking From modest hotels for the budget-conscious to palatial suites at premiere properties, Vegas.com providers travelers with access to the rooms they desire with exclusive deals, expert descriptions, ratings and more. And, with access to more than 400 airlines from 1,700 departure cities, Vegas.com delivers great vacation packages for the best prices. More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets… spanning entertainment, lodging, and personal finance. The company also maintains an investment in Sharecare, a leader in the online healthcare space. A health and wellness engagement platform that provides personalized resources to support healthy living. The e-boutique showcases a curated collection of chic, one-of-a-kind swimwear and accesories. Helpful tools to select the best credit card products, mortgage savings, and credit card services. Remark Entertainment leverages Hollywood to drive brand growth in China. Investor Relations AI Simplified Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. Applying the power of AI through practical and accessible solutions that solve problems, reduce risk and deliver positive outcomes across multiple industries. KanKan KanKan's easy-to-install AI products are being utilized across a wide range of applications within the retail, financial, public safety, and workplace arenas. Defined by rapid deployment, low maintenance costs, and highly-accurate and actionable results, KanKan is AI simplified. MegaFace TOP 10 Global Facial Recognition See List TUPUTECH V1 TUPUTECH V2 BingMMLab V1 Orion Star Technology iBUG_DeepInsight ULUFace MTDP_ITC EM-DATA SuningUS_AILab Kankan AI Lab Current as of July 25, 2018. ALI ENTERPRISE 2017 Partner of the Year Kankan Retail Intelligence & Customer Analytics Solutions x KanKan Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. Kankan FinTech Risk Analysis & Lead Acquisition Solutions x KanKan FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Kankan Workplace & Public Safety Management Solutions x KanKan Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Kankan Test Cases KanKan's easy-to-install AI products are being utilized across a wide range of applications within the retail, financial, public safety, and workplace arenas. Defined by rapid deployment, low maintenance costs, and highly-accurate and actionable results, KanKan is AI simplified. Current as of July 25, 2018. Partner of the Year Retail Intelligence & Customer Analytics Solutions Retail Intelligence & Customer Analytics Solutions KanKan provides a broad range of AI products aimed at improving customer interaction and satisfaction and driving sales within retail environments. KanKan is working with its clients to deploy its products in food stores, supermarkets, convenience stores, super brand malls and fast food chains across China and Southeast Asia. KanKan's simple and easy-to-install retail solutions deliver deep insights on consumer behavior, which allows store operators to create better shopping experiences at much lower cost and with higher conversion rates. FinTech Risk Analysis & Lead Acquisition Solutions FinTech Risk Analysis & Lead Acquisition Solutions KanKan's suite of AI assets enables financial services companies to better analyze and evaluate target markets and business opportunities, and its credit risk analysis and lead acquisition products enable financial institutions to identify consumer loan candidates. KanKan has secured partnerships with several of the largest banks in China. Workplace & Public Safety Management Solutions Workplace & Public Safety Management Solutions KanKan offers a suite of products that combine advanced computer vision, intelligent behavioral analysis, and intention analysis models to address problems within institutional and public safety arenas. KanKan is working with its clients to deploy its products across construction sites, college campuses, restaurants, and heavily trafficked roadways. Vegas.com Vegas.com is a premiere destination site that attracts a diverse set of consumers looking to purchase show tickets and reserve hotel rooms. Vegas.com Ticketing x Vegas.com Ticketing From mega concerts to comedy shows to record-breaking artist engagements to the best in magic, dancing and theater, Vegas.com delivers access to the vast selection of live entertainment events that define Vegas. Vegas.com Hotel & Travel Booking x Vegas.com Hotel & Travel Booking From modest hotels for the budget-conscious to palatial suites at premiere properties, Vegas.com providers travelers with access to the rooms they desire with exclusive deals, expert descriptions, ratings and more. And, with access to more than 400 airlines from 1,700 departure cities, Vegas.com delivers great vacation packages for the best prices. Vegas.com is a premiere destination site that attracts a diverse set of consumers looking to purchase show tickets and reserve hotel rooms. From mega concerts to comedy shows to record-breaking artist engagements to the best in magic, dancing and theater, Vegas.com delivers access to the vast selection of live entertainment events that define Vegas. Hotel & Travel Booking Hotel & Travel Booking From modest hotels for the budget-conscious to palatial suites at premiere properties, Vegas.com providers travelers with access to the rooms they desire with exclusive deals, expert descriptions, ratings and more. And, with access to more than 400 airlines from 1,700 departure cities, Vegas.com delivers great vacation packages for the best prices. More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets… spanning entertainment, lodging, and personal finance. The company also maintains an investment in Sharecare, a leader in the online healthcare space. A health and wellness engagement platform that provides personalized resources to support healthy living. The e-boutique showcases a curated collection of chic, one-of-a-kind swimwear and accesories. Helpful tools to select the best credit card products, mortgage savings, and credit card services. Remark Entertainment leverages Hollywood to drive brand growth in China. More of Our Portfolio Remark Holdings also owns and operates a portfolio of digital assets… spanning entertainment, lodging, and personal finance. The company also maintains an investment in Sharecare, a leader in the online healthcare space. A health and wellness engagement platform that provides personalized resources to support healthy living. The e-boutique showcases a curated collection of chic, one-of-a-kind swimwear and accesories. Helpful tools to select the best credit card products, mortgage savings, and credit card services. Remark Entertainment leverages Hollywood to drive brand growth in China."
  ]
}