{
  "company": "www.necsws.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 3
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.4444444444444444,
    "framing_market": 0.5555555555555556,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 3
    }
  },
  "sample_docs": [
    "to updates Pathways for Youth Offending Teams is an end-to-end solution for helping you support young people on their justice journey. Created by ex-practitioners from adult and youth justice, it manages a young person's record right through to completion, including appointments, notes, intervention programmes, case plans, AssetPlus assessments and more. It's easy to use, makes light work of reporting, simplifies collaboration and integrates with other systems. So you can work efficiently and keep focused on young people. Pathways for Youth Offending Teams is an end-to-end solution for helping you support young people on their justice journey. Created by ex-practitioners from adult and youth justice, it manages a young person's record right through to completion, including appointments, notes, intervention programmes, case plans, AssetPlus assessments and more. It's easy to use, makes light work of reporting, simplifies collaboration and integrates with other systems. So you can work efficiently and keep focused on young people. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. Giving Youth Offending Teams extra time to deliver the right support By meeting the latest data transfer requirements for the Youth Justice Board, our Pathways software makes every second count. WHAT MAKES PATHWAYS DIFFERENT? We make AssetPlus assessments faster, so you can focus on their futures You can store live notes, so their next assessment is quicker and more accurate We track sentencing decisions, so you can keep more young people out of custody We update it automatically whenever the AssetPlus framework changes It's in the cloud, so it's always available instantly from any device We're trusted with sensitive data, including years of experience with the YJB Unlike some other providers, we don't charge for annual AssetPlus updates There's no need for in-house IT support, so the total cost of ownership is lower You can see the benefits quickly as it's easy to implement and use WHAT MAKES PATHWAYS DIFFERENT? We make AssetPlus assessments faster, so you can focus on their futures You can store live notes, so their next assessment is quicker and more accurate We track sentencing decisions, so you can keep more young people out of custody We update it automatically whenever the AssetPlus framework changes It's in the cloud, so it's always available instantly from any device We're trusted with sensitive data, including years of experience with the YJB Unlike some other providers, we don't charge for annual AssetPlus updates There's no need for in-house IT support, so the total cost of ownership is lower You can see the benefits quickly as it's easy to implement and use WHAT MAKES PATHWAYS DIFFERENT? WE UNDERSTAND THE IMPACT OF GREAT CASEWORK ON YOUNG LIVES We make AssetPlus assessments faster, so you can focus on their futures You can store live notes, so their next assessment is quicker and more accurate We track sentencing decisions, so you can keep more young people out of custody YOU GET COMPLETE CONFIDENCE IN THE SYSTEM AND YOUR DATA We update it automatically whenever the AssetPlus framework changes It's in the cloud, so it's always available instantly from any device We're trusted with sensitive data, including years of experience with the YJB IT'S HIGHLY EFFICIENT AND THERE'S NO HIDDEN CHARGES Unlike some other providers, we don't charge for annual AssetPlus updates There's no need for in-house IT support, so the total cost of ownership is lower You can see the benefits quickly as it's easy to implement and use WHAT MAKES PATHWAYS DIFFERENT? WE UNDERSTAND THE IMPACT OF GREAT CASEWORK ON YOUNG LIVES WE UNDERSTAND THE IMPACT OF GREAT CASEWORK ON YOUNG LIVES We make AssetPlus assessments faster, so you can focus on their futures You can store live notes, so their next assessment is quicker and more accurate We track sentencing decisions, so you can keep more young people out of custody YOU GET COMPLETE CONFIDENCE IN THE SYSTEM AND YOUR DATA YOU GET COMPLETE CONFIDENCE IN THE SYSTEM AND YOUR DATA We update it automatically whenever the AssetPlus framework changes It's in the cloud, so it's always available instantly from any device We're trusted with sensitive data, including years of experience with the YJB IT'S HIGHLY EFFICIENT AND THERE'S NO HIDDEN CHARGES IT'S HIGHLY EFFICIENT AND THERE'S NO HIDDEN CHARGES Unlike some other providers, we don't charge for annual AssetPlus updates There's no need for in-house IT support, so the total cost of ownership is lower You can see the benefits quickly as it's easy to implement and use Connected to pathways Youth Offender Teams can be used by itself or as a module of Pathways. Pathways is dedicated to supporting corrections staff, offenders, victims and the public throughout the justice process. It connects data and functionality across the justice sector work together. So you can do what you do best, helping people with the knowledge that you have their full and up to date story. Youth Offender Teams can be used by itself or as a module of Pathways. Pathways is dedicated to supporting corrections staff, offenders, victims and the public throughout the justice process. It connects data and functionality across the justice sector work together. So you can do what you do best, helping people with the knowledge that you have their full and up to date story. CASE STUDIES Don't just take our word for it! Here's what our customers have to say about the work we do… Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Don't just take our word for it! Here's what our customers have to say about the work we do… Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Delivering better outcomes in youth justice Case Study With Somerset Council Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Delivering better outcomes in youth justice Case Study With Somerset Council Delivering better outcomes in youth justice Case Study With Somerset Council Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Reducing the risk of reoffending by improving quality controls for accredited training Case Study With The Probation Service Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Introducing New Tech In Prisons To Help Strengthen Rehabilitation Case Study With HMP Forest Bank Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service Helping to protect the public by streamlining rehabilitation Case Study With The Probation Service See all case studies RELATED INSIGHTS Discover the latest news, insight and events from across the justice sector. 15 September 2023 · Articles Resolving common website accessibility issues Our experts discuss some of the most common website accessibility issues and how to resolve them. 15 September 2023 · Articles Digital Divide: The impact of public sector web accessibility on users with visual impairments The accessibility of public sector websites is key for enabling people with disabilities access to vital information. This report examines common issues and how these can be resolved. 11 September 2023 · Articles The Beta phase is where you see your agile project in action The Beta phase of an agile project is where you develop your service for real. The prototype created in Alpha needs to be brought to life with the right infrastructure and support behind it. That's not to say that changes can't happen in Beta, of course. It's not supposed to be the finished article. But some changes are more costly than others, so the key is to plan ahead. 11 September 2023 · Articles The Alpha phase: resist the temptation to rush it The Alpha phase of an agile project is about looking at the findings made in Discovery and exploring what works. It's a vital step on the path towards a great service that keeps things simple. Sometimes, it's when you realise you've gone the wrong way, but we've learned to love that feeling. Because it means you'll build something better in Beta. More insights Discover the latest news, insight and events from across the justice sector. 15 September 2023 · Articles Resolving common website accessibility issues Our experts discuss some of the most common website accessibility issues and how to resolve them. Resolving common website accessibility issues Our experts discuss some of the most common website accessibility issues and how to resolve them. 15 September 2023 · Articles Digital Divide: The impact of public sector web accessibility on users with visual impairments The accessibility of public sector websites is key for enabling people with disabilities access to vital information. This report examines common issues and how these can be resolved. Digital Divide: The impact of public sector web accessibility on users with visual impairments The accessibility of public sector websites is key for enabling people with disabilities access to vital information. This report examines common issues and how these can be resolved. 11 September 2023 · Articles The Beta phase is where you see your agile project in action The Beta phase of an agile project is where you develop your service for real. The prototype created in Alpha needs to be brought to life with the right infrastructure and support behind it. That's not to say that changes can't happen in Beta, of course. It's not supposed to be the finished article. But some changes are more costly than others, so the key is to plan ahead. The Beta phase is where you see your agile project in action The Beta phase of an agile project is where you develop your service for real. The prototype created in Alpha needs to be brought to life with the right infrastructure and support behind it. That's not to say that changes can't happen in Beta, of course. It's not supposed to be the finished article. But some changes are more costly than others, so the key is to plan ahead. 11 September 2023 · Articles The Alpha phase: resist the temptation to rush it The Alpha phase of an agile project is about looking at the findings made in Discovery and exploring what works. It's a vital step on the path towards a great service that keeps things simple. Sometimes, it's when you realise you've gone the wrong way, but we've learned to love that feeling. Because it means you'll build something better in Beta. The Alpha phase: resist the temptation to rush it The Alpha phase of an agile project is about looking at the findings made in Discovery and exploring what works. It's a vital step on the path towards a great service that keeps things simple. Sometimes, it's when you realise you've gone the wrong way, but we've learned to love that feeling. Because it means you'll build something better in Beta. Get in touch Contact us ​from 9.00-17.00 Mon-Fri: Send us a message and we'll get back to you Contact us ​from 9.00-17.00 Mon-Fri:",
    "to updates A CONTROL ROOM VIEW, ON THE MOVE A CONTROL ROOM VIEW, ON THE MOVE xMobile is a brand-new Android application that gives you a control room view of operations on the go. And with its user-friendly interface, it offers a seamless experience, empowering officers with situational and spatial awareness at their fingertips. A complimentary addition to the current GIS \"x†suite of products, xMobile expands the Force's ability to share and receive data with officers, wherever they may be. Designed and developed in partnership with our police customers, xMobile supports operational activities in a way that hasn't been possible before. A CONTROL ROOM VIEW, ON THE MOVE A CONTROL ROOM VIEW, ON THE MOVE xMobile is a brand-new Android application that gives you a control room view of operations on the go. And with its user-friendly interface, it offers a seamless experience, empowering officers with situational and spatial awareness at their fingertips. A complimentary addition to the current GIS \"x†suite of products, xMobile expands the Force's ability to share and receive data with officers, wherever they may be. Designed and developed in partnership with our police customers, xMobile supports operational activities in a way that hasn't been possible before. WHAT MAKES xMOBILE DIFFERENT? Available in your Force's Google Playstore for users to download Offers offline capability in areas of poor network coverage UI is optimised specifically for mobile phones. By using vector icons/graphics we enhance performance and appearance for a better user experience Use of native phone functionalities such as GPS, Messaging etc Gives the ability to create, collate and share information collected in the field in multiple ways Integrates with Force Control Room to allow users to have a spatial view of real time resource and incident data Shares data created from desk-based staff with field officers to assist with response Works with multiple third-party data feeds including Ordnance Survey, OpenStreetMap and what3words Has the ability to accurately record and review the location of events Locate yourself on a map; GPS and background map are still available when network coverage is limited Know the ground covered by recording the route you have travelled WHAT MAKES xMOBILE DIFFERENT? Available in your Force's Google Playstore for users to download Offers offline capability in areas of poor network coverage UI is optimised specifically for mobile phones. By using vector icons/graphics we enhance performance and appearance for a better user experience Use of native phone functionalities such as GPS, Messaging etc Gives the ability to create, collate and share information collected in the field in multiple ways Integrates with Force Control Room to allow users to have a spatial view of real time resource and incident data Shares data created from desk-based staff with field officers to assist with response Works with multiple third-party data feeds including Ordnance Survey, OpenStreetMap and what3words Has the ability to accurately record and review the location of events Locate yourself on a map; GPS and background map are still available when network coverage is limited Know the ground covered by recording the route you have travelled WHAT MAKES xMOBILE DIFFERENT? Simply designed for easy on the go use Available in your Force's Google Playstore for users to download Offers offline capability in areas of poor network coverage UI is optimised specifically for mobile phones. By using vector icons/graphics we enhance performance and appearance for a better user experience Use of native phone functionalities such as GPS, Messaging etc Supports collaborative working across departments Gives the ability to create, collate and share information collected in the field in multiple ways Integrates with Force Control Room to allow users to have a spatial view of real time resource and incident data Shares data created from desk-based staff with field officers to assist with response Works with multiple third-party data feeds including Ordnance Survey, OpenStreetMap and what3words Full sight of the information you need Has the ability to accurately record and review the location of events Locate yourself on a map; GPS and background map are still available when network coverage is limited Know the ground covered by recording the route you have travelled WHAT MAKES xMOBILE DIFFERENT? Simply designed for easy on the go use Simply designed for easy on the go use Available in your Force's Google Playstore for users to download Offers offline capability in areas of poor network coverage UI is optimised specifically for mobile phones. By using vector icons/graphics we enhance performance and appearance for a better user experience Use of native phone functionalities such as GPS, Messaging etc Supports collaborative working across departments Supports collaborative working across departments Gives the ability to create, collate and share information collected in the field in multiple ways Integrates with Force Control Room to allow users to have a spatial view of real time resource and incident data Shares data created from desk-based staff with field officers to assist with response Works with multiple third-party data feeds including Ordnance Survey, OpenStreetMap and what3words Full sight of the information you need Full sight of the information you need Has the ability to accurately record and review the location of events Locate yourself on a map; GPS and background map are still available when network coverage is limited Know the ground covered by recording the route you have travelled Partnering with NEC Software Solutions With 35 years' experience in policing software , we work with every force in the UK Our GIS 'x' product suite supports 23 forces with their operational needs Direct feedback from forces have played a key role in developing xMobile, including North Yorkshire Police Partnering with NEC Software Solutions With 35 years' experience in policing software , we work with every force in the UK Our GIS 'x' product suite supports 23 forces with their operational needs Direct feedback from forces have played a key role in developing xMobile, including North Yorkshire Police Get in touch Contact us ​from 9.00-17.00 Mon-Fri: Send us a message and we'll get back to you Contact us ​from 9.00-17.00 Mon-Fri:",
    "Click to explore our solutions Government Healthcare Housing Public Safety We're making a difference every day We bring a human touch to public service technology, supporting hundreds of organisations in the UK and worldwide. Our software and digital services stay finely tuned to users' needs, helping our customers get the best from a changing world. It's about ambitious delivery today and stronger communities tomorrow. Watch our Video >>> To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. CASE STUDIES AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively See all case studies Latest news News 4 more councils go live with NEC Pathways Four additional councils looking to better support young people are now live with our end-to-end youth offending case management solution . We look at the challenges they face and explore why each of them chose NEC Pathways to help turn young lives around. News London Fire Brigade chooses NEC Software Solutions for improved emergency response Tuesday 13 th May 2025 – London Fire Brigade (LFB) has selected NEC Software Solutions UK (NECSWS) to enhance its emergency response and mobilising system. The new system will introduce cutting-edge technology, make it easier and quicker for the public to contact the Brigade and improve their response to emergencies across the capital. Articles Live facial recognition technology is growing fast in law enforcement. We set out its benefits to explain why. Law enforcement technolog y is evolving fast, and live facial recognition plays a key part in the ecosystem. From strengthening security ahead of major events to finding suspects fast, we explain why its popularity is rising around the world. Click to explore our solutions Government Healthcare Housing Public Safety Click to explore our solutions We're making a difference every day We bring a human touch to public service technology, supporting hundreds of organisations in the UK and worldwide. Our software and digital services stay finely tuned to users' needs, helping our customers get the best from a changing world. It's about ambitious delivery today and stronger communities tomorrow. Watch our Video >>> We're making a difference every day We bring a human touch to public service technology, supporting hundreds of organisations in the UK and worldwide. Our software and digital services stay finely tuned to users' needs, helping our customers get the best from a changing world. It's about ambitious delivery today and stronger communities tomorrow. Watch our Video >>> To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. To deliver the best possible outcomes, we think people first, technology second. By getting to the heart of an issue and discovering the needs of every user, we create software and services that really go the distance. Our public service expertise and creative mindset enables a rapid response to our customers' challenges. They trust us to step in within hours, keeping vital services running smoothly or bringing policy changes to life. In line with our values, we celebrate innovation to deliver the very best outcomes for our customers. From incremental improvements to transformative solutions, we never stop looking for opportunities to make a difference. CASE STUDIES AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe AI helps Wolverhampton Homes predict damp and mould with 70-97% accuracy By identifying which homes are most at risk, housing officers can take early action to keep residents safe Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. Helping Southwark's income management team to prevent homelessness The London Borough of Southwark is using NEC Account Analytics to prioritise arrears cases sooner and keep residents in their homes. As a result, collection rates have risen too. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. From HR to Housing, we're helping Newham council to improve information management NEC Document Management is helping to improve customer services and increase efficiency at the London Borough of Newham. Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Finding £4.8m additional revenue for Birmingham City Council By reviewing a range of Council Tax Discounts and Exemptions, we've helped Birmingham to generate additional revenue Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Tools to help engage people in retrofitting their homes Creating personas to help organisations better engage people in retrofit to improve their homes Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively Helping the income managers at Sovereign Network Group to spot tenants in need Sovereign Network Group is able to prioritise its work more effectively See all case studies Latest news News 4 more councils go live with NEC Pathways Four additional councils looking to better support young people are now live with our end-to-end youth offending case management solution . We look at the challenges they face and explore why each of them chose NEC Pathways to help turn young lives around. News London Fire Brigade chooses NEC Software Solutions for improved emergency response Tuesday 13 th May 2025 – London Fire Brigade (LFB) has selected NEC Software Solutions UK (NECSWS) to enhance its emergency response and mobilising system. The new system will introduce cutting-edge technology, make it easier and quicker for the public to contact the Brigade and improve their response to emergencies across the capital. Articles Live facial recognition technology is growing fast in law enforcement. We set out its benefits to explain why. Law enforcement technolog y is evolving fast, and live facial recognition plays a key part in the ecosystem. From strengthening security ahead of major events to finding suspects fast, we explain why its popularity is rising around the world. 4 more councils go live with NEC Pathways Four additional councils looking to better support young people are now live with our end-to-end youth offending case management solution . We look at the challenges they face and explore why each of them chose NEC Pathways to help turn young lives around. London Fire Brigade chooses NEC Software Solutions for improved emergency response Tuesday 13 th May 2025 – London Fire Brigade (LFB) has selected NEC Software Solutions UK (NECSWS) to enhance its emergency response and mobilising system. The new system will introduce cutting-edge technology, make it easier and quicker for the public to contact the Brigade and improve their response to emergencies across the capital. Live facial recognition technology is growing fast in law enforcement. We set out its benefits to explain why. Law enforcement technolog y is evolving fast, and live facial recognition plays a key part in the ecosystem. From strengthening security ahead of major events to finding suspects fast, we explain why its popularity is rising around the world. Â"
  ]
}