{
  "company": "www.meiyapico.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 7
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 1.0,
    "framing_market": 0.0,
    "num_docs": 7
  },
  "topic_timeline": {
    "20": {
      "-1": 7
    }
  },
  "sample_docs": [
    "Products Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution Training Training Center Online Training Company About Us Contact Us Partners Product Categories Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution New Products Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More Anti-drone Gear Read More Grampus Read More Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More High Speed HDD Duplication System Anti-drone Gear Read More Intelligent Video-investigating Equipment A flagship video surveillance equipment that fulfills all the operational requirements for video investigation of cases. This product integrates video capture and recovery, intelligent video transcoding, video structuring, pedestrian re-identification, target tracking, face tracking, face clustering, vehicle recognition , and blurry image processing, providing a comprehensive and fully functional video investigation solution. It offers intelligent analysis capabilities for individuals, vehicles, cyclists, and faces in video surveillance, and can generate case analysis reports with just one click. Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Contact Us Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China (86)592-530-0188 marketing@300188.cn (86)592-2519335 Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China Follow Us Home Products News Sitemap Blog XML Hot Tags Phone Data Recovery Phone Screen Unlock Phone Password Bypassing forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery forensic hard drive recovery recover deleted files forensics",
    "Products Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution Training Training Center Online Training Company About Us Contact Us Partners Product Categories Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution New Products Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More Anti-drone Gear Read More Grampus Read More Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More High Speed HDD Duplication System Anti-drone Gear Read More Email Forensics System ã€MEDAS】Mass Email Deep Analysis System Hot Tags : forensic Links analysis Intelligence discover Email forensics Email analysis Email deep analysis Hot Tags : forensic Links analysis Intelligence discover Email forensics Email analysis Email deep analysis Forensics Commander A smart forensic equipment that can easily pre-exam,make storage fixing, analyzing, system emulation and real-time reporting. Work like a lab when facing large amount of storage medium. Hot Tags : Data Recovery computer forensics equipment digital forensics solution computer forensics digital forensics for LAEs integrated forensics Hot Tags : Data Recovery computer forensics equipment digital forensics solution computer forensics digital forensics for LAEs integrated forensics MagiCube A portable and highly-integrated computer forensics equipment. High performance such as disk duplication rate up to 39GB/min. Customizable forensics workflows of disk duplication, analysis and OS emulation. Hot Tags : crime scene investigation device storage media data recovery law enforcement digital forensics equipment forensic analysis of HDD,SSD,SD cards portable computer forensics equipment storage media data acquisition Hot Tags : crime scene investigation device storage media data recovery law enforcement digital forensics equipment forensic analysis of HDD,SSD,SD cards portable computer forensics equipment storage media data acquisition Intelligent Video-investigating Equipment A flagship video surveillance equipment that fulfills all the operational requirements for video investigation of cases. This product integrates video capture and recovery, intelligent video transcoding, video structuring, pedestrian re-identification, target tracking, face tracking, face clustering, vehicle recognition , and blurry image processing, providing a comprehensive and fully functional video investigation solution. It offers intelligent analysis capabilities for individuals, vehicles, cyclists, and faces in video surveillance, and can generate case analysis reports with just one click. Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Grid control solution Grid control solution for urban low-altitude drone Hot Tags : Anti-drone Smart city City security Anti-drone technology Grid control solution drone Hot Tags : Anti-drone Smart city City security Anti-drone technology Grid control solution drone Digital Forensic Laboratory With strong support on the digital forensic investigation. The lab will be built and installed with equipment all by Meiya Pico. Also quick training for customers is offered. Hot Tags : digital forensics lab Mobile Phone Forensic digital forensic lab equipment Hot Tags : digital forensics lab Mobile Phone Forensic digital forensic lab equipment Contact Us Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China (86)592-530-0188 marketing@300188.cn (86)592-2519335 Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China Follow Us Home Products News Sitemap Blog XML Hot Tags Phone Data Recovery Phone Screen Unlock Phone Password Bypassing forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery forensic hard drive recovery recover deleted files forensics",
    "Products Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution Training Training Center Online Training Company About Us Contact Us Partners Product Categories Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution New Products Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More Anti-drone Gear Read More Grampus Read More Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More High Speed HDD Duplication System Anti-drone Gear Read More Intelligent Video-investigating Equipment A flagship video surveillance equipment that fulfills all the operational requirements for video investigation of cases. This product integrates video capture and recovery, intelligent video transcoding, video structuring, pedestrian re-identification, target tracking, face tracking, face clustering, vehicle recognition , and blurry image processing, providing a comprehensive and fully functional video investigation solution. It offers intelligent analysis capabilities for individuals, vehicles, cyclists, and faces in video surveillance, and can generate case analysis reports with just one click. Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Video Forensic Tablet A portable device that meets all the requirements for forensic from video sources. It can capture video files from community surveillance, home security cameras, dashcams, drones, and various other general video recording devices. The capture speed can reach up to 550MB/s. It also features fast video recovery, deep video recovery, fast on-site video mapping tool, and one-click generation of video investigation reports. With a weight of only 1050 grams, it is truly lightweight and portable while offering comprehensive functionality. Hot Tags : Intelligent Network Collection Direct Collection Of Storage Media Video Data Recovery One-Click Report Generation Hot Tags : Intelligent Network Collection Direct Collection Of Storage Media Video Data Recovery One-Click Report Generation Contact Us Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China (86)592-530-0188 marketing@300188.cn (86)592-2519335 Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China Follow Us Home Products News Sitemap Blog XML Hot Tags Phone Data Recovery Phone Screen Unlock Phone Password Bypassing forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery forensic hard drive recovery recover deleted files forensics",
    "Products Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution Training Training Center Online Training Company About Us Contact Us Partners Product Categories Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution New Products Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More Anti-drone Gear Read More Grampus Read More Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More High Speed HDD Duplication System Anti-drone Gear Read More High Speed HDD Duplication System A multi-task clone device which can complete disk-to-disk & disk-to-image duplication. Support hash verification, data wiping, image-to-disk recovery and 3-to-3 disk duplication. Hot Tags : disk clone tool system image tool quick disk duplication system disk duplication tool data wiping tool disk duplication High Speed HDD Duplication System Hot Tags : disk clone tool system image tool quick disk duplication system disk duplication tool data wiping tool disk duplication Intelligent Video-investigating Equipment A flagship video surveillance equipment that fulfills all the operational requirements for video investigation of cases. This product integrates video capture and recovery, intelligent video transcoding, video structuring, pedestrian re-identification, target tracking, face tracking, face clustering, vehicle recognition , and blurry image processing, providing a comprehensive and fully functional video investigation solution. It offers intelligent analysis capabilities for individuals, vehicles, cyclists, and faces in video surveillance, and can generate case analysis reports with just one click. Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Contact Us Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China (86)592-530-0188 marketing@300188.cn (86)592-2519335 Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China Follow Us Home Products News Sitemap Blog XML Hot Tags Phone Data Recovery Phone Screen Unlock Phone Password Bypassing forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery forensic hard drive recovery recover deleted files forensics",
    "Products Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution Training Training Center Online Training Company About Us Contact Us Partners Product Categories Computer Forensics Mobile Forensics Video Forensics Lab Solution Anti-Drone Solution New Products Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More Anti-drone Gear Read More Grampus Read More Grid control solution Read More Email Forensics System Read More High Speed HDD Duplication System Read More High Speed HDD Duplication System Anti-drone Gear Read More Mobile Forensics System Extract data fromsocial media,variety of application. Provide specialway to unlock cellphone. The report is generated automatically. Mobile Forensics System assists investigator to find out critical evidences quicker and more efficient. Hot Tags : Phone Data Recovery Phone Screen Unlock Phone Password Bypassing Phone Forensic Toolkit smartphone forensic system android forensics tools Hot Tags : Phone Data Recovery Phone Screen Unlock Phone Password Bypassing Phone Forensic Toolkit smartphone forensic system android forensics tools Recovery Master Critical evidences are hidden under surveillance video. However, formatting, over written or system crash causes data losing. Recovery Master supports to recover data that was lost on surveillance video, in addition to recovery of various formats of data. Such as data from computer, cellphone. Hot Tags : forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery cell phone data recovery Hot Tags : forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery cell phone data recovery MagiCube A portable and highly-integrated computer forensics equipment. High performance such as disk duplication rate up to 39GB/min. Customizable forensics workflows of disk duplication, analysis and OS emulation. Hot Tags : crime scene investigation device storage media data recovery law enforcement digital forensics equipment forensic analysis of HDD,SSD,SD cards portable computer forensics equipment storage media data acquisition Hot Tags : crime scene investigation device storage media data recovery law enforcement digital forensics equipment forensic analysis of HDD,SSD,SD cards portable computer forensics equipment storage media data acquisition Forensics Master Automatic analysis and parallel forensics enable to set different strategies and conduct digital investigation on hard disks efficiently. With essential functions such as system and user artifacts, messenger & mail parser, deleted data & signature recovery, hash verification, etc. Hot Tags : law enforcement case management disk data recovery computer forensic system digital forensics solution crime scene investigation parallel forensics Hot Tags : law enforcement case management disk data recovery computer forensic system digital forensics solution crime scene investigation parallel forensics Forensics Commander A smart forensic equipment that can easily pre-exam,make storage fixing, analyzing, system emulation and real-time reporting. Work like a lab when facing large amount of storage medium. Hot Tags : Data Recovery computer forensics equipment computer forensics digital forensics for LAEs integrated forensics Hot Tags : Data Recovery computer forensics equipment computer forensics digital forensics for LAEs integrated forensics Intelligent Video-investigating Equipment A flagship video surveillance equipment that fulfills all the operational requirements for video investigation of cases. This product integrates video capture and recovery, intelligent video transcoding, video structuring, pedestrian re-identification, target tracking, face tracking, face clustering, vehicle recognition , and blurry image processing, providing a comprehensive and fully functional video investigation solution. It offers intelligent analysis capabilities for individuals, vehicles, cyclists, and faces in video surveillance, and can generate case analysis reports with just one click. Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Hot Tags : Video capture and recovery AI tracking Blurry image enhancement Image feature analysis Contact Us Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China (86)592-530-0188 marketing@300188.cn (86)592-2519335 Meiya Pico Building,12,Guanri Road,2nd Phase of Xiamen Software Park,Xiamen,Fujian,China Follow Us Home Products News Sitemap Blog XML Hot Tags Phone Data Recovery Phone Screen Unlock Phone Password Bypassing forensic hard drive recovery recover deleted files forensics Surveillance Video Recovery forensic hard drive recovery recover deleted files forensics"
  ]
}