{
  "company": "www.fastenterprises.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 5,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 5,
      "0": 3
    }
  },
  "sample_docs": [
    "Other Important Features of GenTax Intuitive User Interface GenTax takes advantage of the latest innovations in user interface technology. The interface is easy to use and facilitates quick access to information and system functions. Table Driven Processing Every agency is expected to support government bodies implementing new taxation policies and procedures. This presents agencies with a challenging and volatile environment where the ability of their information systems to quickly adapt is critical. GenTax is designed to support change. All functions perform processing and validation based on table driven criteria. Multilingual Support Each agency has a set of terminology that is used to describe the various aspects of their business. For example one agency may use Account while another uses Tax Type. The learning curve for any new system is steeper if the terminology is required to change. Therefore, it is desirable that any new systems present information to the end user using familiar terminology. To address this need, GenTax supports configuration of all textual interface items including screen literals, drop down lists, toolbar text and menu items. Additional flexibility is provided by GenTax support for multiple languages, each of which can be configured to use the required terminology. Batch and Online Concurrency GenTax uses a robust queuing approach to perform processing of items typically handled in legacy batch systems. The GenTax queue processing has been implemented to support execution concurrently with the online system. This enables true lights out operations and maximizes the usage of resources. Integrated Internet Capability New technologies place new demands on agencies. Web filing, support of remote users and customer access to information is becoming a necessity. Fast Enterprises recognized this and built GenTax with integrated Intranet and Internet support. Year 2000 Compliance GenTax is Year 2000 compliant. Event Driven Extending GenTax to support additional processing without compromising the integrity of the baseline system is necessary if an agency wants to remain on a maintenance and upgrade path. GenTax enables extensions through an Event Management Architecture. For example, if a new account type requires that a confirmation letter is issued after the account has been added, an agency may define an event that is processed when the account is added without modifying the Add Account software. Integrated Development Environment Fast Enterprises recognized that an agency may require custom modules to implement support for their specific requirements. Examples include new reports, letters and even screens for performing a specific task. The GenTax development environment provides a highly structured set of tools, programming shells, code generation and documentation facilities. This empowers an agency to extend the baseline product to meet their site-specific needs while maintaining the integrity of the baseline product. Integrated Help GenTax is provided with an integrated help facility. An agency may extend the information in the help repository to describe how the system is configured to support their business processes. Context-sensitive help is available throughout the GenTax application. Testing Toolkit Pulling everything together to create the final system requires a comprehensive approach to testing. GenTax provides a testing toolkit that includes integrated problem reporting and tracking, test data management and regression testing facilities. Send mail to gnichol@gentax.com with questions or comments about this website. Copyright 1999-2001 Fast Enterprises LLC Last modified: October 17, 2000",
    "Career Opportunities in Boise, Idaho Fast Enterprises is looking for additional team members interested in a challenging career in product development and multiphase implementation, with an initial assignment in our Boise, Idaho office. Our client in Idaho is the Idaho State Tax Commission (ISTC), who acquired a license to purchase GenTax in January 2000. Fast Enterprises worked with the ISTC over a two-and-a-half year period on their Convert All Tax Systems (CATS) Integrated Tax Project , to successfully implement GenTax for the administration of the States major tax types. Positions for software developers are available for individuals interested in working in a team environment on the successful implementation of our GenTax revenue system. Recent computer science, computer engineering or IT graduates and junior software developers, with two or less years of experience, are encouraged to apply. Facts about Boise, the City of Trees Boise, Idaho is the state capital and also Idahos largest city (approximately 400,000 people live in the greater Boise area). In May 2000, Forbes Magazine ranked Boise fifth among 200 U.S. metropolitan markets in of salary and job growth. The area enjoys a pleasant four-season climate that includes warm, sunny summers and generally mild winters. Boise lies in the heart of the Treasure Valley, the wooded greenbelt that cradles the Boise River. Residents can ski, run whitewater rivers, mountain bike, and hunt and fish within easy driving distance of the city, in an area long known for its natural beauty and proximity to outdoor recreation activities. The Boise metro area is also justifiably proud of its rich cultural life, which includes a professional philharmonic orchestra, dance and opera companies, numerous museums and galleries, gardens, nature centers and a zoo. Major employers in Boise include Hewlett-Packard and Micron Technology (and 300 smaller high-tech firms), the food and drug retailer Albertsons, as well as Boise Cascade, J.R. Simplot Co., Morrison-Knudsen, PixTech, and PowerBar. Fasts client in Boise Idaho State Tax Commission Information about the city City of Boise homepage Boise Visitor Information Centers Insiders Guide - Boise & Sun Valley (recommended) Boise.org 4Boise About Boise Destination Northwest - Boise Local media Boise SkyCam Idaho Statesman (local newspaper includes classifieds) KTVB (Boise, Idaho news station) Cultural attractions Boise Art Museum Boise.org Attractions Boise Basque Museum and Cultural Center Discovery Center of Idaho (Boises hands-on museum) Idaho Black History Museum Idaho Historical Museum Idaho Shakespeare Festival Zoo Boise Reference Boise City Airport The weather in Boise Idaho Idaho Travel and Tourism Guide Send mail to gnichol@gentax.com with questions or comments about this website. Copyright 1999-2003 Fast Enterprises LLC Last modified: June 04, 2003",
    "FastCSE ® FastCSE Fast Enterprises' Child Support Engagement software, FastCSE, is the first fully integrated, commercial off-the-shelf (COTS) solution for modern child support administration. FastCSE is a single application that integrates standard child support functions such as Case Initiation and Maintenance, Locate, Accounting , and Enforcement . In addition, FastCSE also integrates modern capabilities such as Analytics, Business Intelligence , a mobile-friendly Customer Portal, Universal Interfacing , and more. As a COTS product, FastCSE adapts to an agency's evolving laws, processes and best practices in a straightforward, efficient and cost-effective manner. As a Fast Enterprises product, FastCSE will also continually evolve to take advantage of modern technology and techniques, ensuring child support agencies can provide the best possible service to children and families. Notable Features Provides a modern system on a modern platform that meets today's business requirements Provides upgrades that keep up with emerging technology and industry best practices Accommodates evolving federal and state mandates, policies, and procedures in a timely manner and at a reasonable cost Flexibly configured to meet the unique business and technical requirements of child support agencies with minimal need for custom programming Eliminates challenges and risks related to: Training agency business staff on multiple systems Training agency IT staff to maintain and support multiple systems Future interoperability and obsolescence of multiple, independent systems Managing multiple systems built by multiple software companies, installed and maintained by multiple vendors, working under multiple contracts View the FastCSE functional architecture brochure . Active Projects New Zealand Inland Revenue Department on schedule to enter production in October 2021. Why FastCSE ? The FastCSE solution is configured from these modules to meet the specific business and technical objectives of child support agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Case Initiation The Case Initiation module provides support and automation for new or referred registrations, applications, and associated case flows. Our web-based customer self-service features allow applications to be filed securely online on any modern device. Locate The Locate module provides support and automation for location activities utilizing internal agency data, the FAST Data Warehouse, integrated public-records sources, and data acquired through interfaces with external data sources. Establishment The Establishment module supports the calculation and establishment of child support obligations. Our integrated Business Analytics can be used to intelligently \"right-size\" child support orders, as necessary. Case Management The Case Management module maintains customer demographic information, account details, correspondence, and documentation. Our web-based customer self-service features allow customers to perform self-service activities on any modern device. Enforcement The Enforcement module tracks non-compliance and manages billing, collections, and additional enforcement activities for unpaid liabilities. Our integrated Business Analytics can be used to suggest personalized best courses of action in enforcement strategies. Financials The Financials module provides full accounting for all financial transactions, including calculations for obligations, payments, distributions, disbursements, adjustments, and penalty and interest. Optional Subsystems e-Services e-Services provides secure customer and employer self-service functions through an online portal accessible via any modern device. Customers can view case information, submit documents, make payments, and communicate directly with their caseworkers. Employers can respond to income withholding orders, make payments, and report new hires. Business Analytics The integrated Business Analytics subsystem drives agency automation and decision-making. A best course of action can be identified based on the results of previous actions for cases and customer situations resulting in more effective and efficient decisions over time. Scheduling Scheduling allows customers to schedule and maintain in-person appointments with an agency. Customers can select the nearest or most appropriate location and receive immediate confirmation of scheduling. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct case records. FastCSE supports images in industry-standard formats. FastCSE Fast Enterprises' Child Support Engagement software, FastCSE, is the first fully integrated, commercial off-the-shelf (COTS) solution for modern child support administration. FastCSE is a single application that integrates standard child support functions such as Case Initiation and Maintenance, Locate, Accounting , and Enforcement . In addition, FastCSE also integrates modern capabilities such as Analytics, Business Intelligence , a mobile-friendly Customer Portal, Universal Interfacing , and more. As a COTS product, FastCSE adapts to an agency's evolving laws, processes and best practices in a straightforward, efficient and cost-effective manner. As a Fast Enterprises product, FastCSE will also continually evolve to take advantage of modern technology and techniques, ensuring child support agencies can provide the best possible service to children and families. Fast Enterprises' Child Support Engagement software, FastCSE, is the first fully integrated, commercial off-the-shelf (COTS) solution for modern child support administration. FastCSE is a single application that integrates standard child support functions such as Case Initiation and Maintenance, Locate, Accounting , and Enforcement . In addition, FastCSE also integrates modern capabilities such as Analytics, Business Intelligence , a mobile-friendly Customer Portal, Universal Interfacing , and more. As a COTS product, FastCSE adapts to an agency's evolving laws, processes and best practices in a straightforward, efficient and cost-effective manner. As a Fast Enterprises product, FastCSE will also continually evolve to take advantage of modern technology and techniques, ensuring child support agencies can provide the best possible service to children and families. Notable Features Provides a modern system on a modern platform that meets today's business requirements Provides upgrades that keep up with emerging technology and industry best practices Accommodates evolving federal and state mandates, policies, and procedures in a timely manner and at a reasonable cost Flexibly configured to meet the unique business and technical requirements of child support agencies with minimal need for custom programming Eliminates challenges and risks related to: Training agency business staff on multiple systems Training agency IT staff to maintain and support multiple systems Future interoperability and obsolescence of multiple, independent systems Managing multiple systems built by multiple software companies, installed and maintained by multiple vendors, working under multiple contracts View the FastCSE functional architecture brochure . Active Projects New Zealand Inland Revenue Department on schedule to enter production in October 2021. Provides a modern system on a modern platform that meets today's business requirements Provides upgrades that keep up with emerging technology and industry best practices Accommodates evolving federal and state mandates, policies, and procedures in a timely manner and at a reasonable cost Flexibly configured to meet the unique business and technical requirements of child support agencies with minimal need for custom programming Eliminates challenges and risks related to: Training agency business staff on multiple systems Training agency IT staff to maintain and support multiple systems Future interoperability and obsolescence of multiple, independent systems Managing multiple systems built by multiple software companies, installed and maintained by multiple vendors, working under multiple contracts Training agency business staff on multiple systems Training agency IT staff to maintain and support multiple systems Future interoperability and obsolescence of multiple, independent systems Managing multiple systems built by multiple software companies, installed and maintained by multiple vendors, working under multiple contracts View the FastCSE functional architecture brochure . New Zealand Inland Revenue Department on schedule to enter production in October 2021. Why FastCSE ? The FastCSE solution is configured from these modules to meet the specific business and technical objectives of child support agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. The FastCSE solution is configured from these modules to meet the specific business and technical objectives of child support agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Case Initiation The Case Initiation module provides support and automation for new or referred registrations, applications, and associated case flows. Our web-based customer self-service features allow applications to be filed securely online on any modern device. Locate The Locate module provides support and automation for location activities utilizing internal agency data, the FAST Data Warehouse, integrated public-records sources, and data acquired through interfaces with external data sources. Establishment The Establishment module supports the calculation and establishment of child support obligations. Our integrated Business Analytics can be used to intelligently \"right-size\" child support orders, as necessary. Case Management The Case Management module maintains customer demographic information, account details, correspondence, and documentation. Our web-based customer self-service features allow customers to perform self-service activities on any modern device. Enforcement The Enforcement module tracks non-compliance and manages billing, collections, and additional enforcement activities for unpaid liabilities. Our integrated Business Analytics can be used to suggest personalized best courses of action in enforcement strategies. Financials The Financials module provides full accounting for all financial transactions, including calculations for obligations, payments, distributions, disbursements, adjustments, and penalty and interest. The Case Initiation module provides support and automation for new or referred registrations, applications, and associated case flows. Our web-based customer self-service features allow applications to be filed securely online on any modern device. The Locate module provides support and automation for location activities utilizing internal agency data, the FAST Data Warehouse, integrated public-records sources, and data acquired through interfaces with external data sources. The Establishment module supports the calculation and establishment of child support obligations. Our integrated Business Analytics can be used to intelligently \"right-size\" child support orders, as necessary. The Case Management module maintains customer demographic information, account details, correspondence, and documentation. Our web-based customer self-service features allow customers to perform self-service activities on any modern device. The Enforcement module tracks non-compliance and manages billing, collections, and additional enforcement activities for unpaid liabilities. Our integrated Business Analytics can be used to suggest personalized best courses of action in enforcement strategies. The Financials module provides full accounting for all financial transactions, including calculations for obligations, payments, distributions, disbursements, adjustments, and penalty and interest. Optional Subsystems e-Services e-Services provides secure customer and employer self-service functions through an online portal accessible via any modern device. Customers can view case information, submit documents, make payments, and communicate directly with their caseworkers. Employers can respond to income withholding orders, make payments, and report new hires. Business Analytics The integrated Business Analytics subsystem drives agency automation and decision-making. A best course of action can be identified based on the results of previous actions for cases and customer situations resulting in more effective and efficient decisions over time. Scheduling Scheduling allows customers to schedule and maintain in-person appointments with an agency. Customers can select the nearest or most appropriate location and receive immediate confirmation of scheduling. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct case records. FastCSE supports images in industry-standard formats. e-Services provides secure customer and employer self-service functions through an online portal accessible via any modern device. Customers can view case information, submit documents, make payments, and communicate directly with their caseworkers. Employers can respond to income withholding orders, make payments, and report new hires. The integrated Business Analytics subsystem drives agency automation and decision-making. A best course of action can be identified based on the results of previous actions for cases and customer situations resulting in more effective and efficient decisions over time. Scheduling allows customers to schedule and maintain in-person appointments with an agency. Customers can select the nearest or most appropriate location and receive immediate confirmation of scheduling. Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct case records. FastCSE supports images in industry-standard formats.",
    "FastUI-PL FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. Customer Engagement Customers can conveniently access services, accounts, and messages on our 24/7, mobile-friendly self-service portal. Workflow & Process Automation Endless automation capabilities reduce manual work, freeing up staff time to focus on higher-value activities and customer service. Fraud Mitigation & Identity Verification Cloud-based solutions safeguard data and funds, increase public confidence and trust, and reduce workload. Financials & Accounting Automate common financial transactions, including contribution and wage reports, for more accurate, centralized accounting. Core Business Intelligence Gain real-time insights and analytics for enhanced productivity, data-driven decision-making, and risk mitigation. Reporting Create, manage, and execute pre-programmed reports that adhere to an agency's formatting standards and USDOL requirements. Appeals Administer all appeals activity in our 360° module for customers and staff, including file management, fact-finding, and appointment scheduling. Centralized Interfaces Consolidate all business interfaces via the FAST Gateway, a built-in integration layer that enables staff to efficiently work in one browser. Previous Next 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. Fast Strategic Services Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. Customers can conveniently access services, accounts, and messages on our 24/7, mobile-friendly self-service portal. Workflow & Process Automation Endless automation capabilities reduce manual work, freeing up staff time to focus on higher-value activities and customer service. Fraud Mitigation & Identity Verification Cloud-based solutions safeguard data and funds, increase public confidence and trust, and reduce workload. Automate common financial transactions, including contribution and wage reports, for more accurate, centralized accounting. Gain real-time insights and analytics for enhanced productivity, data-driven decision-making, and risk mitigation. Create, manage, and execute pre-programmed reports that adhere to an agency's formatting standards and USDOL requirements. Administer all appeals activity in our 360° module for customers and staff, including file management, fact-finding, and appointment scheduling. Consolidate all business interfaces via the FAST Gateway, a built-in integration layer that enables staff to efficiently work in one browser. 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide Projects delivered on time and on budget Years of transforming government Active clients using FastCore software worldwide A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Fast Strategic Services Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. FIVS provides packaged identity security to reduce fraud and give you peace of mind. FCS uses real-time data to customize and automate your collections processes like never before. FAS expands your data lake far beyond what you thought was possible.",
    "FastDS-VS ® FastDS-VS FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. Notable Features Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Live/In Production Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Why FastDS-VS ? The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Customer The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Driver Services Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle Services Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. Financials The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. Workflow The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. Information The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. Management Studio The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. Optional Subsystems International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats. FastDS-VS FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. Notable Features Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Live/In Production Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Why FastDS-VS ? The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Customer The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Driver Services Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle Services Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. Financials The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. Workflow The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. Information The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. Management Studio The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. Optional Subsystems International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats. International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats."
  ]
}