{
  "company": "www.thalesgroup.com",
  "dominant_topics": [
    7,
    -1,
    9,
    4
  ],
  "topic_counts": {
    "7": 1,
    "-1": 1,
    "9": 1,
    "4": 1
  },
  "topic_descriptions": {
    "7": "ramco, payroll, aviation, en, ramco systems",
    "9": "gsm, gprs, wireless, cdma, rf",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader"
  },
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.0,
    "framing_market": 0.6666666666666666,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "4": 1,
      "7": 1,
      "9": 1
    }
  },
  "sample_docs": [
    "Need further information? Contact an aerospace speakers \"Green†aviation, digital cockpits, seamless connectivity for pilots and passengers, increases in drone traffic, etc. – the aerospace sector is not lacking technological challenges. An area in which Thales has unique expertise, notably because it is the only player that is a market-leader in equipment both on the aircraft and on the ground, and because it is on board a very broad range of civil and military aircraft. Our Aerospace experts RELATED CONTENT Contact an aerospace speakers \"Green†aviation, digital cockpits, seamless connectivity for pilots and passengers, increases in drone traffic, etc. – the aerospace sector is not lacking technological challenges. An area in which Thales has unique expertise, notably because it is the only player that is a market-leader in equipment both on the aircraft and on the ground, and because it is on board a very broad range of civil and military aircraft.Â",
    "Need further information? Contact a digital identity and security speakers More than 30,000 organisations around the world have already trusted Thales with verifying the identities of people and objects, authorising access to digital services, analysing vast amounts of information in real time and encrypting data. The integration of Gemalto gives Thales unparalleled expertise in three key areas of digital security: biometrics and digital identity, secure IoT (Internet of Things) connectivity, and data protection through encryption. Our Digital Identity and Security experts RELATED CONTENT Contact a digital identity and security speakers More than 30,000 organisations around the world have already trusted Thales with verifying the identities of people and objects, authorising access to digital services, analysing vast amounts of information in real time and encrypting data. The integration of Gemalto gives Thales unparalleled expertise in three key areas of digital security: biometrics and digital identity, secure IoT (Internet of Things) connectivity, and data protection through encryption. Our Digital Identity and Security experts",
    "Need further information? Contact a connectivity speakers The rollout of 5G and the proliferation of connected objects – amongst other things – are going to generate a host of new services, which will simplify life for businesses and private citizens alike. At the same time, people want 24/7 mobile connectivity that is not only effective, but also secure. Thanks to the expertise of its teams and its dual mastery of digital and cybersecurity technologies, Thales has established itself as one of the only companies capable of developing seamless, safe and secure connectivity, anytime and anywhere. Our Connectivity experts RELATED CONTENT Contact a connectivity speakers The rollout of 5G and the proliferation of connected objects – amongst other things – are going to generate a host of new services, which will simplify life for businesses and private citizens alike. At the same time, people want 24/7 mobile connectivity that is not only effective, but also secure. Thanks to the expertise of its teams and its dual mastery of digital and cybersecurity technologies, Thales has established itself as one of the only companies capable of developing seamless, safe and secure connectivity, anytime and anywhere.",
    "You are here 首é BRUSSELS CORTENBERGH Av. De Cortenbergh 60 1000 Bruxelles Phone: +32 26 27 03 10 View location on map MUMBAà Vaibhav Chambers, 8th floor, Bandra Kurla Complex, Opp. Income Tax Office, Bandra East Mumbai – 400 051 Phone: +91 22 6167 5900 View location on map CHIETI Via Erasmo Piaggio 71 66100 Chieti Phone: +39 0871 562444 View location on map MADRID DIEGO MARIN AGUILERA Calle Diego Marin Aguilera, 1 28919 Leganés Madrid Phone: +34 91 453 24 00 View location on map CLEARWATER FL (PROXY SITE) 16255 Bay Vista Drive Clearwater Florida 33760 Phone: (813) 855-2251 View location on map CLARKSBURG - GATEWAY CAMPUS (PROXY) 22605 Gateway Center Drive, Clarksburg Maryland 20871 Phone: (240) 864-7000 View location on map FAYETTEVILLE NORTH CAROLINA 4155 Ferncreek Drive, Suite 202, Fayetteville North Carolina Phone: (910) 321-0540 View location on map JACKSONVILLE FL 4640 Sub Chaser Court, Suites 103 & 104 Jacksonville Florida 32244 Phone: (904) 771-3706 View location on map GLEN BURNIE MD (PROXY SITE) 504 McCormick Road Glen Burnie Maryland 21061 Phone: (240) 864-7000 View location on map BILLERICA MASSACHUSETTS (PROXY SITE) 700 Technology Park Drive Billerica Massachusetts 01821 Phone: (781) 541-6330 View location on map AURORA ILLINOIS (PROXY SITE) 1444 N Farnsworth Avenue Aurora Illinois 60505 Phone: (570) 848-2404 View location on map SÃO PAULO PROF. RUBIA MEIRA Aerospace, Defence and Security Rua Prof. Rubiao Meira - 50 Vila Washington, Sao Bernardo do Campo - SP CP: 09890-430 Sao Pãulo Phone: +55 11 3303 1200 View location on map MONTREAL ST-LAURENT MARIECURIE Aerospace 2800 Marie-Curie Ave Montreal Quebec H4S 2C2 Phone: (514) 832-0900 View location on map CHENGDU Aerospace No. 9 Baichuan Road, West Hi-Tech Industry Zone Chengdu 611731 Phone: +86 (28) 6280 3373 View location on map BEIJING EASYSKY TECHNOLOGY LTD. Aerospace 16/F, Guanhai Tower, No. 8 Guan Cheng Yuan, Madian, Haidian Dist. Beijing 100088 Phone: +86 (10) 6195 5800 View location on map BEIJING SUNFLOWER TOWER Aerospace, Digital Identity and Security, Group, Space Unit 1301, 13F Sunflower Tower, 37 Maizidian St, Beijing 100125 Phone: +86 (10) 6587 5000 View location on map BEIJING TIANZHU Aerospace 3rd Floor, No 1 Building, 20 Tianzhu Rd, Shunyi District, 101312, Beijing Phone: +86 (10) 6146 4600 View location on map SHANGHAI THALES ELECTRON TUBES CO. LTD. Aerospace, Space Room101, No 24, Lane 1288 Luo Ning Road Bao Shan Shanghai Phone: +86 (21) 3616 0001 View location on map Av. De Cortenbergh 60 1000 Bruxelles Vaibhav Chambers, 8th floor, Bandra Kurla Complex, Opp. Income Tax Office, Bandra East Mumbai – 400 051 Via Erasmo Piaggio 71 66100 Chieti Calle Diego Marin Aguilera, 1 28919 Leganés Madrid 16255 Bay Vista Drive Clearwater Florida 33760 22605 Gateway Center Drive, Clarksburg Maryland 20871 4155 Ferncreek Drive, Suite 202, Fayetteville North Carolina 4640 Sub Chaser Court, Suites 103 & 104 Jacksonville Florida 32244 504 McCormick Road Glen Burnie Maryland 21061 700 Technology Park Drive Billerica Massachusetts 01821 1444 N Farnsworth Avenue Aurora Illinois 60505 Rua Prof. Rubiao Meira - 50 Vila Washington, Sao Bernardo do Campo - SP CP: 09890-430 Sao Pãulo 2800 Marie-Curie Ave Montreal Quebec H4S 2C2 No. 9 Baichuan Road, West Hi-Tech Industry Zone Chengdu 611731 16/F, Guanhai Tower, No. 8 Guan Cheng Yuan, Madian, Haidian Dist. Beijing 100088 Unit 1301, 13F Sunflower Tower, 37 Maizidian St, Beijing 100125 3rd Floor, No 1 Building, 20 Tianzhu Rd, Shunyi District, 101312, Beijing Room101, No 24, Lane 1288 Luo Ning Road Bao Shan Shanghai"
  ]
}