{
  "company": "www.daon.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 48,
    "-1": 11
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3157894736842105,
    "framing_surveillance": 0.1203007518796992,
    "framing_market": 0.5639097744360902,
    "num_docs": 59
  },
  "topic_timeline": {
    "20": {
      "-1": 11,
      "0": 48
    }
  },
  "sample_docs": [
    "Tailored security and identity solutions Governments and commercial organizations today are implementing policy-based security and control systems using person-centric authentication methods such as tokens, cards and biometrics. These types of security systems bring many advantages including: Enhanced national security Legitimate trade and travel Ensured integrity of our immigration systems Adherence to existing privacy laws and policies Positive identification of individuals and users Reduced risk of fraudulent use of identity Operational efficiencies and reduced costs Enhanced convenience for users However, deployment of these security systems can often present significant challenges, such as volume, interoperability and performance, as well as security and privacy issues. Daon's leading biometric identity management software has been architected and developed to specifically address these challenges in some of the most mission critical environments. Daon delivers best-of-breed products and technology innovation, as well as biometric subject matter expertise, to our customers. Daon Engine , Daon's identity management platform, meets the identification requirements of many markets including Public Sector, Financial Services and Pharmaceuticals. Today, Daon is teamed with systems integrators around the globe to develop biometric-based solutions for Employee Credentialing, Border Control and Immigration Management, Civil ID Systems and Registered Traveler Programs. Legitimate trade and travel Ensured integrity of our immigration systems Adherence to existing privacy laws and policies Positive identification of individuals and users Reduced risk of fraudulent use of identity Operational efficiencies and reduced costs Enhanced convenience for users However, deployment of these security systems can often present significant challenges, such as volume, interoperability and performance, as well as security and privacy issues. Daon's leading biometric identity management software has been architected and developed to specifically address these challenges in some of the most mission critical environments. Daon delivers best-of-breed products and technology innovation, as well as biometric subject matter expertise, to our customers. Daon Engine , Daon's identity management platform, meets the identification requirements of many markets including Public Sector, Financial Services and Pharmaceuticals. Today, Daon is teamed with systems integrators around the globe to develop biometric-based solutions for Employee Credentialing, Border Control and Immigration Management, Civil ID Systems and Registered Traveler Programs.",
    "Controlling access to physical and logical assets represents an ongoing security challenge for any organization. In pharmaceutical organizations, this challenge is magnified by the need for a secure discovery and development environment where information can be accessed and shared in a protected manner across teams and third party collaborators. For a secure discovery and development environment to exist, strong authentication of users and non-repudiation of signatures and actions is required. An identity management solution that integrates with legacy systems and allows users to manage physical and logical security can meet that challenge. The Daon identity management system delivers biometric access control to systems and secure areas protects Intellectual Property (IP) improves manufacturing workflow with audit trails and digital signatures for approvals and accountability. For more information on Daon for Secure Logical and Physical Access Control, please download the factsheet (146Kb pdf). delivers biometric access control to systems and secure areas protects Intellectual Property (IP) improves manufacturing workflow with audit trails and digital signatures for approvals and accountability. For more information on Daon for Secure Logical and Physical Access Control, please download the factsheet (146Kb pdf).",
    "Financial Services: Biometrics in UK Financial Services Regulations \"A firm should establish and maintain appropriate systems and controls for the management of its information security risks. This might include, but is not limited to, consideration of: Confidentiality: ensuring that information is accessible only to an authorized person or system (this may require firewalls within a system, as well as entry restrictions); Integrity: safeguarding the accuracy and completeness of the information and its processing; Availability: ensuring that an authorized person or system has access to the information when required; Authentication: ensuring that the identity of the person or system that processed the information is verified; and Non-repudiation and accountability: ensuring that the person or system that processed the information cannot deny their action.\" Integrity: safeguarding the accuracy and completeness of the information and its processing; Availability: ensuring that an authorized person or system has access to the information when required; Authentication: ensuring that the identity of the person or system that processed the information is verified; and Non-repudiation and accountability: ensuring that the person or system that processed the information cannot deny their action.\" Availability: ensuring that an authorized person or system has access to the information when required; Authentication: ensuring that the identity of the person or system that processed the information is verified; and Non-repudiation and accountability: ensuring that the person or system that processed the information cannot deny their action.\" Authentication: ensuring that the identity of the person or system that processed the information is verified; and Non-repudiation and accountability: ensuring that the person or system that processed the information cannot deny their action.\" Non-repudiation and accountability: ensuring that the person or system that processed the information cannot deny their action.\"",
    "Pharma & Life Sciences: Endo Pharmaceuticals Inc. Introduces New Access Control Security System Daon, a provider of enterprise class biometric authentication solutions, and Endo Pharmaceuticals Inc. (ENDP, ENDPW), a specialty pharmaceutical company with an established leadership in pain management, have introduced Daon's biometric logical access system for all employees to protect and control access to all company applications and systems. Endo Pharmaceuticals has enrolled 250 employees initially into the system using their finger biometrics for logical access. With the significant cost savings that Daon's biometric authentication technology can offer, plus the added benefits of heightened security and ease of management, Endo recognize the value Daon have delivered to the efficient running of their business. Increasing security has become more important as life sciences companies strive to develop new products and differentiate themselves from their competitors. Protecting the information assets of these organizations is of paramount importance in today's fast-moving business world. Download Case Study Download .pdf, 136KB >>",
    "Financial Services: Daon & PKI Public Key Infrastructure (commonly known as PKI) is a long established and well-known method for providing authentication and digital signatures solutions to electronic business problems. In this short paper, we outline how the \"traditional PKI\" with its complex infrastructure is no longer necessary and a more streamlined and cost effective approach can be taken to the problem. This approach will reduce costs, increase security and will also enable PKI to live up to its business promise. We outline how the use of biometrics, in conjunction with PKI, can deliver on the real benefits that PKI was intended originally to achieve. Download Biometrics and PKI based Digital Signatures (161KB pdf)"
  ]
}