{
  "company": "www.20face.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Facial recognition makes life easy Read the latest news about 20face and information about access control and facial recognition on our blog. December 9, 2024 Casino's of French Groupe Tranchant get privacy proof facial recognition solution for efficient and controlled entry. Read more October 9, 2024 20Face obtains ISO/IEC 27001:2022 certification Read more September 16, 2024 Secure Logistics: A 90% Faster verification process Read more Casino's of French Groupe Tranchant get privacy proof facial recognition solution for efficient and controlled entry. 20Face obtains ISO/IEC 27001:2022 certification Secure Logistics: A 90% Faster verification process The user is key: Consent-based recognition We believe that the experience of the user should be central. That's why we use facial recognition to provide access. And that's why we make it privacy proof. 1 Self registration Safe, secure and without saving a single photo. Safe, secure and without saving a single photo. 2 The user in control Of his data and of recognition. With one click. Of his data and of recognition. With one click. 3 Always easy access Without cards, tags or codes Without cards, tags or codes 20face delivers two products: Privacy proof access by facial recognition solution for companies and governments. Software Development Kit for the integration of facial recognition in a wide range of possible solutions. 20face uses self-developed facial recognition algorithms, in close cooperation with the University of Twente. 20face's facial recognition features: Top-10 world-wide in speed of code 99.85 on LFW Accuracy We work together with established names in the access management industry for implementation, integration and installation. by downloading one of our resources 20face's name originates from the region and university in which it was founded: Twente pronounced in English, sounds like twenty. Want to know more about our company?",
    "We provide privacy proof biometrics for a safe and seamless journey Become a partner, connect to our ecosystem and provide privacy proof recognition for your customers. See how it works Unleash the full potential of biometrics Users give consent to endpoints for recognition and manage the release of their personal data. They control their own data and opt-in or opt-out real-time. See our partners' implementations Our partner Compo Software develops a ticketless system for events and venues like the Heracles stadium and Johan Cruijff ArenA. Our partner Platvoet Beveiliging installs facial recognition for accessing buildings and venues. No tags, cards or keys required. Several partners in Healthcare work on the development of remote access for caretakers, controlled living environments and wandering detection solutions. What's on our mind 20face in KVK innovation top 100 20face finalist Johan Cruijff ArenA challenge Heracles Almelo & 20face start successful trial See the power of 20face live During the demo we will discuss how you can become a partner, integrate your solution and hook up to our platform."
  ]
}