{
  "company": "www.axxonsoft.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 13,
    "-1": 6
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0689655172413793,
    "framing_surveillance": 0.2068965517241379,
    "framing_market": 0.7241379310344828,
    "num_docs": 19
  },
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 13
    }
  },
  "sample_docs": [
    "Why IP Video Surveillance? Security: an Industry in Change Technology Comparison Cost/Benefit Analysis Security: an Industry in Change Products Axxon Intellect Enterprise Axxon Smart PRO Integrated Security Solutions POS Integration Face Recognition ATM Integration License Plate Recognition Traffic Control Railcar Number Recognition Vertical Solutions Retail Banking Traffic Oil & Gas Homeland Security Case Studies Financial Homeland Security Retail Transportation Partners Systems / Security Integrators Resellers Distributors Software Developers OEM Partner Services Become a Partner Technological Partners Systems / Security Integrators Resources Marketing Materials Documentation Downloads Company Management News Upcoming Events Industry Awards Press Kit Careers International Offices Raiffeisen Bank Aval, a branch of the global Raiffeisen International Bank, is one of the largest Ukranian banks, serving nearly 4 million customers and over 200,000 legal entities. In any bank, particularly one with such reputation and customer base, safety is utmost importance Read more... Axxon is a leading software developer that combines IP-based physical security management, intelligent video surveillance, and an enterprise-wide platform into fully integrated vertical and horizontal solutions. Our solutions help governments, institutions, and commercial enterprises of any size protect their people and facilities, prevent asset loss and damage, and improve business efficiency, all at the same time. For our partners and customers, the possibilities are endless. This is our vision. What's yours? Interested in Partnering with Axxon? This could be the start of a beautiful partnership! to learn how we can help make your business more profitable today! We can help you improve your physical security, your business processes, and your bottom line. Five reasons why were the best at what we do. What is Axxon Enterprise? Axxon Enterprise is remarkably advanced IP-based physical security management platform , which provides a single environment that combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities. Why IP Video Surveillance? Explore our free resources to learn how video security technology is changingand how it can change your business for the better. 08/13/2009 AxxonSoft and Basler will cooperate in technology development 07/17/2009 Axxon Intellect 4.7.6 supports NVIDIA graphic processors for video decompression 07/17/2009 The new Intellect version 4.7.6 released by AxxonSoft 07/03/2009 AxxonSoft took part in the Video Content Analysis Conference in Brussels 05/25/2009 Axxon contributes to the largest security trade show IFSEC 2009 04/22/2009 Intellect at Sibneft-Krasnoyarsknefteproduct petrolium stations",
    "Live webinars Upcoming webinars On-demand AxxonSoft Webinars Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Live webinars Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Register Artificial Intelligence Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Register Axxon Next VMS Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Register Safe city Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Register Retail Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Register Banking Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Register Transportation Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Register Gambling Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Register Intellect PSIM Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Register Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Register Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Artificial Intelligence Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Register Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Axxon Next VMS Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Register Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Safe city Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Register Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Retail Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Register Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Banking Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Register Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Transportation Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Register Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Gambling Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Register Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Intellect PSIM Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Register Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Upcoming webinars Axxon Next VMS Introduction to AxxonSoft solutions based on Axxon Next VMS and Intellect PSIM Africa English Thursday, August 20, 2020 11:00 AM West and Central Africa Presenter: AxxonSoft JOIN Axxon Next VMS Introduction to AxxonSoft solutions based on Axxon Next VMS and Intellect PSIM Africa English Thursday, August 20, 2020 11:00 AM West and Central Africa Presenter: AxxonSoft JOIN Introduction to AxxonSoft solutions based on Axxon Next VMS and Intellect PSIM Thursday, August 20, 2020 11:00 AM West and Central Africa On-demand Subscribe to our newsletter Analíticas e Inteligencia Artificial para Seguridad August 07, 2020 Bring AI Analytics to Your Video Surveillance System July 29, 2020 Proactive Surveillance: AI Analytics to help stop COVID-19 July 21, 2020 Load more Analíticas e Inteligencia Artificial para Seguridad August 07, 2020 Analíticas e Inteligencia Artificial para Seguridad Bring AI Analytics to Your Video Surveillance System July 29, 2020 Bring AI Analytics to Your Video Surveillance System Proactive Surveillance: AI Analytics to help stop COVID-19 July 21, 2020 Proactive Surveillance: AI Analytics to help stop COVID-19",
    "AxxonSoft Webinars Learn AI-powered VMS! Join a live webinar with AxxonSoft experts See Axxon Next VMS and Axxon Intellect PSIM in action as we demonstrate features and technologies. Book a personal demo to get your questions answered in real time by AxxonSoft Sales & Technical experts and learn how to take on your security and business challenges. Register now Learn AI-powered VMS! Join a live webinar with AxxonSoft experts See Axxon Next VMS and Axxon Intellect PSIM in action as we demonstrate features and technologies. Book a personal demo to get your questions answered in real time by AxxonSoft Sales & Technical experts and learn how to take on your security and business challenges. Our managers contact you about AxxonSoft VMS and PSIM technologies and features, general and specific industry solutions to ask most important questions Our managers contact you about AxxonSoft VMS and PSIM technologies and features, general and specific industry solutions to ask most important questions",
    "Personalized Demo Upcoming Webinars On-demand AxxonSoft Webinars Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Personalized Demo Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Register Artificial Intelligence Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Register Axxon Next VMS Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Register Safe city Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Register Retail Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Register Banking Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Register Transportation Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Register Gambling Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Register Intellect PSIM Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Register Upcoming webinars Axxon Next VMS Why does the rest of the World continue to choose AxxonSoft? Join us to Experience the Next! UK Thursday, October 28, 2021 10AM (GMT+1) Presenter: AxxonSoft Join On-demand AxxonSoft On Air + Intel: Focus on customizable AI analytics with live demo June 17, 2021 AxxonSoft On Air: Build your own VSaaS June 17, 2021 AxxonSoft On Air: Bring value to your business with AxxonSoft June 17, 2021 Load More Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. UK Thursday, October 28, 2021 10AM (GMT+1)",
    "Live webinars Upcoming webinars On-demand AxxonSoft Webinars Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Learn how to create multiple security and business intelligence benefits with AxxonSoft products, AI-powered technologies and industry-specific solutions. Live webinars Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Register Artificial Intelligence Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Register Axxon Next VMS Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Register Safe city Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Register Retail Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Register Banking Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Register Transportation Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Register Gambling Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Register Intellect PSIM Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Register Choose a topic below and schedule a personal session, bring your questions and get comprehensive answers. Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Register Build Your Own VSaaS Introducing the AxxonNet cloud platfrom for building your own Video Surveillance as a Service (VSaaS) solutions integrated with AI-powered AxxonNext on-premise video management software (VMS). Artificial Intelligence Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Register Take a session to discover how to build AI-powered proactive surveillance with neural networks that detect humans/vehicles, fire/smoke, or abnormal behavior/conditions to automatically notify security staff. Axxon Next VMS Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Register Discover the features and benefits of Axxon Next open-platform intelligent video management software: smart search, ANPR/LPR and face search, AI-powered analytics, etc. Safe city Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Register Find out about AxxonSoft's proactive safe city solution, which is trusted by 240+ municipal surveillance projects worldwide and meets the needs of large distributed sites. Retail Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Register Gain insight from shopper behavior analytics and retail data to enhance operational efficiency and customer service. Explore AI-powered retail solutions for single or multiple stores. Banking Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Register Learn about our banking solution for safeguarding your clients and personnel, ATMs, money and assets. The solution enables the construction of distributed security systems and ensures proactive surveillance 24/7. Transportation Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Register Find out more about vehicle license plate and rail car number recognition, intelligent violation detection, transport access handling, and advanced AI-powered video analytics for ensuring smooth operation. Gambling Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Register Experience our comprehensive solution for protecting assets and minimizing cheating and confidence tricks, enabling efficient incident investigation, and preventing fraud or stopping it at the outset. Intellect PSIM Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Register Get to know the Axxon Intellect advanced distributed PSIM software platform, which combines intelligent video analytics, universal IP connectivity and event-driven automation capabilities in a single environment. Upcoming webinars Axxon Next VMS Axxon Next 4.4 Intelligens Videofelügyeleti Szoftver Hungary / Hungarian Tuesday, November 10, 2020 10 AM (CET) Presenter: AxxonSoft JOIN Axxon Next VMS Axxon Case Studies Webinar: VIA University College Europe English Coming soon Presenter: AxxonSoft JOIN Axxon Next VMS Axxon Next 4.4 Intelligens Videofelügyeleti Szoftver Hungary / Hungarian Tuesday, November 10, 2020 10 AM (CET) Presenter: AxxonSoft JOIN Axxon Next 4.4 Intelligens Videofelügyeleti Szoftver Tuesday, November 10, 2020 10 AM (CET) Axxon Next VMS Axxon Case Studies Webinar: VIA University College Europe English Coming soon Presenter: AxxonSoft JOIN Axxon Case Studies Webinar: VIA University College On-demand Subscribe to our newsletter Axxon Next 4.4: Nuevas tecnologías y soluciones September 24, 2020 Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. EMEA September 17, 2020 Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. Americas September 10, 2020 Load more Axxon Next 4.4: Nuevas tecnologías y soluciones September 24, 2020 Axxon Next 4.4: Nuevas tecnologías y soluciones Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. EMEA September 17, 2020 Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. EMEA Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. Americas September 10, 2020 Axxon Next 4.4: Think Intelligence. Think AI. Think Cloud. Americas"
  ]
}