{
  "company": "www.innovatrics.com",
  "dominant_topics": [
    1
  ],
  "topic_counts": {
    "1": 3
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.8181818181818182,
    "framing_market": 0.1818181818181818,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "1": 3
    }
  },
  "sample_docs": [
    "About Us Overview Contact us Awards News Logo program Products Product comparison ExpressID AFIS IDKit PC SDK IDKit Mobile SDK ANSI & ISO PC SDK ANSI & ISO Mobile SDK Fingerprint Scanners FAQ ANSI & ISO PC SDK ANSI & ISO Mobile SDK Support FAQ Overview Login Innovatrics enables biometric passport system for Ghana Innovatrics technology used in QiSQi's biometric Time and Attendance at the 14d regiment of the Belgian Army. Innovatrics at Biometrics 2009 Conference & Exhibition , London 20.-22. October Innovatrics releases major upgrade to ExpressID AFIS fingerprint matching solution Innovatrics ExpressID AFIS SDK now available in our web shop, starting at 950,- EUR. Innovatrics fingerprint technology used in college crackdown on illegal migrants. Innovatrics adds support for Futronic FS 90 Fingerprint scanner in all PC products, which you can buy directly here . Innovatrics adds ILO SID fingerprint template support in all ANSI & ISO SDK products. Innovatrics released the industry's first Royalty-free Fingerprint SDK . Global fingerprint technology leader Innovatrics introduces support for Datastrip DSV handheld biometric terminals , which are designed for mission-critical ID verification programs. Innovatrics introduces one-stop shop where you can purchase everything you need to develop and deploy your fingerprint-enabled software application: Fingerprint SDKs, Runtime licenses and Fingerprint scanners – all at one place. Innovatrics Wins Ernst & Young Entrepreneur of the Year 2008 in Innovations , Slovakia. This awards Innovatrics' technical innovation, market share and international expansion. Innovatrics Receives Coveted Frost and Sullivan 2008 Global Fingerprints Technology of the Year Award Innovatrics joins the DaonAdvantage™ Program . Server-Based Fingerprint Matching for AFIS ExpressID AFIS is a software matching server designed to power Automated Fingerprint Identification Systems (AFIS) for large-scale identification of people. ExpressID AFIS Enterprise contains single server architecture. It can match up to 1.5 million fingerprints per second. more... 950 EUR ExpressID AFIS Government contains parallel server architecture. It can match 1.5 million fingerprints per second on each matching computer. more... 3900 EUR Fingerprint SDK for Standard PC/Laptops IDKit PC SDK is a fast and easy-to-integrate software development kit, which allows you to add One-to-Many (1:N) fingerprint matching into your PC software application. more... FREE ANSI & ISO PC SDK is a fingerprint standards compliant software development kit, which can extract and match One-to-One (1:1) template standards ANSI/INCITS-378, ISO 19794-2 and ILO SID on PC. The accuracy of ANSI & ISO PC SDK has been certified by US Government NIST. more... 490 EUR Fingerprint SDK for Mobile and Embedded Platforms IDKit Mobile SDK is a fast and easy-to-integrate software development kit, which allows you to add One-to-Many (1:N) fingerprint matching into your software for WinCE or Linux mobile devices. more... 900 EUR ANSI & ISO Mobile SDK is a fingerprint standards compliant software development kit, which can extract and match One-to-One (1:1) template standards ANSI/INCITS-378, ISO 19794-2 and ILO SID on WinCE Mobile devices. The accuracy of ANSI & ISO PC SDK has been certified by US Government NIST. more... 1200 EUR You can use any fingerprint scanner with our software products. However, we have selected some high-quality fingerprint scanners , which you can buy directly from us. For feature-by-feature product comparison, please refer to the Product Comparison Table . ^ Top | Print page Copyright . Webdesign by Styleweb , conversion to CMS by etucasa.ca IDKit, ExpressID, Fingera SK and Fingera CZ are trademarks of Innovatrics. The sun always shines on Innovatrics users, spread across all time zones.",
    "About Innovatrics We are an independent, trusted partner for biometric identity management technology . To date, we have successfully completed over 500 projects in 80 countries and over a billion people have been biometrically processed using Innovatrics software. TOP Ranked Technology Innovative approach Proactive customer care Smart Solution Our technology advantages Blazing Performance Industry-leading matching speed. Read more Stunning Accuracy Top accuracy in NIST PFT II. Top ranked in FpVTE & FRVT. Read more Excellent Interoperability Top results in interoperability and accuracy. Read more Multi Platform Ready to run on a complete range of hardware and software platforms. Read more Success stories - where and how we helped Security Sector Police ABIS, Southeast Asia Financial Sector Customer Onboarding, Tatra banka, Slovakia Civil Identification Electoral Tribunal National Identity Issuance, Panama Financial Sector Biometric Vetting, Home Credit Elections Voter Registration, Guinea Civil Identification eID Program, Jordan Financial Sector Secure Banking, Iraq Civil Identification Automated Border Control, Italy View more 15 Years ON the MARKET 1 Billion ENROLLEES 20 industry AWARDS 500 PROJECTS successfully completed 80 COUNTRIES 1.04 billion fingerprint MATCHES per second 99.98 % ACCURACY Our products Innovatrics ABIS Digital Onboarding SmartFace OEM Awards & Certifications See all Meet us at upcoming events MAR 11-12 2020 Connect:ID Washington, DC Arrange a meeting MAR 17-20 2020 ISC West Las Vegas, Nevada Arrange a meeting JUN 2-4 2020 ID4Africa Marrakesh, Morocco Arrange a meeting JUN 9-11 2020 Identity Week London, UK Arrange a meeting See all events Enter your e-mail and we will contact you to arrange a meeting. Latest News Precise Biometrics Partners with Innovatrics to Simplify Facility Access Success stories Combining Precise's identification software for access control systems and Innovatrics' face recognition technology, Precise YOUNiQ was developed to make digital access and access to facilities simpler and safer. Integrating our industry-leading facial recognition and liveness detection with the facility control system, access can be conveniently and securely granted to employees and visitors to offices and... Read more 12/13/2019 11/18/2019 Innovatrics and MoriX Introduce Pioneering Fingerprint On-card Authentication Read more 11/12/2019 Innovatrics DOT Fully Digitizes KYC Process of First-Ever Broker in Europe to Use Face Biometrics Read more 10/30/2019 Innovatrics Sees a Bright Future in Latin America Read more See all news We are an independent, trusted partner for biometric identity management technology . To date, we have successfully completed over 500 projects in 80 countries and over a billion people have been biometrically processed using Innovatrics software. Top accuracy in NIST PFT II. Top ranked in FpVTE & FRVT. Top results in interoperability and accuracy. Ready to run on a complete range of hardware and software platforms. Success stories - where and how we helped Police ABIS, Southeast Asia Customer Onboarding, Tatra banka, Slovakia Electoral Tribunal National Identity Issuance, Panama Biometric Vetting, Home Credit Automated Border Control, Italy Meet us at upcoming events Enter your e-mail and we will contact you to arrange a meeting. Precise Biometrics Partners with Innovatrics to Simplify Facility Access Combining Precise's identification software for access control systems and Innovatrics' face recognition technology, Precise YOUNiQ was developed to make digital access and access to facilities simpler and safer. Integrating our industry-leading facial recognition and liveness detection with the facility control system, access can be conveniently and securely granted to employees and visitors to offices and... Read more Innovatrics and MoriX Introduce Pioneering Fingerprint On-card Authentication Innovatrics DOT Fully Digitizes KYC Process of First-Ever Broker in Europe to Use Face Biometrics Innovatrics Sees a Bright Future in Latin America This site uses cookies to provide services, personalise ads and to analyse traffic. You consent to our cookies if you continue to use our website. More info The on this website are set to \"allow cookies\" to give you the best browsing experience possible. If you continue to use this website without changing your or you click \"Accept\" below then you are consenting to this.",
    "Proven Track Record of Trusted Biometric Projects Governments and businesses need to know their users and customers are who they say they are Our top-rated algorithms are designed to prevent ID fraud. From identifying criminals to checking liveness, our R&D team is a pioneer of the latest trends. You Are In Control The data of your users are always fully under your supervision, control and ownership. Our solutions support most hardware and software configurations. You can rely on our 20 years in the biometric business. After over 600 projects in over 80 countries, we can help you solve many difficult challenges. Delivering biometric solutions for over 20 years Innovatrics' global team of experts offers in-depth industry experience to deliver reliable biometric solutions. Our solutions have been deployed worldwide, addressing a wide range of use cases, from national ID management and voter registration to supporting some of the largest law enforcement agencies. We also provide identity verification for global consumer brands . We understand your challenges and are committed to meeting your needs. Establish accurate, large scale biometric registries for voter registration, ID issuance and other services. Our solutions contain some of the fastest algorithms in the world. Create and search large databases of fingerprints, faces, irises and DNA. Use them to quickly identify people or verify their identity with top-rated biometric algorithms. Prevent ID fraud and deepfakes using our top-rated biometric and liveness algorithms. Our solutions have been designed for fast, convenient user experience. Our biometric algorithms are some of the best in the business Since 2004, we ve consistently ranked among the best in the world based on biometric benchmark evaluations and certifications, including NIST MINEX III, NIST IREX, NIST FRVT, NIST ELFT and others. Innovatrics Results in the NIST ELFT Benchmark Top Spots in Iris Recognition Algorithms Belong to Innovatrics Best results accuracy & interoperability iBeta Presentation Attack Detection Conformance Level 1 & 2 Innovatrics: Top Performer in Every NIST FRVT Category Secure, integrated solutions with no vendor lock-in We are compatible with most technologies. Our customers are never forced to use specific hardware or software for our solutions. Our algorithms are highly efficient and can be ported to any platform and hardware – from smartcards to established OSes. Our solutions are developed with interconnectivity in mind. We provide a robust, well-documented API for easy integration. Our biometric solutions are shaping the world of today Multi‑Tenant Biometric ID Platform Transforms Healthcare in Congo From Entry to Exit: Real-Time Face Recognition Enhances Global Summit Safety Remote Identity Verification Modernizes National Pension Fund Management Multi-Gallery ABIS for Accurate Civil and Criminal Identification in Brazil Biometric Onboarding Breaks Down Barriers to Financial Inclusion for Banco Estado Chile's Clients Remote Identity Verification Opens Access to Thai eGovernment Services Enter the Most Biometric Building in the World The Most Biometric Building The Innovatrics headquarters redefines how buildings recognize, respond, and secure. It is not a prototype. It is fully operational. It is a space where architecture and biometric intelligence coexist quietly, invisibly, and without compromise. Let's get in touch! For Governments Biometric Platform for ID Issuance Biometric Voter Registration Biometric Platform for ID Issuance For Law Enforcement ABIS for Criminal Investigation Border Control ABIS for Criminal Investigation For Businesses Identity Verification Toolkit for Platforms Identity Verifcation for Banks & TelCo Event Security Monitoring Access Control & Building Security Biometrics for OEM Identity Verification Toolkit for Platforms Identity Verifcation for Banks & TelCo Access Control & Building Security Fingera - Time & Attendance Solution Core Biometric Tech Fingerprint Recognition Facial Recognition Iris Recognition Palm Recognition Biometric Identity Verification Face Verification Age Estimation Liveness Detection Deepfake Detection Identity Document Verification Resources Case Studies Resources & Webinars Events Industry Insights Glossary Company About Us Careers Partner Program News Awards Our passion for technology brings biometric benefits to millions of people. Cookie Policy of Use . Solutions Government Biometric Platform for ID Issuance Biometric Voter Registration Law Enforcement ABIS for Criminal Investigation Border Control Businesses Identity Verification Toolkit Identity Verification for Banks and Telcos Identity Verification Service Event Security Monitoring Access Control & Building Security Biometrics for OEM Government Biometric Platform for ID Issuance Biometric Voter Registration Law Enforcement ABIS for Criminal Investigation Border Control Businesses Identity Verification Toolkit Identity Verification for Banks and Telcos Identity Verification Service Event Security Monitoring Access Control & Building Security Biometrics for OEM Technology Core Biometric Technology Fingerprint Technology Face recognition Iris recognition Palm recognition Biometric Identity Verification Face verification Age Estimation Liveness Detection Deepfake Detection Video Injection Detection Identity document verification NFC Verification Core Biometric Technology Fingerprint Technology Face recognition Iris recognition Palm recognition Biometric Identity Verification Face verification Age Estimation Liveness Detection Deepfake Detection Video Injection Detection Identity document verification NFC Verification News References For Developers About Us About Us Technology Resources Careers Press Center Awards Our Partners Industry Insights Biometric Conference Series References For Developers About Us About Us Technology Resources Careers Press Center Awards Our Partners Industry Insights Biometric Conference Series For Developers About Us About Us Technology Resources Careers Press Center Awards Our Partners Industry Insights Biometric Conference Series About Us About Us Technology Resources Careers Press Center Awards Our Partners Industry Insights Biometric Conference Series"
  ]
}