{
  "company": "www.innovative-technology.com",
  "dominant_topics": [
    0,
    1
  ],
  "topic_counts": {
    "0": 16,
    "1": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.4807692307692308,
    "framing_surveillance": 0.0,
    "framing_market": 0.5192307692307693,
    "num_docs": 17
  },
  "topic_timeline": {
    "20": {
      "0": 16,
      "1": 1
    }
  },
  "sample_docs": [
    "OPEN AS USUAL - Read our COVID-19 update 支持 下载 技术公告 常见问题解答 新闻和活动 新闻 活动 ITL 博客 联系我们 ITL 办事处位置 贸易伙伴 2020 24 November 2 October 2 September 2 August 2 July 2 June 1 May 1 April 2 March 5 February 3 January 2 ITL announce non-intrusive spoof detection for facial recognition technology Revolutionising cash payments with CashGenic January 2021 Covid-19 Update Alphonic Technology sign service partnership with ITL in Southeast Asia Spoof: A barrier to the acceptance of Facial Recognition Systems 第 1 頁,共 95 頁",
    "Search by product, support information & more We enable businesses across the world to handle coins and notes more efficiently, improving security and customer experience Age & Identity Verification Anonymous age estimation & automated access control using non-intrusive facial analysis technology Download free currency datasets and product software or access worldwide technical support We've achieved numerous accolades during our history and are trusted by customers worldwide to deliver Through our people, drive and commitment we push boundaries to deliver innovative products and services World leading cash validation, age & identity technology For over 30 years we have been at the forefront of transaction automation. Our innovation-led global technology business is comprised of two divisions: Cash validation equipment and AI-powered age & identity verification technology. Our broad range of affordable, advanced cash validation products intelligently manage transactions, and our age and identity solutions securely verify people to create endless opportunities for industries including retail, gaming, kiosk, vending, amusement and transport. We design and manufacture cash validation equipment such as bill acceptors and recyclers, multi-coin hoppers and provide facial analysis technology for age estimation and identity verification. Solutions to suit a range of industries Technical support by product, view our FAQs, access remote support, technical bulletins and more. Browse our range of frequently asked questions for troubleshooting, information and instant help. We have regional support worldwide, please contact your local team to discuss further.",
    "支持 下载 技术公告 常见问题解答 联系我们 ITL 办事处位置 贸易伙伴 2023 12 December 2 November 3 October 7 Busy month of shows for ITL Key UK technical support personnel celebrates a decade with ITL Innovative Technology (ITL) have announced that Dan Humble, one of their established customer support personnel based at the UK head office, is celebrating 10 years' service with the company this month. Dan currently holds the position of Lead Customer Support Engineer after joining 10 years ago as a support engineer. The cash handling and biometrics solutions provider has been a trusted supplier to several industries including gaming, amusement, kiosk and retail for over 30 years. Commenting on his company milestone, Dan said, \"After joining ITL as a support engineer in 2013, I was given management responsibility five years later when I was promoted to lead customer support, managing a team of engineers. As well as having technical responsibility for UK gaming, I also look after Italy, ensuring our customers in the region receive the highest level of support.\" Congratulating Dan on his long-standing achievement, Andy Bassam, VP of Customer Support said, \"Dan is a fantastic member of our team who works well assisting regional sales managers in supporting key accounts. He has a good rapport with our customers and always makes sure any technical issues are resolved efficiently and professionally. He has outstanding product knowledge, and quickly gathers in-depth technical understanding of new products, particularly our latest biometric assisted age estimation solutions which can help prevent underage gambling. Congratulations to Dan on his 10 years of service with ITL, I look forward to continuing to work with him to further improve our customer technical support service.\" Concluding Dan said, \"ITL is a fantastic place and I feel lucky to work closely with other departments and colleagues on a daily basis. I enjoy problem solving and engaging with customers especially when attending and networking at trade shows. I look forward to the next 10 years working for such a respected and forward-thinking organisation.\" First ITL Trading Partner confirmed to distribute age check solution to UK vaping industry Innovative Technology (ITL) have named the Dyflin Group as the first trading partner responsible for distributing their MyCheckr age estimation device to the UK vaping industry. Innovative Technology is one of the world's leading cash handling and biometrics companies and the first company in the world to receive independent GDPR certification from ACCS (The Age Check Certification Scheme) for their AI-powered age estimation solution – MyCheckr. Founded in 2015, Dyflin Group, based in London, is a business consulting company that offers bespoke advisory services within the vaping sector. Commenting on the partnership, John Vallis, Senior Business Development Manager (Biometrics) for ITL, \"We are excited to work with Dyflin Group who will distribute our age estimation devices –MyCheckr and MyCheckr Mini direct to the rapidly expanding number of vape stores in the UK. Both products are retail-ready, and require no integration so customers can quickly get started with biometric assisted age checks achieving results immediately.\" MyCheckr is a standalone solution equipped with a camera and screen that quickly predicts a customer's age completely anonymously. The device gives staff an extra layer of security when checking age and asking for ID. The screen can also double up as a way for retailers to show targeted digital advertising, saving valuable retail space and creating a potential revenue making opportunity. And for those who don't need a screen, MyCheckr Mini offers the same functionality in a smaller device. Commenting on the partnership, Michiel Carmel, Industry Consultant for the Dyflin Group said, \"Supporting our commitment to the vaping industry and passion for innovation, we are proud to be partnering with Innovative Technology to bring this highly affordable age-check device to the attention of vape retailers. Youth access to vapes is a major concern across many sectors that sell such products and is a big challenge for the industry. Distributing MyCheckr will assist all reputable vape stores and stakeholders as they strive to adhere to the regulations in place to prevent minors accessing vapes. MyCheckr also offers the opportunity to generate income from marketing 3rd party products on the device screen.\" Concluding, John said, \"We are already seeing many success stories from customers including 888 Vapour, Kwik Vape, Irresistible Vapes to name a few. These early adopters are reporting MyCheckr as a useful, low priced tool which is proving effective in deterring young teenagers and children from purchase vaping products. We look forward to working with Dyflin and their customers in the vaping sector to proactively prevent underage sales in retail stores throughout the UK.\" Double celebration for ITL's China office Two long-standing members of Innovative Technology's China office celebrate key milestones with the banknote validation and biometrics solutions provider this month. Sean Wang, Business Development Manager (BDM) based in Shenzhen, celebrates 20 years with the company and is a strategic part of the international sales team. Commenting on his long-standing achievement, Sean said, \"Since joining Innovative Technology's China branch I have seen the company become an established, innovation-led global technology business and a major cash system provider for the China and Taiwan markets. I had the honour of being part of the setup of the China Manufacturing Team in the early 2000s, and I am proud of our growth supporting an increasing number of East Asia countries over the years.\" Sean continued, \"I've been so lucky to work in various roles, visiting different countries and customers to introduce ITL products into many Asian countries. I enjoy embracing new challenges and my next target is to bring the NV4000 multi-bill recycler and SMART Coin System (SCS) bulk coin validator, hopper and recycler, to a high-level market position in East Asia over the next five years.\" Another member of ITL China also celebrates a significant milestone this month. Tony Wang, ITL Support Engineer has been working for ITL's China branch for a decade and is a key member of the technical team. Commenting on his impressive milestone, Tony, said, \"The past 10 years working for ITL have been very rewarding for me, seeing the company go from strength to strength. When I first joined ITL, I was responsible for all technical support and after-sales services in China. As the team grew this allowed me to focus more on the integration and development of new projects, and provide high-level technical support for our expanding product range.\" Tony continued, \"I am very proud to work with an excellent team around the world serving our loyal customers. I enjoy seeing a project through from beginning to end which has developed my skill-set and personal abilities. Helping customers in various fields including self-service, retail, vending and entertainment, integrate our products to progress their business and improve performance is very fulfilling. We are continually upgrading and developing the ITL product range to meet the needs of our customers, and I look forward to being a part of this successful organisation for many years to come.\" Commenting on China's double celebrations, Marcus Tiedt, Sales & Marketing Director said, \"Both Sean and Tony are valued members of the team who have progressed and taken on more responsibility during their time at ITL. They have excellent technical knowledge, give first-class service to customers and partners and are highly valued by all our international sales and support teams. Congratulations to them both on these impressive milestones.\" ITL present latest solutions at German retail events The German branch of Innovative Technology (ITL) plan to showcase their latest retail innovations at two upcoming events – Seamless Europe in Berlin and EHI Technology Days in Bonn. Seamless Europe takes place on 18-19 October at Messe Berlin and the EHI Retail Institute event is planned for 7-8 November at The World Conference Center in Bonn. ITL, leading provider of cash validation and biometrics solutions, provide a range of products ideal for the retail market. Commenting on ITL's involvement, Thorsten Labusch, VP of Sales & Business Development (Retail) said, \"We are excited to take part in these two upcoming events in Germany, both focussing on the technologies that are leading development in the retail sector. We will have solutions from both our cash validation and biometrics divisions available for visitors to demo.\" Innovative Technology have a range of products that are ideal for retailers who are looking to automate cash payments to generate efficiency savings, or implement age estimation technology to assist with the sale of age restricted goods. Thorsten continued, \"One product we are excited to show is the NV4000. This multi-denomination bill recycler, is ideal for retailers who require high-volume mixed bill recycling to speed up consumer transactions and throughput. This unit has a large dispensing capacity of 420 bills which means fewer refills. Using this alongside our Twin SMART Coin System, which is our multi-denomination coin recycler, we can now offer the industry an economical payment solution with the ability to recycle both notes and coins efficiently with reduced human interaction.\" Concluding Thorsten said, \"For retailers selling age restricted goods such as alcohol, tobacco and vapes, MyCheckr age estimation is perfect. This standalone solution equipped with a camera and screen can quickly detect a potential underage customer, completely anonymously. The device gives checkout staff an extra layer of security and prevents any potential confrontation when asking customers for ID. We already have a lot of MyCheckr success stories in convenience and vape stores and we look forward to showing visitors how they can benefit from MyCheckr in their own stores. For anyone with an existing self-checkout, ICU Lite does the same function and can be integrated for automated age checks.\" Innovative Technology will have their latest devices to demo on booth J32 at Seamless Europe and booth 41 at EHI. Association of Convenience Stores (ACS) supplier membership secured for ITL Innovative Technology (ITL) are the latest supplier member to join the Association of Convenience Stores (ACS). ITL are a leading provider of cash validation equipment and biometrics solutions who supply to the retail and convenience sector. ACS is the voice of over 33,500 local shops, supporting their members through lobbying, advice and networking opportunities. Commenting on the membership, Chris Wright, Business Development Manager for ITL's UK retail sector said, \"We are pleased to join ACS at an exciting time of expansion in the retail sector for us. ACS Club Membership offers a great opportunity to build relationships and network with the leading UK convenience store brands to about their requirements and the challenges that local retail shops face.\" ITL were established over 30 years ago and are well known in the industry for their range of solutions designed to validate and secure cash payments. Continuing Chris said, \"Our note validators and recyclers can generate significant cash efficiencies for convenience stores. Moving customers through the sales journey seamlessly, speeding up transaction times and automating float management to ensure fewer cash refills.\" \"As well as our cash solutions we have a range of biometric products that perform age estimation for shops selling age-restricted goods such as alcohol, tobacco and vapes. MyCheckr is a stand-alone device that performs age checks anonymously. It helps retailers adhere to Challenge25, preventing age restricted goods being sold to minors, and gives an extra level of assurance for staff members when asking for ID\" John Vallis, Senior Business Development Manager (Biometrics) for ITL added, \"In addition to MyCheckr being implemented in several convenience stores throughout the UK and Europe, we have also seen considerable interest from the vaping industry who are keen to prevent youth access to vapes. Vapes stores already using MyCheckr are reporting positive results not only as a useful tool for staff, but also as a visible deterrent to underage customers attempting to purchase vapes.\" Concluding Chris said, \"We look forward to presenting our solutions at ACS hosted showcase events and forums, networking with members from key retail organisations and promoting our brand to the convenience sector. \" Next stop for Innovative Technology Americas…. G2E in Las Vegas Innovative Technology Americas, Inc is busy in preparation of G2E 2023 which will take place October 10 th – 12 th at the Venetian Expo in Las Vegas. Global Gaming Expo (G2E) is the world's premier gathering of gaming professionals in North America. Innovative Technology Americas supplies a wide range of bill validators and recyclers to the gaming industry, and will also be exhibiting a suite of AI-powered biometric solutions to prevent underage gambling. Commenting on ITL's involvement, Lauren Fabbri, Business Development Manager said, \"We are excited to be showing once again at G2E! We have had tremendous growth across North America and look forward to sharing our proven line of products. Our booth (#2444)is in a prime position, centered in the expo hall. The NV200, our casino-grade bill validator, continues to make significant gains in several US gaming markets. We have designed multiple solutions for retro-fitting gaming machines in the field. Be sure to come and talk to us, we have units in stock and ready to ship. You have tried the rest, now try the best!\" Lauren continued, \"Our NV4000 multi-denomination bill recycler will be center stage in the booth. This unit has alarge dispensing capacity of 420 bills, so it is ideal for use in redemption kiosks and pay stations for quick and effortless cash pay-outs. With the current US labor shortage being felt across the country, the combined capacity of the replenishment cassette and 4 recyclers means fewer refills, and, ultimately, less need for human interaction.\" Concluding Lauren said, \"We will also be showing our latest AI-powered biometric technology for age estimation. 'MyCheckr' is a standalone solution that can be used to prevent minors from accessing age restricted goods or services. It comes complete with a camera and screen, which can detect a potential underage player – all totally anonymously, with no data being stored. The screen can also be utilized to display age-appropriate or targeted marketing ads, which can create an additional revenue stream.\" \"I, personally, cannot wait to demonstrate our product line to new visitors this year and I look forward to welcoming everyone in Booth #2444. Be sure to stop by and say hello!\"",
    "Support Downloads Technical Bulletins FAQ Support Videos NV200 Spectral TEBS CashGenic NV9 Spectral ICU Remote Support Obsolete Product Notifications Support Videos NV200 Spectral TEBS CashGenic NV9 Spectral ICU About Us What we do Board of Directors Our plans for the future Innovation Awards and accreditations Our History Our plans for the future News & Events News Events Contact Us ITL Office Locations Trading & Service Partners Trading & Service Partners 2023 12 December 2 November 3 October 7 ITL responds to data privacy concerns surrounding the use of biometric technology for age estimation Innovative Technology (ITL), who provide AI-powered biometric solutions using facial analysis technology, have recently taken a number of measures to assure customers that their solutions do not breach any data privacy regulations. Their range, MyCheckr, MyCheckr Mini and ICU Lite, performs age estimation to help prevent the sale of age-restricted goods or access to age registered venues to those who are underage – all completely anonymously with the integrity of customers' data at its core. Dr Andrew O'Brien, Biometrics Product Manager commented, \"Privacy infringements and GDPR compliance rightly attracts much media and industry attention. We hear the concerns of our customers and appreciate how this can be a barrier to the implementation of biometric technology.\" \"Our approach to protecting customer privacy has three-key aspects; we never store any data, all processing is performed locally on the device so we never send data over any network, and finally any data that is processed is automatically deleted afterwards.\" \"This privacy centric approach is reflected in the recent renewal of independent GDPR certification from ACCS (The Age Check Certification Scheme) for our age estimation solutions, ICU Lite and MyCheckr. This key achievement demonstrates UK GDPR compliance, meeting the ACCS 2:2021 Technical Requirements for Data Protection and Privacy, which is approved by the Information Commissioner's Office.\" Andrew continued, \"We have taken legal advice from privacy experts both in the US and Europe regarding compliance. These legal experts have advised that a BIPA (Biometric Information Privacy Act) in the US and DPIA (Data Protection Impact Assessment) in Europe does not apply or is required, meaning our customers can have confidence in using our age estimation technologies in those regions.\" Concluding Andrew said, \"Our age estimation devices continue to be rolled out in a variety of industries including retail, convenience, vaping, gaming and amusement. We believe the measures we have taken will contribute to alleviating any data protection fears and confirms our devices do not store any images or personal data when performing anonymous age estimations. We know that technology is the answer for various industries to protect themselves and help prevent minors from accessing age restricted products or services. We have proactively taken the steps to ensure transparency in our technology and will continue to listen to the market and our customers to provide guidance and reassurance that privacy is assured when using our solutions.\" Innovative Technology Germany showcase AI-powered biometrics at UNITI Expo 24 Innovative Technology (ITL) will be exhibiting at UNITI Expo 2024 in Stuttgart, Germany on 14-16 May. UNITI Expo is the leading European trade fair for the retail petroleum and car wash industries. ITL, a provider of biometric solutions for anonymous age checks and access control, will showcase their latest innovations on booth 1B43. Christian Czeskleba, Senior Business Development Manager for Innovative Technology said, \"We have several products that are ideal for fuel retailers and forecourts who sell age-restricted products like alcohol, tobacco, vapes and lottery tickets.\" ITL's biometrics range, including MyCheckr and MyCheckr Mini and ICU Lite, are being deployed in a number of retail applications across Europe including convenience stores, fuel stations and vape shops. Explaining the solutions available to demo on the booth Christian said, \"We can help retailers perform accurate age checks at the point of sale with no integration required using MyCheckr or MyCheckr Mini to provide an extra level of assurance when asking for ID. Our MyCheckr series is a plug and play solution which does not require an internet connection, so only a power supply is required. Additionally, linking with POS systems and self-service checkouts to automate the age check process is made easy with ICU Lite.\" Concluding Christian said, \"Our solutions can also use anonymous demographical data to produce consumer analytics and display targeted advertising to specific demographics like gender and age. Unlike other solutions on the market, our range boasts a one off cost price with no subscriptions, local processing with no internet required, and no biometric personal data is stored; making our technology affordable, easily available and trusted. Come and see us on booth 1B43 to find out more.\" ITL Spain head to Madrid for the largest gaming exhibition in the Spanish calendar Innovative Technology (ITL) have announced their participation at the largest global network of gaming professionals in Spain. From 7-9 May 2024, Madrid will become the centre of the Spanish gaming industry, celebrating the 40th anniversary of Feria Internacional del Juego (FIJMA). FIJMA is the most important event in the leisure and gaming industry in Spain where the main companies, manufacturers and experts in the industry gather to learn about the latest slots and gaming equipment innovations. The Spanish team at ITL will be exhibiting their solutions on stand A49 and plan to have their latest note recyclers and coin handling products centre stage, as well as demonstrating how their biometrics solutions can be utilised to benefit the gaming industry to prevent underage gambling. Jose Garcia Escudero, General Manager for ITL Spain said, \"We are looking forward to showing how combining our compact note recycler (NV22 Spectral) and advanced coin recycler (SMART Coin System) gives the best fit for cash handling efficiency for gaming machines in Spain. These solutions now dominate the Spanish gaming market giving operators considerable float management savings, fewer refills, and a massive reduction in coin starvation for improved machine uptime. We'll also show the new NV4000 mixed denomination note recycler to the Spanish gaming market for the first time, ideal for high volume applications like change and redemption terminals.\" ITL have a range of AI-powered biometric solutions which perform accurate age verification at gaming venue entrances or integrated in gaming machines. Continuing Jose said, \"We will also have our age check devices on the stand for visitors to demo which can help operators prevent someone potentially underage or even self-excluded trying to play a machine or access an age restricted area. ICU Lite can be fully integrated in a gaming machine or betting terminal to automatically estimate age to prevent minors from playing. MyCheckr can be utilised at 18+ entrances to prevent access. Both devices have a one-off cost with no subscriptions and no internet required. Our technology is affordable, available to all and trusted, with no biometric personal data stored.\" Concluding Jose said, \"We have very strong relationships with the Spanish market and we're proud to know that our products will be displayed on a number of stands from our long standing customers. We're looking forward to seeing everyone in person in Madrid and we welcome you all to stand A49.\" José Garcia promoted to General Manager for Innovative Technology Spain Retail Technology Show London next stop for ITL's cash validation and age verification solutions Innovative Technology (ITL) plan to showcase their latest cash handling and biometrics innovations at the forthcoming UK Retail Technology Show (RTS) on stand6A50. The exhibition takes place on 24-25 April at Olympia, London, bringing together Europe's most forward-thinking retailers and leading tech innovators from the retail and hospitality industry. Commenting on ITL's presence, Chris Wright, UK Business Development Manager said, \"This year the stand will incorporate solutions from both our cash handling and biometrics divisions. We will be demonstrating how both can work seamlessly together in the retail environment.\" Chris continued, \"Using our NV4000 multi-note recycler and SMART Coin System (SCS), we will show retailers how to accelerate customer throughput with fewer refills and automated float management. New for this year we will be showing our Coin Elevator module that minimises the gap between coin entry and exit for improved accessibility, further enhancing the overall customer experience.\" Discussing ITL's biometric range and the benefits for the retail sector, Chris added, \"Our AI powered solutions can be deployed for accurate age checks at the point of sale. MyCheckr and MyCheckr Mini are ideal for anyone selling age restricted goods such as alcohol, vapes or tobacco. A number of retailers are already using these to help staff with Challenge 25, providing an extra level of assurance when asking for ID. Additionally, integration with POS systems and self-service checkouts to automate the age check process is made easy with our simple API.\" \"Retailers can utilise these devices for targeted advertising and consumer analytics, driving growth and increasing revenue by better understanding customer spending habits. Unlike other solutions on the market, our range boasts a one-off device cost with no subscriptions, no internet required, and no biometric personal data stored; making our technology affordable, available and trusted.\" Concluding Chris said, \"Come and see the UK team on the ITL stand 6A50 to about how our technology can help your business generate cost efficiencies and improve customer experience.\"",
    "Support Downloads Technical Bulletins FAQ Support Videos NV200 Spectral TEBS CashGenic NV9 Spectral ICU Remote Support Obsolete Product Notifications Support Videos NV200 Spectral TEBS CashGenic NV9 Spectral ICU About Us What we do Board of Directors Our plans for the future Innovation Awards and accreditations Our History Our plans for the future News & Events News Events Contact Us ITL Office Locations Trading & Service Partners Trading & Service Partners 2023 31 December 2 November 3 October 7 September 5 August 1 July 6 June 3 May 4 ITL secures Primary Authority Partnership with Buckinghamshire and Surrey Trading Standards for age estimation technology Innovative Technology (ITL) have confirmed a Primary Authority Partnership with Buckinghamshire and Surrey Trading Standards with regards to the use of their age estimation technology for retailers selling age restricted goods. ITL's biometric solutions, MyCheckr and MyCheckr Mini are designed to provide anonymous age estimation to assist the till operator in the vital decision-making step when they are required to determine a customer's age. John Vallis, Senior Business Development Manager for ITL's biometrics range said, \"We are delighted to announce that we have secured a Primary Authority Partnership which will support retailers using our age estimation products, in the fight to prevent minors accessing alcohol, tobacco and vapes. This partnership essentially means that consumers can trust that our age estimation technology, if implemented appropriately into an age verification policy, and used in accordance with the guidance, is a compliant visual aid. It can be used to help ensure that the sale of age-restricted goods will not be made to persons under the age of 18. This partnership signifies that customers who choose to implement our age estimation technology, are actively demonstrating compliance, which is notably welcomed by responsible retailers.\" Primary Authority is a statutory scheme, established by the Regulatory Enforcement and Sanctions Act 2008. It allows an eligible business to form a legally recognised partnership with a single local authority in relation to regulatory compliance. This local authority is then known as its 'primary authority'. Joanne Cook, Senior Trading Standards Officer commented, \"This partnership provides ITL with an additional layer of reassurance and confidence for their customers, that their products meet legal requirements, supported by guidance from Buckinghamshire and Surrey Trading Standards. We have checked the evidence of the standards that the technology has been tested to, as well as taking the opportunity to witness the operation of MyCheckr within a retail setting. We are satisfied that it can be used to provide a visual guide to sales staff as to whether customers look age 25 or over and therefore assist retailers to comply with their legal obligations when selling age restricted products. We look forward to continuing our partnership with Innovative to provide any further advice needed in this crucial area of age restricted sales.\" ITL's age check solutions attract big crowds at ICE London EuroCIS Germany next stop for ITL's cash handling and age verification solutions Innovative Technology Ltd (ITL) will be joining retail suppliers and industry professionals at 'EuroShop 2024 – the leading trade fair for retail technology' which takes place in Düsseldorf, Germany from 27th- 29th February. ITL will be showcasing some exciting solutions in Hall 9 booth A21 which are set to transform the retail industry. Thorsten Labusch, VP of Sales & Business Development for ITL said, \"This year the booth will have an even split between our cash handling and biometrics divisions. One of the key focal points will be our self-checkout (SCO) demo which will show our note, coin and biometrics solutions all working together, fully connected and integrated within the POS system. Using our NV4000 multi-note recycler and SMART Coin System (SCS) recycler, the demo will show retailers with high volume transactions how to accelerate customer throughout with fewer refills. Plus with ICU Lite integrated into the self-checkout, age checks are automated for retailers selling age-restricted goods.\" Thorsten continued, \"We are also excited to show the new Coin Elevator in Europe for the first time. This module for the SCS minimises the gap between coin entry and exit, for improved accessibility to enhance the overall customer experience.\" Christian Czeskleba, Senior Business Development Manager for ITL's biometrics range commented, \"We are delighted to show EuroCIS visitors our full AI-powered biometric range for age checks, digital advertisements and consumer analytics. Available at a one-off cost including unlimited age checks as standard, our age verification is affordable for all retailers to help them avoid selling age-restricted goods to minors. ICU Lite can be installed directly into self-checkout terminals for automated age checks and MyCheckr is a stand-alone device designed for manned checkouts to give till operators the confidence to ask for ID when recommended. Our technology also uses facial analysis to provide targeted advertising based on customer demographics like age and gender, provides anonymous customer analytics plus has the ability to use facial recognition too.\" Concluding Thorsten said, \"At ITL we pride ourselves on being innovative, trusted and established in the industry. We welcome both existing and new customers to booth 9A21 to show how we can help retailers elevate their retail space.\""
  ]
}