{
  "company": "www.luxand.com",
  "dominant_topics": [
    1,
    0,
    3,
    -1
  ],
  "topic_counts": {
    "1": 11,
    "0": 2,
    "3": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.5588235294117647,
    "framing_surveillance": 0.4235294117647059,
    "framing_market": 0.0176470588235294,
    "num_docs": 15
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2,
      "1": 11,
      "3": 1
    }
  },
  "sample_docs": [
    "Products Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Technical Specifications Request Evaluation Key Documentation FaceMorpher Web Edition About FaceMorpher WE Ordering Information Online Demo End-User Products Glamourizer Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand Video Essentials Echo FX Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Technical Specifications Request Evaluation Key Documentation FaceMorpher Web Edition About FaceMorpher WE Ordering Information Online Demo End-User Products Glamourizer Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand Video Essentials Echo FX Support Ask a Question Documentation About Luxand About Luxand Our Clients Contacts Detect and recognize faces and facial features Secure touchless login within your applications Perfect face in one click Show your visitors their possible baby 27.11.2009 Luxand Echo FX for Adobe After Effects 23.09.2009 FaceSDK 2.0 Supports Webcam Streaming in Real Time 14.09.2009 Luxand Releases Glamour Image Processor",
    "Face Recognition For Developers Luxand FaceSDK Recognize faces and detect facial features within your .NET, C++, Delphi, and Java apps for Win, Mac, Linux, iOS, Android Luxand FaceCrop SDK Detect and crop faces within your desktop or PHP/ASP.NET Web applications Mirror Reality SDK Develop augmented reality facial filters with MirrorReality SDK for iOS, Android and Windows Our clients For Web and Mobile Avatar API Transform users' faces into 3D animated avatars that can smile, cry, or laugh e-Cards API Create 3D e-Cards, animating faces of your visitors Baby prediction API Predict the future of your users by creating a photo of their potential child Face aging API Let your users discover how their faces might look as they age Zombie API What would your visitors look like if they were zombies? Modern high tech brings the answer! FACE ENHANCEMENT API Enhance your users' photos by reducing imperfections and improving skin tone in one click Technologies DETECT 70 UNIQUE FACIAL FEATURES Create 3D models and avatars on the fly with automatic facial feature detection DETECT AND RECOGNIZE FACES Integrate face detection and face recognition into your applications Mobile Apps youmask Beards Your magic mirror augmenting a virtual beard to your real face youmask Piercing Try all the different types of piercing without drilling holes Age-o-meter Looks at you through the camera and tells your age and gender youmask stars Makes you look like your favorite movie character youmask Applies live filters to your face in real time BabyMaker Funny baby face out of parents' pictures PhotoSmileys Turn your face into an animated smiley with a single tap Face Recognition Memorizes a face and recognizes it further LiveFacialFeatures Detects and displays some 70 facial features in real time For Home Users Mirror Reality Look at a webcam and see yourself transformed on the monitor Luxand BabyMaker Don't wait nine months to see what your baby will look like! Luxand ProphecyMaster No need to wait for 20 years to see what you are going to look like! Luxand Blink!: Face Recognition Login to your PC by simply looking at it Luxand FaceSwapper FaceSwapper makes it easy to cut and paste faces from one picture into another FaceMorpher Create funny face animations. Morph them ALL! Blog 10/15/2019 FaceSDK 7.1 Released Major performance improvements. Halloween Buy-One-Get-One-Free! >> 12/18/2018 FaceSDK 7.0 Released Revamped face detection engine and accelerated Face Matching! >> 06/28/2018 Mirror Reality... Light! Mirror Reality Light just for $199 before July 6, 2018 >> 06/06/2018 FaceSDK 6.5.1 Released Speed of enrollment & accuracy in low lighting increased >> Face Recognition For Developers Luxand FaceSDK Recognize faces and detect facial features within your .NET, C++, Delphi, and Java apps for Win, Mac, Linux, iOS, Android Luxand FaceCrop SDK Detect and crop faces within your desktop or PHP/ASP.NET Web applications Mirror Reality SDK Develop augmented reality facial filters with MirrorReality SDK for iOS, Android and Windows Face Recognition For Developers Face Recognition For Developers Recognize faces and detect facial features within your .NET, C++, Delphi, and Java apps for Win, Mac, Linux, iOS, Android Detect and crop faces within your desktop or PHP/ASP.NET Web applications Develop augmented reality facial filters with MirrorReality SDK for iOS, Android and Windows For Web and Mobile Avatar API Transform users' faces into 3D animated avatars that can smile, cry, or laugh e-Cards API Create 3D e-Cards, animating faces of your visitors Baby prediction API Predict the future of your users by creating a photo of their potential child Face aging API Let your users discover how their faces might look as they age Zombie API What would your visitors look like if they were zombies? Modern high tech brings the answer! FACE ENHANCEMENT API Enhance your users' photos by reducing imperfections and improving skin tone in one click For Web and Mobile For Web and Mobile Transform users' faces into 3D animated avatars that can smile, cry, or laugh Create 3D e-Cards, animating faces of your visitors Predict the future of your users by creating a photo of their potential child Let your users discover how their faces might look as they age What would your visitors look like if they were zombies? Modern high tech brings the answer! Enhance your users' photos by reducing imperfections and improving skin tone in one click Technologies DETECT 70 UNIQUE FACIAL FEATURES Create 3D models and avatars on the fly with automatic facial feature detection DETECT AND RECOGNIZE FACES Integrate face detection and face recognition into your applications Create 3D models and avatars on the fly with automatic facial feature detection Integrate face detection and face recognition into your applications Mobile Apps youmask Beards Your magic mirror augmenting a virtual beard to your real face youmask Piercing Try all the different types of piercing without drilling holes Age-o-meter Looks at you through the camera and tells your age and gender youmask stars Makes you look like your favorite movie character youmask Applies live filters to your face in real time BabyMaker Funny baby face out of parents' pictures PhotoSmileys Turn your face into an animated smiley with a single tap Face Recognition Memorizes a face and recognizes it further LiveFacialFeatures Detects and displays some 70 facial features in real time Your magic mirror augmenting a virtual beard to your real face Try all the different types of piercing without drilling holes Looks at you through the camera and tells your age and gender Makes you look like your favorite movie character Applies live filters to your face in real time Funny baby face out of parents' pictures Turn your face into an animated smiley with a single tap Memorizes a face and recognizes it further Detects and displays some 70 facial features in real time For Home Users Mirror Reality Look at a webcam and see yourself transformed on the monitor Luxand BabyMaker Don't wait nine months to see what your baby will look like! Luxand ProphecyMaster No need to wait for 20 years to see what you are going to look like! Luxand Blink!: Face Recognition Login to your PC by simply looking at it Luxand FaceSwapper FaceSwapper makes it easy to cut and paste faces from one picture into another FaceMorpher Create funny face animations. Morph them ALL! Look at a webcam and see yourself transformed on the monitor Don't wait nine months to see what your baby will look like! No need to wait for 20 years to see what you are going to look like! to your PC by simply looking at it FaceSwapper makes it easy to cut and paste faces from one picture into another Create funny face animations. Morph them ALL! Blog 10/15/2019 FaceSDK 7.1 Released Major performance improvements. Halloween Buy-One-Get-One-Free! >> 12/18/2018 FaceSDK 7.0 Released Revamped face detection engine and accelerated Face Matching! >> 06/28/2018 Mirror Reality... Light! Mirror Reality Light just for $199 before July 6, 2018 >> 06/06/2018 FaceSDK 6.5.1 Released Speed of enrollment & accuracy in low lighting increased >> 10/15/2019 FaceSDK 7.1 Released Major performance improvements. Halloween Buy-One-Get-One-Free! >> Major performance improvements. Halloween Buy-One-Get-One-Free! 12/18/2018 FaceSDK 7.0 Released Revamped face detection engine and accelerated Face Matching! >> Revamped face detection engine and accelerated Face Matching! 06/28/2018 Mirror Reality... Light! Mirror Reality Light just for $199 before July 6, 2018 >> Mirror Reality Light just for $199 before July 6, 2018 06/06/2018 FaceSDK 6.5.1 Released Speed of enrollment & accuracy in low lighting increased >> Speed of enrollment & accuracy in low lighting increased",
    "Products Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Request Evaluation Key Documentation End-User Products Glamourizer Blink! Pro Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand FaceCrop About Luxand FaceCrop Ordering Information Download Request Evaluation Key Documentation Luxand Video Essentials Echo FX Wave FX Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Request Evaluation Key Documentation End-User Products Glamourizer Blink! Pro Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand FaceCrop About Luxand FaceCrop Ordering Information Download Request Evaluation Key Documentation Luxand Video Essentials Echo FX Wave FX Support Ask a Question Documentation About Luxand About Luxand Our Clients Contacts Thank you for your request. Our representative will contact you within 48 hours. Latest News 11.11.2010 Blink! Goes Pro Touchless Windows login – at a glance. The Pro version of Blink! tightens security and makes it easy to share access to Windows accounts. 20.10.2010 Blink! 2.2 Released! Blink! 2.2 Released! Now you can use one installer for both 32- and 64-bit editions of Windows Vista/7. 22.07.2010 Blink! 2.1 Released! Blink! 2.1 Released! Securely to Windows Vista/7, for both the 32- and 64-bit editions! 11.11.2010 Blink! Goes Pro Touchless Windows login – at a glance. The Pro version of Blink! tightens security and makes it easy to share access to Windows accounts. 20.10.2010 Blink! 2.2 Released! Blink! 2.2 Released! Now you can use one installer for both 32- and 64-bit editions of Windows Vista/7. 22.07.2010 Blink! 2.1 Released! Blink! 2.1 Released! Securely to Windows Vista/7, for both the 32- and 64-bit editions! 11.11.2010 Blink! Goes Pro Touchless Windows login – at a glance. The Pro version of Blink! tightens security and makes it easy to share access to Windows accounts. 20.10.2010 Blink! 2.2 Released! Blink! 2.2 Released! Now you can use one installer for both 32- and 64-bit editions of Windows Vista/7. 22.07.2010 Blink! 2.1 Released! Blink! 2.1 Released! Securely to Windows Vista/7, for both the 32- and 64-bit editions!",
    "Products Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Technical Specifications Request Evaluation Key Documentation FaceMorpher Web Edition About FaceMorpher WE Ordering Information Online Demo End-User Products Glamourizer Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand Video Essentials Echo FX Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Technical Specifications Request Evaluation Key Documentation FaceMorpher Web Edition About FaceMorpher WE Ordering Information Online Demo End-User Products Glamourizer Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand Video Essentials Echo FX Support Ask a Question Documentation About Luxand About Luxand Our Clients Contacts Please fill in the following form to contact us. Latest News 27.11.2009 Luxand Echo FX for Adobe After Effects Luxand enables Adobe After Effect users to add a variety of echo FX to their videos in just a few clicks. 23.09.2009 FaceSDK 2.0 Supports Webcam Streaming in Real Time FaceSDK 2.0: long-awaited and highly demanded support for real-time processing of webcam traffic. 14.09.2009 Luxand Releases Glamour Image Processor Glamourizer makes it easy to create perfect glamour portraits out of ordinary snapshots. 27.11.2009 Luxand Echo FX for Adobe After Effects Luxand enables Adobe After Effect users to add a variety of echo FX to their videos in just a few clicks. 23.09.2009 FaceSDK 2.0 Supports Webcam Streaming in Real Time FaceSDK 2.0: long-awaited and highly demanded support for real-time processing of webcam traffic. 14.09.2009 Luxand Releases Glamour Image Processor Glamourizer makes it easy to create perfect glamour portraits out of ordinary snapshots. 27.11.2009 Luxand Echo FX for Adobe After Effects Luxand enables Adobe After Effect users to add a variety of echo FX to their videos in just a few clicks. 23.09.2009 FaceSDK 2.0 Supports Webcam Streaming in Real Time FaceSDK 2.0: long-awaited and highly demanded support for real-time processing of webcam traffic. 14.09.2009 Luxand Releases Glamour Image Processor Glamourizer makes it easy to create perfect glamour portraits out of ordinary snapshots.",
    "Products Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Request Evaluation Key Documentation Augmented Reality Facial Feature Detection End-User Products Glamourizer Blink! Pro Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand FaceCrop About Luxand FaceCrop Ordering Information Download Request Evaluation Key Documentation Luxand Video Essentials Echo FX Wave FX Luxand FaceSDK About Luxand FaceSDK Face Recognition Ordering Information Download Request Evaluation Key Documentation End-User Products Glamourizer Blink! Pro Blink! FaceSwapper BabyMaker ProphecyMaster FaceMorpher Luxand FaceCrop About Luxand FaceCrop Ordering Information Download Request Evaluation Key Documentation Luxand Video Essentials Echo FX Wave FX Support Ask a Question Documentation About Luxand About Luxand Our Clients Development Contacts"
  ]
}