{
  "company": "www.cisco.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 72,
    "-1": 37
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5073313782991202,
    "framing_surveillance": 0.187683284457478,
    "framing_market": 0.3049853372434017,
    "num_docs": 109
  },
  "topic_timeline": {
    "20": {
      "-1": 37,
      "0": 72
    }
  },
  "sample_docs": [
    "ACCESSIBILITY SITE HAS MOVED The content for this page has been moved to another page. Your browser will be automatically redirected to the new page in 20 seconds. If your browser does not redirect, then please click the link below. 1992-2003 Cisco Systems, Inc. . Important Notices , Privacy Statement , and Trademarks of Cisco Systems, Inc.",
    "Cisco IOS and NX-OS Software Physical Security and Building Systems Universal Gateways and Access Servers Video, Cable and Content Delivery Voice and Unified Communications Support Forum and Community Career Certifications and Paths View All Corporate, Industry and Technology News Boost Productivity and Collaboration Smart Business Communications System connects business applications with voice. Boost Productivity and Collaboration Smart Business Communications System connects business applications with voice. Email Evolved: Get More, Pay Less Cisco WebEx Mail offers corporate-grade email on demand, without any compromise. Email Evolved: Get More, Pay Less Cisco WebEx Mail offers corporate-grade email on demand, without any compromise. Bring CyberSecurity Awareness to Students Give kids the skills to navigate the online universe safely. Bring CyberSecurity Awareness to Students Give kids the skills to navigate the online universe safely. Find a Service Provider",
    "Lawful Intercept Description National Laws Define Local Intercept Requirements Additional Lawful Intercept Resources Cisco Internet-Draft on Lawful Intercept Control NOTICE : This information is supplied for Service Provider's research purposes only and is subject to change. The contents of this site do not constitute either legal advice or any representation, warranty or guarantee regarding a Service Provider's ability to comply with applicable Lawful Intercept requirements. Such a determination is the sole responsibility of the Service Provider, and Cisco disclaims any and all liability for the accuracy or completeness of the information contained herein. Lawful Intercept Description The term \"Lawful Intercept\" is used to describe the process by which law enforcement agencies conduct electronic surveillance of circuit and packet-mode communications as authorized by judicial or administrative order. There are various methods and technologies that are used to intercept telecommunications. Therefore, the process used may vary on a case-by-case basis. However, for reasons of cost and expediency, legislation and regulation are increasingly being adopted that require providers of public and private communication services (Service Providers) to design and implement their networks to explicitly support authorized electronic surveillance. National Laws Define Local Intercept Requirements The means and authority of conducting Lawful Intercept is often recorded in government legislation or regulatory mandates. Examples of such a mandates include but are not limited to the Communications Assistance for Law Enforcement Act (CALEA) in the United States; the United Kingdom's Regulation of Investigatory Powers (RIPA) Act 2000 , Section 88 of Germany's Telekommunikationsgesetz , and The Netherlands' Telecommunicatiewet of 1998 . The types of Service Providers who are subject to such Lawful Intercept mandates, as well as the services included, vary greatly from country to country. Therefore, it is strongly recommended that customers consult with legal counsel knowledgeable in the laws and regulations applying to their situation in order to determine their responsibility for complying with Lawful Intercept requirements. Cisco Internet-Drafts: Lawful Intercept Control and Architecture Cisco Internet-Draft document: Lawful Intercept In IP Networks The ' Lawful Intercept Control ' draft that was submitted to the IETF has expired, but can be accessed here. Internet-Drafts are working documents of the Internet Engineering Task Force (IETF) , its areas, and its working groups. Note that other groups may also distribute working documents as Internet- Drafts. Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet- Drafts as reference material or to cite them other than as \"work in progress.\" Comments on these documents may be sent to: li-comment@external.cisco.com Where to Direct Inquiries Contact your Cisco representative for information on future Product features. Please direct general inquiries to li-comment@external.cisco.com . Please include the phrase \" Lawful Intercept Inquiry \" in the SUBJECT field of your message. Additional Resources Government Resources Federal Bureau of Investigation Federal Communication Commission Privacy Advocate Organizations Center for Democracy and Technology (US) Cyber-Rights & Cyber-Liberties (UK) Associazione per la Libertà nella Comunicazione Elettronica Interattiva (IT) Bits of Freedom (NL) Standard Setting Organizations PacketCable [Cable] International Softswitch Consortium Third Generation Partnership Program (3GPP) [Wireless] European Telecommunications Standards Institute - SEC LI [Circuit & Packet] - TC AT [Cable] - Tiphon [VoIP] Telecommunications Industry Association - TR-45 [Circuit & Packet] Committee T1 - T1P1 [Wireless] U.S. CALEA Consultants TeLEA Network Engineering Consultants, Inc. (NECI) Cisco Preferred Mediation Device Equipment Suppliers: AQSACOM ETI Group 2000 Pine Verint Systems SS8 Utimaco Safeware AG Alternative Mediation Device Equipment Suppliers Accuris ATIS, Ltd ( US website , EMEA website ) DigiVox GTEN AG (DE) Nice Teletron Urmet Group Service Bureaus Apogee Subsentio Fiducianet VeriSign NetDiscovery 1992-2005 Cisco Systems, Inc. All rights reserved. Important Notices , Privacy Statement , and Trademarks of Cisco Systems, Inc.",
    "If a 40-56 bit image is not available, contact the Technical Assistance Center before escalating to the Build Team for assistance. End-user name and address information including city and country as appropriate; Specific information about deployment of the software. Note that usage of the software may affect a customer's eligibility to receive it; and Image features such as strength, platform, image name, etc. Specific information about deployment of the software. Note that usage of the software may affect a customer's eligibility to receive it; and Image features such as strength, platform, image name, etc. Image features such as strength, platform, image name, etc. DOWNLOAD TROUBLESHOOTING The most common cause of download errors is user authentication failure. The CCO Software Library uses a DNS registration mechanism for authentication. For DNS registration assistance, review the URLs below, then contact your systems administrator and or ISP for assistance. Cisco cannot register you. Non CCO registered users or those without access to the Cisco Software Library should consult the CCO Software Download Guide . All contents copyright 1992--2007 Cisco Systems, Inc. Important Notices and Privacy Statement .",
    "END-USER SECTOR OTHER LINKS Cisco's Special Export Authority Cisco has obtained authority to deliver Cisco strong encryption solutions to a wide variety of end-users and destinations without having to apply for individual licenses. For information on 40 and 56-bit and strong Retail cryptographic solutions please visit our Encryption Control Guidance home. Cisco Encryption Sales Support Tool provides an intuitive means of quickly identifying the territories and end-users that may receive Cisco strong cryptographic solutions without a US export license. Begin by selecting an end-user sector from the navigation bar on the left. Please read and understand all caveats and conditions that accompany Cisco's special authority. They include such topics as: Stocking, Re-Sale, Re-Export, Document Requirements, Reporting Requirements and vary according to end-use(r) sector. For information on 40 and 56-bit and strong Retail cryptographic solutions please visit our Encryption Control Guidance home. Cisco Encryption Sales Support Tool provides an intuitive means of quickly identifying the territories and end-users that may receive Cisco strong cryptographic solutions without a US export license. Begin by selecting an end-user sector from the navigation bar on the left. Please read and understand all caveats and conditions that accompany Cisco's special authority. They include such topics as: Stocking, Re-Sale, Re-Export, Document Requirements, Reporting Requirements and vary according to end-use(r) sector. Cisco Encryption Sales Support Tool provides an intuitive means of quickly identifying the territories and end-users that may receive Cisco strong cryptographic solutions without a US export license. Begin by selecting an end-user sector from the navigation bar on the left. Please read and understand all caveats and conditions that accompany Cisco's special authority. They include such topics as: Stocking, Re-Sale, Re-Export, Document Requirements, Reporting Requirements and vary according to end-use(r) sector. Please read and understand all caveats and conditions that accompany Cisco's special authority. They include such topics as: Stocking, Re-Sale, Re-Export, Document Requirements, Reporting Requirements and vary according to end-use(r) sector. All contents copyright 1992--1999 Cisco Systems, Inc. Important Notices and Privacy Statement ."
  ]
}