{
  "company": "www.eyenetwatch.com",
  "dominant_topics": [
    -1,
    4,
    1,
    18
  ],
  "topic_counts": {
    "-1": 4,
    "4": 4,
    "1": 1,
    "18": 1
  },
  "topic_descriptions": {
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "18": "evidence, digital evidence, data, case, attorneys"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "1": 1,
      "4": 4,
      "18": 1
    }
  },
  "sample_docs": [
    "Axis 2420 Network Video Camera New from AXIS is the 2420 Network Camera. It's main advantage is the fact that the camera is dual computable i.e. it generates both a standard Composite Video Signal (like a normal CCTV camera) in addition to a Network Digital Signal allowing local connection to a computer network or Internet. The camera also has built-in motion detection in addition to an auto-iris lens drive (optional) allowing it to work in very low light applications.",
    "Axis 2401 Video Server Delivering extremely high quality Motion-JPEG images with a frame rate of up to 30 frames/second, the Axis 2401 presents a breakthrough in CCTV and video surveillance systems. A single box solution for video transmission over any network including local and wide area networks and even over the Internet. Simply connect any video source to the box, attach the video server to a network, assign it a network address and your there. The only viewing software needed is the freely available Netscape Navigator or Microsoft Internet Explorer. Axis' true Web based administration tools allow the user to quickly tailor-design their application; quad image, guard tour, pre-post alarm storage and Pan/Tilt/Zoom control are but a few of the built-in features. We sell a range of proven related products, which share the same protocols. By connecting these products you can enjoy full control of Pan/Tilt/Zoom functions directly from the desktop. Looping Video Inputs Four Alarm Inputs/One Output Up to 30 frames/second frame rate Video Stream - 25 frames/second Milestone Surveillance PRO -Turns the Axis 2400's into a sophisticated digital video surveillance system. JVC TKC421 Camera -CCTV Colour Camera Sony EVI D31 - Comprehensive Internal Pan/Tilt/Zoom Camera Pelco Spectra II - External CCTV Dome with Pan/Tilt/Zoom",
    "Protect your Laptop with Biometric Login Fingerprint scanner and smart card scanner systems which prevent unauthorised access to your laptop or hand held PC are becoming key increase in protection of data and information . Together with our great range of fingerprint software we can now provide the answer to the majority of your network security requirements. Eliminate the need for multiple passwords with BioShield which comes bundled with all our Identix fingerprint scanner systems. Click here for the largest fingerprint scanner range available in the UK - probably! The NEW FP series from Eyenetwatch. Ruggedised, IP65 rated and vandalproof fingerprint scanner. Can be used indoors or outdoors, up to 3000 users and managed via your current IP network.. more details » Biometric technology is the technology of the 21st century, don't get left behind. Fingerprint scanner products are now available with both PCMCIA and USB connections and can be integrated into most flavours of Microsoft windows. Click here for more detail on fingerprint biometric security Penflow Signature Recognition Technology The engine behind WonderNet's entire product line is the Penflow client-server application which allows easy and secure signature authentication process based on three main stages: ...Read More » USB Token Based PC Security, File & Email Encryption - Now MICROSOFT CERTIFIED - Protect your pc at logon & lock a screen saver - Encrypt files and directories - Send encrypted emails - Create encryption security across your organisation Encrypted USB Drives with 256bit encryption Total Data Security from just £16.99! Small, secure and does not cost much more than standard USB drives, the Gizmo! Overdrive secure protects YOUR data. You don't need to worry now if you lose your USB Drive, it is fully secure Encrypted USB Drive » the highest level of biometric access control EyeNetWatch is now able to offer the LG and the new Panasonic ET300 biometric iris recognition access control system. This product has one of the lowest levels of false acceptance of all biometric systems and is exceptionally well suited for very secure server rooms, safety deposit boxes and similar high security locations. The Iris Recognition Access control systems create a new standard of performance for access control security, privileging flexibility and other security applications. Iris recognition technology has the throughput speed and convenience to meet any physical access-based identification need. Click for more on Iris Recognition » EyeNetWatch today announced a link up with Elite Internet, under which Elite Internet will retail the EyeNetwatch security product range. WonderNet Ltd., a leading provider of paper-free signature solutions today announced that Eyenetwatch will be representing its products in the UK. New Microsoft Fingerprint recognition devices now available from Eyenetwatch. New high quality secure USB flash drives added to range. New high quality secure USB flash drives added to range. Standard USB Flash drive range now even larger with the arrival of 26 new products. Price cuts made throughout the USB flash drive range. HardKey EG Pro USB security solution receives MICROSOFT certification EyeNetWatch chosen as supplier of USB Flash Memory and Fingerprint Scanners to Office 365 . Prices reduced on the iGuard fingerprint reader security system. Fully integrates with WebtimeTMS",
    "ThumbDrive Touch - Fingerprint Secure USB Drive As more people rely on computers and the Internet to create and store information, personal security and privacy becomes ever more important. ThumbDrive TOUCH combines fingerprint biometric technologies to offer a single portable sec ure storage medium, offering protection against intrusion. Personal Your personal data should be accessible by you only. With ThumbDrive TOUCH Fingerprint USB Drive, it is now pos sible! Users who have difficulty remembering their passwords can now let their fingers do the remembering. Biometrics The ThumbDrive TOUCH USB Drive brings biometric security to the ThumbDrive family. It includes a fingerprint reader sensor that performs enrolment and verification of the user. Each time the user plugs in the ThumbDrive, a simple but accurate authentication process takes place - by placing the user's finger on the sensor. Once the user is positively identified, the data that is stored on the ThumbDrive becomes accessible. Higher security protection (Fingerprint & password) Easy to install and use Plug and play via USB port Well-integrated design Compact and light Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Easy to install and use Plug and play via USB port Well-integrated design Compact and light Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Plug and play via USB port Well-integrated design Compact and light Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Well-integrated design Compact and light Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Compact and light Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Low power consumption under both active and suspend modes No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development No external power supply required Write protection Supports Windows 98, 2000 and ME Mac - Software under development Write protection Supports Windows 98, 2000 and ME Mac - Software under development Supports Windows 98, 2000 and ME Mac - Software under development Mac - Software under development < 300uA, compliant to USB spec. of < 500uA",
    "eToken PRO combines the simplicity of a USB device, the capabilities of a smart card (without requiring a smart card reader) and a low cost means to implement PKI. Achieve strong authentication and guaranteed non-repudiation for sensitive applications like eBanking, stock trading, eCommerce and financial transactions with this easy-to-deploy device. eToken PRO's secure, on-board RSA 1024-bit key operations enable seamless integration into Public Key Infrastructure (PKI) architectures. eToken can generate and store users' personal credentials, such as private keys, passwords and digital certificates, inside the protected environment of the Smartcard chip itself. Users' private keys never leave the token. Main Features eToken Offers: Both two-factor and two-way authentication Onboard cryptographic processors ITSEC LE4 level security certification Tamper-evident and water-resistant casing eToken PRO works in conjunction with either eToken Enterprise or the eToken SDK , and is the ideal solution for a wide variety of sensitive online business applications, including: Online financial services: authentication and transaction signing for e-banking and stock trading applications. Online government services: citizens' information, vehicle registration, tax returns and healthcare. E-commerce B2B & B2C services: authentication and transaction signing for ecommerce applications. VPN solutions: two-factor authentication. PKI Infrastructure: generating private keys, storing digital certificates and digital signatures Secured email communications; encryption & signing Features Public key (PKI) technology support, with on-board 1024-bit PKI key generation. On-board RSA 1024-bit authentication & digital signing. Highly secure, logical & physical smartcard level security, ITSEC LE4 Certified. Standard Crypto API connectivity. Secure storage & and robust file system. Hardened tamper-evident and water-resistant shell. Multiple color option, security coding and third-party branding facility. Robust plug-and-play connectivity to mainstream PKI and security clients. Standard USB interface. Top of Page Benefits Non-repudiation using advanced PKI digital signing technology: data is signed on the smart card chip inside the eToken, away from the hostile PC environment. On-board PKI generation: private keys are never exposed outside the eToken. No need for special development or integration work: eToken Enterprise supports standard security interfaces and a wide range of security clients. Flexible development tools for seamless integration with third-party applications. Portable USB design: no special reader needed. Two-factor authentication: requires the eToken itself, together with the eToken password. Secure storage of users credentials, keys and sensitive information. Private labeling and color options for brand enhancement. Top of Page Specifications Supported Applications Network Security Clients: Windows 2000 Smartcard network logon, CheckPoint SecuRemote VPN client, RAS Dialup / RADIUS. Solution partner's NT logon, PC security and file encryption support. PKI Solution partners: Baltimore Technologies, Entrust, Microsoft Certificate Servers, GlobalSign, GTE CyberTrust, Thawte, VeriSign, DST, RSA Keon, Celo, Ashley Laurent, PC Guardian, ITEC, eSesix, Conware, Cryptomathic eBusiness Security Clients: Web Browser SSL v3 functionality: Microsoft Internet Explorer public key authentication. Netscape Navigator public key authentication and signing. WAC Authentication. Support for various Solution partners' communication & encryption applications. Email Clients: Microsoft Outlook/Outlook Express & Internet Explorer, Netscape Messenger Product Specifications Operating systems win95, winNT, win98, Me, win 2000 and XP. Certifications & standards PKCS#11 v2.01, CAPI (Microsoft Crypto API), Siemens/Infinion APDU commands PC/SC, X.509v3 certificates, SSLv3, IPSec/IKE PRO Models (by memory size) 16 k & 32k On board security algorithms / processors RSA 1024-bit, DES, 3DES (Triple DES) , SHA1, (MD5 - optional) Smartcard chip security level Smartcard chip security level ITSEC LE4 Smart card security certification (infinion). Speed RSA 1024 Bit signature approx. 1.0 sec RSA 1024 Bit key generation approx.25 sec On board random number generation Random number (RAND) is derived from an internal real hardware random number generator Dimensions 47 x 16 x 8 mm (1.85 x 0.63 x 0.31 inches) ISO specification support Support for ISO 7816 1-4 specifications Weight 5g Power dissipation 120mW Operating temperature 0 C to 70 C (32 F to 158 F) Storage temperature -40 C to 85 C (-40 F to 185 F) Humidity rating 0-100% without condensation Water resistance certification IP X8 - IEC 529 Connector USB type A (Universal Serial Bus) Casing Hard molded plastic, tamper evident Memory data retention At least 10 years Memory cell rewrites At least 100,000 Top of Page Both two-factor and two-way authentication ITSEC LE4 level security certification Tamper-evident and water-resistant casing eToken PRO works in conjunction with either eToken Enterprise or the eToken SDK , and is the ideal solution for a wide variety of sensitive online business applications, including: Online financial services: authentication and transaction signing for e-banking and stock trading applications. Online government services: citizens' information, vehicle registration, tax returns and healthcare. E-commerce B2B & B2C services: authentication and transaction signing for ecommerce applications. VPN solutions: two-factor authentication. PKI Infrastructure: generating private keys, storing digital certificates and digital signatures Secured email communications; encryption & signing Public key (PKI) technology support, with on-board 1024-bit PKI key generation. On-board RSA 1024-bit authentication & digital signing. Highly secure, logical & physical smartcard level security, ITSEC LE4 Certified. Standard Crypto API connectivity. Secure storage & and robust file system. Hardened tamper-evident and water-resistant shell. Multiple color option, security coding and third-party branding facility. Robust plug-and-play connectivity to mainstream PKI and security clients. Non-repudiation using advanced PKI digital signing technology: data is signed on the smart card chip inside the eToken, away from the hostile PC environment. On-board PKI generation: private keys are never exposed outside the eToken. No need for special development or integration work: eToken Enterprise supports standard security interfaces and a wide range of security clients. Flexible development tools for seamless integration with third-party applications. Portable USB design: no special reader needed. Two-factor authentication: requires the eToken itself, together with the eToken password. Secure storage of users credentials, keys and sensitive information. Private labeling and color options for brand enhancement."
  ]
}