{
  "company": "www.sri.com",
  "dominant_topics": [
    3
  ],
  "topic_counts": {
    "3": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "3": 1
    }
  },
  "sample_docs": [
    "An Entrepreneur or VC Looking for a job Capture phrases in quotes for more specific queries (e.g. \"rocket ship\" or \"Fred Lynn\") Inventing a better future | We create world-changing solutions that make people safer, healthier and more productive. Work with us Careers at SRI Inventing a better future | We create world-changing solutions that make people safer, healthier and more productive. Our latest Visit press room Platform SynFiniâ\"¢ An automated synthetic chemistry platform Story December 11 2020 Vision: SRI's next decade Case Study LeoLabs Making the business revolution in low earth orbit sustainable Case Study Kawada Technologies, Inc., Kawada Industries, Inc. Next-generation welding helmet gives unprecedented scope and clarity for better productivity… Press Release October 21 SRI International Debuts \"Emotional AI†Vision Technology to Advance the Driving Experience Story November 13 Trading places: Will robots take over the human workforce? Visit press room Our latest Visit press room An automated synthetic chemistry platform 2020 Vision: SRI's next decade Making the business revolution in low earth orbit sustainable Case Study Kawada Technologies, Inc., Kawada Industries, Inc. Next-generation welding helmet gives unprecedented scope and clarity for better productivity… Press Release October 21 SRI International Debuts \"Emotional AI†Vision Technology to Advance the Driving Experience Trading places: Will robots take over the human workforce? Areas of expertise Artificial intelligence Advanced imaging systems Biomedical R&D services Biomedical sciences Computer vision Cyber & formal methods Education & learning Innovation strategy & design National security Ocean & space Quantum Robotics, sensors & devices Speech & natural language Ventures & licensing Video test & measurement SRI is truly a bridge between academia and industry with past-faced, milestone driven research. If you can imagine, they give you the tools to create. I've had the opportunity to work with and get trained by some of the coolest minds here and my mentors have always been supportive in my career development as an early scientist. Leena Shewade Postdoctoral Fellow, Biosciences A history of firsts From the computer mouse to robotic surgery, cancer treatments, and more, SRI's 70+ years of innovation have created new industries, billions of dollars in market value, and lasting benefits to society. Timeline of Innovation Cyber & formal methods Cyber & formal methods Innovation strategy & de novation strategy & design Robotics, sensors & devices Robotics, sensors & devices Speech & natural language Speech & natural language Video test & measurement Video test & measurement SRI is truly a bridge between academia and industry with past-faced, milestone driven research. If you can imagine, they give you the tools to create. I've had the opportunity to work with and get trained by some of the coolest minds here and my mentors have always been supportive in my career development as an early scientist. A history of firsts From the computer mouse to robotic surgery, cancer treatments, and more, SRI's 70+ years of innovation have created new industries, billions of dollars in market value, and lasting benefits to society. How can we help? How can we help? Make your own mark. Search Jobs Make your own mark. We'll contact you shortly."
  ]
}