{
  "company": "www.sekureid.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 37,
    "-1": 29
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.196078431372549,
    "framing_surveillance": 0.1176470588235294,
    "framing_market": 0.6862745098039216,
    "num_docs": 66
  },
  "topic_timeline": {
    "20": {
      "-1": 29,
      "0": 37
    }
  },
  "sample_docs": [
    "Our solutions provide a platform to securing your facilities and worksites today. Operational costs and security are some of the most important concerns businesses today have. SekureID helps businesses within the industrial industry mitigate losses and fraud through our RFID and biometric identity management solutions. Industrial businesses require a higher level of toughness when it comes to solutions geared at servicing their everyday needs. Our Identity management solutions are made with that in mind. We provide you with solutions made to function within the real world. Having been in business for more than 10 years SekureID has taken the call to resolving common identity management issues plaguing the industrial industry today. Our engineers and developers have put our 10 years of expertise and experience behind each solution we provide. Our solutions can ensure that your company is operating efficiently all the while securing your employees, staff and locations. Authentication Across Various Platforms Increased Productivity and Efficiency Reduction in Fraud and Theft Biometrics and RFID identity management products are necessary to maximize company efficiency and profitability. Why leave your business exposed to outside risks? See why 50,000 companies use our security solutions, click on \"Request Info\" below to learn how we can help keep your business SEKURE. Need More Information? Let one of our specialist show you around Fitness Centers & Clubs Biometric & RFID Hardware Sales & Support (M-F 9am - 7pm EST) 1-888-512-2115",
    "Products The World's Most Advanced Biometric Timelock Solutions Advanced Biometric & RFID Access Control Systems Face Recognition Access Control & Time and Attendance Biometric USB Readers Control Access to PC's and Networks Consulting & Design Biometric & RFID Consulting SekureID has real world experience in biometric and rï¬d product design and development. We can help you bring your biometric or rï¬d solution to life. SekureID has real world experience in biometric and rï¬d product design and development. We can help you bring your biometric or rï¬d solution to life. Support Manuals & Guides Get access to SekureID's biometric & rï¬d products knowledge base, manuals and guides. Softwares & Drivers Download the latest and greatest SekureID biometric authenticationsoftware and drivers for access control, time and attendance, and logical access. Remote Desktop Help to get remote help from a SekureID biometric & rï¬d expert. The SekureID support agent will ask you for the user id and password that will display on your screen. Manuals & Guides Get access to SekureID's biometric & rï¬d products knowledge base, manuals and guides. Softwares & Drivers Download the latest and greatest SekureID biometric authenticationsoftware and drivers for access control, time and attendance, and logical access. to get remote help from a SekureID biometric & rï¬d expert. The SekureID support agent will ask you for the user id and password that will display on your screen. Company About SekureID SekureID® is a leading edge manufacturer of high quality biometric & rï¬d systems, for time & attendance, access control, along with advanced biometric software, and keyless door locks. Contact SekureID Questions regarding SekureID's biometric & rï¬d products, Here you will ï¬nd the respective contact details for SekureID Corp. SekureID® is a leading edge manufacturer of high quality biometric & rï¬d systems, for time & attendance, access control, along with advanced biometric software, and keyless door locks. Questions regarding SekureID's biometric & rï¬d products, Here you will ï¬nd the respective contact details for SekureID Corp. Our Products & Services Stay tuned to SekureID's social networks for the latest updates. .",
    "Make your operations safer and more efficient with our security solutions. SekureID has been providing solutions for law enforcement for just under 10 years. Our solutions use government grade products to ensure reliability and durability. SekureID helps empower law enforcement officials by providing powerful easy to use and implement biometric & RFID verification methods. Through the use of our Biometric & RFID identity management solutions, we aid law enforcement officers in securing and safeguarding their assets. Law enforcement stands to gain the most from implementation of biometric and RFID identity management solutions.The widespread use of automated fingerprint identification systems (AFIS) within most police departments today is but one example of the benefits of implementing Biometric technology. SekureID solutions allow for: Secure Authentication Across Applications Reduction in Fraud and Theft Are you interested in learning more about our solutions? Click on the \"Request Info†link below to speak to one of our consultants today! Need More Information? Let one of our specialist show you around Fitness Centers & Clubs Biometric & RFID Hardware Sales & Support (M-F 9am - 7pm EST) 1-888-512-2115",
    "Shipping and logistics simplified with our security solutions. In a world of terrorist threats, security vulnerabilities can mean lives and goods are at risk. Port security is more vital today than ever before. Identity theft being the fastest growing crime in the western hemisphere, port security is facing a challenge that is magnifying every year. The question is what can be done to combat this trend? The solution, increased identity management and verification through the use of biometric and RFID technologies. SekureID's security solutions are geared at securing your goods and protecting your ports. Our customizable security solutions ensure that your port operations remain incident free. Biometric and RFID verification technologies have been shown to be more reliable than traditional identity verification methods such as passports and travel documents. Our solutions are designed with ease of use and scalability in mind. Improved Passenger Facilitation and Satisfaction Secured Networks and Digital Assets Our ports have a responsibility now more than ever to protect our citizens, are you SEKURE? See why 50,000 companies use our solutions, click on \"Request Info\" below. Need More Information? Let one of our specialist show you around Fitness Centers & Clubs Biometric & RFID Hardware Sales & Support (M-F 9am - 7pm EST) 1-888-512-2115",
    "Increasing security as well as minimizing theft within your stores and operations with our personalized solutions. Ensuring security and minimizing fraud is vital to the success of your business. SekureID is dedicated to providing your retail operations the tools necessary to ensure profitability and increased customer loyalty. Our solutions grant you the power of biometric or RFID identity verification. Our identity management solutions allow for: Authentication Across Various Platforms Increased Productivity and Efficiency Reduction in Fraud and Theft Biometrics and RFID identity management is necessary to maximize efficiency and profitability. Why leave your business exposed to outside risks? See why 50,000 companies use our solutions, click on \"Request Info\" below to see how we can help keep your business SEKURE. Need More Information? Let one of our specialist show you around Fitness Centers & Clubs Biometric & RFID Hardware Sales & Support (M-F 9am - 7pm EST) 1-888-512-2115"
  ]
}