{
  "company": "www.humanrecognitionsystems.com",
  "dominant_topics": [
    3,
    -1,
    1,
    0,
    7
  ],
  "topic_counts": {
    "3": 7,
    "-1": 5,
    "1": 3,
    "0": 3,
    "7": 2
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "7": "ramco, payroll, aviation, en, ramco systems"
  },
  "framing_scores": {
    "framing_ethical": 0.6095238095238096,
    "framing_surveillance": 0.0,
    "framing_market": 0.3904761904761905,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "-1": 5,
      "0": 3,
      "1": 3,
      "3": 7,
      "7": 2
    }
  },
  "sample_docs": [
    "Human Recognition Systems is the leading multi - biometric company in the United Kingdom. Specialising in the application of biometric technology including hand geometry , facial , fingerprint and iris recognition , HRS offers a full range of solutions to automatically identify or authenticate the identity of an individual. Our in-house development team in conjunction with our field engineers provide us with the flexibility and experience to respond to all variety of requirements, including access control , password management , time & attendance and e-Signature solutions, as well as bespoke software developments . HRS Security Access Control HRS Network Password Management HRS TimeManager™ Time And Attendance HRS iriSure™ Biometric e-Signature",
    "Ways to Use MSite FIND OUT ABOUT THE NEW MSITE WORKFORCE APP HERE. There are a lot of different solutions currently in the marketplace, from facial and iris recognition for site entry, to thermal imaging technology to act as a 'detection system' and wearable tech to aid social distancing. We have pulled together a myth-busting blog article about some of these solutions so that you can make an informed decision for your site(s). We set out below the current MSite options that will enable you to continue to benefit from our reliable, safety-enhancing workforce management tools and collect workforce data for the duration of the project. MSite Device with MSite Workforce App MSite Supervisor App MSite Workforce App Features Members of our team are available to support with on-boarding and installation. Please get in touch with our Account Management team on the form below for more information. Covid-19 training for construction site workers We are providing two short online Covid-19 training packages free of charge to our MSite Induction customers. These will enable new site processes to be communicated to workforces to help protect them and reduce the spread of the disease. The training content follows the Construction Leadership Council's latest guidelines: Covid-19 – Stay Safe for Site Management gives an overview of measures to help make sites safer for all; Covid-19 – Stay Safe for Site Operatives will help communicate new site working practices and processes to workforces. The MSite Induction platform can also be used to host your own company or site specific Covid-19 training should you prefer and provides a great way to share standardised content across the entire workforce. If you would like to find out more about MSite Induction, please contact our Account Management Team who will be happy to help. Get our poster You can download a poster that can be displayed around your site as a reminder of the preventative measures that all operatives should be taking to reduce the spread of the virus. Download Poster Contact us and one of our team will get right back to you Disclaimer: Human Recognition Systems needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at any time. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, please review our . Ways to Use MSite FIND OUT ABOUT THE NEW MSITE WORKFORCE APP HERE. There are a lot of different solutions currently in the marketplace, from facial and iris recognition for site entry, to thermal imaging technology to act as a 'detection system' and wearable tech to aid social distancing. We have pulled together a myth-busting blog article about some of these solutions so that you can make an informed decision for your site(s). We set out below the current MSite options that will enable you to continue to benefit from our reliable, safety-enhancing workforce management tools and collect workforce data for the duration of the project. MSite Device with MSite Workforce App MSite Workforce App Features Members of our team are available to support with on-boarding and installation. Please get in touch with our Account Management team on the form below for more information. Covid-19 training for construction site workers We are providing two short online Covid-19 training packages free of charge to our MSite Induction customers. These will enable new site processes to be communicated to workforces to help protect them and reduce the spread of the disease. The training content follows the Construction Leadership Council's latest guidelines: Covid-19 – Stay Safe for Site Management gives an overview of measures to help make sites safer for all; Covid-19 – Stay Safe for Site Operatives will help communicate new site working practices and processes to workforces. The MSite Induction platform can also be used to host your own company or site specific Covid-19 training should you prefer and provides a great way to share standardised content across the entire workforce. If you would like to find out more about MSite Induction, please contact our Account Management Team who will be happy to help. You can download a poster that can be displayed around your site as a reminder of the preventative measures that all operatives should be taking to reduce the spread of the virus. Contact us and one of our team will get right back to you Disclaimer: Human Recognition Systems needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at any time. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, please review our .",
    "Aviation By Simon Meyer By Simon Meyer By Simon Meyer By Simon Meyer By Simon Meyer By Neil Norman By Simon Meyer By Simon Meyer By Simon Meyer Construction By Nick Wilkinson By Nick Wilkinson By Neil Norman By Stephanie Fisher By Stephanie Fisher Workforce Management By Jonathan Davies Get our brochure",
    "We digitise the identity of people for the safety and efficiency of your business. Based in the Bunker Building in Liverpool, UK, we deliver technology which automates and digitises the identity of people in some of the world's most demanding and highly regulated workplaces. Contact us Founded in 2001, we are known for a history of innovative firsts , including being the UK's first multi-biometric technology company. 2015 First company in the world to revolutionise the airport ID pass application process with an online system. Airports can replace lengthy pass application processes with MTrust , which enables the management of employee information and pass applications online. 2011 World first deployment of facial recognition to measure the passenger journey in an airport. In 2011, Gatwick Airport went live with MFlow to measure the passenger journey through the terminal using facial recognition. 2011 First deployment of iris-at-distance technology to enrol and identify passengers in a UK airport. In June 2011, Gatwick Airport went live with MFlow to enrol and identify passengers using iris-at-distance technology to automate common departure lounge access and domestic boarding. The technology had previously not been used in the public domain in the UK or integrated with automatic gates anywhere in the world. 2010 First to integrate CSCS smart cards for site access. We abled these cards to be used to get through site access points, using MSite . 2008 First to integrate iris recognition with Desfire smartcards Enabling super secure multi-modal template-on-card access control for the London 2012 Olympic Park. 2007 First to deploy biometrics for dispensing medication to the UK's prison population. Working with the Department of Health, we deployed iris and fingerprint recognition at healthcare facilities within 65 UK prisons. 2003 First to deploy biometrics at a UK airport. We deployed biometric access systems for 19,000 airport workers in all 3 of Manchester Airport's terminals. 2002 First UK company to import and deploy hand geometry recognition technology. Long before today's export channels were established, we were importing this new and exciting technology directly from around the world to bring the benefits to our UK customers. 2001 UK's first multi-biometric technology company. In 2001, Neil Norman gave up his role at Accenture to follow his dreams and start a biometric technology business. Key people Ian Taylor Chairman Neil Norman CEO and Founder Robert Brent COO and CFO Simon Meyer Managing Director, MFlow / MOne Our 'M' product portfolio The leading workforce management system for construction sites. Keeping sites open and workers safe. More info MSite The leading workforce management system More info MFlow The most accurate way to understand people on the move More info MOne Enabling trusted and completely digitised travel experiences More info MTrust The most efficient way to manage your airport security pass applications More info Momentum is our Research & Development area of the business, ensuring our products exceed the latest trends in biometric and digital identity technology. Events We regularly host events designed to bring together businesses, developers and technologists to that explore new ideas and concepts. Join Us We are looking for talented and ambitious people to join our innovative technology business. All employees have the opportunity to shape the future of digital identity management and biometrics in a culture of constant learning and personal development. Careers Get our brochure We digitise the identity of people for the safety and efficiency of your business. Based in the Bunker Building in Liverpool, UK, we deliver technology which automates and digitises the identity of people in some of the world's most demanding and highly regulated workplaces. Founded in 2001, we are known for a history of innovative firsts , including being the UK's first multi-biometric technology company. First company in the world to revolutionise the airport ID pass application process with an online system. Airports can replace lengthy pass application processes with MTrust , which enables the management of employee information and pass applications online. World first deployment of facial recognition to measure the passenger journey in an airport. In 2011, Gatwick Airport went live with MFlow to measure the passenger journey through the terminal using facial recognition. First deployment of iris-at-distance technology to enrol and identify passengers in a UK airport. In June 2011, Gatwick Airport went live with MFlow to enrol and identify passengers using iris-at-distance technology to automate common departure lounge access and domestic boarding. The technology had previously not been used in the public domain in the UK or integrated with automatic gates anywhere in the world. First to integrate CSCS smart cards for site access. We abled these cards to be used to get through site access points, using MSite . First to integrate iris recognition with Desfire smartcards Enabling super secure multi-modal template-on-card access control for the London 2012 Olympic Park. First to deploy biometrics for dispensing medication to the UK's prison population. Working with the Department of Health, we deployed iris and fingerprint recognition at healthcare facilities within 65 UK prisons. First to deploy biometrics at a UK airport. We deployed biometric access systems for 19,000 airport workers in all 3 of Manchester Airport's terminals. First UK company to import and deploy hand geometry recognition technology. Long before today's export channels were established, we were importing this new and exciting technology directly from around the world to bring the benefits to our UK customers. UK's first multi-biometric technology company. In 2001, Neil Norman gave up his role at Accenture to follow his dreams and start a biometric technology business. Managing Director, MFlow / MOne Our 'M' product portfolio The leading workforce management system for construction sites. Keeping sites open and workers safe. The leading workforce management system The most accurate way to understand people on the move Enabling trusted and completely digitised travel experiences The most efficient way to manage your airport security pass applications Momentum is our Research & Development area of the business, ensuring our products exceed the latest trends in biometric and digital identity technology. We regularly host events designed to bring together businesses, developers and technologists to that explore new ideas and concepts. We are looking for talented and ambitious people to join our innovative technology business. All employees have the opportunity to shape the future of digital identity management and biometrics in a culture of constant learning and personal development.",
    "Get a demo or quote For further information about MTrust, complete your details and our team will get back to you. By submitting this form, you agree to be contacted by Human Recognition Systems about the products that we think may be of interest to you. You can opt out at any time. An ID pass application vetting and issuance solution for airport workers. MTrust is a pass application management, vetting and issuance solution, hosted in a secure online environment. The system provides absolute certainty of employee identity and streamlines overall airport ID centre performance. Software Security identification pass application and vetting software Automated identification passes for people, vehicles and permits Standardised community solution across airport(s) to enforce policy Central, secure document storage, full audit and reporting Integration into third party systems What can MTrust do for your business? Reduces cost Reduces the time it takes to submit and vet applications and reduces the cost per application. Enhances security Every stage of the application process is validated and logged for increased security, vetting and auditing. The platform centrally stores identification documents and has full audit and reporting capability. Improves efficiency Reduces rejections rates significantly and speeds up turnaround time for all. Where a temporary worker pass is required, MTrust can provide an instant issuance of this, so no visit to the airport pass office needed. 1 Product features Pass applications All applications for people, drivers and vehicles are submitted, vetted and approved online. Identification details and supporting documentation are captured and verified in one place. The platform provides visibility for both the airport, and employers of those who require a pass to work in the airport (authorised signatories). Each party can ensure that pass applications are approved and issued as efficiently as possible. For temporary passes, both people and vehicle, MTrust provides self-service printing, reducing pass office queues and avoiding any delays in the person starting work. 2 Product features Reporting and compliance By onboarding employees and workers online, MTrust provides a central, secure document storage and reporting capability. Every stage of the worker vetting and application process is logged and can be tracked for compliance and auditing purposes. Visibility and notifications will also keep the process moving. 3 Product features One community Airport groups can also enforce companywide policies and procedures in how pass applications are processed and approved. Once a worker has their pass approved at group-level, they can then start employment in any airport within the group, avoiding duplication and delay. MTrust can also be integrated into your security access control. Plus more... Paperless system All live and historical applications are instantly accessible and searchable, meaning no more archiving and instant access to applications when the worker arrives at the ID Centre. Enhanced communication MTrust allows the ID Centre to broadcast messages to the wider airport community. Ideal for announcing policy updates or regulatory changes. Performance management MTrust is built around ID Centre performance. A dashboard ensures workload is managed, and turnaround times for each pass and agent are logged for reporting purposes. In an ever-growing airport, we are always looking for ways to improve self-service automation for passengers and airport staff. The new system will enable us to issue airport ID passes faster, whilst taking the frustrations away from our on-airport customers and providing more time for important security checks which will reduce risk. How does MTrust work once an airport chooses this online platform? Companies apply to join MTrust Companies apply to the airport to add their company to their ID Scheme. All supporting documents are provided and verified by the airport's ID Centre. Authorised signatories appointed Once approved by the airport, authorised signatories can begin to build profiles for their employees. Pass applications are submitted Applications are automatically built from the chosen applicant's profile and submitted to the airport if they meet the minimum requirements. Pass applications are received Team leads choose to either assign applications automatically to agents or manage their distribution themselves. Pass applications are queried ID Centre agents can query parts of the application they need more information on and the authorised signatory is instantly informed and able to clarify. References are verified ID Centre agents vet references provided with the application and log the results on the system. Applications that require references cannot be approved until the minimum reference requirements are met. Pass applications are approved The authorised signatory is instantly notified and the applicant is ready to collect their pass. If the pass type has been set up to support remote issuance, the pass can be printed immediately and taken to an airport checkpoint to be validated for access, without having to visit the ID Centre. Applicant data is stored for next time All data used in the application is stored against the applicant's profile, making their next application to any participating airport easier than ever. Get our brochure An ID pass application vetting and issuance solution for airport workers. MTrust is a pass application management, vetting and issuance solution, hosted in a secure online environment. The system provides absolute certainty of employee identity and streamlines overall airport ID centre performance. Security identification pass application and vetting software Automated identification passes for people, vehicles and permits Standardised community solution across airport(s) to enforce policy Central, secure document storage, full audit and reporting Integration into third party systems What can MTrust do for your business? Reduces the time it takes to submit and vet applications and reduces the cost per application. Every stage of the application process is validated and logged for increased security, vetting and auditing. The platform centrally stores identification documents and has full audit and reporting capability. Reduces rejections rates significantly and speeds up turnaround time for all. Where a temporary worker pass is required, MTrust can provide an instant issuance of this, so no visit to the airport pass office needed. All applications for people, drivers and vehicles are submitted, vetted and approved online. Identification details and supporting documentation are captured and verified in one place. The platform provides visibility for both the airport, and employers of those who require a pass to work in the airport (authorised signatories). Each party can ensure that pass applications are approved and issued as efficiently as possible. For temporary passes, both people and vehicle, MTrust provides self-service printing, reducing pass office queues and avoiding any delays in the person starting work. By onboarding employees and workers online, MTrust provides a central, secure document storage and reporting capability. Every stage of the worker vetting and application process is logged and can be tracked for compliance and auditing purposes. Visibility and notifications will also keep the process moving. Airport groups can also enforce companywide policies and procedures in how pass applications are processed and approved. Once a worker has their pass approved at group-level, they can then start employment in any airport within the group, avoiding duplication and delay. MTrust can also be integrated into your security access control. All live and historical applications are instantly accessible and searchable, meaning no more archiving and instant access to applications when the worker arrives at the ID Centre. MTrust allows the ID Centre to broadcast messages to the wider airport community. Ideal for announcing policy updates or regulatory changes. MTrust is built around ID Centre performance. A dashboard ensures workload is managed, and turnaround times for each pass and agent are logged for reporting purposes. How does MTrust work once an airport chooses this online platform? Companies apply to join MTrust Companies apply to the airport to add their company to their ID Scheme. All supporting documents are provided and verified by the airport's ID Centre. Once approved by the airport, authorised signatories can begin to build profiles for their employees. Pass applications are submitted Applications are automatically built from the chosen applicant's profile and submitted to the airport if they meet the minimum requirements. Pass applications are received Team leads choose to either assign applications automatically to agents or manage their distribution themselves. Pass applications are queried ID Centre agents can query parts of the application they need more information on and the authorised signatory is instantly informed and able to clarify. ID Centre agents vet references provided with the application and log the results on the system. Applications that require references cannot be approved until the minimum reference requirements are met. Pass applications are approved The authorised signatory is instantly notified and the applicant is ready to collect their pass. If the pass type has been set up to support remote issuance, the pass can be printed immediately and taken to an airport checkpoint to be validated for access, without having to visit the ID Centre. Applicant data is stored for next time All data used in the application is stored against the applicant's profile, making their next application to any participating airport easier than ever."
  ]
}