{
  "company": "www.vivekanand-biometric.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 8
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 8
    }
  },
  "sample_docs": [
    "Products BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal Techmax Solution provides Android Based Biometric Time Attendance System for offices, schools, collages and other institutes. This Biometric Device used to make attendance with GPS Location and Send that attendance to \"BIODROID APP\" installed on customer's Android Phone. BIODROID - Biometric Time Attendance System Introduced By TechMax Solution at Surat (Gujarat-India). *Device Design & Specifications is Subject to Change without Prior Notice. Features of Biometric Device: - Fully Standalone Device (No Need Of Any Computer or Software) - 512 MB RAM – 4 GB Memory. - STQC Certified Sensor. - On Device Reporting. - 7 Inch Touch Screen. - English / Hindi Voice Prompt. - Both Mounting (Table Top + Wall Mount) - Excel Report Generated Direct In Machine No Need Of Computer. - Fastest Fingerprint Matching. Why Vivekanand Biometric is Better Than All Other Devices ? - This Device is fully standalone so you don't need to install any kind of software in computer. So there is no problems like provide team viewer to vendor, reinstall software because of virus in computer, Operating System compatibility, format computer. - This Device is very user friendly like android application so you don't need highly educated people to operate this. - Because of Standalone Device you need less support and time for installation. - Quick and Hassle Free installation than all other devices. Device Specifications as Below: Hardware Specification S.No Component Specification Compliance (Yes/No) 1 Biometric Sensor and Extractor All the parameters of Biometric Devices for Authentication should be as per latest STQC scheme for certification of UIDAI biometric Devices (Authentication). STQC certified sensor and extractor only. Yes (STQC Certified) 2 Processor 32- bit, ARM-9/x86 equivalent of higher, 400 MHz of higher frequency Yes 3 Memory RAM 128 of higher, FLASH 256 MB or higher Yes Memory capacity to store fingerprints >0 3000 Memory capacity to store transaction logs >=100000 Memory capacity to store device operation logs>=100000 4 Add on Memory Micro SD Slot minimum 4 GB or more Yes 5 Keypad Minimum 16 key alpha numeric keypad with navigation Yes keys, key size to be large enough for navigation, or on screen key pad of Qwerty keypad. 6 OS/ Software Following OS with GUI Support, JVM or equivalent support Yes (Android) & SDK for 3rd party application development i. Linux 2.6 or higher ii. Windows iii. Android iv. Any other equivalent OS 7 Ports USB 2.0 or higher -1 or more nose, RJ 45 (Ethernet)/ wifi Yes 8 Language Support Unicode support for all Indian language including English Yes 9 Status indications Multi colour LED's / LCD (to indicate network connection, Yes signal strength to indicate battery charge remaining etc) or on screen display to all indicator like battery charger network strength etc. 10 Other indicators Audio/ visual capability, A/V indication either at device Yes level or at application level for Indication various events like a) Indicating for placing finger b) Start of capturing c) End or capturing 11 Connectivity Two channels or connectivity are mandatory for devices, Yes first connectivity as GPRS is mandatory. Second connectivity can be through wifi b/g/n/ fixed broadband e.g. GPRS + broadband, GPRS + wifi etc 12 Non – volatile storage Must be capable of storing audit trails of at least 1000 transactions Yes 13 Display Minimum 3.5†screen or higher, with at least 262k colors TFT Yes 14 Battery backup Minimum 4 hours battery backup Yes 15 Antenna Internal, External / Extended External Antenna Yes 16 Power adaptor AC/ DC adaptor with surge protection, input 100 -264v AC, 50Hz Yes 17 Environment Storage not including battery 0'C to 55' c Yes Operating temp 0' C to 50 'C 18 Humidity 10-90 % RH Non-condensing Yes 19 Speaker A facility should be provided for voice confirmation of the transaction, 1W or more Yes 20 Other Accessories Durable carry case, multilingual user manual (English, Hindi) screwdriver, damper a white cloth (45 cm * 45 CM) Ok 21 Other features External accessible slots for SIM and SD Cards Yes 22 Support Complete cover support with breakage replacement for a period of three years. Ok 23 Security 2048 –bit, PKI 256 – bit AES, Base 64, SHA- 256 (optional) Ok 24 GPS Industry standard 16 channel NMEA compliant GPS Support Yes 25 Environment health and safety RoHS certification (optional) Ok 26 EMC compliance FCC class A or equivalent (optional) Ok 27 Ingress Protection (IP) Compliance Dust resistant, Water resistance (optional) Ok Client Application Specification S.No Component Specification Compliance (Yes/No) 1 NFIQ Quality Software Inbuilt NFIQ quality software either at device level or extractor level to check the quality of fingerprint during enrolment Yes 2 Enrolment client Enrolment client application shall have the following functionalities Yes · Enrolment of 10 fingerprints with identifier (Unique registration number) · Verification of NFIQ before accepting fingerprint for enrolment · De-duplication of fingerprint during enrolment for single candidate 3 Authentication on client Authentication client application shall have following functionalities. Yes · Authentication of fingerprint based on 1: n logic among the local storage of fingerprint templates · Attendance transaction logs to be stored internally · Voice enablement of authentication output in English and Hindi 4 Integration Biometric fingerprint enrollment and authentication client application should be integrated with office server application and should be able to upload / download through SSL / https connection dully suiting the API / web services provided by office Yes 5 Remote update of software Device must support version control feature in order to remotely monitor and provision application and system software, remote device management. Feature must be provisioned as a part of the device deployment Yes 6 Reports The following reports should be generated at the device level 1. Daily attendance report (batch wise and training center wise) 2. Batch wise attendance report 3. Student Wise attendance report 4. Trainers wise attendance report 5. Enrolment reports (displaying date of enrolment, number of fingerprint, etc) 6. Consolidated training centre attendance report More reports may be added in the future. Yes 7 Additional features • Device operation logs should be captured and stored internally. Device operations like, switch on & off, enrollment of finger print & user, change of settings, etc, shall be logged. • Date and time in the biometric device should be either of the GPRS connection or server timings. No option to change the data and time should be available in the biometric device. • Deletion of individual record (enrolment, attendance transaction logs, device operation logs should be disabled Yes 8 Output file format Biometric data to be transferred to central server should be in XML format Yes",
    "Products BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal Techmax Solution provides Biometric Time Attendance System for PMKVY Project Pradhan Mantri Kaushal Vikas Yojna. This Biometric Device used to make attendance and send to pmkvy (http://www.pmkvyofficial.org/) portal. Vivekanand Biometric Time Attendance System For PMKVY Introduced By TechMax Solution at Surat (Gujarat-India). *Device Design & Specifications is Subject to Change without Prior Notice. Features of Biometric Device: - Fully Standalone Device (No Need Of Any Computer or Software) - Complete Match With All AEBAS Norms. - Online With PMKVY Portal. - 512 MB RAM – 4 GB Memory. - STQC Certified Sensor. - 7 Inch Touch Screen. - Both Mounting (Table Top + Wall Mount) - Fastest Fingerprint Matching. Why Vivekanand Biometric is Better Than All Other Devices ? - This Device is fully standalone so you don't need to install any kind of software in computer. So there is no problems like provide team viewer to vendor, reinstall software because of virus in computer, Operating System compatibility, format computer. - Because of Standalone Device you don't depend on computer to send attendance to PMKVY Portal. - This Device is very user friendly like android application so you don't need highly educated people to operate this. - Because of Standalone Device you need less support and time for installation. - Quick and Hassle Free installation than all other devices. WHAT IS PMKVY? Approved for another four years (2016-2020) to benefit 10 million youth Allocated Budget 12,000 Crores Pradhan Mantri Kaushal Vikas Yojana (PMKVY) is the flagship scheme of the Ministry of Skill Development & Entrepreneurship (MSDE). The objective of this Skill Certification Scheme is to enable a large number of Indian youth to take up industry-relevant skill training that will help them in securing a better livelihood. Individuals with prior learning experience or skills will also be assessed and certified under Recognition of Prior Learning (RPL). Device Specifications as Below: Hardware Specification S.No Item Specifications 1 Integrated Attendance Device Type 1 - Integrated Android Tablet and Single Fingerprint Scanner Device Housed in Rugged Casing • Specifications of Android Tablet same as those given for Item No. 3 • Specifications for Single Fingerprint Scanner Device same as those given for Item No. 4 (STQC Certificate for the integrated bio-metric device must be submitted) • Android Tablet and Single Fingerprint Scanner should be integrated in a rugged casing. The Rugged Casing should comply with the following: • The casing should be made of inflexible, solid material and can be of polycarbonate / thick plastic / acrylic / other tough material. • It should be of black color and should have a glossy / matte finish • Acrylic casings must have a thickness of at least 5 mm. • Casing should be durable and should be able to withstand rough daily operational usage. • The casing should not suffer any damage or disfiguration on being dropped from a height of up to 2 meters • Tablet should be vertically oriented in the casing. This is important because the attendance application to be deployed is designed to run in vertical mode only. • The casing should be designed to cover/hide the android task bar of the tablet. This is required to prevent misuse of any other functionality of the tablet. • The casing should have provision to access the power/reset button of the tablet. The access should be easy but controlled. The vendor thus should make arrangements to provide an external tool to perform the power on/off and/or reset function of the tablet through the casing. • The fingerprint scanner should be ergonomically placed to support ease of usage for biometric attendance in standing posture of the users. 2 Integrated Attendance Device Type 2 - Integrated Attendance Device Manufactured as a Single Unit An integrated device for recoding biometric attendance with STQC certified fingerprint sensor meeting following configurations requirements • Display – At least 4 inch display with a minimum of 800x480 pixel resolution, 16 M Colors • Processor- 1.0 GHz or above • RAM- 512 MB or above • Hard Key / Soft Key Numeric key pad • Internal Storage- 4GB or above • Expandable storage through micro SD, minimum 8 GB • USB Port- Minimum one available USB host port to support application loading / configurations / full functional keyboard • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Internal Speakers • GSM SIM card slot • Inbuilt replaceable battery with min. battery backup of up to 120 minutes • Charging / operation on AC 100 -240 volt range with inbuilt surge protection Biometric sensor/extractor • STQC certified fingerprint sensor/extractor for Aadhaar authentication (STQC Certificate for the integrated bio-metric device must be submitted) • SDK for fingerprint device • The fingerprint scanner should be ergonomically placed to support ease of usage for biometric attendance in standing posture of the users Connectivity Requirements • Mandatory Edge / 3G mobile data support • Wi-Fi IEEE 802.11b/g/n OR LAN (Ethernet) interface OR Both • Strength, safety and operating environment • Should be able to withstand 1 m drop test • Operating temp: 0°C to 50°C • Storage not including battery: 0°C to 55°C • CE certification/ RoHS certification • SAR values within acceptable range Operating system / software requirements • Android 4.0 Operating System or above • Sample application to test fingerprint sensor/extractor • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 3 Android Tablet with 7 inch screen • Processor- 1.0 GHz or above • RAM- 512 MB or above Internal Storage- 4GB or above • Expandable storage through micro SD, minimum 8 GB • USB Port- Minimum one Micro USB port and an optional additional USB Port • USB port should provide power supply to biometric device and support USB OTG. • Front facing Camera with VGA resolution • Internal Speakers • 7''Capacitive touch screen and minimum 800x480 pixel resolution or above, 16 M Colors • GSM SIM card slot • Min. Battery backup up to 120 minutes • SAR values within acceptable range • Separate charging non-usb port with AC adapter 200-240 volt range • Micro USB host cable • Connectivity Requirements • Mandatory Edge / 3G mobile data support • Wi-Fi IEEE 802.11b/g/n OR LAN (Ethernet) interface OR Both • Software Requirements • Android 4.0 Operating System or Above • Safety and other standards compliance – CE certification/ RoHS certification • Full featured Web Browser • Application to be deployed on android tablet will require rooted Android OS • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI attendance applications. 4 Single Fingerprint Scanner Device for use with Android Tablet • STQC certified Single Finger-print biometric device for Aadhaar Authentication with driver, in-built template extractor software/SDK (mandatorily with license, if required) (STQC Certificate for the device must be submitted) • API/SDK for Android (4.0 and above) platform. • Device should be plug and play with any android (4.0 and above) tablet without need of any additional license to be deployed. • The device should have integrated micro USB or standard USB type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 5 Fingerprint Scanner Device for use with Desktop • STQC certified single finger-print biometric device for Aadhaar Authentication and extractor software/SDK (STQC Certificate must be submitted) • API/SDK for Windows (7.0 and above) platform. • Device should be plug and play with any Windows (7.0 and above) without need of any additional license to be deployed. • The device should have integrated USB 2.0 type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 6 Iris Authentication Device for use with Desktop • STQC certified Iris authentication device for Aadhaar Authentication and extractor software/SDK (STQC Certificate must be submitted) • API/SDK for Windows (7.0 and above) platform and Android (4.0 or above) Operating System • Device should be plug and play with any Windows (7.0 and above) and Android (4.0 and above) without need of any additional license to be deployed • The device should have integrated USB 2.0 type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Sample application for Windows and Android platform to test Iris sensor/extractor • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications.",
    "Products BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal Techmax Solution provides Biometric Time Attendance System for AEBAS Project Aadhar Enabled Biometric Attendance System. This Biometric Device used to make attendance and send to aebas (http://www.attendance.gov.in) portal. Vivekanand Biometric Time Attendance System For AEBAS Introduced By TechMax Solution at Surat (Gujarat-India). *Device Design & Specifications is Subject to Change without Prior Notice. Features of Biometric Device: - Fully Standalone Device (No Need Of Any Computer or Software) - Complete Match With All AEBAS Norms. - Online With AEBAS Portal. - 512 MB RAM – 4 GB Memory. - STQC Certified Sensor. - 7 Inch Touch Screen. - Both Mounting (Table Top + Wall Mount) - Fastest Fingerprint Matching. Why Vivekanand Biometric is Better Than All Other Devices ? - This Device is fully standalone so you don't need to install any kind of software in computer. So there is no problems like provide team viewer to vendor, reinstall software because of virus in computer, Operating System compatibility, format computer. - Because of Standalone Device you don't depend on computer to send attendance to AEBAS Portal. - This Device is very user friendly like android application so you don't need highly educated people to operate this. - Because of Standalone Device you need less support and time for installation. - Quick and Hassle Free installation than all other devices. Preface As part of the \"Digital India†program of Government of India, it has been decided to implement common Biometric Attendance System (BAS) in the Central Government Offices (Agencies) located in Delhi which may be extended to offices of the state and governments and other government institutions in future. The proposed system would enable an employee to register attendance by simply presenting his/her biometric (finger print/Iris). This event will be authenticated online after one to one match with the bio-metric attributes stored in the UIDAI data base against the employee's Aadhaar number. For implementing this project, the Central Government Organizations need to follow a structured approach in coordinating with different stakeholders. The purpose of this document is to serve as handbook for the Central Government organizations that are implementing Bio-metric Attendance System for their employees. Targeted Audience This document is intended for the Central Government organizations that would like to implement Bio-metric Attendance System in their organization. The following are such envisaged Agencies • Ministries, Departments, Attached/Sub-ordinate organizations of Central Government • Autonomous Central Government bodies, institutions and offices • States, Districts and other Government/Semi Government bodies like municipalities • Central Public Sector Units Device Specifications as Below: Hardware Specification S.No Item Specifications 1 Integrated Attendance Device Type 1 - Integrated Android Tablet and Single Fingerprint Scanner Device Housed in Rugged Casing • Specifications of Android Tablet same as those given for Item No. 3 • Specifications for Single Fingerprint Scanner Device same as those given for Item No. 4 (STQC Certificate for the integrated bio-metric device must be submitted) • Android Tablet and Single Fingerprint Scanner should be integrated in a rugged casing. The Rugged Casing should comply with the following: • The casing should be made of inflexible, solid material and can be of polycarbonate / thick plastic / acrylic / other tough material. • It should be of black color and should have a glossy / matte finish • Acrylic casings must have a thickness of at least 5 mm. • Casing should be durable and should be able to withstand rough daily operational usage. • The casing should not suffer any damage or disfiguration on being dropped from a height of up to 2 meters • Tablet should be vertically oriented in the casing. This is important because the attendance application to be deployed is designed to run in vertical mode only. • The casing should be designed to cover/hide the android task bar of the tablet. This is required to prevent misuse of any other functionality of the tablet. • The casing should have provision to access the power/reset button of the tablet. The access should be easy but controlled. The vendor thus should make arrangements to provide an external tool to perform the power on/off and/or reset function of the tablet through the casing. • The fingerprint scanner should be ergonomically placed to support ease of usage for biometric attendance in standing posture of the users. 2 Integrated Attendance Device Type 2 - Integrated Attendance Device Manufactured as a Single Unit An integrated device for recoding biometric attendance with STQC certified fingerprint sensor meeting following configurations requirements • Display – At least 4 inch display with a minimum of 800x480 pixel resolution, 16 M Colors • Processor- 1.0 GHz or above • RAM- 512 MB or above • Hard Key / Soft Key Numeric key pad • Internal Storage- 4GB or above • Expandable storage through micro SD, minimum 8 GB • USB Port- Minimum one available USB host port to support application loading / configurations / full functional keyboard • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Internal Speakers • GSM SIM card slot • Inbuilt replaceable battery with min. battery backup of up to 120 minutes • Charging / operation on AC 100 -240 volt range with inbuilt surge protection Biometric sensor/extractor • STQC certified fingerprint sensor/extractor for Aadhaar authentication (STQC Certificate for the integrated bio-metric device must be submitted) • SDK for fingerprint device • The fingerprint scanner should be ergonomically placed to support ease of usage for biometric attendance in standing posture of the users Connectivity Requirements • Mandatory Edge / 3G mobile data support • Wi-Fi IEEE 802.11b/g/n OR LAN (Ethernet) interface OR Both • Strength, safety and operating environment • Should be able to withstand 1 m drop test • Operating temp: 0°C to 50°C • Storage not including battery: 0°C to 55°C • CE certification/ RoHS certification • SAR values within acceptable range Operating system / software requirements • Android 4.0 Operating System or above • Sample application to test fingerprint sensor/extractor • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 3 Android Tablet with 7 inch screen • Processor- 1.0 GHz or above • RAM- 512 MB or above Internal Storage- 4GB or above • Expandable storage through micro SD, minimum 8 GB • USB Port- Minimum one Micro USB port and an optional additional USB Port • USB port should provide power supply to biometric device and support USB OTG. • Front facing Camera with VGA resolution • Internal Speakers • 7''Capacitive touch screen and minimum 800x480 pixel resolution or above, 16 M Colors • GSM SIM card slot • Min. Battery backup up to 120 minutes • SAR values within acceptable range • Separate charging non-usb port with AC adapter 200-240 volt range • Micro USB host cable • Connectivity Requirements • Mandatory Edge / 3G mobile data support • Wi-Fi IEEE 802.11b/g/n OR LAN (Ethernet) interface OR Both • Software Requirements • Android 4.0 Operating System or Above • Safety and other standards compliance – CE certification/ RoHS certification • Full featured Web Browser • Application to be deployed on android tablet will require rooted Android OS • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI attendance applications. 4 Single Fingerprint Scanner Device for use with Android Tablet • STQC certified Single Finger-print biometric device for Aadhaar Authentication with driver, in-built template extractor software/SDK (mandatorily with license, if required) (STQC Certificate for the device must be submitted) • API/SDK for Android (4.0 and above) platform. • Device should be plug and play with any android (4.0 and above) tablet without need of any additional license to be deployed. • The device should have integrated micro USB or standard USB type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 5 Fingerprint Scanner Device for use with Desktop • STQC certified single finger-print biometric device for Aadhaar Authentication and extractor software/SDK (STQC Certificate must be submitted) • API/SDK for Windows (7.0 and above) platform. • Device should be plug and play with any Windows (7.0 and above) without need of any additional license to be deployed. • The device should have integrated USB 2.0 type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications. 6 Iris Authentication Device for use with Desktop • STQC certified Iris authentication device for Aadhaar Authentication and extractor software/SDK (STQC Certificate must be submitted) • API/SDK for Windows (7.0 and above) platform and Android (4.0 or above) Operating System • Device should be plug and play with any Windows (7.0 and above) and Android (4.0 and above) without need of any additional license to be deployed • The device should have integrated USB 2.0 type connector. • Device must come with connector cables to allow connection of the device to Micro USB and Standard USB ports • Sample application for Windows and Android platform to test Iris sensor/extractor • Vendor has to provide all necessary technical support for integration of their device drivers with the attendance software and associated UIDAI applications.",
    "Products BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal Techmax Solution provides Biometric Time Attendance System for CSSDA Training Centers registered at CSSDA Portal. This Biometric Device used to make attendance with GPS Location and Send that attendance to cssda portal. Vivekanand Biometric Time Attendance System For CSSDA VTP Centers Introduced By TechMax Solution at Surat (Gujarat-India). *Device Design & Specifications is Subject to Change without Prior Notice. Features of Biometric Device: - Fully Standalone Device (No Need Of Any Computer or Software) - Complete Match With All CSSDA Norms. - Online With CSSDA Portal. - 512 MB RAM – 4 GB Memory. - STQC Certified Sensor. - On Device Reporting. - 7 Inch Touch Screen. - English / Hindi Voice Prompt. - Both Mounting (Table Top + Wall Mount) - Excel Report Generated Direct In Machine No Need Of Computer. - Fastest Fingerprint Matching. - We are 1st Company To Make Attendance Live On CSSDA Portal. Why Vivekanand Biometric is Better Than All Other Devices ? - This Device is fully standalone so you don't need to install any kind of software in computer. So there is no problems like provide team viewer to vendor, reinstall software because of virus in computer, Operating System compatibility, format computer. - Because of Standalone Device you don't depend on computer to send attendance to CSSDA Portal. - This Device is very user friendly like android application so you don't need highly educated people to operate this. - Because of Standalone Device you need less support and time for installation. - Quick and Hassle Free installation than all other devices. To See Videos of CSSDA Portal Based Biometric Device For VTP . Device Specifications as Below: Hardware Specification S.No Component Specification Compliance (Yes/No) 1 Biometric Sensor and Extractor All the parameters of Biometric Devices for Authentication should be as per latest STQC scheme for certification of UIDAI biometric Devices (Authentication). STQC certified sensor and extractor only. Yes (STQC Certified) 2 Processor 32- bit, ARM-9/x86 equivalent of higher, 400 MHz of higher frequency Yes 3 Memory RAM 128 of higher, FLASH 256 MB or higher Yes Memory capacity to store fingerprints >0 3000 Memory capacity to store transaction logs >=100000 Memory capacity to store device operation logs>=100000 4 Add on Memory Micro SD Slot minimum 4 GB or more Yes 5 Keypad Minimum 16 key alpha numeric keypad with navigation Yes keys, key size to be large enough for navigation, or on screen key pad of Qwerty keypad. 6 OS/ Software Following OS with GUI Support, JVM or equivalent support Yes (Android) & SDK for 3rd party application development i. Linux 2.6 or higher ii. Windows iii. Android iv. Any other equivalent OS 7 Ports USB 2.0 or higher -1 or more nose, RJ 45 (Ethernet)/ wifi Yes 8 Language Support Unicode support for all Indian language including English Yes 9 Status indications Multi colour LED's / LCD (to indicate network connection, Yes signal strength to indicate battery charge remaining etc) or on screen display to all indicator like battery charger network strength etc. 10 Other indicators Audio/ visual capability, A/V indication either at device Yes level or at application level for Indication various events like a) Indicating for placing finger b) Start of capturing c) End or capturing 11 Connectivity Two channels or connectivity are mandatory for devices, Yes first connectivity as GPRS is mandatory. Second connectivity can be through wifi b/g/n/ fixed broadband e.g. GPRS + broadband, GPRS + wifi etc 12 Non – volatile storage Must be capable of storing audit trails of at least 1000 transactions Yes 13 Display Minimum 3.5†screen or higher, with at least 262k colors TFT Yes 14 Battery backup Minimum 4 hours battery backup Yes 15 Antenna Internal, External / Extended External Antenna Yes 16 Power adaptor AC/ DC adaptor with surge protection, input 100 -264v AC, 50Hz Yes 17 Environment Storage not including battery 0'C to 55' c Yes Operating temp 0' C to 50 'C 18 Humidity 10-90 % RH Non-condensing Yes 19 Speaker A facility should be provided for voice confirmation of the transaction, 1W or more Yes 20 Other Accessories Durable carry case, multilingual user manual (English, Hindi) screwdriver, damper a white cloth (45 cm * 45 CM) Ok 21 Other features External accessible slots for SIM and SD Cards Yes 22 Support Complete cover support with breakage replacement for a period of three years. Ok 23 Security 2048 –bit, PKI 256 – bit AES, Base 64, SHA- 256 (optional) Ok 24 GPS Industry standard 16 channel NMEA compliant GPS Support Yes 25 Environment health and safety RoHS certification (optional) Ok 26 EMC compliance FCC class A or equivalent (optional) Ok 27 Ingress Protection (IP) Compliance Dust resistant, Water resistance (optional) Ok Client Application Specification S.No Component Specification Compliance (Yes/No) 1 NFIQ Quality Software Inbuilt NFIQ quality software either at device level or extractor level to check the quality of fingerprint during enrolment Yes 2 Enrolment client Enrolment client application shall have the following functionalities Yes · Enrolment of 10 fingerprints with identifier (Unique registration number) · Verification of NFIQ before accepting fingerprint for enrolment · De-duplication of fingerprint during enrolment for single candidate 3 Authentication on client Authentication client application shall have following functionalities. Yes · Authentication of fingerprint based on 1: n logic among the local storage of fingerprint templates · Attendance transaction logs to be stored internally · Voice enablement of authentication output in English and Hindi 4 Integration Biometric fingerprint enrollment and authentication client application should be integrated with office server application and should be able to upload / download through SSL / https connection dully suiting the API / web services provided by office Yes 5 Remote update of software Device must support version control feature in order to remotely monitor and provision application and system software, remote device management. Feature must be provisioned as a part of the device deployment Yes 6 Reports The following reports should be generated at the device level 1. Daily attendance report (batch wise and training center wise) 2. Batch wise attendance report 3. Student Wise attendance report 4. Trainers wise attendance report 5. Enrolment reports (displaying date of enrolment, number of fingerprint, etc) 6. Consolidated training centre attendance report More reports may be added in the future. Yes 7 Additional features • Device operation logs should be captured and stored internally. Device operations like, switch on & off, enrollment of finger print & user, change of settings, etc, shall be logged. • Date and time in the biometric device should be either of the GPRS connection or server timings. No option to change the data and time should be available in the biometric device. • Deletion of individual record (enrolment, attendance transaction logs, device operation logs should be disabled Yes 8 Output file format Biometric data to be transferred to central server should be in XML format Yes",
    "Products BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal BioDroid - Android Based Biometric Device Biometric For AEBAS Portal Biometric For PMKVY Portal Biometric For SDI & DGET Portal Biometric For ISDS Textiles Portal Biometric For CSSDA Portal Biometric For NDLM Project Biometric For RSLDC Portal Biometric For NIIT Portal Vivekanand Biometric Time Attendance System is Android Based Biometric Device. This Biometric Device used at Various Government and Private Portals For Time Attendance Purpose. Vivekanand Biometric Time Attendance System Introduced By TechMax Solution at Surat (Gujarat-India). This Biometric Device Generally Used at Various Government and Private Organization for Monitoring Attendance of Employee, Trainers and Trainees. This Biometric Device supports GPS Functions, So Attendance Location also available with Time. This Biometric Device Supports GPS Location with GPS Latitude and GPS Langitude. Rightnow, This Devices Configured With Following Potlas: 1. AEBAS (Aadhar Enabled Biometric Time Attendance System) To Know More.. 2. PMKVY (Pradhan Mantri Kaushal Vikas Yojna) - Skill India To Know More.. 3. BioDroid (Android Based Biometric For Corporate Clients) with Fingerprint, RFID and IRIS Support To Know More.. 4. SDI (Skill Development Initiative) To Know More.. 5. ISDS (Integrated Skill Development Scheme) Under Ministry Of Textile To Know More.. 6. Aajeevika (DDU-GKY) (National Rural Livelihoods Mission) To Know More.. 7. NDLM (National Digital Literacy Mission) To Know More.. 8. CSSDA (Chhatishgarh State Skill Development Authority) To Know More.. 9. RSLDC (Rajasthan Skill and Livelihoods Development Corporation) To Know More.. 10. NIIT (National Institute Of Information and Technology) To Know More.. Device Specifications as Below: *Device Design & Specifications is Subject to Change without Prior Notice. Hardware Specification S.No Component Specification Compliance (Yes/No) 1 Biometric Sensor and Extractor All the parameters of Biometric Devices for Authentication should be as per latest STQC scheme for certification of UIDAI biometric Devices (Authentication). STQC certified sensor and extractor only. Yes (STQC Certified) 2 Processor 32- bit, ARM-9/x86 equivalent of higher, 400 MHz of higher frequency Yes 3 Memory RAM 128 of higher, FLASH 256 MB or higher Yes Memory capacity to store fingerprints >0 3000 Memory capacity to store transaction logs >=100000 Memory capacity to store device operation logs>=100000 4 Add on Memory Micro SD Slot minimum 4 GB or more Yes 5 Keypad Minimum 16 key alpha numeric keypad with navigation Yes keys, key size to be large enough for navigation, or on screen key pad of Qwerty keypad. 6 OS/ Software Following OS with GUI Support, JVM or equivalent support Yes (Android) & SDK for 3rd party application development i. Linux 2.6 or higher ii. Windows iii. Android iv. Any other equivalent OS 7 Ports USB 2.0 or higher -1 or more nose, RJ 45 (Ethernet)/ wifi Yes 8 Language Support Unicode support for all Indian language including English Yes 9 Status indications Multi colour LED's / LCD (to indicate network connection, Yes signal strength to indicate battery charge remaining etc) or on screen display to all indicator like battery charger network strength etc. 10 Other indicators Audio/ visual capability, A/V indication either at device Yes level or at application level for Indication various events like a) Indicating for placing finger b) Start of capturing c) End or capturing 11 Connectivity Two channels or connectivity are mandatory for devices, Yes first connectivity as GPRS is mandatory. Second connectivity can be through wifi b/g/n/ fixed broadband e.g. GPRS + broadband, GPRS + wifi etc 12 Non – volatile storage Must be capable of storing audit trails of at least 1000 transactions Yes 13 Display Minimum 3.5†screen or higher, with at least 262k colors TFT Yes 14 Battery backup Minimum 4 hours battery backup Yes 15 Antenna Internal, External / Extended External Antenna Yes 16 Power adaptor AC/ DC adaptor with surge protection, input 100 -264v AC, 50Hz Yes 17 Environment Storage not including battery 0'C to 55' c Yes Operating temp 0' C to 50 'C 18 Humidity 10-90 % RH Non-condensing Yes 19 Speaker A facility should be provided for voice confirmation of the transaction, 1W or more Yes 20 Other Accessories Durable carry case, multilingual user manual (English, Hindi) screwdriver, damper a white cloth (45 cm * 45 CM) Ok 21 Other features External accessible slots for SIM and SD Cards Yes 22 Support Complete cover support with breakage replacement for a period of three years. Ok 23 Security 2048 –bit, PKI 256 – bit AES, Base 64, SHA- 256 (optional) Ok 24 GPS Industry standard 16 channel NMEA compliant GPS Support Yes 25 Environment health and safety RoHS certification (optional) Ok 26 EMC compliance FCC class A or equivalent (optional) Ok 27 Ingress Protection (IP) Compliance Dust resistant, Water resistance (optional) Ok Client Application Specification S.No Component Specification Compliance (Yes/No) 1 NFIQ Quality Software Inbuilt NFIQ quality software either at device level or extractor level to check the quality of fingerprint during enrolment Yes 2 Enrolment client Enrolment client application shall have the following functionalities Yes · Enrolment of 10 fingerprints with identifier (Unique registration number) · Verification of NFIQ before accepting fingerprint for enrolment · De-duplication of fingerprint during enrolment for single candidate 3 Authentication on client Authentication client application shall have following functionalities. Yes · Authentication of fingerprint based on 1: n logic among the local storage of fingerprint templates · Attendance transaction logs to be stored internally · Voice enablement of authentication output in English and Hindi 4 Integration Biometric fingerprint enrollment and authentication client application should be integrated with office server application and should be able to upload / download through SSL / https connection dully suiting the API / web services provided by office Yes 5 Remote update of software Device must support version control feature in order to remotely monitor and provision application and system software, remote device management. Feature must be provisioned as a part of the device deployment Yes 6 Reports The following reports should be generated at the device level 1. Daily attendance report (batch wise and training center wise) 2. Batch wise attendance report 3. Student Wise attendance report 4. Trainers wise attendance report 5. Enrolment reports (displaying date of enrolment, number of fingerprint, etc) 6. Consolidated training centre attendance report More reports may be added in the future. Yes 7 Additional features • Device operation logs should be captured and stored internally. Device operations like, switch on & off, enrollment of finger print & user, change of settings, etc, shall be logged. • Date and time in the biometric device should be either of the GPRS connection or server timings. No option to change the data and time should be available in the biometric device. • Deletion of individual record (enrolment, attendance transaction logs, device operation logs should be disabled Yes 8 Output file format Biometric data to be transferred to central server should be in XML format Yes"
  ]
}