{
  "company": "www.divit.com.tr",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Divit Digital Video and Image Technologies Who We Are? Divit Technology was founded in İstanbul Technical University (ITU) by the ITU academicians. From then on Divit Technology still operates in ITU with an R&D office and a workshop. It has initiated numerous projects in various fields of digital video and image technologies. With experienced engineers, Divit Technology offers %100 in-house solutions in video and image technologies. About Us Divit Technology was founded in İstanbul Technical University (ITU) by the ITU academicians. From then on Divit Technology still operates in ITU with an R&D office and a workshop. It has initiated numerous projects in various fields of digital video and image technologies. With experienced engineers, Divit Technology offers %100 in-house solutions in video and image technologies. About Us Capabilities %100 In-house Solution With skilled software and production teams, we provide a key solution in R&D. From hardware to software we design, apply, manufacture and operate. In our R&D and Workshop, we offer in-house solutions. With TSI-certified products manufactured in our workshop. Continuous Support With 20 years of technology, Divit Technology developed a critical vision in security. 24/7 continuous technical support for all customers. From product design to technical service, our vision drives us to create the most trustable systems. Quick technical responses allow us to offer our services to the most reputable establishments. High Accuracy Divit Spark Smart Camera, created in Divit Technology, achieve the best accuracy in plate and vehicle recognition field tests. With over %99+ accuracy, Divit Spark provides security all over Türkiye. As confirmed by audits, Divit Spark is the safest choice in security. Divit Digital Video and Image Technologies Divit Spark Smart Cameras are all over Türkiye! The safest choice in security. Divit Spark Smart Cameras are all over Türkiye! Our Projects R&D Projects Projects generated by Divit Technology. Advanced Image Processing Applications for Chain Stores TEYDEB 2024 More Image Processing-Based Dimension Measurement System TEYDEB 2021 More Resource-Efficient System Design And Software Development In Embedded Linux Environment TEYDEB 2019 More Multipurpose Face Recognition Technology TEYDEB 2013 More Advanced Image Processing Applications for Chain Stores Image Processing-Based Dimension Measurement System Resource-Efficient System Design And Software Development In Embedded Linux Environment Multipurpose Face Recognition Technology Divit Digital Video and Image Technologies Contact Us You can reach us by filling out the form or contacting us via the phone number and email below.. +90 212 276 2101 info@divit.com.tr +90 212 276 2101"
  ]
}