{
  "company": "www.gentex.com",
  "dominant_topics": [
    23,
    0,
    4,
    -1
  ],
  "topic_counts": {
    "23": 31,
    "0": 2,
    "4": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "23": "gentex, glass, dimmable, dimmable glass, mirror",
    "0": "access, information, security, data, piam",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader"
  },
  "framing_scores": {
    "framing_ethical": 0.6451612903225806,
    "framing_surveillance": 0.0967741935483871,
    "framing_market": 0.2580645161290322,
    "num_docs": 35
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2,
      "4": 1,
      "23": 31
    }
  },
  "sample_docs": [
    "VISIT US AT BOOTH 12525 Join us at SEMA to see the latest automotive vision- and connectivity-related features for accessory and factory integration: Full Display Mirrors® (FDM®) - digital rearview mirrors FDM systems for racing teams Glare-eliminating rearview mirrors with advanced features HomeLink® vehicle-to-home automation with RF and cloud-based device operation Sophisticated frameless mirror designs Mobile payment solutions Prototype mirror-integrated DVR, trailer CAM and more Mirror modules that integrate cameras, telematics, displays, and alerts Join us at SEMA to see the latest automotive vision- and connectivity-related features for accessory and factory integration: Full Display Mirrors® (FDM®) - digital rearview mirrors FDM systems for racing teams Glare-eliminating rearview mirrors with advanced features HomeLink® vehicle-to-home automation with RF and cloud-based device operation Sophisticated frameless mirror designs Prototype mirror-integrated DVR, trailer CAM and more Mirror modules that integrate cameras, telematics, displays, and alerts 01. 2021 Chevrolet Silverado 01. 2021 Chevrolet Silverado 02. 2021 Vorsheer XOC 02. 2021 Vorsheer XOC 03. 2021 Chevrolet Corvette 03. 2021 Chevrolet Corvette Download Gentex SEMA 2021 Media Kit Download Gentex SEMA 2021 Media Kit Supplier Info Product Support Certifications + Privacy Contact Resources Patents GENTEX CORPORATION 600 N. Centennial St., Zeeland, MI 49464 616.772.1800 About Overview Sustainability Diversity Products + Technology Automotive Digital Vision Connectivity / Sensing Dimmable Glass Fire Protection Aerospace Electronically Dimmable Windows Premium Glass Laminates Automotive Digital Vision Connectivity / Sensing Dimmable Glass Aerospace Electronically Dimmable Windows Premium Glass Laminates Capabilities Vision Systems Glass Processing Chemistry Software Manufacturing Careers Search For Jobs Life at Gentex Careers at Gentex Collegiate Opportunities Production Jobs SEMA 2021 Overview 2021 Chevrolet Silverado 2021 Vorsheer XOC 2021 Chevrolet Corvette",
    "FAQs Where can I purchase a Gentex mirror for my vehicle? Contact automotive OEM dealer parts/accessory group or visit our after market distributor: Voxx Electronics Corporation Visit Website or call 800.371.7725 How do I install the aftermarket mirror I purchased Reference the install manual that came with your product or contact the company/person from whom you purchased your product. Also you can visit our after market distributor. Voxx Electronics Corporation Visit Website or call 800.371.7725 How do I get the schematics to install my rear view mirror? ​Gentex Corporation does not disclose schematic information for product installations. What if my product was not purchased from an approved after market distributor or automotive OEM dealer parts/accessory group? All aftermarket purchases must be made through Voxx Electronics Corporation . Gentex does not provide installation support or assistance with products purchased through any other source. Gentex does not support the following business: eBay, Amazon, Craigslist, salvage yards, etc. How do I program my HomeLink® buttons to my garage door opener? Visit www.homelink.com or call 1‐800‐355‐3515. How do I know if the mirror is dimming correctly? ​ Click to view the Auto-Dimming Troubleshooting Guide How do I calibrate the compass on my mirror? ​ Click to view the Compass Calibration Troubleshooting Guide How do I know if the compass heading is correct? ​ Click to view our trouble shooting tree Contact automotive OEM dealer parts/accessory group or visit our after market distributor: Voxx Electronics Corporation Visit Website or call 800.371.7725 Reference the install manual that came with your product or contact the company/person from whom you purchased your product. Also you can visit our after market distributor. Voxx Electronics Corporation Visit Website or call 800.371.7725 ​Gentex Corporation does not disclose schematic information for product installations. All aftermarket purchases must be made through Voxx Electronics Corporation . Gentex does not provide installation support or assistance with products purchased through any other source. Gentex does not support the following business: eBay, Amazon, Craigslist, salvage yards, etc. Visit www.homelink.com or call 1‐800‐355‐3515. ​ Click to view the Auto-Dimming Troubleshooting Guide ​ Click to view the Compass Calibration Troubleshooting Guide ​ Click to view our trouble shooting tree *Important Notices Note: All aftermarket purchases must be made through a dealer or VOXX Electronics Corporation . Gentex does not provide installation support or assistance with products purchased through any other source. Note: Auto dealers should contact the OEM technical hotline before submitting an inquiry to Gentex. When seeking additional instructions, always be sure to reference your owner's manual first. Contact the company/party from whom you purchased your mirror if you have issues with it for any reason. Note: The materials included on this website, including the Literature/Reference Material (e.g., technical bulletins, application guides, manuals, and reference materials), have been prepared by Gentex Corporation (\"Gentex\") for informational purposes only, are necessarily summary, and are not purported to serve as legal advice and should not be used as such. Gentex makes no representations and warranties, express or implied, that these materials are complete and accurate, up-to-date, or in compliance with all relevant local, state, and federal laws, regulations, and rules. The materials do not address all legal considerations and therefore, these materials should be used only for informational purposes and should not be used as a substitute for seeking professional legal advice. Gentex will not be responsible for any action or failure to act in reliance upon the information contained in this web site. HomeLink® and the HomeLink House icon® are registered trademarks of Gentex Corporation. If additional information is necessary, please submit a product support request form. Fill Out Form Note: All aftermarket purchases must be made through a dealer or VOXX Electronics Corporation . Gentex does not provide installation support or assistance with products purchased through any other source. Note: Auto dealers should contact the OEM technical hotline before submitting an inquiry to Gentex. When seeking additional instructions, always be sure to reference your owner's manual first. Contact the company/party from whom you purchased your mirror if you have issues with it for any reason. Note: The materials included on this website, including the Literature/Reference Material (e.g., technical bulletins, application guides, manuals, and reference materials), have been prepared by Gentex Corporation (\"Gentex\") for informational purposes only, are necessarily summary, and are not purported to serve as legal advice and should not be used as such. Gentex makes no representations and warranties, express or implied, that these materials are complete and accurate, up-to-date, or in compliance with all relevant local, state, and federal laws, regulations, and rules. The materials do not address all legal considerations and therefore, these materials should be used only for informational purposes and should not be used as a substitute for seeking professional legal advice. Gentex will not be responsible for any action or failure to act in reliance upon the information contained in this web site. HomeLink® and the HomeLink House icon® are registered trademarks of Gentex Corporation. If additional information is necessary, please submit a product support request form. Supplier Info Product Support Certifications + Privacy Contact Resources Patents GENTEX CORPORATION 600 N. Centennial St., Zeeland, MI 49464 616.772.1800 About Overview Sustainability Diversity Products + Technology Automotive Digital Vision Connected Car Dimmable Glass Fire Protection Aerospace Automotive Digital Vision Connected Car Dimmable Glass Capabilities Vision Systems Glass Processing Chemistry Software Manufacturing Careers Search For Jobs Life at Gentex Careers at Gentex Collegiate Opportunities Production Jobs",
    "Group Patents If your HomeLink product features a group patent identification instead of the 8-digit identification number, please select the patent group from the chart below to view the applicable patents. Locate my patent group Group A Group AC Group AE Group AH Group AJ Group AK Group G Group P Group R, W Group S Group T Group V Group Y Group Z If your HomeLink product features a group patent identification instead of the 8-digit identification number, please select the patent group from the chart below to view the applicable patents. Locate my patent group Patent Search For your reference, the tool below will display the United States patents that cover a specific product when the lot number (located on the back of the mirror or module) is entered into the box below. Locate my lot number Please note that this tool works for all mirrors manufactured beginning June 2012, and HomeLink products beginning February 2013. For all products manufactured before those dates, the patent information can be found on a label located inside the mirror's housing or on the module. Locate my lot number HomeLink products are also covered by one or more of the following patents: View Patents HomeLink® is a registered trademark of Gentex Corporation. For your reference, the tool below will display the United States patents that cover a specific product when the lot number (located on the back of the mirror or module) is entered into the box below. Locate my lot number Please note that this tool works for all mirrors manufactured beginning June 2012, and HomeLink products beginning February 2013. For all products manufactured before those dates, the patent information can be found on a label located inside the mirror's housing or on the module. Locate my lot number HomeLink products are also covered by one or more of the following patents: View Patents HomeLink® is a registered trademark of Gentex Corporation. Supplier Info Product Support Certifications + Privacy Contact Resources Patents GENTEX CORPORATION 600 N. Centennial St., Zeeland, MI 49464 616.772.1800 About Overview Sustainability Diversity Products + Technology Automotive Digital Vision Connectivity / Sensing Dimmable Glass Fire Protection Aerospace Electronically Dimmable Windows Premium Glass Laminates Automotive Digital Vision Connectivity / Sensing Dimmable Glass Aerospace Electronically Dimmable Windows Premium Glass Laminates Capabilities Vision Systems Glass Processing Chemistry Software Manufacturing Careers Search For Jobs Life at Gentex Careers at Gentex Collegiate Opportunities Production Jobs Events CES 2022 SEMA 2021",
    "Media Kit Download Full Corporate Media Kit Gentex IAA Media Kit CES2021 Media Kit Corporate Overview Corporate Brochure Corporate Video Brand Assets & Logos Gentex Headquarters Photo Annual Report Working at Gentex Video Read all of our latest press releases here . Read all of our latest press releases here . Brochures Gentex Recruiting Brochure Gentex Corporate Overview Gentex Corporate Brochure 2021 Sustainability Report 2021 Annual Report Tech Briefs & Product News CES2021 - Digital Vision CES2021 - Connectivity & Sensing CES2021 - Dimmable Glass Cabin Monitoring & Sensing Product News - DVR HomeLink® Electrochromic (EC) MIrrors Full Display Mirror® Integrated Toll Module® (ITM®) Camera Monitoring Systems (CMS) Tech Briefs & Product News CES2021 - Digital Vision CES2021 - Connectivity & Sensing CES2021 - Dimmable Glass Cabin Monitoring & Sensing Product News - DVR Integrated Toll Module® (ITM®) Camera Monitoring Systems (CMS) Image Sets + Videos Gentex Corporate Images and Logos Gentex Headquarters Gentex Logo HomeLink Logo ITM Logo ITM Logo 2 Smartbeam Logo Download Image Set Gentex Aerospace Passenger & Dim Window Boeing - Dimming Window Progression Window Exterior View Window Testing Window Testing 2 Windows Switches Gentex Aerospace - Biometrics Gentex Aerospace - Cabin Sensing Gentex Aerospace - Dimmable Windows Gentex Aerospace - Smart Lighting Gentex Aerospace Brochure Gentex Aerospace - Emerging Technology Download Image Set Interior Auto-Dimming Mirrors Interior EC Mirror 1 Interior EC Mirror 2 Interior EC Mirror 3 TruColor Interior Mirror 1 TruColor Interior Mirror 2 Dimming Interior Mirror Video Download Image Set Exterior Auto-Dimming Mirrors Exterior EC Mirror 1 Exterior EC Mirror 2 Exterior EC Mirror - Aston Martin TruColor Exterior Mirror 1 TruColor Exterior Mirror 2 TruColor Exterior Mirror 3 Dimming Exterior Mirror Video Download Image Set Full Display Mirror® (FDM®) FDM 1 - In Vehicle FDM 2 - HomeLink Button Press FDM 3 - Aston Martin Superleggera FDM 4 - GM Shape FDM 5 - Toggle FDM 6 - Driver Toggle Touchscreen FDM DVR Auxiliary Trailer Camera Active Illumination Download Image Set Camera Monitoring Systems Hybrid CMS - Aston Martin DBS Superleggera Fully Digital CMS - Cadillac CTS-V Biometric Authentication System Biometric Iris Scan 1 Biometric Iris Scan 2 Biometric Iris Scan 3 Biometric Iris Authenticated Eye Scanning - Mirror Biometrics Mirror Gentex Biometrics Video Download Image Set HomeLink® Button Press 1 Button Press 2 Button Press 3 HomeLink Connect App - Open Pair Your Mirror Program Your Garage Configure Lighting Touchscreen Interface HomeLink Connect - Voxx HomeLink Connect Compatible Mirror HomeLink Connect App HomeLink Connect Flyer HomeLink 2019 Commercial Download Image Set Integrated Toll Module® (ITM®) ITM Logo ITM Mirror ITM - Toll Gantry Toll Booth ITM Tech Brief ITM One-Pager Audi e-tron Animation Download Image Set Dimmable Glass Aerospace Window Exterior Mirror Dimmable Sun Visor Dimmable Sensor Shroud Dimmable HUD 1 Dimmable HUD 2 Gentex Dimmable Sunroof 1 Gentex Dimmable Sunroof 2 Gentex Dimmable Sunroof 3 Gentex Buck - Dimmable Glass Video Download Image Set Smart Lighting Smart Lighting Detail Smart Lighting - Full Assembly Smart Lighting Animation Smart Lighting Fact Sheet Download Image Set Vehicle Demonstrators Gentex 'Pure Michigan' Truck Gentex Vehicle Buck Image Sets + Videos Gentex Corporate Images and Logos Passenger & Dim Window Boeing - Dimming Window Progression Gentex Aerospace - Biometrics Gentex Aerospace - Cabin Sensing Gentex Aerospace - Dimmable Windows Gentex Aerospace - Smart Lighting Gentex Aerospace - Emerging Technology Interior EC Mirror 1 Interior EC Mirror 2 Interior EC Mirror 3 TruColor Interior Mirror 1 TruColor Interior Mirror 2 Dimming Interior Mirror Video Exterior EC Mirror 1 Exterior EC Mirror 2 Exterior EC Mirror - Aston Martin TruColor Exterior Mirror 1 TruColor Exterior Mirror 2 TruColor Exterior Mirror 3 Dimming Exterior Mirror Video Full Display Mirror® (FDM®) FDM 1 - In Vehicle FDM 2 - HomeLink Button Press FDM 3 - Aston Martin Superleggera FDM 4 - GM Shape FDM 5 - Toggle FDM 6 - Driver Toggle Hybrid CMS - Aston Martin DBS Superleggera Fully Digital CMS - Cadillac CTS-V Biometric Iris Scan 1 Biometric Iris Scan 2 Biometric Iris Scan 3 Eye Scanning - Mirror HomeLink Connect App - Open HomeLink Connect - Voxx HomeLink Connect Compatible Mirror Integrated Toll Module® (ITM®) ITM - Toll Gantry Gentex Dimmable Sunroof 1 Gentex Dimmable Sunroof 2 Gentex Dimmable Sunroof 3 Gentex Buck - Dimmable Glass Video Smart Lighting - Full Assembly Smart Lighting Fact Sheet Gentex 'Pure Michigan' Truck Supplier Info Product Support Certifications + Privacy Contact Resources Patents GENTEX CORPORATION 600 N. Centennial St., Zeeland, MI 49464 616.772.1800 About Overview Sustainability Diversity Products + Technology Automotive Digital Vision Connectivity / Sensing Dimmable Glass Fire Protection Aerospace Electronically Dimmable Windows Premium Glass Laminates Automotive Digital Vision Connectivity / Sensing Dimmable Glass Aerospace Electronically Dimmable Windows Premium Glass Laminates Capabilities Vision Systems Glass Processing Chemistry Software Manufacturing Careers Search For Jobs Life at Gentex Careers at Gentex Collegiate Opportunities Production Jobs Virtual CES 2021 CES 2021 Overview Digital Vision Connectivity & Sensing Dimmable Glass New Tech / Markets New Tech / Markets",
    "We apologize for any inconvenience you are experiencing with your Gentex product. Please complete and submit this form and a response will be sent to you shortly. Filling out this form is the best way for Gentex to assist you in resolving your concern. If, after you have filled out the form, you would like to speak to a product support representative, please call 1-877-475-1777. Gentex Corporation is based in the United States and our website is governed and operated in accordance with the laws of the United States and is intended for the use of residents of the United States. By accessing our website or sharing your contact information with us, you consent to and accept our of Use. If you are unwilling to be bound by our of Use , you should not access our website or share your contact information. Please also consult our for a description of our privacy practices and policies, which are expressly incorporated herein. Supplier Info Product Support Certifications + Privacy Contact Resources Patents GENTEX CORPORATION 600 N. Centennial St., Zeeland, MI 49464 616.772.1800 About Overview Sustainability Diversity Insights Products + Technology Automotive Digital Vision Connectivity Sensing Dimmable Glass Fire Protection Aerospace Emerging Technology Automotive Digital Vision Connectivity Sensing Dimmable Glass Capabilities Vision Systems Glass Processing Chemistry Software Manufacturing Careers Search For Jobs Life at Gentex Careers at Gentex Collegiate Opportunities Production Jobs Gentex Grand Rapids Events CES 2023 SEMA 2021 Gentex Supplier Conference Investors + Media Investor Relations Newsroom"
  ]
}