{
  "company": "www.ivideon.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 18,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 18,
      "0": 3
    }
  },
  "sample_docs": [
    "Business Solutions Video Analytics Video analytics Facial Recognition People Counter Ivideon People Cash register control Automatic License Plate Recognition Connect to the cloud Ivideon Bridge Ivideon Server What it boils down to Convenient application Access from anywhere in the world with a convenient app TLS encryption Reliable TLS data encryption 3G support Stable operation in 3G networks 24/7 customer support Round-the-clock tech support Smart notifications Notifications for movement, sound, and cameras turning off Intuitive interface Ivideon account with a user-friendly interface efficient and fast player Trusted by 15 000+ companies around the world Cloud Video Surveillance for crypto ATMs Värdex was looking for a high quality camera system for a reasonable price that will be easy to upscale in the future. Ivideon offered a reliable camera system that allows cloud recordings to be fallen back to whenever necessary. Now, the entire process from ordering the product, installation on-site, and license activation right up to daily use has been simple and efficient. An integrated solution for a single security system It is possible to deploy Ivideon Cloud Video Surveillance using a direct camera to cloud connection from multiple sites and combine any number of geographically-distributed cameras into one system. Now, Power Design provides the option to remotely monitor regional projects from anywhere in the world. This has resulted in a considerable reduction in losses from theft and vandalism. Pizza as a worldwide reality show More than 1,130 cameras have been installed in the USA, UK, Slovenia, Estonia, and Romania. When customers order pizza, they can watch how it's prepared in real time on the pizzeria's website or in a mobile app. This increases consumer loyalty by taking advantage of the principle of public monitoring, in this case, as applied to the pizza-making process. Centralized management of branch offices Switching to cloud video surveillance allowed Henkel to implement centralized management of remote production sites and administration offices through access to a convenient shared web-based control panel. As there is no cost for cloud server support, the expenses required to own and run a video surveillance system are reduced. The ivideon service works with 98% of CAMERAS IN THE WORLD Security Tier 3 Video footage is stored on servers hosted by several Tier 3 data centers in the EU AES-256-GCM Records are encrypted during storage using AES-256-GCM Key storage Decryption keys are stored in a geographically remote location Decryption Recordings are decrypted on the storage servers on playback demand. Decryption keys are only transmitted to storage locations in such cases TLS encryption All data transfer between Ivideon Cloud components and between Ivideon Cloud and end users is secured using TLS Support Customer service engineers and other employees can access user channels only with the express consent of the camera owners News 17.07.2024 How Ivideon Transforms Video Surveillance → 09.07.2024 Highlights from iVideon's Presence at ST24 in Manchester iVideon was pleased to participate in the ST24 security event held at Old Trafford, Manchester. The event provided a valuable opportunity to engage with end users, integrators, installers, and security product specifiers. → 20.06.2024 Introducing the Enhanced \"Visitors Counting and Traffic\" Module Introducing the Enhanced \"Visitors Counting and Traffic\" Module → 10.06.2024 Ivideon and Secure Logiq Partner to Enhance Cooperation Ivideon and Secure Logiq Partner to Enhance Cooperation → More news Business Solutions Video Analytics Video analytics Facial Recognition People Counter Ivideon People Cash register control Automatic License Plate Recognition Connect to the cloud Ivideon Bridge Ivideon Server Business Solutions Video Analytics Video analytics Facial Recognition People Counter Ivideon People Cash register control Automatic License Plate Recognition Connect to the cloud Ivideon Bridge Ivideon Server What it boils down to Convenient application Access from anywhere in the world with a convenient app TLS encryption Reliable TLS data encryption 3G support Stable operation in 3G networks 24/7 customer support Round-the-clock tech support Smart notifications Notifications for movement, sound, and cameras turning off Intuitive interface Ivideon account with a user-friendly interface efficient and fast player What it boils down to Convenient application Access from anywhere in the world with a convenient app TLS encryption Reliable TLS data encryption 3G support Stable operation in 3G networks 24/7 customer support Round-the-clock tech support Smart notifications Notifications for movement, sound, and cameras turning off Intuitive interface Ivideon account with a user-friendly interface efficient and fast player What it boils down to Access from anywhere in the world with a convenient app Reliable TLS data encryption Stable operation in 3G networks Notifications for movement, sound, and cameras turning off Ivideon account with a user-friendly interface efficient and fast player Trusted by 15 000+ companies around the world Cloud Video Surveillance for crypto ATMs Värdex was looking for a high quality camera system for a reasonable price that will be easy to upscale in the future. Ivideon offered a reliable camera system that allows cloud recordings to be fallen back to whenever necessary. Now, the entire process from ordering the product, installation on-site, and license activation right up to daily use has been simple and efficient. An integrated solution for a single security system It is possible to deploy Ivideon Cloud Video Surveillance using a direct camera to cloud connection from multiple sites and combine any number of geographically-distributed cameras into one system. Now, Power Design provides the option to remotely monitor regional projects from anywhere in the world. This has resulted in a considerable reduction in losses from theft and vandalism. Pizza as a worldwide reality show More than 1,130 cameras have been installed in the USA, UK, Slovenia, Estonia, and Romania. When customers order pizza, they can watch how it's prepared in real time on the pizzeria's website or in a mobile app. This increases consumer loyalty by taking advantage of the principle of public monitoring, in this case, as applied to the pizza-making process. Centralized management of branch offices Switching to cloud video surveillance allowed Henkel to implement centralized management of remote production sites and administration offices through access to a convenient shared web-based control panel. As there is no cost for cloud server support, the expenses required to own and run a video surveillance system are reduced. Trusted by 15 000+ companies around the world The ivideon service works with 98% of CAMERAS IN THE WORLD The ivideon service works with Security Tier 3 Video footage is stored on servers hosted by several Tier 3 data centers in the EU AES-256-GCM Records are encrypted during storage using AES-256-GCM Key storage Decryption keys are stored in a geographically remote location Decryption Recordings are decrypted on the storage servers on playback demand. Decryption keys are only transmitted to storage locations in such cases TLS encryption All data transfer between Ivideon Cloud components and between Ivideon Cloud and end users is secured using TLS Support Customer service engineers and other employees can access user channels only with the express consent of the camera owners Security Tier 3 Video footage is stored on servers hosted by several Tier 3 data centers in the EU AES-256-GCM Records are encrypted during storage using AES-256-GCM Key storage Decryption keys are stored in a geographically remote location Decryption Recordings are decrypted on the storage servers on playback demand. Decryption keys are only transmitted to storage locations in such cases TLS encryption All data transfer between Ivideon Cloud components and between Ivideon Cloud and end users is secured using TLS Support Customer service engineers and other employees can access user channels only with the express consent of the camera owners Video footage is stored on servers hosted by several Tier 3 data centers in the EU Records are encrypted during storage using AES-256-GCM Decryption keys are stored in a geographically remote location Recordings are decrypted on the storage servers on playback demand. Decryption keys are only transmitted to storage locations in such cases All data transfer between Ivideon Cloud components and between Ivideon Cloud and end users is secured using TLS Customer service engineers and other employees can access user channels only with the express consent of the camera owners News 17.07.2024 How Ivideon Transforms Video Surveillance → 09.07.2024 Highlights from iVideon's Presence at ST24 in Manchester iVideon was pleased to participate in the ST24 security event held at Old Trafford, Manchester. The event provided a valuable opportunity to engage with end users, integrators, installers, and security product specifiers. → 20.06.2024 Introducing the Enhanced \"Visitors Counting and Traffic\" Module Introducing the Enhanced \"Visitors Counting and Traffic\" Module → 10.06.2024 Ivideon and Secure Logiq Partner to Enhance Cooperation Ivideon and Secure Logiq Partner to Enhance Cooperation → More news 17.07.2024 How Ivideon Transforms Video Surveillance → How Ivideon Transforms Video Surveillance 09.07.2024 Highlights from iVideon's Presence at ST24 in Manchester iVideon was pleased to participate in the ST24 security event held at Old Trafford, Manchester. The event provided a valuable opportunity to engage with end users, integrators, installers, and security product specifiers. → Highlights from iVideon's Presence at ST24 in Manchester iVideon was pleased to participate in the ST24 security event held at Old Trafford, Manchester. The event provided a valuable opportunity to engage with end users, integrators, installers, and security product specifiers. 20.06.2024 Introducing the Enhanced \"Visitors Counting and Traffic\" Module Introducing the Enhanced \"Visitors Counting and Traffic\" Module → Introducing the Enhanced \"Visitors Counting and Traffic\" Module Introducing the Enhanced \"Visitors Counting and Traffic\" Module 10.06.2024 Ivideon and Secure Logiq Partner to Enhance Cooperation Ivideon and Secure Logiq Partner to Enhance Cooperation → Ivideon and Secure Logiq Partner to Enhance Cooperation Ivideon and Secure Logiq Partner to Enhance Cooperation",
    "Ivideon People A new solution for precise visitor counting by Ivideon Get Ivideon Why use a ivideon people? Increase staff effectiveness Using analytics, you can better motivate your salespeople and plan sales to match visitor flows, as well as make informed decisions with regard to under-performing employees Increase customer loyalty This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. Reduce customer disputes Statistics allow you to create the ideal shift schedule for your salespeople, optimize the space available and minimize complaints from visitors Speed up the payment process Reports on how queues form at each cash register and breakdowns for each of them can help you identify anything that may be holding back your daily revenue Get Ivideon Service options Queue registration All queues detected can be found in the queue list. The operator can find the recording in the queue's information. Detailed queue information This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. Instant queue notifications When a queue is detected, Ivideon sends an email notification to the relevant parties so they can quickly resolve the situation by opening another cash register. Reports Reports help identify peak traffic hours and queue trends while comparing problem areas at one or several locations. Who can benefit Retail outlets Monitor queues that build up at the cash registers and receive instant notifications on the need to open additional payment terminals Banks Keep an eye on employees and customer service times, boosting customer loyalty Pickup points Cut wait times for orders, plan workloads, and schedule additional staff Services Cut queue times, map shift schedules, and plan client records Interface How can I enable the ivideon people? 1 Create an Ivideon account for the service and select the \"For business\" account type 2 Connect cameras to Ivideon See the different ways to connect the cameras in your Ivideon account 3 Activate \"Ivideon People\" in your Ivideon account Go to the \"Queues\" menu, select the pricing plan and set the detection area Set up a consultation All pricing plans include the full cloud service functionality: Unlimited local archive and video export to a file Camera access for an unlimited number of users Smart notifications when motion or sound is detected Sharing videos on the website and social media Get Ivideon Trusted by 15 000+ companies around the world Cloud Video Surveillance for crypto ATMs Värdex was looking for a high quality camera system for a reasonable price that will be easy to upscale in the future. Ivideon offered a reliable camera system that allows cloud recordings to be fallen back to whenever necessary. Now, the entire process from ordering the product, installation on-site, and license activation right up to daily use has been simple and efficient. An integrated solution for a single security system It is possible to deploy Ivideon Cloud Video Surveillance using a direct camera to cloud connection from multiple sites and combine any number of geographically-distributed cameras into one system. Now, Power Design provides the option to remotely monitor regional projects from anywhere in the world. This has resulted in a considerable reduction in losses from theft and vandalism. Pizza as a worldwide reality show More than 1,130 cameras have been installed in the USA, UK, Slovenia, Estonia, and Romania. When customers order pizza, they can watch how it's prepared in real time on the pizzeria's website or in a mobile app. This increases consumer loyalty by taking advantage of the principle of public monitoring, in this case, as applied to the pizza-making process. Centralized management of branch offices Switching to cloud video surveillance allowed Henkel to implement centralized management of remote production sites and administration offices through access to a convenient shared web-based control panel. As there is no cost for cloud server support, the expenses required to own and run a video surveillance system are reduced. Key opportunities Ivideon Faces Facial recognition Facial recognition system, detection of gender, age, and emotions Ivideon counter Visitor counting More information about the number of visitors and direction of movement (entry/exit) Ivideon counter Ivideon People Automatic detection of queues in a video surveillance camera's field of vision Ivideon Cash Register Monitoring cash transactions Monitoring cash transactions and countering fraud among sales personnel Ivideon Access Control System Access control Contactless door opening with facial recognition technology Ivideon ANPR Number Plate recognition Contactless lift-gate opening with license plate recognition technology Ivideon People A new solution for precise visitor counting by Ivideon Get Ivideon A new solution for precise visitor counting by Ivideon Why use a ivideon people? Increase staff effectiveness Using analytics, you can better motivate your salespeople and plan sales to match visitor flows, as well as make informed decisions with regard to under-performing employees Increase customer loyalty This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. Reduce customer disputes Statistics allow you to create the ideal shift schedule for your salespeople, optimize the space available and minimize complaints from visitors Speed up the payment process Reports on how queues form at each cash register and breakdowns for each of them can help you identify anything that may be holding back your daily revenue Why use a ivideon people? Using analytics, you can better motivate your salespeople and plan sales to match visitor flows, as well as make informed decisions with regard to under-performing employees This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. Statistics allow you to create the ideal shift schedule for your salespeople, optimize the space available and minimize complaints from visitors Speed up the payment process Reports on how queues form at each cash register and breakdowns for each of them can help you identify anything that may be holding back your daily revenue Service options Queue registration All queues detected can be found in the queue list. The operator can find the recording in the queue's information. Detailed queue information This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. Instant queue notifications When a queue is detected, Ivideon sends an email notification to the relevant parties so they can quickly resolve the situation by opening another cash register. Reports Reports help identify peak traffic hours and queue trends while comparing problem areas at one or several locations. All queues detected can be found in the queue list. The operator can find the recording in the queue's information. This solution offers detailed information on each separate queue — when it formed, how many people were in it, and a shot-by-shot breakdown. When a queue is detected, Ivideon sends an email notification to the relevant parties so they can quickly resolve the situation by opening another cash register. Reports help identify peak traffic hours and queue trends while comparing problem areas at one or several locations. Who can benefit Retail outlets Monitor queues that build up at the cash registers and receive instant notifications on the need to open additional payment terminals Banks Keep an eye on employees and customer service times, boosting customer loyalty Pickup points Cut wait times for orders, plan workloads, and schedule additional staff Services Cut queue times, map shift schedules, and plan client records Monitor queues that build up at the cash registers and receive instant notifications on the need to open additional payment terminals Keep an eye on employees and customer service times, boosting customer loyalty Cut wait times for orders, plan workloads, and schedule additional staff Cut queue times, map shift schedules, and plan client records How can I enable the ivideon people? 1 Create an Ivideon account for the service and select the \"For business\" account type 2 Connect cameras to Ivideon See the different ways to connect the cameras in your Ivideon account 3 Activate \"Ivideon People\" in your Ivideon account Go to the \"Queues\" menu, select the pricing plan and set the detection area Set up a consultation How can I enable the ivideon people? Create an Ivideon account for the service and select the \"For business\" account type Connect cameras to Ivideon See the different ways to connect the cameras in your Ivideon account Activate \"Ivideon People\" in your Ivideon account Go to the \"Queues\" menu, select the pricing plan and set the detection area All pricing plans include the full cloud service functionality: Unlimited local archive and video export to a file Camera access for an unlimited number of users Smart notifications when motion or sound is detected Sharing videos on the website and social media All pricing plans include the full cloud service functionality: Unlimited local archive and video export to a file Camera access for an unlimited number of users Smart notifications when motion or sound is detected Sharing videos on the website and social media Trusted by 15 000+ companies around the world Cloud Video Surveillance for crypto ATMs Värdex was looking for a high quality camera system for a reasonable price that will be easy to upscale in the future. Ivideon offered a reliable camera system that allows cloud recordings to be fallen back to whenever necessary. Now, the entire process from ordering the product, installation on-site, and license activation right up to daily use has been simple and efficient. An integrated solution for a single security system It is possible to deploy Ivideon Cloud Video Surveillance using a direct camera to cloud connection from multiple sites and combine any number of geographically-distributed cameras into one system. Now, Power Design provides the option to remotely monitor regional projects from anywhere in the world. This has resulted in a considerable reduction in losses from theft and vandalism. Pizza as a worldwide reality show More than 1,130 cameras have been installed in the USA, UK, Slovenia, Estonia, and Romania. When customers order pizza, they can watch how it's prepared in real time on the pizzeria's website or in a mobile app. This increases consumer loyalty by taking advantage of the principle of public monitoring, in this case, as applied to the pizza-making process. Centralized management of branch offices Switching to cloud video surveillance allowed Henkel to implement centralized management of remote production sites and administration offices through access to a convenient shared web-based control panel. As there is no cost for cloud server support, the expenses required to own and run a video surveillance system are reduced. Trusted by 15 000+ companies around the world Key opportunities Ivideon Faces Facial recognition Facial recognition system, detection of gender, age, and emotions Ivideon counter Visitor counting More information about the number of visitors and direction of movement (entry/exit) Ivideon counter Ivideon People Automatic detection of queues in a video surveillance camera's field of vision Ivideon Cash Register Monitoring cash transactions Monitoring cash transactions and countering fraud among sales personnel Ivideon Access Control System Access control Contactless door opening with facial recognition technology Ivideon ANPR Number Plate recognition Contactless lift-gate opening with license plate recognition technology Facial recognition system, detection of gender, age, and emotions More information about the number of visitors and direction of movement (entry/exit) Automatic detection of queues in a video surveillance camera's field of vision Monitoring cash transactions and countering fraud among sales personnel Ivideon Access Control System Contactless door opening with facial recognition technology Contactless lift-gate opening with license plate recognition technology",
    "Ivideon: video surveillance for offices An Ivideon-based surveillance system for offices lets you: Why should your office go for an Ivideon solution? Where should you install your cameras? Why there? Work areas: offices and open spaces Hallways, stairs, kitchens, gyms",
    "Ivideon: video surveillance for lobbies An Ivideon-based surveillance system for lobbies lets you: What can Ivideon do for your lobbies? Where should you install your cameras? Why there? Lobby: cameras installed across from elevators and mailboxes In the stairwell or vestibule",
    "Ivideon: auto repair center video surveillance An Ivideon-based surveillance system for auto repair centers lets you: Why should your auto repair center go for an Ivideon solution? Where should you install your cameras? Why there? At the reception desk, in the cashier area"
  ]
}