{
  "company": "www.filmetrics.com.ph",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 20,
    "-1": 13
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 13,
      "0": 20
    }
  },
  "sample_docs": [
    "myCARD SYSTEM myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. The card integrates into a database creating a secure platform that makes the distribution of LGU Financial Benefits such as SAP, Senior Citizen's Allowance, Scholarship, and Medical Benefits seamless. FEATURES No Duplicate/Inconsistent Records Seamless Integration to Existing Systems Promote Financial Inclusion Easy to Access Data Efficient Disbursement of Benefits Verifiable and Trustworthy Identification Safe and Secure Database Proof of Residency Manage Your Card myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. The card integrates into a database creating a secure platform that makes the distribution of LGU Financial Benefits such as SAP, Senior Citizen's Allowance, Scholarship, and Medical Benefits seamless. FEATURES No Duplicate/Inconsistent Records Seamless Integration to Existing Systems Promote Financial Inclusion Easy to Access Data Efficient Disbursement of Benefits Verifiable and Trustworthy Identification Safe and Secure Database Proof of Residency Manage Your Card myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. The card integrates into a database creating a secure platform that makes the distribution of LGU Financial Benefits such as SAP, Senior Citizen's Allowance, Scholarship, and Medical Benefits seamless. FEATURES No Duplicate/Inconsistent Records Seamless Integration to Existing Systems Promote Financial Inclusion Easy to Access Data Efficient Disbursement of Benefits Verifiable and Trustworthy Identification Safe and Secure Database Proof of Residency Manage Your Card myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. The card integrates into a database creating a secure platform that makes the distribution of LGU Financial Benefits such as SAP, Senior Citizen's Allowance, Scholarship, and Medical Benefits seamless. Seamless Integration to Existing Systems Easy to Access Data Efficient Disbursement of Benefits Verifiable and Trustworthy Identification Safe and Secure Database",
    "WHAT IS SMART VIEW? SmartView is a top-of-the-line identity management solution that offers high-quality facial recognition software. It boasts the ability to automatically detect, recognize, and interpret facial data through live video streams. SmartView provides a wide variety of solutions to complex problems. MAIN FEATURES Live Video Stream Enabled Detect and recognize facial data through live video steams Seamless Integration Able to detect up to 99% of available IP Cameras and caters to a variety of platforms such as mobile and desktop Data interpretation Estimates age, gender and emotion User-Friendly Its interface was built for the convenience of the end-user cutting the learning curve to none High Accuracy Authenticate identity of a person with high accuracy, easily recognizes and detects partially covered faces Data Collection Collect, authenticate and consolidate facial data automatically, creates database and reports Keeping a smart eye on things WHAT IS SMART VIEW? SmartView is a top-of-the-line identity management solution that offers high-quality facial recognition software. It boasts the ability to automatically detect, recognize, and interpret facial data through live video streams. SmartView provides a wide variety of solutions to complex problems. MAIN FEATURES Live Video Stream Enabled Detect and recognize facial data through live video steams Seamless Integration Able to detect up to 99% of available IP Cameras and caters to a variety of platforms such as mobile and desktop Data interpretation Estimates age, gender and emotion User-Friendly Its interface was built for the convenience of the end-user cutting the learning curve to none High Accuracy Authenticate identity of a person with high accuracy, easily recognizes and detects partially covered faces Data Collection Collect, authenticate and consolidate facial data automatically, creates database and reports WHAT IS SMART VIEW? SmartView is a top-of-the-line identity management solution that offers high-quality facial recognition software. It boasts the ability to automatically detect, recognize, and interpret facial data through live video streams. SmartView provides a wide variety of solutions to complex problems. MAIN FEATURES Live Video Stream Enabled Detect and recognize facial data through live video steams Seamless Integration Able to detect up to 99% of available IP Cameras and caters to a variety of platforms such as mobile and desktop Data interpretation Estimates age, gender and emotion User-Friendly Its interface was built for the convenience of the end-user cutting the learning curve to none High Accuracy Authenticate identity of a person with high accuracy, easily recognizes and detects partially covered faces Data Collection Collect, authenticate and consolidate facial data automatically, creates database and reports WHAT IS SMART VIEW? SmartView is a top-of-the-line identity management solution that offers high-quality facial recognition software. It boasts the ability to automatically detect, recognize, and interpret facial data through live video streams. SmartView provides a wide variety of solutions to complex problems. Live Video Stream Enabled Detect and recognize facial data through live video steams Able to detect up to 99% of available IP Cameras and caters to a variety of platforms such as mobile and desktop Estimates age, gender and emotion Its interface was built for the convenience of the end-user cutting the learning curve to none Authenticate identity of a person with high accuracy, easily recognizes and detects partially covered faces Collect, authenticate and consolidate facial data automatically, creates database and reports Keeping a smart eye on things Keeping a smart eye on things",
    "CONNECTING IDENTITIES Filmetrics Corporation is your trusted technology partner that brings together biometrics, mobile systems, and data analytics to produce secure business solutions for all your work units anytime, anywhere.​ OUR SERVICES MANAGED SERVICE SOFTWARE DEVELOPMENT SYSTEM INTEGRATION Provides additional support to companies and organizations requiring employee and service enhancement. Provides tailor-fit solutions to unique problems through the development of software. Provides solutions that are highly configurable for easy integration with existing company systems. Our Services Our Solutions OUR SOLUTIONS lilo Your on-the-go Facial Biometrics Time and Attendance system. It ensures accurate time tracking and location verification using GPS. PREMAN Web-based system that automates and manages HR needs. It improves planning, decision-making, and productivity. eProktor eProktor is designed to help educational institutions and educators in ensuring the integrity of assessments of various educational activities, such as examinations, by capturing real-time participant action and output in an online / remote setting. SMART VIEW An advanced recognition software capable of capturing and authenticating faces through live video streams. IDENT PRO Streamlines identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS myCARD myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. iServ Biometrics-enabled Verification System that ensures the integrity of a person's identity that is perfect for Local Government Units ACE TAG Provides an efficient and flexible platform to customize and organize asset management. ASSET MANAGEMENT Managing company assets and resources through automation, tracking, and process streamlining. PRODUCTIVITY MANAGEMENT Productivity Management services optimize employee productivity through automation and monitoring. SECURITY SYSTEMS Our security systems ensure people's identity and secure company assets through identification and monitoring. OUR CLIENTS OUR MILESTONES CONNECTING IDENTITIES Filmetrics Corporation is your trusted technology partner that brings together biometrics, mobile systems, and data analytics to produce secure business solutions for all your work units anytime, anywhere.​ Filmetrics Corporation is your trusted technology partner that brings together biometrics, mobile systems, and data analytics to produce secure business solutions for all your work units anytime, anywhere.​ OUR SERVICES MANAGED SERVICE SOFTWARE DEVELOPMENT SYSTEM INTEGRATION Provides additional support to companies and organizations requiring employee and service enhancement. Provides tailor-fit solutions to unique problems through the development of software. Provides solutions that are highly configurable for easy integration with existing company systems. Our Services OUR SERVICES MANAGED SERVICE SOFTWARE DEVELOPMENT SYSTEM INTEGRATION Provides additional support to companies and organizations requiring employee and service enhancement. Provides tailor-fit solutions to unique problems through the development of software. Provides solutions that are highly configurable for easy integration with existing company systems. Provides additional support to companies and organizations requiring employee and service enhancement. Provides tailor-fit solutions to unique problems through the development of software. Provides solutions that are highly configurable for easy integration with existing company systems. Our Solutions OUR SOLUTIONS lilo Your on-the-go Facial Biometrics Time and Attendance system. It ensures accurate time tracking and location verification using GPS. PREMAN Web-based system that automates and manages HR needs. It improves planning, decision-making, and productivity. eProktor eProktor is designed to help educational institutions and educators in ensuring the integrity of assessments of various educational activities, such as examinations, by capturing real-time participant action and output in an online / remote setting. SMART VIEW An advanced recognition software capable of capturing and authenticating faces through live video streams. IDENT PRO Streamlines identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS myCARD myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. iServ Biometrics-enabled Verification System that ensures the integrity of a person's identity that is perfect for Local Government Units ACE TAG Provides an efficient and flexible platform to customize and organize asset management. ASSET MANAGEMENT Managing company assets and resources through automation, tracking, and process streamlining. PRODUCTIVITY MANAGEMENT Productivity Management services optimize employee productivity through automation and monitoring. SECURITY SYSTEMS Our security systems ensure people's identity and secure company assets through identification and monitoring. OUR SOLUTIONS lilo Your on-the-go Facial Biometrics Time and Attendance system. It ensures accurate time tracking and location verification using GPS. PREMAN Web-based system that automates and manages HR needs. It improves planning, decision-making, and productivity. eProktor eProktor is designed to help educational institutions and educators in ensuring the integrity of assessments of various educational activities, such as examinations, by capturing real-time participant action and output in an online / remote setting. SMART VIEW An advanced recognition software capable of capturing and authenticating faces through live video streams. IDENT PRO Streamlines identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS myCARD myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. iServ Biometrics-enabled Verification System that ensures the integrity of a person's identity that is perfect for Local Government Units ACE TAG Provides an efficient and flexible platform to customize and organize asset management. ASSET MANAGEMENT Managing company assets and resources through automation, tracking, and process streamlining. PRODUCTIVITY MANAGEMENT Productivity Management services optimize employee productivity through automation and monitoring. SECURITY SYSTEMS Our security systems ensure people's identity and secure company assets through identification and monitoring. Your on-the-go Facial Biometrics Time and Attendance system. It ensures accurate time tracking and location verification using GPS. Web-based system that automates and manages HR needs. It improves planning, decision-making, and productivity. eProktor is designed to help educational institutions and educators in ensuring the integrity of assessments of various educational activities, such as examinations, by capturing real-time participant action and output in an online / remote setting. An advanced recognition software capable of capturing and authenticating faces through live video streams. Streamlines identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS myCARD is a multi-purpose identity and financial card. Specifically designed to automate and streamline LGU processes. Biometrics-enabled Verification System that ensures the integrity of a person's identity that is perfect for Local Government Units Provides an efficient and flexible platform to customize and organize asset management. Managing company assets and resources through automation, tracking, and process streamlining. Productivity Management services optimize employee productivity through automation and monitoring. Our security systems ensure people's identity and secure company assets through identification and monitoring.",
    "WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Fingerprint & Facial Image Capture MEMBERS VERIFICATION Confirm Accuracy of Member Details PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manage Physical Access Rights, Privileges, & Movements Between Zones BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purpose solutions WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Registration of Customer Biometrics Identity MEMBERS VERIFICATION Confirm Authenticity of Member's Identity PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manages Access Privileges for Safety and Security BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purposesolutions OUR WORKFLOW IDENTITY SOLUTIONS PROVIDER FOR Bank & Financial Industries Provide Safe and Secure eKYC and Access to Bank Services. Healthcare Registration of Customer Biometrics Identity Defense & Intelligence Provide Access to Information & Resources Law Enforcement Administer Prisoner Identities & Jail Management Human Resources On-boarding of New Employees Border Control Identify Illegal Immigrants & Unauthorized Travel or Trade Local Government Unit Establish Secure Database and Provide Smart City Solutions Service Providers Enrollment & Verification for New Customers Securing Identities Building Trust Everywhere WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Fingerprint & Facial Image Capture MEMBERS VERIFICATION Confirm Accuracy of Member Details PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manage Physical Access Rights, Privileges, & Movements Between Zones BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purpose solutions WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Registration of Customer Biometrics Identity MEMBERS VERIFICATION Confirm Authenticity of Member's Identity PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manages Access Privileges for Safety and Security BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purposesolutions OUR WORKFLOW IDENTITY SOLUTIONS PROVIDER FOR Bank & Financial Industries Provide Safe and Secure eKYC and Access to Bank Services. Healthcare Registration of Customer Biometrics Identity Defense & Intelligence Provide Access to Information & Resources Law Enforcement Administer Prisoner Identities & Jail Management Human Resources On-boarding of New Employees Border Control Identify Illegal Immigrants & Unauthorized Travel or Trade Local Government Unit Establish Secure Database and Provide Smart City Solutions Service Providers Enrollment & Verification for New Customers WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Fingerprint & Facial Image Capture MEMBERS VERIFICATION Confirm Accuracy of Member Details PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manage Physical Access Rights, Privileges, & Movements Between Zones BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purpose solutions WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS Fingerprint & Facial Image Capture Confirm Accuracy of Member Details Manage Physical Access Rights, Privileges, & Movements Between Zones IDENT Pro evaluates, designs & implements fit-for-purpose solutions WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS PROFESSIONAL SERVICES ONBOARDING Registration of Customer Biometrics Identity MEMBERS VERIFICATION Confirm Authenticity of Member's Identity PROOF OF LIFE Verification of Liveness ACCESS CONTROL Manages Access Privileges for Safety and Security BEST FIT SOLUTION IDENT Pro evaluates, designs & implements fit-for-purposesolutions OUR WORKFLOW IDENTITY SOLUTIONS PROVIDER FOR Bank & Financial Industries Provide Safe and Secure eKYC and Access to Bank Services. Healthcare Registration of Customer Biometrics Identity Defense & Intelligence Provide Access to Information & Resources Law Enforcement Administer Prisoner Identities & Jail Management Human Resources On-boarding of New Employees Border Control Identify Illegal Immigrants & Unauthorized Travel or Trade Local Government Unit Establish Secure Database and Provide Smart City Solutions Service Providers Enrollment & Verification for New Customers WHAT IS IDENT PRO? IDENT Pro helps businesses streamline identity-dependent processes by boosting certainty in the identification of people through reliable BIOMETRIC IDENTITY MANAGEMENT SOLUTIONS Registration of Customer Biometrics Identity Confirm Authenticity of Member's Identity Manages Access Privileges for Safety and Security IDENT Pro evaluates, designs & implements fit-for-purposesolutions Bank & Financial Industries Provide Safe and Secure eKYC and Access to Bank Services. Registration of Customer Biometrics Identity Provide Access to Information & Resources Administer Prisoner Identities & Jail Management On-boarding of New Employees Identify Illegal Immigrants & Unauthorized Travel or Trade Establish Secure Database and Provide Smart City Solutions Enrollment & Verification for New Customers Securing Identities Building Trust Everywhere Securing Identities Building Trust Everywhere",
    "HRIS & Payroll Subscription Agreement This Agreement relates only to HRIS & Payroll subscription provided by FILMETRICS CORPORATION and shall be in effect from and after the actual activation of the system. By subscribing to HRIS & Payroll services (the \"Services\") provided by Filmetrics Corporation in relation with HRIS & Payroll System (the \"Software\"), hosted on Cloud platform you (the \"Customer\") are agreeing to be bound by the following (the \"Agreement\"). ​ Subscription a. Subscription: The subscription to the product provides access to HRIS & Payroll on a subscription basis for a specified term. b. Term: The term of the subscription will be specified based on the number of months, contracted. The subscription will automatically renew for successive unless terminated by either party in accordance with these . c. Payment: You agree to pay the subscription fee for HRIS & Payroll equivalent to the number of months, contract. The subscription fee is non-refundable. ​ 2. Use of HRIS & Payroll Subscription Service a. Access: You are granted a limited, non-exclusive, non-transferable access and use of HRIS & Payroll during the term of your subscription. b. Restrictions: You may not copy, modify, distribute, sell, or lease any portion of product. You may not reverse engineer, decompile, or disassemble the product or attempt to discover any source code or underlying ideas or algorithms of HRIS & Payroll subscription service. c .User Content: You are responsible for all content that you upload, post, email, or otherwise transmit to or through HRIS & Payroll subscription service. You warrant that you have all necessary rights to such content and that the use of such content by HRIS & Payroll subscription service will not infringe any third party rights. ​ d. Onboarding: Includes 3 hours for 3 consecutive days of training and open discussion. Filmetrics will offer dedicated 1 hour daily Hypercare Support to Customers valid for two weeks after the onboarding session. This support must be scheduled in advance and cancellation must be done with 1 day notice. ​ e. Support: HRIS & Payroll subscription service includes technical support during the term of your subscription. Service desk hotline, chat, email and remote access support are provided for system issues encounter by customers from Monday to Friday except holidays from 8am to 6pm. f. Hosting: The system is cloud base and access is not dedicated to client. System response will be based on the load of the system and connection of the user. g. Updates and Maintenance: Filmetrics Corporation may conduct occasional product updates and maintenance for the duration of a pre-determined window. During this time, possible downtime may occur due to maintenance and upgrades of the system. h. Warranty: HRIS & Payroll is provided \"As Is\", the product is warranted against bugs and other software glitches during the subscription period. i. Customization: Filmetrics Corporation reserves the right to accept or reject requests for customization. Furthermore, customization will incur corresponding fees at specified rate. Customized version will no longer be possible to shared hosting. A separate instance and dedicated connection will be created. ​ 3. Customer Obligation a. Pay Filmetrics the applicable charges for the Services of the present Agreement, in accordance with the payment conditions specified at the signature of this contract. ​ b. If you intend to cancel our service, kindly provide Filmetrics with advance notice before your due date. Failure to do so will result in an automatic renewal of your subscription for the following month. c. Agree to provide a primary point of contact to facilitate all communication with Filmetrics. This person will also have authority to make decisions related to the services provided by Filmetrics Corporation on behalf of the client. d. Provide written notice to Filmetrics 30 days before changing their main point of contact to work with. e. Take all reasonable measures to keep their user accounts secure, by choosing a strong password and not sharing it with anyone else. f. Acknowledges and agrees that Filmetrics is permitted to acquire personal information about the company's employees and authorized representative in connection with the use of HRIS & Payroll. Said information will be kept confidential and secure and shall not be used without the express consent of the data subject. ​ 4. Confidentiality Definition of \"Confidential Information\": Each party agrees to keep confidential all information disclosed to it by the other party that is designated in writing as confidential or that reasonably should be considered confidential given the nature of the information and the circumstances surrounding its disclosure (the \"Confidential Information\"). The receiving party shall not use or disclose any Confidential Information of the disclosing party for any purpose outside the scope of this Agreement, except with the disclosing party's prior written permission. Each party agrees to protect the confidentiality of the Confidential Information of the other party in the same manner that it protects the confidentiality of its own proprietary and confidential information of like kind, but in no event shall either party exercise less than reasonable care in protecting such Confidential Information. If the receiving party is compelled by law to disclose Confidential Information of the disclosing party, it shall provide the disclosing party with prior notice of such compelled disclosure (to the extent legally permitted) and reasonable assistance, at the disclosing party's cost, if the disclosing party wishes to contest the disclosure. The parties acknowledge that the Confidential Information may include personal data, as defined by Republic Act No. 10173, also known as the Data Privacy Act of 2012 (\"DPA\"), and that they shall comply with the provisions of the DPA and all other relevant data privacy laws and regulations in the collection, use, processing, and storage of such personal data. The parties shall implement appropriate technical, organizational, and physical measures to ensure the security and confidentiality of the personal data and to prevent unauthorized access, disclosure, or processing.\" 5. Data Protection ​ a. Definition of Personal Data: For the purposes of this clause, \"Personal Data\" refers to any information that can be used to identify an individual, including but not limited to full name, ID number, photo, email address, contact number, company name and address. b. Collection of Personal Data: We will collect Personal Data from you when you register to HRIS & Payroll subscription service. We may also collect Personal Data from other sources with your consent or where permitted by law. c. Use of Personal Data: We will use your Personal Data to provide you with our product and to improve our services. d. Disclosure of Personal Data: We may disclose your Personal Data where required by law or where necessary to protect our rights, property, or safety. e. Data Security: We will take reasonable steps to protect your Personal Data from unauthorized access, use, or disclosure. We will use industry-standard encryption and other security measures to protect your Personal Data. f. Retention of Personal Data: We will retain your Personal Data for as long as necessary to provide you with our product and to comply with our legal obligations. We will also retain your Personal Data for a reasonable period after you cease using our services in order to maintain our records. g. Changes to this Clause: We may amend this data protection clause from time to time to reflect changes in our practices or for legal reasons. We will provide you with notice of any changes and obtain your consent if required by law. ​ 6. Limitation of Liability In no event shall we be liable for any indirect, special, incidental, consequential or exemplary damages arising out or in connection with HRIS & Payroll Subscription Service, including without limitation, damages for loss of profit, loss of data, business interruption , or any other commercial damages or losses even if we have been advised of the possibility thereof. 7. Governing Law and Jurisdiction This Clause shall be governed by and construed in accordance with Philippine law. Any dispute arising out of or in connection with this Clause shall be submitted to the exclusive jurisdiction of the courts of the Philippines. 8. Entire Agreement These constitute the entire agreement between you and us with respect to the HRIS & Payroll subscription service and supersede all prior or contemporaneous communications and proposals, whether oral or written, between you and us with respect to the HRIS & Payroll subscription service. Back HRIS & Payroll Subscription Agreement This Agreement relates only to HRIS & Payroll subscription provided by FILMETRICS CORPORATION and shall be in effect from and after the actual activation of the system. By subscribing to HRIS & Payroll services (the \"Services\") provided by Filmetrics Corporation in relation with HRIS & Payroll System (the \"Software\"), hosted on Cloud platform you (the \"Customer\") are agreeing to be bound by the following (the \"Agreement\"). ​ Subscription a. Subscription: The subscription to the product provides access to HRIS & Payroll on a subscription basis for a specified term. b. Term: The term of the subscription will be specified based on the number of months, contracted. The subscription will automatically renew for successive unless terminated by either party in accordance with these . c. Payment: You agree to pay the subscription fee for HRIS & Payroll equivalent to the number of months, contract. The subscription fee is non-refundable. ​ 2. Use of HRIS & Payroll Subscription Service a. Access: You are granted a limited, non-exclusive, non-transferable access and use of HRIS & Payroll during the term of your subscription. b. Restrictions: You may not copy, modify, distribute, sell, or lease any portion of product. You may not reverse engineer, decompile, or disassemble the product or attempt to discover any source code or underlying ideas or algorithms of HRIS & Payroll subscription service. c .User Content: You are responsible for all content that you upload, post, email, or otherwise transmit to or through HRIS & Payroll subscription service. You warrant that you have all necessary rights to such content and that the use of such content by HRIS & Payroll subscription service will not infringe any third party rights. ​ d. Onboarding: Includes 3 hours for 3 consecutive days of training and open discussion. Filmetrics will offer dedicated 1 hour daily Hypercare Support to Customers valid for two weeks after the onboarding session. This support must be scheduled in advance and cancellation must be done with 1 day notice. ​ e. Support: HRIS & Payroll subscription service includes technical support during the term of your subscription. Service desk hotline, chat, email and remote access support are provided for system issues encounter by customers from Monday to Friday except holidays from 8am to 6pm. f. Hosting: The system is cloud base and access is not dedicated to client. System response will be based on the load of the system and connection of the user. g. Updates and Maintenance: Filmetrics Corporation may conduct occasional product updates and maintenance for the duration of a pre-determined window. During this time, possible downtime may occur due to maintenance and upgrades of the system. h. Warranty: HRIS & Payroll is provided \"As Is\", the product is warranted against bugs and other software glitches during the subscription period. i. Customization: Filmetrics Corporation reserves the right to accept or reject requests for customization. Furthermore, customization will incur corresponding fees at specified rate. Customized version will no longer be possible to shared hosting. A separate instance and dedicated connection will be created. ​ 3. Customer Obligation a. Pay Filmetrics the applicable charges for the Services of the present Agreement, in accordance with the payment conditions specified at the signature of this contract. ​ b. If you intend to cancel our service, kindly provide Filmetrics with advance notice before your due date. Failure to do so will result in an automatic renewal of your subscription for the following month. c. Agree to provide a primary point of contact to facilitate all communication with Filmetrics. This person will also have authority to make decisions related to the services provided by Filmetrics Corporation on behalf of the client. d. Provide written notice to Filmetrics 30 days before changing their main point of contact to work with. e. Take all reasonable measures to keep their user accounts secure, by choosing a strong password and not sharing it with anyone else. f. Acknowledges and agrees that Filmetrics is permitted to acquire personal information about the company's employees and authorized representative in connection with the use of HRIS & Payroll. Said information will be kept confidential and secure and shall not be used without the express consent of the data subject. ​ 4. Confidentiality Definition of \"Confidential Information\": Each party agrees to keep confidential all information disclosed to it by the other party that is designated in writing as confidential or that reasonably should be considered confidential given the nature of the information and the circumstances surrounding its disclosure (the \"Confidential Information\"). The receiving party shall not use or disclose any Confidential Information of the disclosing party for any purpose outside the scope of this Agreement, except with the disclosing party's prior written permission. Each party agrees to protect the confidentiality of the Confidential Information of the other party in the same manner that it protects the confidentiality of its own proprietary and confidential information of like kind, but in no event shall either party exercise less than reasonable care in protecting such Confidential Information. If the receiving party is compelled by law to disclose Confidential Information of the disclosing party, it shall provide the disclosing party with prior notice of such compelled disclosure (to the extent legally permitted) and reasonable assistance, at the disclosing party's cost, if the disclosing party wishes to contest the disclosure. The parties acknowledge that the Confidential Information may include personal data, as defined by Republic Act No. 10173, also known as the Data Privacy Act of 2012 (\"DPA\"), and that they shall comply with the provisions of the DPA and all other relevant data privacy laws and regulations in the collection, use, processing, and storage of such personal data. The parties shall implement appropriate technical, organizational, and physical measures to ensure the security and confidentiality of the personal data and to prevent unauthorized access, disclosure, or processing.\" 5. Data Protection ​ a. Definition of Personal Data: For the purposes of this clause, \"Personal Data\" refers to any information that can be used to identify an individual, including but not limited to full name, ID number, photo, email address, contact number, company name and address. b. Collection of Personal Data: We will collect Personal Data from you when you register to HRIS & Payroll subscription service. We may also collect Personal Data from other sources with your consent or where permitted by law. c. Use of Personal Data: We will use your Personal Data to provide you with our product and to improve our services. d. Disclosure of Personal Data: We may disclose your Personal Data where required by law or where necessary to protect our rights, property, or safety. e. Data Security: We will take reasonable steps to protect your Personal Data from unauthorized access, use, or disclosure. We will use industry-standard encryption and other security measures to protect your Personal Data. f. Retention of Personal Data: We will retain your Personal Data for as long as necessary to provide you with our product and to comply with our legal obligations. We will also retain your Personal Data for a reasonable period after you cease using our services in order to maintain our records. g. Changes to this Clause: We may amend this data protection clause from time to time to reflect changes in our practices or for legal reasons. We will provide you with notice of any changes and obtain your consent if required by law. ​ 6. Limitation of Liability In no event shall we be liable for any indirect, special, incidental, consequential or exemplary damages arising out or in connection with HRIS & Payroll Subscription Service, including without limitation, damages for loss of profit, loss of data, business interruption , or any other commercial damages or losses even if we have been advised of the possibility thereof. 7. Governing Law and Jurisdiction This Clause shall be governed by and construed in accordance with Philippine law. Any dispute arising out of or in connection with this Clause shall be submitted to the exclusive jurisdiction of the courts of the Philippines. 8. Entire Agreement These constitute the entire agreement between you and us with respect to the HRIS & Payroll subscription service and supersede all prior or contemporaneous communications and proposals, whether oral or written, between you and us with respect to the HRIS & Payroll subscription service. Back HRIS & Payroll Subscription Agreement This Agreement relates only to HRIS & Payroll subscription provided by FILMETRICS CORPORATION and shall be in effect from and after the actual activation of the system. By subscribing to HRIS & Payroll services (the \"Services\") provided by Filmetrics Corporation in relation with HRIS & Payroll System (the \"Software\"), hosted on Cloud platform you (the \"Customer\") are agreeing to be bound by the following (the \"Agreement\"). a. Subscription: The subscription to the product provides access to HRIS & Payroll on a subscription basis for a specified term. b. Term: The term of the subscription will be specified based on the number of months, contracted. The subscription will automatically renew for successive unless terminated by either party in accordance with these . c. Payment: You agree to pay the subscription fee for HRIS & Payroll equivalent to the number of months, contract. The subscription fee is non-refundable. 2. Use of HRIS & Payroll Subscription Service a. Access: You are granted a limited, non-exclusive, non-transferable access and use of HRIS & Payroll during the term of your subscription. b. Restrictions: You may not copy, modify, distribute, sell, or lease any portion of product. You may not reverse engineer, decompile, or disassemble the product or attempt to discover any source code or underlying ideas or algorithms of HRIS & Payroll subscription service. c .User Content: You are responsible for all content that you upload, post, email, or otherwise transmit to or through HRIS & Payroll subscription service. You warrant that you have all necessary rights to such content and that the use of such content by HRIS & Payroll subscription service will not infringe any third party rights. d. Onboarding: Includes 3 hours for 3 consecutive days of training and open discussion. Filmetrics will offer dedicated 1 hour daily Hypercare Support to Customers valid for two weeks after the onboarding session. This support must be scheduled in advance and cancellation must be done with 1 day notice. e. Support: HRIS & Payroll subscription service includes technical support during the term of your subscription. Service desk hotline, chat, email and remote access support are provided for system issues encounter by customers from Monday to Friday except holidays from 8am to 6pm. f. Hosting: The system is cloud base and access is not dedicated to client. System response will be based on the load of the system and connection of the user. g. Updates and Maintenance: Filmetrics Corporation may conduct occasional product updates and maintenance for the duration of a pre-determined window. During this time, possible downtime may occur due to maintenance and upgrades of the system. h. Warranty: HRIS & Payroll is provided \"As Is\", the product is warranted against bugs and other software glitches during the subscription period. i. Customization: Filmetrics Corporation reserves the right to accept or reject requests for customization. Furthermore, customization will incur corresponding fees at specified rate. Customized version will no longer be possible to shared hosting. A separate instance and dedicated connection will be created. a. Pay Filmetrics the applicable charges for the Services of the present Agreement, in accordance with the payment conditions specified at the signature of this contract. b. If you intend to cancel our service, kindly provide Filmetrics with advance notice before your due date. Failure to do so will result in an automatic renewal of your subscription for the following month. c. Agree to provide a primary point of contact to facilitate all communication with Filmetrics. This person will also have authority to make decisions related to the services provided by Filmetrics Corporation on behalf of the client. d. Provide written notice to Filmetrics 30 days before changing their main point of contact to work with. e. Take all reasonable measures to keep their user accounts secure, by choosing a strong password and not sharing it with anyone else. f. Acknowledges and agrees that Filmetrics is permitted to acquire personal information about the company's employees and authorized representative in connection with the use of HRIS & Payroll. Said information will be kept confidential and secure and shall not be used without the express consent of the data subject. Definition of \"Confidential Information\": Each party agrees to keep confidential all information disclosed to it by the other party that is designated in writing as confidential or that reasonably should be considered confidential given the nature of the information and the circumstances surrounding its disclosure (the \"Confidential Information\"). The receiving party shall not use or disclose any Confidential Information of the disclosing party for any purpose outside the scope of this Agreement, except with the disclosing party's prior written permission. Each party agrees to protect the confidentiality of the Confidential Information of the other party in the same manner that it protects the confidentiality of its own proprietary and confidential information of like kind, but in no event shall either party exercise less than reasonable care in protecting such Confidential Information. If the receiving party is compelled by law to disclose Confidential Information of the disclosing party, it shall provide the disclosing party with prior notice of such compelled disclosure (to the extent legally permitted) and reasonable assistance, at the disclosing party's cost, if the disclosing party wishes to contest the disclosure. The parties acknowledge that the Confidential Information may include personal data, as defined by Republic Act No. 10173, also known as the Data Privacy Act of 2012 (\"DPA\"), and that they shall comply with the provisions of the DPA and all other relevant data privacy laws and regulations in the collection, use, processing, and storage of such personal data. The parties shall implement appropriate technical, organizational, and physical measures to ensure the security and confidentiality of the personal data and to prevent unauthorized access, disclosure, or processing.\" a. Definition of Personal Data: For the purposes of this clause, \"Personal Data\" refers to any information that can be used to identify an individual, including but not limited to full name, ID number, photo, email address, contact number, company name and address. b. Collection of Personal Data: We will collect Personal Data from you when you register to HRIS & Payroll subscription service. We may also collect Personal Data from other sources with your consent or where permitted by law. c. Use of Personal Data: We will use your Personal Data to provide you with our product and to improve our services. d. Disclosure of Personal Data: We may disclose your Personal Data where required by law or where necessary to protect our rights, property, or safety. e. Data Security: We will take reasonable steps to protect your Personal Data from unauthorized access, use, or disclosure. We will use industry-standard encryption and other security measures to protect your Personal Data. f. Retention of Personal Data: We will retain your Personal Data for as long as necessary to provide you with our product and to comply with our legal obligations. We will also retain your Personal Data for a reasonable period after you cease using our services in order to maintain our records. g. Changes to this Clause: We may amend this data protection clause from time to time to reflect changes in our practices or for legal reasons. We will provide you with notice of any changes and obtain your consent if required by law. 6. Limitation of Liability In no event shall we be liable for any indirect, special, incidental, consequential or exemplary damages arising out or in connection with HRIS & Payroll Subscription Service, including without limitation, damages for loss of profit, loss of data, business interruption , or any other commercial damages or losses even if we have been advised of the possibility thereof. 7. Governing Law and Jurisdiction This Clause shall be governed by and construed in accordance with Philippine law. Any dispute arising out of or in connection with this Clause shall be submitted to the exclusive jurisdiction of the courts of the Philippines. These constitute the entire agreement between you and us with respect to the HRIS & Payroll subscription service and supersede all prior or contemporaneous communications and proposals, whether oral or written, between you and us with respect to the HRIS & Payroll subscription service."
  ]
}