{
  "company": "www.singlewire.com",
  "dominant_topics": [
    9,
    0
  ],
  "topic_counts": {
    "9": 11,
    "0": 1
  },
  "topic_descriptions": {
    "9": "gsm, gprs, wireless, cdma, rf",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.1,
    "framing_market": 0.9,
    "num_docs": 12
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "9": 11
    }
  },
  "sample_docs": [
    "Solutions K-12 Education Higher Education Healthcare Government Business Products InformaCast InformaCast CK DORA Endpoints RemotePhoneControl PushToTalk Partners Reseller Program Lead Referral Program Development Program Technology Program Learn Case Studies Podcasts Upcoming Events Support InformaCast Support InformaCast CK Support IP Speakers Support DORA Support Desktop Notification Support RemotePhoneControl Support PushToTalk Support About Us Executive Bios Press Releases Announcements In The News Careers Content on this page requires a newer version of Adobe Flash Player. Flexible notification through intelligent detection. Recent News from Singlewire Singlewire InformaCast Software is implemented in over 2000 organizations in 35 countries worldwide. Privacy Statement | copyright - Singlewire Software, LLC",
    "Solutions | Products | Partners | Resources | Support | Company InformaCast for Schools - PDF InformaCast and SchoolMessenger - PDF InformaCast CallAware - PDF Read Recent Singlewire Higher-Ed News Cisco Notifi-ED for Higher Ed featuring InformaCast Singlewire Solutions for Higher Education A Proven Solution for Campus Emergency Notification In the event of an emergency, sending notification to students, staff, and the public can be a complex task. Reaching cell phones, email, overhead paging systems, on premise phones and computers, sirens, display signs, and any other type of notification device with a single message is critical. Having a robust network and one integrated system in place to manage these communication channels is just as important as having effective policy, protocols and public safety officials ready to react and execute on a plan. Our solution provides your organization the means to handle emergency communications from one central, secure and easy to use interface. We leverage your existing network infrastructure and tie together your internal and on-premises systems and end points along with the systems outside your organization such as phone dialers and sms messaging providing you one control point to reach all people and all potential endpoints with one procedure. Key benefits of our solution include: Centrally manage IP-overhead paging system leveraging Cisco network and Unified Communications infrastructure. Immediately send emergency notification to your entire organization via a secure web interface Send notifications to targeted groups by aligning it with your established communications plan. Powerful audio and/or text paging to any combination of Cisco IP phones, desktops (PC's, Mac, Linux), Power over Ethernet speakers, and a gateway to legacy analog paging systems. Administrative simplicity for establishing paging zones and end-user groups Easily connect with off-premises notification systems like SMS text messaging, voice mail systems, email systems and social networking systems including Twitter using our API scripting feature A scalable solution with multicast enabled IP data network for reliability and performance when it matters most Realize cost savings by consolidating to your IP data network Our proven, enterprise solution is implemented in colleges and universities around the world. We invite you to about our solution by following the links on this page or visiting us at www.singlewire.com/talkwithus . Privacy Statement | copyright - Singlewire Software, LLC",
    "Solutions | Products | Partners | Resources | Support | Company Singlewire Solutions for Government The expectation of internal communication and overhead paging has changed. Meeting these new communication needs with disparate networks and infrastructure can be a real challenge. Maintenance and support of legacy systems with staff and external vendors can be equally troublesome. Our solution provides your agency the means to comprehensive paging and handle emergency communications from one central, secure and easy to use interface. We integrate with your existing IT infrastructure allowing you to consolidate to one network for cost savings and improve access to paging end points such as phones, desktops, IP speakers, digital sign age, clocks, and also provide the means of sending overhead pages to legacy intercom systems if you already have them in place. Â Key benefits of our solution include: Centrally managed IP paging system leveraging your Cisco network and Unified Communications infrastructure. Immediately send emergency notification to your entire organization via a secure web interface or target a specific building or area. Send notifications to targeted groups by aligning it with your established communications plan. Powerful audio and/or text paging to any combination of Cisco IP phones, desktops (PC's, Mac, Linux), digital signs, PoE Power over Ethernet speakers, and a gateway to legacy analog paging systems. Administrative simplicity for establishing paging zones, end-user groups and quite floor initiatives within your facilities. Easily create separate zones for paging to only public areas Asset tracking within your organization using RFID technology with the ability to trigger automatic notification to staff and systems Easily connect with off-premises notification systems like SMS text messaging, voice mail systems, email systems and social networking systems including Twitter using our API scripting feature Connect with cross jurisdictional agencies to establish a regional notification strategy A scalable solution with multicast enabled IP data network to ensure reliability and performance Realize cost savings by consolidating to one IP data network Our proven, enterprise solution is implemented in local, state and federal government agencies throughout the country. We invite you to about our solution by following the links on this page or visiting us at www.singlewire.com/talkwithus . Privacy Statement | copyright - Singlewire Software, LLC",
    "Solutions | Products | Partners | Resources | Support | About Us Submit Request for Online Support Phone - Technical Support Phone - (608) 661-1140 - Option 2 Please provide your contact information below and someone from our team will contact you shortly. Privacy Statement | copyright - Singlewire Software, LLC",
    "Solutions | Products | Partners | Resources | Support | Company InformaCast and Complimentary Apps - PDF Singlewire Solutions for Financial Services - PDF Singlewire Solutions for Manufacturing - PDF Singlewire Solutions for Business Business Notification Software for Emergency Communication and Paging Sending and receiving notifications within your business can be many different things. Balancing the need for overhead paging while delivering notification to a wide variety of endpoint devices including pagers, phones, and desktops, and overhead speakers can be complex. Finding ways of monitoring and automating business processes leveraging your network can save you time and money while allowing your staff to focus on the business. The Singlewire Software business solution provides your organization with a flexible and effective means for overhead paging, sending notifications and automating business processes. Key benefits to our enterprise-class solution include: Centrally manage IP-overhead paging system leveraging Cisco network and Unified Communications infrastructure Powerful audio and/or text paging to any combination of Cisco IP phones, desktops (PC's, Mac, Linux), PoE Power over Ethernet speakers, and a gateway to legacy analog paging systems Administrative simplicity for establishing paging zones, end-user groups and quite floor initiatives within your facilities Ease of use and powerful distribution groups allow you to page any logical group such as all branch managers across the enterprise Asset and people tracking within your organization using RFID technology with the ability to trigger automatic notification to staff and systems Remotely monitor virtually any IP enabled device on your network and set a trigger to send notification to staff when abnormal operation is detected Scalable solution with multicast enabled IP data network for reliability and performance along with bandwidth efficiency Central manage communication plan and policies for all emergency event responses Day to day means to ensure forced notification of staff to any business issue about how our solutions can help your enterprise. Click the links on the right side of the page to , or visit us at www.singlewire.com/talkwithus . Privacy Statement | copyright - Singlewire Software, LLC"
  ]
}