{
  "company": "www.hanko.io",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 85,
    "-1": 11
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 11,
      "0": 85
    }
  },
  "sample_docs": [
    "Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Passwordless (Hanko Default) Passwords optional Social-only Passkeys-only Passwordless with Passkeys and Passcodes Our recommendation: Modern and secure, utilizing passkeys instead of passwords. Also including a fail-safe fallback login option with passcodes and email verification during . Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username account Security 2FA Email verification Let your users decide: Passwords optional Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username Account Security 2FA Email verification Social-only Set up social logins as the only option for logins, as this has become increasingly popular lately. Decide which providers you would like to offer and add other login methods later if you want. Login methods Passkeys optional Passwords optional Passcodes OAuth login GitHub Google Identifiers Email Username Account Security 2FA Email verification Out with the old: Passkeys-only Depending on your audience, offering only passkeys for authentication can be a viable and highly secure configuration. Not every device supports passkeys yet, though, so be aware that you may exclude some of your users. Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username Account Security 2FA Email verification Use Hanko Cloud for free Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Passwordless with Passkeys and Passcodes Our recommendation: Modern and secure, utilizing passkeys instead of passwords. Also including a fail-safe fallback login option with passcodes and email verification during . Let your users decide: Passwords optional Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Set up social logins as the only option for logins, as this has become increasingly popular lately. Decide which providers you would like to offer and add other login methods later if you want. Out with the old: Passkeys-only Depending on your audience, offering only passkeys for authentication can be a viable and highly secure configuration. Not every device supports passkeys yet, though, so be aware that you may exclude some of your users. Integrated in minutes – with Hanko Elements Customizable web components that are pre-built for all authentication use cases and can be placed freely in any web app. By using web components, Hanko Elements work in any tech stack. Apply custom CSS and let Hanko Elements blend in. Add any feature you like Customize Hanko to your needs with a PR or Fork on GitHub. The lock of your front door. Easy to use, yet sophisticated and secure. A pre-built security control center for your users to manage their credentials. Alex MacCaw @maccaw Passkeys is a new authentication technology which is poised to remove the need for passwords. Check out passkeys.io and @hanko_io for more info! Martin Steven SVP Product, Volt.io \"Hanko allowed us to roll out passkey-based 2FA in a matter of days.\" Nicolas Gimenez Co-Founder & CTO @zkorumhq \"The Hanko Elements workflow on the web is excellent and incredibly easy to integrate with. I've used Auth0 & Firebase Authentication in the past, both of them are way more complicated to integrate & understand.\" Peer Richelsen @peer_rich Super cool. Hanko: Open source alternative to Auth0 and Clerk with passkey superpowers. James Xu Co-Founder & CTO, kangaroo \"Great product – I'm loving it.\" Marc Seitz Founder & CEO, Papermark \"Thanks to Hanko and their Next-Auth provider, adding passkeys to your application has never been easier.\" Stefan Weiß Co-Founder & CTO, Cure Digital Finance GmbH \"Hanko's simple yet future-proof authentication solution quickly convinced us when building our vertical bank. Customer-centric and frictionless, but at the same time fulfilling our advanced PSD2 requirements.\" Pedro Sanders @pedrosanders_ This weekend I plan to try Passkeys by @hanko.io . I'm excited to get a hint at a passwordless future. The best thing about this tool? It is Open Source 🙇 Thilo Brandt Senior Director, Head of Universal Capabilities, SAP \"The development effort for introducing passkeys was significantly reduced through the use of Hanko.\" Adrian van Putten @ProgrammerDude I really ejoyed integrating hanko.io tim cappaskey @timcappalli Check out @hanko.io ! An open-source, developer focused, passkey centric authentication stack! Love to see it. Daniel Rotzetter Co-Founder & Engineering Lead, Mementor \"We have been using Hanko as provider for passwordless login for over two years now. From the onboarding to this day, Hanko was always a very helpful and reliable partner with an impeccable support team.\" Darren Crossley Head of Software Development, Agrantis \"I wanted to say how amazing the Hanko system is. The experience for developers and users is so far ahead of anything else I found in the identity / authentication space.\" Passkey API Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading, FIDO2-certified passkey infrastructure. about Passkey API Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading, FIDO2-certified passkey infrastructure. No vendor lock-in or lost data. Hanko is open source – and you can always freely migrate your data from Cloud to self-hosted and vice versa. The Complete Authentication and User Management Solution for the Passkey Era. Open Source Alternative to Clerk & Auth0.",
    "<hanko-auth> <hanko-auth> Ready-to-use registration and login UI Integrates in minutes with any web application Passkeys, email passcodes, and optional password support Fully customizable with CSS <hanko-profile> A responsive, customizable profile page Can be placed freely in your web app User self-service email & security management Place Hanko web components The Hanko custom elements are what makes the integration so simple: they can be placed anywhere on your app or website. Style the web components to fit your brand. Almost everything can be changed with pre-defined CSS classes . You want gradient buttons? Here you go. Sit back and go passwordless Hanko takes care of securing your login and guiding your users towards passwordless authentication with passkeys. You can focus on what matters: your project. Place Hanko web components The Hanko elements are what makes the integration so simple: they can be placed anywhere on your app or website. Style the web components to fit your brand. Almost everything can be changed with pre-defined CSS classes . You want gradient buttons? Here you go. Sit back and go passwordless Hanko takes care of securing your login and guiding your users towards passwordless authentication with passkeys. You can focus on what matters: your project. Secure & convenient, built for passkeys Passkeys are a new way to that works completely without passwords. By using the security capabilities of your devices like fingerprint or face recognition, passkeys are more secure and are easier to use than both passwords and all current 2-factor authentication methods. – Based on public key cryptography – Natively supported on all major platforms – Synchronized across your devices More about passkeys Secure & convenient, built for passkeys Passkeys are a new way to that works completely without passwords. By using the security capabilities of your devices like fingerprint or face recognition, passkeys are more secure and are easier to use than both passwords and all current 2-factor authentication methods. – Based on public key cryptography – Natively supported on all major platforms – Synchronized across your devices Guiding users into a passwordless world The future is passwordless – but today is not. Hanko provides a beautiful login that meets your users where they are, and carefully guides them into a world beyond passwords. Guiding users into a passwordless world The future is passwordless – but today is not. Hanko provides a beautiful login that meets your users where they are, and carefully guides them into a world beyond passwords. Managed by you, hosted by us Hanko Cloud lets you create your own Hanko projects with one click. We take care of hosting and security, while you build the best login you've ever seen. Your Hanko projects in the Cloud Get a new Hanko project up and running with one click. User management & analytics Find out who's using your product and manage their access. Audit logs Keep track of your user's authentication activities and find anomalies. Start building for free \"I wanted to say how amazing the Hanko system is. The experience for developers and users is so far ahead of anything else I found in the identity / authentication space.\" Darren Crossley Head of Software Development @ agrantis \"Hanko's simple yet future-proof authentication solution quickly convinced us when building our vertical bank. Customer-centric and frictionless, but at the same time fulfilling our advanced PSD2 requirements.\" Stefan Weiß Co-Founder & CTO at Cure Digital Finance GmbH \"With the help of Hanko, we were able to prove the feasibility of our vision for a passwordless login at SAP Universal ID in of technical implementation as well as usability on all major operating systems such as Windows, macOS, iOS, and Android.\" Michael Braun IT Chief Product Owner of Identity & User Management at SAP SE \"Great product — I'm loving it.\" James Xu Co-Founder & CTO @ kangaroo \"The development effort for introducing passwordless authentication was significantly reduced through the use of Hanko. The Hanko team helped us to successfully navigate implementing passwordless authentication into our application stack and user interfaces.\" Thilo Brandt IT Senior Manager, SAP Universal ID at SAP SE Managed by you, hosted by us Hanko Cloud lets you create your own Hanko projects with one click. We take care of hosting and security, while you build the best login you've ever seen. Your Hanko projects in the Cloud Get a new Hanko project up and running with one click. User management & analytics Find out who's using your product and manage their access. Keep track of your user's authentication activities and find anomalies. Hanko's foundation: Open source Have a look at Hanko's source code on GitHub Start building for free Hanko's foundation: Open source Have a look at Hanko's source code on GitHub",
    "Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Passwordless (Hanko Default) Passwords (The Classic) Social logins Passkeys and passcodes Our recommendation: Modern and secure, utilizing passkeys instead of passwords. It also includes a fail-safe fallback login option with passcodes and email verification during . Passkeys Passwords Passcodes OAuth Login 2FA (coming soon) Username (coming soon) Email Email verification Just passwords Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Passkeys Passwords Passcodes OAuth Login 2FA (coming soon) Username (coming soon) Email Email verification OAuth + passkeys Social logins can be added as an onboarding and authentication option and work exceptionally well when paired with passkeys. The next major release of Hanko will also allow you to set up social logins as the only option for logins, as this has become increasingly popular lately. Passkeys Passwords Passcodes OAuth Login 2FA (coming soon) Username (coming soon) Email Email verification Start building Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Our recommendation: Modern and secure, utilizing passkeys instead of passwords. It also includes a fail-safe fallback login option with passcodes and email verification during . Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Social logins can be added as an onboarding and authentication option and work exceptionally well when paired with passkeys. The next major release of Hanko will also allow you to set up social logins as the only option for logins, as this has become increasingly popular lately. You do you. We run your auth. Focus on building and scaling your app while Hanko Cloud takes care of authentication and user management. Alex MacCaw @maccaw Passkeys is a new authentication technology which is poised to remove the need for passwords. Check out passkeys.io and @hanko_io for more info! Martin Steven SVP Product, Volt.io \"Hanko allowed us to roll out passkey-based 2FA in a matter of days.\" Daniel Rotzetter Co-Founder & Engineering Lead, Mementor \"We have been using Hanko as provider for passwordless login for over two years now. From the onboarding to this day, Hanko was always a very helpful and reliable partner with an impeccable support team.\" Peer Richelsen @peer_rich Super cool. Hanko: Open source alternative to Auth0 and Clerk with passkey superpowers. James Xu Co-Founder & CTO, kangaroo \"Great product – I'm loving it.\" Marc Seitz Founder & CEO, Papermark \"Thanks to Hanko and their Next-Auth provider, adding passkeys to your application has never been easier.\" Stefan Weiß Co-Founder & CTO, Cure Digital Finance GmbH \"Hanko's simple yet future-proof authentication solution quickly convinced us when building our vertical bank. Customer-centric and frictionless, but at the same time fulfilling our advanced PSD2 requirements.\" Pedro Sanders @pedrosanders_ This weekend I plan to try Passkeys by @hanko.io . I'm excited to get a hint at a passwordless future. The best thing about this tool? It is Open Source 🙇 Thilo Brandt Senior Director, Head of Universal Capabilities, SAP \"The development effort for introducing passkeys was significantly reduced through the use of Hanko.\" Adrian van Putten @ProgrammerDude I really ejoyed integrating hanko.io tim cappaskey @timcappalli Check out @hanko.io ! An open-source, developer focused, passkey centric authentication stack! Love to see it. Darren Crossley Head of Software Development, Agrantis \"I wanted to say how amazing the Hanko system is. The experience for developers and users is so far ahead of anything else I found in the identity / authentication space.\" \"We have been using Hanko as provider for passwordless login for over two years now. From the onboarding to this day, Hanko was always a very helpful and reliable partner with an impeccable support team.\" Daniel Rotzetter ‍ Co-Founder & Engineering Lead at mementor \"I wanted to say how amazing the Hanko system is. The experience for developers and users is so far ahead of anything else I found in the identity / authentication space.\" Darren Crossley Head of Software Development @ agrantis \"Hanko's simple yet future-proof authentication solution quickly convinced us when building our vertical bank. Customer-centric and frictionless, but at the same time fulfilling our advanced PSD2 requirements.\" Stefan Weiß Co-Founder & CTO at Cure Digital Finance GmbH \"With the help of Hanko, we were able to prove the feasibility of our vision for a passwordless login at SAP Universal ID in of technical implementation as well as usability on all major operating systems such as Windows, macOS, iOS, and Android.\" Michael Braun IT Chief Product Owner of Identity & User Management at SAP SE \"Great product — I'm loving it.\" James Xu Co-Founder & CTO @ kangaroo \"The development effort for introducing passwordless authentication was significantly reduced through the use of Hanko. The Hanko team helped us to successfully navigate implementing passwordless authentication into our application stack and user interfaces.\" Thilo Brandt IT Senior Manager, SAP Universal ID at SAP SE tim cappaskey @timcappalli Check out @hanko.io ! An open-source, developer focused, passkey centric authentication stack! Love to see it. Congrats @FlxMgdnz ! 3:41 PM Aug 9, 2022 Alex MacCaw @maccaw Passkeys is a new authentication technology wich poised to remove the need for passwords. Check out passkeys.io and @hanko_io for more info! 11:36 PM Dec 8, 2022 Peer Richelsen @peer_rich super cool Hanko: Open source alternative to Auth= with superpowers via @producthunt 9:10 AM Aug 19, 2022 Pedro Sanders @pedrosanders_ This weekend I plan to try Passkeys by @hanko.io . I'm excited to get a hint at a. passwordless future. The best thing about this tool? Is Open Source 🙇 3:00 PM Oct 28, 2022 Adrian van Putten @ProgrammerDude I really ejoyed integrating hanko.io 10:37 AM Mar 17, 2023 tobi lutke @tobi Passkeys, you can play around with them on passkeys.io but hopefully you will see them everywhere soon. The web is bugged in that we didn't have a sane auth layer. This is the solution. The web will be 10x better with effortless secure auhtentication. 3:31 PM Dec 19, 2022 You do you. We run your auth. Focus on building and scaling your app while Hanko Cloud takes care of authentication and user management. Passkey API Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading passkey infrastructure. Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading passkey infrastructure. Avoid vendor lock-in. Hanko is an open source project – for transparency, trust, and longevity. Driven by the community. Customer Identity and Access Management for the Passkey Era",
    "The Dos and Don'ts of integrating passkeys Passkeys are quickly emerging as a secure and user-friendly alternative to passwords. However, implementing them effectively requires careful planning We're announcing a significant change to our pricing: The price per monthly active user has been reduced by 50% from $0.02 to $0.01 for all ... Hanko v1 is here Modern as Clerk, open source like Keycloak, faster and more customizable than any other. Adding passkeys to your Rust application Enhance your Rust app's auth by integrating passkeys with Hanko Passkey API, replacing passwords for enhanced security and seamless UX. Passkeys in Solid.js and Bun Boost your Solid.js app's security and usability with passkeys, using Hanko's open source Passkey API and developers to create a passkey login. Hanko Cloud Beta Launch A little over a year ago, we started working on our open-source project, Today, we're thrilled to announce the Public Beta of Hanko Cloud. Does my device support passkeys? Should you invest passkeys now? Learn which devices and browsers already support passkeys today and which updates are planned for next year. Say hello to passkeys.io Introducing passkeys.io, an interactive passkeys demo and info page, powered by Hanko. Find out how passkeys can finally replace passwords for consumer logins while offering an improved user experience and better security... What are FIDO security keys? Today we take a look at FIDO security keys and their role in a passwordless future of online security. How Windows 11 is boosting PC security Windows 11 will boost security of billions of PCs by making a tiny chip called \"TPM\" a must-have requirement for the upgrade Passkey authentication for native iOS apps Passkey Series – Part 2: we walk you through the creation of a simple iOS app for registration and authentication using passkeys on Apple devices. Passkeys for web authentication Passkey Series – Part 1: create a simple web app for registration and authentication using passkeys. Building upon the FIDO Developer Challenge's success in Korea over the last two years, the FIDO Alliance is globally expanding the challenge program. Cryptocurrency: wallet threats and reasons for a passwordless future As more people hop on the crypto train, the rise in security threats and space for human error grows. SAP customer login goes passwordless with Hanko With Hanko, SAP Universal ID successfully implemented passwordless two-factor authentication with Touch ID, Face ID, Windows Hello, and Security Keys. Designing beyond the password From a User Experience perspective, passwords are clunky and inconvenient. The more secure and complex a password is, the harder it is to remember. Stay up to date Don't miss out on latest blog posts, new releases and features of Hanko's products, and more.",
    "Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Passwordless (Hanko Default) Passwords optional Social-only Passkeys-only Passwordless with Passkeys and Passcodes Our recommendation: Modern and secure, utilizing passkeys instead of passwords. Also including a fail-safe fallback login option with passcodes and email verification during . Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username account Security 2FA Email verification Let your users decide: Passwords optional Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username Account Security 2FA Email verification Social-only Set up social logins as the only option for logins, as this has become increasingly popular lately. Decide which providers you would like to offer and add other login methods later if you want. Login methods Passkeys optional Passwords optional Passcodes OAuth login GitHub Google Identifiers Email Username Account Security 2FA Email verification Out with the old: Passkeys-only Depending on your audience, offering only passkeys for authentication can be a viable and highly secure configuration. Not every device supports passkeys yet, though, so be aware that you may exclude some of your users. Login methods Passkeys optional Passwords optional Passcodes OAuth login Identifiers Email Username Account Security 2FA Email verification Start building Registration and login flows as you need them The future is passwordless – but today maybe not. Hanko provides a beautiful login that allows you to meet your users where they are, and carefully guide them into a world without passwords. For better security, higher conversion rates, and happier users. Passwordless with Passkeys and Passcodes Our recommendation: Modern and secure, utilizing passkeys instead of passwords. Also including a fail-safe fallback login option with passcodes and email verification during . Let your users decide: Passwords optional Hanko works flawlessly with passwords, just as everyone is accustomed to. You have the power to enable passkeys whenever you see fit, seamlessly leading your users into the passwordless future. Set up social logins as the only option for logins, as this has become increasingly popular lately. Decide which providers you would like to offer and add other login methods later if you want. Out with the old: Passkeys-only Depending on your audience, offering only passkeys for authentication can be a viable and highly secure configuration. Not every device supports passkeys yet, though, so be aware that you may exclude some of your users. Integrated in minutes – with Hanko Elements Customizable web components that are pre-built for all authentication use cases and can be placed freely in any web app. By using web components, Hanko Elements work in any tech stack. Apply custom CSS and let Hanko Elements blend in. Add any feature you like Customize Hanko to your needs with a PR or Fork on GitHub. The lock of your front door. Easy to use, yet sophisticated and secure. A pre-built security control center for your users to manage their credentials. Alex MacCaw @maccaw Passkeys is a new authentication technology which is poised to remove the need for passwords. Check out passkeys.io and @hanko_io for more info! Martin Steven SVP Product, Volt.io \"Hanko allowed us to roll out passkey-based 2FA in a matter of days.\" Nicolas Gimenez Co-Founder & CTO @zkorumhq \"The Hanko Elements workflow on the web is excellent and incredibly easy to integrate with. I've used Auth0 & Firebase Authentication in the past, both of them are way more complicated to integrate & understand.\" Peer Richelsen @peer_rich Super cool. Hanko: Open source alternative to Auth0 and Clerk with passkey superpowers. James Xu Co-Founder & CTO, kangaroo \"Great product – I'm loving it.\" Marc Seitz Founder & CEO, Papermark \"Thanks to Hanko and their Next-Auth provider, adding passkeys to your application has never been easier.\" Stefan Weiß Co-Founder & CTO, Cure Digital Finance GmbH \"Hanko's simple yet future-proof authentication solution quickly convinced us when building our vertical bank. Customer-centric and frictionless, but at the same time fulfilling our advanced PSD2 requirements.\" Pedro Sanders @pedrosanders_ This weekend I plan to try Passkeys by @hanko.io . I'm excited to get a hint at a passwordless future. The best thing about this tool? It is Open Source 🙇 Thilo Brandt Senior Director, Head of Universal Capabilities, SAP \"The development effort for introducing passkeys was significantly reduced through the use of Hanko.\" Adrian van Putten @ProgrammerDude I really ejoyed integrating hanko.io tim cappaskey @timcappalli Check out @hanko.io ! An open-source, developer focused, passkey centric authentication stack! Love to see it. Daniel Rotzetter Co-Founder & Engineering Lead, Mementor \"We have been using Hanko as provider for passwordless login for over two years now. From the onboarding to this day, Hanko was always a very helpful and reliable partner with an impeccable support team.\" Darren Crossley Head of Software Development, Agrantis \"I wanted to say how amazing the Hanko system is. The experience for developers and users is so far ahead of anything else I found in the identity / authentication space.\" Passkey API Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading, FIDO2-certified passkey infrastructure. about Passkey API Just want to add passkeys to your existing login? Don't need a full auth solution? Enable your users to skip passwords and traditional 2FA by supporting passkeys. Integrate the Hanko Passkey API into your existing authentication stack and benefit from our industry-leading, FIDO2-certified passkey infrastructure. No vendor lock-in or lost data. Hanko is open source – and you can always freely migrate your data from Cloud to self-hosted and vice versa. The Complete Authentication and User Management Solution for the Passkey Era. Open Source Alternative to Clerk & Auth0."
  ]
}