{
  "company": "www.dgworld.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 34,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 34,
      "0": 1
    }
  },
  "sample_docs": [
    "The World of Digitization & AI The World of Digitization & AI DGWorld is a leading AI and Digitization Company Offering robotics, industrial automation and advanced mobility. With 150+ employees, the company has left its footprints in various parts of the world. DGWorld develops products and solutions using the most advanced technology of Industry 4.0, IoT, and deploying AI based solution robots, self-driving automobiles, and AI-powered server configurations. leading AI and Digitization Company Offering robotics, industrial automation and advanced mobility. With 150+ employees, the company has left its footprints in various parts of the world. DGWorld develops products and solutions using the most advanced technology of Industry 4.0, IoT, and deploying AI based solution robots, self-driving automobiles, and AI-powered server configurations. Governments & Communities 4.0 Read more Governments & Communities 4.0 Logistics 4.0 Read more Industry 4.0 Read more Hospitality 4.0 Read more Governments & Communities 4.0 Read more Governments & Communities 4.0 Logistics 4.0 Read more Industry 4.0 Read more Hospitality 4.0 Read more Sign-up for news updates and alerts",
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO Application scenarios: guard, nurse, PA, hostess, cashier Industries: Transportation, government, education, hospitality, finance, retail. Governments & Communities 4.0 Application scenarios: guard, nurse, PA, hostess, cashier Industries: Transportation, government, education, hospitality, finance, retail. WISO Features: Safe and secure database Big Data analysis and management Centralized control system Multimodal interaction Flexible movement Speech engine Autonomous navigation (SLAM Technology) Automatic docking and recharging Temperature checking Facial recognition Mask reminder Service feedback system Attachable serving tray Payment system Greeting and guiding services Safe and secure database Big Data analysis and management Autonomous navigation (SLAM Technology) Automatic docking and recharging Greeting and guiding services Video Image Gallery Enquiry Sign-up for news updates and alerts",
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO Autonomous Logistic Robots LogiBOT is an omnidirectional, autonomous mobile platform that is perfectly suited to the automation processes of Industry 4.0 and advanced logistics in Warehouses of today. LogiBOTautonomously fetches the required components or returns them to the warehouse after processing. It can move about freely and without conventional guidance or navigation elements. This makes integration into any environment much easier and increases efficiency in logistics management. With payload capacities from2 kg up to 90 tons, LogiBOTsafely moves your products through the entire manufacturing process. It meets all necessary safety standards and is also extremely flexible. Integrated safety laser scanners enable autonomous navigation through your production shop and the electrical drive system makes it environmentally friendly and efficient. Our Fleet Management Software ensures that right LogiBot is available at the right place at the right time.Once your Warehouse is mapped, theLogiBot´s can navigate through it completely independently. All LogiBot´s can route itself and always travel the shortest distance from point A to point B on their own. In combination with our Fleet Management Software, your fleet of LogiBOT´sis ready to impress you with the performance of intelligent and smart transport of a robotic swarm. Offers highest efficiency and flexibility for any logistics application Perfect solution for factories, warehouses and logistic hubs. Integrated - Barcode Scanning Solution for seamless data transfer and tracking of goods (option) Fully scalable - fleet size that can be expanded at any time Navigation System without any installed markers or infrastructure offers integration anywhere Dynamic Re-routing – dynamically bypasses obstacles Unlimited Applications –LogiBOT carries out tasks by itself and supports humans in their daily processes User-Friendly and highly efficient design Automatic Recharging at charging stations and cable charging is available CE and Safety-certified for interaction with people LogiBot is available in 3 different versions, to suit your needs: LogiBOT – S (up to 100kg) – the allrounder which can fit for various applications (available in different versions) LogiBOT – M (up to 1500kg) – the perfect choice for all Industry 4.0 applications in production lines LogiBOT – L (up to 90 tons) – suitable for highest loads and heavy-load applications (different versions available) Governments & Communities 4.0 LogiBOT is an omnidirectional, autonomous mobile platform that is perfectly suited to the automation processes of Industry 4.0 and advanced logistics in Warehouses of today. LogiBOTautonomously fetches the required components or returns them to the warehouse after processing. It can move about freely and without conventional guidance or navigation elements. This makes integration into any environment much easier and increases efficiency in logistics management. With payload capacities from2 kg up to 90 tons, LogiBOTsafely moves your products through the entire manufacturing process. It meets all necessary safety standards and is also extremely flexible. Integrated safety laser scanners enable autonomous navigation through your production shop and the electrical drive system makes it environmentally friendly and efficient. Our Fleet Management Software ensures that right LogiBot is available at the right place at the right time.Once your Warehouse is mapped, theLogiBot´s can navigate through it completely independently. All LogiBot´s can route itself and always travel the shortest distance from point A to point B on their own. In combination with our Fleet Management Software, your fleet of LogiBOT´sis ready to impress you with the performance of intelligent and smart transport of a robotic swarm. Offers highest efficiency and flexibility for any logistics application Perfect solution for factories, warehouses and logistic hubs. Integrated - Barcode Scanning Solution for seamless data transfer and tracking of goods (option) Fully scalable - fleet size that can be expanded at any time Navigation System without any installed markers or infrastructure offers integration anywhere Dynamic Re-routing – dynamically bypasses obstacles Unlimited Applications –LogiBOT carries out tasks by itself and supports humans in their daily processes User-Friendly and highly efficient design Automatic Recharging at charging stations and cable charging is available CE and Safety-certified for interaction with people LogiBOT – S (up to 100kg) – the allrounder which can fit for various applications (available in different versions) LogiBOT – M (up to 1500kg) – the perfect choice for all Industry 4.0 applications in production lines LogiBOT – L (up to 90 tons) – suitable for highest loads and heavy-load applications (different versions available) Video Image Gallery Enquiry Sign-up for news updates and alerts",
    "Who we are Who we are About Us Vision & Mission CEO Message Our Team Why DGWorld ? Careers Products Products Advanced Mobility Advanced Mobility BiGO e-BiGO CabGO TruGO e-TruGO SelfieCAR DGWorld Autonomous Driving Technologies and System MiGO BeachBOT FireBOT FloorBOT ForkBOT GrassBOT LogiBOT- Express TrashBOT Industrial Robotics and Automation Unmanned Autonomous Drone Series – UAD Unmanned Autonomous Drone Series – UAD Drone - UAD M20 Drone - UAD M470 HUMONAID AI ROBOT Innovation Innovation TiGO TvBOT Robot In Art SimBOT BagBot ChessBot Robots and sports 3D printing Robot FuelBOT STEM & Education Anti Corona Robot Maintenance Programming Advanced Mobility Advanced Mobility BiGO e-BiGO CabGO TruGO e-TruGO SelfieCAR DGWorld Autonomous Driving Technologies and System MiGO BeachBOT FireBOT FloorBOT ForkBOT GrassBOT LogiBOT- Express TrashBOT DGWorld Autonomous Driving Technologies and System Industrial Robotics and Automation Unmanned Autonomous Drone Series – UAD Unmanned Autonomous Drone Series – UAD Drone - UAD M20 Drone - UAD M470 Unmanned Autonomous Drone Series – UAD Drone - UAD M20 Drone - UAD M470 Innovation Innovation TiGO TvBOT Robot In Art SimBOT BagBot ChessBot Robots and sports 3D printing Robot FuelBOT MEDIA PRESS RELEASE INTERVIEWS EVENTS Contact Us Contact Us Business Process Flow We are Active on Social Media Enquiry We are Active on Social Media About Us Industrial Robotics | Autonomous Vehicles | Customised Drones | Humanoid Robots Conceptualised in the year 2013 in Dubai, we opened the First Robotics Development Park and Demo Centre in Dubai and entire MENA region. Conceptualised in the year 2013 in Dubai, we opened the First Robotics Development Park and Demo Centre in Dubai and entire MENA region. DGWORLD has been developing Products and Solutions using the most advance form of AI ,Automation , self-driving system. DGWORLD has stimulated the levels of development in the field of AI and Robotics Technologies. From Self-driving Automobiles to operating Robotics Systems by Voice Command to AI-powered server configurations and working for concept for digitization and Converting Smart cities to the next level of Robotic cities. DGWORLD endeavor to continues to create the most advanced products, for various industries to meet the needs of our clients. We are constantly evolving and are working on strategic projects with various government entities. Our clients also present various industries, from all types of Industrial Manufacturing, Aviation, Transportation, Logistics, Construction, Health Care, Security, Entertainment, Media, Education, Customer Care, ports etc. We are the leading company in the Middle East in Automation and Robotics and are creating a mark in other parts of the world, as well. We are developing and implementing Fully Autonomous AI Technology ,Autonomous ,and Advanced Robotics System under concept of Industry 4.0 and Internet of Things, that augment human experience in the world. DGWORLD has been developing Products and Solutions using the most advance form of AI ,Automation , self-driving system. DGWORLD has stimulated the levels of development in the field of AI and Robotics Technologies. From Self-driving Automobiles to operating Robotics Systems by Voice Command to AI-powered server configurations and working for concept for digitization and Converting Smart cities to the next level of Robotic cities. DGWORLD endeavor to continues to create the most advanced products, for various industries to meet the needs of our clients. We are constantly evolving and are working on strategic projects with various government entities. Our clients also present various industries, from all types of Industrial Manufacturing, Aviation, Transportation, Logistics, Construction, Health Care, Security, Entertainment, Media, Education, Customer Care, ports etc. We are the leading company in the Middle East in Automation and Robotics and are creating a mark in other parts of the world, as well. We are developing and implementing Fully Autonomous AI Technology ,Autonomous ,and Advanced Robotics System under concept of Industry 4.0 and Internet of Things, that augment human experience in the world. Technology Partnership DGWorld believes in Global Exchange of Best Practice, Knowledge, and Innovation. We have a technical cooperation agreement with KUKA Robotics GMBH to provide robotics solutions in the Middle East and Africa. But's that not all. With KUKA training, and the knowledge-transfer, our engineering teams get the finest human engineering experience creating the finest talent in robotic technologies in the Middle East. DGWorld has become integrator partner with Velodyne Lidar Silicon Valley-based lidar technology company in 2018. DGWorld has been working with Velodyne since 2016, during the development of our Autonomous Kit. DG World has been working with Rajant Corporation since 2017, incorporating Kinetic Mesh with InstaMesh® into our advanced vehicle automation technology. As a result, a strategic partnership has been initiated with Rajant Corporation in 2019, which formalizes a working relationship for the two companies, to work together for Autonomous Vehicle projects around the world Previous Next DGWorld believes in Global Exchange of Best Practice, Knowledge, and Innovation. We have a technical cooperation agreement with KUKA Robotics GMBH to provide robotics solutions in the Middle East and Africa. But's that not all. With KUKA training, and the knowledge-transfer, our engineering teams get the finest human engineering experience creating the finest talent in robotic technologies in the Middle East. DGWorld has become integrator partner with Velodyne Lidar Silicon Valley-based lidar technology company in 2018. DGWorld has been working with Velodyne since 2016, during the development of our Autonomous Kit. DG World has been working with Rajant Corporation since 2017, incorporating Kinetic Mesh with InstaMesh® into our advanced vehicle automation technology. As a result, a strategic partnership has been initiated with Rajant Corporation in 2019, which formalizes a working relationship for the two companies, to work together for Autonomous Vehicle projects around the world Our History 2004 Digi Matrix Technologies was established in the year 2004, with a vision to cover various Regional Market in the Middle East and Africa segments with advanced Cam CNC Router and Engraving machines, Laser cutting & Engraving machines, and Large format Printing solutions 2013 Established in the year 2013, the First Robotics development park and demo center in UAE. 2014 Moderated the concept of a smart city to the next level of robotics city by establishing Digi Robotics brand 2015 Digi Robotics become official system partner to KUKA in MEA Region 2016 We deployed our Autonomous Container Truck \"TurGO \" We launched the 1st Humanoid robot, made in the UAE using 3D printing technology \"WIZO\" 2017 From smart city to Ai city, we launched new Business lines and developed conversion kit for Autonomous systems including AV, UAD. 2018 We launched the 1st Autonomous taxi in the region in cooperation with RTA Dubai We launched the new generation Vehicle Inspection System in cooperation with RTA Dubai We become integration partner with Velodyne lidar At the GITEX 2018, we launched DGWorld, combining all our business lines under one umbrella branding We signed an MOU with RIT (Rochester Institute of Technology) to develop their Robotics Lab for their new campus. 2019 We became strategic partners with Rajant Corporation 2004 Digi Matrix Technologies was established in the year 2004, with a vision to cover various Regional Market in the Middle East and Africa segments with advanced Cam CNC Router and Engraving machines, Laser cutting & Engraving machines, and Large format Printing solutions 2013 Established in the year 2013, the First Robotics development park and demo center in UAE. 2014 Moderated the concept of a smart city to the next level of robotics city by establishing Digi Robotics brand 2015 Digi Robotics become official system partner to KUKA in MEA Region 2016 We deployed our Autonomous Container Truck \"TurGO \" We launched the 1st Humanoid robot, made in the UAE using 3D printing technology \"WIZO\" 2017 From smart city to Ai city, we launched new Business lines and developed conversion kit for Autonomous systems including AV, UAD. 2018 We launched the 1st Autonomous taxi in the region in cooperation with RTA Dubai We launched the new generation Vehicle Inspection System in cooperation with RTA Dubai We become integration partner with Velodyne lidar At the GITEX 2018, we launched DGWorld, combining all our business lines under one umbrella branding We signed an MOU with RIT (Rochester Institute of Technology) to develop their Robotics Lab for their new campus. 2019 We became strategic partners with Rajant Corporation Frequently Asked Questions & Answers Contact Us Frequently Asked Questions & Answers",
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO E-BiGo - Green and futuristic Transport today Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. The cutting-edge design of e-BiGO combines functionality with a futuristic appearance. e-BiGO can be utilized in any controlled environment, but even advanced traffic situation can be handled with ease. We have developed new embedded safety modules to enhance the autonomous driving and open new horizons of applications. Experience latest AI Technology during a chilled ride with your family, friends or on your daily way to work. Advanced user interaction features, like speech Processing, custom Applications and connected Services let any passenger experience autonomous Transportation at a unique new level. Our autonomous driving Software is adapting to any environment and handles most challenges of modern traffic. By adding our Fleet Management Software and communication System, e-BiGo becomes part of a fully advanced transportation network, makes it possible to manage a whole fleet of smart busses and operate public transport from a centralized control center. e-BiGohas been designed to be the answer for challenges of public transport and introduces green autonomy for smart cities, airports or any other applications that requires to transport passengers in a more efficient, attractive, and environmentally friendly way. DGWorld BiGoautonomy conversion Kit includes: DGW Drive by Wire This System is controlling all relevant functions of the e-BiGoand makes it possible, to remotely control it as well. Additionally, it will monitor all relevant functions and parameters of the Bus. DGW Localization & Mapping Sensor System based on our3D SLAM and fused sensing Systems enabling to calculate the real position of the Bus without the need to integrate artificial markings and allows autonomous operation virtually anywhere DGW Perception & Safety System Allows real mixed traffic applications and ensures full interaction of the autonomous Busses with its environment following highest safety international standards DGWorld Autonomous Driving AI Engine (Software) Full Level 4 autonomy, ensuring to adapt the driving behavior of your e-BiGo fleet regardless their load and environmental challenges Governments & Communities 4.0 E-BiGo - Green and futuristic Transport today Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. The cutting-edge design of e-BiGO combines functionality with a futuristic appearance. e-BiGO can be utilized in any controlled environment, but even advanced traffic situation can be handled with ease. We have developed new embedded safety modules to enhance the autonomous driving and open new horizons of applications. Experience latest AI Technology during a chilled ride with your family, friends or on your daily way to work. Advanced user interaction features, like speech Processing, custom Applications and connected Services let any passenger experience autonomous Transportation at a unique new level. Our autonomous driving Software is adapting to any environment and handles most challenges of modern traffic. By adding our Fleet Management Software and communication System, e-BiGo becomes part of a fully advanced transportation network, makes it possible to manage a whole fleet of smart busses and operate public transport from a centralized control center. e-BiGohas been designed to be the answer for challenges of public transport and introduces green autonomy for smart cities, airports or any other applications that requires to transport passengers in a more efficient, attractive, and environmentally friendly way. DGWorld BiGoautonomy conversion Kit includes: This System is controlling all relevant functions of the e-BiGoand makes it possible, to remotely control it as well. Additionally, it will monitor all relevant functions and parameters of the Bus. based on our3D SLAM and fused sensing Systems enabling to calculate the real position of the Bus without the need to integrate artificial markings and allows autonomous operation virtually anywhere Allows real mixed traffic applications and ensures full interaction of the autonomous Busses with its environment following highest safety international standards Full Level 4 autonomy, ensuring to adapt the driving behavior of your e-BiGo fleet regardless their load and environmental challenges eBiGO Main Features: our integration and safety Solutions Autonomous operation in mixed traffic without infrastructural changes (SAE Level 4) Higher Safety and less accidents including passenger safety monitoring Highly efficient and adaptable driving behavior is reducing operational costs 100% electric and no carbon emissions Real time data from the vehicles (Position, Status Information and Diagnostics) will optimize your daily operations Applicable for all different types of vehicles Busses according to your demand Adjusting its speed in autonomous mode automatically for the best economic to safe resources and longest battery life (up to 8 hours) Operation at Day and Night 24/7 (indoor or outdoor) Operation by remote or fully autonomous mode Custom Interfaces like advertising and on-board entertainment by using latest AI Technology Advanced Safety features, like object detection (Cars, Pedestrians, …) and active collision avoidance Vehicle 2 Vehicle communication for quick information exchange between the autonomous Vehicles HD Mapping (to create reference Map) combined with advanced 3D Slam Algorithm Automatic update of mapping information and possibility to share these updates with other vehicles to avoid traffic and changes its routes dynamically Data collected by e-BiGo, can be used for security and surveillance Applications to enhance the safety of environments or cities and optimized crowd control Safe System architecture (PLC System, Brake System, Sensor Architecture) according to international safety standards (ISO 26262) and TÜV certified. Full Vehicle Status Monitoring allows central overview of all fleet parameters in real-time. Full operational flexibility thanks to our integration and safety Solutions: Our Remote-Control Desk (for exception Handling) will give remote operators a complete surround view of e-BiGo and ensure operations, even in critical situations. We offer fully automated recharging solutions for e-BiGo enabling hazzle free operation of your electric fleet Customized Passenger interaction allows unlimited on-board features, like entertainment, payment systems, advertising based on location and many more for a unique experience. our integration and safety Solutions Autonomous operation in mixed traffic without infrastructural changes (SAE Level 4) Higher Safety and less accidents including passenger safety monitoring Highly efficient and adaptable driving behavior is reducing operational costs 100% electric and no carbon emissions Real time data from the vehicles (Position, Status Information and Diagnostics) will optimize your daily operations Applicable for all different types of vehicles Busses according to your demand Adjusting its speed in autonomous mode automatically for the best economic to safe resources and longest battery life (up to 8 hours) Operation at Day and Night 24/7 (indoor or outdoor) Operation by remote or fully autonomous mode Custom Interfaces like advertising and on-board entertainment by using latest AI Technology Advanced Safety features, like object detection (Cars, Pedestrians, …) and active collision avoidance Vehicle 2 Vehicle communication for quick information exchange between the autonomous Vehicles HD Mapping (to create reference Map) combined with advanced 3D Slam Algorithm Automatic update of mapping information and possibility to share these updates with other vehicles to avoid traffic and changes its routes dynamically Data collected by e-BiGo, can be used for security and surveillance Applications to enhance the safety of environments or cities and optimized crowd control Safe System architecture (PLC System, Brake System, Sensor Architecture) according to international safety standards (ISO 26262) and TÜV certified. Full Vehicle Status Monitoring allows central overview of all fleet parameters in real-time. Our Remote-Control Desk (for exception Handling) will give remote operators a complete surround view of e-BiGo and ensure operations, even in critical situations. We offer fully automated recharging solutions for e-BiGo enabling hazzle free operation of your electric fleet Customized Passenger interaction allows unlimited on-board features, like entertainment, payment systems, advertising based on location and many more for a unique experience. Video Image Gallery Enquiry Sign-up for news updates and alerts"
  ]
}