{
  "company": "www.kinesense-vca.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.6666666666666666,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Products Kinesense LE Kinesense Report Kinesense Redact Kinesense Advanced Analytics Kinesense PlayerManager Kinesense DEM Services Forensic Video Services Latest News Blog Events News Press Centre Tips & Tricks Login Customer Portal Partner Portal Products Kinesense LE Kinesense Report Kinesense Redact Kinesense Advanced Analytics Kinesense PlayerManager Kinesense DEM Services Forensic Video Services Latest News Blog Events News Press Centre Tips & Tricks Login Customer Portal Partner Portal We have built the most comprehensive solution for video investigations Choose the profile that matches you best POLICE Complete video investigation from capture to court READ MORE SECURITY AGENCY Actionable intelligence fast from covert footage READ MORE CCTV SPECIALIST Manage proprietary formats and report making READ MORE SECURITY MANAGER Exploitable operational camera data READ MORE RETAIL Innovative retail security solutions READ MORE TRAFFIC ANALYST Traffic collision analysis READ MORE We provide you with one platform to manage all your video Investigations tasks. By combining our smart video search technology with easy to use reporting functionality, investigators can generate leads faster. Contact About Us User Profiles Get a Quote News Become a Partner Customer Portal Partner Portal GDPR & Cookies Download our CCTV Workbook If you are considering a force wide change to how you deal with CCTV and video evidence, download our workbook today. Please enter your details to receive Whitepaper Please enter your details to receive Whitepaper"
  ]
}