{
  "company": "www.salarium.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Cart (0 Items ) | Your Account | Blog 1-888-677-5054 **BUSINESS TO BUSINESS ONLY** Call for Live Order Assistance & Tech Support (7:30am-5pm CST) Cart (0 Items ) | Your Account | Blog 1-888-677-5054 **BUSINESS TO BUSINESS ONLY** Call for Live Order Assistance & Technical Support (7:30am-5pm CST) How Does a Centrifugal Pump Work? by Tom Hansen, P.E. | ©Dultmeier Sales What is a Centrifugal Pump? Centrifugal pumps are the most common type of pump used in industry, agriculture, municipal (water and wastewater plants), power generation plants, petroleum and many other industries. Centrifugal pumps are the primary pump type in the class of pumps called \"kinetic\" pumps and are distinctly different than \"positive displacement\" pumps. All centrifugal pumps include a shaft-driven impeller that rotates (usually at 1750 or 3500 RPM) inside a casing. Liquid flows into the suction port (inlet) of the casing and is thrown to the outside of the casing and then exits the discharge port. The velocity imparted to the liquid by the impeller is converted to pressure energy or \"head\". Centrifugal pumps are unique because they can provide high or very high flowrates (much higher than most positive displacement pumps) and because their flowrate varies considerably with changes in the Total Dynamic Head (TDH) of the particular piping system. This allows the flowrate from centrifugal pumps to be \"throttled\" considerably with a simple valve placed into the discharge piping, without causing excessive pressure buildup in the piping or requiring a pressure relief valve. Therefore, centrifugal pumps can cover a very wide range of liquid pumping applications. As described above, one key advantage of centrifugal pumps is the ability to \"throttle\" their flowrates over a wide range. Throttling centrifugal pumps with a discharge valve is not as energy-efficient as using a Variable Frequency Drive (VFD) to slow the pump/motor speed down, but it is much less expensive to install. Of course, throttling a centrifugal pump's flowrate has certain limits. They should not be throttled below the \"minimum safe flowrate\" indicated by the pump manufacturer for other than a minute or so; otherwise excessive recirculation can occur inside the pump casing which can cause excessive heat buildup of the liquid. In addition, too much \"throttling\" will cause excessive shaft deflection which will increase the wear on bearings and seals inside the pump. Therefore, the ideal flowrate for a centrifugal pump is near its \"Best Efficiency Point\" (BEP). The BEP can be found on many pump Head-Flowrate Curves that have Efficiency curves shown on the same drawing. The BEP for a given centrifugal pump model, speed and impeller diameter is the point where Efficiency is highest; this maximizes energy efficiency as well as seal and bearing life inside the pump. Another important point is that running centrifugal pumps at 1750 RPM motor speeds instead of 3500 RPM motor speeds will reduce wear on seals and bearings by almost 4 times and the pump will also be less likely to cavitate when less favorable suction conditions (long suction pipes, high \"lifts\" from ponds or pits, low supply tank levels, or liquids with high vapor pressures such as hot water, gasoline, etc) are involved. However, centrifugal pumps running at 1750 RPM require much larger casings and impellers than those running at 3500 RPM and therefore, cost considerably more money. Head - Flow Curves Most centrifugal pump manufacturers publish \"Head-Flow\" Curves for each model, impeller diameter, and rated speed (RPM) for the centrifugal pumps they manufacture. A key point regarding these Head-Flow Curves is that all centrifugal pumps will always run along their Head-Flow Curve and the resulting flowrate will always be at the intersection of the pump's Head-Flow Curve and the \"System\" Curve which is unique for each piping system, fluid and application. System curves can be developed quite easily using Hydraulic Modeling Software and compared to various pump Head-Flow Curves in order to properly select centrifugal pumps that meet each user's unique system and flowrate requirements. Dultmeier Sales has engineers on staff with Hydraulic Modeling Software to help pump users select the correct pump(s) for their system and flowrate requirements (Call us at 1-888-677-5054 or fill out our Pump Sizing Form ) . Another important point is that centrifugal pumps will require their maximum horsepower, for a given impeller diameter and RPM, at maximum flowrate on their Head-Flow curve. As the Head (or Discharge Pressure) a centrifugal pump is working against is increased (i.e.-throttling valve being closed, tank filling up, strainer clogging, longer or smaller diameter piping, etc), the flowrate will decrease and horsepower will also decrease. Centrifugal pumps are designed for liquids with relatively low viscosity that pour like water or like a very light oil. They can be used with slightly more viscous liquids such as 10 or 20 wt. oils at 68-70 deg F (ambient temperatures) but additional horsepower must be added because centrifugal pumps become less inefficient with even slight increases in viscosity and require more horsepower. When viscosity of the liquids exceed those of 30 wt oils at ambient temps (approx. 440 centistokes or 2,000 SSU), centrifugal pumps become very inefficient and require much more horsepower. In those cases, most centrifugal pump manufacturers start recommending positive displacement pumps (such as gear pumps, progressive cavity pumps) instead of centrifugal pumps in order to keep horsepower requirements and energy usage lower. Centrifugal pumps also require increases in horsepower when pumping non-viscous liquids that are more dense than water such as fertilizer and many chemicals used in industry. Water has a density of 8.34 lbs/gallon. The specific gravity of any liquid is the density in lbs/gallon of that liquid divided by 8.34. The required increase in horsepower for a centrifugal pump used for a more dense liquid than water is directly proportional to the increase in specific gravity of the liquid. For example, if a particular fertilizer has a specific gravity of 1.40 (i.e.-1.4 times the density of water or 11.68 lbs/gallon), then the increased horsepower for the centrifugal pump would be 1.4 times the horsepower required when pumping water with the same pump. Therefore, in this example, if a 20HP motor was required for pumping water, then a 30HP motor would be required for pumping the fertilizer (actually, 28HP would be required which is 1.4 x 20 HP but the next largest motor commonly available is 30HP, since 25HP would not be sufficient). Motor Driven Centrifugal Pumps Engine Driven Centrifugal Pumps MP / Flomax Centrifugal Pumps CDS John Blue Centrifugal Pumps Gorman Rupp Centrifugal Pumps PHONE SALES (7:30am-5pm CST) 1-888-677-5054 CUSTOMER SERVICE 1-888-677-5054 Contact Us Returns FAQs / Help Forms YOUR ACCOUNT | Register | Register DIVISIONS Car Wash Equipment Supplies Agricultural Equipment Industrial Supply Liquid Deicing Equipment Lawn/Turf Care Petroleum Equipment Carpet Cleaning / JanSan Car Wash Equipment Supplies Carpet Cleaning / JanSan ABOUT About Dultmeier Divisions Customer Reviews Site Map Manufacturer List SECURITY & PRIVACY & Conditions HOW DO YOU LIKE OUR WEBSITE? We'd like to hear from you! [ + ] Feedback Follow us for industry news, new products & more! © COPYRIGHT DULTMEIER SALES. 13808 Industrial Rd • Omaha, NE 68137 • (800) 228-9666 ♦ 601 W 76th St • Davenport, IA 52806 • (800) 553-6975 Divisions Car Wash / Truck Wash / Mobile Cleaning + Agricultural Industrial Deice / Anti-Ice Lawn / Turf Petroleum / DEF Carpet / Jansan Car Wash / Truck Wash / Mobile Cleaning + Resources Catalog Quick Order Forms Pump Repair Service Trade Shows Videos Advanced Search (SDS) Safety Data Sheets Blog (SDS) Safety Data Sheets New View All - 2018 Agricultural Car / Truck Wash & Mobile Cleaning Carpet / Jansan Industrial Petroleum View All - 2017 View All - 2018 Car / Truck Wash & Mobile Cleaning View All - 2017 Specials Flyers / Specials Closeouts Rebuilt Items Catalogs Browse Catalogs Free Catalog CUSTOMER SERVICE 1-888-677-5054 7:30 a.m. - 5 p.m. CST Mon - Fri © Copyright Dultmeier Sales. .",
    "Product Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Overview Product Overview Learn about the complete end-to end solution Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Resources Contact Us 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Watch video Contact Us 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Contact Us 24/7 Support Get in touch via email or chat Contact Us 24/7 Support Get in touch via email or chat 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials . Product Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Overview Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Overview Product Overview Learn about the complete end-to end solution Product Overview Learn about the complete end-to end solution Managed Accounting Outsourcing Partners New Find a certified payroll and Accounting partner. Outsourcing Partners New Find a certified payroll and Accounting partner. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Features Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Time & Attendance Capture time, leave and attendance online Payroll Automatically compute payroll in minutes SALPay Disbursement Streamline Payouts with our securely integrated solution. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Tools Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Employee Self Service (ESS) Mobile and desktop employee Portal to access requests and payslip's. HRIS Employee Files Keep track of your most valuable assets. Biometrics Devices A line of hardware devices that synch with Salarium. Resources Contact Us 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Watch video Contact Us 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Contact Us 24/7 Support Get in touch via email or chat Contact Us 24/7 Support Get in touch via email or chat 24/7 Support Get in touch via email or chat Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Getting Started Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Webinar Join our daily & free – Set up 101 webinars. Knowledge Base Ask the community HR Nation The community for HR Professionals in the Philippines. Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials Jump start your SALARIUM journey Jump right in — and start with our pre recorded video tutorials 50 Php per Employee Payroll Software Philippines 50 Php per Employee Payroll Software Philippines – Salarium Careers at Salarium Apply Now – Salarium Apply Now – Salarium Client Testimonials – Salarium Client Testimonials – Salarium Complete Payroll System For Philippines – Time & Attendance – Salarium Complete Payroll System For Philippines – Time & Attendance – Salarium Construction Payroll Software Services – Salarium Contact Us – Salarium Contact Us – Salarium Create any custom schedule easily Create any custom schedule easily DEMO SIGNUP LANDING PAGE Employee Self Service Software for Payroll Employee Self Service Software for Payroll Employee Self-Service Learning Site Customer's Journey – Downloads Customer's Journey – Get Started How to videos – Customer's Journey Customer's Journey – Downloads Customer's Journey – Get Started How to videos – Customer's Journey FAQ – Payroll and Software in the Philippines – Salarium Free webinar for a virtual demo of our payroll software – Salarium Get Started With Your New Payroll System Here – Salarium Get Started With Your New Payroll System Here – Salarium Gift Your Company a Payroll System For Christmas – Salarium Introducing FacePass : Stay Safe, Go Touchless – Salarium FacePass – Employee Self Service FacePass : SAFE Tech Device features – Salarium FacePass : Safety Protocols – Salarium FacePass : The FacePass Solution – Salarium FacePass : Time and Attendance – Salarium FacePass : Touchless Technology – Salarium FacePass – Employee Self Service FacePass : SAFE Tech Device features – Salarium FacePass : Safety Protocols – Salarium FacePass : The FacePass Solution – Salarium FacePass : Time and Attendance – Salarium FacePass : Touchless Technology – Salarium Make the Most Out of Your Salarium System! Manage and Pay Your Employees WHEREVER They Work Manage and Pay Your Employees WHEREVER They Work Meet our Success Team Monitor Your Employees' Attendance WHEREVER They Work On Paydays, you just click Payroll Accounting Made Easy in the Philippines Payroll for BPO Services – Salarium Payroll for the IT Industry – Salarium Payroll Software for Accountants and Accounting Firms Payroll Software made for Philippines Payroll Software made for Philippines Payroll Software made for Philippines Disbursement and Payroll Automation – Salarium Finance Reports and Payroll Automation – Salarium Government Reports and Payroll Automation – Salarium Payslip Generation and Payroll Automation – Salarium Disbursement and Payroll Automation – Salarium Finance Reports and Payroll Automation – Salarium Government Reports and Payroll Automation – Salarium Payslip Generation and Payroll Automation – Salarium Payroll Software made for the Philippines – Salarium Payroll Software Service for Education Institutes Payroll Software System for Banking Institutions – Salarium Payroll Software System for Government Agencies and Offices – Salarium Payroll Software System for Hotels and the Hospitality Industry – Salarium Payroll Software System for Insurance Companies – Salarium Payroll Software System for Manufacturing Companies – Salarium Payroll Software System for Real Estate Professionals – Salarium Payroll Software System for Shipping Companies – Salarium Payroll Software System for Travel Companies – Salarium Payroll Software with Role-Based Access Control Payroll Sofware System for Pharmaceutical Companies – Salarium Payslip Generation in the Philippines Done Automatically Pricing for Salarium Payroll Software Philippines Pricing for Salarium Payroll Software Philippines – Salarium Restaurant and Food Industry Payroll System – Salarium Retail Automated Payroll System Software – Salarium SALARIUM – PAYROLL SOFTWARE 3 MONTHS FREE Salarium – Payslip Generation in the Philippines Done Automatically (Demo) Salarium allows for complete custom RBAC Roles Salarium Philippines – Payroll Software 30 Days Free Salarium Philippines – Payroll Software 30 Days Free Secure Company Disbursement for Employees in the Philippines Security Policies – Salarium With Us, Book a Demo Now With Us, Book a Demo Now With Us, Book a Demo Now Something Touchless is Coming Starcross Construction, Inc : Improved Efficiency by 650 Percent Stay Safe, Go Touchless with FacePass Stay Safe, Go Touchless with FacePass Subscribe to our Newsletter Subscribe Confirmation Subscribe Confirmation v3 TESTING BOOK A DEMO Thank you for contacting us Thanks for contacting us Thanks for visiting us Time and Attendance Solutions for Companies in the Philippines Time and Attendance Solutions for Companies in the Philippines Biometrics Attendance Integrated with Payroll – Salarium Biometrics Payroll System – Salarium Download Free Payroll and Payslip Templates in Excel Electronic Bundy Clock manage Time & Attendance – Salarium Electronic Bundy Clock System For Payroll Automation Electronic Bundy Clock System For Payroll Automation How to Stop Time Theft in Your Company Mobile Clock-in to Manage Time & Attendance Online Employee Timesheet Time & Attendance – Customizable Online Schedules – Salarium Time & Attendance Custom-Made Online Shifts – Salarium Time & Attendance Tracking Software With Fingerprints & Bundy Clocks Time Dispute Prevention System Time Record Integration Time Record Integration Features Timesheet Management by Salarium Biometrics Attendance Integrated with Payroll – Salarium Biometrics Payroll System – Salarium Download Free Payroll and Payslip Templates in Excel Electronic Bundy Clock manage Time & Attendance – Salarium Electronic Bundy Clock System For Payroll Automation Electronic Bundy Clock System For Payroll Automation How to Stop Time Theft in Your Company Mobile Clock-in to Manage Time & Attendance Time & Attendance – Customizable Online Schedules – Salarium Time & Attendance Custom-Made Online Shifts – Salarium Time & Attendance Tracking Software With Fingerprints & Bundy Clocks Time Dispute Prevention System Time Record Integration Features Timesheet Management by Salarium Time Attendance and Payroll Software for the Philippines – Salarium Time Attendance and Payroll Software for the Philippines – Salarium Time Attendance and Payroll Software for the Philippines – Salarium Track attendance anywhere, in real-time UB Referral Thank You UnionBank GlobalLinker – FacePass by Salarium: Stay Safe, Go Touchless! UnionBank GlobalLinker – Salarium Offers Upgrade Your Work-From-Home Process Now View our demo videos View our demo videos"
  ]
}