{
  "company": "www.e-consystems.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 99,
    "-1": 6
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 99
    }
  },
  "sample_docs": [
    "+1 408 766 7503 See3CAM_30Z10X - 10x Optical Zoom USB 3.0 Camera See3CAM_30Z10X is a 3 MP Autofocus USB Camera with Optical Zoom based on a 1/3\" rolling shutter, color CMOS image sensor. This USB Zoom camera houses a full-functional ISP and supports YUV422 output image format. This camera supports 10x Optical Zoom and 6x Digital Zoom. This See3CAM_30Z10X - USB Zoom Camera is UVC-compliant SuperSpeed USB 3.0 Camera and does not require any special camera drivers. This Optical Zoom USB Camera is an ideal for customer applications in devices such as PCB inspection camera, Growth Monitoring, Article Inspection, Defect Detection, etc., where the 10x optical zoom capability can be leveraged. The See3CAM_30Z10X product is of high quality and a perfect fit for our needs. We are extremely happy with the finest service. Read More.. - Pradeep V Pydah, Maxerience Electrosystems USB 3.0 camera with Optical Zoom of 10x and Digital Zoom of 6x USB 3.0 – YUV422 USB 2.0 - MJPEG USB 3.0 – YUV422 USB 2.0 - MJPEG Plug-&-Play (UVC compliant - No drivers required)and Backward compatibility with USB2.0 hosts with limited features and capabilities Resolutions YUV422 HD (720p) 60fps Full HD (1080p) 30fps Resolutions MJPG VGA 30fps QVGA 30fps HD (720p) 30fps Supported OS - Windows 10, Windows 8, Windows 7, Linux * USB 3.0 device with USB 3.0 Micro-B connector. Our Standard camera board will have USB 3.0 Micro-B connector. Operating Voltage : 5V Temperature Range - 0° C to 40° C Power requirements - Powered by dual USB 3.0 Y cable Size in mm (l x b x h) - 45 x 81 x 59.5 Unique ID for each camera * - Linux support available only for USB 3.0 Sensor : 1/3\" format CMOS image sensor Focus Type : Auto Focus Resolution : 3.15 MP Pixel size : 2.2μm x 2.2μm Sensor Active Area : 2304(H) x 1536(V) pixels Responsivity : 2.0V/Lux-sec (@550nm) SNR : 36 dB Dynamic Range : 69.5 dB Output Format : USB 3.0: YUV422 USB 2.0: MJPG Shutter type : Electronic Rolling shutter ISP : External ISP Zoom Magnification : Optical: 10x Digital: 6x Focal Length : 6.3mm(Wide) ~ 63mm (Tele) +/- 5% Field of View (estimated) : Wide: 46.6° (H); 34.58° (V); 56.36° (D) Zoom/Focus Mechanism : Stepper motor (with microstepping) Iris Mechanism : Stepper motor (with microstepping) Supported OS - Windows 10, Windows 8, Windows 7, Linux support available only for USB 3.0 Windows Application features - eCAMView (Part of SDK) DirectShow Compliant application Support for Zoom (10x), Auto Exposure Control (AEC), Auto white balance (AWB) and Autofocus (AF) Burst still capture up to 8 images supported Support for Zoom (10x), Auto Exposure Control (AEC), Auto white balance (AWB) and Autofocus (AF) Burst still capture up to 8 images supported Brightness Contrast Shutter Speed Focus (Continuous, Single and Manual) Zoom (Optical and Digital) White Balance (Manual, Automatic) Auto Exposure Control Orientation (Normal, Flip, Mirror, Flip & Mirror) Scene Mode (Normal and Macro) Focus (Continuous, Single and Manual) Zoom (Optical and Digital) White Balance (Manual, Automatic) Orientation (Normal, Flip, Mirror, Flip & Mirror) Scene Mode (Normal and Macro) Please contact sales@e-consystems.com for any customization requirements. The See3CAM_30Z10X camera supports 10x Optical Zoom and 6x Digital Zoom. The Optical Zoom is implemented through the stepper motor inside the camera. The Zoom (both Optical and Digital) can be controlled from the host PC using the APIs provided by e-con Systems™. Customers who own platforms that support SuperSpeed USB 3.0 and are interested in evaluating the 3.0 MP USB Zoom camera can directly buy the See3CAM_30Z10X from e-con Systems™. In addition to See3CAM_30Z10X, the evaluation kit comes with e-CAMView - Windows sample application for video preview and still capture along with the UVC Extension features (for Windows 10, Windows 8, Windows 7 & Linux *) and support for 4 weeks. For all enquiries please write to sales@e-consystems.com See3CAM_30Z10X - 3 MP USB 3.0 Zoom Camera Dual USB 3.0 Y Cable See3CAM_30Z10X - 3 MP USB 3.0 Zoom Camera Dual USB 3.0 Y Cable Windows 10, Windows 8, Windows 7, Linux * e-CAMView (Windows) - Video Preview and Still Capture Application Windows 10, Windows 8, Windows 7, Linux * e-CAMView (Windows) - Video Preview and Still Capture Application See3CAM_30Z10X - Hardware and Software documents * - Linux support available only for USB 3.0 Do you want a smaller form factor? Do you want LED? Do you want other customization options? » Desktop Magnifier applications: Medical & Life Sciences Biometrics & Access Control Education, Sports & Entertainment Subscribe for latest updates Copyright e-con Systems™ | Site Map",
    "+1 408 766 7503 Details about the way you use the application. Device event information such as crashes, ANRs and hardware settings. As required by law, regulation, legal process or enforceable governmental request. When we believe in good faith that disclosure is necessary to protect our rights, protect your safety or the safety of others, investigate fraud, security or technical issues. With our trusted services providers who work on our behalf, do not have an independent use of the information we disclose to them, and have agreed to adhere to the rules set forth in this privacy statement. If e-con Systems™ is involved in a merger, acquisition, or sale of all or a portion of its assets, you will be notified via email and/or a prominent notice on our website of any change in ownership or uses of this information, as well as any choices you may have regarding this information. To analytics companies as described in the section below CX3 RDK Reference Design Want to be the first to hear about our products? Subscribe to our newsletter. Copyright e-con Systems | Site Map",
    "x +1 408 766 7503 Contact Us Login / Register See3CAM_CU20 - Full HD WDR HDR USB 3.1 Camera Tags: HDR Cameras | Enclosure Cameras Highlights Houses e-CAM20_CU0230_MOD - Full HD onsemi® AR0230AT Image Sensor Fixed Focus Rolling shutter with global reset mode # High Dynamic Range (HDR) On-board high performance ISP SAMPLE PRICE USD 149 Excluding Shipment Charges Documents Overview specifications Software Documents Order Samples Videos Customization Overview See3CAM_CU20 is a Full HD HDR USB camera board with ultra-Lowlight performance. It has an ability to stream seamlessly at wide temperature range (-40°C to 85°C). This Full HD USB 3.1 Gen 1 (5Gb/Sec.) camera is based on 1/2.7\" AR0230AT CMOS digital image sensor with a pixel size of 3.0 μm x 3.0 μm from onsemi@reg;. It has S-mount (M12) lens holder which allows customers to choose and use the lens according to their requirement. It is a Plug-and-Play camera (UVC compliant) for Windows, Linux. This HDR camera is also backward compatible with USB 2.0 host ports. See3CAM_CU20 has a dedicated, high-performance Image Signal Processor chip (ISP) on board, that performs all the Auto functions (Auto White Balance, Auto Exposure control). The ISP and sensor settings have been fine tuned to generate best-in-class video in uncompressed UYVY. Recently we have launched an enclosure for this camera. This aluminium enclosure ensures the safety even at the most challenging conditions. It is FCC and CE compliance camera. Refer Datasheet for more details. Specifications Key features: Frame Rate: Streams HD @ 45 fps , Full HD @ 30 fps & VGA @ 60fps Refer Datasheet for complete frame rate details. Output format: Uncompressed UYVY Supported OS: Windows, Linux, Android* and MAC** 10 pin and 5 pin GPIO header (Only for without enclosure) External Hardware Trigger Input (Only for without enclosure) Sensor Strobe output to connect external flash Unique ID for each camera Lightweight, versatile, and portable two-board solution Interface: Interface:USB 3.1 Gen 1 device Connector: Micro-B interface connector UVC complaint - no additional drivers required Backward compatible with USB 2.0 hosts Module features: Sensor: AR0230AT from onsemi® Focus Type: Fixed focus Sensor Resolution: Full HD Chroma: Color Shutter Type: Electronic Rolling Shutter with global reset mode # Optical Format: 1/2.7\" Output Format: Uncompressed UYVY Pixel Size: 3.0μm x 3.0μm pixel Sensor Active Area: 1928(H) x 1088(V) Array Size:1928 x 1088 pixel Responsivity: 4.0 V/lux-sec SNR: 41 dB Dynamic Range: Max upto 96 dB FOV: 128.99°(D), 110.95°(H), 60.62°(V) (with the lens provided by e-con) Electrical and Mechanical: Operating Voltage: 5V +/- 5% Operating Temperature Range: -40°C to 85°C Power Requirements: Max : 2.07W, Min: 1.59W Size in mm (l x b x h): Without Enclosure: Without Lens: 30 x 30 x 30.2 mm With Enclosure: Without Lens: 35.3 x 35.3 x 29 mm Board Weight: Without Enclosure: Without Lens: 13 Grams With Lens: 19 Grams With Enclosure: Without Lens: 57 Grams With Lens: 63 Grams Miscellaneous: Compliance: FCC, RoHS Launched on : * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android **- For MAC OS support, please contact camerasolutions@e-consystems.com # - Rolling shutter is supported in the default firmware. Customized firmware/hardware is required to use a rolling shutter with Global reset mode. Software Supported OS - Windows 10/8.1, Linux, Android * and MAC ** Sample Application: eCAMView - Windows Camera application for Video Preview and Still Capture. QtCAM - Linux Camera application for Video Preview and Still Capture. Still Image Resolutions: 2 MP (JPG, BMP, RAW, PNG) Still Capture: External trigger signal control *** Software application control Software trigger UVC Controls: Brightness Contrast Sharpness Saturation Gain White Balance (Manual and Auto) Exposure (Manual and Auto) Pan & Tilt Additional Capabilities: Exposure Compensation Color Kill Anti-Flicker-Modus Auto Mode Manual Mode Orientation Horizontal Mirror Vertical flip Sensor Mode Standard Mode HDR Mode Effects Normal Gray scale Burst Image Capture Support for external trigger *** Denoising * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android ** - For MAC OS support, please contact camerasolutions@e-consystems.com *** - Not applicable for camera with enclosure Documents Ordering Info Customers who own platforms that support USB 3.1 Gen 1 (5Gb/Sec.) and are interested in evaluating the Full HD High Dynamic Range USB camera module can directly purchase the See3CAM_CU20 from e-con Systems™. Customers can order See3CAM_CU20 with/without lens. Part No Description Sample Price (1 Unit) Purchase See3CAM_CU20_CH (5s Pack) Full HD USB 3.1 Gen 1(5Gb/Sec.) Camera with S-Mount Holder and Micro-B connector USD 149 (5s Pack) See3CAM_CU20_CHL Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector USD 179 See3CAM_CU20_CHL (5s Pack) Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector USD 169 (5s Pack) See3CAM_CU20_CHLBC_BX_H01R1 Full HD Custom Lens USB 3.1 Gen 1 Camera with S Mount Holder, with Lens, with enclosure and Micro-B connector USD 239 See3CAM_CU20_CH - Full HD USB 3.1 Gen 1(5Gb/Sec.) Camera with S-Mount Holder and Micro-B connector Sample Price (1 Unit) - USD 149 See3CAM_CU20_CHL - Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector Sample Price (1 Unit) - USD 179 See3CAM_CU20_CHL - Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector Sample Price - USD 169 (5s Pack) See3CAM_CU20_CHLBC_BX_H01R1 - Full HD Custom Lens USB 3.1 Gen 1 Camera with S Mount Holder, with Lens, with enclosure and Micro-B connector Sample Price (1 Unit) - USD 239 In addition to See3CAM_CU20, the evaluation kit comes with e-CAMView (Windows8.1/10) / QtCAM (Linux) - Sample application for Video Preview and Still Capture along with the UVC Extension features (for Windows 8.1/10, Linux, Android * and MAC **). For more details, please refer the evaluation kit contents below. For all enquiries please write to sales@e-consystems.com Kit Contents: Hardware: See3CAM_CU20 - Full HD HDR USB Camera with M12 Lens (S-Mount) Holder USB 3.1 Gen 1 Connector types: USB 3.1 Gen 1 Micro-B connector Lens (Optional) Software: (Customers must download the software from e-con Developer Resource) Supported OS: Windows, Linux, Android * and MAC ** e-CAMView (Windows) / QtCAM (Linux) - Video Preview and Still Capture Application Documents: See3CAM_CU20 - Hardware and Software documents * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android ** - For MAC OS support, please contact camerasolutions@e-consystems.com Videos See3CAM_CU20 now comes with Metal Enclosure See3CAM_CU20 - now with enclosure | High Dynamic Range (HDR) USB 3.1 Gen 1 camera See3CAM_CU20 HDR Demo Getting Started with See3CAM_CU20 HDR USB Camera See3CAM_CU20 Low Light Demo Customization See3CAM_CU20 – Customization Do you need a Support for external mechanical shutter? Do you need a Custom lens mount (C-mount/CS-Mount)? Do you want a smaller form factor or single board solution? Do you need LED flash? Complete customization of firmware and hardware as per customer requirements. Please contact us for any customization and additional features. Similar Products: See3CAM_CU81 8MP HDR USB Camera Know More See3CAM_CU22 HDR USB Camera with LFM Know More e-CAM83_USB 4K High resolution HDR USB camera Know More RELATED VIDEOS See3CAM_CU20 now comes with Metal Enclosure See3CAM_CU20 - now with enclosure | High Dynamic Range (HDR) USB 3.1 Gen 1 camera More Videos More Videos Related Articles Why are HDR cameras important - and what are their major embedded vision use cases? What is Signal-to-Noise Ratio (SNR)? Why is SNR important in embedded cameras? Key embedded vision applications of HDR cameras Trigger Modes available in See3CAMs See3CAM_CU20 VS See3CAM_CU30 See3CAM_CU20 - Full HD WDR HDR USB 3.1 Camera Tags: HDR Cameras | Enclosure Cameras Houses e-CAM20_CU0230_MOD - Full HD onsemi® AR0230AT Image Sensor Rolling shutter with global reset mode # High Dynamic Range (HDR) On-board high performance ISP See3CAM_CU20 is a Full HD HDR USB camera board with ultra-Lowlight performance. It has an ability to stream seamlessly at wide temperature range (-40°C to 85°C). This Full HD USB 3.1 Gen 1 (5Gb/Sec.) camera is based on 1/2.7\" AR0230AT CMOS digital image sensor with a pixel size of 3.0 μm x 3.0 μm from onsemi@reg;. It has S-mount (M12) lens holder which allows customers to choose and use the lens according to their requirement. It is a Plug-and-Play camera (UVC compliant) for Windows, Linux. This HDR camera is also backward compatible with USB 2.0 host ports. See3CAM_CU20 has a dedicated, high-performance Image Signal Processor chip (ISP) on board, that performs all the Auto functions (Auto White Balance, Auto Exposure control). The ISP and sensor settings have been fine tuned to generate best-in-class video in uncompressed UYVY. Recently we have launched an enclosure for this camera. This aluminium enclosure ensures the safety even at the most challenging conditions. It is FCC and CE compliance camera. Refer Datasheet for more details. Frame Rate: Streams HD @ 45 fps , Full HD @ 30 fps & VGA @ 60fps Refer Datasheet for complete frame rate details. Output format: Uncompressed UYVY Supported OS: Windows, Linux, Android* and MAC** 10 pin and 5 pin GPIO header (Only for without enclosure) External Hardware Trigger Input (Only for without enclosure) Sensor Strobe output to connect external flash Unique ID for each camera Lightweight, versatile, and portable two-board solution Frame Rate: Streams HD @ 45 fps , Full HD @ 30 fps & VGA @ 60fps Refer Datasheet for complete frame rate details. Streams HD @ 45 fps , Full HD @ 30 fps & VGA @ 60fps Output format: Uncompressed UYVY Supported OS: Windows, Linux, Android* and MAC** 10 pin and 5 pin GPIO header (Only for without enclosure) External Hardware Trigger Input (Only for without enclosure) Sensor Strobe output to connect external flash Unique ID for each camera Lightweight, versatile, and portable two-board solution Interface:USB 3.1 Gen 1 device Connector: Micro-B interface connector UVC complaint - no additional drivers required Backward compatible with USB 2.0 hosts Interface:USB 3.1 Gen 1 device Connector: Micro-B interface connector UVC complaint - no additional drivers required Backward compatible with USB 2.0 hosts Sensor: AR0230AT from onsemi® Focus Type: Fixed focus Sensor Resolution: Full HD Chroma: Color Shutter Type: Electronic Rolling Shutter with global reset mode # Optical Format: 1/2.7\" Output Format: Uncompressed UYVY Pixel Size: 3.0μm x 3.0μm pixel Sensor Active Area: 1928(H) x 1088(V) Array Size:1928 x 1088 pixel Responsivity: 4.0 V/lux-sec SNR: 41 dB Dynamic Range: Max upto 96 dB FOV: 128.99°(D), 110.95°(H), 60.62°(V) (with the lens provided by e-con) Sensor: AR0230AT from onsemi® Focus Type: Fixed focus Sensor Resolution: Full HD Shutter Type: Electronic Rolling Shutter with global reset mode # Output Format: Uncompressed UYVY Pixel Size: 3.0μm x 3.0μm pixel Sensor Active Area: 1928(H) x 1088(V) Array Size:1928 x 1088 pixel Dynamic Range: Max upto 96 dB FOV: 128.99°(D), 110.95°(H), 60.62°(V) (with the lens provided by e-con) Operating Voltage: 5V +/- 5% Operating Temperature Range: -40°C to 85°C Power Requirements: Max : 2.07W, Min: 1.59W Size in mm (l x b x h): Without Enclosure: Without Lens: 30 x 30 x 30.2 mm With Enclosure: Without Lens: 35.3 x 35.3 x 29 mm Board Weight: Without Enclosure: Without Lens: 13 Grams With Lens: 19 Grams With Enclosure: Without Lens: 57 Grams With Lens: 63 Grams Operating Voltage: 5V +/- 5% Operating Temperature Range: -40°C to 85°C Power Requirements: Max : 2.07W, Min: 1.59W Size in mm (l x b x h): Without Enclosure: Without Lens: 30 x 30 x 30.2 mm With Enclosure: Without Lens: 35.3 x 35.3 x 29 mm Without Enclosure: Without Lens: 30 x 30 x 30.2 mm Without Lens: 30 x 30 x 30.2 mm With Enclosure: Without Lens: 35.3 x 35.3 x 29 mm Without Lens: 35.3 x 35.3 x 29 mm Board Weight: Without Enclosure: Without Lens: 13 Grams With Lens: 19 Grams With Enclosure: Without Lens: 57 Grams With Lens: 63 Grams Without Enclosure: Without Lens: 13 Grams With Lens: 19 Grams Without Lens: 13 Grams With Lens: 19 Grams With Enclosure: Without Lens: 57 Grams With Lens: 63 Grams Without Lens: 57 Grams With Lens: 63 Grams * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android **- For MAC OS support, please contact camerasolutions@e-consystems.com # - Rolling shutter is supported in the default firmware. Customized firmware/hardware is required to use a rolling shutter with Global reset mode. Supported OS - Windows 10/8.1, Linux, Android * and MAC ** eCAMView - Windows Camera application for Video Preview and Still Capture. QtCAM - Linux Camera application for Video Preview and Still Capture. eCAMView - Windows Camera application for Video Preview and Still Capture. QtCAM - Linux Camera application for Video Preview and Still Capture. 2 MP (JPG, BMP, RAW, PNG) 2 MP (JPG, BMP, RAW, PNG) External trigger signal control *** Software application control Software trigger External trigger signal control *** Brightness Contrast Sharpness Saturation Gain White Balance (Manual and Auto) Exposure (Manual and Auto) Pan & Tilt Additional Capabilities: Exposure Compensation Color Kill Anti-Flicker-Modus Auto Mode Manual Mode Orientation Horizontal Mirror Vertical flip Sensor Mode Standard Mode HDR Mode Effects Normal Gray scale Burst Image Capture Support for external trigger *** Denoising White Balance (Manual and Auto) Exposure (Manual and Auto) Exposure Compensation Color Kill Anti-Flicker-Modus Auto Mode Manual Mode Orientation Horizontal Mirror Vertical flip Sensor Mode Standard Mode HDR Mode Effects Normal Gray scale Burst Image Capture Support for external trigger *** Denoising Anti-Flicker-Modus Auto Mode Manual Mode Orientation Horizontal Mirror Vertical flip Sensor Mode Standard Mode HDR Mode Effects Normal Gray scale Support for external trigger *** * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android ** - For MAC OS support, please contact camerasolutions@e-consystems.com *** - Not applicable for camera with enclosure Customers who own platforms that support USB 3.1 Gen 1 (5Gb/Sec.) and are interested in evaluating the Full HD High Dynamic Range USB camera module can directly purchase the See3CAM_CU20 from e-con Systems™. Customers can order See3CAM_CU20 with/without lens. See3CAM_CU20_CH - Full HD USB 3.1 Gen 1(5Gb/Sec.) Camera with S-Mount Holder and Micro-B connector Sample Price (1 Unit) - USD 149 See3CAM_CU20_CHL - Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector Sample Price (1 Unit) - USD 179 See3CAM_CU20_CHL - Full HD Custom Lens USB 3.1 Gen 1(5Gb/Sec.) Camera with S Mount Holder, with Lens and Micro-B connector Sample Price - USD 169 (5s Pack) See3CAM_CU20_CHLBC_BX_H01R1 - Full HD Custom Lens USB 3.1 Gen 1 Camera with S Mount Holder, with Lens, with enclosure and Micro-B connector Sample Price (1 Unit) - USD 239 In addition to See3CAM_CU20, the evaluation kit comes with e-CAMView (Windows8.1/10) / QtCAM (Linux) - Sample application for Video Preview and Still Capture along with the UVC Extension features (for Windows 8.1/10, Linux, Android * and MAC **). For more details, please refer the evaluation kit contents below. For all enquiries please write to sales@e-consystems.com See3CAM_CU20 - Full HD HDR USB Camera with M12 Lens (S-Mount) Holder USB 3.1 Gen 1 Connector types: USB 3.1 Gen 1 Micro-B connector Lens (Optional) See3CAM_CU20 - Full HD HDR USB Camera with M12 Lens (S-Mount) Holder USB 3.1 Gen 1 Connector types: USB 3.1 Gen 1 Micro-B connector Software: (Customers must download the software from e-con Developer Resource) Supported OS: Windows, Linux, Android * and MAC ** e-CAMView (Windows) / QtCAM (Linux) - Video Preview and Still Capture Application Supported OS: Windows, Linux, Android * and MAC ** e-CAMView (Windows) / QtCAM (Linux) - Video Preview and Still Capture Application See3CAM_CU20 - Hardware and Software documents See3CAM_CU20 - Hardware and Software documents * - Customers interested to work on Android would require e-con SDK ( Webeecam ). The specs mentioned above shall not be the same for Android ** - For MAC OS support, please contact camerasolutions@e-consystems.com Do you need a Support for external mechanical shutter? Do you need a Custom lens mount (C-mount/CS-Mount)? Do you want a smaller form factor or single board solution? Do you need LED flash? Complete customization of firmware and hardware as per customer requirements. Please contact us for any customization and additional features. Why are HDR cameras important - and what are their major embedded vision use cases? What is Signal-to-Noise Ratio (SNR)? Why is SNR important in embedded cameras? Key embedded vision applications of HDR cameras Trigger Modes available in See3CAMs Resources About us Contact us Locations Our Partners Careers Camera Products Camera Selector USB 3.0 Cameras Camera Modules Industrial Cameras Board Cameras USB 2.0 Cameras GMSL Cameras OEM & Custom Cameras FOV Calculator Resources Online Store View Cart Track Orders Blog Articles Webinars RMA Policy Warranty Product Compliance Company About Us News Tradeshows & Events Videos Press Releases Our Partners Testimonials Locations Careers vMeasure Help Contact Us Support Center Get Quote Create Tickets Social Copyright e-con Systems™ | Site Map OEM & Custom Cameras Copyright e-con Systems™ | Site Map",
    "Ready to Deploy Vision IP Cores For all your Imaging Needs TintE - ISP IP Core Vision Aggregator IP Core Vision Bridging IP Core Vision Multiplier IP Core TintE - ISP IP Core Vision Aggregator IP Core Vision Bridging IP Core Vision Multiplier IP Core TintE™ ISP, developed by e-con Systems®, is an FPGA-based ISP that offers a complete and customizable pipeline with essential features like debayering, AWB, and gamma correction. Adaptable to various FPGA platforms, TintE ensures superior image quality for modern imaging needs. Flexible - Select the IP Cores that fit your specific application needs. Customizable - Works with any sensor Portable - Easily deploy into any FPGA Know More Combine data streams from up to 16 cameras into a single, high-performance Interface output, ideal for 360° Surround View, ADAS, and other applications. Overcome video interface limitations with ease. Flexible Interface Options with up to 4 lanes at 2.5 Gbps per lane Ultra-Low Latency for real-time performance Simplified Design with an integrated arbiter module Know More Ensures seamless connectivity, supporting high-performance data transfer across multiple standards like PCI Gen3/Gen4, MIPI 2.5Gbps, high-speed LVDS. With configurable options, these cores enable smooth integration into existing FPGA or SoC designs, reducing design time and complexity. Seamless Data Transfer Across Multiple Interfaces High-Performance Data Transfer Seamless FPGA/SoC Integration Configurable and Customizable IP Blocks Know More Enables the simultaneous use of a single video feed across multiple outputs, mimicking a multi-camera setup and allowing for monitoring on various devices or screens. Versatile Video Input Compatibility Adaptive Splitting Options Wide-Angle Image Integration Virtual Channel Management Contact Us TintE™ ISP, developed by e-con Systems®, is an FPGA-based ISP that offers a complete and customizable pipeline with essential features like debayering, AWB, and gamma correction. Adaptable to various FPGA platforms, TintE ensures superior image quality for modern imaging needs. Flexible - Select the IP Cores that fit your specific application needs. Customizable - Works with any sensor Portable - Easily deploy into any FPGA Combine data streams from up to 16 cameras into a single, high-performance Interface output, ideal for 360° Surround View, ADAS, and other applications. Overcome video interface limitations with ease. Flexible Interface Options with up to 4 lanes at 2.5 Gbps per lane Ultra-Low Latency for real-time performance Simplified Design with an integrated arbiter module Ensures seamless connectivity, supporting high-performance data transfer across multiple standards like PCI Gen3/Gen4, MIPI 2.5Gbps, high-speed LVDS. With configurable options, these cores enable smooth integration into existing FPGA or SoC designs, reducing design time and complexity. Seamless Data Transfer Across Multiple Interfaces Configurable and Customizable IP Blocks Enables the simultaneous use of a single video feed across multiple outputs, mimicking a multi-camera setup and allowing for monitoring on various devices or screens. Versatile Video Input Compatibility OEM & Custom Cameras Copyright © e-con Systems® | Site Map",
    "+1 408 766 7503 Buy e-con's Products Online See3CAM_CU135 See3CAM_130 See3CAM_CU55 See3CAM_CU55M See3CAM_CU30 Denebola e-CAM50_CUNX e-CAM130A_CUXVR Special Features : ISP, 4K @30fps in MJPEG Special Features : Auto focus, iHDR, 4K @30fps Special Features : ISP, 4K @30fps in MJPEG Special Features : ISP, 4K @30fps in MJPEG Special Features : 5MP @60fps in MJPEG, Low Noise Special Features : FHD @ 60fps and 5MP @ 30fps, Monochrome Special Features : 1080p @60fps Uncompressed Special Features : 1080p @60fps Uncompressed Special Features : Low Light, Auto focus, 1080p @60fps and @30fps Uncompressed Special Features : High Frame Rate (HFR), High Near-Infrared (Hi-NIR) Special Features : High Dynamic Range, Wide Temperature Range, Led flicker mitigation (LFM) Special Features : High Dynamic Range, Wide Temperature Range Special Features : Global shutter in Mono Special Features : Stereoscopy, Tara SDK's Special Features : Stereoscopy, CUDA® Accelerated SDK's Special Features : ((2*1600) x 1300) @ 30 fps, CUDA® Accelerated SDK's Special Features : Monochrome, GRR (Global Reset Release) Trigger Special Features : Stereo microphone providing 16 bit audio @ 48KHz Special Features : NIR sensitive Special Features : NIR sensitive Special Features : Global shutter with ISP Special Features : Global shutter with ISP Special Features : Global shutter in Raw bayer Special Features : Ultra low-light, 1920 x 1072 @60fps in MJPEG Special Features : Full HD (1080p) @120fps Offer Closes on Nov 12 th 2020 Special Features : Full HD (1080p) 60 fps in UYVY Special Features : Full HD (1080p) @65fps in UYVY Note: Please make sure you choose the right part number before purchasing. Note: Please make sure you choose the right part number before purchasing. Special Features : ISP, Full HD @30fps in UYVY Special Features : ISP, 3.4 MP @48fps in MJPEG Special Features : ISP, FHD @45fps in UYVY Special Features : ISP, 3.4 MP @48fps in MJPEG Note: You would require an external ISP to process the data. Contact us to purchase the ISP. CX3 RDK Reference Design Medical & Life Sciences Biometrics & Access Control Education, Sports & Entertainment Subscribe for latest updates Copyright e-con Systems™ | Site Map"
  ]
}