{
  "company": "www.datasetshop.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 10,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 10,
      "0": 3
    }
  },
  "sample_docs": [
    "This End User License Agreement (\"EULA\") applies to the End User's (\"End User\", \"you,\" or \"your\") use of the vAIsual Datasets (the \"Dataset\") exclusively for the purposes set forth herein. The EULA also governs the relationship between you and vAIsual, Inc. (\"vAIsual\") with respect to use of the Dataset. This EULA will become effective on the earlier of the date that the End User first uses or accesses the Dataset, or the date that End User accepts (either by clicking a box that states you accept or providing written agreement to) this EULA or any order form for the Dataset that incorporates this EULA by reference (the \"Effective Date\"). EULA. Subject to compliance with the of this EULA, vAIsual grants the End User a personal, non-exclusive, non-sublicenseable and non-transferable, limited, revocable license to use the Dataset; provided that such use shall not extend to the creation of Synthetic Media. \"Synthetic Media\" is media that is generated through artificial production, manipulation, or modification by automated means, including but not limited through the use of artificial intelligence algorithms. In no event may End User upload or share any portion of the Dataset to any public directory. You acknowledge and agree that in no event may End User use the Dataset in a manner that violates applicable law, or for any threatening, inflammatory, harassing, abusive, obscene, racially or ethnically or otherwise objectionable, libelous, defamatory manner, or contain any pornography. Scope. End User may use the Dataset only with active subscription. End User shall not publish any portion of the Dataset as images directly. The Dataset shall be used exclusively for machine learning purposes. All generated and trained AI models resulting of the use of Datasets remain the sole property of the End User and vAIsual makes no claims. Datasets can be used by the End User for any machine learning purposes and training neural networks of any kind for any application. Other than the granting of rights as set forth in this Section Error: Reference source not found, End User is shall not perform any other acts in relation to the Dataset or the data contained in the Dataset. Therefore - among other things - the End User may not: distribute, rent, loan, lease, sell, sublicense, assign or transfer all or any portion of the Dataset, or any rights granted in this EULA, to any other person or entity, or copy or process any data of the vAIsual Dataset for any purpose other than the permitted use as set forth in in this Section Error: Reference source not found. In no event shall the End User reproduce, disseminate or publicly display the vAIsual Dataset as a whole or any part thereof to any other person or entity (e.g. via the world wide web (internet) or any other means of data transfer). If You breach this EULA (e.g. by using the Dataset in a prohibited manner or by making the Dataset wholly or partly available to third-parties, then You agree You are liable to vAIsual for the liquidated damages specified in Article 7 and 8 of this EULA. vAIsual may, at any time, impose restrictions or prohibitions on the use of the Dataset: (i) to the extent they are imposed on vAIsual by applicable laws or any judicial or regulatory interpretations thereof, or data subjects that have contributed to the Dataset; or (ii) as reasonably necessary, in vAIsual's judgment, to properly manage the integrity of the Dataset in light of issues concerning privacy, confidentiality, and other issues to which consumers may be sensitive (collectively, \"Additional Restrictions\"). End User agrees to strictly comply with such Additional Restrictions. Intellectual Property Rights. The datasets that make-up the Dataset remain the exclusive Intellectual Property of vAIsual. This means that while vAIsual grants usage rights to the Dataset, vAIsual continue to own all right, title and interest, including but not limited to Intellectual Property Rights, in and to the Dataset. Any Intellectual Property Rights to the Datasets and its augmentations are the exclusive property of vAIsual. vAIsual has no right over resulting trained model files. Nothing in this EULA constitutes a transfer of any of vAIsual's Intellectual Property Rights to End User. For the purposes of this EULA, Intellectual Property Rights means all intellectual property rights recognized by any government anywhere in the world, including patents, registered and unregistered trademarks and service marks, domain names, registered designs and design rights, copyright (including such rights in computer software and databases), database rights and moral rights (in each case for the full period thereof and extensions, revivals and renewals thereof), applications for the foregoing and the right to apply for any of the foregoing anywhere in the world, and all similar rights anywhere in the world, to the greatest extent permitted by law, including those subsisting in inventions, designs, drawings and computer programs. Guarantees and Warranties. The Dataset made available is provided \"as is\" without vAIsual's warranty of any kind, either express or implied, including, but not limited to, any implied warranty against infringement of third-parties' rights including but not limited to Intellectual Property Rights, or any other warranties of merchantability and fitness for a particular purpose. Despite vAIsual's efforts to ensure that (parts of the) vAIsual Dataset are not covered by rights of third parties, vAIsual cannot warrant that third parties are able to enforce their rights or to make claims in relation to the vAIsual Dataset. End User shall inform vAIsual immediately In Writing if it becomes aware of such third-party claims. Parties shall then discuss the merits of the third parties' claims and how to deal with these claims. Fees. Upon execution of this EULA, End User shall pay vAIsual a subscription fee, in accordance with the plan chosen by the user, for access to the Dataset (the \"License Fee\"). Upon payment of the License Fee, End User will be granted access to the datasets and may download or use the datasets for the period of an active subscription or up to 30 days after the subscription terminates, unless the subscription is renewed. End User shall have an unlimited right to use the Dataset for the period and outlined in Section Error: Reference source not found (for the duration of an active subscription) and unlimited rights without further restrictions for resulting AI generated models, subject to the of this EULA. Term and Termination; Dataset Deletion. Term. This EULA will commence upon the Effective Date and continue until the applicable subscription term has expired, unless earlier terminated in accordance with this EULA. Termination for Cause. Either party may terminate this EULA, effective immediately upon written notice to the other party, if such party breaches any provision of this EULA and does not cure the breach within 30 days after receiving written notice thereof; provided, however, vAIsual may terminate this EULA, effective immediately upon written notice to End User without any opportunity to cure, if End User uses the Dataset in a manner that is not authorized by this EULA. Effect of Termination. Upon termination or expiration of this EULA, (i) all license rights granted in this EULA will immediately cease to exist; and (ii) End User will irrecoverably delete the Dataset and End User will be required to execute a Data Deletion Acknowledgement in a form provided by vAIsual. Termination for any reason shall not relieve End User of the obligation to pay any fees accrued or payable to vAIsual (including, if applicable, any committed fees for the remainder of the subscription term following the date of termination). Records and Audit. End User will maintain business and financial records for a continuing (rolling) period of three years that contain information sufficient to verify End User's compliance with the of this EULA, including: (i) the completeness and accuracy of payments made in connection with this EULA; (ii) that the use of Dataset complies with this EULA; and (iii) following the termination of this EULA, that the Dataset has been deleted in accordance with this EULA. Without limitation to vAIsual's rights under any other provision hereof, End User will permit vAIsual, or its representatives, to conduct periodic inspections or audits (\"Audits\") of such records. vAIsual may perform such Audits upon provision of at least 10 days advance notice to End User, during End User's normal business hours, and during the subscription term of this EULA and for two years thereafter. vAIsual will pay for the cost of the Audit unless vAIsual reasonably determines from the Audit that End User has breached a material provision of this EULA, in which case End User will be solely responsible for the cost of the Audit and any additional amounts owed as determined by the Audit. Indemnification. vAIsual Indemnification. vAIsual will defend and indemnify End User for a claim by an unaffiliated third party that the Dataset infringes that party's patent, copyright or other intellectual property right issued and existing as of the Effective Date, and will pay the amount of any resulting adverse final judgment issued by a court of competent jurisdiction or of any settlement that we pre-approve in writing; provided that you promptly notify vAIsual in writing of any such claim, give us reasonable cooperation, information, and assistance in connection with it, and consent to the vAIsual's sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be obligated under this section if the infringement results from: (i) your use in a manner inconsistent with the of this EULA; (ii) End User using the Dataset with in a manner not authorized by vAIsual, (iii) use of the Dataset in applications, environments or processes for which it was not designed or contemplated, (iv) corrections, modifications, alterations or enhancements that you make to the Dataset; (v) use of the Dataset by any person or entity other than you or your employees; or (vi) your willful infringement. Enjoined Use. If we believe the Dataset may be or is subject to an infringement claim, or if a court of competent jurisdiction enjoins your use of the Dataset as a result of an infringement claim, vAIsual may, at our expense and our discretion: (a) procure for you the right to continue using the Dataset; (b) modify the Dataset to make it non-infringing; or (c) replace it with a non-infringing equivalent. If we believe that none of these options is reasonably available, then we may terminate the license to the allegedly infringing Dataset and our sole liability will be to refund to you the license fees you paid for such Dataset. End User Indemnification. End User will defend, indemnify and hold vAIsual harmless from any and all liabilities, damages, losses, expenses, demands, claims, suits or judgments, including reasonable attorneys' fees, costs and expenses arising from End User's unauthorized use of the Dataset, the use of the output of any Dataset or End User's failure to comply with the of this EULA. vAIsual will promptly notify you in writing of any such claim, give you reasonable cooperation, information and assistance in connection with it, and consent to your sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be responsible for any direct or indirect loss or damage that may result from such unauthorized use. Limitation Of Liability. vAIsual shall not be liable for any damages resulting from the use of, the inability to use, or the improper use of (in violation of any provision of this EULA, including Section 1.2, the Dataset or the results received from use of the Dataset (by you or any person for whom you provide services or the output of the Dataset), including damages caused by malware, viruses or any incorrectness or incompleteness of the information obtained, unless such damage is the result of any willful misconduct or from gross negligence on the part of the Company. VAISUAL WILL NOT BE LIABLE IN ANY EVENT TO YOU OR ANY OTHER PERSON, REGARDLESS OF THE CAUSE, FOR THE EFFECTIVENESS OR ACCURACY OF THE DATASET, FOR THE COST OF PROCURING REPLACEMENT GOODS OR SERVICES, OR FOR LOST PROFITS OR LOST SALES, OR FOR ANY SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, MULTIPLE OR CONSEQUENTIAL DAMAGES ARISING FROM OR OCCASIONED BY YOUR USE OF THE PRODUCTS, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. MAXIMUM LIABILITY. IN ANY EVENT, VAISUAL'S MAXIMUM LIABILITY FOR ANY CLAIM ARISING IN CONNECTION WITH THIS EULA WILL NOT EXCEED THE FEES YOU HAVE PAID WITH RESPECT TO THE PRODUCTS OR SERVICES AT ISSUE. APPLICABILITY OF DISCLAIMERS AND LIMITATIONS. End User agrees that vAIsual has set its prices and entered into this Agreement in reliance upon the disclaimers and limitations in this section and that these disclaimers and limitations allocate risk between you and the Company and are an essential part of the bargain between us. Changes. vAIsual reserves the right to revise and update this EULA periodically. New EULAs, such as changed or modified EULAs, shall be provided to You. You may be enabled to agree or decline to the as set forth in the revised EULA. If you decline to accept new set forth in any revised versions of the EULA, you will not be permitted to access the vAIsual Dataset. Choice of Law and Venue. The validity of the EULA, its construction, interpretation, and enforcement, and the rights of the parties hereto shall be determined under, governed by, and construed in accordance with the laws of the State of Delaware (USA). The Parties agree that all actions or proceedings arising in connection with the EULA shall be tried and litigated exclusively in the state and federal courts located in the State of Delaware, and irrevocably consent to the jurisdiction of such courts. Miscellaneous. All provisions that are intended to survive the termination, by nature or because such has expressly been provided for in this EULA, shall survive such termination. These provisions include, but are not limited to, provisions regarding the intellectual property rights, warrantees, limitations of liability, and choice of law and venue. If any provision of the EULA is held invalid or unenforceable, that provision will be construed to reflect vAIsual's original intent. Despite the invalidity or unenforceability of such provision, all other provisions will remain in full force and effect. If vAIsual does not exercise or enforce any legal right or remedy, this will not constitute a formal waiver of vAIsual's rights. This EULA supersedes all previous agreements and licenses, verbal or written, regarding any dealings with respect to the subject matter of this EULA. The headings contained in this EULA are for reference purposes only and shall not affect in any way the meaning or interpretation of this EULA. Export. End Users agrees not to export, re-export, or provide the Dataset or any derivative works created from the Dataset to (i) any country to which the United States has embargoed goods; (ii) any person on the U.S. Treasury Department's list of Specially Designated Nationals; (iii) any person or entity on the U.S. Commerce Department's Denied Persons List; or (iv) any person or entity where such export, re-export or provision violates any U.S. Export control or regulation. Assignment. End User may not assign, sublicense or transfer its rights or delegate your obligations under this Agreement without vAIsual's written consent. Any attempt by you to transfer this Agreement without vAIsual's consent will be void, the transferee will acquire no rights whatsoever, and the Company will not be required to recognize the transfer. This provision limits both the right and the power to transfer this Agreement and the rights hereunder. PDF Download PDF All Licensing Types Models and Checkpoints Commercial RAIL Responsible AI License (RAIL) for AI models and checkpoints for rights managed generative purposes. Dataset standard license (one-time purchase) Purchasing for all AI training purposes except generative AI models for visual synthetic media. Securing access to the existing dataset and excluding any updates throughout the year of additional images. Dataset standard license (annual subscription) Purchasing for all AI training purposes except generative AI models for visual synthetic media. Securing access to all updates of the datasets throughout the year. Dataset extended license (one-time purchase) Purchasing for the use of the datasets for generative AI models for visual synthetic media. Securing access to the existing dataset and excluding any updates throughout the year of additional images. Dataset extended license (annual subscription) Purchasing for the use of the datasets for generative AI models for visual synthetic media. Securing access to all updates of the datasets throughout the year. This End User License Agreement (\"EULA\") applies to the End User's (\"End User\", \"you,\" or \"your\") use of the vAIsual Datasets (the \"Dataset\") exclusively for the purposes set forth herein. The EULA also governs the relationship between you and vAIsual, Inc. (\"vAIsual\") with respect to use of the Dataset. This EULA will become effective on the earlier of the date that the End User first uses or accesses the Dataset, or the date that End User accepts (either by clicking a box that states you accept or providing written agreement to) this EULA or any order form for the Dataset that incorporates this EULA by reference (the \"Effective Date\"). EULA. Subject to compliance with the of this EULA, vAIsual grants the End User a personal, non-exclusive, non-sublicenseable and non-transferable, limited, revocable license to use the Dataset; provided that such use shall not extend to the creation of Synthetic Media. \"Synthetic Media\" is media that is generated through artificial production, manipulation, or modification by automated means, including but not limited through the use of artificial intelligence algorithms. In no event may End User upload or share any portion of the Dataset to any public directory. You acknowledge and agree that in no event may End User use the Dataset in a manner that violates applicable law, or for any threatening, inflammatory, harassing, abusive, obscene, racially or ethnically or otherwise objectionable, libelous, defamatory manner, or contain any pornography. Subject to compliance with the of this EULA, vAIsual grants the End User a personal, non-exclusive, non-sublicenseable and non-transferable, limited, revocable license to use the Dataset; provided that such use shall not extend to the creation of Synthetic Media. \"Synthetic Media\" is media that is generated through artificial production, manipulation, or modification by automated means, including but not limited through the use of artificial intelligence algorithms. In no event may End User upload or share any portion of the Dataset to any public directory. Subject to compliance with the of this EULA, vAIsual grants the End User a personal, non-exclusive, non-sublicenseable and non-transferable, limited, revocable license to use the Dataset; provided that such use shall not extend to the creation of Synthetic Media. \"Synthetic Media\" is media that is generated through artificial production, manipulation, or modification by automated means, including but not limited through the use of artificial intelligence algorithms. In no event may End User upload or share any portion of the Dataset to any public directory. You acknowledge and agree that in no event may End User use the Dataset in a manner that violates applicable law, or for any threatening, inflammatory, harassing, abusive, obscene, racially or ethnically or otherwise objectionable, libelous, defamatory manner, or contain any pornography. You acknowledge and agree that in no event may End User use the Dataset in a manner that violates applicable law, or for any threatening, inflammatory, harassing, abusive, obscene, racially or ethnically or otherwise objectionable, libelous, defamatory manner, or contain any pornography. Scope. End User may use the Dataset only with active subscription. End User shall not publish any portion of the Dataset as images directly. The Dataset shall be used exclusively for machine learning purposes. All generated and trained AI models resulting of the use of Datasets remain the sole property of the End User and vAIsual makes no claims. Datasets can be used by the End User for any machine learning purposes and training neural networks of any kind for any application. Other than the granting of rights as set forth in this Section Error: Reference source not found, End User is shall not perform any other acts in relation to the Dataset or the data contained in the Dataset. Therefore - among other things - the End User may not: distribute, rent, loan, lease, sell, sublicense, assign or transfer all or any portion of the Dataset, or any rights granted in this EULA, to any other person or entity, or copy or process any data of the vAIsual Dataset for any purpose other than the permitted use as set forth in in this Section Error: Reference source not found. In no event shall the End User reproduce, disseminate or publicly display the vAIsual Dataset as a whole or any part thereof to any other person or entity (e.g. via the world wide web (internet) or any other means of data transfer). If You breach this EULA (e.g. by using the Dataset in a prohibited manner or by making the Dataset wholly or partly available to third-parties, then You agree You are liable to vAIsual for the liquidated damages specified in Article 7 and 8 of this EULA. vAIsual may, at any time, impose restrictions or prohibitions on the use of the Dataset: (i) to the extent they are imposed on vAIsual by applicable laws or any judicial or regulatory interpretations thereof, or data subjects that have contributed to the Dataset; or (ii) as reasonably necessary, in vAIsual's judgment, to properly manage the integrity of the Dataset in light of issues concerning privacy, confidentiality, and other issues to which consumers may be sensitive (collectively, \"Additional Restrictions\"). End User agrees to strictly comply with such Additional Restrictions. End User may use the Dataset only with active subscription. End User shall not publish any portion of the Dataset as images directly. The Dataset shall be used exclusively for machine learning purposes. All generated and trained AI models resulting of the use of Datasets remain the sole property of the End User and vAIsual makes no claims. End User may use the Dataset only with active subscription. End User shall not publish any portion of the Dataset as images directly. The Dataset shall be used exclusively for machine learning purposes. All generated and trained AI models resulting of the use of Datasets remain the sole property of the End User and vAIsual makes no claims. Datasets can be used by the End User for any machine learning purposes and training neural networks of any kind for any application. Datasets can be used by the End User for any machine learning purposes and training neural networks of any kind for any application. Other than the granting of rights as set forth in this Section Error: Reference source not found, End User is shall not perform any other acts in relation to the Dataset or the data contained in the Dataset. Therefore - among other things - the End User may not: distribute, rent, loan, lease, sell, sublicense, assign or transfer all or any portion of the Dataset, or any rights granted in this EULA, to any other person or entity, or copy or process any data of the vAIsual Dataset for any purpose other than the permitted use as set forth in in this Section Error: Reference source not found. Other than the granting of rights as set forth in this Section Error: Reference source not found, End User is shall not perform any other acts in relation to the Dataset or the data contained in the Dataset. Therefore - among other things - the End User may not: distribute, rent, loan, lease, sell, sublicense, assign or transfer all or any portion of the Dataset, or any rights granted in this EULA, to any other person or entity, or copy or process any data of the vAIsual Dataset for any purpose other than the permitted use as set forth in in this Section Error: Reference source not found. In no event shall the End User reproduce, disseminate or publicly display the vAIsual Dataset as a whole or any part thereof to any other person or entity (e.g. via the world wide web (internet) or any other means of data transfer). In no event shall the End User reproduce, disseminate or publicly display the vAIsual Dataset as a whole or any part thereof to any other person or entity (e.g. via the world wide web (internet) or any other means of data transfer). If You breach this EULA (e.g. by using the Dataset in a prohibited manner or by making the Dataset wholly or partly available to third-parties, then You agree You are liable to vAIsual for the liquidated damages specified in Article 7 and 8 of this EULA. If You breach this EULA (e.g. by using the Dataset in a prohibited manner or by making the Dataset wholly or partly available to third-parties, then You agree You are liable to vAIsual for the liquidated damages specified in Article 7 and 8 of this EULA. vAIsual may, at any time, impose restrictions or prohibitions on the use of the Dataset: (i) to the extent they are imposed on vAIsual by applicable laws or any judicial or regulatory interpretations thereof, or data subjects that have contributed to the Dataset; or (ii) as reasonably necessary, in vAIsual's judgment, to properly manage the integrity of the Dataset in light of issues concerning privacy, confidentiality, and other issues to which consumers may be sensitive (collectively, \"Additional Restrictions\"). End User agrees to strictly comply with such Additional Restrictions. vAIsual may, at any time, impose restrictions or prohibitions on the use of the Dataset: (i) to the extent they are imposed on vAIsual by applicable laws or any judicial or regulatory interpretations thereof, or data subjects that have contributed to the Dataset; or (ii) as reasonably necessary, in vAIsual's judgment, to properly manage the integrity of the Dataset in light of issues concerning privacy, confidentiality, and other issues to which consumers may be sensitive (collectively, \"Additional Restrictions\"). End User agrees to strictly comply with such Additional Restrictions. Intellectual Property Rights. The datasets that make-up the Dataset remain the exclusive Intellectual Property of vAIsual. This means that while vAIsual grants usage rights to the Dataset, vAIsual continue to own all right, title and interest, including but not limited to Intellectual Property Rights, in and to the Dataset. Any Intellectual Property Rights to the Datasets and its augmentations are the exclusive property of vAIsual. vAIsual has no right over resulting trained model files. Nothing in this EULA constitutes a transfer of any of vAIsual's Intellectual Property Rights to End User. For the purposes of this EULA, Intellectual Property Rights means all intellectual property rights recognized by any government anywhere in the world, including patents, registered and unregistered trademarks and service marks, domain names, registered designs and design rights, copyright (including such rights in computer software and databases), database rights and moral rights (in each case for the full period thereof and extensions, revivals and renewals thereof), applications for the foregoing and the right to apply for any of the foregoing anywhere in the world, and all similar rights anywhere in the world, to the greatest extent permitted by law, including those subsisting in inventions, designs, drawings and computer programs. The datasets that make-up the Dataset remain the exclusive Intellectual Property of vAIsual. This means that while vAIsual grants usage rights to the Dataset, vAIsual continue to own all right, title and interest, including but not limited to Intellectual Property Rights, in and to the Dataset. The datasets that make-up the Dataset remain the exclusive Intellectual Property of vAIsual. This means that while vAIsual grants usage rights to the Dataset, vAIsual continue to own all right, title and interest, including but not limited to Intellectual Property Rights, in and to the Dataset. Any Intellectual Property Rights to the Datasets and its augmentations are the exclusive property of vAIsual. vAIsual has no right over resulting trained model files. Any Intellectual Property Rights to the Datasets and its augmentations are the exclusive property of vAIsual. vAIsual has no right over resulting trained model files. Nothing in this EULA constitutes a transfer of any of vAIsual's Intellectual Property Rights to End User. Nothing in this EULA constitutes a transfer of any of vAIsual's Intellectual Property Rights to End User. For the purposes of this EULA, Intellectual Property Rights means all intellectual property rights recognized by any government anywhere in the world, including patents, registered and unregistered trademarks and service marks, domain names, registered designs and design rights, copyright (including such rights in computer software and databases), database rights and moral rights (in each case for the full period thereof and extensions, revivals and renewals thereof), applications for the foregoing and the right to apply for any of the foregoing anywhere in the world, and all similar rights anywhere in the world, to the greatest extent permitted by law, including those subsisting in inventions, designs, drawings and computer programs. For the purposes of this EULA, Intellectual Property Rights means all intellectual property rights recognized by any government anywhere in the world, including patents, registered and unregistered trademarks and service marks, domain names, registered designs and design rights, copyright (including such rights in computer software and databases), database rights and moral rights (in each case for the full period thereof and extensions, revivals and renewals thereof), applications for the foregoing and the right to apply for any of the foregoing anywhere in the world, and all similar rights anywhere in the world, to the greatest extent permitted by law, including those subsisting in inventions, designs, drawings and computer programs. Guarantees and Warranties. The Dataset made available is provided \"as is\" without vAIsual's warranty of any kind, either express or implied, including, but not limited to, any implied warranty against infringement of third-parties' rights including but not limited to Intellectual Property Rights, or any other warranties of merchantability and fitness for a particular purpose. Despite vAIsual's efforts to ensure that (parts of the) vAIsual Dataset are not covered by rights of third parties, vAIsual cannot warrant that third parties are able to enforce their rights or to make claims in relation to the vAIsual Dataset. End User shall inform vAIsual immediately In Writing if it becomes aware of such third-party claims. Parties shall then discuss the merits of the third parties' claims and how to deal with these claims. The Dataset made available is provided \"as is\" without vAIsual's warranty of any kind, either express or implied, including, but not limited to, any implied warranty against infringement of third-parties' rights including but not limited to Intellectual Property Rights, or any other warranties of merchantability and fitness for a particular purpose. The Dataset made available is provided \"as is\" without vAIsual's warranty of any kind, either express or implied, including, but not limited to, any implied warranty against infringement of third-parties' rights including but not limited to Intellectual Property Rights, or any other warranties of merchantability and fitness for a particular purpose. Despite vAIsual's efforts to ensure that (parts of the) vAIsual Dataset are not covered by rights of third parties, vAIsual cannot warrant that third parties are able to enforce their rights or to make claims in relation to the vAIsual Dataset. End User shall inform vAIsual immediately In Writing if it becomes aware of such third-party claims. Parties shall then discuss the merits of the third parties' claims and how to deal with these claims. Despite vAIsual's efforts to ensure that (parts of the) vAIsual Dataset are not covered by rights of third parties, vAIsual cannot warrant that third parties are able to enforce their rights or to make claims in relation to the vAIsual Dataset. End User shall inform vAIsual immediately In Writing if it becomes aware of such third-party claims. Parties shall then discuss the merits of the third parties' claims and how to deal with these claims. Fees. Upon execution of this EULA, End User shall pay vAIsual a subscription fee, in accordance with the plan chosen by the user, for access to the Dataset (the \"License Fee\"). Upon payment of the License Fee, End User will be granted access to the datasets and may download or use the datasets for the period of an active subscription or up to 30 days after the subscription terminates, unless the subscription is renewed. End User shall have an unlimited right to use the Dataset for the period and outlined in Section Error: Reference source not found (for the duration of an active subscription) and unlimited rights without further restrictions for resulting AI generated models, subject to the of this EULA. Upon execution of this EULA, End User shall pay vAIsual a subscription fee, in accordance with the plan chosen by the user, for access to the Dataset (the \"License Fee\"). Upon payment of the License Fee, End User will be granted access to the datasets and may download or use the datasets for the period of an active subscription or up to 30 days after the subscription terminates, unless the subscription is renewed. Upon execution of this EULA, End User shall pay vAIsual a subscription fee, in accordance with the plan chosen by the user, for access to the Dataset (the \"License Fee\"). Upon payment of the License Fee, End User will be granted access to the datasets and may download or use the datasets for the period of an active subscription or up to 30 days after the subscription terminates, unless the subscription is renewed. End User shall have an unlimited right to use the Dataset for the period and outlined in Section Error: Reference source not found (for the duration of an active subscription) and unlimited rights without further restrictions for resulting AI generated models, subject to the of this EULA. End User shall have an unlimited right to use the Dataset for the period and outlined in Section Error: Reference source not found (for the duration of an active subscription) and unlimited rights without further restrictions for resulting AI generated models, subject to the of this EULA. Term and Termination; Dataset Deletion. Term. This EULA will commence upon the Effective Date and continue until the applicable subscription term has expired, unless earlier terminated in accordance with this EULA. Termination for Cause. Either party may terminate this EULA, effective immediately upon written notice to the other party, if such party breaches any provision of this EULA and does not cure the breach within 30 days after receiving written notice thereof; provided, however, vAIsual may terminate this EULA, effective immediately upon written notice to End User without any opportunity to cure, if End User uses the Dataset in a manner that is not authorized by this EULA. Effect of Termination. Upon termination or expiration of this EULA, (i) all license rights granted in this EULA will immediately cease to exist; and (ii) End User will irrecoverably delete the Dataset and End User will be required to execute a Data Deletion Acknowledgement in a form provided by vAIsual. Termination for any reason shall not relieve End User of the obligation to pay any fees accrued or payable to vAIsual (including, if applicable, any committed fees for the remainder of the subscription term following the date of termination). Records and Audit. End User will maintain business and financial records for a continuing (rolling) period of three years that contain information sufficient to verify End User's compliance with the of this EULA, including: (i) the completeness and accuracy of payments made in connection with this EULA; (ii) that the use of Dataset complies with this EULA; and (iii) following the termination of this EULA, that the Dataset has been deleted in accordance with this EULA. Without limitation to vAIsual's rights under any other provision hereof, End User will permit vAIsual, or its representatives, to conduct periodic inspections or audits (\"Audits\") of such records. vAIsual may perform such Audits upon provision of at least 10 days advance notice to End User, during End User's normal business hours, and during the subscription term of this EULA and for two years thereafter. vAIsual will pay for the cost of the Audit unless vAIsual reasonably determines from the Audit that End User has breached a material provision of this EULA, in which case End User will be solely responsible for the cost of the Audit and any additional amounts owed as determined by the Audit. Term and Termination; Dataset Deletion. Term. This EULA will commence upon the Effective Date and continue until the applicable subscription term has expired, unless earlier terminated in accordance with this EULA. Term. This EULA will commence upon the Effective Date and continue until the applicable subscription term has expired, unless earlier terminated in accordance with this EULA. Termination for Cause. Either party may terminate this EULA, effective immediately upon written notice to the other party, if such party breaches any provision of this EULA and does not cure the breach within 30 days after receiving written notice thereof; provided, however, vAIsual may terminate this EULA, effective immediately upon written notice to End User without any opportunity to cure, if End User uses the Dataset in a manner that is not authorized by this EULA. Termination for Cause. Either party may terminate this EULA, effective immediately upon written notice to the other party, if such party breaches any provision of this EULA and does not cure the breach within 30 days after receiving written notice thereof; provided, however, vAIsual may terminate this EULA, effective immediately upon written notice to End User without any opportunity to cure, if End User uses the Dataset in a manner that is not authorized by this EULA. Effect of Termination. Upon termination or expiration of this EULA, (i) all license rights granted in this EULA will immediately cease to exist; and (ii) End User will irrecoverably delete the Dataset and End User will be required to execute a Data Deletion Acknowledgement in a form provided by vAIsual. Termination for any reason shall not relieve End User of the obligation to pay any fees accrued or payable to vAIsual (including, if applicable, any committed fees for the remainder of the subscription term following the date of termination). Effect of Termination. Upon termination or expiration of this EULA, (i) all license rights granted in this EULA will immediately cease to exist; and (ii) End User will irrecoverably delete the Dataset and End User will be required to execute a Data Deletion Acknowledgement in a form provided by vAIsual. Termination for any reason shall not relieve End User of the obligation to pay any fees accrued or payable to vAIsual (including, if applicable, any committed fees for the remainder of the subscription term following the date of termination). Records and Audit. End User will maintain business and financial records for a continuing (rolling) period of three years that contain information sufficient to verify End User's compliance with the of this EULA, including: (i) the completeness and accuracy of payments made in connection with this EULA; (ii) that the use of Dataset complies with this EULA; and (iii) following the termination of this EULA, that the Dataset has been deleted in accordance with this EULA. Without limitation to vAIsual's rights under any other provision hereof, End User will permit vAIsual, or its representatives, to conduct periodic inspections or audits (\"Audits\") of such records. vAIsual may perform such Audits upon provision of at least 10 days advance notice to End User, during End User's normal business hours, and during the subscription term of this EULA and for two years thereafter. vAIsual will pay for the cost of the Audit unless vAIsual reasonably determines from the Audit that End User has breached a material provision of this EULA, in which case End User will be solely responsible for the cost of the Audit and any additional amounts owed as determined by the Audit. Records and Audit. End User will maintain business and financial records for a continuing (rolling) period of three years that contain information sufficient to verify End User's compliance with the of this EULA, including: (i) the completeness and accuracy of payments made in connection with this EULA; (ii) that the use of Dataset complies with this EULA; and (iii) following the termination of this EULA, that the Dataset has been deleted in accordance with this EULA. Without limitation to vAIsual's rights under any other provision hereof, End User will permit vAIsual, or its representatives, to conduct periodic inspections or audits (\"Audits\") of such records. vAIsual may perform such Audits upon provision of at least 10 days advance notice to End User, during End User's normal business hours, and during the subscription term of this EULA and for two years thereafter. vAIsual will pay for the cost of the Audit unless vAIsual reasonably determines from the Audit that End User has breached a material provision of this EULA, in which case End User will be solely responsible for the cost of the Audit and any additional amounts owed as determined by the Audit. Indemnification. vAIsual Indemnification. vAIsual will defend and indemnify End User for a claim by an unaffiliated third party that the Dataset infringes that party's patent, copyright or other intellectual property right issued and existing as of the Effective Date, and will pay the amount of any resulting adverse final judgment issued by a court of competent jurisdiction or of any settlement that we pre-approve in writing; provided that you promptly notify vAIsual in writing of any such claim, give us reasonable cooperation, information, and assistance in connection with it, and consent to the vAIsual's sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be obligated under this section if the infringement results from: (i) your use in a manner inconsistent with the of this EULA; (ii) End User using the Dataset with in a manner not authorized by vAIsual, (iii) use of the Dataset in applications, environments or processes for which it was not designed or contemplated, (iv) corrections, modifications, alterations or enhancements that you make to the Dataset; (v) use of the Dataset by any person or entity other than you or your employees; or (vi) your willful infringement. Enjoined Use. If we believe the Dataset may be or is subject to an infringement claim, or if a court of competent jurisdiction enjoins your use of the Dataset as a result of an infringement claim, vAIsual may, at our expense and our discretion: (a) procure for you the right to continue using the Dataset; (b) modify the Dataset to make it non-infringing; or (c) replace it with a non-infringing equivalent. If we believe that none of these options is reasonably available, then we may terminate the license to the allegedly infringing Dataset and our sole liability will be to refund to you the license fees you paid for such Dataset. End User Indemnification. End User will defend, indemnify and hold vAIsual harmless from any and all liabilities, damages, losses, expenses, demands, claims, suits or judgments, including reasonable attorneys' fees, costs and expenses arising from End User's unauthorized use of the Dataset, the use of the output of any Dataset or End User's failure to comply with the of this EULA. vAIsual will promptly notify you in writing of any such claim, give you reasonable cooperation, information and assistance in connection with it, and consent to your sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be responsible for any direct or indirect loss or damage that may result from such unauthorized use. vAIsual Indemnification. vAIsual will defend and indemnify End User for a claim by an unaffiliated third party that the Dataset infringes that party's patent, copyright or other intellectual property right issued and existing as of the Effective Date, and will pay the amount of any resulting adverse final judgment issued by a court of competent jurisdiction or of any settlement that we pre-approve in writing; provided that you promptly notify vAIsual in writing of any such claim, give us reasonable cooperation, information, and assistance in connection with it, and consent to the vAIsual's sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be obligated under this section if the infringement results from: (i) your use in a manner inconsistent with the of this EULA; (ii) End User using the Dataset with in a manner not authorized by vAIsual, (iii) use of the Dataset in applications, environments or processes for which it was not designed or contemplated, (iv) corrections, modifications, alterations or enhancements that you make to the Dataset; (v) use of the Dataset by any person or entity other than you or your employees; or (vi) your willful infringement. vAIsual Indemnification. vAIsual will defend and indemnify End User for a claim by an unaffiliated third party that the Dataset infringes that party's patent, copyright or other intellectual property right issued and existing as of the Effective Date, and will pay the amount of any resulting adverse final judgment issued by a court of competent jurisdiction or of any settlement that we pre-approve in writing; provided that you promptly notify vAIsual in writing of any such claim, give us reasonable cooperation, information, and assistance in connection with it, and consent to the vAIsual's sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be obligated under this section if the infringement results from: (i) your use in a manner inconsistent with the of this EULA; (ii) End User using the Dataset with in a manner not authorized by vAIsual, (iii) use of the Dataset in applications, environments or processes for which it was not designed or contemplated, (iv) corrections, modifications, alterations or enhancements that you make to the Dataset; (v) use of the Dataset by any person or entity other than you or your employees; or (vi) your willful infringement. Enjoined Use. If we believe the Dataset may be or is subject to an infringement claim, or if a court of competent jurisdiction enjoins your use of the Dataset as a result of an infringement claim, vAIsual may, at our expense and our discretion: (a) procure for you the right to continue using the Dataset; (b) modify the Dataset to make it non-infringing; or (c) replace it with a non-infringing equivalent. If we believe that none of these options is reasonably available, then we may terminate the license to the allegedly infringing Dataset and our sole liability will be to refund to you the license fees you paid for such Dataset. Enjoined Use. If we believe the Dataset may be or is subject to an infringement claim, or if a court of competent jurisdiction enjoins your use of the Dataset as a result of an infringement claim, vAIsual may, at our expense and our discretion: (a) procure for you the right to continue using the Dataset; (b) modify the Dataset to make it non-infringing; or (c) replace it with a non-infringing equivalent. If we believe that none of these options is reasonably available, then we may terminate the license to the allegedly infringing Dataset and our sole liability will be to refund to you the license fees you paid for such Dataset. End User Indemnification. End User will defend, indemnify and hold vAIsual harmless from any and all liabilities, damages, losses, expenses, demands, claims, suits or judgments, including reasonable attorneys' fees, costs and expenses arising from End User's unauthorized use of the Dataset, the use of the output of any Dataset or End User's failure to comply with the of this EULA. vAIsual will promptly notify you in writing of any such claim, give you reasonable cooperation, information and assistance in connection with it, and consent to your sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be responsible for any direct or indirect loss or damage that may result from such unauthorized use. End User Indemnification. End User will defend, indemnify and hold vAIsual harmless from any and all liabilities, damages, losses, expenses, demands, claims, suits or judgments, including reasonable attorneys' fees, costs and expenses arising from End User's unauthorized use of the Dataset, the use of the output of any Dataset or End User's failure to comply with the of this EULA. vAIsual will promptly notify you in writing of any such claim, give you reasonable cooperation, information and assistance in connection with it, and consent to your sole control and authority with respect to the defense, settlement or compromise of the claim. vAIsual will not be responsible for any direct or indirect loss or damage that may result from such unauthorized use. Limitation Of Liability. vAIsual shall not be liable for any damages resulting from the use of, the inability to use, or the improper use of (in violation of any provision of this EULA, including Section 1.2, the Dataset or the results received from use of the Dataset (by you or any person for whom you provide services or the output of the Dataset), including damages caused by malware, viruses or any incorrectness or incompleteness of the information obtained, unless such damage is the result of any willful misconduct or from gross negligence on the part of the Company. VAISUAL WILL NOT BE LIABLE IN ANY EVENT TO YOU OR ANY OTHER PERSON, REGARDLESS OF THE CAUSE, FOR THE EFFECTIVENESS OR ACCURACY OF THE DATASET, FOR THE COST OF PROCURING REPLACEMENT GOODS OR SERVICES, OR FOR LOST PROFITS OR LOST SALES, OR FOR ANY SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, MULTIPLE OR CONSEQUENTIAL DAMAGES ARISING FROM OR OCCASIONED BY YOUR USE OF THE PRODUCTS, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. MAXIMUM LIABILITY. IN ANY EVENT, VAISUAL'S MAXIMUM LIABILITY FOR ANY CLAIM ARISING IN CONNECTION WITH THIS EULA WILL NOT EXCEED THE FEES YOU HAVE PAID WITH RESPECT TO THE PRODUCTS OR SERVICES AT ISSUE. APPLICABILITY OF DISCLAIMERS AND LIMITATIONS. End User agrees that vAIsual has set its prices and entered into this Agreement in reliance upon the disclaimers and limitations in this section and that these disclaimers and limitations allocate risk between you and the Company and are an essential part of the bargain between us. vAIsual shall not be liable for any damages resulting from the use of, the inability to use, or the improper use of (in violation of any provision of this EULA, including Section 1.2, the Dataset or the results received from use of the Dataset (by you or any person for whom you provide services or the output of the Dataset), including damages caused by malware, viruses or any incorrectness or incompleteness of the information obtained, unless such damage is the result of any willful misconduct or from gross negligence on the part of the Company. vAIsual shall not be liable for any damages resulting from the use of, the inability to use, or the improper use of (in violation of any provision of this EULA, including Section 1.2, the Dataset or the results received from use of the Dataset (by you or any person for whom you provide services or the output of the Dataset), including damages caused by malware, viruses or any incorrectness or incompleteness of the information obtained, unless such damage is the result of any willful misconduct or from gross negligence on the part of the Company. VAISUAL WILL NOT BE LIABLE IN ANY EVENT TO YOU OR ANY OTHER PERSON, REGARDLESS OF THE CAUSE, FOR THE EFFECTIVENESS OR ACCURACY OF THE DATASET, FOR THE COST OF PROCURING REPLACEMENT GOODS OR SERVICES, OR FOR LOST PROFITS OR LOST SALES, OR FOR ANY SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, MULTIPLE OR CONSEQUENTIAL DAMAGES ARISING FROM OR OCCASIONED BY YOUR USE OF THE PRODUCTS, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. VAISUAL WILL NOT BE LIABLE IN ANY EVENT TO YOU OR ANY OTHER PERSON, REGARDLESS OF THE CAUSE, FOR THE EFFECTIVENESS OR ACCURACY OF THE DATASET, FOR THE COST OF PROCURING REPLACEMENT GOODS OR SERVICES, OR FOR LOST PROFITS OR LOST SALES, OR FOR ANY SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, EXEMPLARY, MULTIPLE OR CONSEQUENTIAL DAMAGES ARISING FROM OR OCCASIONED BY YOUR USE OF THE PRODUCTS, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. MAXIMUM LIABILITY. IN ANY EVENT, VAISUAL'S MAXIMUM LIABILITY FOR ANY CLAIM ARISING IN CONNECTION WITH THIS EULA WILL NOT EXCEED THE FEES YOU HAVE PAID WITH RESPECT TO THE PRODUCTS OR SERVICES AT ISSUE. MAXIMUM LIABILITY. IN ANY EVENT, VAISUAL'S MAXIMUM LIABILITY FOR ANY CLAIM ARISING IN CONNECTION WITH THIS EULA WILL NOT EXCEED THE FEES YOU HAVE PAID WITH RESPECT TO THE PRODUCTS OR SERVICES AT ISSUE. APPLICABILITY OF DISCLAIMERS AND LIMITATIONS. End User agrees that vAIsual has set its prices and entered into this Agreement in reliance upon the disclaimers and limitations in this section and that these disclaimers and limitations allocate risk between you and the Company and are an essential part of the bargain between us. APPLICABILITY OF DISCLAIMERS AND LIMITATIONS. End User agrees that vAIsual has set its prices and entered into this Agreement in reliance upon the disclaimers and limitations in this section and that these disclaimers and limitations allocate risk between you and the Company and are an essential part of the bargain between us. Changes. vAIsual reserves the right to revise and update this EULA periodically. New EULAs, such as changed or modified EULAs, shall be provided to You. You may be enabled to agree or decline to the as set forth in the revised EULA. If you decline to accept new set forth in any revised versions of the EULA, you will not be permitted to access the vAIsual Dataset. vAIsual reserves the right to revise and update this EULA periodically. New EULAs, such as changed or modified EULAs, shall be provided to You. You may be enabled to agree or decline to the as set forth in the revised EULA. If you decline to accept new set forth in any revised versions of the EULA, you will not be permitted to access the vAIsual Dataset. vAIsual reserves the right to revise and update this EULA periodically. New EULAs, such as changed or modified EULAs, shall be provided to You. You may be enabled to agree or decline to the as set forth in the revised EULA. If you decline to accept new set forth in any revised versions of the EULA, you will not be permitted to access the vAIsual Dataset. Choice of Law and Venue. The validity of the EULA, its construction, interpretation, and enforcement, and the rights of the parties hereto shall be determined under, governed by, and construed in accordance with the laws of the State of Delaware (USA). The Parties agree that all actions or proceedings arising in connection with the EULA shall be tried and litigated exclusively in the state and federal courts located in the State of Delaware, and irrevocably consent to the jurisdiction of such courts. Choice of Law and Venue. The validity of the EULA, its construction, interpretation, and enforcement, and the rights of the parties hereto shall be determined under, governed by, and construed in accordance with the laws of the State of Delaware (USA). The validity of the EULA, its construction, interpretation, and enforcement, and the rights of the parties hereto shall be determined under, governed by, and construed in accordance with the laws of the State of Delaware (USA). The Parties agree that all actions or proceedings arising in connection with the EULA shall be tried and litigated exclusively in the state and federal courts located in the State of Delaware, and irrevocably consent to the jurisdiction of such courts. The Parties agree that all actions or proceedings arising in connection with the EULA shall be tried and litigated exclusively in the state and federal courts located in the State of Delaware, and irrevocably consent to the jurisdiction of such courts. Miscellaneous. All provisions that are intended to survive the termination, by nature or because such has expressly been provided for in this EULA, shall survive such termination. These provisions include, but are not limited to, provisions regarding the intellectual property rights, warrantees, limitations of liability, and choice of law and venue. If any provision of the EULA is held invalid or unenforceable, that provision will be construed to reflect vAIsual's original intent. Despite the invalidity or unenforceability of such provision, all other provisions will remain in full force and effect. If vAIsual does not exercise or enforce any legal right or remedy, this will not constitute a formal waiver of vAIsual's rights. This EULA supersedes all previous agreements and licenses, verbal or written, regarding any dealings with respect to the subject matter of this EULA. The headings contained in this EULA are for reference purposes only and shall not affect in any way the meaning or interpretation of this EULA. Export. End Users agrees not to export, re-export, or provide the Dataset or any derivative works created from the Dataset to (i) any country to which the United States has embargoed goods; (ii) any person on the U.S. Treasury Department's list of Specially Designated Nationals; (iii) any person or entity on the U.S. Commerce Department's Denied Persons List; or (iv) any person or entity where such export, re-export or provision violates any U.S. Export control or regulation. Assignment. End User may not assign, sublicense or transfer its rights or delegate your obligations under this Agreement without vAIsual's written consent. Any attempt by you to transfer this Agreement without vAIsual's consent will be void, the transferee will acquire no rights whatsoever, and the Company will not be required to recognize the transfer. This provision limits both the right and the power to transfer this Agreement and the rights hereunder. All provisions that are intended to survive the termination, by nature or because such has expressly been provided for in this EULA, shall survive such termination. These provisions include, but are not limited to, provisions regarding the intellectual property rights, warrantees, limitations of liability, and choice of law and venue. All provisions that are intended to survive the termination, by nature or because such has expressly been provided for in this EULA, shall survive such termination. These provisions include, but are not limited to, provisions regarding the intellectual property rights, warrantees, limitations of liability, and choice of law and venue. If any provision of the EULA is held invalid or unenforceable, that provision will be construed to reflect vAIsual's original intent. Despite the invalidity or unenforceability of such provision, all other provisions will remain in full force and effect. If any provision of the EULA is held invalid or unenforceable, that provision will be construed to reflect vAIsual's original intent. Despite the invalidity or unenforceability of such provision, all other provisions will remain in full force and effect. If vAIsual does not exercise or enforce any legal right or remedy, this will not constitute a formal waiver of vAIsual's rights. If vAIsual does not exercise or enforce any legal right or remedy, this will not constitute a formal waiver of vAIsual's rights. This EULA supersedes all previous agreements and licenses, verbal or written, regarding any dealings with respect to the subject matter of this EULA. This EULA supersedes all previous agreements and licenses, verbal or written, regarding any dealings with respect to the subject matter of this EULA. The headings contained in this EULA are for reference purposes only and shall not affect in any way the meaning or interpretation of this EULA. The headings contained in this EULA are for reference purposes only and shall not affect in any way the meaning or interpretation of this EULA. Export. End Users agrees not to export, re-export, or provide the Dataset or any derivative works created from the Dataset to (i) any country to which the United States has embargoed goods; (ii) any person on the U.S. Treasury Department's list of Specially Designated Nationals; (iii) any person or entity on the U.S. Commerce Department's Denied Persons List; or (iv) any person or entity where such export, re-export or provision violates any U.S. Export control or regulation. Export. End Users agrees not to export, re-export, or provide the Dataset or any derivative works created from the Dataset to (i) any country to which the United States has embargoed goods; (ii) any person on the U.S. Treasury Department's list of Specially Designated Nationals; (iii) any person or entity on the U.S. Commerce Department's Denied Persons List; or (iv) any person or entity where such export, re-export or provision violates any U.S. Export control or regulation. Assignment. End User may not assign, sublicense or transfer its rights or delegate your obligations under this Agreement without vAIsual's written consent. Any attempt by you to transfer this Agreement without vAIsual's consent will be void, the transferee will acquire no rights whatsoever, and the Company will not be required to recognize the transfer. This provision limits both the right and the power to transfer this Agreement and the rights hereunder. Assignment. End User may not assign, sublicense or transfer its rights or delegate your obligations under this Agreement without vAIsual's written consent. Any attempt by you to transfer this Agreement without vAIsual's consent will be void, the transferee will acquire no rights whatsoever, and the Company will not be required to recognize the transfer. This provision limits both the right and the power to transfer this Agreement and the rights hereunder. Models and Checkpoints Commercial RAIL Responsible AI License (RAIL) for AI models and checkpoints for rights managed generative purposes. Dataset standard license (one-time purchase) Purchasing for all AI training purposes except generative AI models for visual synthetic media. Securing access to the existing dataset and excluding any updates throughout the year of additional images. Dataset standard license (annual subscription) Purchasing for all AI training purposes except generative AI models for visual synthetic media. Securing access to all updates of the datasets throughout the year. Dataset extended license (one-time purchase) Purchasing for the use of the datasets for generative AI models for visual synthetic media. Securing access to the existing dataset and excluding any updates throughout the year of additional images. Dataset extended license (annual subscription) Purchasing for the use of the datasets for generative AI models for visual synthetic media. Securing access to all updates of the datasets throughout the year.",
    "vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023 Wirestock.io, established in 2019, will be licensing images, illustrations and videos to companies training machine learning algorithms for various applications. The partnership grows the variety of images available for specific AI training, as well as ensuring copyright owners are compensated for their work. Wirestock.io According to vAIsual CEO, Michael Osterrieder, the deal is an important step in making highly specific datasets to meet the needs of AI developers who are doing it ethically and responsibly. \"AI models are 100% dependent on quality data. The more data, the better. This deal ensures we are able to compile large datasets of images to meet very exact purposes for customers. For example, airports needing luggage datasets, hospitals needing images of adults carrying infants, or propane gas tanks in the workplace for safety monitoring AI.\" says Osterrieder. Wirestock.io For Wirestock.io, the deal represents a chance to participate in the rapidly growing text-to-image generation industry, and another revenue channel to pursue for their contributors. \"At Wirestock, we've always believed that the creators behind our millions of images and videos should be fairly compensated for their work. Partnering with vAIsual not only provides a fresh and promising way for our contributors to monetize their content, but it also helps propel the AI industry forward.\" says Mikayel Khachatryan, CEO at Wirestock.io. Wirestock.io In the coming weeks, datasets will be custom-made from the Wirestock.io library of commercial stock images and video. The datasets are specially prepared for engineers to add to their workflow for AI training and are available via the Dataset Shop. About Dataset Shop First launched in 2022 by the \"clean data guys\", vAIsual Inc's Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 600,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. About Wirestock.io Wirestock.io is an online stock site that allows its contributors to upload assets in the form of images, videos and vector files to their platform for distribution across multiple stock agencies. Wirestock.io is a platform that allows photographers and creators to distribute and license their visual content, such as photographs and videos, to various stock photo agencies and marketplaces. By using Wirestock.io, photographers can streamline their content submission process to multiple agencies, which can potentially increase their exposure and revenue from their work. The platform acts as an intermediary between creators and stock agencies, simplifying the process of submitting content to multiple agencies, managing licenses, and tracking earnings. Wirestock.io aims to provide photographers with a centralized platform to efficiently manage their stock photography portfolios. Useful Links: https://www.datasetshop.com https://www.wirestock.io Our latest posts vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual launches AI training datasets of Asian scenes and people in the Dataset Shop 13 July 2023 vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023 Wirestock.io, established in 2019, will be licensing images, illustrations and videos to companies training machine learning algorithms for various applications. The partnership grows the variety of images available for specific AI training, as well as ensuring copyright owners are compensated for their work. Wirestock.io According to vAIsual CEO, Michael Osterrieder, the deal is an important step in making highly specific datasets to meet the needs of AI developers who are doing it ethically and responsibly. \"AI models are 100% dependent on quality data. The more data, the better. This deal ensures we are able to compile large datasets of images to meet very exact purposes for customers. For example, airports needing luggage datasets, hospitals needing images of adults carrying infants, or propane gas tanks in the workplace for safety monitoring AI.\" says Osterrieder. Wirestock.io For Wirestock.io, the deal represents a chance to participate in the rapidly growing text-to-image generation industry, and another revenue channel to pursue for their contributors. \"At Wirestock, we've always believed that the creators behind our millions of images and videos should be fairly compensated for their work. Partnering with vAIsual not only provides a fresh and promising way for our contributors to monetize their content, but it also helps propel the AI industry forward.\" says Mikayel Khachatryan, CEO at Wirestock.io. Wirestock.io In the coming weeks, datasets will be custom-made from the Wirestock.io library of commercial stock images and video. The datasets are specially prepared for engineers to add to their workflow for AI training and are available via the Dataset Shop. About Dataset Shop First launched in 2022 by the \"clean data guys\", vAIsual Inc's Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 600,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. About Wirestock.io Wirestock.io is an online stock site that allows its contributors to upload assets in the form of images, videos and vector files to their platform for distribution across multiple stock agencies. Wirestock.io is a platform that allows photographers and creators to distribute and license their visual content, such as photographs and videos, to various stock photo agencies and marketplaces. By using Wirestock.io, photographers can streamline their content submission process to multiple agencies, which can potentially increase their exposure and revenue from their work. The platform acts as an intermediary between creators and stock agencies, simplifying the process of submitting content to multiple agencies, managing licenses, and tracking earnings. Wirestock.io aims to provide photographers with a centralized platform to efficiently manage their stock photography portfolios. Useful Links: https://www.datasetshop.com https://www.wirestock.io vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training Wirestock.io, established in 2019, will be licensing images, illustrations and videos to companies training machine learning algorithms for various applications. The partnership grows the variety of images available for specific AI training, as well as ensuring copyright owners are compensated for their work. According to vAIsual CEO, Michael Osterrieder, the deal is an important step in making highly specific datasets to meet the needs of AI developers who are doing it ethically and responsibly. \"AI models are 100% dependent on quality data. The more data, the better. This deal ensures we are able to compile large datasets of images to meet very exact purposes for customers. For example, airports needing luggage datasets, hospitals needing images of adults carrying infants, or propane gas tanks in the workplace for safety monitoring AI.\" says Osterrieder. For Wirestock.io, the deal represents a chance to participate in the rapidly growing text-to-image generation industry, and another revenue channel to pursue for their contributors. \"At Wirestock, we've always believed that the creators behind our millions of images and videos should be fairly compensated for their work. Partnering with vAIsual not only provides a fresh and promising way for our contributors to monetize their content, but it also helps propel the AI industry forward.\" says Mikayel Khachatryan, CEO at Wirestock.io. In the coming weeks, datasets will be custom-made from the Wirestock.io library of commercial stock images and video. The datasets are specially prepared for engineers to add to their workflow for AI training and are available via the Dataset Shop. First launched in 2022 by the \"clean data guys\", vAIsual Inc's Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 600,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. Wirestock.io is an online stock site that allows its contributors to upload assets in the form of images, videos and vector files to their platform for distribution across multiple stock agencies. Wirestock.io is a platform that allows photographers and creators to distribute and license their visual content, such as photographs and videos, to various stock photo agencies and marketplaces. By using Wirestock.io, photographers can streamline their content submission process to multiple agencies, which can potentially increase their exposure and revenue from their work. The platform acts as an intermediary between creators and stock agencies, simplifying the process of submitting content to multiple agencies, managing licenses, and tracking earnings. Wirestock.io aims to provide photographers with a centralized platform to efficiently manage their stock photography portfolios. vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual launches AI training datasets of Asian scenes and people in the Dataset Shop 13 July 2023",
    "GDPR and PII compliant Latests Datasets, Models and Checkpoints Biometric Datasets Total datasets: 12 See all Biometric Video Dataset Videos: 2,586 Total duration: 19:45:30 Codec: MP4, MPEG Model release: GDPR compliant Complete People Dataset Images: 569,576 Resolution: up to 8MP Model release: GDPR compliant Synthetic Humans - Medium Quality Images: 1,004 Resolution: up to 2MP Model release: GDPR compliant Human Faces - Women only - Augmented - Greenscreen Images: 86,456 Resolution: up to 9MP Model release: GDPR compliant Happy Faces - Squared - Augmented - Greenscreen Images: 20,741 Resolution: up to 9MP Model release: GDPR compliant Human Faces - Smiling - Original Images: 6,294 Resolution: up to 8MP Model release: GDPR compliant LoRa Models Total datasets: 1 See all VAI Kate Stock Model Type: LoRa Model Category: VAI Model release: GDPR compliant Subjects Datasets Total datasets: 26 See all PantherMedia Collection Images: 798,032 Resolution: up to 4MP World Travel Collection Images: 184,969 Resolution: up to 20MP Indoor Plants Oasis Collection Images: 4,022 Resolution: up to 1MP People In Various Coastal Activities Images: 20,546 Resolution: up to 118MP People In Various Musical Contexts Images: 1,862 Resolution: up to 66MP People In Various Nature Contexts Images: 2,000 Resolution: up to 96MP Artists Spotlight Total datasets: 1 See all Glamour and People Collection Andor Keves Images: 20,493 Resolution: up to 45MP Object Datasets Total datasets: 18 See all PantherMedia Collection Images: 798,032 Resolution: up to 4MP World Travel Collection Images: 184,969 Resolution: up to 20MP Food Preparation & Cooking Collection Images: 2,826 Resolution: up to 35MP 25k + Stock image dataset Images: 26,791 Resolution: up to 68MP Truck And Commercial Vehicle Collection Images: 2,268 Resolution: up to 30MP Warfare Arsenal Collection Tanks & Missiles Images: 1,686 Resolution: up to 1MP Scenes Datasets Total datasets: 23 See all World Travel Collection Images: 184,969 Resolution: up to 20MP Central Station Collection Images: 2,702 Resolution: up to 1MP Global Airport Collection Images: 6,048 Resolution: up to 1MP Famous Urban Parks Collection Images: 5,696 Resolution: up to 1MP Rice Farming Collection Images: 6,010 Resolution: up to 1MP Extreme Landscapes Collection Images: 6,767 Resolution: up to 1MP Didn't find what you need ? You can build your own + Create a DataSet News and Updates 20 March 2024 vAIsual Selected for Google for Startups Cloud Program Legally clean generative AI company vAIsual Inc, given a boost with Google for Startups Cloud Program. 05 February 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances vAIsual Inc, the company behind the largest legally licensable biometric dataset in the world, today launched the first ever commercial LoRa model for generative stock media purposes. 08 January 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images vAIsual Inc, an ethical AI datasets and model producer, today launched the PeopleMaker app on the leading all-in-one visual communication platform, Canva. Hear from our customers \"We are able to improve our models and benchmarks thanks to vAIsual's high-quality and diverse data. Moreover, top-notch service is provided.\" Gabriella Burtman Product Manager bria.ai In our pursuit of high-resolution consent-based face data with varying subjects and metadata, DataSetShop proved to be our last stop. We really appreciate all the assistance provided and look forward to a lasting business relationship. Vishesh Mistry Research Scientist Tech5 Latests Datasets, Models and Checkpoints Synthetic Humans - Medium Quality Human Faces - Women only - Augmented - Greenscreen Happy Faces - Squared - Augmented - Greenscreen Human Faces - Smiling - Original VAI Kate Stock Model Indoor Plants Oasis Collection People In Various Coastal Activities People In Various Musical Contexts People In Various Nature Contexts Glamour and People Collection Andor Keves Food Preparation & Cooking Collection 25k + Stock image dataset Truck And Commercial Vehicle Collection Warfare Arsenal Collection Tanks & Missiles Famous Urban Parks Collection Didn't find what you need ? You can build your own vAIsual Selected for Google for Startups Cloud Program Legally clean generative AI company vAIsual Inc, given a boost with Google for Startups Cloud Program. vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances vAIsual Inc, the company behind the largest legally licensable biometric dataset in the world, today launched the first ever commercial LoRa model for generative stock media purposes. vAIsual launches PeopleMaker app on Canva to generate synthetic human images vAIsual Inc, an ethical AI datasets and model producer, today launched the PeopleMaker app on the leading all-in-one visual communication platform, Canva. Hear from our customers \"We are able to improve our models and benchmarks thanks to vAIsual's high-quality and diverse data. Moreover, top-notch service is provided.\" In our pursuit of high-resolution consent-based face data with varying subjects and metadata, DataSetShop proved to be our last stop. We really appreciate all the assistance provided and look forward to a lasting business relationship.",
    "vAIsual signs content deal with Seattle-based nature and travel photography agency for AI training 02 February 2023 River - Copyright  James White / DanitaDelimont.com -- vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with Danita Delimont Stock Photography, a leading provider of nature and travel stock imagery. The deal will mean over 800,000 photographs will be available via the DataSetShop.com for AI training. The partnership is a win for copyright holders in the text-to-image generation industry and presents an ethical and legally clean way for companies to train AI in a fair and safe way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been sourced with the consent of the original copyright owners, or their legal representatives, such as Danita Delimont Stock Photography.\" \"When we imagine generating images using AI, it's essential the training includes landscapes and photography from the natural world. With the Danita Delimont Stock Photography collection, we are providing high quality images from some of the best nature and travel photographers in the world. This will make a huge difference to the quality of the output,\" says Osterrieder. Aurora - Copyright  Stuart Westmorland / DanitaDelimont.com -- For Danita Delimont Stock Photography, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to Danita Delimont, \"This collaboration will bring our huge collection of nature and travel images to the ethical AI industry, as well as offering a new opportunity for additional income streams to our globally-based photographers. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is just the beginning.\" In the coming weeks, datasets containing over 800,000 images of nature and travel will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. About Dataset Shop First launched in 2022 by \"clean data guys\", vAIsual Inc, the Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 500,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. About Danita Delimont Stock Photography Founded in 1999, Danita Delimont Stock Photography has built an impressive collection of over 800,000 travel and nature-oriented images available to travel and publishing clients worldwide. Useful Links : https://www.datasetshop.com https://www.danitadelimont.com/ Our latest posts vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023 vAIsual signs content deal with Seattle-based nature and travel photography agency for AI training 02 February 2023 River - Copyright  James White / DanitaDelimont.com -- vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with Danita Delimont Stock Photography, a leading provider of nature and travel stock imagery. The deal will mean over 800,000 photographs will be available via the DataSetShop.com for AI training. The partnership is a win for copyright holders in the text-to-image generation industry and presents an ethical and legally clean way for companies to train AI in a fair and safe way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been sourced with the consent of the original copyright owners, or their legal representatives, such as Danita Delimont Stock Photography.\" \"When we imagine generating images using AI, it's essential the training includes landscapes and photography from the natural world. With the Danita Delimont Stock Photography collection, we are providing high quality images from some of the best nature and travel photographers in the world. This will make a huge difference to the quality of the output,\" says Osterrieder. Aurora - Copyright  Stuart Westmorland / DanitaDelimont.com -- For Danita Delimont Stock Photography, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to Danita Delimont, \"This collaboration will bring our huge collection of nature and travel images to the ethical AI industry, as well as offering a new opportunity for additional income streams to our globally-based photographers. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is just the beginning.\" In the coming weeks, datasets containing over 800,000 images of nature and travel will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. About Dataset Shop First launched in 2022 by \"clean data guys\", vAIsual Inc, the Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 500,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. About Danita Delimont Stock Photography Founded in 1999, Danita Delimont Stock Photography has built an impressive collection of over 800,000 travel and nature-oriented images available to travel and publishing clients worldwide. Useful Links : https://www.datasetshop.com https://www.danitadelimont.com/ vAIsual signs content deal with Seattle-based nature and travel photography agency for AI training River - Copyright  James White / DanitaDelimont.com -- vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with Danita Delimont Stock Photography, a leading provider of nature and travel stock imagery. The deal will mean over 800,000 photographs will be available via the DataSetShop.com for AI training. The partnership is a win for copyright holders in the text-to-image generation industry and presents an ethical and legally clean way for companies to train AI in a fair and safe way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been sourced with the consent of the original copyright owners, or their legal representatives, such as Danita Delimont Stock Photography.\" \"When we imagine generating images using AI, it's essential the training includes landscapes and photography from the natural world. With the Danita Delimont Stock Photography collection, we are providing high quality images from some of the best nature and travel photographers in the world. This will make a huge difference to the quality of the output,\" says Osterrieder. Aurora - Copyright  Stuart Westmorland / DanitaDelimont.com -- For Danita Delimont Stock Photography, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to Danita Delimont, \"This collaboration will bring our huge collection of nature and travel images to the ethical AI industry, as well as offering a new opportunity for additional income streams to our globally-based photographers. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is just the beginning.\" In the coming weeks, datasets containing over 800,000 images of nature and travel will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. First launched in 2022 by \"clean data guys\", vAIsual Inc, the Dataset Shop is a marketplace for visual media designed specifically for AI training purposes. The online store initially sold the largest biometrically released human dataset, consisting of over 500,000 high quality images, custom shot for AI training. The Dataset Shop is rapidly growing the collection of datasets through partnerships with stock agencies seeking to address the issue of widespread scraping of datasets, obtained without the consent of copyright owners. About Danita Delimont Stock Photography Founded in 1999, Danita Delimont Stock Photography has built an impressive collection of over 800,000 travel and nature-oriented images available to travel and publishing clients worldwide. vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023",
    "vAIsual inks landmark content deal with middle eastern stock image agency 17 January 2023 Temple vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with The Middle Frame, a leading provider of stock photographs of Arabian people and culture. The deal will mean thousands of Middle East and North African photographs will be available via the DataSetShop.com for AI training. The partnership is a win for diversity and representation in the text-to-image generation industry and presents an ethical and legal way for companies to train AI in a fair and legally clean way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been legally sourced and the resulting models provide accurate representations of all kinds of people.\" \"In the past, we have seen the huge controversies arises when algorithms depict people from different ethnicities in an inaccurate or offensive way. The best way to circumvent this is to make sure the training data includes a diverse range of people.\" says Osterrieder. For The Middle Frame, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to The Middle Frame co-founder and COO, Mohammad Alnobani, \"This unique collaboration will bring Middle Eastern and North African images to the ethical AI industry. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is an ideal way to start.\" In the coming weeks, datasets containing millions of images of Middle Eastern and North African scenes and people will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. Useful Links: https://vaisual.com https://themiddleframe.com Our latest posts vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023 vAIsual inks landmark content deal with middle eastern stock image agency 17 January 2023 Temple vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with The Middle Frame, a leading provider of stock photographs of Arabian people and culture. The deal will mean thousands of Middle East and North African photographs will be available via the DataSetShop.com for AI training. The partnership is a win for diversity and representation in the text-to-image generation industry and presents an ethical and legal way for companies to train AI in a fair and legally clean way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been legally sourced and the resulting models provide accurate representations of all kinds of people.\" \"In the past, we have seen the huge controversies arises when algorithms depict people from different ethnicities in an inaccurate or offensive way. The best way to circumvent this is to make sure the training data includes a diverse range of people.\" says Osterrieder. For The Middle Frame, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to The Middle Frame co-founder and COO, Mohammad Alnobani, \"This unique collaboration will bring Middle Eastern and North African images to the ethical AI industry. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is an ideal way to start.\" In the coming weeks, datasets containing millions of images of Middle Eastern and North African scenes and people will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. Useful Links: https://vaisual.com https://themiddleframe.com vAIsual inks landmark content deal with middle eastern stock image agency vAIsual Inc, pioneers in legally clean training datasets for AI, today signed a deal with The Middle Frame, a leading provider of stock photographs of Arabian people and culture. The deal will mean thousands of Middle East and North African photographs will be available via the DataSetShop.com for AI training. The partnership is a win for diversity and representation in the text-to-image generation industry and presents an ethical and legal way for companies to train AI in a fair and legally clean way. According to vAIsual CEO, Michael Osterrieder, the deal is the first of its kind and provides the essential resources for AI engineers and researchers to get optimal results from their AI training. \"The AI industry is now under heavy review by lawmakers across the world. According to Forbes, 2023 will be the year of AI ethics legislation. This means every company offering AI tools needs to ensure the training data has been legally sourced and the resulting models provide accurate representations of all kinds of people.\" \"In the past, we have seen the huge controversies arises when algorithms depict people from different ethnicities in an inaccurate or offensive way. The best way to circumvent this is to make sure the training data includes a diverse range of people.\" says Osterrieder. For The Middle Frame, the deal represents a chance to participate in the rapidly growing text-to-image generation industry. According to The Middle Frame co-founder and COO, Mohammad Alnobani, \"This unique collaboration will bring Middle Eastern and North African images to the ethical AI industry. We want to be at the forefront of how the stock industry participates in the future of IP licensing, and this deal is an ideal way to start.\" In the coming weeks, datasets containing millions of images of Middle Eastern and North African scenes and people will be available via datasetshop.com. The datasets are specially prepared for engineers to add to their workflow for AI training. vAIsual Selected for Google for Startups Cloud Program 20 March 2024 vAIsual Launches First Commercial LoRa Model For Virtual Actor Instances 05 February 2024 vAIsual launches PeopleMaker app on Canva to generate synthetic human images 08 January 2024 vAIsual and Rightsify ink licensing deal to deliver royalty-free music for AI training 08 August 2023 vAIsual and Wirestock.io partner to offer 9 million commercial stock images and video for AI training 02 August 2023"
  ]
}