{
  "company": "www.daon.com",
  "dominant_topics": [
    1,
    0,
    -1,
    24
  ],
  "topic_counts": {
    "1": 48,
    "0": 4,
    "-1": 1,
    "24": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam",
    "24": "signature, electronic, sign, signatures, contract"
  },
  "framing_scores": {
    "framing_ethical": 0.2682926829268293,
    "framing_surveillance": 0.1219512195121951,
    "framing_market": 0.6097560975609756,
    "num_docs": 54
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 4,
      "1": 48,
      "24": 1
    }
  },
  "sample_docs": [
    "Tailored security and identity solutions Governments and commercial organizations today are implementing policy-based security and control systems using person-centric authentication methods such as tokens, cards and biometrics. These types of security systems bring many advantages including: Enhanced national security Legitimate trade and travel Ensured integrity of our immigration systems Adherence to existing privacy laws and policies Positive identification of individuals and users Reduced risk of fraudulent use of identity Operational efficiencies and reduced costs Enhanced convenience for users However, deployment of these security systems can often present significant challenges, such as volume, interoperability and performance, as well as security and privacy issues. Daon's leading biometric identity management software has been architected and developed to specifically address these challenges in some of the most mission critical environments. Daon delivers best-of-breed products and technology innovation, as well as biometric subject matter expertise, to our customers. Daon Engine , Daon's identity management platform, meets the identification requirements of many markets including Public Sector, Financial Services and Pharmaceuticals. Today, Daon is teamed with systems integrators around the globe to develop biometric-based solutions for Employee Credentialing, Border Control and Immigration Management, Civil ID Systems and Registered Traveler Programs. Legitimate trade and travel Ensured integrity of our immigration systems Adherence to existing privacy laws and policies Positive identification of individuals and users Reduced risk of fraudulent use of identity Operational efficiencies and reduced costs Enhanced convenience for users However, deployment of these security systems can often present significant challenges, such as volume, interoperability and performance, as well as security and privacy issues. Daon's leading biometric identity management software has been architected and developed to specifically address these challenges in some of the most mission critical environments. Daon delivers best-of-breed products and technology innovation, as well as biometric subject matter expertise, to our customers. Daon Engine , Daon's identity management platform, meets the identification requirements of many markets including Public Sector, Financial Services and Pharmaceuticals. Today, Daon is teamed with systems integrators around the globe to develop biometric-based solutions for Employee Credentialing, Border Control and Immigration Management, Civil ID Systems and Registered Traveler Programs.",
    "Controlling access to physical and logical assets represents an ongoing security challenge for any organization. In pharmaceutical organizations, this challenge is magnified by the need for a secure discovery and development environment where information can be accessed and shared in a protected manner across teams and third party collaborators. For a secure discovery and development environment to exist, strong authentication of users and non-repudiation of signatures and actions is required. An identity management solution that integrates with legacy systems and allows users to manage physical and logical security can meet that challenge. The Daon identity management system delivers biometric access control to systems and secure areas protects Intellectual Property (IP) improves manufacturing workflow with audit trails and digital signatures for approvals and accountability. For more information on Daon for Secure Logical and Physical Access Control, please download the factsheet (146Kb pdf). delivers biometric access control to systems and secure areas protects Intellectual Property (IP) improves manufacturing workflow with audit trails and digital signatures for approvals and accountability. For more information on Daon for Secure Logical and Physical Access Control, please download the factsheet (146Kb pdf).",
    "Pharma & Life Sciences: Endo Pharmaceuticals Inc. Introduces New Access Control Security System Daon, a provider of enterprise class biometric authentication solutions, and Endo Pharmaceuticals Inc. (ENDP, ENDPW), a specialty pharmaceutical company with an established leadership in pain management, have introduced Daon's biometric logical access system for all employees to protect and control access to all company applications and systems. Endo Pharmaceuticals has enrolled 250 employees initially into the system using their finger biometrics for logical access. With the significant cost savings that Daon's biometric authentication technology can offer, plus the added benefits of heightened security and ease of management, Endo recognize the value Daon have delivered to the efficient running of their business. Increasing security has become more important as life sciences companies strive to develop new products and differentiate themselves from their competitors. Protecting the information assets of these organizations is of paramount importance in today's fast-moving business world. Download Case Study Download .pdf, 136KB >>",
    "Financial Services: Daon & PKI Public Key Infrastructure (commonly known as PKI) is a long established and well-known method for providing authentication and digital signatures solutions to electronic business problems. In this short paper, we outline how the \"traditional PKI\" with its complex infrastructure is no longer necessary and a more streamlined and cost effective approach can be taken to the problem. This approach will reduce costs, increase security and will also enable PKI to live up to its business promise. We outline how the use of biometrics, in conjunction with PKI, can deliver on the real benefits that PKI was intended originally to achieve. Download Biometrics and PKI based Digital Signatures (161KB pdf)",
    "Daon for Registered Traveler Programs Governments and airports are in the process and testing and implementing Registered Traveler programs around the globe. These programs are designed to facilitate the security checkpoint processing of 'known', frequent travelers, while allowing for the allocation of resources to support remaining passengers. Recently, the Transportation Security Administration (TSA) has initiated pilot programs in the USA testing multiple biometrics and credentialing scenarios to gauge the impact on security considerations, airport and airline operations as well as passenger usage reaction and acceptance. Daon provides the supporting identity credentialing platform for the initial three airports under contract to Unisys Corporation. for more>> Why Registered Traveler Programs? Registered Traveler programs support governments and airlines in improving security throughout the travel system while delivering greater satisfaction to the passenger. By understanding the traveler community profile, Registered Traveler programs provide the frequent flier with a cost-effective way to ensure a consistent travel experience, while implementing stronger and more thorough security protections for all. Using the combination of a background check and strong authentication via biometrics, Registered Traveler programs allow customers to expedite the checkpoint screening process. In addition to providing predictable experiences for frequent travelers, the security organizations are now able to better allocate resources to support the remaining passengers, thereby improving customer service and security for everyone. Why choose Daon for Registered Traveler Programs? Registered Traveler programs require the use of a strong, secure, flexible identity management platform to ensure the successful delivery of improved traveler security and increased traveler satisfaction. Systems Integrators rely on Daon to provide the required biometric and biographic management expertise and software with the strongest possible security and privacy protection. Daon's identity management platform, Daon Engine , provides the infrastructure to support all biometric types and algorithms, coupled with standard token, card and credential implementations. Daon Engine delivers a strong encryption security scheme to protect the personal information of the traveler from unauthorized usage. Value to the Airport Airports are concerned with providing their constituents and customers with the best possible travel experience. The safe, efficient movement of passengers through the airport provides for smooth operations and a happy traveler. Daon can assist in providing an infrastructure component that can speed up the screening process, significantly reduce queuing time and enhance traveler convenience without compromising on security. Airport operators, when responsible for checkpoint security, can meet their objectives, while integrating an extensible infrastructure that can support airline operations and commercial businesses at the airport. By leveraging the Registered Traveler card, airports have the opportunity to build passenger loyalty and drive ancillary commercial services to their most frequent customers. Value to the Airline Airlines operate some of the most complex logistical enterprises that exist today. They rely on governments and airport operators to provide the consistent, timely, safe delivery of ground and transfer passengers to their doorstep millions of times every day. Their success is dependent on their ability to maintain schedules in the movement of passengers and equipment in the face of numerous obstacles and a very competitive market. Registered Traveler programs offer a substantial opportunity to facilitate this success in an important demographic. Frequent flyers are primary business travelers, representing steady revenue and less price sensitivity in ticket purchase. Programs that enable these travelers to plan for consistent response in the time at the airport, while offering convenience and security, can create a tremendous opportunity for the airline. With Daon's technology, Registered Traveler programs offer easy to use, highly accurate and reliable identification technology, which strongly protects individual privacy within vault-level security infrastructures. Value to the Frequent Traveler The increase in security implemented around the world after the events of September 2001, has most definitely impacted the frequent air traveler. For passengers, the added time and unpredictability associated with navigating airport security can be directly translated into lost work time, reduced productivity and inconvenience. The ability to avail of a process that can maintain or increase the level of security for all travelers while providing for a predictable, consistent checkpoint processing timeline is invaluable to the frequent traveler. The added security provided through the provision of personal information and the strong authentication of the traveler to their identity claim, supports the implementation of a safe, secure, repeatable security checkpoint processing scheme. Daon supports these solutions through the use of the Daon Engine identity management platform. The Daon Engine enables travelers to enroll their personal data and biometric identifiers into a highly secure, private vault. Once activated by the security authority, this information is then used to verify the individual during each trip through security. By establishing the strong connection, travelers experience a 1-2 second verification process in order to swiftly pass into the checkpoint station, thereby avoiding long delays. Value to Other Travelers The ordinary traveler also benefits from the implementation of a Registered Traveler program. Infrequent to air travel, these individuals still have the same objectives as the frequent traveler - strong security and a pleasant experience. Ordinary travelers may need additional attention and assistance to ensure they quickly pass through security due to their lack of familiarity with security procedures and processes. The implementation of a Registered Traveler program allows the airport or security agency to focus additional resources on these individuals thereby providing the necessary level of assistance. Given our mutual objective of air safety, the ability to deploy resources in the most effective way is a benefit will can all appreciate. Registered Traveler Programs Comprehensive identity management processes and systems have become fundamental to meeting the security requirements of air travel. Key to the success of these efforts is the ability of governments and the industry to implement solutions in the most cost-effective and efficient manner. Registered Traveler programs are a key element in providing the required security protection, while ensuring excellent customer satisfaction and continuing to facilitate commerce. For any program involving registered travelers the broad requirements are: Fast, convenient, easy user experience Inclusion of a strong identification process Capability to utilize multiple identification technologies in a flexible manner Use of a highly secure, private infrastructure Cost-effective, component implmentation for heterogeneous environments Selected by multiple airport and traveler security integrators around the world, Daon specializes in delivering the identity management platform key to these programs' success. Daon's products and solutions assist travelers, airport operators, and airlines around the world in enabling and facilitating their commerce, while providing improved security and privacy protection to their most important customers. By leveraging Daon's identity management software, the airport can also extend the system to manage employees for access control to restricted areas. Daon's technology interoperates with existing ID card systems to provide an additional layer of security. Read how Daon is providing enhanced employee security at London City Airport>> Why choose Daon for Registered Traveler Programs? Registered Traveler programs require the use of a strong, secure, flexible identity management platform to ensure the successful delivery of improved traveler security and increased traveler satisfaction. Systems Integrators rely on Daon to provide the required biometric and biographic management expertise and software with the strongest possible security and privacy protection. Daon's identity management platform, Daon Engine , provides the infrastructure to support all biometric types and algorithms, coupled with standard token, card and credential implementations. Daon Engine delivers a strong encryption security scheme to protect the personal information of the traveler from unauthorized usage. Value to the Airport Airports are concerned with providing their constituents and customers with the best possible travel experience. The safe, efficient movement of passengers through the airport provides for smooth operations and a happy traveler. Daon can assist in providing an infrastructure component that can speed up the screening process, significantly reduce queuing time and enhance traveler convenience without compromising on security. Airport operators, when responsible for checkpoint security, can meet their objectives, while integrating an extensible infrastructure that can support airline operations and commercial businesses at the airport. By leveraging the Registered Traveler card, airports have the opportunity to build passenger loyalty and drive ancillary commercial services to their most frequent customers. Value to the Airline Airlines operate some of the most complex logistical enterprises that exist today. They rely on governments and airport operators to provide the consistent, timely, safe delivery of ground and transfer passengers to their doorstep millions of times every day. Their success is dependent on their ability to maintain schedules in the movement of passengers and equipment in the face of numerous obstacles and a very competitive market. Registered Traveler programs offer a substantial opportunity to facilitate this success in an important demographic. Frequent flyers are primary business travelers, representing steady revenue and less price sensitivity in ticket purchase. Programs that enable these travelers to plan for consistent response in the time at the airport, while offering convenience and security, can create a tremendous opportunity for the airline. With Daon's technology, Registered Traveler programs offer easy to use, highly accurate and reliable identification technology, which strongly protects individual privacy within vault-level security infrastructures. Value to the Frequent Traveler The increase in security implemented around the world after the events of September 2001, has most definitely impacted the frequent air traveler. For passengers, the added time and unpredictability associated with navigating airport security can be directly translated into lost work time, reduced productivity and inconvenience. The ability to avail of a process that can maintain or increase the level of security for all travelers while providing for a predictable, consistent checkpoint processing timeline is invaluable to the frequent traveler. The added security provided through the provision of personal information and the strong authentication of the traveler to their identity claim, supports the implementation of a safe, secure, repeatable security checkpoint processing scheme. Daon supports these solutions through the use of the Daon Engine identity management platform. The Daon Engine enables travelers to enroll their personal data and biometric identifiers into a highly secure, private vault. Once activated by the security authority, this information is then used to verify the individual during each trip through security. By establishing the strong connection, travelers experience a 1-2 second verification process in order to swiftly pass into the checkpoint station, thereby avoiding long delays. Value to Other Travelers The ordinary traveler also benefits from the implementation of a Registered Traveler program. Infrequent to air travel, these individuals still have the same objectives as the frequent traveler - strong security and a pleasant experience. Ordinary travelers may need additional attention and assistance to ensure they quickly pass through security due to their lack of familiarity with security procedures and processes. The implementation of a Registered Traveler program allows the airport or security agency to focus additional resources on these individuals thereby providing the necessary level of assistance. Given our mutual objective of air safety, the ability to deploy resources in the most effective way is a benefit will can all appreciate. Registered Traveler Programs Comprehensive identity management processes and systems have become fundamental to meeting the security requirements of air travel. Key to the success of these efforts is the ability of governments and the industry to implement solutions in the most cost-effective and efficient manner. Registered Traveler programs are a key element in providing the required security protection, while ensuring excellent customer satisfaction and continuing to facilitate commerce. For any program involving registered travelers the broad requirements are: Fast, convenient, easy user experience Inclusion of a strong identification process Capability to utilize multiple identification technologies in a flexible manner Use of a highly secure, private infrastructure Cost-effective, component implmentation for heterogeneous environments Selected by multiple airport and traveler security integrators around the world, Daon specializes in delivering the identity management platform key to these programs' success. Daon's products and solutions assist travelers, airport operators, and airlines around the world in enabling and facilitating their commerce, while providing improved security and privacy protection to their most important customers. By leveraging Daon's identity management software, the airport can also extend the system to manage employees for access control to restricted areas. Daon's technology interoperates with existing ID card systems to provide an additional layer of security. Read how Daon is providing enhanced employee security at London City Airport>> Fast, convenient, easy user experience Inclusion of a strong identification process Capability to utilize multiple identification technologies in a flexible manner Use of a highly secure, private infrastructure Cost-effective, component implmentation for heterogeneous environments Newsflash Daon partner with Unisys to win contract for USA Registered Traveler Pilot Program"
  ]
}