{
  "company": "www.cyberlink.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 1
  },
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Award-Winning Video Editor Video editing and special effects for everyone. Powerful Video Editing Designed With You in Mind Our professional video editor was made to simplify editing. You can jump right into creating videos with our beginner-friendly user interface and studio-quality editing tools. All the Video Editing Tools You Need Trim, crop, add text, video overlays, transitions, and stickers. Speed up your videos or create slow-motion effects. Everything a video maker needs right at your fingertips. All the Video Editing Tools You Need Trim, crop, add text, video overlays, transitions, and stickers. Speed up your videos or create slow-motion effects. Everything a video maker needs right at your fingertips. Thousands of Video Templates Video creation with no experience required. Simply choose a template, customize, and share directly to social media. Content creation has never been faster. Thousands of Video Templates Video creation with no experience required. Simply choose a template, customize, and share directly to social media. Content creation has never been faster. Millions of Stock Videos, Images, and Music Tracks A built-in stock library to speed up your workflow. Easily search and download royalty-free content to enhance your videos. Millions of Stock Videos, Images, and Music Tracks A built-in stock library to speed up your workflow. Easily search and download royalty-free content to enhance your videos. Video Effects Made Simple You don't need to be a VFX artist to create Hollywood-style visual effects. Our green screen editing, drag and drop effects, AI-powered sky replacement, and object detection give you the power to create anything you can imagine. Video Effects Made Simple You don't need to be a VFX artist to create Hollywood-style visual effects. Our green screen editing, drag and drop effects, AI-powered sky replacement, and object detection give you the power to create anything you can imagine. How to Edit a Video 1 Create a new project and import your files. 2 Drag and drop videos, photos, titles, effects and audio onto the timeline. 3 Trim, adjust, and rearrange clips until you're happy with your edit, then produce your video. How to Edit a Video 1 Create a new project and import your files. Create a new project and import your files. 2 Drag and drop videos, photos, titles, effects and audio onto the timeline. Drag and drop videos, photos, titles, effects and audio onto the timeline. 3 Trim, adjust, and rearrange clips until you're happy with your edit, then produce your video. Trim, adjust, and rearrange clips until you're happy with your edit, then produce your video. More Than Just a Video Editor Screen Record and Live Stream Stream directly to Twitch, YouTube, and Facebook. Remove backgrounds with chroma key and add overlay objects. Or capture, edit, and share demos and tutorials to your YouTube Channel. Screen Record and Live Stream Stream directly to Twitch, YouTube, and Facebook. Remove backgrounds with chroma key and add overlay objects. Or capture, edit, and share demos and tutorials to your YouTube Channel. Audio Editor With Effects Make your audio tracks sound their best with our video restoration tools including AI-powered wind removal and speech enhancement. Or create audio effects with the vocal transformer. Audio Editor With Effects Make your audio tracks sound their best with our video restoration tools including AI-powered wind removal and speech enhancement. Or create audio effects with the vocal transformer. What the Community is Saying The software can render videos up to 4k. The rendering speed is awesome. It comes preloaded with many text animations, effects, and transitions. The best part is you can change and play with the settings of the preloaded effects and animations with ease. It's a lot easier to create simple motion graphics and typography compared to its competitors. The learning curve is simpler than most other software that has so many features. There is a whole PowerDirector community and stock library for it's users to access. Love the affordability and ease of use. It has all the bells and whistles of the more expensive competitors yet much more affordable. Great tutorials as well. My favorite things about PowerDirector is how affordable it is and how often then update the software. Its really nice that the company is constantly providing new templates and graphics for the videos every month. We do a LOT of video editing so its really nice to have some variety. \"The best enthusiast-level video editor money can buy. \" \"The best video editing software for Windows and Mac users.\" \"PowerDirector is a program that's suitable for both novices and experienced editors, offering all of the tools you'll need to fine tune your footage at a fairly reasonable price.\" Video Editing Built for All Creators The Best Full-Featured Video Editor and Video Maker App If you prefer editing videos on your phone download the free PowerDirector mobile app. You'll be making stunning, high-quality videos like a pro influencer in no time. The Best Full-Featured Video Editor and Video Maker App If you prefer editing videos on your phone download the free PowerDirector mobile app. You'll be making stunning, high-quality videos like a pro influencer in no time. Create Stunning Videos In Minutes"
  ]
}