{
  "company": "www.everyware.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 109,
    "-1": 13
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 13,
      "0": 109
    }
  },
  "sample_docs": [
    "Accelerate Growth with Online Payment Solutions Drive revenue and expand your business with seamless, scalable online and in-person payment solutions, tailored for every market and need. Request Demo PCI Secure No-Code and Low-Code Hosted Checkout Everyware's Hosted Checkouts equip businesses with secure no-code online payment pages and low-code embedded forms. Easy setup options allow you to customize your checkouts to match your brand for a seamless customer experience. Benefit from top-level security with SSL encryption and PCI DSS compliance. Instant Payment Links via SMS or Email Send secure payment links directly to your customers' SMS or email inbox with Everyware's Payment Links. Whether you're billing for services, collecting donations, or selling products online, our payment links fit every scenario. They are the ideal solution for more efficient remote billing. Customize invoices to match your company branding, configure amounts, discounts, custom fees and more. Ready To Get Started? now to start accepting online payments, or contact us to customize a plan that fits your business needs. Create Account Contact Sales Secure and Convenient QR Code Payments Provide customers the convenience of paying by simply scanning a QR code from a mobile device to quickly reach a secure hosted checkout page or invoice link. Automate Recurring Payments with Everyware Subscription Management Everyware's subscription management features allow you to quickly automate recurring payments, making it easy to collect dues from subscribers or members. Customize plans, set upfront fees, offer trial period discounts, adjust billing schedules and send SMS updates or reminders throughout the course of a plan. Ideal for services needing consistent revenue and engagement. Accept Online Payments Effortlessly a Payment Platform for Businesses of All Sizes Integrate Everyware's payment processing capabilities directly into your existing platform or application with our comprehensive APIs. Designed for developers, our API provides extensive documentation, easy-to-understand code samples, and dedicated support to ensure seamless integration. Whether you're building an e-commerce site, a mobile app, or a complex software system, our API is flexible enough to meet your needs and robust enough to handle any payment volume securely. Everyware REST APIs for Essential Payment Functions You can use secure and flexible REST APIs from Everyware to improve your software platform. These APIs offer services such as invoicing, text payments, secure payment options, and instant payouts. Our APIs are made for developers and include simple documentation, code samples, and dedicated support to help with integration. See the Docs Drive revenue and expand your business with seamless, scalable online and in-person payment solutions, tailored for every market and need. PCI Secure No-Code and Low-Code Hosted Checkout Everyware's Hosted Checkouts equip businesses with secure no-code online payment pages and low-code embedded forms. Easy setup options allow you to customize your checkouts to match your brand for a seamless customer experience. Benefit from top-level security with SSL encryption and PCI DSS compliance. Instant Payment Links via SMS or Email Send secure payment links directly to your customers' SMS or email inbox with Everyware's Payment Links. Whether you're billing for services, collecting donations, or selling products online, our payment links fit every scenario. They are the ideal solution for more efficient remote billing. Customize invoices to match your company branding, configure amounts, discounts, custom fees and more. Ready To Get Started? now to start accepting online payments, or contact us to customize a plan that fits your business needs. Secure and Convenient QR Code Payments Provide customers the convenience of paying by simply scanning a QR code from a mobile device to quickly reach a secure hosted checkout page or invoice link. Automate Recurring Payments with Everyware Subscription Management Everyware's subscription management features allow you to quickly automate recurring payments, making it easy to collect dues from subscribers or members. Customize plans, set upfront fees, offer trial period discounts, adjust billing schedules and send SMS updates or reminders throughout the course of a plan. Ideal for services needing consistent revenue and engagement. Accept Online Payments Effortlessly a Payment Platform for Businesses of All Sizes Integrate Everyware's payment processing capabilities directly into your existing platform or application with our comprehensive APIs. Designed for developers, our API provides extensive documentation, easy-to-understand code samples, and dedicated support to ensure seamless integration. Whether you're building an e-commerce site, a mobile app, or a complex software system, our API is flexible enough to meet your needs and robust enough to handle any payment volume securely. Everyware REST APIs for Essential Payment Functions You can use secure and flexible REST APIs from Everyware to improve your software platform. These APIs offer services such as invoicing, text payments, secure payment options, and instant payouts. Our APIs are made for developers and include simple documentation, code samples, and dedicated support to help with integration.",
    "Login Help Center Fast, Easy Mobile Payments For Your Customers In collaboration with PNC Merchant Services®, Everyware allows you to invoice by text, email, or both. Customers can make payments from their preferred payment method simply by responding with \"yes.\" Get Started Get Started Enroll in Everyware and PNC Merchant Services® to begin accepting payments by text message from your customers. Get Paid Quickly Give your customers the opportunity to pay faster than traditional mailed invoicing and save on paper billing by sending invoices through text, email, or both. Boost Revenue Collect more payments by making it easy for customers to pay right from their phones with multiple payment options. The Industries We Serve Everyware is widely used in healthcare practices, billing and account receivables agencies, non-profit organizations, the travel industry, auto dealerships, restaurants, and many more. Our payment and messaging features ensure faster payments while our easy integration means that businesses across all industries can easily adopt our payments platform. Healthcare Nonprofit Billing Management Automotive Retail Healthcare Everyware is the perfect payment system for pharmacies, specialty practices, chiropractors, health systems, medical billing agencies, and more. Patients can complete payment whether they're at the practice or not. Send batches of patient invoices with automatic, personalized reminder texts so fewer patients forget to pay their bills. As more and more telehealth appointments are conducted by phone, doesn't it make sense for patients to be able to make instantaneous payments right from the same device? Everyware offers health care practices, health management platforms, and medical billing agencies HIPAA secure messaging and convenient payment solutions. Tokenized payment methods allow patients to pay with their preferred payment method simply by typing \"yes\" and hitting send. Nonprofit Even the most altruistic donors can forget about their commitments. Building trust with donors, establishing long-term relationships, and raising more funds to help you achieve your mission and reach your goals just got simpler. With Everyware, donations are a simple text away. Donors can contribute anywhere, anytime, from their phones. Text To Give allows your donors to text \"give\" to initiate recurring or one-time donations. Engage your donors and volunteers via our two-way messaging platform. Billing Management Customers can easily ignore or lose emails and physical invoices. Before sending expensive paper statements, use Everyware for batch invoicing by text, email, or both with automated payment reminder messages. Cost-effectively improve billing management with a simple platform that manages to collect subscription payments, send invoices, and build customer relationships all at the same time. Whether you're looking to accept multiple payment options for your business or simply want to increase account receivables, we can help you grow. Automotive Whether you own a smaller pre-owned lot or a large franchise dealership, Everyware can help improve your process with our text engagement platform. Increase staff efficiencies, build customer loyalty, get paid faster, and keep your dealership working efficiently. You can use Everyware to invoice customers, send reminders, and engage them via two-way texting. Retail Create a modern payment experience to increase sales and build brand loyalty. Unlock a customer experience that can scale and generate new revenue through two-way text engagement. Offer your customers a Pay By Text invoice that they can pay from their phone without presenting a card. Everyware's buying experience enables retailers to improve a customer's checkout process, build loyalty, and generate more sales. Pricing: Everyware Standard SaaS per month: ........................................................................... $19.99 Everyware Per Text Message Fee (inbound and outbound): ............................. $0.02 Everyware Gateway Fee Per Transaction: ..................................................................... $0.05 Everyware ACH Fee: ................................................................................................................... $0.15 PNC Bank, National Association and PNC Merchant Services Company (together referred to as \"PNC\") do not provide the product or services advertised by Everyware and PNC makes no representation, warranties or guarantees regarding Everyware, or your use of its products or its services. PNC has no control over Everyware's website and make no representations about any content, products or services available on this site. This site may have different privacy, security and accessibility standards than PNC's website. When you access Everyware's or any other third-party's website, we recommend that you review their term and conditions, and privacy and security policy. If you purchase Everyware's service, PNC Merchant Services Company will receive a commission. PNC is a registered mark of The PNC Financial Services Group, Inc. Login Help Center Fast, Easy Mobile Payments For Your Customers In collaboration with PNC Merchant Services®, Everyware allows you to invoice by text, email, or both. Customers can make payments from their preferred payment method simply by responding with \"yes.\" Get Started Get Started Enroll in Everyware and PNC Merchant Services® to begin accepting payments by text message from your customers. Get Paid Quickly Give your customers the opportunity to pay faster than traditional mailed invoicing and save on paper billing by sending invoices through text, email, or both. Boost Revenue Collect more payments by making it easy for customers to pay right from their phones with multiple payment options. The Industries We Serve Everyware is widely used in healthcare practices, billing and account receivables agencies, non-profit organizations, the travel industry, auto dealerships, restaurants, and many more. Our payment and messaging features ensure faster payments while our easy integration means that businesses across all industries can easily adopt our payments platform. Healthcare Nonprofit Billing Management Automotive Retail Healthcare Everyware is the perfect payment system for pharmacies, specialty practices, chiropractors, health systems, medical billing agencies, and more. Patients can complete payment whether they're at the practice or not. Send batches of patient invoices with automatic, personalized reminder texts so fewer patients forget to pay their bills. As more and more telehealth appointments are conducted by phone, doesn't it make sense for patients to be able to make instantaneous payments right from the same device? Everyware offers health care practices, health management platforms, and medical billing agencies HIPAA secure messaging and convenient payment solutions. Tokenized payment methods allow patients to pay with their preferred payment method simply by typing \"yes\" and hitting send. Nonprofit Even the most altruistic donors can forget about their commitments. Building trust with donors, establishing long-term relationships, and raising more funds to help you achieve your mission and reach your goals just got simpler. With Everyware, donations are a simple text away. Donors can contribute anywhere, anytime, from their phones. Text To Give allows your donors to text \"give\" to initiate recurring or one-time donations. Engage your donors and volunteers via our two-way messaging platform. Billing Management Customers can easily ignore or lose emails and physical invoices. Before sending expensive paper statements, use Everyware for batch invoicing by text, email, or both with automated payment reminder messages. Cost-effectively improve billing management with a simple platform that manages to collect subscription payments, send invoices, and build customer relationships all at the same time. Whether you're looking to accept multiple payment options for your business or simply want to increase account receivables, we can help you grow. Automotive Whether you own a smaller pre-owned lot or a large franchise dealership, Everyware can help improve your process with our text engagement platform. Increase staff efficiencies, build customer loyalty, get paid faster, and keep your dealership working efficiently. You can use Everyware to invoice customers, send reminders, and engage them via two-way texting. Retail Create a modern payment experience to increase sales and build brand loyalty. Unlock a customer experience that can scale and generate new revenue through two-way text engagement. Offer your customers a Pay By Text invoice that they can pay from their phone without presenting a card. Everyware's buying experience enables retailers to improve a customer's checkout process, build loyalty, and generate more sales. Pricing: Everyware Standard SaaS per month: ........................................................................... $19.99 Everyware Per Text Message Fee (inbound and outbound): ............................. $0.02 Everyware Gateway Fee Per Transaction: ..................................................................... $0.05 Everyware ACH Fee: ................................................................................................................... $0.15 PNC Bank, National Association and PNC Merchant Services Company (together referred to as \"PNC\") do not provide the product or services advertised by Everyware and PNC makes no representation, warranties or guarantees regarding Everyware, or your use of its products or its services. PNC has no control over Everyware's website and make no representations about any content, products or services available on this site. This site may have different privacy, security and accessibility standards than PNC's website. When you access Everyware's or any other third-party's website, we recommend that you review their term and conditions, and privacy and security policy. If you purchase Everyware's service, PNC Merchant Services Company will receive a commission. PNC is a registered mark of The PNC Financial Services Group, Inc. Fast, Easy Mobile Payments For Your Customers Enroll in Everyware and PNC Merchant Services® to begin accepting payments by text message from your customers. Give your customers the opportunity to pay faster than traditional mailed invoicing and save on paper billing by sending invoices through text, email, or both. Collect more payments by making it easy for customers to pay right from their phones with multiple payment options. The Industries We Serve Everyware is widely used in healthcare practices, billing and account receivables agencies, non-profit organizations, the travel industry, auto dealerships, restaurants, and many more. Our payment and messaging features ensure faster payments while our easy integration means that businesses across all industries can easily adopt our payments platform. Healthcare Nonprofit Billing Management Automotive Retail Healthcare Everyware is the perfect payment system for pharmacies, specialty practices, chiropractors, health systems, medical billing agencies, and more. Patients can complete payment whether they're at the practice or not. Send batches of patient invoices with automatic, personalized reminder texts so fewer patients forget to pay their bills. As more and more telehealth appointments are conducted by phone, doesn't it make sense for patients to be able to make instantaneous payments right from the same device? Everyware offers health care practices, health management platforms, and medical billing agencies HIPAA secure messaging and convenient payment solutions. Tokenized payment methods allow patients to pay with their preferred payment method simply by typing \"yes\" and hitting send. Nonprofit Even the most altruistic donors can forget about their commitments. Building trust with donors, establishing long-term relationships, and raising more funds to help you achieve your mission and reach your goals just got simpler. With Everyware, donations are a simple text away. Donors can contribute anywhere, anytime, from their phones. Text To Give allows your donors to text \"give\" to initiate recurring or one-time donations. Engage your donors and volunteers via our two-way messaging platform. Billing Management Customers can easily ignore or lose emails and physical invoices. Before sending expensive paper statements, use Everyware for batch invoicing by text, email, or both with automated payment reminder messages. Cost-effectively improve billing management with a simple platform that manages to collect subscription payments, send invoices, and build customer relationships all at the same time. Whether you're looking to accept multiple payment options for your business or simply want to increase account receivables, we can help you grow. Automotive Whether you own a smaller pre-owned lot or a large franchise dealership, Everyware can help improve your process with our text engagement platform. Increase staff efficiencies, build customer loyalty, get paid faster, and keep your dealership working efficiently. You can use Everyware to invoice customers, send reminders, and engage them via two-way texting. Retail Create a modern payment experience to increase sales and build brand loyalty. Unlock a customer experience that can scale and generate new revenue through two-way text engagement. Offer your customers a Pay By Text invoice that they can pay from their phone without presenting a card. Everyware's buying experience enables retailers to improve a customer's checkout process, build loyalty, and generate more sales. PNC Bank, National Association and PNC Merchant Services Company (together referred to as \"PNC\") do not provide the product or services advertised by Everyware and PNC makes no representation, warranties or guarantees regarding Everyware, or your use of its products or its services. PNC has no control over Everyware's website and make no representations about any content, products or services available on this site. This site may have different privacy, security and accessibility standards than PNC's website. When you access Everyware's or any other third-party's website, we recommend that you review their term and conditions, and privacy and security policy. If you purchase Everyware's service, PNC Merchant Services Company will receive a commission. PNC is a registered mark of The PNC Financial Services Group, Inc.",
    "SMS and Email Invoicing Experience seamless invoicing. Create and send professional digital invoices with customizable branding directly through SMS and email. Enhance customer convenience with accessible payment links, boosting your transaction completion rates. Contactless Payments: Pay by Text With Everyware's Pay by Text, your customers can make secure payments on the move. A simple text message completes the transaction for ultimate convenience۔ Key in Payments: Virtual Terminal Manually enter payment details with confidence, knowing your transactions are handled securely and with care. Subscriptions and Recurring Payment Plans Boost retention with our automated SMS updates for subscription and payment plans. Offer your customers hassle-free recurring payments, tailored to their needs for ongoing service۔ Buy Now, Pay Later (BNPL) Options Introduce financial flexibility with BNPL options via Everyware's partnership with Sunbit. Provide transparent, integrated payment plans, enhancing customer buying power without complicating the checkout process. Secure Everyware Checkout Pages and Website Forms Everyware offers securely hosted, customizable online payment experiences with no-code hosted checkout pages and low-code embedded forms. about accepting payments via links, QR codes, or directly through your website, all while ensuring PCI DSS compliance. Instant Payouts Accelerate your payee disbursements with Instant Payouts. Transfer funds securely and swiftly to customer cards or bank accounts without the hassle of paper checks. In-Person Payments Everyware supports a variety of payment terminals, including Ingenico and Clover, making transactions at the point of sale smooth and reliable. Swipe, tap, and go with confidence at your physical storefronts. Affordable Merchant Processing Partner with Everyware for competitively low processing rates through globally recognized processors. Our Merchant Processing Solutions are crafted to maximize your transaction efficiency with full-scale reporting and analytics. SMS and Email Invoicing Experience seamless invoicing. Create and send professional digital invoices with customizable branding directly through SMS and email. Enhance customer convenience with accessible payment links, boosting your transaction completion rates. Contactless Payments: Pay by Text With Everyware's Pay by Text, your customers can make secure payments on the move. A simple text message completes the transaction for ultimate convenience۔ Key in Payments: Virtual Terminal Manually enter payment details with confidence, knowing your transactions are handled securely and with care. Subscriptions and Recurring Payment Plans Boost retention with our automated SMS updates for subscription and payment plans. Offer your customers hassle-free recurring payments, tailored to their needs for ongoing service۔ Buy Now, Pay Later (BNPL) Options Introduce financial flexibility with BNPL options via Everyware's partnership with Sunbit. Provide transparent, integrated payment plans, enhancing customer buying power without complicating the checkout process. Secure Everyware Checkout Pages and Website Forms Everyware offers securely hosted, customizable online payment experiences with no-code hosted checkout pages and low-code embedded forms. about accepting payments via links, QR codes, or directly through your website, all while ensuring PCI DSS compliance. Instant Payouts Accelerate your payee disbursements with Instant Payouts. Transfer funds securely and swiftly to customer cards or bank accounts without the hassle of paper checks. In-Person Payments Everyware supports a variety of payment terminals, including Ingenico and Clover, making transactions at the point of sale smooth and reliable. Swipe, tap, and go with confidence at your physical storefronts. Affordable Merchant Processing Partner with Everyware for competitively low processing rates through globally recognized processors. Our Merchant Processing Solutions are crafted to maximize your transaction efficiency with full-scale reporting and analytics. Experience seamless invoicing. Create and send professional digital invoices with customizable branding directly through SMS and email. Enhance customer convenience with accessible payment links, boosting your transaction completion rates. With Everyware's Pay by Text, your customers can make secure payments on the move. A simple text message completes the transaction for ultimate convenience۔ Manually enter payment details with confidence, knowing your transactions are handled securely and with care. Boost retention with our automated SMS updates for subscription and payment plans. Offer your customers hassle-free recurring payments, tailored to their needs for ongoing service۔ Introduce financial flexibility with BNPL options via Everyware's partnership with Sunbit. Provide transparent, integrated payment plans, enhancing customer buying power without complicating the checkout process. Everyware offers securely hosted, customizable online payment experiences with no-code hosted checkout pages and low-code embedded forms. about accepting payments via links, QR codes, or directly through your website, all while ensuring PCI DSS compliance. Accelerate your payee disbursements with Instant Payouts. Transfer funds securely and swiftly to customer cards or bank accounts without the hassle of paper checks. Everyware supports a variety of payment terminals, including Ingenico and Clover, making transactions at the point of sale smooth and reliable. Swipe, tap, and go with confidence at your physical storefronts. Partner with Everyware for competitively low processing rates through globally recognized processors. Our Merchant Processing Solutions are crafted to maximize your transaction efficiency with full-scale reporting and analytics.",
    "Multiple Ways to Pay Enhance Your Customer Experience with Dynamic Payments & Messaging Our integrated payment and messaging system boosts payment rates, improves financial metrics, and enhances customer satisfaction. Multiple Ways to Pay Enhance Your Customer Experience with Dynamic Payments & Messaging Our integrated payment and messaging system boosts payment rates, improves financial metrics, and enhances customer satisfaction. Experience enhanced value and benefits with our streamlined payment solutions Effortless Payments & Exceptional Customer Service Offer your customers the smooth, contactless payment experience they desire, enhancing satisfaction and ensuring timely payments. Swift & Smooth Checkouts Eliminate checkout wait times. Streamline your payment process with Everyware's automated payment and text messaging platform. Seamless Communication Deliver superior customer service by enabling customers to text a dedicated messaging number for seamless communication with staff across all departments. Flexible Payment Options Cater to your customers' preferences with a variety of payment methods, including Card, Bank Account, Digital Wallet, and the ever-popular Buy Now, Pay Later option. Manage every payment from one convenient platform Streamline Payments with Cards Saved on File Eliminate the hassle of updating payment details. With Everyware, customers' preferred payment methods are securely stored, simplifying checkouts. Plus, customers can easily approve transactions with a simple 'Yes' via text message. Seamless Digital Wallet Transactions: Google Pay, Apple Pay and PayPal Allow customers to use any method saved to their digital wallet of choice. Enable your customers to utilize their preferred digital wallets, including PayPal, Google Pay and Apple Pay. Allow your customers to access credit or debit cards saved in their Digital Wallet app. Empower Your Customers with Buy Now, Pay Later Customers get more time to pay for what they need with Buy Now, Pay Later. This modernized pay over time solution allows customers to pay installments with flexible options. Merchants are paid right away while Everyware pay-over-time partners handle the rest. Experience enhanced value and benefits with our streamlined payment solutions Effortless Payments & Exceptional Customer Service Offer your customers the smooth, contactless payment experience they desire, enhancing satisfaction and ensuring timely payments. Swift & Smooth Checkouts Eliminate checkout wait times. Streamline your payment process with Everyware's automated payment and text messaging platform. Deliver superior customer service by enabling customers to text a dedicated messaging number for seamless communication with staff across all departments. Cater to your customers' preferences with a variety of payment methods, including Card, Bank Account, Digital Wallet, and the ever-popular Buy Now, Pay Later option. Manage every payment from one convenient platform Streamline Payments with Cards Saved on File Eliminate the hassle of updating payment details. With Everyware, customers' preferred payment methods are securely stored, simplifying checkouts. Plus, customers can easily approve transactions with a simple 'Yes' via text message. Seamless Digital Wallet Transactions: Google Pay, Apple Pay and PayPal Allow customers to use any method saved to their digital wallet of choice. Enable your customers to utilize their preferred digital wallets, including PayPal, Google Pay and Apple Pay. Allow your customers to access credit or debit cards saved in their Digital Wallet app. Empower Your Customers with Buy Now, Pay Later Customers get more time to pay for what they need with Buy Now, Pay Later. This modernized pay over time solution allows customers to pay installments with flexible options. Merchants are paid right away while Everyware pay-over-time partners handle the rest. Ready to Get Started? Let's Go! Ready to Get Started?",
    "Buy Now Pay-Over-Time Everyware and Sunbit have partnered to make financing fast and easy for you and your customers. Start offering personalized, transparent payment plan options with Everyware invoices that can be approved in seconds, with low interest rates and no hidden fees. Apply Today Everyware and Sunbit have partnered to make financing fast and easy for you and your customers. Start offering personalized, transparent payment plan options with Everyware invoices that can be approved in seconds, with low interest rates and no hidden fees. Approved in 30 Seconds Seamless flow within a secure pay by text experience. Integrated FAST applications take only 30 seconds to complete once the customer selects the Sunbit payment method. Get Paid Quickly Merchants get paid right away while Sunbit takes care of the rest. Payments are made easy for both merchants and consumers. Boost Revenue Capture more revenue for high ticket items, 90% of customers approved for plan without a hard credit check to apply. (5) apply today Approved in 30 Seconds Seamless flow within a secure pay by text experience. Integrated FAST applications take only 30 seconds to complete once the customer selects the Sunbit payment method. Merchants get paid right away while Sunbit takes care of the rest. Payments are made easy for both merchants and consumers. Capture more revenue for high ticket items, 90% of customers approved for plan without a hard credit check to apply. (5) Available for Merchants Across Industries Auto Repair Shops Eyewear and Eye Care Automotive Dealerships Home Services Specialty Care Practices Med Spas Dental Practices Retail Apply Today Available for Merchants Across Industries Eyewear and Eye Care 40 % of Americans can't cover a $400 emergency expense (1) 60 % of drivers skip automotive repairs for cost reasons (2) 61 % of Americans live paycheck to paycheck (3) 58 % of U.S. adults say they delay or decline medical care due to cost (4) of Americans can't cover a $400 emergency expense (1) of drivers skip automotive repairs for cost reasons (2) of Americans live paycheck to paycheck (3) of U.S. adults say they delay or decline medical care due to cost (4) Stress Free Payment Options Allow customers to pay for purchases with a 3-72 month loan option instead of all at once. Provide access to fast, fair and easy financing to consumers across the credit spectrum with credit approval rates among the highest in the industry. Reduce sticker shock by letting customers know they don't have to pay today, and can simply pay with a personalized plan that works best for them. Stress Free Payment Options Allow customers to pay for purchases with a 3-72 month loan option instead of all at once. Provide access to fast, fair and easy financing to consumers across the credit spectrum with credit approval rates among the highest in the industry. Reduce sticker shock by letting customers know they don't have to pay today, and can simply pay with a personalized plan that works best for them. Sell More High Ticket Items no hard credit checks to apply (5) 3 to 72 month payment options (5) no fees or penalties stress-free way to pay 0% interest plans available at participating merchants only (5) quick approval Sell More High Ticket Items no hard credit checks to apply (5) no hard credit checks to apply (5) 3 to 72 month payment options (5) 3 to 72 month payment options (5) no fees or penalties no fees or penalties stress-free way to pay stress-free way to pay 0% interest plans available at participating merchants only (5) 0% interest plans available at participating merchants only (5)"
  ]
}