{
  "company": "www.visidon.fi",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 6
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "0": 6
    }
  },
  "sample_docs": [
    "Visidon releases 3D face recognition engine for mobiles. Visidon Ltd Teknologiantie 1 90570 Oulu, Finland Tel. +358 40 732 2281 E-Mail Visidon offers advanced video processing solutions Visidon is a software development company that provides powerful and flexible video processing solutions for various platforms ranging from multi computer systems to embedded devices and mobile phones. Our offering ranges from licensing of highly optimized real-time video processing components to developing complete applications for your special needs. Our target is to help you in creating high-end products and services. Visidon's Products - Visidon's Technology -",
    "Visidon Ltd Teknologiantie 1 90570 Oulu, Finland Tel. +358 40 732 2281 E-Mail [Jun 2011] New patent for detecting and tracking objects in digital images granted for Visidon. [May 2011] A new face recognition based security app released for Android. Visidon AppLock protects any application (i.e. SMS, Gallery, E-Mail, Facebook, etc.) on your phone using face recognition. Freely available at Android Market . [May 2011] Visidon releases 3D face recognition engine for mobiles. Highly efficient and real-time technology supports standard mobile platforms and cameras. [May 2011] Visidon releases a face recognition based authentication for mobile Facebook client. App is available for Nokia N8 at Ovi Store . [Feb 2011] Visidon at MWC , Barcelona, Spain. Contact us to arrange a meeting. [Oct 2010] CEO of Visidon, Markus Turtinen, will give an invited talk about mobile biometry at Biometrics Exhibition and Conference 2010 , London, UK. Visidon technology is demonstrated on Mobio booth (#319) as well as other Mobio project result. [Sep 2010] iRecon is exhibited on dmexco exhibition in Cologne, on Alcatel-Lucent booth. [Aug 2010] Visidon Ltd participates on mobile face verification competition in ICPR 2010. See the results! [Feb 2010] Visidon Ltd participates Mobile World Congress in Barcelona 15-18 February 2010. http://www.mobileworldcongress.com [Feb 2010] Visidon Ltd participates ISE 2010 Exhibition at Amsterdam February 2nd through 4th together with Symbicon Ltd. Visidon and Symbicon present new audience measurement and reporting system. Visidon's face technology (age, gender, smile, activity) is integrated to the Symbicon displays and the web-based user interface is provided for easy access. [Feb 2010] Visidon moves to new premises. New address is Teknologiantie 1, 90570 Oulu, Finland. [11.8.2009] Visidon releases improved version of Face Recognition for embedded devices. Not are we only able to find faces from the image, we can also give identity for these! [1.7.2009] Visidon participates in European project on Mobile biometry. http://www.mobioproject.org/ [30.6.2009] Visidon demonstrates real-time object recognition on mobile phone. We are able to disrciminate between different logos, buildings etc.. [2.6.2009] Visidon provides face detection technology for UBIOulu . Future versions will include support for age, gender and expression recognition. [01.10.2008] Visidon will move to a new premises located at the Technopolis Linnanmaa. Map [01.04.2008] Visidon released new web pages. www.visidon.fi New patent for detecting and tracking objects in digital images granted for Visidon. A new face recognition based security app released for Android. Visidon AppLock protects any application (i.e. SMS, Gallery, E-Mail, Facebook, etc.) on your phone using face recognition. Freely available at Android Market . Visidon releases 3D face recognition engine for mobiles. Highly efficient and real-time technology supports standard mobile platforms and cameras. Visidon releases a face recognition based authentication for mobile Facebook client. App is available for Nokia N8 at Ovi Store . Visidon at MWC , Barcelona, Spain. Contact us to arrange a meeting. CEO of Visidon, Markus Turtinen, will give an invited talk about mobile biometry at Biometrics Exhibition and Conference 2010 , London, UK. Visidon technology is demonstrated on Mobio booth (#319) as well as other Mobio project result. iRecon is exhibited on dmexco exhibition in Cologne, on Alcatel-Lucent booth. [Aug 2010] Visidon Ltd participates on mobile face verification competition in ICPR 2010. See the results! [Feb 2010] Visidon Ltd participates Mobile World Congress in Barcelona 15-18 February 2010. http://www.mobileworldcongress.com [Feb 2010] Visidon Ltd participates ISE 2010 Exhibition at Amsterdam February 2nd through 4th together with Symbicon Ltd. Visidon and Symbicon present new audience measurement and reporting system. Visidon's face technology (age, gender, smile, activity) is integrated to the Symbicon displays and the web-based user interface is provided for easy access. [Feb 2010] Visidon moves to new premises. New address is Teknologiantie 1, 90570 Oulu, Finland. [11.8.2009] Visidon releases improved version of Face Recognition for embedded devices. Not are we only able to find faces from the image, we can also give identity for these! [1.7.2009] Visidon participates in European project on Mobile biometry. http://www.mobioproject.org/ [30.6.2009] Visidon demonstrates real-time object recognition on mobile phone. We are able to disrciminate between different logos, buildings etc.. [2.6.2009] Visidon provides face detection technology for UBIOulu . Future versions will include support for age, gender and expression recognition. [01.10.2008] Visidon will move to a new premises located at the Technopolis Linnanmaa. Map [01.04.2008] Visidon released new web pages. www.visidon.fi Visidon Ltd participates on mobile face verification competition in ICPR 2010. See the results! Visidon Ltd participates Mobile World Congress in Barcelona 15-18 February 2010. http://www.mobileworldcongress.com Visidon Ltd participates ISE 2010 Exhibition at Amsterdam February 2nd through 4th together with Symbicon Ltd. Visidon and Symbicon present new audience measurement and reporting system. Visidon's face technology (age, gender, smile, activity) is integrated to the Symbicon displays and the web-based user interface is provided for easy access. Visidon moves to new premises. New address is Teknologiantie 1, 90570 Oulu, Finland. Visidon releases improved version of Face Recognition for embedded devices. Not are we only able to find faces from the image, we can also give identity for these! Visidon participates in European project on Mobile biometry. http://www.mobioproject.org/ Visidon demonstrates real-time object recognition on mobile phone. We are able to disrciminate between different logos, buildings etc.. Visidon provides face detection technology for UBIOulu . Future versions will include support for age, gender and expression recognition. Visidon will move to a new premises located at the Technopolis Linnanmaa. Map Visidon released new web pages. www.visidon.fi",
    "Visidon Ltd Teknologiantie 1 90570 Oulu, Finland Tel. +358 40 732 2281 E-Mail Visidon offers computationally efficient video processing solutions for several embedded and mobile device platforms in addition to personal computers. iRecon - Audience Measurement System Object Blurrer - Hiding Private Information Facial Image Analysis API iRecon - Audience Measurement System Object Blurrer - Hiding Private Information Facial Image Analysis API iRecon - Audience Measurement System Visidon provides a complete solution for digital signage audience measurement and reporting. The camera based system measures accurately bypassing people and creates automatic statistics about them. Visual reports and statistics can be explored anytime and anywhere with a web based application. Easy to use interface and automatic e-mail reporting provides you with knowledge about your customers, linked to time, location and advertisements. Visit www.irecononline.com for more information. Object Blurrer - Hiding Private Information Digital images, such as automatically collected street view images, contain a lot of private information. For example, faces and license plates are often wanted to be hidden due to legal reasons or due to a public opinion. Hiding these manually is a laborious task, as amount of automatically collected data easily grows huge. Visidon provides a solution for doing all this accurately and fully automatically. Get free demo or ask more Facial Image Analysis API Facial Image Analysis API is a high performance face image processing engine specially designed for embedded platforms such as mobile phones. A vast majority of images and videos contain people. With our recognition technology, these faces can now have identity. Visidon face detection and tracking technology improves image capture and post-processing based on human faces. It corrects red eyes automatically. Face information, complemented with age, gender and expression recognition, enables creating novel and innovative applications. Demos available for Maemo, S60, and Windows Get free demo or ask more Get free demo or ask more",
    "Visidon Ltd Teknologiantie 1 90570 Oulu, Finland Tel. +358 40 732 2281 E-Mail Visidon offers computationally efficient video analysis technology for several embedded and mobile device platforms in addition to personal computers. Face Detection and Tracking Face Identification Gender, Expression, and Age Recognition Face Detection and Tracking Gender, Expression, and Age Recognition See also technical publications Face Detection and Tracking Visidon's face detection and tracking technology improves image capture and post-processing based on human faces. Furthermore, facial information enables novel and innovative applications. State-of-the-art in accuracy Any orientation, including in plane and out of plane rotations Unlimited amount of faces per image Simultaneous tracking of faces ranging from whole image to 1/16 of image width in size Robust to varying imaging conditions and input image (illumination, sharpness, color, noise, etc.), allowing effortless image quality improvement Any orientation, including in plane and out of plane rotations Unlimited amount of faces per image Simultaneous tracking of faces ranging from whole image to 1/16 of image width in size Robust to varying imaging conditions and input image (illumination, sharpness, color, noise, etc.), allowing effortless image quality improvement Fast detection and tracking Typical initial face locking time less than 100 ms, ARM9 180MHz, QVGA input Tracking 10 ms per face Typical initial face locking time less than 100 ms, ARM9 180MHz, QVGA input Tracking 10 ms per face Designed for embedded usage Windows, Linux, Windows Mobile, Symbian, ARM, x86 Easy to port to new platforms Small code size and memory usage Possibility for customer specific tailoring and optimization services Windows, Linux, Windows Mobile, Symbian, ARM, x86 Easy to port to new platforms Small code size and memory usage Possibility for customer specific tailoring and optimization services A vast majority of images and videos contain people. With our recognition technology, these faces can now be identified. The technology is highly optimized for embedded devices and is easy to integrate to digital cameras, mobile phones, surveillance cameras, and other imaging devices. State-of-the-art recognition performance 70%-99% against 1000 individuals with number of standard and private databases Tolerates varying imaging conditions and illumination Robust to aging (including beard, glasses and hair style change) and expressions 70%-99% against 1000 individuals with number of standard and private databases Tolerates varying imaging conditions and illumination Robust to aging (including beard, glasses and hair style change) and expressions Fast processing time Typically 1 second for the input face (ARM9,180MHz) Fast comparison (<1 ms per person in database) Adaptive for optimal application performance Typically 1 second for the input face (ARM9,180MHz) Fast comparison (<1 ms per person in database) Adaptive for optimal application performance Designed for embedded usage Windows, Linux, Windows Mobile, Symbian, ARM, x86 Easy to port to new platforms Possibility for customer specific tailoring and R&D services Windows, Linux, Windows Mobile, Symbian, ARM, x86 Easy to port to new platforms Possibility for customer specific tailoring and R&D services Gender, Expression, and Age Recognition Face information, complemented with age, gender and expression recognition, enables creating novel and innovative applications. State-of-the-art performance Over 90% accuracy for gender measurements Average precision of 6 years in age estimation Expression categorization accuracy of 90% Over 90% accuracy for gender measurements Average precision of 6 years in age estimation Expression categorization accuracy of 90% Fast processing time Real-time smile and blink detection on mobile phones Allow pre-capture analysis Real-time smile and blink detection on mobile phones Designed for embedded usage Windows, Linux, Windows Mobile, Symbian, ARM, x86 Possibility for customer specific tailoring and R&D services Windows, Linux, Windows Mobile, Symbian, ARM, x86 Possibility for customer specific tailoring and R&D services Please contact us for product specific data sheets or other unpublished material of interest. Some public documents: On the Results of the First Mobile Biometry (MOBIO) Face and Speaker Verification Evaluation (with Idiap, Univ. of Surrey, etc.) MOBIO: Mobile Biometric Face and Speaker Authentication (with Idiap and Brno Univ.) Video analysis tools on mobile communication devices (with Univ. of Oulu) New Video Applications on Mobile Communication Devices (with Univ. of Oulu and Nokia Research Center) On the Results of the First Mobile Biometry (MOBIO) Face and Speaker Verification Evaluation (with Idiap, Univ. of Surrey, etc.) MOBIO: Mobile Biometric Face and Speaker Authentication (with Idiap and Brno Univ.) Video analysis tools on mobile communication devices (with Univ. of Oulu) New Video Applications on Mobile Communication Devices (with Univ. of Oulu and Nokia Research Center)",
    "Visidon Ltd face recognition technology identifies persons in images with great accuracy and speed. Our face recognition engine is designed to seamlessly integrate it's functionality into mobile devices and other embedded platforms, having the scalability to also operate in server environments and in between these. Platform-independent cloud extension brings capabilities to handle millions of faces in just a second. Read more Read more Visidon Ltd face technology has, in addition of possessing capabilities to identify persons, the ability to measure facial characteristics like gender, age and mood, based on visual cues. Furthermore, it can also apply automatic photo improvement for facial areas - for example detecting whether the person's eyes are open, and if necessary, applying red eye removal, as well as having the option for overall facial enhancement. Read more Read more Visidon AppLock for Android Visidon AppLock is an agile, convenient and a fresh way to protect your Android mobile device with face recognition quality. Visidon AppLock is highly praised in the field of technology, being one of the most widely spread face recognition software available for mobiles. Check it out today, it's free! Read more Read more iRecon - Audience measurement & interaction solution iRecon is a fully automated audience measurement solution, ideal for building entertaining digital signage applications and other use. Powered by Visidon FaceSDK, focusing on providing real-time measurements and gathering information of facial expressions, gender and age distribution. Very useful in situations, where general attendee data gathering is desirable - iRecon technology can for example help in delivering a specifically targeted market message. Read more Read more Extensive knowledge on mobile platforms Wish for our face recognition and image analysis technology to be functional in a specific platform? We can help you to create high quality imaging features, especially designed for individually defined goals. Contact us today! Best in class - Visidon face recognition Visidon Ltd Teknologiantie 1 90570 Oulu, Finland Tel. +358 40 732 2281 E-Mail"
  ]
}