{
  "company": "www.systemaidcaribbean.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Our Services We at SystemAid Caribbean Limited offer a wide range of services such as custom software and database development and Biometric Clocks among many others! PayrollPlus Payroll Software Payroll software designed for Trinidad & Tobago. for more details SmartSale Point-of-Sale Software SmartSale is a our flagship Point of Sale software. It comes in several versions for different industries such as Mini-Marts, Supermarkets, Food Trucks, Hardware Stores, Restaurants and Pharmacies. For more information contact us. SmartSale Inventory Software Robust Inventory software that is highly customizable to suit any emvironment. For more information contact us. Time Attendance Application Employee time attendance module, for use with electronic clocking machines (both electronic and biometric). For more information contact us. Human Resource Database Management Software Complete management of all HR and employee information. For more information contact us. Web Services Web hosting, Domain name registration & Email setup. For more information contact us. Employee Time Clock - Fingerprint & Biometric Time Clock Solutions Fingerprint biometric employee time clocks. Available by order. for more details Custom Software and Database Development SystemAid Caribbean Limited delivers comprehensive web services and customized software solutions. These range from custom designs to the development of complex systems. For more information contact us. Fleet Management and Maintenance Software Software designed to manage vehicle fleets such as cars and trucks. For more information contact us. We at SystemAid Caribbean Limited offer a wide range of services such as custom software and database development and Biometric Clocks among many others! Payroll software designed for Trinidad & Tobago. for more details SmartSale is a our flagship Point of Sale software. It comes in several versions for different industries such as Mini-Marts, Supermarkets, Food Trucks, Hardware Stores, Restaurants and Pharmacies. For more information contact us. Robust Inventory software that is highly customizable to suit any emvironment. For more information contact us. Employee time attendance module, for use with electronic clocking machines (both electronic and biometric). Human Resource Database Management Software Complete management of all HR and employee information. For more information contact us. Web hosting, Domain name registration & Email setup. For more information contact us. Employee Time Clock - Fingerprint & Biometric Time Clock Solutions Fingerprint biometric employee time clocks. Available by order. for more details Custom Software and Database Development SystemAid Caribbean Limited delivers comprehensive web services and customized software solutions. These range from custom designs to the development of complex systems. For more information contact us. Fleet Management and Maintenance Software Software designed to manage vehicle fleets such as cars and trucks. For more information contact us. About us SystemAid Caribbean Limited comprises a team of IT and Engineering Professionals, who develop, maintain and implement IT Solutions for small and medium sized businesses. SystemAid Caribbean Limited has been established and is providing solutions to companies since the year 2000. Our clients range from various government ministries to private firms in Trinidad & Tobago. With expertise in software development and biometric technologies, SystemAid Caribbean Limited is quickly becoming the premier choice for biometric technologies within the Caribbean. Our aim is to make computerization readily available while providing a flexible and simple to use system. SystemAid Caribbean Limited comprises a team of IT and Engineering Professionals, who develop, maintain and implement various IT Solutions for businesses and organizations primarily in Trinidad and Tobago. Being in the IT business for over 12 years, SystemAid Caribbean Limited has a strong team of skilled and experienced IT experts. Our customers are companies ranging from startups to large enterprises who realize that they need professional internet and software solution services to generate revenue streams, establish communication channels and/or streamline business operations. What we do? SystemAid Caribbean Limited delivers comprehensive web services and customized software solutions. These range from custom designs to the development of complex systems. We base our offerings on an understanding of clients' business requirements and providing dependable solutions. We combine business knowledge with technology competence and proven methodologies to deliver high quality results in a cost-effective manner to maximize your competitive advantage and productivity. Our Strengths One-stop Software and Internet Solutions Vendor Whether you need an appealing website design or complex multi-tier internet system development or custom programming using latest technologies and industry trends, SystemAid Caribbean Limited has required experience and expertise to do it all. Full-Cycle Development Services At SystemAid Caribbean Limited we support a full-cycle development process from requirements definition and specification, architecture design, coding, testing and validation to product maintenance and support. Depending on your specific requirements our experts will take you step by step through each phase of solution development and provide you with sound advice on technology and application options. Experience and Expertise Having over 12 years of experience in providing internet services and software solutions and having completed several projects in different domains, SystemAid Caribbean Limited has built a large database of knowledge that enables us to deliver the \"right\" solutions that address the needs of our clients. Our Business Philosophy Commitment We at SystemAid Caribbean Limited are committed to delivering maximum value to our clients helping them succeed in a constantly changing and challenging business world. Our fundamental company values stem from understanding that our success is tied with success of our clients. Understand Clients Needs We carefully study each customer particular case to understand the client's needs and objectives and deliver a dependable solution. We make you aware of all available options and provide you with a competent advice enabling you to take an informed business decision. Partner with Clients We are committed to becoming your long-term, trusted partner. Our priority is not only providing professional services and solutions but becoming your IT vendor dedicated to meeting your needs today and support your growing business needs tomorrow. Earn Clients Trust and Confidence Our aim is to earn your trust and confidence through personal attention, passion for what we do and commitment to long-lasting relationship. We will go an extra mile to deliver you a measurable business value and help you adapt and succeed. SystemAid Caribbean Limited comprises a team of IT and Engineering Professionals, who develop, maintain and implement IT Solutions for small and medium sized businesses. SystemAid Caribbean Limited has been established and is providing solutions to companies since the year 2000. Our clients range from various government ministries to private firms in Trinidad & Tobago. With expertise in software development and biometric technologies, SystemAid Caribbean Limited is quickly becoming the premier choice for biometric technologies within the Caribbean. Our aim is to make computerization readily available while providing a flexible and simple to use system. SystemAid Caribbean Limited comprises a team of IT and Engineering Professionals, who develop, maintain and implement various IT Solutions for businesses and organizations primarily in Trinidad and Tobago. Being in the IT business for over 12 years, SystemAid Caribbean Limited has a strong team of skilled and experienced IT experts. Our customers are companies ranging from startups to large enterprises who realize that they need professional internet and software solution services to generate revenue streams, establish communication channels and/or streamline business operations. SystemAid Caribbean Limited delivers comprehensive web services and customized software solutions. These range from custom designs to the development of complex systems. We base our offerings on an understanding of clients' business requirements and providing dependable solutions. We combine business knowledge with technology competence and proven methodologies to deliver high quality results in a cost-effective manner to maximize your competitive advantage and productivity. One-stop Software and Internet Solutions Vendor Whether you need an appealing website design or complex multi-tier internet system development or custom programming using latest technologies and industry trends, SystemAid Caribbean Limited has required experience and expertise to do it all. At SystemAid Caribbean Limited we support a full-cycle development process from requirements definition and specification, architecture design, coding, testing and validation to product maintenance and support. Depending on your specific requirements our experts will take you step by step through each phase of solution development and provide you with sound advice on technology and application options. Having over 12 years of experience in providing internet services and software solutions and having completed several projects in different domains, SystemAid Caribbean Limited has built a large database of knowledge that enables us to deliver the \"right\" solutions that address the needs of our clients. We at SystemAid Caribbean Limited are committed to delivering maximum value to our clients helping them succeed in a constantly changing and challenging business world. Our fundamental company values stem from understanding that our success is tied with success of our clients. We carefully study each customer particular case to understand the client's needs and objectives and deliver a dependable solution. We make you aware of all available options and provide you with a competent advice enabling you to take an informed business decision. We are committed to becoming your long-term, trusted partner. Our priority is not only providing professional services and solutions but becoming your IT vendor dedicated to meeting your needs today and support your growing business needs tomorrow. Earn Clients Trust and Confidence Our aim is to earn your trust and confidence through personal attention, passion for what we do and commitment to long-lasting relationship. We will go an extra mile to deliver you a measurable business value and help you adapt and succeed. Maintenance and Support Fees Maintenance and support covers the following on all services, software and hardware provided by SystemAid Caribbean Ltd: 1) Software maintenance: Bug fixes/updates and upgrades. 2) Technical support: Troubleshooting advice/assistance. 3) Refresher training: Training of new and existing employees. 4) Re-installation: Installing the application on additional PCs and/or locations. 5) Backups: Restore/backup in case of hardware failure or data corruption. Note: client is responsible for their backups. Our standard maintenance and support fee is $450.00 per hour, and may be subject to our current workload/schedule. You can also take advantage of savings, and get priority support 1 by choosing one of our Support Options. Please note that you must pay the 'Total Cost' for the Option you choose. 1 Priority support: Calls for support will be addressed as soon as possible and not be placed on a waiting list or be affected by current workload/schedule. 2 The 'Cost per hour' is for reference only. We have six Support Options as shown in the following table: OPTION 1 $ 2,000.00 5 Support Hours Cost per hour 2 $400 You save $250 Hours do not expire option 2 $ 3,850.00 10 Support Hours Cost per hour 2 $385 You save $650 Hours do not expire option 3 $ 7,500.00 20 Support Hours Cost per hour 2 $375 You save $1500 Hours do not expire Option 4 $ 10,500.00 30 Support Hours Cost per hour 2 $350 You save $3000 Hours do not expire Option 5 $ 13,000.00 40 Support Hours Cost per hour 2 $325 You save $5000 Hours do not expire Option 6 $ 18,000.00 60 Support Hours Cost per hour 2 $300 You save $9000 Hours do not expire Maintenance and Support Fees Maintenance and support covers the following on all services, software and hardware provided by SystemAid Caribbean Ltd: Bug fixes/updates and upgrades. Training of new and existing employees. Installing the application on additional PCs and/or locations. Restore/backup in case of hardware failure or data corruption. Note: client is responsible for their backups. Our standard maintenance and support fee is $450.00 per hour, and may be subject to our current workload/schedule. You can also take advantage of savings, and get priority support 1 by choosing one of our Support Options. Please note that you must pay the 'Total Cost' for the Option you choose. 1 Priority support: Calls for support will be addressed as soon as possible and not be placed on a waiting list or be affected by current workload/schedule. 2 The 'Cost per hour' is for reference only. We have six Support Options as shown in the following table: Cost per hour 2 $400 Hours do not expire Cost per hour 2 $385 Hours do not expire Cost per hour 2 $375 Hours do not expire Cost per hour 2 $350 Hours do not expire Cost per hour 2 $325 Hours do not expire Cost per hour 2 $300 Hours do not expire Contact Us Contact us today for information and pricing of our products and services. SystemAid Caribbean Limited Address: 91 Edinburgh Village, Southern Main Road, Chaguanas Phone: 1 (868) 767 3764 | 1 (868) 464 3811 | 1 (868) 497 4556 Email: customerservice@systemaidtt.com Website: www.systemaidcaribbean.com Contact us today for information and pricing of our products and services. Address: 91 Edinburgh Village, Southern Main Road, Chaguanas Phone: 1 (868) 767 3764 | 1 (868) 464 3811 | 1 (868) 497 4556"
  ]
}