{
  "company": "www.sarwa.co",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "0": 4
    }
  },
  "sample_docs": [
    "Smart investing made easy Make Your Money Work Sarwa is a financial platform and app that lets you easily trade stocks and ETFs, save and invest your money passively all in one place. Top 14 Fintech shaping the 4th revolution Top 20 Forbes Fintech Companies Backed by the Dubai International Financial Center (DIFC) Fintech Fund Backed by Mubadala Investment Company 'Shaking up the future of finance in the region' Innovators of the Future Fastest Growing Fintech Company Trade Invest Crypto Save Buy and sell thousands of U.S. stocks and ETFs with Sarwa Trade. No withdrawal fees and no transfer costs for AED accounts. An awesome deal all across. Your security is our priority Sarwa's regulated Sarwa Digital Wealth (Capital) Limited is regulated by the Financial Service Regulatory Authority in the ADGM. We adhere to high standards of Compliance and regular audits. SSL ENCRYPTION Our website and app are secured with 256-bit encryption to keep your information safe and backed up continuously. 5-Star Support We are here when you need us. You can do everything yourself on our app. But sometimes you still need to talk to someone. That is why we have our outstanding customer excellence team and advisory team ready to help. In the press Forbes | 2023 We're a one-stop shop where all revenue streams get combined, and that's how we make our business economics work. We use technology to lower all the costs for the clients and then generate revenues transparently. The National | 2023 Sarwa has unveiled a cash account with a 3 percent annual interest rate, as banks in the Emirates continue to offer customers low savings yields despite eight consecutive base rate rises by the UAE Central Bank since last year. Arabian Business | 2023 The UAE's Sarwa has launched a new account with a 3 percent interest rate for savers in the UAE. The high-yield account is designed for investors seeking ease of access with a short-term appeal. Zawya | 2022 Sarwa and UAE Pro League announce partnership. This partnership will enable both parties to take active roles in spreading financial and investment education across the teams and the region. Khaleej times | 2021 Sarwa, the fastest-growing investment and personal finance platform in the MENA region with more than 40,000 registered users has closed a $15 million Series B financing round. Bloomberg | 2021 Abu Dhabi's Mubadala Investment Co. led a funding round at Sarwa as the robo advisor eyes further growth amid a global surge in retail trading. Sarwa raised $15 million in the latest round from investors including Kuwait Projects Co. and Shorooq Partners. The financial times | 2018 Among local firms, a robo-advisor called Sarwa this month became the first company to graduate from Dubai's regulatory sandbox, which grants temporary licenses to test innovative products. Go ahead, live your best life It's your does-it-all finance platform to save you both time and money. Passive investing and active trading for stocks, ETFs, crypto - all in one place. What are you waiting for? Give all your money a place to grow. Create a Sarwa account Setup your account and start investing FAQ View our most frequently asked questions Make Your Money Work Buy and sell thousands of U.S. stocks and ETFs with Sarwa Trade. Your security is our priority We are here when you need us. We're a one-stop shop where all revenue streams get combined, and that's how we make our business economics work. We use technology to lower all the costs for the clients and then generate revenues transparently. Sarwa has unveiled a cash account with a 3 percent annual interest rate, as banks in the Emirates continue to offer customers low savings yields despite eight consecutive base rate rises by the UAE Central Bank since last year. The UAE's Sarwa has launched a new account with a 3 percent interest rate for savers in the UAE. The high-yield account is designed for investors seeking ease of access with a short-term appeal. Sarwa and UAE Pro League announce partnership. This partnership will enable both parties to take active roles in spreading financial and investment education across the teams and the region. Sarwa, the fastest-growing investment and personal finance platform in the MENA region with more than 40,000 registered users has closed a $15 million Series B financing round. Abu Dhabi's Mubadala Investment Co. led a funding round at Sarwa as the robo advisor eyes further growth amid a global surge in retail trading. Sarwa raised $15 million in the latest round from investors including Kuwait Projects Co. and Shorooq Partners. Among local firms, a robo-advisor called Sarwa this month became the first company to graduate from Dubai's regulatory sandbox, which grants temporary licenses to test innovative products. Go ahead, live your best life Give all your money a place to grow.",
    "Smart investing made easy Auto-invest in the life you want Get a globally diversified portfolio that is expertly built. Sarwa Invest takes the hurdles out of investing, while helping you maximise returns at a risk you're comfortable with. Top 14 Fintech shaping the 4th revolution Top 20 Forbes Fintech Companies Backed by the Dubai International Financial Center (DIFC) Fintech Fund Backed by Mubadala Investment Company 'Shaking up the future of finance in the region' Innovators of the Future Fastest Growing Fintech Company Set it and forget it Put your money to work for you with zero efforts. It's all taken care of: dividends re-investing, rebalancing, and you can even set up auto-deposits. Tailored portfolios for you We will ask you a few questions to get to know you and your risk profile. You will get a portfolio of globally diversified, low-cost index funds covering different assets. You can set-it and forget-it You work hard for your money. We will make sure it works hard for you with smart rebalancing and dividends reinvesting. Get started in minutes Open your Sarwa account from the comfort of your home and start putting your money to work. No need to leave that couch! Talk to an Advisor Our advisors can tell you all about our time-tested investment strategy, and can help you plan to reach your financial goals. Personalize your portfolio Choose a portfolio that works for you: from our conventional portfolios, our socially responsible investment portfolios, our Halal portfolios, or our Bitcoin ones, it's a matter of what speaks to you. Conventional $500 minimum balance Conventional portfolios are made up of Globally diversified Vanguard and Blackrock ETFs that cover all industries, sizes and geographies. Socially Responsible $2,500 minimum balance SRI portfolios consist of ETFs that invest in companies that meet SRI criteria such as environmentally sustainable practices, fair labor standards, and others. Crypto $2,500 minimum balance Crypto portfolios follow our conventional or socially responsible investing strategies including an additional allocation to Bitcoin of 5%. Halal $500 minimum balance Halal portfolios are made up of Sukuk, Gold ETC, and ETFs that follow Islamic laws and principles of investing, such as not profiting from alcohol, gambling, and others. Conventional $500 minimum balance Conventional portfolios are made up of Globally diversified Vanguard and Blackrock ETFs that cover all industries, sizes and geographies. Socially Responsible $2,500 minimum balance SRI portfolios consist of ETFs that invest in companies that meet SRI criteria such as environmentally sustainable practices, fair labor standards, and others. Crypto $2,500 minimum balance Crypto portfolios follow our conventional or socially responsible investing strategies including an additional allocation to Bitcoin of 5%. Halal $500 minimum balance Halal portfolios are made up of Sukuk, Gold ETC, and ETFs that follow Islamic laws and principles of investing, such as not profiting from alcohol, gambling, and others. See what your money can do Here's an estimated projection to show the impact of lower fees and compound interest. Initial deposit $30,500 Monthly Amount $5,000 Risk Level Growth Learn & explore Dive into the different portfolios and see how your money can help you retire. Portfolio Allocations Historical Performance Retirement calculator Global diversification, optimal returns Diversifying your investment means you can minimize risk while maximizing rewards. We invest your money across stocks markets, and across assets using Exchange Traded Funds (ETFs). Conventional Halal Socially Responsible Conventional Crypto Socially Responsible Crypto Lower risk More risk 0 1 2 3 4 5 6 Pricing Standard $500 minimum balance 0.85% Personalized financial advice Low-cost, globally diversified portfolios Smart rebalancing Dividend reinvesting Free financial education Expert financial advice Multi and Joint accounts Access to other Sarwa products and offerings A minimum of $7 will be charged every calendar month. The minimum fee won't be applied for the first 3 calendar months of using Sarwa Invest product. Premium $50,000 minimum balance 0.70% Financial planning Lower advisory fees Personalized financial advice Low-cost, globally diversified portfolios Smart rebalancing Dividend reinvesting Free financial education Expert financial advice Multi and Joint accounts Access to other Sarwa products and offerings Platinum $100,000 minimum balance 0.50% Financial planning Lower advisory fees Personalized financial advice Low-cost, globally diversified portfolios Smart rebalancing Dividend reinvesting Free financial education Expert financial advice Multi and Joint accounts Access to other Sarwa products and offerings Your security is our priority Sarwa's regulated Sarwa Digital Wealth (Capital) Limited is regulated by the Financial Service Regulatory Authority in the ADGM. Sarwa Digital Wealth Limited is regulated by the Dubai Financial Services Authority in the DIFC. We adhere to high standards of Compliance and regular audits. SSL ENCRYPTION Our website and app are secured with 256-bit encryption to keep your information safe and backed up continuously. Frequently Asked Questions Get all your questions answered, so you can effortlessly invest with big rewards sooner. What is Sarwa? How much do I need to invest? What are the costs to invest? What investments does Sarwa offer? Can I move my money out if I want to? What are you waiting for? Your first step towards smart investing starts here. Create a Sarwa account Setup your account and start investing FAQ View our most frequently asked questions Auto-invest in the life you want Set it and forget it Tailored portfolios for you You can set-it and forget-it Get started in minutes Talk to an Advisor Conventional portfolios are made up of Globally diversified Vanguard and Blackrock ETFs that cover all industries, sizes and geographies. SRI portfolios consist of ETFs that invest in companies that meet SRI criteria such as environmentally sustainable practices, fair labor standards, and others. Crypto portfolios follow our conventional or socially responsible investing strategies including an additional allocation to Bitcoin of 5%. Halal portfolios are made up of Sukuk, Gold ETC, and ETFs that follow Islamic laws and principles of investing, such as not profiting from alcohol, gambling, and others. Conventional portfolios are made up of Globally diversified Vanguard and Blackrock ETFs that cover all industries, sizes and geographies. SRI portfolios consist of ETFs that invest in companies that meet SRI criteria such as environmentally sustainable practices, fair labor standards, and others. Crypto portfolios follow our conventional or socially responsible investing strategies including an additional allocation to Bitcoin of 5%. Halal portfolios are made up of Sukuk, Gold ETC, and ETFs that follow Islamic laws and principles of investing, such as not profiting from alcohol, gambling, and others. See what your money can do Global diversification, optimal returns Your security is our priority Your first step towards smart investing starts here.",
    "Smart investing made easy Trading crypto is as easy as 1-2-3 It's the easy and convenient way to buy and sell crypto. With no transfer fees or commissions, you can get started with as little as $1. Top 14 Fintech shaping the 4th revolution Top 20 Forbes Fintech Companies Backed by the Dubai International Financial Center (DIFC) Fintech Fund Backed by Mubadala Investment Company 'Shaking up the future of finance in the region' Innovators of the Future Fastest Growing Fintech Company Crypto & stocks, all in the same place All your investment needs together in 1 simple app. We make it easy to start investing and keep track of all your wealth. 24/7 live access to top cryptos Trade the most popular cryptos at any time and track their returns, average price and other performance metrics. Instant deposits Want to trade as soon as you make the decision? Fund your account and get instant access to trade. On local transfers Deposit and withdraw your funds at zero cost with free AED transfers and buy Crypto without paying any commisions. Trade the way you want Buy using market orders at the best available price or set up limit or stop orders to make sure your trades get executed when you want. Pricing Crypto No surprises and great value Trade top crypto currencies with zero commission Low spreads of 0.75% Transfer with zero cost from a local UAE account Buy in bulk or in fractions Start with $5 only Access to top cryptos Market, Stop and Limit orders View real time crypto prices Your security is our priority Sarwa's regulated Sarwa Digital Wealth (Capital) Limited is regulated by the ADGM Financial Service Regulatory Authority. We adhere to high standards of compliance & regular audits. SSL ENCRYPTION Our website and app are secured with 256-bit encryption to keep your information safe and backed up continuously. Strong technology, but human first We engineer our technology to be powerful, but we are also always available to help you with all of your needs with our outstanding customer excellence team. Frequently Asked Questions Get all your questions answered, so you can effortlessly invest with big rewards sooner. What are the available cryptocurrencies? Can I deposit or withdraw cryptocurrencies to/from my account? Do I need a crypto wallet to trade cryptocurrencies with Sarwa? How can I trade crypto? How do I withdraw my crypto? Is crypto risky? What are you waiting for? Your first step towards smart investing starts here. Create a Sarwa account Setup your account and start investing FAQ View our most frequently asked questions Trading crypto is as easy as 1-2-3 Crypto & stocks, all in the same place 24/7 live access to top cryptos Trade the way you want Your security is our priority Strong technology, but human first Your first step towards smart investing starts here.",
    "Smart investing made easy Earn 3% on your cash Park your savings in Sarwa Save for any amount of time you want and get a rate that takes on most rates. Top 14 Fintech shaping the 4th revolution Top 20 Forbes Fintech Companies Backed by the Dubai International Financial Center (DIFC) Fintech Fund Backed by Mubadala Investment Company 'Shaking up the future of finance in the region' Innovators of the Future Fastest Growing Fintech Company Put your cash to work Just like your investment account, your cash can work for you too. Feel what it is like to optimize it and take control over your finances. Let it help you reach those goals. No minimum balance required Get access to this product with any amount you want to start with, whether it's $500 or $500,000. No lock-ups on your money You can withdraw your funds at any time, with zero cost. Unlike some others, there are no sneaky fees. Put your cash to work Cash Interest Rate 3% Risk It's a cash account Underlying assets Cash Management Fee Free Halal Estimated Return 3% Risk Very low Underlying assets Emirates Islamic Money Market Fund Management Fee 0.5% Your security is our priority Sarwa's regulated Sarwa Digital Wealth (Capital) Limited is regulated by the ADGM Financial Service Regulatory Authority. We adhere to high standards of compliance & regular audits. SSL ENCRYPTION Our website and app are secured with 256-bit encryption to keep your information safe and backed up continuously. Saving Corner 12 Hacks for How to Save Money in Dubai Like A Resident If you're an expat trying to figure out how to save money in Dubai, here's what money-saving experts recommend you do with your extra cash. Saving vs Investing: How Much Should You Allocate to Each? Saving and investing both have a place in financial planning. One is for preserving money for emergencies and short-term goals, and the other is for building wealth. How to Become Rich, Slowly: 5 Ways to Save and Build Wealth Building wealth and becoming rich requires a slow and steady process of financial education, financial planning, consistent saving, debt avoidance, and wise investing. Frequently Asked Questions Get all your questions answered, so you can effortlessly invest with big rewards sooner. How is Sarwa Save different from a bank savings account? How guaranteed is the interest or returns of Sarwa Save? Who regulates Sarwa Save? How are you able to generate this return? Does the rate differ depending on how much money I put in? Does Sarwa Save have a Sharia compliant Halal option? Is the return rate locked in or can it change? What are you waiting for? Your first step towards smart investing starts here. Create a Sarwa account Setup your account and start investing FAQ View our most frequently asked questions Earn 3% on your cash Put your cash to work No minimum balance required No lock-ups on your money Put your cash to work Your security is our priority If you're an expat trying to figure out how to save money in Dubai, here's what money-saving experts recommend you do with your extra cash. Saving and investing both have a place in financial planning. One is for preserving money for emergencies and short-term goals, and the other is for building wealth. Building wealth and becoming rich requires a slow and steady process of financial education, financial planning, consistent saving, debt avoidance, and wise investing. Your first step towards smart investing starts here."
  ]
}