{
  "company": "www.ximilar.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5151515151515151,
    "framing_surveillance": 0.0,
    "framing_market": 0.4848484848484848,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2
    }
  },
  "sample_docs": [
    "The Ximilar data-management engine is partly based on technology studied within the MUFIN project. On the software level, Ximilar utilizes open source codes shared under the GPL license. This technology approach assumes a very universal concept of similarity that is based on the mathematical notion of metric space . In this model, the data collection is seen as objects together with a method to measure similarity between pairs of objects. This concept of searching has been described, for instance, in book Similarity Search: The Metric Space Approach . The technology follows these principles: Extensibility - the appraoch can be used on a wide variety of data types and forms of similarity including various aspects of image visual similarity (shapes, colors, textures), video sequences, face recognition, biometric data, music, various scientific data like time series, etc. Scalability - efficient even for very large data collections (billions of objects). Ximilar offers various database structures including distributed mechanisms, so that a suitable architecture can be chosen for specific data volumes. Infrastructure independence - the database technology is inherently very flexible and can be deployed on various centralized or distributed HW infrastructures. In this way, the overall performance can be tuned to requirements of the specific application.",
    "We get this question occasionally from users of other Visual analysis tools and the simple answer could be Yes, it's better . Obviously, nothing is as simple as black and white, so let us compare services from Goliaths like Google, IBM, Amazon and Microsoft with our David -like solution from Ximilar. To say it simply, artificial intelligence vision got to a point, where it is easy not only to recognise objects in a photo, but also detect features of each thing. That creates a new universe of opportunities for real world application in e-commerce & traditional industries alike. And Ximilar is a tool that digs deep into some pretty narrow use cases . So while the big solutions might be great in many ways, Ximilar might very well be the agile alternative. Ximilar is Not a Big Corporation And that is a good thing. Because we keep things simple, streamlined and we have time to listen to each customer's needs. We also have the ability to implement new custom features in a timely manner. And we do it as fast as we can, widely benefiting both customers and us, freeing our manpower from manual work. We at Ximilar create, and continuously improve, advanced visual search & image recognition services for businesses around the World. That happens in three areas — self-served recognition app , ready-made services and in many cases the most challenging custom solutions . We are also not an enterprise that requires to have millions of users of its services to just stay afloat. See for example how many services were killed by Google . No. Rather than growth in quantity, our centre of the universe is how precise we get, how reliable & sustainable results we deliver. And how we can grow strong together with our customers, or we should rather say our partners. Here is why Ximilar could be a solid alternative for you, if you need to iterate quick and reach reliable results in narrow fields. Or if you simply need someone who takes your idea further and finds an AI solution to deliver value to your business. 1 — We are focused We craft our features to perfection and we test & use them ourselves. We continuously improve our application for everybody to benefit from new findings in AI vision industry. And we also do things that customers ask for, we don't just sell access to a platform. 2 — We are independent These days, many companies are created to be acquired. They are created to grow no matter the sustainability of such growth. We are different. Our customers like that we would not disappear tomorrow — getting acquired by a giant and then dissolved into some unreachable feature of some huge app suite is not our target. 3 — We innovate faster We don't have a large team and therefore decisions are quick. We are a team of remote professionals working in a field that we truly love and would like to explore to the edge of possibilities. It's a lot of fun to work on our customers' challenging tasks. And we are happy to customise any feature. The customers budget is the only limit. Head to Head Comparison Focus Models On Premise Request Price per 1,000 images Free plan per month Visual Search Expert assistance Ximilar Image Recognition, Visual & Similarity Search, Fashion Fashion, Generic, Custom (classification, tagging, detection) Optional $0.95 5,000 requests, free model trainings Yes Yes Microsoft Image Recognition Generic, Custom (classification, tagging) No $1.5 5,000 requests, 1 hour of training No No Amazon Image & Video Recognition Generic, Face, Sensitive Content, Text, Celebrity No $1 5,000 requests Face only No Google Image Recognition Generic, Faces, Text, Logos, Landmarks No $1.5 1,000 requests No No IBM Watson Image Recognition Generic, Faces, Food, Explicit, Custom (classification, tagging) No $2 1,000 predictions, 2 trainings of models No No Clarifai Image & Video Recognition, Similarity Search Generic, Faces, Nudity, (Fashion) Custom (classification, tagging) Optional $1.2 – 3.2 5,000 operations Yes No Narrow Field vs Generic This one is really personal. You would see a lot of simple AI applications like detect a cat and a dog in a given — well lit & well shot — picture. But in reality, the bread and butter of applied visual AI is narrow field recognition and analysis of large volume of images where the customer needs pretty high accuracy on a pretty specific subject. For example detect a type of a screw on a blurry cellphone photo, shot in bad lighting conditions. Unlike the giants who mostly sell you ready-made solution that you can hardly bend to meet your needs, Ximilar is in the other end of the spectrum, brainstorming with customers about how to solve the use case that they have. Being their partner in the path to success. Examples of such narrow use-cases are Detecting coffee grounds in a cup – for a customer who receives millions of images to their mobile app used to foretell the future for its users. You wouldn't believe how many users in coffee drinking countries use such an app. How full is the freight container? – This one could cost a company quite some money, while the task itself could be solved simply with a camera and Ximilar AI. Results from the detection can pretty accurately tell the customer how much coal there is and also what type of coal there is. Isn't that neat? Give me a screw/nail type from a photo – This one was a challenge, but a simple trick helped us to deliver exactly that. We were able to detect the type of material, size, and construction details of the product. So a home improvement store could then guide a customer to a proper store section, without any attendant help needed. What is the state of our skyscrapers? – We had this idea from a customer, that is routinely photographing their real-estate inventory and as that inventory was not a few homes, but rather a few large buildings, they gathered thousands of photos per building and needed to analyse if the building is in a good shape or not. Give me a quality rating of a photo – this one was brought up by a hotel reservation site. They need to detect the best photos of a property, while the photos are often delivered by a re-seller, or a hotel owner and might not be well shot. And we all know, that good photos sell better. Ximilar can help even there. Lower Price for Higher Accuracy While examples above might be fun to read, let's get to real facts, hardcore numbers and an actual user feedback. Because that is a requirement for any business to base its thoughts on. Here are some real-life examples of our customer experiences. Ximilar Recognition has higher accuracy than Microsoft Custom Vision and IBM Watson, which was reported by at least several of our customers, users of Ximilar App. Ximilar allows users to control various parameters of training from a simple GUI UX of Ximilar App is extremely easy to use , also reported by our customers, saying: \"Ximilar has shallow learning curve in comparison to others\" Easy to use API focused on Image Recognition Ximilar has advanced features for tuning of your recognition tasks which no other services provide — flips, rotations, etc. Ximilar Product Similarity is unique service for finding visually similar alternatives in fashion collections Ximilar is much more flexible as we are willing to improve our service for your needs — e.g. add more tags to our models — according to your individual requirements and keep it attached to your data exclusively We are cheaper — Google AutoML Vision is $3 per 1,000 images vs. Ximilar is $0.95 per 1,000 images, and less with higher volumes Ximilar Fashion Tagging is on the top of abilities in fashion objects recognition Elaborate management of tags & categories for more projects of higher complexity — we are the only system we know of, that enables users to share training data between categorisation and tagging tasks Ximilar, unlike the big competition, is able to install the system on-premise, giving you better control over the system This is just a brief summary of what we see as benefits for you if you use Ximilar as your partner for pioneering the AI world. We see it now as really just the beginning of all the possibilities that might come in the future of automation and machine learning abilities. We have been around for many years now and Ximilar would surely be around for the years to come. Backing you on the way. Enjoying the exploration. We get this question occasionally from users of other Visual analysis tools and the simple answer could be Yes, it's better . Obviously, nothing is as simple as black and white, so let us compare services from Goliaths like Google, IBM, Amazon and Microsoft with our David -like solution from Ximilar. To say it simply, artificial intelligence vision got to a point, where it is easy not only to recognise objects in a photo, but also detect features of each thing. That creates a new universe of opportunities for real world application in e-commerce & traditional industries alike. And Ximilar is a tool that digs deep into some pretty narrow use cases . So while the big solutions might be great in many ways, Ximilar might very well be the agile alternative. Ximilar is Not a Big Corporation And that is a good thing. Because we keep things simple, streamlined and we have time to listen to each customer's needs. We also have the ability to implement new custom features in a timely manner. And we do it as fast as we can, widely benefiting both customers and us, freeing our manpower from manual work. We at Ximilar create, and continuously improve, advanced visual search & image recognition services for businesses around the World. That happens in three areas — self-served recognition app , ready-made services and in many cases the most challenging custom solutions . We are also not an enterprise that requires to have millions of users of its services to just stay afloat. See for example how many services were killed by Google . No. Rather than growth in quantity, our centre of the universe is how precise we get, how reliable & sustainable results we deliver. And how we can grow strong together with our customers, or we should rather say our partners. Here is why Ximilar could be a solid alternative for you, if you need to iterate quick and reach reliable results in narrow fields. Or if you simply need someone who takes your idea further and finds an AI solution to deliver value to your business. 1 — We are focused We craft our features to perfection and we test & use them ourselves. We continuously improve our application for everybody to benefit from new findings in AI vision industry. And we also do things that customers ask for, we don't just sell access to a platform. 2 — We are independent These days, many companies are created to be acquired. They are created to grow no matter the sustainability of such growth. We are different. Our customers like that we would not disappear tomorrow — getting acquired by a giant and then dissolved into some unreachable feature of some huge app suite is not our target. 3 — We innovate faster We don't have a large team and therefore decisions are quick. We are a team of remote professionals working in a field that we truly love and would like to explore to the edge of possibilities. It's a lot of fun to work on our customers' challenging tasks. And we are happy to customise any feature. The customers budget is the only limit. Head to Head Comparison Narrow Field vs Generic This one is really personal. You would see a lot of simple AI applications like detect a cat and a dog in a given — well lit & well shot — picture. But in reality, the bread and butter of applied visual AI is narrow field recognition and analysis of large volume of images where the customer needs pretty high accuracy on a pretty specific subject. For example detect a type of a screw on a blurry cellphone photo, shot in bad lighting conditions. Unlike the giants who mostly sell you ready-made solution that you can hardly bend to meet your needs, Ximilar is in the other end of the spectrum, brainstorming with customers about how to solve the use case that they have. Being their partner in the path to success. Examples of such narrow use-cases are Detecting coffee grounds in a cup – for a customer who receives millions of images to their mobile app used to foretell the future for its users. You wouldn't believe how many users in coffee drinking countries use such an app. How full is the freight container? – This one could cost a company quite some money, while the task itself could be solved simply with a camera and Ximilar AI. Results from the detection can pretty accurately tell the customer how much coal there is and also what type of coal there is. Isn't that neat? Give me a screw/nail type from a photo – This one was a challenge, but a simple trick helped us to deliver exactly that. We were able to detect the type of material, size, and construction details of the product. So a home improvement store could then guide a customer to a proper store section, without any attendant help needed. What is the state of our skyscrapers? – We had this idea from a customer, that is routinely photographing their real-estate inventory and as that inventory was not a few homes, but rather a few large buildings, they gathered thousands of photos per building and needed to analyse if the building is in a good shape or not. Give me a quality rating of a photo – this one was brought up by a hotel reservation site. They need to detect the best photos of a property, while the photos are often delivered by a re-seller, or a hotel owner and might not be well shot. And we all know, that good photos sell better. Ximilar can help even there. Lower Price for Higher Accuracy While examples above might be fun to read, let's get to real facts, hardcore numbers and an actual user feedback. Because that is a requirement for any business to base its thoughts on. Here are some real-life examples of our customer experiences. Ximilar Recognition has higher accuracy than Microsoft Custom Vision and IBM Watson, which was reported by at least several of our customers, users of Ximilar App. Ximilar allows users to control various parameters of training from a simple GUI UX of Ximilar App is extremely easy to use , also reported by our customers, saying: \"Ximilar has shallow learning curve in comparison to others\" Easy to use API focused on Image Recognition Ximilar has advanced features for tuning of your recognition tasks which no other services provide — flips, rotations, etc. Ximilar Product Similarity is unique service for finding visually similar alternatives in fashion collections Ximilar is much more flexible as we are willing to improve our service for your needs — e.g. add more tags to our models — according to your individual requirements and keep it attached to your data exclusively We are cheaper — Google AutoML Vision is $3 per 1,000 images vs. Ximilar is $0.95 per 1,000 images, and less with higher volumes Ximilar Fashion Tagging is on the top of abilities in fashion objects recognition Elaborate management of tags & categories for more projects of higher complexity — we are the only system we know of, that enables users to share training data between categorisation and tagging tasks Ximilar, unlike the big competition, is able to install the system on-premise, giving you better control over the system This is just a brief summary of what we see as benefits for you if you use Ximilar as your partner for pioneering the AI world. We see it now as really just the beginning of all the possibilities that might come in the future of automation and machine learning abilities. We have been around for many years now and Ximilar would surely be around for the years to come. Backing you on the way. Enjoying the exploration. Introducing Tags, Categories & Image Management Read more March 2019 Major Updates for a Headstart in 2019 Read more January 2019 Vize.ai — New Insights to Help you Understand your Visual Content Read more August 2018 Introducing Tags, Categories & Image Management Major Updates for a Headstart in 2019 Vize.ai — New Insights to Help you Understand your Visual Content",
    "Recognize, Search & Enhance Images With AI From ready-made to custom image recognition & visual search solutions under one API. Get Custom AI Tailored to Your Images Level up your image processing with custom solutions, combining existing & new features. Build Computer Vision Models Without Coding Create your own machine learning models and implement them easily into your website or app. Try for free Ready-to-use Visual AI Custom AI Solutions Computer Vision Platform Ready-to-use Visual AI demos Test Our Visual AI Choose from off-the-shelf solutions for fashion, home decor, stock photos, collectibles, and more. Fashion & Home Design Stock Photos & Image Tools Collectibles Fashion Taging Product Similarity Search Fashion by Photo Home Decor Tagging Photo Tagging Stock Photo Search Background Removal Dominant Colors AI Recognition of Collectibles Card Grader Click to Load Demo FROM PATTERN RECOGNITION TO IMAGE SIMILARITY Get Custom AI Tailored to Your Visual Data Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. How it works? Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. MACHINE LEARNING FOR EVERYONE No-Code Computer Vision Platform Use Ximilar App to test, build & deploy your own visual artificial intelligence. Manage your collections in App & connect via API. Start for free now See all features Test to App for free, upload your images & try how it works for free Build No-code AI Label data & create computer vision models without coding Annotate Images Efficient & quick bulk annotation of images in a team Combine Combine ready-to-use and custom AI models into a modular Flow Connect Connect via REST API for setup, integration or both API Documentation Test to App for free, upload your images & try how it works for free Build No-code AI Label data & create computer vision models without coding Annotate Images Efficient & quick bulk annotation of images in a team Combine Combine ready-to-use and custom AI models into a modular Flow Connect Connect via REST API for setup, integration or both API Documentation image annotation optical character recognition (OCR) image classification image based search ML model testing image upscaling sports cards identification deep learning object detection language models (LLMs) integration facial detection advanced image search TCG card identification sports cards grading image labelling photo enhancing neural networks data labelling image segmentation NUMBER 1 NO-CODE AI VISION PLATFORM All-in-one Suite for Visual Data With Ximilar, you can automate & streamline all image processing with one API. All on one platform and without coding. How it works? TIME-EFFICIENT Save work & time Deploy the pre-trained tools on click, or add custom labels and features. Browse solutions MONTHLY SUBSCRIPTION Choose ideal plan With credit supply optimised to your traffic and needs. See Pricing EASY ACCESS Connect via API And implement it into your application, website or infrastructure. MODULAR STRUCTURE Upgrade on the go Combine and put pre-trained and custom models in complex sequences. Read more Workflow examples From quality control, security systems and video analysis, to pattern recognizing or medical diagnosis systems. See the typical image AI applications built with our platform. Sports & Trading Cards Identification Collectibles Recognition Sports Card Identifier Sports Card Grader or TCG Card Identifier TCG Card Grader Price Search Spot, analyze and grade collectible sports cards and trading card games (TCGs) automatically. Fashion Detection, Tagging & Description Fashion Apparel Detection Fashion Tagging Auto Description Identify all fashion including footwear and jewelry with specialized clothing AI. Generate product titles and descriptions. Stock Photo Tagging & Similarity Search Image Recognition Photo Tagging Dominant Colors or Image Similarity Search Search Images By Color Accurately identify photos, people, faces & objects. Provide similar visual content within your collection to your visitors. Real Estate Classifier Outdoor/Indoor Classifier Room Classifier Furniture Detection Home Decor Tagging Home Decor Search Automate the processing of photos of real estate, rooms, interior design, homeware, and pieces of furniture. HUMAN EXPERTISE, AI CONSISTENCY Get Your AI Solution From Industry Experts We aim to make artificial intelligence accessible to businesses of all sizes by building a reliable, cost-effective no-code platform. About us 15 Billion Images recognized and counting +380 % Increased click rate on products 40+ Countries of origin of our clients 10+ Years Hands-on experience in AI systems Nessi Image Annotation Expert David Founder, Computer Vision Expert Gabriela Fashion Stylist, Customer Care Michal CEO, Machine Learning Engineer 15 Billion Images recognized and counting +380 % Increased click rate on products 40+ Countries of origin of our clients 10+ Years Hands-on experience in AI systems USE AI WITH CONFIDENCE Transparency & Security Come First Use secure AI software with maximal data privacy. We store only training data on our own servers in the EU, with all data protected under GDPR. Your models & data belong to you You hold the intellectual rights to all the models you train on our platform. Read more Processed images are not stored Our software analyses each picture in your database once, without storing any of them. Read more Certified hardware infrastructure Based on academic research Dr. Reza Farshey CEO, Endogenie We used Ximilar's platform to build a model analyzing X-ray medical images. Even though the models are built on their platform, the data belong to our company. Support from Ximilar has been amazing, with a response time less than 24 hours. Overall, I am extremely happy with the service and product offerings from Ximilar. Dr. Reza Farshey Founder & CEO Damo Bowland CEO, TCG Sync Ximilar has been a fantastic partner for our card recognition needs. The backend system is highly reliable, and in the time we've been with Ximilar, we haven't encountered a single issue. The team is incredibly responsive, always quick to address any queries we've had, and they consistently go above and beyond to ensure we fully understand and utilize their services. Their commitment to support and seamless performance earns them a well-deserved 5 stars. Highly recommended! Damo Bowland CEO Zajzon Bodó CEO, Babyndex Babyndex uses Ximilar's Image Recognition and Annotate, which is excellent. I can easily set up their services myself. Ximilar has helped in improving accuracy and from that day on, it works perfectly. Zajzon Bodó Co-founder & CEO, Babyndex Filiberto Sosa CEO, Sizes and Colors We integrate Ximilar's visual AI into our online product discovery tool. With Ximilar's visual search, we can tailor recommendations of newly arrived products to customers who are likely to be interested. Our system automatically notifies them, enhancing the overall customer experience. Our experience with Ximilar has been great. Filiberto Sosa CEO Amos Struck Co-founder, StockPhotos Way better similar results in our 10 million stock images. Customers can find visually similar pictures by uploading a photo. The integration was fast. We recommend it! Amos Struck Co-founder Pavel Macků CEO, Profimedia The Ximilar technology has been working reliably for many years on our collection of 100M+ creative photos. Pavel Macků CEO Previous Next CONNECT VIA REST API Deploy, Connect & Conquer Deploy latest models on click, connect via REST API, and integrate them into your system or infrastructure. Go to API Documentation Technology Stack REST API status monitoring Python Client Python PHP cURL # pip install ximilar-client import base64 from ximilar.client import FashionTaggingClient with open(__IMAGE_PATH__, \"rb\") as image_file: encoded_string = base64.b64encode(image_file.read()).decode('utf -8') client = FashionTaggingClient(\"__API_TOKEN__\") response = client.detect_tags([{'_base64': encoded_string}]) import requests, json, base64 endpoint = 'https://api.ximilar.com/tagging/ fashion/v2/detect_tags' headers = { 'Authorization': \"Token __API_TOKEN__\", 'Content-Type': 'application/json' } with open(__IMAGE_PATH__, \"rb\") as image_file: encoded_string = base64.b64encode(image_file.read()).decode('utf -8') data = { 'records': [{'_base64': encoded_string}] } response = requests.post(endpoint, headers=headers, data=json.dumps(data)).json() $curl_handle = curl_init(\"https:// api.ximilar.com/tagging/fashion/v2/ detect_tags\"); $data = ['records' => [ [ '_url' => '__PATH_TO_URL_IMAGE__' ], [ '_base64' => base64_encode(file_get_contents(__PATH_TO_IMAGE __)) ] ] ]; curl_setopt($curl_handle, CURLOPT_CUSTOMREQUEST, \"POST\"); curl_setopt($curl_handle, CURLOPT_POSTFIELDS, json_encode($data)); curl_setopt($curl_handle, CURLOPT_RETURNTRANSFER, true); curl_setopt($curl_handle, CURLOPT_FAILONERROR, true); curl_setopt($curl_handle, CURLOPT_HTTPHEADER, array( \"Content-Type: application/json\", \"Authorization: Token __API_TOKEN__\", \"cache- control: no-cache\",) ); $response = curl_exec($curl_handle); $error_msg = curl_error($curl_handle); curl_close ($curl_handle); curl --request POST \\ --url https://api.ximilar.com/tagging/ fashion/v2/detect_tags \\ --header 'Content-Type: application/json' \\ --header 'authorization: Token __API_TOKEN__' \\ --data '{\"records\":[{\"_url\": \"https:// bit.ly/2IymQJv\"}]}' Frequently Asked Questions How image recognition works? Image recognition allows computers to understand and classify images by analyzing their content. It helps with interpreting, tagging (enrichment with additional metadata), or categorization (sorting into groups) of images. For example, if you train a dog vs. cat recognition model, and provide it with a folder of mixed pictures, it will be able to distinguish between cats and dogs, and thus sort the images into two separate folders. It is used in various applications including medical diagnosis, autonomous vehicle systems (object recognition) or security systems (like facial recognition). The accuracy, speed, and efficiency of such systems continue to improve with advancements in artificial intelligence and machine learning techniques and depend on factors such as the quality of training datasets. Deep learning algorithms, particularly convolutional neural networks (CNNs), are commonly used for image categorization tasks. Ximilar provides several off-the-shelf solutions for classifying specific image data, such as stock photos, home decor and furniture images, fashion photos, or trading and collectible cards. Custom models can be easily trained on our platform . Read the articles in our blog to learn about image recognition technology. Go to: Discover ready-to-use solutions Discover computer vision platform : Which services does Ximilar provide, and what are the differences between them? How Ximilar technology works? What is custom image recognition? What is Visual Search? Visual & similarity search technology can analyze the overall visual aesthetic of an image or detected object in an image, independent of the origin of images or metadata (such as keywords). It understands the concept of similarity according to your subjective perception. That is why it can provide the most relevant results to image queries, whether you look for the exact match or similar items. Go to: Explore Visual Search Solutions Explore public demos Articles about visual search API Documentation : What are the examples of visual & similarity search solutions built by Ximilar? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Which collectibles can AI Recognition of Collectibles recognize? As for now, the service is able to detect (and mark by bounding boxes) the collectibles such as stamps, coins, banknotes, comic books and trading cards , as well as antique items . For collectible cards, the service can identify whether it is a Trading Card Game (Pokémon, Magic The Gathering – MTG, Yu-Gi-Oh!, Lorcana, Flesh and Blood and so on) or a Sports Card (Baseball, Basketball, Hockey, Football, Soccer, or MMA), with several additional features (e.g., signature). It can be easily customized to evaluate images based on your criteria. The full taxonomy of the identification results with all supported games and sports can be found in our documentation page . For comic books, the service can identify more than 1 million magazines, books and manga – via name, title, publisher, issue number and release date. The service is constantly expanding based on the requests from our customers. Go to: AI Recognition of Collectibles – Page AI Recognition of Collectibles – Public Demo How Image Recognition works? Collectibles Recognition API – Documentation : Can your AI identify or find the exact collectible based on a photo? How does the automatic visual inspection of collectibles work? How Ximilar streamlines image processing tasks and reduces costs? Ximilar's systems significantly reduce image processing costs by automating repetitive tasks such as analyzing, tagging and sorting of images. This automation results in significant long-term savings, allowing for continuous 24/7 addition of new visual content without additional metadata. We're continually enhancing our platform, which enables us to both build services efficiently and quickly and also to modify existing solutions to suit your needs. We reduce costs and labour by utilizing a combination of pre-trained and new models. Service use is billed via API credits, with a customizable monthly plan based on your consumption . Using our credit calculator helps you optimize cost-effectiveness. For sudden system loads, you can add extra credit packs to your monthly credit supply. Once your solution is live, we can continually upgrade and enhance it, altering any component in the modular structure. Our feedback mechanisms help us understand which model performs best, allowing us to refine the solution. Also, our ready-to-use solutions are routinely updated to stay industry-relevant, and these upgrades come at no extra cost . Go to: See Pricing Count my monthly consumption How custom projects work? : How much does it cost to use Ximilar's solutions and platform? Which payment methods does Ximilar accept and how does the billing work? Is training, deployment and using of my Image Recognition tasks charged? What are the typical Visual Search applications? Visual search typically involves searching images or products using an image query, including photos from social media and user-generated content, like smartphone photos. Our Search by Photo combines this technology with detecting individual products in images. One such solution is Search Fashion by Photo . The technology is frequently employed for similarity searches , particularly for product recommendations in e-commerce. It assesses image or detected object features, like colour, edges, or patterns, to suggest the most similar alternatives. Another typical use is image & product matching . Since the technology can identify duplicates or nearly identical items in various images with different quality, it can help with curating product galleries and eliminating all unnecessary content. Even though applications in e-commerce are the most common, visual search provides endless possibilities even in the industrial sector , scientific research or security systems . Go to: Visual Search Solutions Try public demos Articles API Documentation : What are the examples of visual & similarity search solutions built by Ximilar? How Visual AI helps e-shops, price comparators, or collectibles' sites? Can Visual AI help with sorting, filtering, and recommendations of images or products on my website? How to find duplicates, enrich product galleries, or add the metadata to the new images? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Can visual search engine built by Ximilar be deployed on our servers? Is Ximilar's visual AI able to handle large datasets and complex images? Ximilar's AI solutions were built to handle large datasets containing millions of images . Our cloud doesn't physically store your image collections for visual search. We process each image once during synchronization, extract descriptive data, and then immediately discard it, allowing for swift image processing. For instance, our largest collections, holding over 100 million images , require only a few hundred milliseconds to search for visually similar items. Complex images containing more objects, patterns, topics, people or items, can be easily processed with our AI. For instance, our Fashion Search and Home Decor Search solutions automatically detect all fashion apparel or homeware in the images, providing categories and similar stock to each object individually. You can test these solutions in our public demo . Custom image recognition and detection solutions rely on dedicated training image datasets , whose size depends on the complexity of the problem. For instance, training a model for cat and dog recognition may only require tens of images, while larger projects like our fashion recognition, with thousands of features and tags, necessitate datasets containing thousands of images. We also enable asynchronous requests. Read more about them in the API Documentation . Go to: How custom projects work? API Documentation Contact us : Does Ximilar store my images? How many images can be in a visual search collection? How many images do we need to train a visual similarity model? How do we keep our visual search collection updated? What is the difference between synchronous and asynchronous API requests? My company needs a more complex solution. Can you develop it? How does Ximilar approach privacy and data protection issues? Ximilar prioritizes data security and confidentiality. Our customers particularly value the following rules: We don't store user images, except for mutually agreed training datasets, secured on Amazon S3 with time-limited links. The intellectual rights to generated image models are shared between you and Ximilar, and we are not authorized to use the models for other customers or internal purposes. We adhere to European regulations, including GDPR, and our data center in Prague is multi ISO-certified. We can sign NDAs and customize image access restrictions based on your needs. Administrators access your image data only when necessary. On-premises installation is possible for larger projects. Feel free to reach out with questions about ethical considerations regarding privacy and data protection. Go to: Data Security & Privacy FAQ of Use & Privacy : Does Ximilar close NDA agreements? Who owns intellectual rights to my models trained on Ximilar's platform? Can Ximilar use my data to improve solutions for other customers? Does Ximilar store my images? Where are my images processed & stored? Which types of images and formats does Ximilar support? You can send images in these supported formats to our API (in fields of _base64 or _url): jpg, jpeg, png, webp, heic, bmp, tiff, and jfif. If you upload a gif, only the first frame will be processed. Contact us for customization. Go to: Read more in documentation : In which formats can my data export for visual search collection synchronisation be? How fast and efficient is the image recognition process? The speed typically ranges from 5 to 100 milliseconds per image for basic image classification and detection models. This timeframe varies based on factors such as input resolution, connectivity, and the speed of the image CDN used. Our platform's models are generally very fast, and they can be fine-tuned for even greater efficiency on specialized hardware like GPUs and smartphones. Go to: Computer Vision Platform Try public demo Start for free : What factors determine the accuracy of the image recognition system? Is Ximilar's visual AI able to handle large datasets and complex images? Go to FAQs Recognize, Search & Enhance Images With AI From ready-made to custom image recognition & visual search solutions under one API. Get Custom AI Tailored to Your Images Level up your image processing with custom solutions, combining existing & new features. Build Computer Vision Models Without Coding Create your own machine learning models and implement them easily into your website or app. Try for free Ready-to-use Visual AI Custom AI Solutions Computer Vision Platform Recognize, Search & Enhance Images With AI Get Custom AI Tailored to Your Images Build Computer Vision Models Without Coding Ready-to-use Visual AI demos Test Our Visual AI Choose from off-the-shelf solutions for fashion, home decor, stock photos, collectibles, and more. Fashion & Home Design Stock Photos & Image Tools Collectibles Fashion Taging Product Similarity Search Fashion by Photo Home Decor Tagging Photo Tagging Stock Photo Search Background Removal Dominant Colors AI Recognition of Collectibles Card Grader Click to Load Demo Ready-to-use Visual AI demos Test Our Visual AI Choose from off-the-shelf solutions for fashion, home decor, stock photos, collectibles, and more. FROM PATTERN RECOGNITION TO IMAGE SIMILARITY Get Custom AI Tailored to Your Visual Data Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. How it works? Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. FROM PATTERN RECOGNITION TO IMAGE SIMILARITY Get Custom AI Tailored to Your Visual Data Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. Custom features — Your own labels, object categories, attributes, taxonomy, or language can be added to our solutions. Semi-custom solutions — We can combine pre-trained & new modules for a tailored, budget-friendly solution. New solutions for pioneers — We will craft an image or video processing system from scratch to help you pave the way. MACHINE LEARNING FOR EVERYONE No-Code Computer Vision Platform Use Ximilar App to test, build & deploy your own visual artificial intelligence. Manage your collections in App & connect via API. Start for free now See all features Test to App for free, upload your images & try how it works for free Build No-code AI Label data & create computer vision models without coding Annotate Images Efficient & quick bulk annotation of images in a team Combine Combine ready-to-use and custom AI models into a modular Flow Connect Connect via REST API for setup, integration or both API Documentation Test to App for free, upload your images & try how it works for free Build No-code AI Label data & create computer vision models without coding Annotate Images Efficient & quick bulk annotation of images in a team Combine Combine ready-to-use and custom AI models into a modular Flow Connect Connect via REST API for setup, integration or both API Documentation image annotation optical character recognition (OCR) image classification image based search ML model testing image upscaling sports cards identification deep learning object detection language models (LLMs) integration facial detection advanced image search TCG card identification sports cards grading image labelling photo enhancing neural networks data labelling image segmentation MACHINE LEARNING FOR EVERYONE No-Code Computer Vision Platform to App for free, upload your images & try how it works Label data & create computer vision models without coding Efficient & quick bulk annotation of images in a team Combine ready-to-use and custom AI models into a modular Flow Connect via REST API for setup, integration or both to App for free, upload your images & try how it works Label data & create computer vision models without coding Efficient & quick bulk annotation of images in a team Combine ready-to-use and custom AI models into a modular Flow Connect via REST API for setup, integration or both NUMBER 1 NO-CODE AI VISION PLATFORM All-in-one Suite for Visual Data With Ximilar, you can automate & streamline all image processing with one API. All on one platform and without coding. How it works? TIME-EFFICIENT Save work & time Deploy the pre-trained tools on click, or add custom labels and features. Browse solutions MONTHLY SUBSCRIPTION Choose ideal plan With credit supply optimised to your traffic and needs. See Pricing EASY ACCESS Connect via API And implement it into your application, website or infrastructure. MODULAR STRUCTURE Upgrade on the go Combine and put pre-trained and custom models in complex sequences. Read more Workflow examples From quality control, security systems and video analysis, to pattern recognizing or medical diagnosis systems. See the typical image AI applications built with our platform. Sports & Trading Cards Identification Collectibles Recognition Sports Card Identifier Sports Card Grader or TCG Card Identifier TCG Card Grader Price Search Spot, analyze and grade collectible sports cards and trading card games (TCGs) automatically. Fashion Detection, Tagging & Description Fashion Apparel Detection Fashion Tagging Auto Description Identify all fashion including footwear and jewelry with specialized clothing AI. Generate product titles and descriptions. Stock Photo Tagging & Similarity Search Image Recognition Photo Tagging Dominant Colors or Image Similarity Search Search Images By Color Accurately identify photos, people, faces & objects. Provide similar visual content within your collection to your visitors. Real Estate Classifier Outdoor/Indoor Classifier Room Classifier Furniture Detection Home Decor Tagging Home Decor Search Automate the processing of photos of real estate, rooms, interior design, homeware, and pieces of furniture. NUMBER 1 NO-CODE AI VISION PLATFORM All-in-one Suite for Visual Data With Ximilar, you can automate & streamline all image processing with one API. All on one platform and without coding. Save work & time Deploy the pre-trained tools on click, or add custom labels and features. And implement it into your application, website or infrastructure. Upgrade on the go Sports & Trading Cards Identification Spot, analyze and grade collectible sports cards and trading card games (TCGs) automatically. Fashion Detection, Tagging & Description Identify all fashion including footwear and jewelry with specialized clothing AI. Generate product titles and descriptions. Stock Photo Tagging & Similarity Search Accurately identify photos, people, faces & objects. Provide similar visual content within your collection to your visitors. Automate the processing of photos of real estate, rooms, interior design, homeware, and pieces of furniture. HUMAN EXPERTISE, AI CONSISTENCY Get Your AI Solution From Industry Experts We aim to make artificial intelligence accessible to businesses of all sizes by building a reliable, cost-effective no-code platform. About us 15 Billion Images recognized and counting +380 % Increased click rate on products 40+ Countries of origin of our clients 10+ Years Hands-on experience in AI systems Nessi Image Annotation Expert David Founder, Computer Vision Expert Gabriela Fashion Stylist, Customer Care Michal CEO, Machine Learning Engineer 15 Billion Images recognized and counting +380 % Increased click rate on products 40+ Countries of origin of our clients 10+ Years Hands-on experience in AI systems HUMAN EXPERTISE, AI CONSISTENCY Get Your AI Solution From Industry Experts Images recognized and counting Increased click rate on products Countries of origin of our clients Hands-on experience in AI systems Images recognized and counting Increased click rate on products Countries of origin of our clients Hands-on experience in AI systems USE AI WITH CONFIDENCE Transparency & Security Come First Use secure AI software with maximal data privacy. We store only training data on our own servers in the EU, with all data protected under GDPR. Your models & data belong to you You hold the intellectual rights to all the models you train on our platform. Read more Processed images are not stored Our software analyses each picture in your database once, without storing any of them. Read more Certified hardware infrastructure Based on academic research USE AI WITH CONFIDENCE Transparency & Security Come First Your models & data belong to you Processed images are not stored Our software analyses each picture in your database once, without storing any of them. Dr. Reza Farshey CEO, Endogenie We used Ximilar's platform to build a model analyzing X-ray medical images. Even though the models are built on their platform, the data belong to our company. Support from Ximilar has been amazing, with a response time less than 24 hours. Overall, I am extremely happy with the service and product offerings from Ximilar. Dr. Reza Farshey Founder & CEO Damo Bowland CEO, TCG Sync Ximilar has been a fantastic partner for our card recognition needs. The backend system is highly reliable, and in the time we've been with Ximilar, we haven't encountered a single issue. The team is incredibly responsive, always quick to address any queries we've had, and they consistently go above and beyond to ensure we fully understand and utilize their services. Their commitment to support and seamless performance earns them a well-deserved 5 stars. Highly recommended! Damo Bowland CEO Zajzon Bodó CEO, Babyndex Babyndex uses Ximilar's Image Recognition and Annotate, which is excellent. I can easily set up their services myself. Ximilar has helped in improving accuracy and from that day on, it works perfectly. Zajzon Bodó Co-founder & CEO, Babyndex Filiberto Sosa CEO, Sizes and Colors We integrate Ximilar's visual AI into our online product discovery tool. With Ximilar's visual search, we can tailor recommendations of newly arrived products to customers who are likely to be interested. Our system automatically notifies them, enhancing the overall customer experience. Our experience with Ximilar has been great. Filiberto Sosa CEO Amos Struck Co-founder, StockPhotos Way better similar results in our 10 million stock images. Customers can find visually similar pictures by uploading a photo. The integration was fast. We recommend it! Amos Struck Co-founder Pavel Macků CEO, Profimedia The Ximilar technology has been working reliably for many years on our collection of 100M+ creative photos. Pavel Macků CEO Previous Next We used Ximilar's platform to build a model analyzing X-ray medical images. Even though the models are built on their platform, the data belong to our company. Support from Ximilar has been amazing, with a response time less than 24 hours. Overall, I am extremely happy with the service and product offerings from Ximilar. Ximilar has been a fantastic partner for our card recognition needs. The backend system is highly reliable, and in the time we've been with Ximilar, we haven't encountered a single issue. The team is incredibly responsive, always quick to address any queries we've had, and they consistently go above and beyond to ensure we fully understand and utilize their services. Their commitment to support and seamless performance earns them a well-deserved 5 stars. Highly recommended! Babyndex uses Ximilar's Image Recognition and Annotate, which is excellent. I can easily set up their services myself. Ximilar has helped in improving accuracy and from that day on, it works perfectly. Co-founder & CEO, Babyndex We integrate Ximilar's visual AI into our online product discovery tool. With Ximilar's visual search, we can tailor recommendations of newly arrived products to customers who are likely to be interested. Our system automatically notifies them, enhancing the overall customer experience. Our experience with Ximilar has been great. Way better similar results in our 10 million stock images. Customers can find visually similar pictures by uploading a photo. The integration was fast. We recommend it! The Ximilar technology has been working reliably for many years on our collection of 100M+ creative photos. CONNECT VIA REST API Deploy, Connect & Conquer Deploy latest models on click, connect via REST API, and integrate them into your system or infrastructure. Go to API Documentation Technology Stack REST API status monitoring Python Client Python PHP cURL # pip install ximilar-client import base64 from ximilar.client import FashionTaggingClient with open(__IMAGE_PATH__, \"rb\") as image_file: encoded_string = base64.b64encode(image_file.read()).decode('utf -8') client = FashionTaggingClient(\"__API_TOKEN__\") response = client.detect_tags([{'_base64': encoded_string}]) import requests, json, base64 endpoint = 'https://api.ximilar.com/tagging/ fashion/v2/detect_tags' headers = { 'Authorization': \"Token __API_TOKEN__\", 'Content-Type': 'application/json' } with open(__IMAGE_PATH__, \"rb\") as image_file: encoded_string = base64.b64encode(image_file.read()).decode('utf -8') data = { 'records': [{'_base64': encoded_string}] } response = requests.post(endpoint, headers=headers, data=json.dumps(data)).json() $curl_handle = curl_init(\"https:// api.ximilar.com/tagging/fashion/v2/ detect_tags\"); $data = ['records' => [ [ '_url' => '__PATH_TO_URL_IMAGE__' ], [ '_base64' => base64_encode(file_get_contents(__PATH_TO_IMAGE __)) ] ] ]; curl_setopt($curl_handle, CURLOPT_CUSTOMREQUEST, \"POST\"); curl_setopt($curl_handle, CURLOPT_POSTFIELDS, json_encode($data)); curl_setopt($curl_handle, CURLOPT_RETURNTRANSFER, true); curl_setopt($curl_handle, CURLOPT_FAILONERROR, true); curl_setopt($curl_handle, CURLOPT_HTTPHEADER, array( \"Content-Type: application/json\", \"Authorization: Token __API_TOKEN__\", \"cache- control: no-cache\",) ); $response = curl_exec($curl_handle); $error_msg = curl_error($curl_handle); curl_close ($curl_handle); curl --request POST \\ --url https://api.ximilar.com/tagging/ fashion/v2/detect_tags \\ --header 'Content-Type: application/json' \\ --header 'authorization: Token __API_TOKEN__' \\ --data '{\"records\":[{\"_url\": \"https:// bit.ly/2IymQJv\"}]}' CONNECT VIA REST API Deploy, Connect & Conquer Deploy latest models on click, connect via REST API, and integrate them into your system or infrastructure. Frequently Asked Questions How image recognition works? Image recognition allows computers to understand and classify images by analyzing their content. It helps with interpreting, tagging (enrichment with additional metadata), or categorization (sorting into groups) of images. For example, if you train a dog vs. cat recognition model, and provide it with a folder of mixed pictures, it will be able to distinguish between cats and dogs, and thus sort the images into two separate folders. It is used in various applications including medical diagnosis, autonomous vehicle systems (object recognition) or security systems (like facial recognition). The accuracy, speed, and efficiency of such systems continue to improve with advancements in artificial intelligence and machine learning techniques and depend on factors such as the quality of training datasets. Deep learning algorithms, particularly convolutional neural networks (CNNs), are commonly used for image categorization tasks. Ximilar provides several off-the-shelf solutions for classifying specific image data, such as stock photos, home decor and furniture images, fashion photos, or trading and collectible cards. Custom models can be easily trained on our platform . Read the articles in our blog to learn about image recognition technology. Go to: Discover ready-to-use solutions Discover computer vision platform : Which services does Ximilar provide, and what are the differences between them? How Ximilar technology works? What is custom image recognition? What is Visual Search? Visual & similarity search technology can analyze the overall visual aesthetic of an image or detected object in an image, independent of the origin of images or metadata (such as keywords). It understands the concept of similarity according to your subjective perception. That is why it can provide the most relevant results to image queries, whether you look for the exact match or similar items. Go to: Explore Visual Search Solutions Explore public demos Articles about visual search API Documentation : What are the examples of visual & similarity search solutions built by Ximilar? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Which collectibles can AI Recognition of Collectibles recognize? As for now, the service is able to detect (and mark by bounding boxes) the collectibles such as stamps, coins, banknotes, comic books and trading cards , as well as antique items . For collectible cards, the service can identify whether it is a Trading Card Game (Pokémon, Magic The Gathering – MTG, Yu-Gi-Oh!, Lorcana, Flesh and Blood and so on) or a Sports Card (Baseball, Basketball, Hockey, Football, Soccer, or MMA), with several additional features (e.g., signature). It can be easily customized to evaluate images based on your criteria. The full taxonomy of the identification results with all supported games and sports can be found in our documentation page . For comic books, the service can identify more than 1 million magazines, books and manga – via name, title, publisher, issue number and release date. The service is constantly expanding based on the requests from our customers. Go to: AI Recognition of Collectibles – Page AI Recognition of Collectibles – Public Demo How Image Recognition works? Collectibles Recognition API – Documentation : Can your AI identify or find the exact collectible based on a photo? How does the automatic visual inspection of collectibles work? How Ximilar streamlines image processing tasks and reduces costs? Ximilar's systems significantly reduce image processing costs by automating repetitive tasks such as analyzing, tagging and sorting of images. This automation results in significant long-term savings, allowing for continuous 24/7 addition of new visual content without additional metadata. We're continually enhancing our platform, which enables us to both build services efficiently and quickly and also to modify existing solutions to suit your needs. We reduce costs and labour by utilizing a combination of pre-trained and new models. Service use is billed via API credits, with a customizable monthly plan based on your consumption . Using our credit calculator helps you optimize cost-effectiveness. For sudden system loads, you can add extra credit packs to your monthly credit supply. Once your solution is live, we can continually upgrade and enhance it, altering any component in the modular structure. Our feedback mechanisms help us understand which model performs best, allowing us to refine the solution. Also, our ready-to-use solutions are routinely updated to stay industry-relevant, and these upgrades come at no extra cost . Go to: See Pricing Count my monthly consumption How custom projects work? : How much does it cost to use Ximilar's solutions and platform? Which payment methods does Ximilar accept and how does the billing work? Is training, deployment and using of my Image Recognition tasks charged? What are the typical Visual Search applications? Visual search typically involves searching images or products using an image query, including photos from social media and user-generated content, like smartphone photos. Our Search by Photo combines this technology with detecting individual products in images. One such solution is Search Fashion by Photo . The technology is frequently employed for similarity searches , particularly for product recommendations in e-commerce. It assesses image or detected object features, like colour, edges, or patterns, to suggest the most similar alternatives. Another typical use is image & product matching . Since the technology can identify duplicates or nearly identical items in various images with different quality, it can help with curating product galleries and eliminating all unnecessary content. Even though applications in e-commerce are the most common, visual search provides endless possibilities even in the industrial sector , scientific research or security systems . Go to: Visual Search Solutions Try public demos Articles API Documentation : What are the examples of visual & similarity search solutions built by Ximilar? How Visual AI helps e-shops, price comparators, or collectibles' sites? Can Visual AI help with sorting, filtering, and recommendations of images or products on my website? How to find duplicates, enrich product galleries, or add the metadata to the new images? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Can visual search engine built by Ximilar be deployed on our servers? Is Ximilar's visual AI able to handle large datasets and complex images? Ximilar's AI solutions were built to handle large datasets containing millions of images . Our cloud doesn't physically store your image collections for visual search. We process each image once during synchronization, extract descriptive data, and then immediately discard it, allowing for swift image processing. For instance, our largest collections, holding over 100 million images , require only a few hundred milliseconds to search for visually similar items. Complex images containing more objects, patterns, topics, people or items, can be easily processed with our AI. For instance, our Fashion Search and Home Decor Search solutions automatically detect all fashion apparel or homeware in the images, providing categories and similar stock to each object individually. You can test these solutions in our public demo . Custom image recognition and detection solutions rely on dedicated training image datasets , whose size depends on the complexity of the problem. For instance, training a model for cat and dog recognition may only require tens of images, while larger projects like our fashion recognition, with thousands of features and tags, necessitate datasets containing thousands of images. We also enable asynchronous requests. Read more about them in the API Documentation . Go to: How custom projects work? API Documentation Contact us : Does Ximilar store my images? How many images can be in a visual search collection? How many images do we need to train a visual similarity model? How do we keep our visual search collection updated? What is the difference between synchronous and asynchronous API requests? My company needs a more complex solution. Can you develop it? How does Ximilar approach privacy and data protection issues? Ximilar prioritizes data security and confidentiality. Our customers particularly value the following rules: We don't store user images, except for mutually agreed training datasets, secured on Amazon S3 with time-limited links. The intellectual rights to generated image models are shared between you and Ximilar, and we are not authorized to use the models for other customers or internal purposes. We adhere to European regulations, including GDPR, and our data center in Prague is multi ISO-certified. We can sign NDAs and customize image access restrictions based on your needs. Administrators access your image data only when necessary. On-premises installation is possible for larger projects. Feel free to reach out with questions about ethical considerations regarding privacy and data protection. Go to: Data Security & Privacy FAQ of Use & Privacy : Does Ximilar close NDA agreements? Who owns intellectual rights to my models trained on Ximilar's platform? Can Ximilar use my data to improve solutions for other customers? Does Ximilar store my images? Where are my images processed & stored? Which types of images and formats does Ximilar support? You can send images in these supported formats to our API (in fields of _base64 or _url): jpg, jpeg, png, webp, heic, bmp, tiff, and jfif. If you upload a gif, only the first frame will be processed. Contact us for customization. Go to: Read more in documentation : In which formats can my data export for visual search collection synchronisation be? How fast and efficient is the image recognition process? The speed typically ranges from 5 to 100 milliseconds per image for basic image classification and detection models. This timeframe varies based on factors such as input resolution, connectivity, and the speed of the image CDN used. Our platform's models are generally very fast, and they can be fine-tuned for even greater efficiency on specialized hardware like GPUs and smartphones. Go to: Computer Vision Platform Try public demo Start for free : What factors determine the accuracy of the image recognition system? Is Ximilar's visual AI able to handle large datasets and complex images? Go to FAQs How image recognition works? Image recognition allows computers to understand and classify images by analyzing their content. It helps with interpreting, tagging (enrichment with additional metadata), or categorization (sorting into groups) of images. For example, if you train a dog vs. cat recognition model, and provide it with a folder of mixed pictures, it will be able to distinguish between cats and dogs, and thus sort the images into two separate folders. It is used in various applications including medical diagnosis, autonomous vehicle systems (object recognition) or security systems (like facial recognition). The accuracy, speed, and efficiency of such systems continue to improve with advancements in artificial intelligence and machine learning techniques and depend on factors such as the quality of training datasets. Deep learning algorithms, particularly convolutional neural networks (CNNs), are commonly used for image categorization tasks. Ximilar provides several off-the-shelf solutions for classifying specific image data, such as stock photos, home decor and furniture images, fashion photos, or trading and collectible cards. Custom models can be easily trained on our platform . Read the articles in our blog to learn about image recognition technology. Discover computer vision platform Which services does Ximilar provide, and what are the differences between them? How Ximilar technology works? What is custom image recognition? What is Visual Search? Visual & similarity search technology can analyze the overall visual aesthetic of an image or detected object in an image, independent of the origin of images or metadata (such as keywords). It understands the concept of similarity according to your subjective perception. That is why it can provide the most relevant results to image queries, whether you look for the exact match or similar items. Explore Visual Search Solutions Articles about visual search What are the examples of visual & similarity search solutions built by Ximilar? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Which collectibles can AI Recognition of Collectibles recognize? As for now, the service is able to detect (and mark by bounding boxes) the collectibles such as stamps, coins, banknotes, comic books and trading cards , as well as antique items . For collectible cards, the service can identify whether it is a Trading Card Game (Pokémon, Magic The Gathering – MTG, Yu-Gi-Oh!, Lorcana, Flesh and Blood and so on) or a Sports Card (Baseball, Basketball, Hockey, Football, Soccer, or MMA), with several additional features (e.g., signature). It can be easily customized to evaluate images based on your criteria. The full taxonomy of the identification results with all supported games and sports can be found in our documentation page . For comic books, the service can identify more than 1 million magazines, books and manga – via name, title, publisher, issue number and release date. The service is constantly expanding based on the requests from our customers. AI Recognition of Collectibles – Page AI Recognition of Collectibles – Public Demo How Image Recognition works? Collectibles Recognition API – Documentation Can your AI identify or find the exact collectible based on a photo? How does the automatic visual inspection of collectibles work? How Ximilar streamlines image processing tasks and reduces costs? Ximilar's systems significantly reduce image processing costs by automating repetitive tasks such as analyzing, tagging and sorting of images. This automation results in significant long-term savings, allowing for continuous 24/7 addition of new visual content without additional metadata. We're continually enhancing our platform, which enables us to both build services efficiently and quickly and also to modify existing solutions to suit your needs. We reduce costs and labour by utilizing a combination of pre-trained and new models. Service use is billed via API credits, with a customizable monthly plan based on your consumption . Using our credit calculator helps you optimize cost-effectiveness. For sudden system loads, you can add extra credit packs to your monthly credit supply. Once your solution is live, we can continually upgrade and enhance it, altering any component in the modular structure. Our feedback mechanisms help us understand which model performs best, allowing us to refine the solution. Also, our ready-to-use solutions are routinely updated to stay industry-relevant, and these upgrades come at no extra cost . Count my monthly consumption How custom projects work? How much does it cost to use Ximilar's solutions and platform? Which payment methods does Ximilar accept and how does the billing work? Is training, deployment and using of my Image Recognition tasks charged? What are the typical Visual Search applications? Visual search typically involves searching images or products using an image query, including photos from social media and user-generated content, like smartphone photos. Our Search by Photo combines this technology with detecting individual products in images. One such solution is Search Fashion by Photo . The technology is frequently employed for similarity searches , particularly for product recommendations in e-commerce. It assesses image or detected object features, like colour, edges, or patterns, to suggest the most similar alternatives. Another typical use is image & product matching . Since the technology can identify duplicates or nearly identical items in various images with different quality, it can help with curating product galleries and eliminating all unnecessary content. Even though applications in e-commerce are the most common, visual search provides endless possibilities even in the industrial sector , scientific research or security systems . What are the examples of visual & similarity search solutions built by Ximilar? How Visual AI helps e-shops, price comparators, or collectibles' sites? Can Visual AI help with sorting, filtering, and recommendations of images or products on my website? How to find duplicates, enrich product galleries, or add the metadata to the new images? How do I know if I need a custom visual search solution? How many images do we need to train a visual similarity model? Can we build a smartphone app to search for specific products? Can visual search engine built by Ximilar be deployed on our servers? Is Ximilar's visual AI able to handle large datasets and complex images? Ximilar's AI solutions were built to handle large datasets containing millions of images . Our cloud doesn't physically store your image collections for visual search. We process each image once during synchronization, extract descriptive data, and then immediately discard it, allowing for swift image processing. For instance, our largest collections, holding over 100 million images , require only a few hundred milliseconds to search for visually similar items. Complex images containing more objects, patterns, topics, people or items, can be easily processed with our AI. For instance, our Fashion Search and Home Decor Search solutions automatically detect all fashion apparel or homeware in the images, providing categories and similar stock to each object individually. You can test these solutions in our public demo . Custom image recognition and detection solutions rely on dedicated training image datasets , whose size depends on the complexity of the problem. For instance, training a model for cat and dog recognition may only require tens of images, while larger projects like our fashion recognition, with thousands of features and tags, necessitate datasets containing thousands of images. We also enable asynchronous requests. Read more about them in the API Documentation . How custom projects work? Does Ximilar store my images? How many images can be in a visual search collection? How many images do we need to train a visual similarity model? How do we keep our visual search collection updated? What is the difference between synchronous and asynchronous API requests? My company needs a more complex solution. Can you develop it? How does Ximilar approach privacy and data protection issues? Ximilar prioritizes data security and confidentiality. Our customers particularly value the following rules: We don't store user images, except for mutually agreed training datasets, secured on Amazon S3 with time-limited links. The intellectual rights to generated image models are shared between you and Ximilar, and we are not authorized to use the models for other customers or internal purposes. We adhere to European regulations, including GDPR, and our data center in Prague is multi ISO-certified. We can sign NDAs and customize image access restrictions based on your needs. Administrators access your image data only when necessary. On-premises installation is possible for larger projects. Feel free to reach out with questions about ethical considerations regarding privacy and data protection. Data Security & Privacy FAQ of Use & Privacy Does Ximilar close NDA agreements? Who owns intellectual rights to my models trained on Ximilar's platform? Can Ximilar use my data to improve solutions for other customers? Does Ximilar store my images? Where are my images processed & stored? Which types of images and formats does Ximilar support? You can send images in these supported formats to our API (in fields of _base64 or _url): jpg, jpeg, png, webp, heic, bmp, tiff, and jfif. If you upload a gif, only the first frame will be processed. Contact us for customization. Read more in documentation In which formats can my data export for visual search collection synchronisation be? How fast and efficient is the image recognition process? The speed typically ranges from 5 to 100 milliseconds per image for basic image classification and detection models. This timeframe varies based on factors such as input resolution, connectivity, and the speed of the image CDN used. Our platform's models are generally very fast, and they can be fine-tuned for even greater efficiency on specialized hardware like GPUs and smartphones. What factors determine the accuracy of the image recognition system? Is Ximilar's visual AI able to handle large datasets and complex images?"
  ]
}