{
  "company": "www.smithsdetection.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 11,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.6851851851851852,
    "framing_surveillance": 0.1666666666666666,
    "framing_market": 0.1481481481481481,
    "num_docs": 12
  },
  "topic_timeline": {
    "20": {
      "-1": 11,
      "0": 1
    }
  },
  "sample_docs": [
    "Products & Solutions All products & solutions By market sector By threat Rapid product finder New Products All products & solutions Service & Support Contact us The Americas Europe, Middle East & Africa Asia Pacific WEEE Compliance Europe, Middle East & Africa Technologies Gas Chromatography/Mass Spectrometry (GC/MS) Gamma Ray Spectroscopy IMS Infra-red LATE-PCR Millimetre-wave Raman X-ray inspection Gas Chromatography/Mass Spectrometry (GC/MS) Media & Events Press releases Media information centre Exhibitions Presentations About us History Organisation Locations Careers Useful links All products & solutions Biological agents detection Chemical agents detection Chemical identification Explosives detection (liquids) Explosives/narcotics trace detection Integrated systems People screening systems Metal detection Radiation detection Security checkpoint solutions X-ray inspection Mail & parcels Parcels & baggage Baggage & freight Freight & cargo HI-SCAN 145180 HI-SCAN 145180-2is HI-SCAN 180180 HI-SCAN 180180-2is Cargo & vehicle Check-In applications Explosives detection Training courses X-ray inspection Mail & parcels Parcels & baggage Baggage & freight Freight & cargo HI-SCAN 145180 HI-SCAN 145180-2is HI-SCAN 180180 HI-SCAN 180180-2is Cargo & vehicle Check-In applications Explosives detection Training courses Freight & cargo HI-SCAN 145180 HI-SCAN 145180-2is HI-SCAN 180180 HI-SCAN 180180-2is Products & Solutions | All products & solutions | September 06. 2012 Smiths Detection Baggage Scanner Gains Key EU Approval [more] August 30. 2012 Smiths Detection Wins Contract for Additional Mobile Weather Information Systems [more] August 28. 2012 Smiths Detection Names Edgewood as U.S. Headquarters [more] August 21. 2012 Smiths Detection Wins $21M Chemical Detector Orders [more] August 13. 2012 Smiths Detection Expands Radiation Offering [more] © Copyright 2012 Smiths Detection. A Part of Smiths Group plc. . Registered Office: 64 Clarendon Road, Watford, Herts WD17 1DA, UK. Incorporated in England No. 05138140 Page ID 304 | published on 09.26.12 Cookie Policy | Imprint | Sitemap",
    "Products & Solutions All products & solutions By market sector By threat Rapid product finder New Products All products & solutions Service & Support Contact us The Americas Europe, Middle East & Africa Asia Pacific WEEE Compliance Europe, Middle East & Africa Technologies Gas Chromatography/Mass Spectrometry (GC/MS) Gamma Ray Spectroscopy IMS Infra-red LATE-PCR Millimetre-wave Raman X-ray inspection Gas Chromatography/Mass Spectrometry (GC/MS) Media & Events Press releases Media information centre Exhibitions Presentations About us History Organisation Locations Careers Useful links All products & solutions Biological agents detection Chemical agents detection Chemical identification Explosives detection (liquids) Explosives/narcotics trace detection Integrated systems People screening systems Metal detection Radiation detection Security checkpoint solutions X-ray inspection Mail & parcels HI-SCAN 5030si HI-SCAN 6030di HI-SCAN 6040ds Parcels & baggage Baggage & freight Freight & cargo Cargo & vehicle Check-In applications Explosives detection Training courses X-ray inspection Mail & parcels HI-SCAN 5030si HI-SCAN 6030di HI-SCAN 6040ds Parcels & baggage Baggage & freight Freight & cargo Cargo & vehicle Check-In applications Explosives detection Training courses Mail & parcels HI-SCAN 5030si HI-SCAN 6030di HI-SCAN 6040ds Products & Solutions | All products & solutions | September 27. 2012 Smiths Detection Builds First X-ray Systems at New Malaysian Facility [more] September 06. 2012 Smiths Detection Baggage Scanner Gains Key EU Approval [more] August 30. 2012 Smiths Detection Wins Contract for Additional Mobile Weather Information Systems [more] August 28. 2012 Smiths Detection Names Edgewood as U.S. Headquarters [more] August 21. 2012 Smiths Detection Wins $21M Chemical Detector Orders [more] © Copyright 2012 Smiths Detection. A Part of Smiths Group plc. . Registered Office: 64 Clarendon Road, Watford, Herts WD17 1DA, UK. Incorporated in England No. 05138140 Page ID 300 | published on 10.30.12 Cookie Policy | Imprint | Sitemap",
    "Products & Solutions By threat By market sector All products & solutions Rapid product finder All products & solutions Service & Support Contact us The Americas Europe, Middle East & Africa Asia Pacific WEEE Compliance Europe, Middle East & Africa Technologies Gas Chromatography/Mass Spectrometry (GC/MS) Gamma Ray Spectroscopy IMS Infra-red LATE-PCR Millimetre-wave Raman X-ray inspection Gas Chromatography/Mass Spectrometry (GC/MS) Media & Events Press releases Media information centre Exhibitions Presentations New product introductions About us History Organisation Locations Careers Useful links Gas Chromatography/Mass Spectrometry (GC/MS) X-ray inspection X-ray technology HiTraX highlights HI-MAT X-ACT HI-SPOT HI-TIP ProLine overview Advanced contents tracking X-ACT offers an automated procedure for the recognition of suspicious material works online and in real-time without loss of evaluation time for the operator is 'background-sensitive': Detection of substances covered by other material does not require further operator manipulation or stopping of baggage flow provides automated conveyor stops without loss of information implies an image storage function (IMS) includes an automatic re-calibration facility which guarantees long term stability Green frame: Narcotics (option) Blue frame: High density (option) Development supported by EC under contract no. 23480 For more information about Smiths Detection and its products, please contact us. [more] February 09. 2012 Smiths Detection Launches Next Generation High-Energy X-ray System for Rapid Cargo and Vehicle Screening [more] February 02. 2012 Smiths Detection Supplies Mobile Weather Systems to U.S. Marines [more] January 17. 2012 Smiths Detection Launches Next-Generation Miniaturized Chemical Threat Identifier [more] December 15. 2011 Smiths Detection Supplies Nigeria the Most Advanced Customs Screening System in the Region [more] November 08. 2011 Smiths Detection to distribute NIDS bio-threat system globally [more] © Copyright 2012 Smiths Detection. A Part of Smiths Group plc. . Registered Office: 64 Clarendon Road, Watford, Herts WD17 1DA, UK. Incorporated in England No. 05138140 Page ID 2180 | published on 02.23.12 Imprint | Sitemap",
    "Smiths Detection is an international operation and part of the UK-based global technology business Smiths Group . The senior management team of Smiths Detection reflects the international organisation, with a strong group of experienced managers heading regional operations that serve our key markets and a skilled central team responsible for the main functional activities. Smiths Detection, Inc. operates through a Special Security Agreement between the U.S. Government, Smiths Detection, Inc. and Smiths Detection, LLC. Smiths Detection RICHARD INGRAM, President RICHARD INGRAM was appointed President of Smiths Detection in May 2014, following 25 years in leadership roles in the aerospace, automotive and oil industries. Most recently he was CEO of Zodiac Electrical Systems, a division of Zodiac Aerospace, based in France. Previous appointments included nine years with Goodrich Corporation where he became divisional President of Goodrich Engine Control and Electrical Power Systems, having previously been with Goodrich Actuation Systems as VP European Civil Business, then VP and General Manager. Earlier, he held management positions at TRW Aeronautical Systems, LucasVarity Automotive and Shell UK. Educated at University of Manchester, RICHARD holds a BSc. & B Eng. in engineering, manufacturing and management and he achieved an MBA from Warwick Business School. Regional Vice Presidents (For USA see Smiths Detection Inc. below) NATHAN MANZI, Vice President Asia-Pacific Region NATHAN MANZI was previously the Managing Director for Asia of Smiths Detection.Based at the Smiths Detection Asia Pacific headquarters in Singapore, NATHAN is responsible for all sales and business results in the Asia region excluding India. NATHAN began his Smiths Detection career in New Zealand in 2004 where he delivered major projects to Customs and Aviation Security, in addition to setting up an office to conduct on-going business. Married with two children, NATHAN holds a Bachelor's Degree in Mechanical Engineering from the University of New South Wales, Australia, a Master of Science in Military Vehicle Technology from Cranfield University, United Kingdom, and is a Graduate of the Australian Institute of Company Directors. TONY TIELEN, Vice President, EMEA Region TONY TIELEN was appointed regional VP for Europe, Middle East and Africa in May 2015. He was previously with Honeywell where he held various general management and senior sales roles; most recently as VP for the Engineered Field Solutions business. TONY has a degree in microelectronics (Avans Hogeschool), a masters in management (Nyenrode Business University) and has completed senior leadership programs at IMD Lausanne and Stanford University. Functional Heads MICHAEL CAVANAUGH - Vice President Global Service & Digital Solutions MICHAEL CAVANAUGH was appointed Vice President Global Service & Digital Solutions following the acquisition of Morpho Detection, where he had worked since 2005. Prior to this, MICHAEL held roles at GE, Lloyd's Bank and United Airlines. MICHAEL has experience managing manufacturing, supply chain, and maintenance, repair and overhaul operations. MONTY LUTZKER - Vice President Business Development & Marketing MONTY LUTZKER joined Smiths Detection in 2012 from General Electric where he filled a number of executive roles including that of global sales head for GE Digital Energy. Prior to his role at Digital Energy, LUTZKER was a sales leader at GE Homeland Protection. ALAIN MCINNES - Chief Financial Officer ALAIN MCINNES joined Smiths Group in 2006, holding a number of positions. He was appointed Smiths Detection's Chief Financial Officer in August 2017. Prior to joining Smiths Group, ALAIN worked for 9 years at British Airways. HENRIK AKERSON, Vice President of Global Operations HENRIK AKERSON joined Smiths Detection in August 2016 as Vice President of Global Operations. Prior to joining, Henrik worked at Gardner Denver Inc., where most recently, he was the Operations Director for the EMEA region. Previously he worked for IMI plc and held a number of roles spanning operations and business development. HENRIK is an expert in production, quality management logistics and manufacturing engineering. He holds an MSc in Mechanical Engineering from Luleå University of Technology (LUT). ADAM RAMSAY, Divisional General Counsel ADAM RAMSAY was appointed Divisional General Counsel in May 2015, having been interim in that role since November 2014. Prior to that Adam was General Counsel of Edwards Group Limited until June 2014, a NASDAQ listed global high technology manufacturer in the semiconductor and industrial sectors, until its sale to Atlas Copco in early 2014. ADAM has held senior in house roles in a number of public and private equity owned businesses in a variety of sectors including Oil & Gas, engineering and outsourcing working for companies such as BG Group, Babcock International and MITIE Group. ADAM is a qualified solicitor. DIANA HOUGHTON, Vice President Strategy & Marketing DIANA HOUGHTON was appointed as Director of Strategy in November 2013. DIANA is a corporate development and strategy specialist with broad experience of the consumer goods, retail and leisure retail sectors and also possesses extensive corporate finance expertise. She spent six years as the Corporate Development Director of Allied Domecq before working as a consultant to a number of companies, investment banks and private equity houses. She is a non-executive director and chair of the Audit Committee for Thorntons plc. Other appointments include a senior advisory role with the National Audit Office. SHAN HOOD, Vice President Product & Technology SHAN HOOD joined Smiths Detection in February 2014 as Vice President of the new Product & Technology group, on an interim basis, having moved from the Flex-Tek division of Smiths Group. He joined Flex-Tek (then Flexible Technologies) in 1986 as a mechanical engineer and was appointed General Manager of its Industrial Division in 1994. He subsequently held the role of VP - Sales & Marketing for Flex-Tek before his appointment, in 2001, into his previous role as VP - Business Development. He was responsible for the development of Flex-Tek's strategic goals, vision, and growth initiatives. KINI PATHMANATHAN, Vice President of Human Resources KINI PATHMANATHAN joined Smiths Detection in April 2017 as Vice President of Human Resources. Prior to joining, KINI worked at Thales where she held a number of senior HR roles; most recently as Vice President of Human Resources for their UK business. KINI holds a BEng in mechanical engineering from Queen Mary, University of London, and an MBA from Aston University Business School. Smiths Detection, Inc Special Security Agreement Smiths Detection, Inc. has been established to distinguish its operations from its foreign parent through a Special Security Agreement between the U.S. Government, Smiths Detection, Inc. and Smiths Detection, LLC. Under the agreement Smiths Detection, Inc. has outside directors who, in conjunction with other U.S. based board members, make up a Government Security Committee. The Government Security Committee is responsible for oversight of the corporation's compliance with U.S. Government Security and Export regulations, and meets regularly with the Defence Security Service (DSS). Smiths Detection, Inc. is responsible for the execution of specialized products and programs for groups such as the US Department of Defense and Homeland Security Agencies. DAVID MOOREHOUSE, Interim President of SDI DAVID (DAVE) MOOREHOUSE is the Interim President of SDI. He also currently holds the position of President of Smiths Interconnect, Inc. which is an entity within the Smiths Interconnect division that performs classified work for U.S. government customers and operates under a SSA. DAVE joined Smiths in 2013 in this role. DAVE has over 25 years of a military/defense experience in various technical and leadership roles. Prior to joining Smiths, DAVE was the General Manager of Nurad Technologies (Cobham) for six years, where he had P&L responsibility over antenna/radome products for military markets operating under a SSA. Prior to that, DAVE held various leadership and technical roles at Cobham, Molded Fiberglass, M.C. Gill Corporation, Hexcel and Pratt Whitney. DAVE has a B.S in Mechanical Engineering from Milwaukee School of Engineering, an M.S. in Mechanical Engineering from Michigan State University and a MBA in Management from St. Joseph's University. Smiths Detection is an international operation and part of the UK-based global technology business Smiths Group . The senior management team of Smiths Detection reflects the international organisation, with a strong group of experienced managers heading regional operations that serve our key markets and a skilled central team responsible for the main functional activities. Smiths Detection, Inc. operates through a Special Security Agreement between the U.S. Government, Smiths Detection, Inc. and Smiths Detection, LLC. RICHARD INGRAM was appointed President of Smiths Detection in May 2014, following 25 years in leadership roles in the aerospace, automotive and oil industries. Most recently he was CEO of Zodiac Electrical Systems, a division of Zodiac Aerospace, based in France. Previous appointments included nine years with Goodrich Corporation where he became divisional President of Goodrich Engine Control and Electrical Power Systems, having previously been with Goodrich Actuation Systems as VP European Civil Business, then VP and General Manager. Earlier, he held management positions at TRW Aeronautical Systems, LucasVarity Automotive and Shell UK. Educated at University of Manchester, RICHARD holds a BSc. & B Eng. in engineering, manufacturing and management and he achieved an MBA from Warwick Business School. (For USA see Smiths Detection Inc. below) NATHAN MANZI, Vice President Asia-Pacific Region NATHAN MANZI was previously the Managing Director for Asia of Smiths Detection.Based at the Smiths Detection Asia Pacific headquarters in Singapore, NATHAN is responsible for all sales and business results in the Asia region excluding India. NATHAN began his Smiths Detection career in New Zealand in 2004 where he delivered major projects to Customs and Aviation Security, in addition to setting up an office to conduct on-going business. Married with two children, NATHAN holds a Bachelor's Degree in Mechanical Engineering from the University of New South Wales, Australia, a Master of Science in Military Vehicle Technology from Cranfield University, United Kingdom, and is a Graduate of the Australian Institute of Company Directors. TONY TIELEN, Vice President, EMEA Region TONY TIELEN was appointed regional VP for Europe, Middle East and Africa in May 2015. He was previously with Honeywell where he held various general management and senior sales roles; most recently as VP for the Engineered Field Solutions business. TONY has a degree in microelectronics (Avans Hogeschool), a masters in management (Nyenrode Business University) and has completed senior leadership programs at IMD Lausanne and Stanford University. MICHAEL CAVANAUGH - Vice President Global Service & Digital Solutions MICHAEL CAVANAUGH was appointed Vice President Global Service & Digital Solutions following the acquisition of Morpho Detection, where he had worked since 2005. Prior to this, MICHAEL held roles at GE, Lloyd's Bank and United Airlines. MICHAEL has experience managing manufacturing, supply chain, and maintenance, repair and overhaul operations. MONTY LUTZKER - Vice President Business Development & Marketing MONTY LUTZKER joined Smiths Detection in 2012 from General Electric where he filled a number of executive roles including that of global sales head for GE Digital Energy. Prior to his role at Digital Energy, LUTZKER was a sales leader at GE Homeland Protection. ALAIN MCINNES - Chief Financial Officer ALAIN MCINNES joined Smiths Group in 2006, holding a number of positions. He was appointed Smiths Detection's Chief Financial Officer in August 2017. Prior to joining Smiths Group, ALAIN worked for 9 years at British Airways. HENRIK AKERSON, Vice President of Global Operations HENRIK AKERSON joined Smiths Detection in August 2016 as Vice President of Global Operations. Prior to joining, Henrik worked at Gardner Denver Inc., where most recently, he was the Operations Director for the EMEA region. Previously he worked for IMI plc and held a number of roles spanning operations and business development. HENRIK is an expert in production, quality management logistics and manufacturing engineering. He holds an MSc in Mechanical Engineering from Luleå University of Technology (LUT). ADAM RAMSAY, Divisional General Counsel ADAM RAMSAY was appointed Divisional General Counsel in May 2015, having been interim in that role since November 2014. Prior to that Adam was General Counsel of Edwards Group Limited until June 2014, a NASDAQ listed global high technology manufacturer in the semiconductor and industrial sectors, until its sale to Atlas Copco in early 2014. ADAM has held senior in house roles in a number of public and private equity owned businesses in a variety of sectors including Oil & Gas, engineering and outsourcing working for companies such as BG Group, Babcock International and MITIE Group. ADAM is a qualified solicitor. DIANA HOUGHTON, Vice President Strategy & Marketing DIANA HOUGHTON was appointed as Director of Strategy in November 2013. DIANA is a corporate development and strategy specialist with broad experience of the consumer goods, retail and leisure retail sectors and also possesses extensive corporate finance expertise. She spent six years as the Corporate Development Director of Allied Domecq before working as a consultant to a number of companies, investment banks and private equity houses. She is a non-executive director and chair of the Audit Committee for Thorntons plc. Other appointments include a senior advisory role with the National Audit Office. SHAN HOOD, Vice President Product & Technology SHAN HOOD joined Smiths Detection in February 2014 as Vice President of the new Product & Technology group, on an interim basis, having moved from the Flex-Tek division of Smiths Group. He joined Flex-Tek (then Flexible Technologies) in 1986 as a mechanical engineer and was appointed General Manager of its Industrial Division in 1994. He subsequently held the role of VP - Sales & Marketing for Flex-Tek before his appointment, in 2001, into his previous role as VP - Business Development. He was responsible for the development of Flex-Tek's strategic goals, vision, and growth initiatives. KINI PATHMANATHAN, Vice President of Human Resources KINI PATHMANATHAN joined Smiths Detection in April 2017 as Vice President of Human Resources. Prior to joining, KINI worked at Thales where she held a number of senior HR roles; most recently as Vice President of Human Resources for their UK business. KINI holds a BEng in mechanical engineering from Queen Mary, University of London, and an MBA from Aston University Business School. Smiths Detection, Inc. has been established to distinguish its operations from its foreign parent through a Special Security Agreement between the U.S. Government, Smiths Detection, Inc. and Smiths Detection, LLC. Under the agreement Smiths Detection, Inc. has outside directors who, in conjunction with other U.S. based board members, make up a Government Security Committee. The Government Security Committee is responsible for oversight of the corporation's compliance with U.S. Government Security and Export regulations, and meets regularly with the Defence Security Service (DSS). Smiths Detection, Inc. is responsible for the execution of specialized products and programs for groups such as the US Department of Defense and Homeland Security Agencies. DAVID MOOREHOUSE, Interim President of SDI DAVID (DAVE) MOOREHOUSE is the Interim President of SDI. He also currently holds the position of President of Smiths Interconnect, Inc. which is an entity within the Smiths Interconnect division that performs classified work for U.S. government customers and operates under a SSA. DAVE joined Smiths in 2013 in this role. DAVE has over 25 years of a military/defense experience in various technical and leadership roles. Prior to joining Smiths, DAVE was the General Manager of Nurad Technologies (Cobham) for six years, where he had P&L responsibility over antenna/radome products for military markets operating under a SSA. Prior to that, DAVE held various leadership and technical roles at Cobham, Molded Fiberglass, M.C. Gill Corporation, Hexcel and Pratt Whitney. DAVE has a B.S in Mechanical Engineering from Milwaukee School of Engineering, an M.S. in Mechanical Engineering from Michigan State University and a MBA in Management from St. Joseph's University. SMITHS DETECTION CORPORATE BROCHURE Speak to Our Sales Team Ask us a Question Submit your question and we'll get back to you as soon as possible.",
    "Product Services The Americas As the premier provider of high tech security devices, our Product Services team is uniquely placed to assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Product Specialists Smiths Detection Service Operations, The Americas has created a group called Product Specialists. These individuals lead their product or product line as the top technical authority within Service Operations. The Product Specialist serves as the key expert resource to other Service team members, as well as the technical interface between Service Operations and Sales & Marketing, Research & Development and Product Management. Consulting Our service organization can provide you with various consulting services to assist you with addressing your security concerns. We offer various assistance including Site Security as well as First Responder consulting. Project Management Customers can receive the added attention of a dedicated Project Manager to assist with any special needs that they may have with their security equipment. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Radiation Safety & Regulatory Compliance Most State Radiation Control Agency regulations require owners of x-ray generating devices to register their unit(s) with their respective State agency. Smiths Detection can provide your site with a complete understanding of the registration process as well as the additional requirements that are called for by your respective state. Smiths Detection's radiation safety and regulatory compliance staff are experts in this field. Our Radiation Safety Training programs will provide your staff with the necessary knowledge to safely operate your equipment and can customize an entire radiation protection program specifically for you that will meet all state regulatory requirements for owning and operating your Smiths Detection x-ray machine. Leasing finance about a leasing finance program from our partner Amsource Capital. For North America leasing information, . For Latin America leasing information, . EMEA Our Product Services team can assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Service Consulting Our service organization can provide you with various consulting services to assist you with addressing your security concerns. Project Management Our team of experienced and highly specialized Project Managers assists with the planning and implementation of complex customized solutions. They fully supervise the installation of integrated security equipment in order to achieve optimum performance of your security systems. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Individualized Services Special applications require customized solutions. Smiths Detection is ready to meet your security needs. Asia Pacific Product services Service consulting Project management Individualized services As the premier provider of high tech security devices, our Product Services team is uniquely placed to assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Smiths Detection Service Operations, The Americas has created a group called Product Specialists. These individuals lead their product or product line as the top technical authority within Service Operations. The Product Specialist serves as the key expert resource to other Service team members, as well as the technical interface between Service Operations and Sales & Marketing, Research & Development and Product Management. Our service organization can provide you with various consulting services to assist you with addressing your security concerns. We offer various assistance including Site Security as well as First Responder consulting. Customers can receive the added attention of a dedicated Project Manager to assist with any special needs that they may have with their security equipment. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Radiation Safety & Regulatory Compliance Most State Radiation Control Agency regulations require owners of x-ray generating devices to register their unit(s) with their respective State agency. Smiths Detection can provide your site with a complete understanding of the registration process as well as the additional requirements that are called for by your respective state. Smiths Detection's radiation safety and regulatory compliance staff are experts in this field. Our Radiation Safety Training programs will provide your staff with the necessary knowledge to safely operate your equipment and can customize an entire radiation protection program specifically for you that will meet all state regulatory requirements for owning and operating your Smiths Detection x-ray machine. Leasing finance about a leasing finance program from our partner Amsource Capital. For North America leasing information, . For Latin America leasing information, . Our Product Services team can assess your site and offer strategies to enhance and achieve the level of security required for your location. Smiths Detection is available to assist customers with any aspect of their business where security services are required. Our service organization can provide you with various consulting services to assist you with addressing your security concerns. Our team of experienced and highly specialized Project Managers assists with the planning and implementation of complex customized solutions. They fully supervise the installation of integrated security equipment in order to achieve optimum performance of your security systems. We can combine our varied support measures as needed to assure our customers with a seamless security operation. Special applications require customized solutions. Smiths Detection is ready to meet your security needs. Send a support request Fill in your details below, and we'll get back to you just as soon as we can. Thank you."
  ]
}