{
  "company": "www.id-pal.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3333333333333333,
    "framing_surveillance": 0.0,
    "framing_market": 0.6666666666666666,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1
    }
  },
  "sample_docs": [
    "The Solution How It Works Key Features API Integration Pricing Resources Use Cases Case Studies Company About Team Careers FAQ See How It Works! Customer Onboarding. Made Easy. Our digital KYC solution enables businesses to verify the identity of clients quickly and easily. Through our mobile app and web portal businesses can capture, verify and store customer ID information in just a few simple steps. Using the ID-Pal app, your clients can capture and securely submit standard ID documents directly from their smartphone or tablet, anytime, anywhere, in seconds - reducing drop-off rate and improving the customer experience. Through the ID-Pal portal, technical and manual checks are run to authenticate the ID documents. Comprehensive Customer Due Diligence reports are then generated and stored securely, so your compliance records are complete and easily accessible. Simple: Submitting ID documentation is only a few clicks away using our user-friendly ID-Pal App. Secure: Customer can provide business with standard identity documents via a secure HTTPS connection. Convenient: Identity information can be submitted anytime, anywhere in seconds. Efficient: Digitised and streamlined identity verification process saves the business time and frees up internal resources. Effective: Workflow management solution uses industry-leading technologies to verify and authenticate every customer submission. Secure: Identity documentation is submitted and stored securely, with CDD reports accessible 24/7. Simple: Submitting ID documentation is only a few clicks away using our user-friendly ID-Pal App. Secure: Customer can provide business with standard ID documents via a secure HTTPS connection. Convenient: Relevant ID information can be submitted anytime, anywhere in seconds. Efficient: Digitised and streamlined process saves the business time and frees up internal resources. Efective: Workflow management solution ensures a comprehensive suite of verification checks is applied rigorously and consistently. Secure: ID documentation is submitted and stored securely.",
    "A solution that blends 100% AI-Powered Identity Verification technology with robust compliance for seamless customer onboarding. ID-Pal is unique as an identity verification provider as we use pure AI, not people, to verify identities in real time. We leverage the security and accuracy this offers to combat AI-fraud with AI-powered solutions. Identity verification providers using humans as part of the process can be exposing your business to hidden risks and inefficiencies. Click on each section to reveal the truth. Hover over the tiles to reveal the hidden truths. Most providers rely partially, or fully, on humans. Introducing risk and inherent delays to your onboarding processes. Using pure AI to verify identities offers accurate results and enables greater efficiencies. Hover over the tiles to reveal the hidden truths. Manual verification leads to significant delays. Customers expect identity verification to take seconds, not hours. Removing people from the process and using pure AI delivers results in seconds. Hover over the tiles to reveal the hidden truths. How accepted is the risk that your provider (and potentially their vendors) have access to your customer data? Zero Access to Data Zero Access to Data We have zero access to your customer data at all times. Our Approach to ID Verification Designed for seamless integration, ID-Pal is 100% AI-powered for real-time identity verification and robust compliance. With zero access to customer data, ID-Pal leverages AI to deploy a unique blend of biometric, document and databases checks. With automated decisioning and smart workflows, configure the journey to your business needs and enjoy efficiencies at scale. Future-proof identity verification processes, transform your onboarding experience, and seamlessly navigate AML and KYC compliance with ID-Pal. Global Coverage, Accurate Results Accuracy on Verification Results Multi-Layered Digital Identity Verification ID-Pal performs instant identity document verification , biometric facial matching , liveness detection and address verification checks. With a user-friendly interface and seamless integration options, easily add ID-Pal into existing systems. Our Identity Verification Solutions Explore a comprehensive suite of identity verification solutions, designed to meet your AML and KYC compliance needs. From real-time ID verification to address e-verification, we offer tailored, industry-leading tools for seamless onboarding and robust compliance. Digital Identity Verification allows for faster customer onboarding, stops fraud at source and automates your audit trail. Eliminate manual, time-consuming processes, strengthen your compliance framework and elevate the onboarding experience of your customers. Manual identity verification carries risks and takes time. Fraudsters use advanced techniques like AI to trick a human eye. We can perform an instant 70-point check per document, to ensure authenticity and confidently reject suspicious submissions. Our unique identity verification process also verifies the facial image present, via Facial Matching checks. Unburden your team from the challenge of accurate identity verification. Our cutting-edge facial matching technology confirms that the face in a submitted ID matches the person present. A 50-point biometric facial comparison instantly maps features as part of our unique multi-layer verification process. Liveness Checks confirm a real, live person is completing your identity verification process. ID-Pal Liveness Testing instantly assesses micro-variations in fraudulent techniques. This is why our Liveness Testing technology is independently certified to prevent the latest presentation attacks. Shorten customer onboarding times with automatic address verification of each submission. ID-Pal verifies an individual's Name and Address against multiple databases during onboarding, ensuring a clear Full Address Match & removing the need for Proof of Address. Onboard with confidence. Prevent legal and financial penalties associated with high-risk individuals and entities. Sanctions screening adds an additional safeguarding layer for your business against money laundering and fraud, while ensuring seamless AML and KYC compliance and reducing false-positives. Check out all our solutions With ID-Detect enabled, detect up to 99% of fraudulent documents* . ID-Pal has zero access to customer data at every stage. Our platform is also fully encrypted when the data is in transit or at rest. Givng your customers confidence in how your organisation prioritises and protects their personal data. We've built a customisable, compliant identity verification and AML screening solution to be integrated into any business same-day via our plug-n'-play offering or via our lighter, faster API/SDK. End-to-end solution that can be customised and deployed the same day. Set up in minutes ID-Pal's identity verification platform is pre-built with core products designed to streamline processes for compliance, risk, customer service, UX, fraud, and AML teams. Each technology in the platform is built on the same underlying principles: security and compliance, while the front-end is designed that you can configure each stage of the customer journey. Go live in just one day with simple, secure and convenience identity verification What our clients say... What made the difference is how easy it was to deploy ID-Pal. We needed something that can seamlessly integrate with existing systems and transform our onboarding experience. Through our alliance with ID-Pal, we have created an app that helps businesses verify the identities of their customers easily, securely, and conveniently. ID-Pal has the technology to support our aims and has helped us to quickly offer compliant, reliable virtual individual verification at a time when we needed it most. We work together with ID-Pal to further enhance our on-boarding experience, bringing efficiencies to our clients and partners whilst also achieving our regulatory compliance objectives. Using ID-Pal makes compliance and onboarding seamless for Lerex. The results are detailed and clear, allowing us to turn applications around in a timely manner and onboard customers smoothly. ID-Pal's solution has not only saved us a significant amount of money but has also dramatically improved customer satisfaction by creating a smoother, more secure onboarding process. Discover why firms use ID-Pal for Automated Address Verification Case Study Enhancing Trust & Efficiency: Ardan International's Journey to Seamless Digital Onboarding › Enhancing Trust & Efficiency: Ardan International's Journey to Seamless Digital Onboarding Case Study Revolutionizing Mortgage Approvals with ID-Pal and OnlineApplication.com › Revolutionizing Mortgage Approvals with ID-Pal and OnlineApplication.com Case Study KWETB cuts Onboarding Time by over 90% using ID-Pal › KWETB cuts Onboarding Time by over 90% using ID-Pal Certified and Industry Accredited Find out how we can help your business grow See our success stories"
  ]
}