{
  "company": "www.facenote.me",
  "dominant_topics": [
    0,
    1,
    -1
  ],
  "topic_counts": {
    "0": 12,
    "1": 4,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.392156862745098,
    "framing_surveillance": 0.0,
    "framing_market": 0.6078431372549019,
    "num_docs": 18
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 12,
      "1": 4
    }
  },
  "sample_docs": [
    "What is Facenote ? Facenote is a face recognition platform that enables your customers and employees to access, pay, and get rewards in a highly private and contactless way Our platform guarantees complete privacy Minted as a Non Fungible Token. Minted as a Non Fungible Token. Assigned to your own wallet. Assigned to your own wallet. No personal information stored. Never. No personal information stored. Never. Minted as a Non Fungible Token. Minted as a Non Fungible Token. Assigned to your own wallet. Assigned to your own wallet. No personal information stored. Never. No personal information stored. Never. Enable full contactless experiences Our technology in a nutshell Your selfie and id are matched as a face profile and minted as an NFT Your face identity completely owned by you Your anonymized face profile is synced locally to your approved locations On recognition, an action intent is created for payment, access or rewards The action intent is pushed ( API call) to the location, matching your id and KYC data Payment, access or rewards completed Our technology in a nutshell Your selfie and id are matched as a face profile and minted as an NFT Your face identity completely owned by you Your anonymized face profile is synced locally to your approved locations On recognition, an action intent is created for payment, access or rewards The action intent is pushed ( API call) to the location, matching your id and KYC data Payment, access or rewards completed How can you use your Face Token as a customer? How can businesses use Face Token for employees?",
    "Reimagining the way people authenticate their identity At Facenote , we aim to enable organizations creating outstanding identity verification processes in a completely secure and fully compliant way We strongly believe that user data should always remain safe and private, ensuring complete sovereignty over their identity. Following this philosophy, we've built the first platform that enables organizations to create outstanding identity verification experiences in a completely secure way. While promoting zero knowledge proof ways of identification, we provide the building blocks for organizations to add contactless identity verification into their existing customer flows No Pll or selfies thus enabling cross-border compliance Face Tokens can operate independent of user devices User consent on the blockchain, guaranteeing control and user privacy",
    "Facenote in Miami – Lincoln Road and Dadeland Mall ultra personalized shopping Facenote in Miami – Lincoln Road and Dadeland Mall ultra personalized shopping https://facenote.me/wp-content/uploads/2022/09/lincoln1_blog.jpg 1210 588 Facenote Facenote https://facenote.me/wp-content/uploads/2022/09/lincoln1_blog.jpg December 21, 2017 March 28, 2023 Hello shoe-lovers! We are in Miami at Lincoln Road and Dadeland mall recognizing you! Since October 2018 Facenote is working with Melissa Shoes USA in Miami on a Facial recognition innovative implementation. Lots of shoe lovers are passing by the storefront and interacting with our technology. Some of them are having a super good time!!! ☺☺. How does it work? Easy. When a customer pass by Melissa Store she or he is invited to register to be recognized at the store. She or he can text (sms) a selfie from their mobile phone, or even share it on Instagram, and, 10 seconds later ….we can greet them by name, and reward them. By connecting to the existing CRM, the associates can know their previous purchases and provide a better buying experience. https://www.instagram.com/p/BcfCrtvHc2m/?taken-by=facenote Melissa's customers are having lot of fun trying this amazing ultra personalized experience. Facenote in Miami – Lincoln Road and Dadeland Mall ultra personalized shopping Hello shoe-lovers! We are in Miami at Lincoln Road and Dadeland mall recognizing you! Since October 2018 Facenote is working with Melissa Shoes USA in Miami on a Facial recognition innovative implementation. Lots of shoe lovers are passing by the storefront and interacting with our technology. Some of them are having a super good time!!! ☺☺. How does it work? Easy. When a customer pass by Melissa Store she or he is invited to register to be recognized at the store. She or he can text (sms) a selfie from their mobile phone, or even share it on Instagram, and, 10 seconds later ….we can greet them by name, and reward them. By connecting to the existing CRM, the associates can know their previous purchases and provide a better buying experience. Melissa's customers are having lot of fun trying this amazing ultra personalized experience.",
    "Secure and user-friendly: how Face Recognition is revolutionizing Fraud Prevention with 2FA Secure and user-friendly: how Face Recognition is revolutionizing Fraud Prevention with 2FA Secure and user-friendly: how Face Recognition is revolutionizing Fraud Prevention with 2FA https://facenote.me/wp-content/uploads/2023/02/high.jpeg 1400 787 Facenote Facenote https://facenote.me/wp-content/uploads/2023/02/high.jpeg February 22, 2023 March 28, 2023 In recent years, Face Recognition technology has become increasingly prevalent, with a wide range of applications in various industries. One of the most promising applications of this technology is in the field of fraud prevention , where it can be used as an effective second factor authentication (2FA) measure to improve security . Traditional authentication methods like usernames and passwords have proven to be insufficient in many cases, leading to security breaches and fraudulent activities. To address this issue, many companies have implemented 2FA measures, which require users to provide a second form of authentication in addition to their password. The second factor authentication can be something like a security token, SMS verification code, or biometric authentication like a fingerprint or Face Recognition. While all of these methods are effective, Face Recognition has the potential to be the most user-friendly and secure option. One of the biggest advantages of Face Recognition is that it is highly accurate, with error rates that are much lower than other biometric authentication methods like fingerprints. This means that the chances of an unauthorized person being able to access a user's account or device are significantly reduced. Additionally, Face Recognition can be highly convenient for users, as it doesn't require them to carry around any additional hardware, like a security token, or to remember any additional passwords or codes. Instead, the user simply needs to show their face to the camera to gain access. Moreover, Face Recognition is difficult to spoof or fool . Advanced algorithms can detect if a user is attempting to trick the system with a photo, video or mask. This makes it an extremely reliable security measure that can help to prevent fraud and unauthorized access. In conclusion, Face Recognition technology is a powerful tool for improving fraud prevention and security. As a 2FA measure, it provides a user-friendly and highly secure option for authenticating users, reducing the risk of unauthorized access to sensitive data or systems. As this technology continues to evolve and become more widespread, it will become increasingly important for businesses to embrace face recognition in order to stay competitive in the rapidly changing world of supply chain management. Would you like to know how Facenote is helping prevent fraud in payments? Learn about our technology for identity validation and traceability here. Secure and user-friendly: how Face Recognition is revolutionizing Fraud Prevention with 2FA In recent years, Face Recognition technology has become increasingly prevalent, with a wide range of applications in various industries. One of the most promising applications of this technology is in the field of fraud prevention , where it can be used as an effective second factor authentication (2FA) measure to improve security . Traditional authentication methods like usernames and passwords have proven to be insufficient in many cases, leading to security breaches and fraudulent activities. To address this issue, many companies have implemented 2FA measures, which require users to provide a second form of authentication in addition to their password. The second factor authentication can be something like a security token, SMS verification code, or biometric authentication like a fingerprint or Face Recognition. While all of these methods are effective, Face Recognition has the potential to be the most user-friendly and secure option. One of the biggest advantages of Face Recognition is that it is highly accurate, with error rates that are much lower than other biometric authentication methods like fingerprints. This means that the chances of an unauthorized person being able to access a user's account or device are significantly reduced. Additionally, Face Recognition can be highly convenient for users, as it doesn't require them to carry around any additional hardware, like a security token, or to remember any additional passwords or codes. Instead, the user simply needs to show their face to the camera to gain access. Moreover, Face Recognition is difficult to spoof or fool . Advanced algorithms can detect if a user is attempting to trick the system with a photo, video or mask. This makes it an extremely reliable security measure that can help to prevent fraud and unauthorized access. In conclusion, Face Recognition technology is a powerful tool for improving fraud prevention and security. As a 2FA measure, it provides a user-friendly and highly secure option for authenticating users, reducing the risk of unauthorized access to sensitive data or systems. As this technology continues to evolve and become more widespread, it will become increasingly important for businesses to embrace face recognition in order to stay competitive in the rapidly changing world of supply chain management. Would you like to know how Facenote is helping prevent fraud in payments? Learn about our technology for identity validation and traceability here.",
    "Facenote at San Diego, CA – NACDS Total Store Expo Vision 2028 Facenote at San Diego, CA – NACDS Total Store Expo Vision 2028 https://facenote.me/wp-content/uploads/2022/09/sheilaNACDS_blog.jpg 419 419 Facenote Facenote https://facenote.me/wp-content/uploads/2022/09/sheilaNACDS_blog.jpg September 3, 2017 March 28, 2023 Last month, we were invited to showcase our technology at the NACDS Total Store Expo, Vision 2028 (http://tse.nacds.org/plan/vision-2028) in San Diego, California. The claim of the Vision 2028 area of the expo was \"Insights into the future of chain and retail pharmacy\", so our idea was to show how facial recognition can be used to improve customer experience inside the stores, as well as explore other ideas for the health industry. We spent three amazing days discussing with major health industry companies, like Walgreens, CVS as well as hundreds of representatives of pharmacies across US and the world, and showing how technology can be used to provide a new experience in that area. Our Creative Director at NACDS Vision 2028 Facenote recognition technology in action Also, we were invited to take part with three more tech startups in the insight session panel \"TECHNOLOGIES THAT ARE TRANSFORMING THE RETAIL AND CPG INDUSTRIES\", with Pano Anthos, Managing Director at XRCLabs. Insight Session Panel at NACDS Vision 2028 Pano Anthos Managing Partner at XRCLabs and Eduardo Rivara CEO at Facenote Insight Session: Technology Transforming Retail & CPG Thanks a lot, specially Steve Perlowski for a great experience at NACDS Total Store Expo. We hope to see you back next year. Facenote at San Diego, CA – NACDS Total Store Expo Vision 2028 Last month, we were invited to showcase our technology at the NACDS Total Store Expo, Vision 2028 (http://tse.nacds.org/plan/vision-2028) in San Diego, California. The claim of the Vision 2028 area of the expo was \"Insights into the future of chain and retail pharmacy\", so our idea was to show how facial recognition can be used to improve customer experience inside the stores, as well as explore other ideas for the health industry. We spent three amazing days discussing with major health industry companies, like Walgreens, CVS as well as hundreds of representatives of pharmacies across US and the world, and showing how technology can be used to provide a new experience in that area. Our Creative Director at NACDS Vision 2028 Facenote recognition technology in action Also, we were invited to take part with three more tech startups in the insight session panel \"TECHNOLOGIES THAT ARE TRANSFORMING THE RETAIL AND CPG INDUSTRIES\", with Pano Anthos, Managing Director at XRCLabs. Insight Session Panel at NACDS Vision 2028 Pano Anthos Managing Partner at XRCLabs and Eduardo Rivara CEO at Facenote Insight Session: Technology Transforming Retail & CPG Thanks a lot, specially Steve Perlowski for a great experience at NACDS Total Store Expo. We hope to see you back next year."
  ]
}