{
  "company": "www.entrust.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "Consumer Authentication & Fraud Detection A major Asia-Pacific financial institution saved more than $1 million a year by implementing Entrust's affordable solution Entrust can save you $275,000 versus RSA tokens ... with as few as 5,000 users. Go green for less green Entrust EV SSL Certificates now only $199 a year. Budget-Friendly PCI Compliance Solutions Cost-effective strategies for compliance with the PCI Data Security Standard. Global Wind Turbine Manufacturer Abandons Tokens for Entrust Versatile Authentication Platform Entrust Named Finalist in 2010 SC Magazine Awards for Best Multi- and Second-Factor Authentication Solution 12 Critical Tips for Safe Online-Shopping During the Holidays On Demand Webcast with Featured Analyst Firm, Gartner: Fast & the Fraudulent — Actions Financial Institutions Can Take to Defeat Online Fraud Enroll in our free trials for Entrust Managed Services PKI or Entrust IdentityGuard for multifactor authentication. It's simple and risk-free. Entrust IdentityGuard 60-day Trial Managed Services PKI 60-day Trial The Government of Finland selects Entrust for Extended Access Control (EAC) ePassports. More Customer Stories Governments Entrust provides government-strength solutions for authentication, encryption and digital signature capabilities to help maintain data privacy, streamline workflow and enable access. Find Out More Entrust provides government-strength solutions for authentication, encryption and digital signature capabilities to help maintain data privacy, streamline workflow and enable access. Large Enterprises Entrust solutions are both affordable and scalable to help solve the security challenges of large enterprises, organizations and financial institutions. Find Out More Entrust solutions are both affordable and scalable to help solve the security challenges of large enterprises, organizations and financial institutions. Small & Medium Enterprises Entrust provides affordable security solutions for small- and medium-sized enterprises with 1,000 or fewer employees. Find Out More Entrust provides affordable security solutions for small- and medium-sized enterprises with 1,000 or fewer employees. On Demand Webcast with featured analyst firm Gartner Fast & the Fraudulent — Actions Financial Institutions Can Take to Defeat Online Fraud View the Gartner Magic Quadrant for Web Detection Enterprise Authentication Whether via our versatile authentication platform or digital certificates, Entrust provides proven solutions for strong enterprise authentication. Find Out More Whether via our versatile authentication platform or digital certificates, Entrust provides proven solutions for strong enterprise authentication. Consumer Authentication Entrust offers affordable strong authentication for organizations, financial institutions and governments of all sizes. Find Out More Entrust offers affordable strong authentication for organizations, financial institutions and governments of all sizes. Fraud Detection Entrust's real-time fraud detection solution for financial institutions is affordable to implement and manage. Find Out More Entrust's real-time fraud detection solution for financial institutions is affordable to implement and manage. Encryption Entrust's Entelligence suite enables comprehensive encryption solutions for e-mail, network folders, authentication servers and enterprise desktops. Find Out More Entrust's Entelligence suite enables comprehensive encryption solutions for e-mail, network folders, authentication servers and enterprise desktops. Digital Signatures Powered by PKI technology, digital signatures are widely recognized as the best practice for ensuring digital verification for electronic transactions. Find Out More Powered by PKI technology, digital signatures are widely recognized as the best practice for ensuring digital verification for electronic transactions. ePassport/Citizen ID Trusted by governments across the globe, Entrust is the leader for BAC and EAC ePassport deployments, as well as citizen and national identification solutions. Find Out More Trusted by governments across the globe, Entrust is the leader for BAC and EAC ePassport deployments, as well as citizen and national identification solutions. Find security for ... PCI Compliance Red Flag Rules HSPD-12 First Responder Authentication Anti-phishing Email Compliance E-Statement Delivery VPN/Remote Access Shared Folders Web Services Transactions Web Sites Web Authentication © Copyright 2009 Entrust ® . . Entrust - One Lincoln Centre - 5400 LBJ Freeway, Suite 1340 - Dallas, Texas USA 75240 Multifactor Authentication, Fraud Detection and Digital Certificate Solutions Entrust authentication security , fraud detection and digital certificate solutions form the foundation of well protected networks for organizations around the world. Concern over securing networks, protecting identities, detecting fraud and providing for file encryption has only escalated as the sophistication of cyber attacks has grown. Entrust provides robust cryptographic and identity solutions, digital certificates PKI, two factor authentication, fraud detection and user authentication products that deliver strong security and great value. PKI (or public key infrastructure ) is well established as a security gold standard. A digital certificate issued from a PKI certification authority can be used for multiple security functions including strong user authentication , digital signatures and email encryption . Our security solutions arm network administrators with powerful authentication, fraud detection and encryption software to protect networks, safeguard data, and build consumer confidence in doing business online. About Fact Sheet History Executives Careers Awards Third-Party Validation Office Locations News/Events Products By Category Entrust Authority Security Manager Optional Components Toolkits Managed PKI Service Entrust SSL Certificates Advantage SSL Certificates Extended Validation SSL Certificates Standard SSL Certificates Unified Communications Certificates Entrust Certificate Management Service Entrust Certificates for Adobe CDS Entrust Code Signing Certificates Entrust Entelligence Security Provider (ESP) Messaging Server (EMS) Group Share Entrust GetAccess Entrust IdentityGuard For Enterprise Authentication For Consumer Authentication Self-Service Server OTP Tokens Managed Services PKI Entrust Secure Transaction Platform Entrust TransactionGuard Entrust TruePass Entrust USB Tokens Products A-Z Developers Entrust Authority Security Manager Optional Components Toolkits Managed PKI Service Entrust SSL Certificates Advantage SSL Certificates Extended Validation SSL Certificates Standard SSL Certificates Unified Communications Certificates Entrust Certificate Management Service Entrust Certificates for Adobe CDS Entrust Code Signing Certificates Extended Validation SSL Certificates Entrust Certificate Management Service Entrust Certificates for Adobe CDS Entrust Code Signing Certificates Entrust Entelligence Security Provider (ESP) Messaging Server (EMS) Group Share Entrust IdentityGuard For Enterprise Authentication For Consumer Authentication Self-Service Server OTP Tokens Entrust Secure Transaction Platform Services Managed Services PKI Internet Security Consulting Deployment Services System Integration Services Training Customer Support",
    "Certificate Management Consolidated Certificate Issuance & Management Manage, authenticate, provision and revoke digital certificates for users, mobile devices, applications and machines. Consolidated Certificate Issuance & Management Manage, authenticate, provision and revoke digital certificates for users, mobile devices, applications and machines. Mobile Security Securing Mobile Identities & Devices Secure digital identities and mobile devices to strengthen security and simplify management. Securing Mobile Identities & Devices Secure digital identities and mobile devices to strengthen security and simplify management. Citizen eID Citizen eID The Most Trusted Identity Credentials Globally trusted solutions for citizen eID cards, ePassports, certificates and citizen authentication. Citizen eID The Most Trusted Identity Credentials Globally trusted solutions for citizen eID cards, ePassports, certificates and citizen authentication. Certificate Services Find, Issue & Manage Digital Certificates & Identities — all from the Cloud Reduce costs and streamline certificate management via Entrust's cloud-based services. Find, Issue & Manage Digital Certificates & Identities — all from the Cloud Reduce costs and streamline certificate management via Entrust's cloud-based services. SSL Certificates SSL Certificates Focused and dedicated, Entrust offers a complete portfolio of SSL digital certificates and proven services, management tools and solutions. Focused and dedicated, Entrust offers a complete portfolio of SSL digital certificates and proven services, management tools and solutions. Strong Authentication Strong Authentication & Identity Assurance Solutions Defend against targeted attacks via strong authentication and management solutions. Strong Authentication & Identity Assurance Solutions Defend against targeted attacks via strong authentication and management solutions. Physical & Logical Access One Solution, Total Access Convergence Integrate physical and logical access environments to consolidate management and improve ROI. Physical & Logical Access One Solution, Total Access Convergence Integrate physical and logical access environments to consolidate management and improve ROI. Security for Financial Institutions Security for Financial Institutions Security for Critical Infrastructure Security for Critical Infrastructure Security for Law Enforcement Security for Law Enforcement Entrust has been at the forefront of the identity-based digital information security market for nearly two decades. Our identity-based data security solutions secure governments, enterprises and financial institutions in more than 5,000 organizations spanning 85 countries. Proven across the world, our award-winning software authentication platform manages today's most secure identity credentials, solving our customers' digital security challenges in cloud and mobile security, physical and logical access, citizen eID initiatives, certificate management and SSL. Information security is critical to your organization's success. Get strong digital data security with Entrust's complete array of identity-based digital security solutions. Entrust has been at the forefront of the identity-based digital information security market for nearly two decades. Our identity-based data security solutions secure governments, enterprises and financial institutions in more than 5,000 organizations spanning 85 countries. Proven across the world, our award-winning software authentication platform manages today's most secure identity credentials, solving our customers' digital security challenges in cloud and mobile security, physical and logical access, citizen eID initiatives, certificate management and SSL. Information security is critical to your organization's success. Get strong digital data security with Entrust's complete array of identity-based digital security solutions."
  ]
}