{
  "company": "www.iproov.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 14,
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.125,
    "framing_surveillance": 0.3125,
    "framing_market": 0.5625,
    "num_docs": 15
  },
  "topic_timeline": {
    "20": {
      "-1": 14,
      "0": 1
    }
  },
  "sample_docs": [
    "The next generation of secure online authentication The next generation of secure online authentication iProov Verifier iProov Verifier authenticates users on smartphones, tablets and laptops - in fact on almost any device with a front-facing camera and a network connection. Using the very latest in Machine Learning technology, including Deep Learning, Verifier's servers check that the user's face corresponds to the face they originally enrolled. It's astonishingly accurate. We think authentication should be a frictionless step on the way to access data and transactions, and not an enforced photo session. So we show the user enough of their face for them to own the process, but abstract enough that they don't need to worry about getting a nice selfie portrait. Users can iProov in public and no one will notice. With Verifier, users can access their accounts across channels and platforms, so that organisations can build relationships with individuals, not their devices. iProov Verifier authenticates users on smartphones, tablets and laptops - in fact on almost any device with a front-facing camera and a network connection. Using the very latest in Machine Learning technology, including Deep Learning, Verifier's servers check that the user's face corresponds to the face they originally enrolled. It's astonishingly accurate. We think authentication should be a frictionless step on the way to access data and transactions, and not an enforced photo session. So we show the user enough of their face for them to own the process, but abstract enough that they don't need to worry about getting a nice selfie portrait. Users can iProov in public and no one will notice. With Verifier, users can access their accounts across channels and platforms, so that organisations can build relationships with individuals, not their devices. Securing the user iProov Verifier is a major breakthrough in assuring users' identities and protecting organisations from risk. Unique technology provides three essential, interlocking assurances: Verification: by matching the user's face with their enrolment, it prevents impersonation by someone else. Forgery Defence: by accurately detecting if a photo or screen image is being presented instead of the real thing, it prevents the use of stolen images. Replay Defence: Verifier immediately spots if a recording of a previous authentication session is being replayed in an attempt to use stolen genuine imagery. Together, these defences protect against the theft of user images, casual hacker attacks and large scale, brute force and malware campaigns. iProov Verifier is a major breakthrough in assuring users' identities and protecting organisations from risk. Unique technology provides three essential, interlocking assurances: Verification: by matching the user's face with their enrolment, it prevents impersonation by someone else. Forgery Defence: by accurately detecting if a photo or screen image is being presented instead of the real thing, it prevents the use of stolen images. Replay Defence: Verifier immediately spots if a recording of a previous authentication session is being replayed in an attempt to use stolen genuine imagery. Together, these defences protect against the theft of user images, casual hacker attacks and large scale, brute force and malware campaigns.",
    "Products Face Verifier Palm Verifier ID Matcher Bespoke Company Careers Leadership Team Advisors & Directors Simple and secure authentication Biometric authentication should be a frictionless experience providing security when accessing data and transactions in an online environment. iProov authenticates users on smartphones, tablets and laptops, in fact on almost any device with a front-facing camera and a network connection. Applications include onboarding, ID verification, border control, strong customer authentication and access control. Using the very latest in machine learning technology, including deep learning, iProov checks that the user's face corresponds to the face they originally enrolled. It's astonishingly accurate. iProov offers the following products to help you with your authentication and security requirements. Would you like to know more? Passionate about simplicity, focused on security Elizabeth House 39 York Road London SE1 7NQ United Kingdom Tel: +44 20 7993 2379 Email: This email address is being protected from spambots. You need d to view it.",
    "Products Face Verifier Palm Verifier ID Matcher Bespoke Company Careers Leadership Team Advisors & Directors Award-winning online biometric authentication Authentication is now as simple as a glance down, protecting your users on any device, anytime, anywhere. Our patented Flashmark technology flashes a sequence of colours illuminating the face and starting our unique, world leading face authentication process. Applications include onboarding, ID verification, border control, strong customer authentication and access control. iProov – because each face is unique. Who we've worked with How does it work? Behind the simplicity lies a wealth of pioneering technological advancements, creating the innovation of one-time biometrics. Verifier's patented Flashmark technology uses controlled illumination to detect presentation attacks. It determines liveness and mitigates against even highly sophisticated replica and replay attacks. Would you like to know more? Passionate about simplicity, focused on security WeWork 10 York Road London SE1 7ND United Kingdom Tel: +44 20 7993 2379 Email: This email address is being protected from spambots. You need d to view it.",
    "iProov.me iProov.me demonstrates a very simple cross-enterprise service. Enrol on your mobile in the native app or on the iProov.me website, and invite your friends. The identities are managed by iProov itself. Please note that you cannot use your iProov.me enrolment in any other demo. TRY IT NOW iProov.me demonstrates a very simple cross-enterprise service. Enrol on your mobile in the native app or on the iProov.me website, and invite your friends. The identities are managed by iProov itself. Please note that you cannot use your iProov.me enrolment in any other demo. Waterloo Banking Demo The Waterloo banking demo is a simple example of how Verifier can be used in a branded consumer-facing application. An open web site is available for use on laptops and on mobile devices equipped with the Verifier app; Waterloo Banking demo native apps, incorporating the Verifier SDKs, are available on request. Enrolment and the customer journey are entirely within the Waterloo environment; please note that the Waterloo enrolled identity cannot be used on any other service, including iProov.me. TRY IT NOW The Waterloo banking demo is a simple example of how Verifier can be used in a branded consumer-facing application. An open web site is available for use on laptops and on mobile devices equipped with the Verifier app; Waterloo Banking demo native apps, incorporating the Verifier SDKs, are available on request. Enrolment and the customer journey are entirely within the Waterloo environment; please note that the Waterloo enrolled identity cannot be used on any other service, including iProov.me. Push Demo Looking for an easy and secure physical access control or VPN login solution? Try iProov Verifier with Push - This is a demo of pushing iProov to an external device from your laptop/PC: 1. If you are a new iProov user, click on the Try It Now link below and enrol on your laptop/PC. If you have used iProov before, click on the Try It Now link below and proceed to 'Register Device'. 2. If you do not have the 'iProov Verifier' app on your phone or tablet, download it from the Apple App Store or Google Play Store (remember to allow notifications) . 3. Using Safari (on iOS) or Chrome (on Android) surf to https://demo.iproov.com/push 4. Click on tab 'Register Device' and iProov on this chosen device. 5. After successful enrolment and device registration, click on the 'Push Demo' tab in your laptop/PC browser and knock on the virtual door to request access. TRY IT NOW Looking for an easy and secure physical access control or VPN login solution? Try iProov Verifier with Push - This is a demo of pushing iProov to an external device from your laptop/PC: 1. If you are a new iProov user, click on the Try It Now link below and enrol on your laptop/PC. If you have used iProov before, click on the Try It Now link below and proceed to 'Register Device'. 2. If you do not have the 'iProov Verifier' app on your phone or tablet, download it from the Apple App Store or Google Play Store (remember to allow notifications) . 3. Using Safari (on iOS) or Chrome (on Android) surf to https://demo.iproov.com/push 4. Click on tab 'Register Device' and iProov on this chosen device. 5. After successful enrolment and device registration, click on the 'Push Demo' tab in your laptop/PC browser and knock on the virtual door to request access.",
    "Products Face Verifier Palm Verifier ID Matcher Bespoke Company Careers Leadership Team Advisors & Directors Finovate Europe 2019 iProov has been selected to demo at Finovate Europe 2019 . Finovate Europe comprises of one main conference day and two days of cutting-edge fintech demos delivered by industry and business leaders. After winning Best of Show during Finovate Europe 2018, iProov is thrilled to return to Finovate to demo our latest innovations. iProov is demoing at 15:45 on the 12th of February . You'll also find us at our designated stand on this day and we will be attending the rest of the conference. Event details: Date: 12-14th February 2019 Location: Tobacco Dock, The Dock Tobacco Quay, Wapping Lane, London, E1W 2SF iProov has been selected to demo at Finovate Europe 2019 . Finovate Europe comprises of one main conference day and two days of cutting-edge fintech demos delivered by industry and business leaders. After winning Best of Show during Finovate Europe 2018, iProov is thrilled to return to Finovate to demo our latest innovations. iProov is demoing at 15:45 on the 12th of February . You'll also find us at our designated stand on this day and we will be attending the rest of the conference. Event details: Date: 12-14th February 2019 Location: Tobacco Dock, The Dock Tobacco Quay, Wapping Lane, London, E1W 2SF 2019 S&T Cybersecurity and Innovation Showcase iProov is presenting at the 2019 S&T Cybersecurity and Innovation Showcase . This event is for the Department of Homeland Security (DHS) Science and Technology Directorate (S&T) to introduce its funded research projects to government and industry technology implementers. This year's theme is Solutions now, Innovations for the Future. Our CEO, Andrew Bud is demoing our world-leading solutions on day 2 (9th of January). He will also be delivering a presentation at 13:10 on day 3 (10th of January). You will be able to find iProov at Booth 35 throughout the event. Event details: Date: 8th - 10th January Location: Washington Marriott Wardman Park 2660 Woodley Road NW Washington, DC 2019 S&T Cybersecurity and Innovation Showcase iProov is presenting at the 2019 S&T Cybersecurity and Innovation Showcase . This event is for the Department of Homeland Security (DHS) Science and Technology Directorate (S&T) to introduce its funded research projects to government and industry technology implementers. This year's theme is Solutions now, Innovations for the Future. Our CEO, Andrew Bud is demoing our world-leading solutions on day 2 (9th of January). He will also be delivering a presentation at 13:10 on day 3 (10th of January). You will be able to find iProov at Booth 35 throughout the event. Event details: Date: 8th - 10th January Location: Washington Marriott Wardman Park 2660 Woodley Road NW Washington, DC International Security Expo iProov is exhibiting at the International Security Expo . This event is showcasing ground breaking and innovative security products and solutions. There will be 13 free conferences and workshops to attend as well as exciting demonstrations and product launches. We will be exhibiting at stand L13. Event details: Date: 28th - 29th of November Location: Grand Hall, Olympia London, Hammersmith Road, Kensington, London, W14 8UX iProov is exhibiting at the International Security Expo . This event is showcasing ground breaking and innovative security products and solutions. There will be 13 free conferences and workshops to attend as well as exciting demonstrations and product launches. We will be exhibiting at stand L13. Event details: Date: 28th - 29th of November Location: Grand Hall, Olympia London, Hammersmith Road, Kensington, London, W14 8UX The New Statesman Fintech Summit iProov is exhibiting at the New Statesman Fintech Summit . The Summit will explore fintech in relation to cyber security, investment patterns and international trading. Our CEO, Andrew Bud, will be presenting our genuine face verification and easy onboarding solutions at 14:20. Event details: Date: 8th November 2018 Location: Hilton Tower Bridge The New Statesman Fintech Summit iProov is exhibiting at the New Statesman Fintech Summit . The Summit will explore fintech in relation to cyber security, investment patterns and international trading. Our CEO, Andrew Bud, will be presenting our genuine face verification and easy onboarding solutions at 14:20. Event details: Date: 8th November 2018 Location: Hilton Tower Bridge Biometrics Congress iProov is sponsoring the Biometrics Congress in London. The Biometrics Institute is committed to providing an independent and impartial international forum for biometric discussion. Our CEO, Andrew Bud will be presenting iProov's world-class biometric solutions as a contributor on a panel discussion on the 17th October. Event details: Date: 17th-18th October 2018 Location: Grange Hotel St Pauls Read More iProov is sponsoring the Biometrics Congress in London. The Biometrics Institute is committed to providing an independent and impartial international forum for biometric discussion. Our CEO, Andrew Bud will be presenting iProov's world-class biometric solutions as a contributor on a panel discussion on the 17th October. Event details: Date: 17th-18th October 2018 Location: Grange Hotel St Pauls Elizabeth House 39 York Road London SE1 7NQ United Kingdom Tel: +44 20 7993 2379 Email: This email address is being protected from spambots. You need d to view it."
  ]
}