{
  "company": "www.creative-sols.com",
  "dominant_topics": [
    1,
    3,
    -1,
    2,
    6
  ],
  "topic_counts": {
    "1": 3,
    "3": 3,
    "-1": 2,
    "2": 1,
    "6": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "3": "vantage, development, document, ai, prioxis",
    "2": "demand, cctv, camera, ca, verkada",
    "6": "stripe, payments, think, really, payment"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0,
    "framing_market": 1.0,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "1": 3,
      "2": 1,
      "3": 3,
      "6": 1
    }
  },
  "sample_docs": [
    "iClock700 iClock700 is a Time and Attendance and access control terminal with incorporated fingerprint sensor, 3'5 TFT display and internal backup battery. Easy to install, and with a modern design, it is the perfect solution for all kinds of installations. With an easy menu management, and a protective fingerprint cover ensures safe handling of our new state of the art Biokey10 algorithm fingerprint sensor. It can connect to Time and Attendance management software by Ethernet or USB port (optionally it can work with WiFi and GPRS), and also operates on standalone mode, downloading data by USB pendrive. For access control, it allows time zones and groups and the relay can be connected to lock or external siren. We are top name in providing Time and attendance systems in Riyadh, Saudi Arabia. Features: Professional Firmware Version with advanced features New Push SDK 3.0 for Real Time and Cloud Systems Fully configurable Attendance Events Accrued balances management per user Pendrive download structure defined by user Multi verification by user Function keys definition by weekday and time range Access Control functions U160-C / U260-C U160-C / U260-C is a biometric fingerprint Time and Attendance terminal with 3'' TFT display. Easy to install, and with a modern design, it is the perfect solution for small installations. It incorporates the fingerprint Sensor. The color TFT display offer users easy menu management. It can connect to Time and Attendance management software by Ethernet or USB port, and also operate on standalone mode, downloading data by USB Pendrive. Optionally, it can incorporate a proximity reader. Features: Incorporates high precision Sensor for registering 10 fingerprints per user. Optionally can be installed with proximity reader EM, Mifare or HID. Allows communication with PC through Ethernet and USB port. Stores up to 30000 users and cards. Stores up to 100.000 log records. F18 F18 is an innovative biometric fingerprint reader for access control applications, offering unparalleled performance using an advanced algorithm for reliability, precision and excellent matching speed. The F18 features the fastest commercial-based fingerprint matching algorithm and high-performance, high-image quality optical fingerprint sensor. The device offers the flexibility to be installed standalone or with any third party panel that supports 26-bit Wiegand. All the operation can be done on the TFT-LCD. The fingerprint image will display on the screen . That will guide the user to put the finger on to proper position and increase the recognition rate. TCP/IP and RS485 are available that the device can be used in different network. Features: Fingerprint reader with durable and highly accurate optical sensor. 1 touch a-second user recognition. Stores 1,500 templates, 5,000 cards and 30,000 transactions. Reads Fingerprint and/or Card. Optional integrated smart card reader. Built-in Serial and Ethernet ports. Tamper-proofs switch and alarm outputs. Request-to-exit and alarm contacts. Audio-Visual indications for acceptance and rejection of valid/invalid fingers. Face Recognition iFace401/402 multi-biometric identification Time and Attendance and Access Control terminal adopts latest platform with algorithm and large capacity memory. With the upgraded hardware, it can now store up to 1200 face templates. It integrates with 800MHz high speed Multi-Bio processor and high definition infrared camera which enables user identification in the dark environment. Face and fingerprint multi-biometric identification methods make it more applicable (402). Multi-model communications consisting of RS232/485, TCP/IP and Wi-Fi/GPRS (optional) allow an extremely easy data management. Optional built-in 2000 mAh battery eliminates the trouble of power failure. Features: Identification methods include Face, Fingerprint (402)/RFID (401)/Password. Elegant ergonomic design. 4.3'' TFT touch screen is user-friendly and very intuitive. 6 user-defined function keys. Contact relays for door access control (wires to door strike or 3rd party panel). Web server management software via IE browser. Optional extendable scheduled-bell. Infra-red optical system enables user identification in poorly lit environments. Optional built-in battery backup provides approx 4 hours continuous operation. Optional built-in wireless Wi-Fi or GPRS for wireless communication. Built-in contacts for 3rd party electric lock, door sensor, alarm, exit button, or bell. Wiegand Output for connections to 3rd party access control panels iClock700 is a Time and Attendance and access control terminal with incorporated fingerprint sensor, 3'5 TFT display and internal backup battery. Easy to install, and with a modern design, it is the perfect solution for all kinds of installations. With an easy menu management, and a protective fingerprint cover ensures safe handling of our new state of the art Biokey10 algorithm fingerprint sensor. It can connect to Time and Attendance management software by Ethernet or USB port (optionally it can work with WiFi and GPRS), and also operates on standalone mode, downloading data by USB pendrive. For access control, it allows time zones and groups and the relay can be connected to lock or external siren. We are top name in providing Time and attendance systems in Riyadh, Saudi Arabia. Professional Firmware Version with advanced features New Push SDK 3.0 for Real Time and Cloud Systems Fully configurable Attendance Events Accrued balances management per user Pendrive download structure defined by user Multi verification by user Function keys definition by weekday and time range U160-C / U260-C is a biometric fingerprint Time and Attendance terminal with 3'' TFT display. Easy to install, and with a modern design, it is the perfect solution for small installations. It incorporates the fingerprint Sensor. The color TFT display offer users easy menu management. It can connect to Time and Attendance management software by Ethernet or USB port, and also operate on standalone mode, downloading data by USB Pendrive. Optionally, it can incorporate a proximity reader. Incorporates high precision Sensor for registering 10 fingerprints per user. Optionally can be installed with proximity reader EM, Mifare or HID. Allows communication with PC through Ethernet and USB port. Stores up to 30000 users and cards. Stores up to 100.000 log records. F18 is an innovative biometric fingerprint reader for access control applications, offering unparalleled performance using an advanced algorithm for reliability, precision and excellent matching speed. The F18 features the fastest commercial-based fingerprint matching algorithm and high-performance, high-image quality optical fingerprint sensor. The device offers the flexibility to be installed standalone or with any third party panel that supports 26-bit Wiegand. All the operation can be done on the TFT-LCD. The fingerprint image will display on the screen . That will guide the user to put the finger on to proper position and increase the recognition rate. TCP/IP and RS485 are available that the device can be used in different network. Fingerprint reader with durable and highly accurate optical sensor. 1 touch a-second user recognition. Stores 1,500 templates, 5,000 cards and 30,000 transactions. Reads Fingerprint and/or Card. Optional integrated smart card reader. Built-in Serial and Ethernet ports. Tamper-proofs switch and alarm outputs. Request-to-exit and alarm contacts. Audio-Visual indications for acceptance and rejection of valid/invalid fingers. iFace401/402 multi-biometric identification Time and Attendance and Access Control terminal adopts latest platform with algorithm and large capacity memory. With the upgraded hardware, it can now store up to 1200 face templates. It integrates with 800MHz high speed Multi-Bio processor and high definition infrared camera which enables user identification in the dark environment. Face and fingerprint multi-biometric identification methods make it more applicable (402). Multi-model communications consisting of RS232/485, TCP/IP and Wi-Fi/GPRS (optional) allow an extremely easy data management. Optional built-in 2000 mAh battery eliminates the trouble of power failure. Identification methods include Face, Fingerprint (402)/RFID (401)/Password. 4.3'' TFT touch screen is user-friendly and very intuitive. 6 user-defined function keys. Contact relays for door access control (wires to door strike or 3rd party panel). Web server management software via IE browser. Infra-red optical system enables user identification in poorly lit environments. Optional built-in battery backup provides approx 4 hours continuous operation. Optional built-in wireless Wi-Fi or GPRS for wireless communication. Built-in contacts for 3rd party electric lock, door sensor, alarm, exit button, or bell. Wiegand Output for connections to 3rd party access control panels",
    "Surveillance Solution A complete source for CCTV, IP Camera, Video Door Phones, Access Control, Intruder/Fire Alarm Systems. Our philosophy is Simple We are continuously investing great deal of time and money in R & D. This allows us to be very selective in the brands and products that we carry. We do not follow industry trends, but rather set them. We embrace products that are field tested and include a manufacturer's warranty. All our Solutions come equipped with cloud based remote viewing and Central Management System A complete source for CCTV, IP Camera, Video Door Phones, Access Control, Intruder/Fire Alarm Systems. Our philosophy is Simple We are continuously investing great deal of time and money in R & D. This allows us to be very selective in the brands and products that we carry. We do not follow industry trends, but rather set them. We embrace products that are field tested and include a manufacturer's warranty. All our Solutions come equipped with cloud based remote viewing and Central Management System",
    "Portfolio Success Creators Attendance Management System Objective PUNCTUALITY IS FIRST STEP TOWARDS SUCCESS Success Creators Company is one of the new successful organizations in Saudi Arabia that is 100% Saudi owned and operated. They provide services in food & beverage Industries, Business Consultation and the coffee world. REQUIREMENT FOR ATTENDANCE MANAGEMENT SOFTWARE: Hurdles and issues in managing attendance of the employees was a troublesome task at Success Creators While looking for a best possible solution, they approached Creative Solutions to get automated attendance software that could rectify and fix the problem areas. They needed to automate the whole attendance process for the employees, roaster planning, day offs, global holidays, attendance monitoring, device monitoring and different parameters. Requirements were as follows: Complete attendance management software. Hosting on Creative Solutions cloud. Machine for check-in & check-out. Required roster plans. Machine installation with POE solution. Training for employees. The dashboard should be globally accessible from the web. Other dashboard real time report customization. Attendance device to also act as access control system. Custom report to be used with their ERP system. IMPLEMENTATION: Creative solutions took the requirements as a challenge and successfully implemented the CreativeTime Attendance management software which changed and up-lifted the manual Attendance process. Implementation included : Automation was done to reflect the complete requirements from Success Creators, Ex: Roaster Planning, day offs, employee monitoring, Etc. Complete attendance management software was implemented on-prem. Multi-level customization was done to reflect the requirements made by the client. Machines were configured to sync with the attendance management software for data collection. Machines were powered by custom build P.O.E cable, as a power outlet was un-available at the installation location. Customization was also done as per client's requirement for the dashboard. Hosting was done on creative solutions cloud. Completed on 18-02-2021 Skills CSS3/ HTML5/ Microsoft .Net Client Success Creators You Are One Click Away Lets Talk About Your Next Project Let's discuss how we can help you achieve your goals CONTACT US Arabian Fal Attendance Management System Get In Touch Our goal is for you to succeed and that is the only way we can grow REACH OUT NOW! +966 59 345 3627 Success Creators Attendance Management System PUNCTUALITY IS FIRST STEP TOWARDS SUCCESS Success Creators Company is one of the new successful organizations in Saudi Arabia that is 100% Saudi owned and operated. They provide services in food & beverage Industries, Business Consultation and the coffee world. REQUIREMENT FOR ATTENDANCE MANAGEMENT SOFTWARE: Hurdles and issues in managing attendance of the employees was a troublesome task at Success Creators While looking for a best possible solution, they approached Creative Solutions to get automated attendance software that could rectify and fix the problem areas. They needed to automate the whole attendance process for the employees, roaster planning, day offs, global holidays, attendance monitoring, device monitoring and different parameters. Requirements were as follows: Complete attendance management software. Hosting on Creative Solutions cloud. Machine for check-in & check-out. Machine installation with POE solution. The dashboard should be globally accessible from the web. Other dashboard real time report customization. Attendance device to also act as access control system. Custom report to be used with their ERP system. IMPLEMENTATION: Creative solutions took the requirements as a challenge and successfully implemented the CreativeTime Attendance management software which changed and up-lifted the manual Attendance process. Automation was done to reflect the complete requirements from Success Creators, Ex: Roaster Planning, day offs, employee monitoring, Etc. Complete attendance management software was implemented on-prem. Multi-level customization was done to reflect the requirements made by the client. Machines were configured to sync with the attendance management software for data collection. Machines were powered by custom build P.O.E cable, as a power outlet was un-available at the installation location. Customization was also done as per client's requirement for the dashboard. Hosting was done on creative solutions cloud. CSS3/ HTML5/ Microsoft .Net Lets Talk About Your Next Project Let's discuss how we can help you achieve your goals Arabian Fal Attendance Management System Our goal is for you to succeed and that is the only way we can grow +966 59 345 3627",
    "Portfolio Saudi Media Systems Attendance Management System Objective PUNCTUALITY IS FIRST STEP TOWARDS SUCCESS Saudi Media Systems designs and integrates multimedia systems and advanced technology facilities. We provide a full range of design, engineering, and technical support services that extend from project concept, through implementation, training and operational support REQUIREMENT FOR ATTENDANCE MANAGEMENT SOFTWARE Saudi Media Systems was facing huge problems with their manual attendance. They approached Creative solutions to automate attendance issues. They needed automation for all employees which includes roaster planning, day offs, global holidays, attendance monitoring, device monitoring and different parameters along with access control, suitable for hospitality industries. Requirements were as follows: Complete attendance management software. On-Prem solution. Machine for login & Machine for logout. Minor customization in software. Machine installation location lacked power outlet. The dashboard should be globally accessible from the web. IMPLEMENTATION Creative solutions took the requirements as a challenge and successfully implemented the CreativeTime Attendance management software which changed and up-lifted the legacy Saudi Media Systems Attendance software. Implementation included : Automation was done to reflect the complete requirements from Saudi Media Systems, Ex: Roaster Planning, day offs, employee monitoring, Etc. Complete attendance management software was implemented on-prem with minor customization. Integration of reports as per requirement. Completed on 10-02-2016 Skills CSS3/ HTML5/ Microsoft .Net Client Saudi Media Systems You Are One Click Away Lets Talk About Your Next Project Let's discuss how we can help you achieve your goals CONTACT US More portfolio ADDAR Chemicals Attedance Management System Get In Touch Our goal is for you to succeed and that is the only way we can grow REACH OUT NOW! +966 59 345 3627 Saudi Media Systems Attendance Management System PUNCTUALITY IS FIRST STEP TOWARDS SUCCESS Saudi Media Systems designs and integrates multimedia systems and advanced technology facilities. We provide a full range of design, engineering, and technical support services that extend from project concept, through implementation, training and operational support REQUIREMENT FOR ATTENDANCE MANAGEMENT SOFTWARE Saudi Media Systems was facing huge problems with their manual attendance. They approached Creative solutions to automate attendance issues. They needed automation for all employees which includes roaster planning, day offs, global holidays, attendance monitoring, device monitoring and different parameters along with access control, suitable for hospitality industries. Requirements were as follows: Complete attendance management software. Machine for login & Machine for logout. Minor customization in software. Machine installation location lacked power outlet. The dashboard should be globally accessible from the web. Creative solutions took the requirements as a challenge and successfully implemented the CreativeTime Attendance management software which changed and up-lifted the legacy Saudi Media Systems Attendance software. Implementation included : Automation was done to reflect the complete requirements from Saudi Media Systems, Ex: Roaster Planning, day offs, employee monitoring, Etc. Complete attendance management software was implemented on-prem with minor customization. Integration of reports as per requirement. CSS3/ HTML5/ Microsoft .Net Lets Talk About Your Next Project Let's discuss how we can help you achieve your goals ADDAR Chemicals Attedance Management System Our goal is for you to succeed and that is the only way we can grow +966 59 345 3627",
    "Smartphone Application Design and Development - iOS, Android Creative Solutions has extensive experience in creating high performance, feature-packed and digitally transformative native Smartphone applications for all the major mobile platforms including iOS, Android We are rapidly expanding our design and development services to leverage applications in Retail, F&B, and Services Industry. Our team is experienced in creating solutions for a wide range of platforms. We offer specialized packages to satisfy a range of needs and budgets, from rapid prototyping for startups to full-featured interfaces for international enterprises. We at Creative Solutions take pride in developing applications that are not only user friendly but also stand out from the crowd by their ease of use, innovative feature set and flawless implementation. Mobile APP Development We are a leading software development company in Saudi Arabia providing mobile application development services. Our experienced team at Creative Solutions has developed several successful mobile applications for clients across the Kingdom of Saudi Arabia. Our experience team follow an agile methodology which helps us deliver quality products within stipulated time frames. We use state of the art technology tools including Swift, Android SDK, Kotlin while developing native apps for iOS and Android platforms along with hybrid apps using React Native / Angular plugin framework or other technologies as per client requirements to develop cross-platform mobile applications. iOS Application Development Services Creative Solutions is not only best iOS App Development Company in Saudi Arabia, but we are also experts at the entire iOS App Creation Process, from initial analysis to prototype design, wireframe, coding, testing and finally deployment. We have worked with many clients over the years and understand what they need to succeed. From our experience, we know how to create apps that work well, look great, and are easy to use. Our team consists of experienced developers who have worked on projects ranging from small business applications to enterprise solutions, are skilled at working with the latest technologies and frameworks, including Swift, Objective-C, Xcode, Cocoa Touch, Core Data, MapKit, Sprite Kit, etc. We have successfully created several iOS Apps for both iPhone and iPad, and have extensive knowledge of mobile device features, operating systems, and programming languages. We offer a variety of different services, including native iOS app development, hybrid mobile app development, web application development, and UI/UX design. We can even assist you with custom software development if you don't find what you're looking for among our prebuilt solutions. iPhone / iPad application development Apple pay & third party integrations 100% Native iOS app development Android Application Development Services At Creative Solutions we offer comprehensive mobile application development services that help you develop high quality applications that meet your requirements. Our experienced team at Creative Solutions has developed several successful mobile applications for clients across the globe. We are committed to delivering top-quality solutions for different industries and provide you with the best possible experience. Our professionals follow an agile methodology which helps us deliver quality products within stipulated time frames. We use state of the art technology tools for development of smartphone and tab app but not limited to Kotlin, Eclipse IDE and Android SDK while developing native apps for Android platform. With our top-notch expertise in mobile application development and years of experience, we at Creative Solutions have successfully developed innovative as well as complex mobile apps. App Development for Smartphone and Tab Android Biometric Authentication App Development Live Tracking for Driver App Development Hybrid Application Development Services Get the best of both worlds: the speed and predictability of web development, with the performance and reach of native apps. Our cross-platform mobile app development services are powerful, easy to use and flexible for your enterprise needs. Hybrid mobile apps have the power to combine the best elements of native and web apps, allowing you to seamlessly transition between native and web codebases. We provide our clients with customized solutions for their business needs so that they can achieve maximum success without having to worry about technical issues. Hybrid application development services in Saudi Arabia have been rising with the demand for cross-platform or hybrid apps. And many prefer cross-platform apps to native app development because of their low cost and high performance. Our Cross-platform app development in Saudi Arabia is also no exception. We at Creative Solutions thrive on perfection and customer satisfaction. We help businesses deliver ingenious solutions through the most adaptable mix of platforms and technologies, including JavaScript, React Native or NativeScript, CSS3 and HTML5. Our expertise and experience in cross-platform app development will help you to build a special bond between you and your customers. We build scalable and feature-packed mobile apps so that you can get the best return on your investment. If you are looking for the best cross-platform app development company in saudi Arabia, Creative Solutions should be your first choice. Angular Cross Platform Development React Native Cross Platform Development Progressive Web App Development Our Specialization E-Commerce Applications We take your e-store to your buyer's phones with user-friendly e-commerce app. Business Applications To optimize your business processes, get an app developed through Creative Solutions. Utility Applications Customized utility applications for easy monetization of your business. Our Featured Customers Mobile Applications Smartphone Application Design and Development - iOS, Android Creative Solutions has extensive experience in creating high performance, feature-packed and digitally transformative native Smartphone applications for all the major mobile platforms including iOS, Android We are rapidly expanding our design and development services to leverage applications in Retail, F&B, and Services Industry. Our team is experienced in creating solutions for a wide range of platforms. We offer specialized packages to satisfy a range of needs and budgets, from rapid prototyping for startups to full-featured interfaces for international enterprises. We at Creative Solutions take pride in developing applications that are not only user friendly but also stand out from the crowd by their ease of use, innovative feature set and flawless implementation. We are a leading software development company in Saudi Arabia providing mobile application development services. Our experienced team at Creative Solutions has developed several successful mobile applications for clients across the Kingdom of Saudi Arabia. Our experience team follow an agile methodology which helps us deliver quality products within stipulated time frames. We use state of the art technology tools including Swift, Android SDK, Kotlin while developing native apps for iOS and Android platforms along with hybrid apps using React Native / Angular plugin framework or other technologies as per client requirements to develop cross-platform mobile applications. iOS Application Development Services Creative Solutions is not only best iOS App Development Company in Saudi Arabia, but we are also experts at the entire iOS App Creation Process, from initial analysis to prototype design, wireframe, coding, testing and finally deployment. We have worked with many clients over the years and understand what they need to succeed. From our experience, we know how to create apps that work well, look great, and are easy to use. Our team consists of experienced developers who have worked on projects ranging from small business applications to enterprise solutions, are skilled at working with the latest technologies and frameworks, including Swift, Objective-C, Xcode, Cocoa Touch, Core Data, MapKit, Sprite Kit, etc. We have successfully created several iOS Apps for both iPhone and iPad, and have extensive knowledge of mobile device features, operating systems, and programming languages. We offer a variety of different services, including native iOS app development, hybrid mobile app development, web application development, and UI/UX design. We can even assist you with custom software development if you don't find what you're looking for among our prebuilt solutions. iPhone / iPad application development Apple pay & third party integrations 100% Native iOS app development Android Application Development Services At Creative Solutions we offer comprehensive mobile application development services that help you develop high quality applications that meet your requirements. Our experienced team at Creative Solutions has developed several successful mobile applications for clients across the globe. We are committed to delivering top-quality solutions for different industries and provide you with the best possible experience. Our professionals follow an agile methodology which helps us deliver quality products within stipulated time frames. We use state of the art technology tools for development of smartphone and tab app but not limited to Kotlin, Eclipse IDE and Android SDK while developing native apps for Android platform. With our top-notch expertise in mobile application development and years of experience, we at Creative Solutions have successfully developed innovative as well as complex mobile apps. App Development for Smartphone and Tab Android Biometric Authentication App Development Live Tracking for Driver App Development Hybrid Application Development Services Get the best of both worlds: the speed and predictability of web development, with the performance and reach of native apps. Our cross-platform mobile app development services are powerful, easy to use and flexible for your enterprise needs. Hybrid mobile apps have the power to combine the best elements of native and web apps, allowing you to seamlessly transition between native and web codebases. We provide our clients with customized solutions for their business needs so that they can achieve maximum success without having to worry about technical issues. Hybrid application development services in Saudi Arabia have been rising with the demand for cross-platform or hybrid apps. And many prefer cross-platform apps to native app development because of their low cost and high performance. Our Cross-platform app development in Saudi Arabia is also no exception. We at Creative Solutions thrive on perfection and customer satisfaction. We help businesses deliver ingenious solutions through the most adaptable mix of platforms and technologies, including JavaScript, React Native or NativeScript, CSS3 and HTML5. Our expertise and experience in cross-platform app development will help you to build a special bond between you and your customers. We build scalable and feature-packed mobile apps so that you can get the best return on your investment. If you are looking for the best cross-platform app development company in saudi Arabia, Creative Solutions should be your first choice. Angular Cross Platform Development React Native Cross Platform Development Progressive Web App Development We take your e-store to your buyer's phones with user-friendly e-commerce app. To optimize your business processes, get an app developed through Creative Solutions. Customized utility applications for easy monetization of your business. Our Featured Customers Mobile Applications"
  ]
}