{
  "company": "www.certifyglobal.com",
  "dominant_topics": [
    0,
    1,
    13,
    2
  ],
  "topic_counts": {
    "0": 16,
    "1": 2,
    "13": 1,
    "2": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "13": "loop, statements, forward looking, forward, looking statements",
    "2": "demand, cctv, camera, ca, verkada"
  },
  "framing_scores": {
    "framing_ethical": 0.9635416666666666,
    "framing_surveillance": 0.0,
    "framing_market": 0.0364583333333333,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "0": 16,
      "1": 2,
      "2": 1,
      "13": 1
    }
  },
  "sample_docs": [
    "Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act (\"IBIPA\"). This Notice of does not apply to any other types of Personally Identifiable Information collected from Illinois residents. This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. TYPES OF BIOMETRIC INFORMATION Biometric Information may include any type of information sufficient to identify you by your physical characteristics, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Biometric Information does not include photographs or information collected in a healthcare setting. USE OF BIOMETRIC INFORMATION We may collect and store your Biometric Information when you use the Services. The purpose of collecting, storing, and using your Biometric Information is to enable us to provide the Services. When you use the Services, you will be asked to indicate that you consent to our collection, storage, and use of your Biometric Information in accordance with the of this Notice by clicking on a checkbox, by entering you name, or by similar means. You agree that such indication of consent is your written release regarding our collection, storage, and use of your Biometric Information under the IBIPA. We will not sell, license, share, or disclose your Biometric Information, except as set forth in this Notice, or with your consent, or to complete a financial transaction requested or authorized by you, and we will use such information only as set forth this Notice. RETENTION OF BIOMETRIC INFORMATION We may retain your Biometric Information for a period three (3) years from your last use of the Services, unless you request the deletion of your Biometric Information prior to that time pursuant to our . DISCLOSURE OF BIOMETRIC INFORMATION We may disclose certain Biometric Information to product and/or service providers who assist us in providing the Services. The Biometric Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Biometric Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Biometric Information to third parties to comply with valid legal demands for such information is governed by our Compelled Disclosures Policy . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act (\"IBIPA\"). This Notice of does not apply to any other types of Personally Identifiable Information collected from Illinois residents. This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. TYPES OF BIOMETRIC INFORMATION Biometric Information may include any type of information sufficient to identify you by your physical characteristics, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Biometric Information does not include photographs or information collected in a healthcare setting. USE OF BIOMETRIC INFORMATION We may collect and store your Biometric Information when you use the Services. The purpose of collecting, storing, and using your Biometric Information is to enable us to provide the Services. When you use the Services, you will be asked to indicate that you consent to our collection, storage, and use of your Biometric Information in accordance with the of this Notice by clicking on a checkbox, by entering you name, or by similar means. You agree that such indication of consent is your written release regarding our collection, storage, and use of your Biometric Information under the IBIPA. We will not sell, license, share, or disclose your Biometric Information, except as set forth in this Notice, or with your consent, or to complete a financial transaction requested or authorized by you, and we will use such information only as set forth this Notice. RETENTION OF BIOMETRIC INFORMATION We may retain your Biometric Information for a period three (3) years from your last use of the Services, unless you request the deletion of your Biometric Information prior to that time pursuant to our . DISCLOSURE OF BIOMETRIC INFORMATION We may disclose certain Biometric Information to product and/or service providers who assist us in providing the Services. The Biometric Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Biometric Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Biometric Information to third parties to comply with valid legal demands for such information is governed by our Compelled Disclosures Policy . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act (\"IBIPA\"). This Notice of does not apply to any other types of Personally Identifiable Information collected from Illinois residents. This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. TYPES OF BIOMETRIC INFORMATION Biometric Information may include any type of information sufficient to identify you by your physical characteristics, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Biometric Information does not include photographs or information collected in a healthcare setting. USE OF BIOMETRIC INFORMATION We may collect and store your Biometric Information when you use the Services. The purpose of collecting, storing, and using your Biometric Information is to enable us to provide the Services. When you use the Services, you will be asked to indicate that you consent to our collection, storage, and use of your Biometric Information in accordance with the of this Notice by clicking on a checkbox, by entering you name, or by similar means. You agree that such indication of consent is your written release regarding our collection, storage, and use of your Biometric Information under the IBIPA. We will not sell, license, share, or disclose your Biometric Information, except as set forth in this Notice, or with your consent, or to complete a financial transaction requested or authorized by you, and we will use such information only as set forth this Notice. RETENTION OF BIOMETRIC INFORMATION We may retain your Biometric Information for a period three (3) years from your last use of the Services, unless you request the deletion of your Biometric Information prior to that time pursuant to our . DISCLOSURE OF BIOMETRIC INFORMATION We may disclose certain Biometric Information to product and/or service providers who assist us in providing the Services. The Biometric Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Biometric Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Biometric Information to third parties to comply with valid legal demands for such information is governed by our Compelled Disclosures Policy . Illinois Biometric Information Notice Developer of Use Whom We Serve Healthcare Business Finance Products Authenticator Check-In QuickTouch Score About Partners Press FAQ's Careers",
    "Healthcare We provide verification services for both patients and physicians to ensure increased proficiency in your business. Fever Detection & Thermal Scanning Solution CERTIFY is the #1 Fever Detection & Thermal Scanning Solution in the marketplace. With thousands of devices sold, our patented combination of thermal scanning technology, The most advanced authentication platform in the world Try Auth for 30 days and sample every feature with unlimited users .You can easily convert when ready. CERTIFY saves you time and money while providing multiple products and solutions for your business needs. The amount of frustration that has been removed from our day is insurmountable. We have over 6 million patient visits per year and have never implemented a service that improves the patient experience, streamlines workflow, saves us time, saves us money, and eliminates fraud as much as the CERTIFY platform. CEO Major Healthcare Corporation Integrated Partners: Healthcare We provide verification services for both patients and physicians to ensure increased proficiency in your business. Fever Detection & Thermal Scanning Solution CERTIFY is the #1 Fever Detection & Thermal Scanning Solution in the marketplace. With thousands of devices sold, our patented combination of thermal scanning technology, The most advanced authentication platform in the world Try Auth for 30 days and sample every feature with unlimited users .You can easily convert when ready. CERTIFY saves you time and money while providing multiple products and solutions for your business needs. The amount of frustration that has been removed from our day is insurmountable. We have over 6 million patient visits per year and have never implemented a service that improves the patient experience, streamlines workflow, saves us time, saves us money, and eliminates fraud as much as the CERTIFY platform. CEO Major Healthcare Corporation Integrated Partners: Healthcare We provide verification services for both patients and physicians to ensure increased proficiency in your business. Fever Detection & Thermal Scanning Solution CERTIFY is the #1 Fever Detection & Thermal Scanning Solution in the marketplace. With thousands of devices sold, our patented combination of thermal scanning technology, The most advanced authentication platform in the world Try Auth for 30 days and sample every feature with unlimited users .You can easily convert when ready. CERTIFY saves you time and money while providing multiple products and solutions for your business needs. CERTIFY saves you time and money while providing multiple products and solutions for your business needs. The amount of frustration that has been removed from our day is insurmountable. We have over 6 million patient visits per year and have never implemented a service that improves the patient experience, streamlines workflow, saves us time, saves us money, and eliminates fraud as much as the CERTIFY platform. CEO Major Healthcare Corporation The amount of frustration that has been removed from our day is insurmountable. We have over 6 million patient visits per year and have never implemented a service that improves the patient experience, streamlines workflow, saves us time, saves us money, and eliminates fraud as much as the CERTIFY platform.",
    "CALIFORNIA COLLECTION NOTICE Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom we disclose the information for business purposes, as required by the California Consumer Privacy Act (\"CCPA\"). This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. Types Of Personal Information Personally Identifiable Information may include names, addresses, telephone numbers, email addresses, birth dates, and similar types of information. Personally Identifiable Information may also include demographic information, employment information, financial information, and similar types of information. Personally Identifiable Information may also include Biometric Information, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Use Of Personal Information We may use your Personally Identifiable Information to provide the Services and for related purposes, including to communicate with you about the Services and to facilitate the operation of our business. We will not sell, license, share, or disclose your Personally Identifiable Information, except as set forth in this Notice and our , or with your consent, and we will use such information only as set forth this Notice or our . Do Not Sell My Personal Information Under the CCPA, a business does not \"sell\" Personally Identifiable Information when a consumer uses or directs the business to intentionally disclose the information. Thus, when you use the Service for the purpose of intentionally disclosing your Personally Identifiable Information to the entity on whose behalf the Services are provided, we are not selling your Personally Identifiable Information for purposes of the CCPA. If you believe that disclosing your Personally Identifiable Information to such entity constitutes selling the Services, you may request that we not sell your information by contacting us at info@certifyglobal.com . However, using your Personally Identifiable Information is necessary to provide the Services, and if you indicate that you do not want us to use your Personally Identifiable Information to provide such Services, you will not be able to use the Services. Sources Of Personal Information The sources of the Personally Identifiable Information we collect are you and/or the entity on whose behalf the Services are provided. Disclosure Of Personal Information We may disclose certain Personally Identifiable Information to product and/or service providers who assist us in providing the Services. The Personally Identifiable Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Personally Identifiable Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Personally Identifiable Information to third parties to comply with valid legal demands for such information is governed by our Government Disclosures Policy . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement CALIFORNIA COLLECTION NOTICE Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom we disclose the information for business purposes, as required by the California Consumer Privacy Act (\"CCPA\"). This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. Types Of Personal Information Personally Identifiable Information may include names, addresses, telephone numbers, email addresses, birth dates, and similar types of information. Personally Identifiable Information may also include demographic information, employment information, financial information, and similar types of information. Personally Identifiable Information may also include Biometric Information, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Use Of Personal Information We may use your Personally Identifiable Information to provide the Services and for related purposes, including to communicate with you about the Services and to facilitate the operation of our business. We will not sell, license, share, or disclose your Personally Identifiable Information, except as set forth in this Notice and our , or with your consent, and we will use such information only as set forth this Notice or our . Do Not Sell My Personal Information Under the CCPA, a business does not \"sell\" Personally Identifiable Information when a consumer uses or directs the business to intentionally disclose the information. Thus, when you use the Service for the purpose of intentionally disclosing your Personally Identifiable Information to the entity on whose behalf the Services are provided, we are not selling your Personally Identifiable Information for purposes of the CCPA. If you believe that disclosing your Personally Identifiable Information to such entity constitutes selling the Services, you may request that we not sell your information by contacting us at info@certifyglobal.com . However, using your Personally Identifiable Information is necessary to provide the Services, and if you indicate that you do not want us to use your Personally Identifiable Information to provide such Services, you will not be able to use the Services. Sources Of Personal Information The sources of the Personally Identifiable Information we collect are you and/or the entity on whose behalf the Services are provided. Disclosure Of Personal Information We may disclose certain Personally Identifiable Information to product and/or service providers who assist us in providing the Services. The Personally Identifiable Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Personally Identifiable Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Personally Identifiable Information to third parties to comply with valid legal demands for such information is governed by our Government Disclosures Policy . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom we disclose the information for business purposes, as required by the California Consumer Privacy Act (\"CCPA\"). This Notice is incorporated by reference into our , and the capitalized that appear in this Notice have the same meanings as in CERTIFY's , unless they are defined in this Notice. Types Of Personal Information Personally Identifiable Information may include names, addresses, telephone numbers, email addresses, birth dates, and similar types of information. Personally Identifiable Information may also include demographic information, employment information, financial information, and similar types of information. Personally Identifiable Information may also include Biometric Information, such as fingerprint, voiceprint, retina, iris, face, and temperature scans. Use Of Personal Information We may use your Personally Identifiable Information to provide the Services and for related purposes, including to communicate with you about the Services and to facilitate the operation of our business. We will not sell, license, share, or disclose your Personally Identifiable Information, except as set forth in this Notice and our , or with your consent, and we will use such information only as set forth this Notice or our . Do Not Sell My Personal Information Under the CCPA, a business does not \"sell\" Personally Identifiable Information when a consumer uses or directs the business to intentionally disclose the information. Thus, when you use the Service for the purpose of intentionally disclosing your Personally Identifiable Information to the entity on whose behalf the Services are provided, we are not selling your Personally Identifiable Information for purposes of the CCPA. If you believe that disclosing your Personally Identifiable Information to such entity constitutes selling the Services, you may request that we not sell your information by contacting us at info@certifyglobal.com . However, using your Personally Identifiable Information is necessary to provide the Services, and if you indicate that you do not want us to use your Personally Identifiable Information to provide such Services, you will not be able to use the Services. Sources Of Personal Information The sources of the Personally Identifiable Information we collect are you and/or the entity on whose behalf the Services are provided. Disclosure Of Personal Information We may disclose certain Personally Identifiable Information to product and/or service providers who assist us in providing the Services. The Personally Identifiable Information disclosed to such companies will be limited to information sufficient to provide the Services, to support the Services, to enhance the Services, or to verify or supplement the information in your account. We may disclose Personally Identifiable Information to third parties: (a) to comply with a valid legal demands for such information; (b) to protect our company or any of its owners, directors, officers, employees, agents, customers, or anyone else; (c) to enable us to investigate actual, attempted, threatened, or suspected violations of our of Use or other agreements, or to enforce our of Use or other agreements; or (d) pursuant to any acquisition, merger, or sale of all or substantially all of our business. The disclosure of Personally Identifiable Information to third parties to comply with valid legal demands for such information is governed by our Government Disclosures Policy . Illinois Biometric Information Notice Developer of Use Whom We Serve Healthcare Business Finance Products Authenticator Check-In QuickTouch Score About Partners Press FAQ's Careers",
    "Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act …Read More CALIFORNIA COLLECTION NOTICE Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom …Read More E-BUSINESS POLICY Last Updated: April 16, 2019 This E-Business Policy governs the use of electronic signatures and other electronic indications of the Parties' consent, and is incorporated by reference into CERTIFY's of Use. The capitalized that appear in this E-Business Policy have the same meanings as in CERTIFY's of Use and , unless they …Read More DEVELOPER OF USE Last Updated: April 16, 2019 These Developer of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any software developer (\"Developer\" or \"you\") (each a \"Party\" and collectively the \"Parties\") who uses CERTIFY's software development tools (\"Developer Tools\") to integrate the CERTIFY platform into Developer's products …Read More GDPR POLICY Last Updated: April 16, 2019 This GDPR Policy governs CERTIFY's collection and use (\"Processing\") of the Personally Identifiable Information of persons residing in the European Union and other jurisdictions that have adopted the EU's Data Protection Regulation (\"GDPR\"), and is incorporated by reference into CERTIFY's . The capitalized that appear …Read More GOVERNMENT DISCLOSURES POLICY Last Updated: April 16, 2019 This Government Disclosures Policy governs the compelled disclosure of your Personally Identifiable Information pursuant to valid governmental demands for such information, such as court orders, search warrants, subpoenas (including investigative, criminal, and civil subpoenas), and similar demands, and is incorporated by reference into CERTIFY's . …Read More NON-DISCLOSURE AGREEMENT Last Updated: April 16, 2019 This Non-Disclosure Agreement (\"Agreement\") constitutes a contract regarding the treatment of non-public business information (\"Confidential Information\") between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who exchanges Confidential Information with CERTIFY (\"you\") (each a \"Party\" and collectively the \"Parties\"). Either Party may disclose or receive Confidential …Read More SERVICE LEVEL AGREEMENT Last Updated: April 16, 2019 This Service Level Agreement (\"Agreement\") constitutes a contract between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who signs up to use CERTIFY's Services through our Website or who signs a separate agreement regarding the Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). This …Read More OF USE Last Updated: March 30, 2021 These of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who uses our products and/or services (collectively \"Services\") or who agrees to use our Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). You may agree to …Read More HARDWARE POLICY Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use. Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. …Read More Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act …Read More Illinois Biometric Information Notice Last Updated: November 12, 2020 This Illinois Biometric Information Notice (\"Notice\") applies to Illinois residents and provides information about the Biometric Information that we collect from such residents, our use of such information, and length of time we can keep such information, as required by the Illinois Biometric Information Privacy Act …Read More CALIFORNIA COLLECTION NOTICE Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom …Read More CALIFORNIA COLLECTION NOTICE Last Updated: August 26, 2020 This California Collection Notice (\"Notice\") applies to California residents and provides information about the categories of Personally Identifiable Information that we collect from such residents, the purposes for which we use the information, the sources of the information, and the categories of third parties to whom …Read More E-BUSINESS POLICY Last Updated: April 16, 2019 This E-Business Policy governs the use of electronic signatures and other electronic indications of the Parties' consent, and is incorporated by reference into CERTIFY's of Use. The capitalized that appear in this E-Business Policy have the same meanings as in CERTIFY's of Use and , unless they …Read More E-BUSINESS POLICY Last Updated: April 16, 2019 This E-Business Policy governs the use of electronic signatures and other electronic indications of the Parties' consent, and is incorporated by reference into CERTIFY's of Use. The capitalized that appear in this E-Business Policy have the same meanings as in CERTIFY's of Use and , unless they …Read More DEVELOPER OF USE Last Updated: April 16, 2019 These Developer of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any software developer (\"Developer\" or \"you\") (each a \"Party\" and collectively the \"Parties\") who uses CERTIFY's software development tools (\"Developer Tools\") to integrate the CERTIFY platform into Developer's products …Read More DEVELOPER OF USE Last Updated: April 16, 2019 These Developer of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any software developer (\"Developer\" or \"you\") (each a \"Party\" and collectively the \"Parties\") who uses CERTIFY's software development tools (\"Developer Tools\") to integrate the CERTIFY platform into Developer's products …Read More GDPR POLICY Last Updated: April 16, 2019 This GDPR Policy governs CERTIFY's collection and use (\"Processing\") of the Personally Identifiable Information of persons residing in the European Union and other jurisdictions that have adopted the EU's Data Protection Regulation (\"GDPR\"), and is incorporated by reference into CERTIFY's . The capitalized that appear …Read More GDPR POLICY Last Updated: April 16, 2019 This GDPR Policy governs CERTIFY's collection and use (\"Processing\") of the Personally Identifiable Information of persons residing in the European Union and other jurisdictions that have adopted the EU's Data Protection Regulation (\"GDPR\"), and is incorporated by reference into CERTIFY's . The capitalized that appear …Read More GOVERNMENT DISCLOSURES POLICY Last Updated: April 16, 2019 This Government Disclosures Policy governs the compelled disclosure of your Personally Identifiable Information pursuant to valid governmental demands for such information, such as court orders, search warrants, subpoenas (including investigative, criminal, and civil subpoenas), and similar demands, and is incorporated by reference into CERTIFY's . …Read More GOVERNMENT DISCLOSURES POLICY Last Updated: April 16, 2019 This Government Disclosures Policy governs the compelled disclosure of your Personally Identifiable Information pursuant to valid governmental demands for such information, such as court orders, search warrants, subpoenas (including investigative, criminal, and civil subpoenas), and similar demands, and is incorporated by reference into CERTIFY's . …Read More NON-DISCLOSURE AGREEMENT Last Updated: April 16, 2019 This Non-Disclosure Agreement (\"Agreement\") constitutes a contract regarding the treatment of non-public business information (\"Confidential Information\") between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who exchanges Confidential Information with CERTIFY (\"you\") (each a \"Party\" and collectively the \"Parties\"). Either Party may disclose or receive Confidential …Read More NON-DISCLOSURE AGREEMENT Last Updated: April 16, 2019 This Non-Disclosure Agreement (\"Agreement\") constitutes a contract regarding the treatment of non-public business information (\"Confidential Information\") between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who exchanges Confidential Information with CERTIFY (\"you\") (each a \"Party\" and collectively the \"Parties\"). Either Party may disclose or receive Confidential …Read More SERVICE LEVEL AGREEMENT Last Updated: April 16, 2019 This Service Level Agreement (\"Agreement\") constitutes a contract between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who signs up to use CERTIFY's Services through our Website or who signs a separate agreement regarding the Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). This …Read More SERVICE LEVEL AGREEMENT Last Updated: April 16, 2019 This Service Level Agreement (\"Agreement\") constitutes a contract between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who signs up to use CERTIFY's Services through our Website or who signs a separate agreement regarding the Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). This …Read More OF USE Last Updated: March 30, 2021 These of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who uses our products and/or services (collectively \"Services\") or who agrees to use our Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). You may agree to …Read More OF USE Last Updated: March 30, 2021 These of Use constitute a contract by and between CERTIFY Global Inc. (\"CERTIFY\") and any person or entity who uses our products and/or services (collectively \"Services\") or who agrees to use our Services (\"you\") (each a \"Party\" and collectively the \"Parties\"). You may agree to …Read More HARDWARE POLICY Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use. Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. …Read More HARDWARE POLICY Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use. Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. …Read More Whom We Serve Healthcare Business Finance Products Authenticator Check-In QuickTouch Score About Partners Press FAQ's Careers",
    "HARDWARE POLICY Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use . Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. The capitalized that appear in this policy have the same meanings as in CERTIFY's of Use , unless they are defined in this policy. By purchasing the Products, you agree to this Hardware Policy. IF YOU DO NOT AGREE TO THE THIS HARDWARE POLICY, YOU MAY NOT USE THE SERVICES. USE OF PRODUCTS Your use of the Products is governed by CERTIFY's of Use . RETURN OF PRODUCTS CANCELLATION You may return and receive a full refund for Products purchased through CERTIFY if you purchase the Products within thirty (30) days of opening an Account and cancel your Account at any time during the same period, so long as the Products are in their original condition and packaging and you enclose the original packaging slip. You may not return and receive a full refund for Products purchased through CERTIFY if you purchase the products more than thirty (30) days after opening an Account, except pursuant to the following Limited Warranty. Refunds will be applied to the original purchase method. Only Products purchased directly from CERTIFY can be returned to CERTIFY. Any products you purchase from a third party must be returned in accordance with the third party's policies. DEFECTIVE PRODUCTS You may return defective Products purchased through CERTIFY and receive replacement Products pursuant to the following Limited Warranty. LIMITED WARRANTY CERTIFY warrants the Products against defects in materials and workmanship under normal use for a period of six (6) months from the date the Products are delivered to you, and will replace defective Products at no cost to you, so long as you return the defective Products pursuant to the instructions that will be provided to you, along with all accessories, cords, cables, parts, and documentation included, within fourteen (14) days of receiving replacement Products. When you initiate a return pursuant to this Limited Warranty, you will be asked to provide a credit card number to CERTIFY. In the event you fail to return the Products to CERTIFY as set forth above, CERTIFY reserves the right to charge either your credit card. To initiate a return pursuant to this Limited Warranty, please contact support@certifyglobal.com . EXCLUSIONS This Limited Warranty does not apply to any products you purchase from a third party. Any products you purchase from a third party are subject to the warranties of the third party. This Limited Warranty does not apply outside the warranty period set forth in this Hardware Policy. If you encounter any defects in the Products outside the warranty period, you must contact the manufacturer of the Products to determine if any additional warranty applies. This Limited Warranty does not apply to any CERTIFY software or other software, even if provided with the Products. Nor does this Limited Warranty apply to any accessories, replacement parts, or consumable products used in connection with the Products, including batteries, even if provided with the Products. This Limited Warranty does not apply if the defects in the Products are caused by misuse, repair, or alternation of the Products; any accident involving the Products; and any damage to the products caused by events beyond our control, such as fire damage, flood damage, storm damage, power surges, and the like (\"force majeure\"); and similar causes. This Limited Warranty is only available to original purchasers of the Products. This warranty is not available if you sell or transfer the Products to anyone else. This Limited Warranty cannot be modified in any way. No CERTIFY employee, reseller, or another other person is authorized to extend or otherwise modify this Limited Warranty in any way. DISCLAIMERS The following disclaimers are in addition to the disclaimers set forth in CERTIFY's of Use . If there is any conflict between those disclaimers and the below disclaimers, the below disclaimers will control, and the remaining disclaimers will continue in full force and effect. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THIS LIMITED WARRANTY IS PROVIDED IN LIEU OF ANY OTHER WARRANTY, WHETHER EXPRESS OR IMPLIED, WRITTEN OR ORAL, WITH RESPECT TO THE PRODUCTS. CERTIFY DISCLAIMS ANY AND ALL WARRANTIES IN CONNECTION WITH THE PRODUCTS, EXPRESS OR IMPLIED, INCLUDING ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, SATISFACTORY QUALITY, OR NON-INFRINGEMENT. CERTIFY ALSO DISCLAIMS ANY AND ALL WARRANTIES, EXPRESS OR IMPLIED, THAT THE PRODUCTS ARE FREE OF HIDDEN OR LATENT DEFECTS. TO THE EXTENT SUCH WARRANTIES CANNOT BE DISCLAIMED, CERTIFY LIMITS THE DURATION AND REMEDIES OF SUCH WARRANTIES TO THE DURATION AND REMEDIES OF THIS LIMITED WARRANTY. LIMITATIONS ON LIABILITY The following limitations on liability are in addition to the limitations on liability set forth in CERTIFY's of Use . If there is any conflict between those limitations and the below limitations, the below limitations will control, and the remaining limitations will continue in full force and effect. YOU AGREE THAT CERTIFY WILL NOT BE LIABLE TO YOU FOR ANY LOSSES OR DAMAGES ALLEGEDLY CAUSED BY THE PRODUCTS, INCLUDING ANY PERSONAL INJURIES ALLEGEDLY CAUSED BY THE PRODUCTS. YOU FURTHER AGREE THAT REPLACEMENT OF DEFECTIVE PRODUCTS IS YOUR SOLE AND EXCLUSIVE REMEDY UNDER THIS LIMITED WARRANTY. COMMUNICATIONS Questions, complaints, and other communications regarding the operation of the Products or defects in the Products should be directed to CERTIFY at support@certifyglobal.com . Questions, complaints, and other communications regarding any other aspect of this Hardware Policy should be directed to CERTIFY at info@certifyglobal.com . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement HARDWARE POLICY Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use . Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. The capitalized that appear in this policy have the same meanings as in CERTIFY's of Use , unless they are defined in this policy. By purchasing the Products, you agree to this Hardware Policy. IF YOU DO NOT AGREE TO THE THIS HARDWARE POLICY, YOU MAY NOT USE THE SERVICES. USE OF PRODUCTS Your use of the Products is governed by CERTIFY's of Use . RETURN OF PRODUCTS CANCELLATION You may return and receive a full refund for Products purchased through CERTIFY if you purchase the Products within thirty (30) days of opening an Account and cancel your Account at any time during the same period, so long as the Products are in their original condition and packaging and you enclose the original packaging slip. You may not return and receive a full refund for Products purchased through CERTIFY if you purchase the products more than thirty (30) days after opening an Account, except pursuant to the following Limited Warranty. Refunds will be applied to the original purchase method. Only Products purchased directly from CERTIFY can be returned to CERTIFY. Any products you purchase from a third party must be returned in accordance with the third party's policies. DEFECTIVE PRODUCTS You may return defective Products purchased through CERTIFY and receive replacement Products pursuant to the following Limited Warranty. LIMITED WARRANTY CERTIFY warrants the Products against defects in materials and workmanship under normal use for a period of six (6) months from the date the Products are delivered to you, and will replace defective Products at no cost to you, so long as you return the defective Products pursuant to the instructions that will be provided to you, along with all accessories, cords, cables, parts, and documentation included, within fourteen (14) days of receiving replacement Products. When you initiate a return pursuant to this Limited Warranty, you will be asked to provide a credit card number to CERTIFY. In the event you fail to return the Products to CERTIFY as set forth above, CERTIFY reserves the right to charge either your credit card. To initiate a return pursuant to this Limited Warranty, please contact support@certifyglobal.com . EXCLUSIONS This Limited Warranty does not apply to any products you purchase from a third party. Any products you purchase from a third party are subject to the warranties of the third party. This Limited Warranty does not apply outside the warranty period set forth in this Hardware Policy. If you encounter any defects in the Products outside the warranty period, you must contact the manufacturer of the Products to determine if any additional warranty applies. This Limited Warranty does not apply to any CERTIFY software or other software, even if provided with the Products. Nor does this Limited Warranty apply to any accessories, replacement parts, or consumable products used in connection with the Products, including batteries, even if provided with the Products. This Limited Warranty does not apply if the defects in the Products are caused by misuse, repair, or alternation of the Products; any accident involving the Products; and any damage to the products caused by events beyond our control, such as fire damage, flood damage, storm damage, power surges, and the like (\"force majeure\"); and similar causes. This Limited Warranty is only available to original purchasers of the Products. This warranty is not available if you sell or transfer the Products to anyone else. This Limited Warranty cannot be modified in any way. No CERTIFY employee, reseller, or another other person is authorized to extend or otherwise modify this Limited Warranty in any way. DISCLAIMERS The following disclaimers are in addition to the disclaimers set forth in CERTIFY's of Use . If there is any conflict between those disclaimers and the below disclaimers, the below disclaimers will control, and the remaining disclaimers will continue in full force and effect. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THIS LIMITED WARRANTY IS PROVIDED IN LIEU OF ANY OTHER WARRANTY, WHETHER EXPRESS OR IMPLIED, WRITTEN OR ORAL, WITH RESPECT TO THE PRODUCTS. CERTIFY DISCLAIMS ANY AND ALL WARRANTIES IN CONNECTION WITH THE PRODUCTS, EXPRESS OR IMPLIED, INCLUDING ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, SATISFACTORY QUALITY, OR NON-INFRINGEMENT. CERTIFY ALSO DISCLAIMS ANY AND ALL WARRANTIES, EXPRESS OR IMPLIED, THAT THE PRODUCTS ARE FREE OF HIDDEN OR LATENT DEFECTS. TO THE EXTENT SUCH WARRANTIES CANNOT BE DISCLAIMED, CERTIFY LIMITS THE DURATION AND REMEDIES OF SUCH WARRANTIES TO THE DURATION AND REMEDIES OF THIS LIMITED WARRANTY. LIMITATIONS ON LIABILITY The following limitations on liability are in addition to the limitations on liability set forth in CERTIFY's of Use . If there is any conflict between those limitations and the below limitations, the below limitations will control, and the remaining limitations will continue in full force and effect. YOU AGREE THAT CERTIFY WILL NOT BE LIABLE TO YOU FOR ANY LOSSES OR DAMAGES ALLEGEDLY CAUSED BY THE PRODUCTS, INCLUDING ANY PERSONAL INJURIES ALLEGEDLY CAUSED BY THE PRODUCTS. YOU FURTHER AGREE THAT REPLACEMENT OF DEFECTIVE PRODUCTS IS YOUR SOLE AND EXCLUSIVE REMEDY UNDER THIS LIMITED WARRANTY. COMMUNICATIONS Questions, complaints, and other communications regarding the operation of the Products or defects in the Products should be directed to CERTIFY at support@certifyglobal.com . Questions, complaints, and other communications regarding any other aspect of this Hardware Policy should be directed to CERTIFY at info@certifyglobal.com . of Use California Collection Notice Illinois Biometric Information Notice Compelled Disclosures Policy Cookies Policy Developer of Use E-Business policy GDPR Policy Government Disclosures Policy Hardware Policy Business Associate Agreement Non-Disclosure Agreement Service Level Agreement Last Updated: April 16, 2019 This Hardware Policy applies to all products purchased through CERTIFY (\"Products\"), including through our Website or sales representatives, and is incorporated by reference into CERTIFY's of Use . Such Products may include such as biometric readers, hardware tokens, and other hardware used in connection with the Services. The capitalized that appear in this policy have the same meanings as in CERTIFY's of Use , unless they are defined in this policy. By purchasing the Products, you agree to this Hardware Policy. IF YOU DO NOT AGREE TO THE THIS HARDWARE POLICY, YOU MAY NOT USE THE SERVICES. Your use of the Products is governed by CERTIFY's of Use . CANCELLATION You may return and receive a full refund for Products purchased through CERTIFY if you purchase the Products within thirty (30) days of opening an Account and cancel your Account at any time during the same period, so long as the Products are in their original condition and packaging and you enclose the original packaging slip. You may not return and receive a full refund for Products purchased through CERTIFY if you purchase the products more than thirty (30) days after opening an Account, except pursuant to the following Limited Warranty. Refunds will be applied to the original purchase method. Only Products purchased directly from CERTIFY can be returned to CERTIFY. Any products you purchase from a third party must be returned in accordance with the third party's policies. DEFECTIVE PRODUCTS You may return defective Products purchased through CERTIFY and receive replacement Products pursuant to the following Limited Warranty. CERTIFY warrants the Products against defects in materials and workmanship under normal use for a period of six (6) months from the date the Products are delivered to you, and will replace defective Products at no cost to you, so long as you return the defective Products pursuant to the instructions that will be provided to you, along with all accessories, cords, cables, parts, and documentation included, within fourteen (14) days of receiving replacement Products. When you initiate a return pursuant to this Limited Warranty, you will be asked to provide a credit card number to CERTIFY. In the event you fail to return the Products to CERTIFY as set forth above, CERTIFY reserves the right to charge either your credit card. To initiate a return pursuant to this Limited Warranty, please contact support@certifyglobal.com . This Limited Warranty does not apply to any products you purchase from a third party. Any products you purchase from a third party are subject to the warranties of the third party. This Limited Warranty does not apply outside the warranty period set forth in this Hardware Policy. If you encounter any defects in the Products outside the warranty period, you must contact the manufacturer of the Products to determine if any additional warranty applies. This Limited Warranty does not apply to any CERTIFY software or other software, even if provided with the Products. Nor does this Limited Warranty apply to any accessories, replacement parts, or consumable products used in connection with the Products, including batteries, even if provided with the Products. This Limited Warranty does not apply if the defects in the Products are caused by misuse, repair, or alternation of the Products; any accident involving the Products; and any damage to the products caused by events beyond our control, such as fire damage, flood damage, storm damage, power surges, and the like (\"force majeure\"); and similar causes. This Limited Warranty is only available to original purchasers of the Products. This warranty is not available if you sell or transfer the Products to anyone else. This Limited Warranty cannot be modified in any way. No CERTIFY employee, reseller, or another other person is authorized to extend or otherwise modify this Limited Warranty in any way. The following disclaimers are in addition to the disclaimers set forth in CERTIFY's of Use . If there is any conflict between those disclaimers and the below disclaimers, the below disclaimers will control, and the remaining disclaimers will continue in full force and effect. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THIS LIMITED WARRANTY IS PROVIDED IN LIEU OF ANY OTHER WARRANTY, WHETHER EXPRESS OR IMPLIED, WRITTEN OR ORAL, WITH RESPECT TO THE PRODUCTS. CERTIFY DISCLAIMS ANY AND ALL WARRANTIES IN CONNECTION WITH THE PRODUCTS, EXPRESS OR IMPLIED, INCLUDING ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, SATISFACTORY QUALITY, OR NON-INFRINGEMENT. CERTIFY ALSO DISCLAIMS ANY AND ALL WARRANTIES, EXPRESS OR IMPLIED, THAT THE PRODUCTS ARE FREE OF HIDDEN OR LATENT DEFECTS. TO THE EXTENT SUCH WARRANTIES CANNOT BE DISCLAIMED, CERTIFY LIMITS THE DURATION AND REMEDIES OF SUCH WARRANTIES TO THE DURATION AND REMEDIES OF THIS LIMITED WARRANTY. The following limitations on liability are in addition to the limitations on liability set forth in CERTIFY's of Use . If there is any conflict between those limitations and the below limitations, the below limitations will control, and the remaining limitations will continue in full force and effect. YOU AGREE THAT CERTIFY WILL NOT BE LIABLE TO YOU FOR ANY LOSSES OR DAMAGES ALLEGEDLY CAUSED BY THE PRODUCTS, INCLUDING ANY PERSONAL INJURIES ALLEGEDLY CAUSED BY THE PRODUCTS. YOU FURTHER AGREE THAT REPLACEMENT OF DEFECTIVE PRODUCTS IS YOUR SOLE AND EXCLUSIVE REMEDY UNDER THIS LIMITED WARRANTY. Questions, complaints, and other communications regarding the operation of the Products or defects in the Products should be directed to CERTIFY at support@certifyglobal.com . Questions, complaints, and other communications regarding any other aspect of this Hardware Policy should be directed to CERTIFY at info@certifyglobal.com . Illinois Biometric Information Notice Developer of Use Whom We Serve Healthcare Business Finance Products Authenticator Check-In QuickTouch Score About Partners Press FAQ's Careers"
  ]
}