{
  "company": "www.idsplinfo.in",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 7,
    "0": 7
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4615384615384615,
    "framing_surveillance": 0.1538461538461538,
    "framing_market": 0.3846153846153846,
    "num_docs": 14
  },
  "topic_timeline": {
    "20": {
      "-1": 7,
      "0": 7
    }
  },
  "sample_docs": [
    "Canteen Management Software is an automated software which enables all the activities of the canteen and maintain a detailed account of food served at the canteen.. It allows secure and speedy transactions. It helps management to handle the users by reducing the waiting time for the customers. Our software helps you to make the task much easy. It manages each and every aspect of the canteen right from the brunch to dinner. Canteen Management System helps to work seamlessly the dining facility without any hassle. This software helps to automate the canteen facility and makes it transparent. Additionally Biometric device is linked with this software to generate the reports of the employees in the Canteen. Real-time User Details Cashless Transaction Customizable Menu Smart Card Recharge Integrated with back office Cross-platform Support Cashless Transactions Time Limit Between Each Meals (Breakfast, Lunch, Dinner) Recharge of the particular user through by means of software One time swipe integration Secure and speedy Transactions Guest Card accessibility Alerts (Recharge, Block List emps) Any user can check their Transactions Display no of Card Swipes User wise Card Issue Department wise Card Issue Completely Scalable and Flexible",
    "Managing your workforce in an efficient, fast and smart way can significantly improve your business in of profit and productivity. Major Capabilities of Time and Attendance System include Attendance management, Time Management and leave management. Organizations cannot afford to require manual process between time reported and compensation. Rather, employee requests for leave or vacation time must be handled through accordance with policies of eligibility. Supports multiple companies of one organization in one location Supports to capture data from multiple input units installed for one Company Centralized database Company Rules, Time Management Parameters can be set easily Easy management to handle Employee, Department, Shift Master, Multiple Shift Support Leave Management support. Number of Reports Available through Software:- Daily Attendance, Statistics, Attendance, Staff on Duty, Department Attendance Reports etc. Data available in excel format for further calculation Supports multiple technologies – Smart Card , Biometrics , RFID Make time tracking easier - easily and efficiently track your employee time. Better manage your employees - Manage your time and attendance data and employee profiles. Improve your bottom line - Eliminate buddy punching and time theft. Handles any work environment - Track employee time from home, the worksite, multiple locations, and more. Make scheduling a breeze - Allow supervisors to quickly build shifts and schedules for their employees. Attendance Views (Day, Work Week, Week, Month, Year views) Automated Overtime Calculation Automated Late-In/Early-Out Calculation Grace Periods for Work Start/End Times Attendance Data Re-processing User defined Attendance Types Real-time and Editable Attendance Overtime Management User-defined Leave Types Late-In, Early-Out Reports Overtime Reports Sickness Reports Actual & Planned Work time Reports Daily/Monthly/Yearly Attendance Reports Modification History for attendance data (Who changed what and when?) Improving service levels and customer service through providing real-time alerting for unplanned absence Minimizing (or in some cases even eliminating) overtime, identifying opportunities to increase labor utilization Reducing absence Recording an accurate source of labor costs Highlighting potential labor budget overspends before they occur Reducing corporate risk through compliance to employment law. Personnel contracts, union agreements and legislative requirements e.g. the Working Time Directive. Minimize Human Errors Infallible Check and Balance Improved Organizational Efficiency and Productivity Value Addition to the Businesses Less Disgruntled Employees Efficient Payroll Processing",
    "Interactive Data Systems Limited offers a wide range of models in automatic Boom Barriers which are reliable and maintenance free. Models are available for boom length up to 8 m to suit various applications like car parking sites, condominiums, toll collection & industrial entrances. It is highly compact in size with extremely silent operation. The soft edges, rounded corners and high performance of the Boom Barriers offered by IDSL are suitable for any type of installation environment. The sturdy steel structure comes with scratch – proof coating which can resist harsh weather conditions. The wide range of lengths and accessories available ensure that all installation requirements are met. All models are equipped with a provision of manual operation in the event of power failure and battery back-up facility in selected models. Boom Barriers are available in wide range of models to suit various applications like car parking sites, condominiums, toll collection & Industrial entrance. Available for boom length up to 8 m. Highly compact in size has extremely silent operation. Sturdy steel structure with scratch-proof coating resistant to harsh weather conditions. Integration possible with wide range of accessories and all kinds of access control systems. Extremely reliable and maintenance free. Tested and distributed all over the world. Manual release in case of power failure. Battery backup facility in select models of boom barriers. The IDSL range is equipped with electronic declaration at opening and closing. A version with articulated barrier for low ceilings is available on request. The IDSL barrier is designed to accommodate use of optional items such as the limit-switch kit and anti-vandal value. Perfectly calibrated stopping, thanks to the adjustable electronic brake that shows down closing and opening movement. A thermal probe detects temperature and activates a cooling fan. With the no gear transmission system you can reach high levels of silence, reliability, long life and hassle free maintenance. The Economic solution - entry level barrier. Top Performance upto 7 mtrs / duty cycle 100%. For faster operations - opening closing time 2.0 - 0.8 sec./duty cycle 100%. Hydraulics (by-pass valve) very accurate and low acting threshold. Resistance - Higher Life 3 mm steel sheet body with cataphoresis treatment, cathode electroplating polyester painted UV resistant. The transmission motion to the beam is made by a balance spring and NIPLOY transmission shaft incorporated in a double bearing. The balance spring is submitted to a shot-penning treatment to increase resistance to stress.",
    "Most companies have a ticket system that allows employees to report various issues within the company premises. If there are Problems or Issues in different locations (ground locations, sites, departments) of a Company, the employee in the particular location have an access to raise a ticket regarding the issue to the concerned department or directly to the help desk of the Company. In most of the ticket management software's available in the market, the ticket are sent through email, where there is no way to make sure that tickets are read by the right person or to check or track whether the problem has been fixed and it can be difficult to manage this pool. It is important that Company have a central point of reference to manage all the incoming tickets effectively. In some cases even if the problem is fixed, nobody knows the person who reported the issue has received any information about the fix, which can be confusing to customers and employees. How is our Software Different from others? Our Ticket Management Software enables you to handle all your incoming tickets convenient and timely. Employees in the company send the issues in form of tickets which are sent to direct concerned departments in the company and can access them from any location of the company. You can Track Unassigned tickets, Overdue tickets, Closed and Escalated tickets easily and favorable. You can also arrange Service-Level agreements to ensure that all incoming tickets are resolved within the Allotted Time Limit. Our ticket Management system, is specifically designed by our engineers to organized various issues as they are reported and keeps track of all fixes made, acting also as an Issue Tracking System. Advantages of Implementing Ticket Management Software Manually Add Tickets View Details about tickets or specific ticket Assign tickets to particular department Reply to tickets Edit, Merge, Delete, Close Ticket Raise old unresolved Ticket to New ticket Sort tickets based on Priority Check the working status of tickets Check the Time Spent on the Ticket View record count Look for a specific ticket Import tickets and Export Tickets Add comments about specific tickets View recently received tickets and recent history of a specific ticket Employee Contact Info Display Submit tickets for Approval Look up the account names for specific contacts in the Add Ticket form Add Additional Comments in the particular Ticket",
    "The Gate Management Software is a leading technology used in managing access to gated communities and gated offices. The Gate Management System (GMS) is a complete system, which can manage, control and monitor an entire vehicle gate logs and all related equipment. It is designed to continue to operate even when network connectivity is lost so that residents and visitors are never inconvenienced with long lines and compromised security. The simple and organized design of the administrative workstation allows administrators to efficiently control the database. The user-friendly gate attendant workstation helps streamline visitor tracking and resident gate access by accurately and efficiently processing requests and maintaining operational effectiveness of gated community security personnel. You're Company Officials and residents will have peace-of-mind that their information is secure and being utilized to proactively manage guest access. Our Gate Management System is highly recommended for urban access, Business parks, Gated -communities, residential areas, Hotels. Local and Remote monitoring is possible by 1. Visitor Control 2. Access Control 3. Vehicle Control 4. Security monitoring Key Features of Gate Management System Gate Management Software is an ultimate use for Automatic Gate Pass System. System is simple to use & no supervisor is required Visitor can simply enter the visiting card & gate pass can be made automatically by using simple touch-screen operation. While scanning the card the photo of the visitor is also maintained & printed on gate pass. Visitor can also type the data on touch screen if required. The unique feature of this software is that it can record both the entry & the exit of any visitor in the premise. This enables you to close loop the entry exit system. The data of the visitors can be easily maintained & accessed at a later date. This Software is being integrated with the following products Boom Barriers/Flap Barriers Turnstiles UVSS (Under vehicle surveillance systems) ALPR Cameras(Automatic number plate recognition ) Control and Monitoring – Vehicles cannot advance until all required data is entered, ensuring all vehicles are properly logged and accounted for. Detailed log – An extensive event log registers all vehicle passages and provides information regarding the status of the gate. Improved Process Times – More effective processing reduces delays and traffic buildup especially at peak periods. Reporting Made Easy – The central processing computer stores relayed data that can be filtered for customized reporting capabilities. Effective Management and Oversight – Gate Management Software generates an accurate record logs for all vehicles Enhanced Communication – The system centralizes all data and notification information for easy access and pass-along capabilities - no more notes posted that officers may or may not see. Easy integration – The Gate management Software allows for easy integration into existing management applications. Easy upgrade – Upgrade of new or customer specific policies can easily be implemented by means of software, without change of hardware."
  ]
}