{
  "company": "www.gbgplc.com",
  "dominant_topics": [
    0,
    36,
    5,
    15,
    -1
  ],
  "topic_counts": {
    "0": 146,
    "36": 11,
    "5": 3,
    "15": 3,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "36": "gbg, personal, information, personal information, data",
    "5": "aml, smartsearch, money, laundering, money laundering",
    "15": "melissa, data, data quality, address, zip"
  },
  "framing_scores": {
    "framing_ethical": 0.6724782067247821,
    "framing_surveillance": 0.0211706102117061,
    "framing_market": 0.3063511830635118,
    "num_docs": 168
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 146,
      "2": 2,
      "5": 3,
      "7": 1,
      "15": 3,
      "36": 11
    }
  },
  "sample_docs": [
    "A digital first approach is no longer the future. Consumers expect to be able to create and use an account within minutes, with minimal interaction or friction. But how do financial institutions trust the identity on the other side of the screen? For some organisations their identity verification process will be driven by their risk appetite; in others, it will be driven by compliance requirements, but all organisations will be focused on growth. Hear from industry experts: Jonathan Care, Research Director, Gartner Jonathan Care, Research Director, Gartner Jonathan Holman, Head of Digital Transformation, Santander Jonathan Holman, Head of Digital Transformation, Santander Eric Wu, Head of Financial Crime Technology, Revolut Eric Wu, Head of Financial Crime Technology, Revolut Gus Tomlinson, General Manager, GBG Gus Tomlinson, General Manager, GBG © Copyright 2020 GB Group plc ('GBG')",
    "Our Live Q&A format means you're in control. We'll show you how simple it is to move to digital identity verification and how a recent customer switched from their manual process in just 42 hours - all with no complicated integrations. Then, it's over to you. We invite you to share your challenges and we'll share our practical tips to get your business digital-ready this week . You will leave knowing: How to verify customers in seconds How to verify customers in seconds Why digital is a better process Why digital is a better process How this ensures your business is AML compliant How this ensures your business is AML compliant © Copyright 2020 GB Group plc ('GBG')",
    "A digital first approach is no longer the future. Consumers expect to be able to create and use an account within minutes, with minimal interaction or friction. But how do financial institutions trust the identity on the other side of the screen? For some organisations their identity verification process will be driven by their risk appetite; in others, it will be driven by compliance requirements, but all organisations will be focused on growth. Digital transformation acceleration How organisations are adapting to a digital-first approach because of COVID-19 How organisations are adapting to a digital-first approach because of COVID-19 Building online trust How to build trust with the identity that's on the other side of the screen How to build trust with the identity that's on the other side of the screen Current challenges The main challenges that organisations are facing regarding digital identity verification The main challenges that organisations are facing regarding digital identity verification Jonathan Care is Research Director at Gartner Research. His areas of expertise include payment systems, cybersecurity, fraud detection and prevention applications, authentication, identity proofing, identity theft and insider threats. He also covers the PCI compliance program, tokenization and the security aspects of payment systems. His technical experience provides insight into application and network security, including secure coding standards and practices, red/blue teaming, vulnerability management, and firewalls, IDS/IPS and SIEM. Head of FinCrime Technology, Revolut Born and raised in Ottawa, Eric Wu graduated from Waterloo's math faculty and now lives in the UK building financial crime technology for Revolut. A basic challenge faced daily is the connection of financial crime concepts with practical reality, including deciding how to use a variety of technology, tools, and processes. Parts of this are extremely difficult. Firstly, making the right decisions in accordance with risk, and additionally building processes that allow the business to grow and even accelerate. Eric's team at Revolut focuses on this \"fincrime-hard\" space - a set of problems that, if solved, will provide significant value in advancing the industry and reaching best practice in regulation and operations. Head of Digital Transformation, Santander Jonathan Holman is a corporate banker who runs Digital for Santander in SME, Commercial and Corporate in the UK. He holds an undergraduate degree in mechanical engineering and a masters' degree in banking management and practice. He has held roles in coverage (relationship banking), credit risk, operations, change and leadership. He researched and wrote his masters' degree dissertation, using scale social data in credit risk modelling, using AI, which was a global first. Jonathan's team have won 8 global industry awards in recent years for their work in banking technology. Jonathan is a visiting scholar at the LIBF university college, advising and teaching on Fintech and Regtech. Digital Identity Expert, GBG As General Manager of Identity Fraud Europe, Gus leads the strategic development of the group's Identity Fraud proposition. With deep experience in global data, regulations and market trends, Gus is an expert in identity technology and the global markets our customers operate in. Gus' key responsibility is to drive innovation and extend the reach of GBG's Identity Fraud technology, ensuring businesses across Europe can remain compliant and fight fraud.",
    "In an environment where new regulations are frequently introduced, the state of identity verification is in flux. The only way to stay competitive is to learn how to balance the demands of regulatory compliance with an exciting user experience. This changing regulatory landscape will impact how we verify identity. New regulations will affect Fintech businesses, so prepare for it now with a sound, user-friendly onboarding experience. Is your organisation prepared for change? For Fintech businesses like yours, the upcoming regulations and legislation outlined below will affect how you can complete identity verification requirements: The Fifth Anti-Money Laundering Directive (5AMLD) The Revised Payment Services Directive (PSD2) Harness this information to define all possible user journeys that could arise under the new regulatory frameworks. According to Forrester, abandonment rates can reach at least 54% when it comes to financial matters. Millennials expect so much more from the businesses they interact with, and will seek out better experiences from your competitors if you can't meet their needs. Just complying with the new regulations alone isn't enough. Your customers demand an exceptional user experience at the same time, without compromise. It's up to you to give it to them. Use our UX design principles to build a sign-up and verification process that works, for you and your customers Compliance should work hand in hand with your UX strategy. We can show you the key areas to consider when introducing new processes for meeting your compliance responsibilities, through numerous UX principles which you should adhere to. Whether that's where to consider international differences in identity verification, how to utilise photo-capture technology in your processes, or where to deploy on-brand micro-copy, we'll take you through the simple measures you need to streamline your user journeys. Take the initiative and see how you can balance regulatory compliance with a great user experience, all before your competitors do, by downloading our UX guide. Our best practice guide provides you with further detail, outlining how to present data collection fields to your customers, which will help you collect the data necessary to successfully verify their identities. Download below. Speak to one of our identity verification specialists to book a demo.",
    "A digital first approach is no longer the future. Consumers expect to be able to create and use an account within minutes, with minimal interaction or friction. But how do financial institutions trust the identity on the other side of the screen? For some organisations their identity verification process will be driven by their risk appetite; in others, it will be driven by compliance requirements, but all organisations will be focused on growth. Digital transformation acceleration How organisations are adapting to a digital-first approach because of COVID-19 How organisations are adapting to a digital-first approach because of COVID-19 Building online trust How to build trust with the identity that's on the other side of the screen How to build trust with the identity that's on the other side of the screen Current challenges The main challenges that organisations are facing regarding digital identity verification The main challenges that organisations are facing regarding digital identity verification Jonathan Care is a Research Director at Gartner Research. Areas of expertise include; payment systems, cybersecurity, fraud detection and prevention applications, authentication, identity proofing, identity theft and insider threats. He also covers the PCI compliance program, tokenization and the security aspects of payment systems. His technical experience provides insight into application and network security, including secure coding standards and practices, red/blue teaming, vulnerability management, and firewalls, IDS/IPS and SIEM. Head of FinCrime Technology, Revolut Born and raised in Ottawa, graduated from Waterloo's math faculty, and now lives in the UK building financial crime technology for Revolut. A basic challenge we face daily is the connection of financial crime concepts with practical reality, including deciding how to use a variety of technology, tools, and processes. Parts of this are extremely difficult: (1) making the right decisions in accordance with risk, and (2) building processes that allow the business to grow and even help accelerate. Our team focuses on this \"fincrime-hard\" space - a set of problems that, if solved, will provide significant value in advancing the industry and reaching best practice in regulation and operations. Head of Digital Transformation, Santander Jonathan Holman is a corporate banker who runs Digital for Santander in SME, Commercial and Corporate in the UK. He is a mechanical engineer by undergraduate degree and a masters' degree in banking management and practice. He has held roles in coverage (relationship banking), credit risk, operations, change and leadership. He researched and wrote his masters' degree dissertation, using scale social data in credit risk modelling, using AI, which was a global first. Jonathan's team and he have won 8 global industry awards in recent years for their work in banking technology. Jonathan is a visiting scholar at the LIBF university college, advising and teaching on Fintech and Regtech. Digital Identity Expert, GBG As General Manager, Identity Fraud – Europe Gus leads the strategic development of the group's Identity Fraud proposition. With deep experience in global data, regulations and market trends, Gus is an expert in identity technology and the global markets our customers operate in. Gus' key responsibility is to drive innovation and extend the reach of GBG's Identity Fraud technology, ensuring businesses across Europe can remain compliant and fight fraud."
  ]
}