{
  "company": "www.soberlink.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Your Path to Peace of Mind The Soberlink user blows into our professional-grade breathalyzer device. Facial recognition ensures the right person is testing. Verified test results are sent via text or email. Get Started Your Path to Peace of Mind Results You Can Trust Equipped with premier features, Soberlink delivers an unparalleled experience in remote alcohol testing. Facial Recognition Similar to your phone's face ID, our technology verifies identity at the time of testing, eliminating the need for manual review. Tamper Detection Because attempting to cheat alcohol testing is common, our system flags a variety of tampering methods, so there's no questioning the results. Instant Alerts These results are important to you. Our system sends instant alerts via text or email for immediate relief. Advanced Reporting ™ Your time is valuable. Our reporting system uses AI to provide a clear snapshot of alcohol testing details so you're not left sifting through pages of testing data. Get Started Results You Can Trust Equipped with premier features, Soberlink delivers an unparalleled experience in remote alcohol testing. Size : 4.77†x 2.76†x 1.40†Weight : 6.7 oz. (190 grams) Device Requirements : A smartphone is not needed. Size : 4.75\"h x 2.5\"w x 1.25\"d Weight : 5.3 ounces (150 grams) Device Requirements : Requires a smartphone. iOS 8 or higher or Android 7 or higher. Monitoring on Your Choose how you'll be using Soberlink. Contact Us Thank you! Your submission has been received! There's a technical issue with this form. Please contact support@soberlink.com for help.",
    "Monitoring Promotes Accountability ® Linking Sobriety with Technology Soberlink is a comprehensive alcohol monitoring system. Combining a breathalyzer with wireless connectivity, Soberlink automatically documents proof of sobriety in real-time which gives clients a sense of accomplishment while rebuilding trust with others. Adaptive Facial Recognition technology Real-time text message reminders and Alerts Soberlink devices use facial recognition technology to confirm identity during each breath test. BAC results are wirelessly transmitted in real-time via Verizon's Private Network to Soberlink's cloud-based recovery management software. The Soberlink System allows for custom testing schedules, as well as specific notification and automated report settings. Automated Reminders and Alerts Text message reminders for Clients Email/text message Alerts for designated Contacts Automated overview Reports – daily, weekly, monthly Internal device sensors dedicated to tamper detection Proprietary technology flags inconsistencies with human breath Government-grade facial recognition software Adapts to subtle appearance changes Reduces manual process of test photo review Reliability You Can Trust The FDA cleared Soberlink system has multiple patents and is a registered medical device in the state of California. Soberlink devices are manufactured in the USA. Every device passes through rigorous testing and upholds the highest manufacturing certifications: ISO 9001, 14001, 13485, AS9100, and OHSAS18001 certified by UL-DQS ITAR registered (M16646). About Soberlink's Technology » \"I find Soberlink to be a very tangible and straight forward method of accountability. Accountability is so important in recovery, even if it is just seen as an expression of humility. Ultimately, the patients that use Soberlink are making an active effort to do what they say they are going to do, when they are going to do it… A simple test in a device is practicing accountability and strengthening that accountability muscle!\" Dominic Angres, LCPC, CADC Executive Director, Positive Sobriety Institute, Chicago, IL \"Soberlink has revolutionized the way we approach the treatment of alcoholism.\" Blayre CEO, Veritas Treatment Facility \"The Oklahoma Health Professionals Program has been utilizing the Soberlink product and it is a wonderful tool that gives us 7 days a week real time monitoring for alcohol. We would highly recommend this for any monitoring program.\" Dr. Robert Westcott Medical Director, OHPP \"Soberlink's ease of use now removes the hassle and substantial hurdles that we faced in the past in getting real-time confirmation of alcohol abstinence.\" Dr. David Bryman FAA International Senior Aviation Medical Examiner \"We have been using SOBERLINK for over a year now and have found SOBERLINK to be an effective part of our patients' accountability system. SOBERLINK is a compliment to Intensive Outpatient Program and aftercare. It is also a great travel companion for those patients who travel while in treatment. We continue to utilize SOBERLINK because it works!\" Michael Herbert Caron Renaissance Treatment Center \"We are really valuing the SOBERLINK monitoring as a wonderful addition and reinforcement to our program here!\" Aimee Greenfield Evaluation Coordinator, Professionals Treatment at Promises Treatment One of our participants had a severe relapse and was suicidal but he tested anyway. We were able to act immediately because of Soberlink. He is very thankful that he survived!†Oklahoma PHP Soberlink has been a great addition to the Connection recovery support program. Nell Hurley, Manager of Recovery Support, Hazelden Betty Ford Foundation Manager of Recovery Support, Hazelden Betty Ford Foundation \"Clients that leave the program with a Soberlink device do the best out of all our clients and we have evidence to say that they are successful.\" Royce Dockrill Valiant Recovery Valiant Recovery \"Soberlink helps my clients change old patterns and offers them structure and accountability, which are vital for a successful recovery. I couldn't think of a more effective tool for my clients who struggle with alcohol addiction.\" Dr. Shannon Hanrahan Clinical Psychologist \"I wish everyone could leave a treatment center with Soberlink in their hands, it's a great tool.\" Cindy Feinberg Recovery Coach of NY Recovery Coach of NY \"Soberlink appears to be the most user-friendly, sensitive, and specific way to monitor alcoholic abstinence. My prediction is that Soberlink will soon replace all forms of alcohol monitoring on the market today.\" Dr. Gregory Skipper - Medical Director for Promises Professional Health Program Medical Director for Promises Professional Health Program \"Here at The Recovery Coach, we provide that excellent treatment, and our long term plan continues at home with additional support and accountability. Ultimately I wish everyone would leave a treatment center with Soberlink in their hands, it's a great tool.\" Cindy Feinberg, The Recovery Coach The Recovery Coach I would recommend Soberlink to my colleagues because I've seen the relationships that can built with the case manager and client just by using Soberlink. Elizabeth Duffy, Caron, Ocean Drive Director of Aftercare Services"
  ]
}