{
  "company": "www.a3bc.io",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 14,
    "0": 7
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 14,
      "0": 7
    }
  },
  "sample_docs": [
    "About us Mission Statement Our ambition is to help build a safer real & digital world by providing to each citizen for free the capacity to create and manage its own biometric digital identity. Relying on the state-of-the art cyber security methods and including the latest technologies such as blockchain. Thus, enhancing the trust between people, between people and corporates. Our Core Team A highly experienced team coming from different industries and mastering the digital identity landscape. Dinesh Ujoodah CEO & Co-founder 25 years + in international financial institutions Accenture, IBM & Société Générale Graduated from London Business School and Columbia University NY (USA) Daniel Krob Advisor & Co-founder 35 years+ in the computer science & IT sectors, CESAMES CEO Specialized in complex architecture, engineering & modelling. Graduated from ENS, PhD in Computer Science, INCOSE fellow, For life CNRS Director Nicolas Israël Chief Technology Officer 20 years + in managing IS infrastructure and security & risk Treezor production manager , TalkToPay Biometric solutions & PW Consultants Graduated from ENSTA and post graduated in cryptography Marco Mikhail VP Sales Europe 18 years+ in sales Dynacom, Total Direct Energies, Entre Particuliers, Vous Financer& Wifox Graduated from ESTC Florin Blejan Sales Rep. Romania 17 years+ in managing teams in IT sector & broadcasting industry Felicitaro, Antena TV Group & NFC Expert Graduated Politechnic University of Bucharest, Computer Science Jarmo Haapalainen Head of Nordics 35 years+ in entrepreneurship & consulting Nokia, Nokia Siemens Network & Smart Up Capital MBA in Sheffield Hallam University (UK) & Business and Administration from Finland Our Journey After few years of R&D, A3BC got granted some patents and has already made 4 fund raising rounds including industrial & VC partners. ​ Our Ecosystem Labels Recruitment A3BC is hiring specialists in sales, marketing, communication, client services and technology. Contact : recrutement@a3bc.io Our ambition is to help build a safer real & digital world by providing to each citizen for free the capacity to create and manage its own biometric digital identity. Relying on the state-of-the art cyber security methods and including the latest technologies such as blockchain. Thus, enhancing the trust between people, between people and corporates. A highly experienced team coming from different industries and mastering the digital identity landscape. Dinesh Ujoodah CEO & Co-founder 25 years + in international financial institutions Accenture, IBM & Société Générale Graduated from London Business School and Columbia University NY (USA) Daniel Krob Advisor & Co-founder 35 years+ in the computer science & IT sectors, CESAMES CEO Specialized in complex architecture, engineering & modelling. Graduated from ENS, PhD in Computer Science, INCOSE fellow, For life CNRS Director Nicolas Israël Chief Technology Officer 20 years + in managing IS infrastructure and security & risk Treezor production manager , TalkToPay Biometric solutions & PW Consultants Graduated from ENSTA and post graduated in cryptography Marco Mikhail VP Sales Europe 18 years+ in sales Dynacom, Total Direct Energies, Entre Particuliers, Vous Financer& Wifox Florin Blejan Sales Rep. Romania 17 years+ in managing teams in IT sector & broadcasting industry Felicitaro, Antena TV Group & NFC Expert Graduated Politechnic University of Bucharest, Computer Science Jarmo Haapalainen Head of Nordics 35 years+ in entrepreneurship & consulting Nokia, Nokia Siemens Network & Smart Up Capital MBA in Sheffield Hallam University (UK) & Business and Administration from Finland After few years of R&D, A3BC got granted some patents and has already made 4 fund raising rounds including industrial & VC partners. ​ A3BC is hiring specialists in sales, marketing, communication, client services and technology.",
    "Connecting humans with technology No more cards, codes & passwords!​ The best way to prove who you pretend to be!​ In a nutshell Digital ID in action We have all been exposed recently, unexpectedly fast, to a new living paradigm. Humans and businesses are pushed to reconfigure their growth cycles. Much ahead of time, A3BC envisaged that future comes with simplicity, security and smooth passing through every-day activity, through life and we came with an unprecedent breakthrough biometric Digital Identity platform. We are providing a digital trust third-party platform which is enhancing your security level. We strongly believe trust & cyber-security are not an option at all! They are a must have within the digital society! And our platform is here to support your business! ​ What we do for you Digital ID in your daily life Secure The end-user always keeps the control of its data. The end-user is the only one who decide who can access its data, when and how long. Data are always encrypted, and the storage protocol is patented. 100% GDPR compliant! Easy Our aim is to provide the simplest ever enrolment process combined with biometric authentication to ease your daily life. Available both for online and Face-To-Face transactions. We provide clarity, simplicity & speed. Universal Enroll only once! Use it as much as you want! Anything, Anywhere, Anytime. Independent from Big-Tech. Fully inclusive: device-less, card-less, Id-less. Scan, Trust & Go! The best platform ever to prove you are the one you pretend to be! See it in action Our application TRUSTME TRUSTME is a digital ID service. It is seamless and intuitive : Swipe, Trust & Go! Create your digital ID Store safely your personal data : passwords, IDs, diplomas, tax notices... automatically onto your favourite websites and use biometry to validate your transactions Use your digital ID only as you want Our Platform TRUSTME Platform Beyond IAM Solution! We have designed, built and deployed a digital trust third-party platform in a SaaS mode. Data privacy by design compliant with EU GDPR regulation! eIDAS certification process has already began! Zero-encryption & Self-Sovereign Identity (SSI) capacities will be included soon! Discover our B2B offers All together now all-in-one Trust ME can simplify your life! Play video Our Partners Try our platform ! Please contact us if you want to set up a demonstration Connecting humans with technology No more cards, codes & passwords!​ The best way to prove who you pretend to be!​ Connecting humans with technology No more cards, codes & passwords!​ The best way to prove who you pretend to be!​ In a nutshell Digital ID in action We have all been exposed recently, unexpectedly fast, to a new living paradigm. Humans and businesses are pushed to reconfigure their growth cycles. Much ahead of time, A3BC envisaged that future comes with simplicity, security and smooth passing through every-day activity, through life and we came with an unprecedent breakthrough biometric Digital Identity platform. We are providing a digital trust third-party platform which is enhancing your security level. We strongly believe trust & cyber-security are not an option at all! They are a must have within the digital society! And our platform is here to support your business! ​ Digital ID in action We have all been exposed recently, unexpectedly fast, to a new living paradigm. Humans and businesses are pushed to reconfigure their growth cycles. Much ahead of time, A3BC envisaged that future comes with simplicity, security and smooth passing through every-day activity, through life and we came with an unprecedent breakthrough biometric Digital Identity platform. We are providing a digital trust third-party platform which is enhancing your security level. We strongly believe trust & cyber-security are not an option at all! They are a must have within the digital society! And our platform is here to support your business! ​ What we do for you Digital ID in your daily life Secure The end-user always keeps the control of its data. The end-user is the only one who decide who can access its data, when and how long. Data are always encrypted, and the storage protocol is patented. 100% GDPR compliant! Easy Our aim is to provide the simplest ever enrolment process combined with biometric authentication to ease your daily life. Available both for online and Face-To-Face transactions. We provide clarity, simplicity & speed. Universal Enroll only once! Use it as much as you want! Anything, Anywhere, Anytime. Independent from Big-Tech. Fully inclusive: device-less, card-less, Id-less. Scan, Trust & Go! The best platform ever to prove you are the one you pretend to be! See it in action Digital ID in your daily life Our application TRUSTME TRUSTME is a digital ID service. It is seamless and intuitive : Swipe, Trust & Go! Create your digital ID Store safely your personal data : passwords, IDs, diplomas, tax notices... automatically onto your favourite websites and use biometry to validate your transactions Use your digital ID only as you want TRUSTME is a digital ID service. It is seamless and intuitive : Swipe, Trust & Go! Create your digital ID Create your digital ID Store safely your personal data : passwords, IDs, diplomas, tax notices... Store safely your personal data : passwords, IDs, diplomas, tax notices... automatically onto your favourite websites and use biometry to validate your transactions automatically onto your favourite websites and use biometry to validate your transactions Use your digital ID only as you want Use your digital ID only as you want Our Platform TRUSTME Platform Beyond IAM Solution! We have designed, built and deployed a digital trust third-party platform in a SaaS mode. Data privacy by design compliant with EU GDPR regulation! eIDAS certification process has already began! Zero-encryption & Self-Sovereign Identity (SSI) capacities will be included soon! Discover our B2B offers All together now all-in-one Trust ME can simplify your life! Play video Trust ME can simplify your life! Try our platform ! Please contact us if you want to set up a demonstration",
    "Business Benefits Digital Identity in our everyday life! Data Privacy is highly regulated! Cyber-Security is an obsession! A3BC is committed to a trust & secure digital society. Thanks to our SaaS Platform you can offer to your customers the best experience ever to prove who they pretend to be. Easy, Fast & secure. With or without a smartphone. With A3BC your customer benefits from a fast-track enrolment process combined with a remote identity control within a trusted KYC & respecting the AML 5 rules. With A3BC your customer can open a bank account, subscribe a loan or apply to a club just in few seconds; by showing their hands! They can also prove their age (>18) while keeping their anonymity just by showing their hand. And many more… A custom-fit platform designed for you ​ Our platform manages the entire customer data life & its digital identity. In compliance with all the EU regulation such as GDPR, AML 5, … Your customers always keep the control over their data. The authentication is performed thanks to strong password and/or our biometric features. We have 3 offers: ​ Hi, It's really me! You want to check your customer identity & liveness. Online and/or Face-To-Face. Real time. Fast & Secure! Hi, I am authorized! You want to check if your customer is allowed to perform a transaction (>18). Online and/or Face-To-Face. Real time. Fast & Secure! Hi, who am I? You want to find out someone's identity & authenticate him/her. Online and/or Face-To- Face. Real time. Fast & Secure! Integration methods You can benefit from the platform within a SaaS Model thanks to our Plug & Play SDK or by directly using TRUSTME App and its OpenID Connect relying on the market state-of-the-art connector or by leveraging on our Digital Identity White Label App in connection with our preferred Integrator Onepoint . Digital ID SDK Integration SDK + Standard API Integration A3BC SDK with your own mobile app. Benefit from your own tenant and integrate with our REST APIs. Use standard OpenID Connect API to let Service Providers integrate with your tenant. Digital ID Service Provider Trust Me Application Use our Trust Me application. Use standard OpenID Connect API to let Service Providers integrate with your tenant. Digital ID White Label Build your own Digital ID application Adapt our app to your needs. Benefit from your own tenant and integrate with our REST APIs. Use standard OpenID Connect API to let Service Providers integrate with your tenant. API Documentation Please reach out to us, through the contact form or via email at contact@a3bc.org to know more about our APIs. Digital Identity in our everyday life! Data Privacy is highly regulated! Cyber-Security is an obsession! A3BC is committed to a trust & secure digital society. Thanks to our SaaS Platform you can offer to your customers the best experience ever to prove who they pretend to be. Easy, Fast & secure. With or without a smartphone. With A3BC your customer benefits from a fast-track enrolment process combined with a remote identity control within a trusted KYC & respecting the AML 5 rules. With A3BC your customer can open a bank account, subscribe a loan or apply to a club just in few seconds; by showing their hands! They can also prove their age (>18) while keeping their anonymity just by showing their hand. And many more… A custom-fit platform designed for you ​ Our platform manages the entire customer data life & its digital identity. In compliance with all the EU regulation such as GDPR, AML 5, … Your customers always keep the control over their data. The authentication is performed thanks to strong password and/or our biometric features. We have 3 offers: ​ You want to check your customer identity & liveness. Online and/or Face-To-Face. Real time. Fast & Secure! You want to check if your customer is allowed to perform a transaction (>18). Online and/or Face-To-Face. Real time. Fast & Secure! You want to find out someone's identity & authenticate him/her. Online and/or Face-To- Face. Real time. Fast & Secure! You can benefit from the platform within a SaaS Model thanks to our Plug & Play SDK or by directly using TRUSTME App and its OpenID Connect relying on the market state-of-the-art connector or by leveraging on our Digital Identity White Label App in connection with our preferred Integrator Onepoint . SDK + Standard API Integration A3BC SDK with your own mobile app. Benefit from your own tenant and integrate with our REST APIs. Use standard OpenID Connect API to let Service Providers integrate with your tenant. Digital ID Service Provider Use our Trust Me application. Use standard OpenID Connect API to let Service Providers integrate with your tenant. Digital ID White Label Build your own Digital ID application Adapt our app to your needs. Benefit from your own tenant and integrate with our REST APIs. Use standard OpenID Connect API to let Service Providers integrate with your tenant. Please reach out to us, through the contact form or via email at contact@a3bc.org to know more about our APIs.",
    "Consumers Benefits Digital Identity in our everyday life! You just need to be over 18 years old and have a smartphone to create your own digital ID. It's totally free! Enroll once and use it as many as you want! Anything, Anytime, Anywhere! A remote identity & liveness check. Opt-in to register your fingerprint. Fast & secure access to your data. Fast & secure access to any services. We always ask the customer explicit consent for storage or data transfer. We always encrypt the data from the capture to the storage and the transportation itself to avoid any fraud or usurpation. Enroll yourself!​ Enroll in less than 1 minute and use it in real time. Not needed anymore to create a profile each time you want to access to a service. No more pin-code, passwords, cards… and you are done. Just show your hand! Complete your Digital ID! ​ Once enrolled you can complete your digital identity at your own pace. Keep control over your data! You are the only one to access to your data and to decided which ones you want to share with others. GDPR compliant. ​ Authentication methods ​ Multi-factor authentication in order to provide a maximum level of security​, online or face-to-face. Phone Establish your proof of possession. Fingerprint You can choose to add your fingerprint to your Digital Identity. Fingerprint recognition is a secure and legal means of identification & authentication. ​ Password You can also set a strong password in addition of the fingerprint recognition. Be the first to create your biometric Digital ID! Get the app now and create your digital ID in a few simple steps. Digital Identity in our everyday life! You just need to be over 18 years old and have a smartphone to create your own digital ID. It's totally free! Enroll once and use it as many as you want! Anything, Anytime, Anywhere! A remote identity & liveness check. Opt-in to register your fingerprint. Fast & secure access to your data. Fast & secure access to any services. We always ask the customer explicit consent for storage or data transfer. We always encrypt the data from the capture to the storage and the transportation itself to avoid any fraud or usurpation. Enroll in less than 1 minute and use it in real time. Not needed anymore to create a profile each time you want to access to a service. No more pin-code, passwords, cards… and you are done. Just show your hand! Complete your Digital ID! ​ Once enrolled you can complete your digital identity at your own pace. Keep control over your data! You are the only one to access to your data and to decided which ones you want to share with others. GDPR compliant. ​ Multi-factor authentication in order to provide a maximum level of security​, online or face-to-face. Establish your proof of possession. You can choose to add your fingerprint to your Digital Identity. Fingerprint recognition is a secure and legal means of identification & authentication. ​ You can also set a strong password in addition of the fingerprint recognition. Be the first to create your biometric Digital ID! Get the app now and create your digital ID in a few simple steps.",
    "Consumers Business General Why should we work with A3BC? We are a digital identity provider. Digital identities allow users to have a fast, easy and universal access to digital services. Our fast-track onboarding process is fully GDPR-compliant and can be done in less than 3 minutes. The biometric authentication process is the fastest and most secure way for the user to access to their personal data. Our solution also allows you to retrieve really fast the necessary documents. It is fast, secure and seamless. Users/customer are in complete control and feel reassured along their digital journey. Are you compliant with GDPR? Yes. We are fully compliant with the GDPR regulation. What features do you offer? GDPR compliance, Personal data collect, Personal data check, PVID, Financial Data Collect, Financial Data Check, Strong Customer Authentication (Knowledge, Possession, Biometric), Biometric User authentication (1:1), Biometric User identification & authentication Contract signature, Patented data storage protocol, Digital Id creation, Digital Id Management, Open Id Connect and many more to come! Which plateforms are you compatible with? We have state-of-the-art APIs that can be used with any platform. We also use the OpenID Connect standard, which sets a easy and secure connection with any business. How much does your solution cost? We offer a price model that includes a fixed price per user for unlimited usage. The price depends on the integration method and the customer offer you choose. Please do not hesitate to reach out to us. We will discuss with you to have the most tailored solution for you. Why should we work with A3BC? We are a digital identity provider. Digital identities allow users to have a fast, easy and universal access to digital services. Our fast-track onboarding process is fully GDPR-compliant and can be done in less than 3 minutes. The biometric authentication process is the fastest and most secure way for the user to access to their personal data. Our solution also allows you to retrieve really fast the necessary documents. It is fast, secure and seamless. Users/customer are in complete control and feel reassured along their digital journey. Are you compliant with GDPR? Yes. We are fully compliant with the GDPR regulation. What features do you offer? GDPR compliance, Personal data collect, Personal data check, PVID, Financial Data Collect, Financial Data Check, Strong Customer Authentication (Knowledge, Possession, Biometric), Biometric User authentication (1:1), Biometric User identification & authentication Contract signature, Patented data storage protocol, Digital Id creation, Digital Id Management, Open Id Connect and many more to come! Which plateforms are you compatible with? We have state-of-the-art APIs that can be used with any platform. We also use the OpenID Connect standard, which sets a easy and secure connection with any business. How much does your solution cost? We offer a price model that includes a fixed price per user for unlimited usage. The price depends on the integration method and the customer offer you choose. Please do not hesitate to reach out to us. We will discuss with you to have the most tailored solution for you."
  ]
}