{
  "company": "www.anduril.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 5,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.3846153846153846,
    "framing_surveillance": 0.3846153846153846,
    "framing_market": 0.2307692307692307,
    "num_docs": 7
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 5
    }
  },
  "sample_docs": [
    "Some companies make software. Some make hardware. We do both. Lattice is an AI backbone that uses computer vision, machine learning and mesh networking to fuse real-time data into a single, autonomous operating picture. Each Anduril product houses a Lattice AI Core that performs sensor fusion, target classification and multi-track reconciliation at the edge. Lattice also integrates third-party data to further expand context for decision-making. Everything communicates through a resilient network to create real-time situational awareness so human operators can respond instantly and accurately with the best information possible. Sentry towers are equipped with the latest sensor and networking technology, using Lattice to fuse data from across the electromagnetic spectrum — from thermal to visible to RF. With a compact footprint, hardened onboard processing and solar power architecture, Sentry can be rapidly deployed and sustained with minimal maintenance in austere conditions. Sensor fusion and object detection are performed onboard in real-time, only sending user-filtered data for optimized communication and cognitive loads. Sentry is extensible and can be customized with mission-specific equipment ranging from sensors to power sources. Ghost 4 is an autonomous VTOL sUAS that operates on the Lattice AI platform. Ghost 4 is modular, man-portable, waterproof, and combines long endurance, high payload capacity and a near-silent acoustic signature for a wide variety of mission capabilities. Ghost 4 is designed and manufactured in the US to meet the needs of our military users. Ghost 4 provides real-time surveillance, intelligence, and reconnaissance capabilities, creating a clearer common operating picture which enables service men and women make more informed decisions. Anvil is the kinetic element of our end-to-end cUAS capability. Cued by Lattice, Anvil navigates autonomously to intercept potential drone threats and provide visual feedback for positive identification by a human operator. Once authorized, Anvil uses physical speed and onboard terminal guidance to deliver kinetic energy to the threat with minimal collateral damage. Our products actively support a wide range of missions. Here are some examples. We work directly with end users to solve their real-life problems and continuously improve our capabilities. We deploy engineers to the field, whether in training or in combat to validate our ideas under actual conditions. US Customs & Border Protection Patrol Agent We had no way to determine just how much traffic our sector really had until we installed the Sentry towers. \" US Northern Command Unified Combatant Command We started at 350 knots and accelerated to 400 knots, then 450 knots, 500 knots. Eventually we had a solid autonomous detection and ID within 1 second on an F-16 at 500 feet going 550 knots. \" UK Royal Marines 40 Commando What's different with Ghost is that it's built for soldiering purposes. It's always searching, it's constantly looking. This isn't just a drone with a camera, it's AI. \"",
    "Anduril at Navy Sea Air Space Find us at Booth #527 Anduril is excited to exhibit at the Navy League Sea Air Space Exposition between April 4-6. You can find us at Booth #527 in the Main Exhibit hall, where we will showcase how software and autonomous systems can bring transformative capabilities to the Navy. You can preview the products we'll be showcasing at the expo below. Reliable, Autonomous and Rapidly Configurable AUV DIVE-LD is an Autonomous Underwater Vehicle that rapidly reconfigures to integrate diverse payloads and go long distances without being detected. It brings together advanced autonomy and multi-sensor integrations with a low logistical footprint to deliver a new capability to the subsea domain. Autonomy for Every Mission Lattice OS is an AI-powered, open operating system that brings autonomy to defense's toughest missions. Lattice enables operators to collapse kill chains in minutes not hours. By fusing and integrating thousands of sensors and effectors into a single intelligent C2 mission engine, Lattice enables operators understand, decide, and act across multi-domain assets in a single screen. Agile-Launched, Tactically-Integrated Unmanned System (ALTIUS) Autonomous Air Launched Effects Created by Area-I , ALTIUS is a low cost, attritable, and autonomous UAS designed to shape the battlespace by extending the reach and impact of operations in deployed environments. ALTIUS provides the versatility of launching from air, land, or sea to extend the reach, time on mission and impact of host platforms. The most intelligent VTOL Group 2 sUAS With real-time intelligence, surveillance and multi-mission reconnaissance capabilities, 60 minutes of continuous flight and near-silent acoustics, Ghost is mission ready. Wide-Area Infrared System for Persistent Surveillance (WISP) WISP delivers AI-enabled, passive, full-motion, 360-degree high-quality imaging to enable persistent automated threat detection. WISP is built to support multiple defense missions and domains, to include ship-board boat and drone detection.",
    "Autonomy for Every Mission Lattice is an open operating system for defense that brings autonomy to the toughest missions. It enables men and women in uniform to move with machine speed, unparalleled confidence, and military-grade security by turning data into information, information into decisions, and decisions into actions across tactical and strategic operations. Real-Time Understanding Lattice cuts through the noise and creates a shared real-time understanding of the battlespace. It autonomously parses data from thousands of sensors & data sources into an intelligent common operating picture in a single pane of glass. Lattice uses technologies like sensor fusion, computer vision, edge computing, and machine learning and artificial intelligence to detect, track, and classify every object of interest in an operator's vicinity. Lattice cuts through the noise and creates a shared real-time understanding of the battlespace. It autonomously parses data from thousands of sensors & data sources into an intelligent common operating picture in a single pane of glass. Lattice uses technologies like sensor fusion, computer vision, edge computing, and machine learning and artificial intelligence to detect, track, and classify every object of interest in an operator's vicinity. Open & Extensible Software Platform Lattice's open architecture has proven integrations across third-party, legacy, and autonomous systems to work together in a single command and control mission engine. Scaling an infinite number of data sources, Lattice extends across tactical and strategic operations. Secure & Intelligent Mesh Network Lattice's mesh network is built to securely deploy to the most remote and contested areas. It removes the single point of failure risk associated with traditional hub and spoke models. Lattice intelligently categorizes, evaluates, and prioritizes the best path for information to flow, especially when there is limited bandwidth. Simple & Intuitive UI The Lattice User Interface (UI) elegantly allows users to visualize and interact with thousands of sensors and effectors in a single UI. Operators can seamlessly scale from tactical to strategic views. The Lattice UI spans web, desktop, mobile, and VR modalities to fit your need. Lattice OS for JADC2 Joint All-Domain Command and Control (JADC2) is one of the most important modernization priorities to confront challenges posed by strategic competition. Leveraging Lattice, we've approached JADC2 by building an open operating system for defense that is simple, scalable, extensible, and ultimately leverages machine intelligence to accelerate the closing of complex kill chains. Features Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. All-Domain Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Mission Autonomy Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Real-World Experiences Lattice for JADC2 has been built through real-world experiences and exercises Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. Built for Strategic Scale Lattice can scale to integrate thousands of sensors and effectors globally across multi-domains. All-Domain Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Lattice integrates and operates across land, sea, air, and space to provide a comprehensive all-domain mission engine Mission Autonomy Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Lattice enables collaborative teaming of unmanned assets to accomplish mission objectives Real-World Experiences Lattice for JADC2 has been built through real-world experiences and exercises Lattice for JADC2 has been built through real-world experiences and exercises \" Lattice is the eyes in the back of my head. \" Patrol Agent, US Customs & Border Protection \" Lattice helps us react better and more efficiently use the little bit of manpower we have… We need it and it's critically important… vitally important to control intrusions to protect this airspace. \" Marine Corps End User \" The artificial intelligence at the heart of this system has great potential to protect our people and sites. \" General Sir Patrick Sanders, UK Strategic Command \" Anduril's integrated security system is novel, powerful and, if successfully implemented and realized, could be as transformational for the character and conduct of war as the emergence of mechanization, flight and wireless communication. \" \" I believe that the Lattice system, when positioned in key areas, dramatically outpaces our current observation capabilities within the restricted area. \" US Marine Corps End User",
    "Software-Defined Electromagnetic Warfare (EW)​ Pulsar is a family of software-defined Electromagnetic Warfare (EW) systems that leverages AI at the edge to rapidly adapt to emerging threats in hours to days, not months to years. Pulsar's modular form factor can be adapted and integrated onto vehicles (Pulsar-V) or aircrafts (Pulsar-A) to support multiple EW mission sets.​ Pulsar integrates on-board GPU compute, ML algorithms, and Software Defined Radios (SDR) into a compact and powerful capability to rapidly deploy new detection/defeat capabilities at the edge​. Pulsar integrates on-board GPU compute, ML algorithms, and Software Defined Radios (SDR) into a compact and powerful capability to rapidly deploy new detection/defeat capabilities at the edge​. Pulsar's modular form factor can be adapted and integrated onto vehicles (Pulsar-V) or aircrafts (Pulsar-A). Pulsar's modular form factor can be adapted and integrated onto vehicles (Pulsar-V) or aircrafts (Pulsar-A). Pulsar can network multiple EW systems across distributed operations together to deliver coordinated effects, optimize coverage for the environment, and geolocate signals of interest. ​ Pulsar can network multiple EW systems across distributed operations together to deliver coordinated effects, optimize coverage for the environment, and geolocate signals of interest. ​ Pulsar supports a wide range of mission capabilities, to include Electronic Countermeasures (ECM), Counter Unmanned Systems (CUxS), Direction Finding, Geolocation, and other advanced EW capabilities.​ Pulsar supports a wide range of mission capabilities, to include Electronic Countermeasures (ECM), Counter Unmanned Systems (CUxS), Direction Finding, Geolocation, and other advanced EW capabilities.​ Pulsar in a fixed-site configuration offers 360-degree or directional detection and denial and enables customized coverage for the conditions and environment. Multiple Pulsars can be networked together to provide adaptable and comprehensive coverage based on environment and mission requirements. ​ Pulsar-V is a vehicle variant for Pulsar that can be mounted and integrated into a variety of vehicles leveraging a standard NATO mount. ​ Pulsar-A is an airborne payload variant of Pulsar that can be adapted to support a variety of manned and unmanned aircrafts. ​ (1) Pulsar is not approved by the FCC for sale or operation in the United States; (2) Pulsar may only be purchased by the U.S. federal government to support operations authorized under U.S. law; (3) Pulsar may be eligible for purchase by foreign national governments, subject to applicable domestic spectrum regulations and U.S. export law.​",
    "The scalable backbone of a rapidly deployable security network Sentry uses artificial intelligence to provide highly accurate, persistent autonomous awareness across land, sea and air. With an AI-enabled edge processing, continuous 360 pan / tilt and a variety of radars and sensors, Sentry can autonomously identify, detect and track objects of interest to bring increased security to borders, military bases, oil and gas pipelines, airports and other critical infrastructure. Green Technology Self powered via solar panels resulting in zero emissions while protecting local habitats & environments. Self powered via solar panels resulting in zero emissions while protecting local habitats & environments. Sensor Fusion at the Edge Sensor fusion and object detection are performed onboard in real-time. Anduril's computer vision algorithms present operators with decision points, not noise. Sensor Fusion at the Edge Sensor fusion and object detection are performed onboard in real-time. Anduril's computer vision algorithms present operators with decision points, not noise. Infrastructure Independent Designed to be used in the most challenging remote & austere conditions, without the need for roads, power sources, or connectivity, Designed to be used in the most challenging remote & austere conditions, without the need for roads, power sources, or connectivity, Customizable Modular and able to be equipped with mission-specific sensors & power sources. Modular and able to be equipped with mission-specific sensors & power sources. Rapidly Deployable Can be built and online in less than three hours. Can be built and online in less than three hours. Standard Range Sentry Tower The Standard Range Sentry Tower provides clear, long range surveillance of ground-based objects of interest day or night. 2.8 km Person; 3.5 km Vehicle 24 ft x 24 ft Long Range Sentry Tower The Long Range Sentry Tower is equipped with an ultra high powered, 360 radar designed to identify, classify and track group 1-3 drone threats. 2–4km for Group 1 threats, ​15km for Group 3+​ threats 16 ft x 16 ft Maritime Sentry Towers include radar designed to detect boats, jet skis, and other water-borne objects. 15 km+ for Surface Vessels​ 24 ft x 24 ft Mobile Sentry brings autonomous fixed site counter UAS and counter intrusion capabilities into a mobile form factor. 2–4km for Group 1 threats, ​15km for Group 3+​ threats 16 ft x 7 ft Cold Weather Sentry Tower Specifically designed for cold weather conditions, Cold Weather Sentry Towers are equipped with a generator & internal lens heaters to prevent frost on cameras. 2.8 km Person; 3.5 km Vehicle; 4.5km Boat 30 ft x 30 ft \"These towers give agents in the field a significant leg up against the criminal networks that facilitate illegal cross-border activity... The more our agents know about what they encounter in the field, the more safely and effectively they can respond.\" \"These towers have been amazing for us, a great asset because they can see what we can't see on the ground.\" Laredo Supervisory Patrol Agent \"Autonomous Surveillance Towers leverage cutting edge tech to improve border security. ASTs are tactically placed along the border, automatically detecting and tracking illegal border crossers. This infusion of technology is a force multiplier, greatly expanding our capabilities.\""
  ]
}