{
  "company": "www.cloudsmart.co.uk",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 9
  },
  "topic_descriptions": {},
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 9
    }
  },
  "sample_docs": [
    "Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Unpacking the Salesforce Spring '24 Release: What You Need to Know Unpacking the Salesforce Spring '24 Release: What You Need to Know Share This Post Salesforce has unveiled its Spring '24 Release, ushering in a wave of enhancements and innovations. At CloudSmart, we understand that staying ahead of the curve is not just an option but a necessity. Here are our top 3 features from the Spring 24 release: Feature Highlights: 1. Dynamic forms with related object fields. Formula field who?! Move over formula fields… your old news now! With the Spring 24 release you can add a field from another object onto your lightning page as long as there is a look up relationship! Of course, formula fields still have so many uses and we still love them really! This is just such a great way to minimise unnecessary field creation and keep your data clean. 2. Transfer Lightning Dashboard Ownership. This one is for the Salesforce Admins out there! We have all been there, when the owner of a dashboard leaves the company and you have to clone and recreate the dashboard, WHY?! Well the ability to transfer dashboards is now available. This might be a simple change, but for admins, this really is a biggie! 3. New Dashboard components. So number 3 is also an update related to dashboard's, but its a great one! Get ready to spend hours fine tuning your dashboards and giving them the Spring Glo they deserve. With images, rich text and dashboard widgets now available. There are so many more features, but these are just a few we think you can get your hands on and enjoy. Navigating the Updates: The Spring '24 Release Notes introduce a spectrum of features designed to empower businesses. From analytics to deployment, Salesforce's commitment to user experience shines through. At CloudSmart, we view these updates as a testament to the platform's dedication to meeting the dynamic requirements of modern enterprises. Our focus has always been on ensuring that our clients not only keep pace with industry advancements but lead the charge. User-Friendly Approach: With every release, there is so much to digest! Our tip? Dive into the release notes with a clear understanding of your business objectives. Look for features that directly impact your workflows, and don't hesitate to seek our guidance on how to make the most of them. As part of our Managed Service packages we also offer Release readiness reviews and will highlight new features we believe can benefit your and your team. How do we do that? Preparing for the release is a strategic move. At CloudSmart we recommend conducting an internal review of existing processes to identify areas where the new features could bring transformative benefits. Our team is here to assist in this preparatory phase, ensuring a smooth transition that maximises the advantages offered by the Spring '24 Release. Conclusion: As we unpack the Salesforce Spring '24 Release, CloudSmart stands at the forefront of industry insights and technological advancements. We believe in not just adapting to change but harnessing it for the growth of your business. The Spring '24 Release is more than just an update; it's an opportunity to redefine how you engage with your customers, streamline your operations, and drive towards unprecedented success. Embrace the future with CloudSmart – where innovation meets expertise. In conclusion, achieving revenue excellence through the effective implementation of Salesforce offers a strategic advantage in today's competitive business landscape. At CloudSmart Consulting, we are dedicated to assisting your business in unlocking the full potential of Salesforce. As a trusted Salesforce Platinum Partner , we provide a comprehensive range of services tailored to meet your specific business needs, including: Expert consulting: Delivering Salesforce flagship products to help you engage more buyers and win more deals. Swift and efficient implementation: Ensuring a seamless integration, getting you up to speed quickly with your Salesforce products. Tailored training programs: Empowering your teams to extract maximum value from your existing Salesforce solution. Managed services: Optimising and maximising the benefits of your Salesforce products. Partner with CloudSmart Consulting today, and together we can unlock the full potential of Salesforce for your business. Ready to get started? Get In Touch Today. Contact More To Explore Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Previous Next 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Employee, Lily, writes about starting a new job during the pandemic Read More » Salesforce has unveiled its Spring '24 Release, ushering in a wave of enhancements and innovations. At CloudSmart, we understand that staying ahead of the curve is not just an option but a necessity. Here are our top 3 features from the Spring 24 release: 1. Dynamic forms with related object fields. Formula field who?! Move over formula fields… your old news now! With the Spring 24 release you can add a field from another object onto your lightning page as long as there is a look up relationship! Of course, formula fields still have so many uses and we still love them really! This is just such a great way to minimise unnecessary field creation and keep your data clean. 2. Transfer Lightning Dashboard Ownership. This one is for the Salesforce Admins out there! We have all been there, when the owner of a dashboard leaves the company and you have to clone and recreate the dashboard, WHY?! Well the ability to transfer dashboards is now available. This might be a simple change, but for admins, this really is a biggie! 3. New Dashboard components. So number 3 is also an update related to dashboard's, but its a great one! Get ready to spend hours fine tuning your dashboards and giving them the Spring Glo they deserve. With images, rich text and dashboard widgets now available. There are so many more features, but these are just a few we think you can get your hands on and enjoy. The Spring '24 Release Notes introduce a spectrum of features designed to empower businesses. From analytics to deployment, Salesforce's commitment to user experience shines through. At CloudSmart, we view these updates as a testament to the platform's dedication to meeting the dynamic requirements of modern enterprises. Our focus has always been on ensuring that our clients not only keep pace with industry advancements but lead the charge. With every release, there is so much to digest! Our tip? Dive into the release notes with a clear understanding of your business objectives. Look for features that directly impact your workflows, and don't hesitate to seek our guidance on how to make the most of them. As part of our Managed Service packages we also offer Release readiness reviews and will highlight new features we believe can benefit your and your team. How do we do that? Preparing for the release is a strategic move. At CloudSmart we recommend conducting an internal review of existing processes to identify areas where the new features could bring transformative benefits. Our team is here to assist in this preparatory phase, ensuring a smooth transition that maximises the advantages offered by the Spring '24 Release. As we unpack the Salesforce Spring '24 Release, CloudSmart stands at the forefront of industry insights and technological advancements. We believe in not just adapting to change but harnessing it for the growth of your business. The Spring '24 Release is more than just an update; it's an opportunity to redefine how you engage with your customers, streamline your operations, and drive towards unprecedented success. Embrace the future with CloudSmart – where innovation meets expertise. In conclusion, achieving revenue excellence through the effective implementation of Salesforce offers a strategic advantage in today's competitive business landscape. At CloudSmart Consulting, we are dedicated to assisting your business in unlocking the full potential of Salesforce. As a trusted Salesforce Platinum Partner , we provide a comprehensive range of services tailored to meet your specific business needs, including: Expert consulting: Delivering Salesforce flagship products to help you engage more buyers and win more deals. Swift and efficient implementation: Ensuring a seamless integration, getting you up to speed quickly with your Salesforce products. Tailored training programs: Empowering your teams to extract maximum value from your existing Salesforce solution. Managed services: Optimising and maximising the benefits of your Salesforce products. Partner with CloudSmart Consulting today, and together we can unlock the full potential of Salesforce for your business. Ready to get started? Get In Touch Today. Contact Get In Touch Today. Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Employee, Lily, writes about starting a new job during the pandemic Read More » Employee, Lily, writes about starting a new job during the pandemic CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Linkedin Facebook-f Instagram Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL +44 8081 350350 support@cloudsmart.co.uk CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Facebook-f Twitter Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 info@cloudsmart.co.uk International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 CloudSmart Consulting © Copyright 2024",
    "Employee, Lily, writes about starting a new job during the pandemic I started my new job as a Marketing Associate for CloudSmart™️ during the Covid-19 pandemic. CloudSmart™️ is a partner of Salesforce, that offers consulting services to help clients map the best technology solutions to provide business results. Having never used Salesforce before, I was prepared for a high level of training that would be required. The usual excitement and nerves were present as I was getting ready for my first day. I was happy when I found out I would also be starting alongside my colleague Sam. It was great having someone with me on the first week that was also starting from scratch as we were able to help each other out and learn together. I was lucky enough to be able meet the team, most of them were able to be there in person, with strict Covid-19 regulations in place. I spent time throughout the first week beginning to familiarise myself with Salesforce and getting started on Trailhead – something I would soon realise I would be spending a lot of time using! After I had completed my first week of intense introduction and training to Salesforce and Marketing Cloud, I got started on assignments set by my manager, Spencer. These encouraged me to familiarise myself with independently using Salesforce systems such as email studio and journey builder. I definitely underestimated the amount of time Sam and I would spend on Google meet helping each other complete these assignments! We had daily Google meetings with Spencer to present back the work we had been doing on each assignment. This was so helpful as we were able to ask questions and see where we did well and where we did things wrong and Spencer helped me stretch my ability and improve daily. My experience of starting a new job, mainly in a remote environment, has been a very positive one, I was lucky to get some in-person training before this most recent lockdown. Since the most recent lockdown has come into place, I have had a well-structured plan as I mentioned with daily assignments and catch ups. More recently I have started gaining more independence with my work and taking on more tasks in social studio. Lily, CloudSmart™️ – 8 Feb 2021 Employee, Lily, writes about starting a new job during the pandemic I started my new job as a Marketing Associate for CloudSmart™️ during the Covid-19 pandemic. CloudSmart™️ is a partner of Salesforce, that offers consulting services to help clients map the best technology solutions to provide business results. Having never used Salesforce before, I was prepared for a high level of training that would be required. The usual excitement and nerves were present as I was getting ready for my first day. I was happy when I found out I would also be starting alongside my colleague Sam. It was great having someone with me on the first week that was also starting from scratch as we were able to help each other out and learn together. I was lucky enough to be able meet the team, most of them were able to be there in person, with strict Covid-19 regulations in place. I spent time throughout the first week beginning to familiarise myself with Salesforce and getting started on Trailhead – something I would soon realise I would be spending a lot of time using! After I had completed my first week of intense introduction and training to Salesforce and Marketing Cloud, I got started on assignments set by my manager, Spencer. These encouraged me to familiarise myself with independently using Salesforce systems such as email studio and journey builder. I definitely underestimated the amount of time Sam and I would spend on Google meet helping each other complete these assignments! We had daily Google meetings with Spencer to present back the work we had been doing on each assignment. This was so helpful as we were able to ask questions and see where we did well and where we did things wrong and Spencer helped me stretch my ability and improve daily. My experience of starting a new job, mainly in a remote environment, has been a very positive one, I was lucky to get some in-person training before this most recent lockdown. Since the most recent lockdown has come into place, I have had a well-structured plan as I mentioned with daily assignments and catch ups. More recently I have started gaining more independence with my work and taking on more tasks in social studio. Lily, CloudSmart™️ – 8 Feb 2021 International House 24 Holborn Viaduct London EC1A 2BN CloudSmart Consulting © Copyright 2018",
    "Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Share This Post In today's fast-paced business landscape, achieving revenue excellence through the effective implementation of Salesforce is a top priority for companies seeking sustainable growth. At CloudSmart Consulting, we understand the significance of revenue optimisation and offer expert guidance to help organisations achieve it. In this blog post, we will explore five key strategies for revenue optimisation through effective Salesforce implementation. Streamline Sales Processes: With Salesforce, businesses can streamline their sales processes, leading to improved efficiency and increased revenue. By customising Salesforce to align with your unique sales cycle, you can automate repetitive tasks, centralise data, and gain valuable insights into your sales pipeline. At CloudSmart Consulting, we specialise in customising Salesforce to fit your specific requirements, ensuring a seamless integration that enhances your sales team's productivity. Nurture Customer Relationships: Building strong customer relationships is crucial for long-term revenue growth. Salesforce's customer relationship management (CRM) capabilities enable you to understand your customers better and provide personalised experiences. By leveraging Salesforce, you can track customer interactions, anticipate their needs, and deliver tailored solutions. As a Salesforce Platinum Partner, CloudSmart Consulting can help you harness the power of Salesforce CRM, guiding you in creating personalised customer journeys that drive revenue growth. Harness Data-Driven Insights: Data is the lifeblood of revenue optimisation. Salesforce offers robust analytics and reporting features that provide valuable insights into your sales and marketing performance. By leveraging these capabilities, you can identify trends, monitor key performance indicators, and make data-driven decisions to maximise revenue. CloudSmart Consulting offers expertise in Salesforce Data Cloud consultancy, enabling you to extract meaningful insights from your data and take targeted actions to boost your revenue. Automate Marketing Processes: Salesforce's Marketing Cloud is a powerful tool for revenue optimisation through targeted marketing campaigns. By automating marketing processes, you can reach the right audience at the right time, deliver personalised messages, and drive conversions. At CloudSmart Consulting, we specialise in Marketing Cloud setup and consultancy. We can assist you in leveraging Marketing Cloud's features, such as Interaction Studio setup, to create highly effective marketing campaigns that generate revenue growth. Continuously Improve: Revenue optimisation is an ongoing process that requires continuous improvement. Salesforce provides a scalable platform that allows you to adapt and evolve your revenue strategies over time. CloudSmart Consulting offers comprehensive Salesforce setup and implementation services to ensure that your Salesforce instance is optimally configured to meet your evolving business needs. With our expertise as a Salesforce partner and Marketing Cloud consultancy, you can leverage Salesforce's capabilities to continuously enhance your revenue generation efforts. In conclusion, achieving revenue excellence through the effective implementation of Salesforce offers a strategic advantage in today's competitive business landscape. At CloudSmart Consulting, we are dedicated to assisting your business in unlocking the full potential of Salesforce. As a trusted Salesforce Platinum Partner, we provide a comprehensive range of services tailored to meet your specific business needs, including: Expert consulting: Delivering Salesforce flagship products to help you engage more buyers and win more deals. Swift and efficient implementation: Ensuring a seamless integration, getting you up to speed quickly with your Salesforce products. Tailored training programs: Empowering your teams to extract maximum value from your existing Salesforce solution. Managed services: Optimising and maximising the benefits of your Salesforce products. Partner with CloudSmart Consulting today, and together we can unlock the full potential of Salesforce for your business. Ready to get started? Get In Touch Today. Contact More To Explore Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Previous Next 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Employee, Lily, writes about starting a new job during the pandemic Read More » In today's fast-paced business landscape, achieving revenue excellence through the effective implementation of Salesforce is a top priority for companies seeking sustainable growth. At CloudSmart Consulting, we understand the significance of revenue optimisation and offer expert guidance to help organisations achieve it. In this blog post, we will explore five key strategies for revenue optimisation through effective Salesforce implementation. Streamline Sales Processes: With Salesforce, businesses can streamline their sales processes, leading to improved efficiency and increased revenue. By customising Salesforce to align with your unique sales cycle, you can automate repetitive tasks, centralise data, and gain valuable insights into your sales pipeline. At CloudSmart Consulting, we specialise in customising Salesforce to fit your specific requirements, ensuring a seamless integration that enhances your sales team's productivity. Nurture Customer Relationships: Building strong customer relationships is crucial for long-term revenue growth. Salesforce's customer relationship management (CRM) capabilities enable you to understand your customers better and provide personalised experiences. By leveraging Salesforce, you can track customer interactions, anticipate their needs, and deliver tailored solutions. As a Salesforce Platinum Partner, CloudSmart Consulting can help you harness the power of Salesforce CRM, guiding you in creating personalised customer journeys that drive revenue growth. Harness Data-Driven Insights: Data is the lifeblood of revenue optimisation. Salesforce offers robust analytics and reporting features that provide valuable insights into your sales and marketing performance. By leveraging these capabilities, you can identify trends, monitor key performance indicators, and make data-driven decisions to maximise revenue. CloudSmart Consulting offers expertise in Salesforce Data Cloud consultancy, enabling you to extract meaningful insights from your data and take targeted actions to boost your revenue. Automate Marketing Processes: Salesforce's Marketing Cloud is a powerful tool for revenue optimisation through targeted marketing campaigns. By automating marketing processes, you can reach the right audience at the right time, deliver personalised messages, and drive conversions. At CloudSmart Consulting, we specialise in Marketing Cloud setup and consultancy. We can assist you in leveraging Marketing Cloud's features, such as Interaction Studio setup, to create highly effective marketing campaigns that generate revenue growth. Continuously Improve: Revenue optimisation is an ongoing process that requires continuous improvement. Salesforce provides a scalable platform that allows you to adapt and evolve your revenue strategies over time. CloudSmart Consulting offers comprehensive Salesforce setup and implementation services to ensure that your Salesforce instance is optimally configured to meet your evolving business needs. With our expertise as a Salesforce partner and Marketing Cloud consultancy, you can leverage Salesforce's capabilities to continuously enhance your revenue generation efforts. In conclusion, achieving revenue excellence through the effective implementation of Salesforce offers a strategic advantage in today's competitive business landscape. At CloudSmart Consulting, we are dedicated to assisting your business in unlocking the full potential of Salesforce. As a trusted Salesforce Platinum Partner, we provide a comprehensive range of services tailored to meet your specific business needs, including: Expert consulting: Delivering Salesforce flagship products to help you engage more buyers and win more deals. Swift and efficient implementation: Ensuring a seamless integration, getting you up to speed quickly with your Salesforce products. Tailored training programs: Empowering your teams to extract maximum value from your existing Salesforce solution. Managed services: Optimising and maximising the benefits of your Salesforce products. Partner with CloudSmart Consulting today, and together we can unlock the full potential of Salesforce for your business. Ready to get started? Get In Touch Today. Contact Get In Touch Today. Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Employee, Lily, writes about starting a new job during the pandemic Read More » Employee, Lily, writes about starting a new job during the pandemic CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Linkedin Facebook-f Instagram Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL +44 8081 350350 support@cloudsmart.co.uk CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Facebook-f Twitter Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 info@cloudsmart.co.uk International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 CloudSmart Consulting © Copyright 2024",
    "Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Introduction CloudSmart respects the obligations and requirements it needs to fulfil regarding data privacy, to continue to maintain the trust and confidence of visitors to its website and recipients of updates, information, newsletters and company news regarding CloudSmart. This Privacy Notice sets out how we treat data collected from visitors to our website. Visitors to our Website www.cloudsmart.co.uk and CloudSmart take a proactive approach to user privacy and ensure the necessary steps are taken to protect the privacy of its users throughout their visiting experience. This website complies with all UK and EU regulations and requirements for user privacy in the countries it conducts business. When someone visits www.cloudsmart.co.uk we use third party services, Google Analytics and Pardot, to collect standard internet formation and details of visitor behaviour patterns. We do this to find out things such as the number of visitors to the various parts of the site. You can find more information on how cookies are used on this website in the Cookies Policy below. If we do want to collect personally identifiable information through our website, we will be clear when we collect personal information and will explain what we intend to do with it. Information Collected When expressing an interest in obtaining additional information from CloudSmart, we require you to provide the company with personal contact information, such as name, company name, job title, address, phone number and email address. When visitors apply for a job within the Company, CloudSmart may also require you (as a candidate) to submit additional personal information as well as a CV. A 'Candidate Data Processing Notice' is available on the Careers page of the website to reassure candidates how their data is processed and stored and what their rights are. Use of Information CloudSmart uses data about its customers to perform the services requested. CloudSmart also uses data about event attendees to plan and host events, online forums and social networks in which attendees may participate. The company may also use data about customers and attendees for marketing purposes. CloudSmart may also receive information about customers and attendees from other sources, including third parties from whom we have purchased data, and combine this information with Data we already have about you. This helps us to update, expand and analyse our records, identify new customers and create a more tailored advertising to provide services that may be of interest to you. 'Unsubscribe' CloudSmart offers visitors, customers and attendees who provide contact information a means to choose how the Company uses the information provided. You may manage your receipt of marketing and non-transactional communications by clicking on the 'unsubscribe' link located at the bottom of the Company's marketing emails. Additionally, you may unsubscribe by contacting us at data@cloudsmart.co.uk. Correcting, updating, accessing or deleting your information CloudSmart may retain your information for a period of time consistent with the original purpose of collection and during the time needed to pursue our legitimate business interests, conduct audits or comply with our legal obligations. By emailing data@cloudsmart.co.uk, you may request to review, correct, delete or otherwise modify any of the personal information that you have previously provided to us through the Company's website and services. Requests to access, change or delete your information will be addressed within a reasonable timeframe. Cookies Policy This website uses cookies to better the user's experience while visiting the website. Where applicable, this website uses a cookie control system allowing the user on their first visit to the website to allow or dis-allow the use of cookies on their computer / device. This complies with recent legislation requirements for websites to obtain explicit consent from users before leaving behind or reading files such as cookies on a user's computer / device. Cookies used on the Website The following types of cookies that may be used on the Website are: Strictly necessary cookies Performance cookies Functionality cookies Third party cookies You can find more information about cookies at: www.allaboutcookies.org and www.youronlinechoices.eu. You can find more information about the Cookies' policies for our third party service providers at: https://www.salesforce.com/company/privacy/ (Pardot) https://developers.google.com/analytics/devguides/collection/analyticsjs/cookie-usage (Google Analytics) Other websites & Social Media platforms This privacy notice does not cover the links within this site linking to other websites. Those sites are not governed by this , and if you have questions about how a site uses your information, you'll need to check that site's privacy statement. Communication, engagement and actions taken through external social media platforms that this website and its owns participate on are custom to the as well as the privacy policies held with each social media platform respectively. This website may use social sharing buttons which help share web content directly from web pages to the social media platform in question. Users are advised before using social sharing buttons that they do so at their own discretion and note that the social media platform may track and save your request to share a web page respectively through your social media platform account. Public Forums and Customer Testimonials CloudSmart may provide bulletin boards, blogs or chat rooms on the Company's website. Any personal information you choose to submit in such a forum may be read, collected or used by others who visit these forums and may be used to send you unsolicited messages. CloudSmart is not responsible for the personal information you choose to submit in these forums. CloudSmart may post customer branding and testimonials on its website which the Company obtains consent of each customer prior to posting any information on. Sharing Information with Business Partners CloudSmart does not share data about attendees with business partners unless you specifically opt in to such sharing via an event registration form or you attend a company event and allow CloudSmart or any of its business partners to scan your attendee badge (if applicable). If you do not wish for your information to be shared in this manner, you may choose not to opt in via event registration forms and elect not to have your badge scanned at Company events. If you choose to share your information with business partners in the manners described above, your information will be subject to the business partner's respective privacy statements. Legal Disclosure CloudSmart reserves the right to use or disclose information provided if required by law or if the Company reasonably believes that use or disclosure is necessary to protect the Company's rights and/or to comply with any legal process. Data Security CloudSmart has the appropriate measures in place to ensure the security of data (including Personal Data collected through the Company's website from applicants, attendees or prospective customers). This includes protection against: unlawful processing, disclosure or access to personal transmitted, stored or processed data accidental loss, destruction or damage to CloudSmart information Further information on the company's Information Security practices can be requested by contacting us at data@cloudsmart.co.uk Changes to this Privacy Notice We keep our privacy notice under regular review. This privacy notice was last updated in August 2018. Contact Us If you have any questions regarding this Privacy Notice, please contact us at info@cloudsmart.co.uk. Last Updated: August 2018 Introduction CloudSmart respects the obligations and requirements it needs to fulfil regarding data privacy, to continue to maintain the trust and confidence of visitors to its website and recipients of updates, information, newsletters and company news regarding CloudSmart. This Privacy Notice sets out how we treat data collected from visitors to our website. Visitors to our Website www.cloudsmart.co.uk and CloudSmart take a proactive approach to user privacy and ensure the necessary steps are taken to protect the privacy of its users throughout their visiting experience. This website complies with all UK and EU regulations and requirements for user privacy in the countries it conducts business. When someone visits www.cloudsmart.co.uk we use third party services, Google Analytics and Pardot, to collect standard internet formation and details of visitor behaviour patterns. We do this to find out things such as the number of visitors to the various parts of the site. You can find more information on how cookies are used on this website in the Cookies Policy below. If we do want to collect personally identifiable information through our website, we will be clear when we collect personal information and will explain what we intend to do with it. Information Collected When expressing an interest in obtaining additional information from CloudSmart, we require you to provide the company with personal contact information, such as name, company name, job title, address, phone number and email address. When visitors apply for a job within the Company, CloudSmart may also require you (as a candidate) to submit additional personal information as well as a CV. A 'Candidate Data Processing Notice' is available on the Careers page of the website to reassure candidates how their data is processed and stored and what their rights are. Use of Information CloudSmart uses data about its customers to perform the services requested. CloudSmart also uses data about event attendees to plan and host events, online forums and social networks in which attendees may participate. The company may also use data about customers and attendees for marketing purposes. CloudSmart may also receive information about customers and attendees from other sources, including third parties from whom we have purchased data, and combine this information with Data we already have about you. This helps us to update, expand and analyse our records, identify new customers and create a more tailored advertising to provide services that may be of interest to you. 'Unsubscribe' CloudSmart offers visitors, customers and attendees who provide contact information a means to choose how the Company uses the information provided. You may manage your receipt of marketing and non-transactional communications by clicking on the 'unsubscribe' link located at the bottom of the Company's marketing emails. Additionally, you may unsubscribe by contacting us at data@cloudsmart.co.uk. Correcting, updating, accessing or deleting your information CloudSmart may retain your information for a period of time consistent with the original purpose of collection and during the time needed to pursue our legitimate business interests, conduct audits or comply with our legal obligations. By emailing data@cloudsmart.co.uk, you may request to review, correct, delete or otherwise modify any of the personal information that you have previously provided to us through the Company's website and services. Requests to access, change or delete your information will be addressed within a reasonable timeframe. Cookies Policy This website uses cookies to better the user's experience while visiting the website. Where applicable, this website uses a cookie control system allowing the user on their first visit to the website to allow or dis-allow the use of cookies on their computer / device. This complies with recent legislation requirements for websites to obtain explicit consent from users before leaving behind or reading files such as cookies on a user's computer / device. Cookies used on the Website The following types of cookies that may be used on the Website are: Strictly necessary cookies Performance cookies Functionality cookies Third party cookies You can find more information about cookies at: www.allaboutcookies.org and www.youronlinechoices.eu. You can find more information about the Cookies' policies for our third party service providers at: https://www.salesforce.com/company/privacy/ (Pardot) https://developers.google.com/analytics/devguides/collection/analyticsjs/cookie-usage (Google Analytics) Other websites & Social Media platforms This privacy notice does not cover the links within this site linking to other websites. Those sites are not governed by this , and if you have questions about how a site uses your information, you'll need to check that site's privacy statement. Communication, engagement and actions taken through external social media platforms that this website and its owns participate on are custom to the as well as the privacy policies held with each social media platform respectively. This website may use social sharing buttons which help share web content directly from web pages to the social media platform in question. Users are advised before using social sharing buttons that they do so at their own discretion and note that the social media platform may track and save your request to share a web page respectively through your social media platform account. Public Forums and Customer Testimonials CloudSmart may provide bulletin boards, blogs or chat rooms on the Company's website. Any personal information you choose to submit in such a forum may be read, collected or used by others who visit these forums and may be used to send you unsolicited messages. CloudSmart is not responsible for the personal information you choose to submit in these forums. CloudSmart may post customer branding and testimonials on its website which the Company obtains consent of each customer prior to posting any information on. Sharing Information with Business Partners CloudSmart does not share data about attendees with business partners unless you specifically opt in to such sharing via an event registration form or you attend a company event and allow CloudSmart or any of its business partners to scan your attendee badge (if applicable). If you do not wish for your information to be shared in this manner, you may choose not to opt in via event registration forms and elect not to have your badge scanned at Company events. If you choose to share your information with business partners in the manners described above, your information will be subject to the business partner's respective privacy statements. Legal Disclosure CloudSmart reserves the right to use or disclose information provided if required by law or if the Company reasonably believes that use or disclosure is necessary to protect the Company's rights and/or to comply with any legal process. Data Security CloudSmart has the appropriate measures in place to ensure the security of data (including Personal Data collected through the Company's website from applicants, attendees or prospective customers). This includes protection against: unlawful processing, disclosure or access to personal transmitted, stored or processed data accidental loss, destruction or damage to CloudSmart information Further information on the company's Information Security practices can be requested by contacting us at data@cloudsmart.co.uk Changes to this Privacy Notice We keep our privacy notice under regular review. This privacy notice was last updated in August 2018. Contact Us If you have any questions regarding this Privacy Notice, please contact us at info@cloudsmart.co.uk. Last Updated: August 2018 CloudSmart respects the obligations and requirements it needs to fulfil regarding data privacy, to continue to maintain the trust and confidence of visitors to its website and recipients of updates, information, newsletters and company news regarding CloudSmart. This Privacy Notice sets out how we treat data collected from visitors to our website. Visitors to our Website www.cloudsmart.co.uk and CloudSmart take a proactive approach to user privacy and ensure the necessary steps are taken to protect the privacy of its users throughout their visiting experience. This website complies with all UK and EU regulations and requirements for user privacy in the countries it conducts business. When someone visits www.cloudsmart.co.uk we use third party services, Google Analytics and Pardot, to collect standard internet formation and details of visitor behaviour patterns. We do this to find out things such as the number of visitors to the various parts of the site. You can find more information on how cookies are used on this website in the Cookies Policy below. If we do want to collect personally identifiable information through our website, we will be clear when we collect personal information and will explain what we intend to do with it. When expressing an interest in obtaining additional information from CloudSmart, we require you to provide the company with personal contact information, such as name, company name, job title, address, phone number and email address. When visitors apply for a job within the Company, CloudSmart may also require you (as a candidate) to submit additional personal information as well as a CV. A 'Candidate Data Processing Notice' is available on the Careers page of the website to reassure candidates how their data is processed and stored and what their rights are. CloudSmart uses data about its customers to perform the services requested. CloudSmart also uses data about event attendees to plan and host events, online forums and social networks in which attendees may participate. The company may also use data about customers and attendees for marketing purposes. CloudSmart may also receive information about customers and attendees from other sources, including third parties from whom we have purchased data, and combine this information with Data we already have about you. This helps us to update, expand and analyse our records, identify new customers and create a more tailored advertising to provide services that may be of interest to you. CloudSmart offers visitors, customers and attendees who provide contact information a means to choose how the Company uses the information provided. You may manage your receipt of marketing and non-transactional communications by clicking on the 'unsubscribe' link located at the bottom of the Company's marketing emails. Additionally, you may unsubscribe by contacting us at data@cloudsmart.co.uk. Correcting, updating, accessing or deleting your information CloudSmart may retain your information for a period of time consistent with the original purpose of collection and during the time needed to pursue our legitimate business interests, conduct audits or comply with our legal obligations. By emailing data@cloudsmart.co.uk, you may request to review, correct, delete or otherwise modify any of the personal information that you have previously provided to us through the Company's website and services. Requests to access, change or delete your information will be addressed within a reasonable timeframe. This website uses cookies to better the user's experience while visiting the website. Where applicable, this website uses a cookie control system allowing the user on their first visit to the website to allow or dis-allow the use of cookies on their computer / device. This complies with recent legislation requirements for websites to obtain explicit consent from users before leaving behind or reading files such as cookies on a user's computer / device. Cookies used on the Website The following types of cookies that may be used on the Website are: You can find more information about cookies at: You can find more information about the Cookies' policies for our third party service providers at: Other websites & Social Media platforms This privacy notice does not cover the links within this site linking to other websites. Those sites are not governed by this , and if you have questions about how a site uses your information, you'll need to check that site's privacy statement. Communication, engagement and actions taken through external social media platforms that this website and its owns participate on are custom to the as well as the privacy policies held with each social media platform respectively. This website may use social sharing buttons which help share web content directly from web pages to the social media platform in question. Users are advised before using social sharing buttons that they do so at their own discretion and note that the social media platform may track and save your request to share a web page respectively through your social media platform account. Public Forums and Customer Testimonials CloudSmart may provide bulletin boards, blogs or chat rooms on the Company's website. Any personal information you choose to submit in such a forum may be read, collected or used by others who visit these forums and may be used to send you unsolicited messages. CloudSmart is not responsible for the personal information you choose to submit in these forums. CloudSmart may post customer branding and testimonials on its website which the Company obtains consent of each customer prior to posting any information on. Sharing Information with Business Partners CloudSmart does not share data about attendees with business partners unless you specifically opt in to such sharing via an event registration form or you attend a company event and allow CloudSmart or any of its business partners to scan your attendee badge (if applicable). If you do not wish for your information to be shared in this manner, you may choose not to opt in via event registration forms and elect not to have your badge scanned at Company events. If you choose to share your information with business partners in the manners described above, your information will be subject to the business partner's respective privacy statements. CloudSmart reserves the right to use or disclose information provided if required by law or if the Company reasonably believes that use or disclosure is necessary to protect the Company's rights and/or to comply with any legal process. CloudSmart has the appropriate measures in place to ensure the security of data (including Personal Data collected through the Company's website from applicants, attendees or prospective customers). This includes protection against: disclosure or access to personal transmitted, stored or processed data accidental loss, destruction or damage to CloudSmart information Further information on the company's Information Security practices can be requested by contacting us at data@cloudsmart.co.uk Changes to this Privacy Notice We keep our privacy notice under regular review. This privacy notice was last updated in August 2018. If you have any questions regarding this Privacy Notice, please contact us at info@cloudsmart.co.uk. CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Linkedin Facebook-f Instagram Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL +44 8081 350350 support@cloudsmart.co.uk CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Facebook-f Twitter Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 info@cloudsmart.co.uk International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 CloudSmart Consulting © Copyright 2024",
    "Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch Home About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Blog Careers Get In Touch About About Our Team About Our Team What We Do # SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot Employee, Lily, writes about starting a new job during the pandemic Employee, Lily, writes about starting a new job during the pandemic Share This Post I started my new job as a Marketing Associate for CloudSmart™️ during the Covid-19 pandemic. CloudSmart™️ is a partner of Salesforce, that offers consulting services to help clients map the best technology solutions to provide business results. Having never used Salesforce before, I was prepared for a high level of training that would be required. The usual excitement and nerves were present as I was getting ready for my first day. I was happy when I found out I would also be starting alongside my colleague Sam. It was great having someone with me on the first week that was also starting from scratch as we were able to help each other out and learn together. I was lucky enough to be able meet the team, most of them were able to be there in person, with strict Covid-19 regulations in place. I spent time throughout the first week beginning to familiarise myself with Salesforce and getting started on Trailhead – something I would soon realise I would be spending a lot of time using! After I had completed my first week of intense introduction and training to Salesforce and Marketing Cloud, I got started on assignments set by my manager, Spencer. These encouraged me to familiarise myself with independently using Salesforce systems such as email studio and journey builder. I definitely underestimated the amount of time Sam and I would spend on Google meet helping each other complete these assignments! We had daily Google meetings with Spencer to present back the work we had been doing on each assignment. This was so helpful as we were able to ask questions and see where we did well and where we did things wrong and Spencer helped me stretch my ability and improve daily. My experience of starting a new job, mainly in a remote environment, has been a very positive one, I was lucky to get some in-person training before this most recent lockdown. Since the most recent lockdown has come into place, I have had a well-structured plan as I mentioned with daily assignments and catch ups. More recently I have started gaining more independence with my work and taking on more tasks in social studio. More To Explore Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Previous Next 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Employee, Lily, writes about starting a new job during the pandemic Read More » I started my new job as a Marketing Associate for CloudSmart™️ during the Covid-19 pandemic. CloudSmart™️ is a partner of Salesforce, that offers consulting services to help clients map the best technology solutions to provide business results. Having never used Salesforce before, I was prepared for a high level of training that would be required. The usual excitement and nerves were present as I was getting ready for my first day. I was happy when I found out I would also be starting alongside my colleague Sam. It was great having someone with me on the first week that was also starting from scratch as we were able to help each other out and learn together. I was lucky enough to be able meet the team, most of them were able to be there in person, with strict Covid-19 regulations in place. I spent time throughout the first week beginning to familiarise myself with Salesforce and getting started on Trailhead – something I would soon realise I would be spending a lot of time using! After I had completed my first week of intense introduction and training to Salesforce and Marketing Cloud, I got started on assignments set by my manager, Spencer. These encouraged me to familiarise myself with independently using Salesforce systems such as email studio and journey builder. I definitely underestimated the amount of time Sam and I would spend on Google meet helping each other complete these assignments! We had daily Google meetings with Spencer to present back the work we had been doing on each assignment. This was so helpful as we were able to ask questions and see where we did well and where we did things wrong and Spencer helped me stretch my ability and improve daily. My experience of starting a new job, mainly in a remote environment, has been a very positive one, I was lucky to get some in-person training before this most recent lockdown. Since the most recent lockdown has come into place, I have had a well-structured plan as I mentioned with daily assignments and catch ups. More recently I have started gaining more independence with my work and taking on more tasks in social studio. Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know February 16, 2024 No Comments Read More » Unpacking the Salesforce Spring '24 Release: What You Need to Know Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam January 13, 2019 No Comments Read More » Sam talks about taking his Salesforce Marketing Cloud Administrator exam 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Read More » 5 Strategies for Revenue Optimisation through Effective Salesforce Implementation Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Read More » Jan talks about coping during lockdown and explains what she did to help her stay healthy and positive Employee, Lily, writes about starting a new job during the pandemic Read More » Employee, Lily, writes about starting a new job during the pandemic CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Linkedin Facebook-f Instagram Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL +44 8081 350350 support@cloudsmart.co.uk CloudSmart Consulting Ltd 78 Cannon St, London EC4N 6HL CloudSmart Helps Transform Sales, Marketing and Customer Service Teams With The Power Of Salesforce.com Facebook-f Twitter Youtube SERVICES Consulting Implementation Training Managed Services CLOUDS Sales Cloud Marketing Cloud Service Cloud Community Cloud Pardot GET IN TOUCH International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 info@cloudsmart.co.uk International House 24 Holborn Viaduct London, EC1A 2BN , UK +1 08081 350 350 CloudSmart Consulting © Copyright 2024"
  ]
}