{
  "company": "www.civic.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "19": {
      "0": 1
    },
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Schools Open for Business One school system is giving its students work experience as they learn about the business of technology. Managing E-Commerce and the Digital Content Dilemma A national legal organization has created a set of rules that could help states govern electronic transactions. North Carolina Judges CourtFlow a Success North Carolina's CourtFlow application simplifies the process for creating case files and issuing court orders. Managing E-Commerce and the Digital Content Dilemma A national legal organization has created a set of rules that could help states govern electronic transactions. North Carolina Judges CourtFlow a Success North Carolina's CourtFlow application simplifies the process for creating case files and issuing court orders. North Carolina Judges CourtFlow a Success North Carolina's CourtFlow application simplifies the process for creating case files and issuing court orders. Bill Streamlines Food Stamp Transactions The U.S. Senate last week passed a bill that calls for uniform standards for electronic food stamp transactions to be used in every state no later than Oct. 2002. N.D. Governor Seeks Ways to Attract Tech Firms North Dakota Gov. Ed Schafer has asked a private-sector advisory committee to recommend tax, investment and public policy ideas to encourage high-tech investment in the state. Kentucky Offers Statewide Virtual High School Starting in January, the Kentucky Virtual High School will become the country's first statewide program for online high school courses. San Diego County Unveils Child Abduction Web Site In and effort to fight child abductions, the San Diego County district attorney's office recently launched a World Wide Web site that includes photos and information about missing children. New York to Bolster High-Tech Initiatives Gov. George Pataki gave high tech a shot in the arm recently by signing into law \"J2K,'' a $522 million economic development program that benefits technology research and capital investment in business growth. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. N.D. Governor Seeks Ways to Attract Tech Firms North Dakota Gov. Ed Schafer has asked a private-sector advisory committee to recommend tax, investment and public policy ideas to encourage high-tech investment in the state. Kentucky Offers Statewide Virtual High School Starting in January, the Kentucky Virtual High School will become the country's first statewide program for online high school courses. San Diego County Unveils Child Abduction Web Site In and effort to fight child abductions, the San Diego County district attorney's office recently launched a World Wide Web site that includes photos and information about missing children. New York to Bolster High-Tech Initiatives Gov. George Pataki gave high tech a shot in the arm recently by signing into law \"J2K,'' a $522 million economic development program that benefits technology research and capital investment in business growth. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. Kentucky Offers Statewide Virtual High School Starting in January, the Kentucky Virtual High School will become the country's first statewide program for online high school courses. San Diego County Unveils Child Abduction Web Site In and effort to fight child abductions, the San Diego County district attorney's office recently launched a World Wide Web site that includes photos and information about missing children. New York to Bolster High-Tech Initiatives Gov. George Pataki gave high tech a shot in the arm recently by signing into law \"J2K,'' a $522 million economic development program that benefits technology research and capital investment in business growth. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. San Diego County Unveils Child Abduction Web Site In and effort to fight child abductions, the San Diego County district attorney's office recently launched a World Wide Web site that includes photos and information about missing children. New York to Bolster High-Tech Initiatives Gov. George Pataki gave high tech a shot in the arm recently by signing into law \"J2K,'' a $522 million economic development program that benefits technology research and capital investment in business growth. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. New York to Bolster High-Tech Initiatives Gov. George Pataki gave high tech a shot in the arm recently by signing into law \"J2K,'' a $522 million economic development program that benefits technology research and capital investment in business growth. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. West Virginia Gov. to Address Technology Council Gov. Cecil Underwood is scheduled to give the keynote address during the West Virginia Science and Technology Advisory Council's second annual \"Mountain State on the Move\" conference on Tuesday at the Federal Energy Technology Center in Morgantown. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. More News Entry-level servers: Workgroup workhorses A comparison of six entry-level servers based on the 500 MHz Pentium III processor shows that great performance can be had at a great price. These are real workgroup workhorses. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. IT Shops Weigh the Pros and Cons of Linux The penguin is ubiquitous. IT shops weigh the pros and cons of Linux, as the technology matures and the market buzz grows louder. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems. Integration Broadens Appeal of GIS Data State and local government users are on the leading edge when it comes to integrating geographic information systems.",
    "Authentication without friction One SDK that bridges email, Web2 social logins, Web3 wallet capabilities, Passkeys, and AI-first interfaces. Multiple login options Let users with their preferred method—SSO via Google, Apple, X, Facebook, Discord, or GitHub, plus email or Passkeys. Bridging Web2 and Web3 Familiar login experience meets powerful blockchain technology. Users get the simplicity they expect, while your app gains all the benefits of Web3 without the complexity of private keys. 5-minute integration Add authentication to any framework with just a few lines of code. Ready for Web2, Web3, and AI-native environments out of the box. Built-in wallet support Embedded wallets that work instantly across all major chains. Integrate the way you want: Civic Auth for your dApp, or Login with Civic via your favorite wallet adapter. Zero devops complexity Civic Auth runs on a fully managed stack. No auth servers to host or secure. No complex setups to restrict domains or subaddressing. One SDK that bridges email, Web2 social logins, Web3 wallet capabilities, Passkeys, and AI-first interfaces. Let users with their preferred method—SSO via Google, Apple, X, Facebook, Discord, or GitHub, plus email or Passkeys. Bridging Web2 and Web3 Familiar login experience meets powerful blockchain technology. Users get the simplicity they expect, while your app gains all the benefits of Web3 without the complexity of private keys. Add authentication to any framework with just a few lines of code. Ready for Web2, Web3, and AI-native environments out of the box. Embedded wallets that work instantly across all major chains. Integrate the way you want: Civic Auth for your dApp, or Login with Civic via your favorite wallet adapter. Civic Auth runs on a fully managed stack. No auth servers to host or secure. No complex setups to restrict domains or subaddressing. Get started in 3 steps From installation to implementation in minutes. A straightforward setup process designed for developers who want to move fast. Step 1 npm install @civic/auth Install the Civic SDK Add our package to your project using npm. Step 2 civic-reserved-dashboard-app-id Copy your client ID Get your unique client ID from the Civic dashboard. Step 3 Add to your app Integrate with a single function call. Get started in 3 steps From installation to implementation in minutes. A straightforward setup process designed for developers who want to move fast. Install the Civic SDK Add our package to your project using npm. Copy your client ID Get your unique client ID from the Civic dashboard. Add to your app Integrate with a single function call. Build your way Built to work across major languages and frameworks, with more coming soon. secure access to user-specific data and perform tasks on behalf of your users. Try it out Power your MCP server with secure auth Add an authentication layer to your MCP server for LLMs and autonomous agents to . In less than 5 mins of development work, enable secure access to user-specific data and perform tasks on behalf of your users. Authentication that scales with your app Just clean, scalable auth pricing that fits your stack. See pricing Authentication that scales with your app Just clean, scalable auth pricing that fits your stack. Tell us about your project Civic uses your contact info to share product updates. You can unsubscribe anytime. See our for details on how we protect your privacy. Thanks! We'll reach out shortly. We're excited to show you what Civic can do—stay tuned for updates in your inbox! Oops! Something went wrong while submitting the form. Tell us about your project Civic uses your contact info to share product updates. You can unsubscribe anytime. See our for details on how we protect your privacy. Ready to add Civic Auth to your app? Deploy your first authentication flow in 5 minutes. Instantly connect users via social logins and embedded wallets - no complex setup required. Get started Ready to add Civic Auth to your app? Deploy your first authentication flow in 5 minutes. Instantly connect users via social logins and embedded wallets - no complex setup required.",
    "The Civic Wallet is almost here!📱 Get a first peek at the next-generation identity and payment network. Join the waitlist A Secured Identity For Everyone Civic enables people to take control and protect their identity Secure ID Platform Let users safely access your websites and services using the Civic Secure ID . Reusable KYC Satisfy KYC requirements with Civic's accessible, on-demand solution. Automated Retail Automate and scale your business thanks to smart vending machines with age-verification capabilities. ID Codes Securely verify your business, advisory, or investment relationships. A Secured Identity For Everyone Civic enables people to take control and protect their identity Secure ID Platform Let users safely access your websites and services using the Civic Secure ID . Let users safely access your websites and services using the Civic Secure ID . Reusable KYC Satisfy KYC requirements with Civic's accessible, on-demand solution. Satisfy KYC requirements with Civic's accessible, on-demand solution. Automated Retail Automate and scale your business thanks to smart vending machines with age-verification capabilities. Automate and scale your business thanks to smart vending machines with age-verification capabilities. ID Codes Securely verify your business, advisory, or investment relationships. Securely verify your business, advisory, or investment relationships. Secure Identity Platform Through our decentralized architecture with the blockchain and biometrics on the mobile device, our platform provides multi-factor authentication without a username, password, third-party authenticator, or physical hardware token. For Developers For Business Financial e-commerce cryptocurrency e-signature Medical social Through our decentralized architecture with the blockchain and biometrics on the mobile device, our platform provides multi-factor authentication without a username, password, third-party authenticator, or physical hardware token. Blockchain-Enabled Security Keys are generated by a third-party wallet, providing a firewall between Civic and users' keys. Identity data is fully encrypted in the App on the user's device and can be accessed with biometrics. Public identifier for the authenticating authority, hashed identity data, and a flag indicating the data is still valid. Keys are generated by a third-party wallet, providing a firewall between Civic and users' keys. Keys are generated by a third-party wallet, providing a firewall between Civic and users' keys. Identity data is fully encrypted in the App on the user's device and can be accessed with biometrics. Identity data is fully encrypted in the App on the user's device and can be accessed with biometrics. Public identifier for the authenticating authority, hashed identity data, and a flag indicating the data is still valid. Public identifier for the authenticating authority, hashed identity data, and a flag indicating the data is still valid. Acknowledgements Civic is another high-profile company working in this area, enabling users to share and manage their verified identity data via a blockchain. As we release Hilo to a global audience, we want to have systems in place to verify the real identities of our users. Civic provides a way to authenticate all our community members with ease. Kastle is excited to partner with Civic, not only for Know Your Customer (KYC) services during our token sale, but as a key part of the Kastle identity verification system for all users. Through its decentralized architecture with blockchain and biometrics, the Civic platform will provide us with the most secure multi-factor authentication process to control and protect the identities of our users. Civic is the logical choice. The reusable KYC solution pretty much takes on the heavy lifting of verifying potential founders on our company creation platform. With Civic Technologies, our platform will make it easier for everyone, so mortgages can be approved and funded faster. We are very proud to announce a partnership with Civic and share their commitment to creating a world where people decide how they share personal information. We are looking forward to bringing the benefits of decentralized identity to our developer community. Migrating to Civic was the natural thing to do for a blockchain startup such as ours. Trust and security are extremely important in the fintech space and we believe that logging in with a simple password or seed is simply not enough. Civic is one of those rare blockchain projects that has its act together. And fills a real need. We're glad to be working with them. We're looking forward to our partnership with Civic to explore solutions that leverage the best of blockchain-based identity and mobile security to create a safer, private user experience that will benefit our telecom partners users across the globe. Civic shares our values around privacy and protecting user information, and we're excited to work with them to offer Civic Reusable KYC, which will be key to ensuring security and privacy on our publisher network. Civic is keeping user data safe in a way which provides higher accuracy for businesses at lower cost. We're happy to offer Civic login to provide a better user experience for the 150 million people a month who visit wikiHow. We are fanatical about user security and are happy to be able to provide further protection for our customer's identities and financial assets from the growing trends of cyber fraud and identity theft. The Civic team have a peerless reputation when it comes to providing tangible solutions that correspond with the ever-changing threats to personal data online. Votem was founded to improve free and fair elections around the globe and with our partnership with Civic, we know that we have a solid partner to help us achieve our mission. By outsourcing our KYC services to Civic, we mitigate the risk of attracting hackers and identity thieves that are usually associated with traditional data management services in centralized systems that serve as a single point of failure. Civic is recognized by OWI as a 'Featured Company' in our Solution Providers category because of its unique application of blockchain technology in the identity space. CapLinked is excited to be offering Civic as a seamless integration to our customers and to be working closely with Civic to develop innovative, secure identity verification products as we move forward with our blockchain project. One of the many benefits of working with Civic is that their protocol actually allows for the verification of, for instance, high school diplomas and other certificates associated with user profiles. Civic became the first company to turn identity theft protection into truly warning you before the identity theft truck hits you. The bottom line is that Americans are not in control of when and where their personal information is being used and we plan to change that. Civic is another high-profile company working in this area, enabling users to share and manage their verified identity data via a blockchain. Civic is another high-profile company working in this area, enabling users to share and manage their verified identity data via a blockchain. As we release Hilo to a global audience, we want to have systems in place to verify the real identities of our users. Civic provides a way to authenticate all our community members with ease. As we release Hilo to a global audience, we want to have systems in place to verify the real identities of our users. Civic provides a way to authenticate all our community members with ease. Kastle is excited to partner with Civic, not only for Know Your Customer (KYC) services during our token sale, but as a key part of the Kastle identity verification system for all users. Kastle is excited to partner with Civic, not only for Know Your Customer (KYC) services during our token sale, but as a key part of the Kastle identity verification system for all users. Through its decentralized architecture with blockchain and biometrics, the Civic platform will provide us with the most secure multi-factor authentication process to control and protect the identities of our users. Through its decentralized architecture with blockchain and biometrics, the Civic platform will provide us with the most secure multi-factor authentication process to control and protect the identities of our users. Civic is the logical choice. The reusable KYC solution pretty much takes on the heavy lifting of verifying potential founders on our company creation platform. Civic is the logical choice. The reusable KYC solution pretty much takes on the heavy lifting of verifying potential founders on our company creation platform. With Civic Technologies, our platform will make it easier for everyone, so mortgages can be approved and funded faster. With Civic Technologies, our platform will make it easier for everyone, so mortgages can be approved and funded faster. We are very proud to announce a partnership with Civic and share their commitment to creating a world where people decide how they share personal information. We are very proud to announce a partnership with Civic and share their commitment to creating a world where people decide how they share personal information. We are looking forward to bringing the benefits of decentralized identity to our developer community. We are looking forward to bringing the benefits of decentralized identity to our developer community. Migrating to Civic was the natural thing to do for a blockchain startup such as ours. Trust and security are extremely important in the fintech space and we believe that logging in with a simple password or seed is simply not enough. Migrating to Civic was the natural thing to do for a blockchain startup such as ours. Trust and security are extremely important in the fintech space and we believe that logging in with a simple password or seed is simply not enough. Civic is one of those rare blockchain projects that has its act together. And fills a real need. We're glad to be working with them. Civic is one of those rare blockchain projects that has its act together. And fills a real need. We're glad to be working with them. We're looking forward to our partnership with Civic to explore solutions that leverage the best of blockchain-based identity and mobile security to create a safer, private user experience that will benefit our telecom partners users across the globe. We're looking forward to our partnership with Civic to explore solutions that leverage the best of blockchain-based identity and mobile security to create a safer, private user experience that will benefit our telecom partners users across the globe. Civic shares our values around privacy and protecting user information, and we're excited to work with them to offer Civic Reusable KYC, which will be key to ensuring security and privacy on our publisher network. Civic shares our values around privacy and protecting user information, and we're excited to work with them to offer Civic Reusable KYC, which will be key to ensuring security and privacy on our publisher network. Civic is keeping user data safe in a way which provides higher accuracy for businesses at lower cost. Civic is keeping user data safe in a way which provides higher accuracy for businesses at lower cost. We're happy to offer Civic login to provide a better user experience for the 150 million people a month who visit wikiHow. We're happy to offer Civic login to provide a better user experience for the 150 million people a month who visit wikiHow. We are fanatical about user security and are happy to be able to provide further protection for our customer's identities and financial assets from the growing trends of cyber fraud and identity theft. We are fanatical about user security and are happy to be able to provide further protection for our customer's identities and financial assets from the growing trends of cyber fraud and identity theft. The Civic team have a peerless reputation when it comes to providing tangible solutions that correspond with the ever-changing threats to personal data online. The Civic team have a peerless reputation when it comes to providing tangible solutions that correspond with the ever-changing threats to personal data online. Votem was founded to improve free and fair elections around the globe and with our partnership with Civic, we know that we have a solid partner to help us achieve our mission. Votem was founded to improve free and fair elections around the globe and with our partnership with Civic, we know that we have a solid partner to help us achieve our mission. By outsourcing our KYC services to Civic, we mitigate the risk of attracting hackers and identity thieves that are usually associated with traditional data management services in centralized systems that serve as a single point of failure. By outsourcing our KYC services to Civic, we mitigate the risk of attracting hackers and identity thieves that are usually associated with traditional data management services in centralized systems that serve as a single point of failure. Civic is recognized by OWI as a 'Featured Company' in our Solution Providers category because of its unique application of blockchain technology in the identity space. Civic is recognized by OWI as a 'Featured Company' in our Solution Providers category because of its unique application of blockchain technology in the identity space. CapLinked is excited to be offering Civic as a seamless integration to our customers and to be working closely with Civic to develop innovative, secure identity verification products as we move forward with our blockchain project. CapLinked is excited to be offering Civic as a seamless integration to our customers and to be working closely with Civic to develop innovative, secure identity verification products as we move forward with our blockchain project. One of the many benefits of working with Civic is that their protocol actually allows for the verification of, for instance, high school diplomas and other certificates associated with user profiles. One of the many benefits of working with Civic is that their protocol actually allows for the verification of, for instance, high school diplomas and other certificates associated with user profiles. Civic became the first company to turn identity theft protection into truly warning you before the identity theft truck hits you. Civic became the first company to turn identity theft protection into truly warning you before the identity theft truck hits you. The bottom line is that Americans are not in control of when and where their personal information is being used and we plan to change that. The bottom line is that Americans are not in control of when and where their personal information is being used and we plan to change that. Latest Civic Updates News News Opinion Civic Blog"
  ]
}