{
  "company": "www.rayabin.com",
  "dominant_topics": [
    1,
    -1
  ],
  "topic_counts": {
    "1": 8,
    "-1": 2
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.5,
    "framing_market": 0.5,
    "num_docs": 10
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "1": 8
    }
  },
  "sample_docs": [
    "Biometric banking ATM with iris and fingerprint authentication (Bio-ATM) Traffic control gate with iris and fingerprint access (e-Gate) Authentication System in ATM based on Iris Recognition-TV news/channel one/IRIB Finger print recognition system Biometric Smart Card (Java Card) Bio-ATM (Biometric Auto Transfer Machine) E-Banking (Biometric bank customer identification system) Bio-Banking (Banking biometric security total solution) Bio-B ox (Biometric Deposit Safe Box) IRISEC (Iris access control system) E-Gate (Biometric traffic control gates) RAYABIN CO. The Biometric Solution Provider H ome | Products | Solutions | Events | Download | About Us | Contact Us H ome | Products | Solutions | Events | Download | About Us | Contact Us",
    "Match on Card (MoC) National ID Card of IRAN Rayabin is a biometric hardware and software solution and product provider. Our company works on biometric technologies such as iri s , face and fingerprint recognition. We have developed and produced a whole range of biometric access control, traffic control, verification and identification systems to our customers. What we Professional biometric systems with extreme accuracy and speed are what we offer to our customers. Some advantages of our products: Extreme accuracy and no error detected Reliability and lack of opportunity for fraud Offering unrivaled stability and security High recognition speed and scalability Easy to use and user friendly designed Capability to work under network s Various range of operating reports and users logs C ustomize able We are committed to providing the highest quality biometric products and services with unparalleled innovation, high accuracy and speed. R ayabin has designed, tested and launched its independent iris recognition system on a commercial scale. Our e-Gates and Bio-ATMs now are working properly on banking networks. And now... Just choose our new biometric keys to your security locks... RAYABIN CO. The Biometric Solution Provider H ome | Products | Solutions | Events | Download | About Us | Contact Us",
    ">> e-Gate (Biometric G ates) Specific Solutions For Specific Needs... This product is the new generation of biometric traffic control gates. These gates use biometric elements to identify the users. The most secure biometric element is iris so it is the main biometric element in this product. But fingerprint and face recognition could be added to the iris module too. This product could be used as a single system or as a client in the network. Oue biometric modules could be used with different gates from different brands . Biometric Features for Identification Iris - Face - Fingerprint (all / alone) 1 - n or 1-1 2 seconds for each component Win XP SP3 32 bit RAYABIN CO. The Biometric Solution Provider H ome | Products | Solutions | Events | Download | About Us | Contact Us H ome | Products | Solutions | Events | Download | About Us | Contact Us",
    ">> Identification and authentication based on fingerprint recognition Your fingerprint is unique to you and never changes – that is what makes it the most common reliable way to identify you. It cannot be forgotten like a password, it cannot be misplaced like a card and it cannot be stolen, unless they steal your fingers! And it is affordable and convenient. ECOFING is our fingerprint base biometric access control that is very reliable and accurate in AFIS class. This product can be used as a module beside other biometric modules of Rayabin. Also it can be used stand alone or as a client in networks. RAYABIN CO. The Biometric Solution Provider H ome | Products | Solutions | Events | Download | About Us | Contact Us H ome | Products | Solutions | Events | Download | About Us | Contact Us",
    ">> IRISEC (Biometric access control device) IRISEC is a biometric access control system based on iris recognition. This product can control accessing to security zones, places of equipments. User would input him/her unique registration code with the IRISEC keyboard and then must see his/her eye in the mirror. IRISEC will match the input data with the registered data and if those matched, a relay will send a common to open the door or switch on an equipment. IRISEC can be armed with our other biometric solutions like face or fingerprint recognition and can operate as a multimodal system too. It can be used stand alone or as a client in network. RAYABIN CO. The Biometric Solution Provider H ome | Products | Solutions | Events | Download | About Us | Contact Us H ome | Products | Solutions | Events | Download | About Us | Contact Us"
  ]
}