{
  "company": "www.mukh.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 8,
    "0": 4
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 4
    }
  },
  "sample_docs": [
    "May 30th-June 3rd 2017: Mukh Technologies LLC participated FG2017! Mukh Technologies LLC participated and sponsored the 12th IEEE International Conference on Face and Gesture Recognition held in Arlington, VA. March 1st, 2016: Mukh Technologies LLC Face detection, Keypoint detection and pose estimation technology online Today we announce the immediate availability of our Hyperface technology for face detection, key point detection and pose estimation. September 29th, 2015: Mukh Technologies LLC and the University of Maryland Sign Exclusive Licensing Agreement The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. Mukh Technologies LLC participated and sponsored the 12th IEEE International Conference on Face and Gesture Recognition held in Arlington, VA. March 1st, 2016: Mukh Technologies LLC Face detection, Keypoint detection and pose estimation technology online Today we announce the immediate availability of our Hyperface technology for face detection, key point detection and pose estimation. September 29th, 2015: Mukh Technologies LLC and the University of Maryland Sign Exclusive Licensing Agreement The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. March 1st, 2016: Mukh Technologies LLC Face detection, Keypoint detection and pose estimation technology online Today we announce the immediate availability of our Hyperface technology for face detection, key point detection and pose estimation. September 29th, 2015: Mukh Technologies LLC and the University of Maryland Sign Exclusive Licensing Agreement The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. Today we announce the immediate availability of our Hyperface technology for face detection, key point detection and pose estimation. September 29th, 2015: Mukh Technologies LLC and the University of Maryland Sign Exclusive Licensing Agreement The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. September 29th, 2015: Mukh Technologies LLC and the University of Maryland Sign Exclusive Licensing Agreement The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. The University of Maryland and Mukh Techonologies signed today an exclusive licesing agreement over IP for face detection, alignment and recognition. Starting today we can build products using this exciting technology. We will work closely with you to successfully use our API. Founded in 2015, Mukh Technologies is a spin-off from face recognition research performed at the University of Maryland. What does the word mukh mean? Mukh is the word in sanskrit for face. We like mukhs. +1 240 556 0383 2015",
    "Mukh Technologies provides state of the art face detection, face alignment and face recognition technology. Our face recognition recognition pipeline obtains state of the art results in many data sets. In this section we present our evaluation on the IJB-A dataset. Our pipeline provides two methods of operation: Manual: The user provides the locations of the keypoints used for alignment. Automatic: The Mukh Pipeline computes the location of the faces and the locations of the keypoints automatically. These are the results of our pipeline on the IJB-A dataset. A complex, unconstrained dataset of faces in the wild. IJB-A exhibits in-the-wild variation of pose, illumination, expression and age. Our pipeline provides two methods of operation: Manual: The user provides the locations of the keypoints used for alignment. Automatic: The Mukh Pipeline computes the location of the faces and the locations of the keypoints automatically. These are the results of our pipeline on the IJB-A dataset. A complex, unconstrained dataset of faces in the wild. IJB-A exhibits in-the-wild variation of pose, illumination, expression and age. Manual: The user provides the locations of the keypoints used for alignment. Automatic: The Mukh Pipeline computes the location of the faces and the locations of the keypoints automatically. Automatic: The Mukh Pipeline computes the location of the faces and the locations of the keypoints automatically. These are the results of our pipeline on the IJB-A dataset. A complex, unconstrained dataset of faces in the wild. IJB-A exhibits in-the-wild variation of pose, illumination, expression and age. We will work closely with you to successfully use our API. Founded in 2015, Mukh Technologies is a spin-off from face recognition research performed at the University of Maryland. What does the word mukh mean? Mukh is the word in sanskrit for face. We like mukhs. +1 240 556 0383 2015",
    "Mukh Technologies provides state of the art face detection, face alignment and face recognition technology. Our face detection technology has been licensed from the University of Maryland and is one of the top performing algorithms on the standard FDDB evaluation . This plot shows how we compare to all other algorithms on this dataset: You can get a sense of how this level of performance translates to difficult real world data: Our face detection technology has been licensed from the University of Maryland and is one of the top performing algorithms on the standard FDDB evaluation . This plot shows how we compare to all other algorithms on this dataset: You can get a sense of how this level of performance translates to difficult real world data: You can get a sense of how this level of performance translates to difficult real world data: You can get a sense of how this level of performance translates to difficult real world data: We will work closely with you to successfully use our API. Founded in 2015, Mukh Technologies is a spin-off from face recognition research performed at the University of Maryland. What does the word mukh mean? Mukh is the word in sanskrit for face. We like mukhs. +1 240 556 0383 2015",
    "We continuosly evaluate our techonology and compare it to other commercial and academic offerings. We present our technology evaluation in three sections: Face Detection High precision high recall face detection algorithms. Face Alignment/Keypoint detection Pixel accurate keypoint detection with variation in pose and expression. Face Recognition Fast accurate face verification and recognition. High precision high recall face detection algorithms. Pixel accurate keypoint detection with variation in pose and expression. Fast accurate face verification and recognition. We will work closely with you to successfully use our API. Founded in 2015, Mukh Technologies is a spin-off from face recognition research performed at the University of Maryland. What does the word mukh mean? Mukh is the word in sanskrit for face. We like mukhs. +1 240 556 0383 2015",
    "Mukh Technologies provides state of the art face detection, face alignment and face recognition technology. Our keypoint detection technology has been licensed from the University of Maryland and is one of the top performing algorithms on the standard the IJB-A keypoint location accuracy evaluation . This plot compares the location accuracy grouped by pose compared to a well respected academic system: You can get a sense of how this level of performance translates to difficult real world data: Our keypoint detection technology has been licensed from the University of Maryland and is one of the top performing algorithms on the standard the IJB-A keypoint location accuracy evaluation . This plot compares the location accuracy grouped by pose compared to a well respected academic system: You can get a sense of how this level of performance translates to difficult real world data: You can get a sense of how this level of performance translates to difficult real world data: You can get a sense of how this level of performance translates to difficult real world data: We will work closely with you to successfully use our API. Founded in 2015, Mukh Technologies is a spin-off from face recognition research performed at the University of Maryland. What does the word mukh mean? Mukh is the word in sanskrit for face. We like mukhs. +1 240 556 0383 2015"
  ]
}