{
  "company": "www.idnow.io",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.5294117647058824,
    "framing_surveillance": 0.0,
    "framing_market": 0.4705882352941176,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Where trust powers identity. We turn trust into your greatest asset, delivering scalable security, adaptive compliance, and real-time fraud prevention through AI-driven, SaaS-based identity solutions, enabling you to operate seamlessly in a complex digital world. Compliance without complexity. Security without friction. Conversions without barriers. Get in touch IDnow at a glance. 115M+ Identities verified per year 3700+ Documents supported globally 215+ International issuing authorities 600+ Sector-leading customers around the world Creating a new standard of trust. Trust In today's rapidly evolving digital world it's no longer enough to establish trust at the point of entry; businesses must continuously enrich and scale trust to meet the dynamic demands of the digital economy. Trust is more than a requirement — it's a competitive advantage. Explore our success stories AI-powered solutions to detect and stay ahead of evolving threats like deepfakes and social engineering and money mules. Explore our success stories Ensure seamless compliance with EU's new Anti-Money Laundering Regulation (AMLR), ETSI 119.461, eIDAS 2.0 and PSD3 — while providing the most comprehensive identity verification solutions on the market, including video and document verification, manual reviews, NFC-enabled authentication, liveness detection and digital wallet integration. Explore our success stories IDnow provides an adaptable, future-proof verification ecosystem that enables businesses to increase conversions, improve customer engagement, reduce fraud costs and stay ahead of regulatory pressures by embedding trust in every interaction. Explore our success stories AI-powered. Scalable. Secure. Automated identity verification. Empower your business with seamless, AI-driven identity verification that works 24/7. Our solution ensures effortless scalability while maintaining the highest standards of security and data privacy, so you can grow with confidence. Discover more 12 seconds Fast, efficient decisions. 30+ Languages available. 75M+ Documents verified per year. Inclusive. Accessible. Compliant. Expert-led identity verification. Face-to-face video verification with expert assistance for seamless and secure identity verification. From flexible configurations to deep anti-fraud expertise, our solution ensures optimal KYC customization while maintaining a balance between security and accessibility. Discover more Easy. Fast. Secure. Trust Services. Sign documents easier, faster and more securely without the hassle or cost of paper-heavy processes with IDnow Trust Services AB. Discover more It starts with trust. In an increasingly fragmented digital identity landscape, businesses that prioritize trust gain an edge — fostering long-term relationships and building resilience against evolving threats. With IDnow, organizations can simplify complex identity risk management, combat fraud with precision and cut through regulatory complexity, all while delivering trusted, customer-centric experiences that are built to scale and evolve with the future of digital commerce. Explore the future of AML regulation in Europe. By 2027, how financial institutions verify identities will fundamentally change. With Anti-Money Laundering Regulation (AMLR) and eIDAS 2.0 on the horizon, traditional identification methods will no longer be sufficient. Explore our expert guide for a clear overview of current and upcoming EU regulations and access an interactive map with key authorities, official sources, document coverage, and supported IDnow products. Your essential resource for future-ready compliance. Anti-Money Laundering Regulation (AMLR) Julian Grotzbach Head of Credit Card Expansion | TF Bank Thanks to IDnow , we have become the market leader in the credit card segment. Our customers want to be able to use their credit card as quickly as possible, right after applying, and thanks to IDnow they can. Our secure identification and digital signature process enables customers to activate the card immediately and use it right away. Read the TF Bank Case Study Thibault De Valroger Senior Director Business Development | DocuSign We value our long-term partnership with IDnow, enabling our customers to cope with the most demanding regulations in several EU countries including Germany. We can always appreciate the ability of IDnow to lead the way in highly trusted identity services. Baptiste Delalbre Director of Operations | Staffmatch IDnow's solution allows our users to easily capture their identity documents and IBAN. This allows our admin teams to focus on other tasks, and retrieve authentic and reliable documents to create temporary workers' accounts. Michel Billon CEO | Hanseatic Bank Through our partnership with IDnow, our customers can now verify their identity independently from anywhere, without being restricted by service hours. This brings us another step closer to our goal of making all banking processes completely digital and as simple as possible. Severin Kranz Head of Business Development | 21X 21X operates at the cutting edge of capital markets and we need equally capable partners. Partnering with IDnow enables us to rapidly launch new offerings while ensuring our participants remain compliant. Recently, the exceptional team at IDnow went above and beyond to support us in delivering a new solution in weeks rather than months. We look forward to further strengthening our partnership and powering the future of capital markets together. Questions ? Let's talk Where trust powers identity. We turn trust into your greatest asset, delivering scalable security, adaptive compliance, and real-time fraud prevention through AI-driven, SaaS-based identity solutions, enabling you to operate seamlessly in a complex digital world. Compliance without complexity. Security without friction. Conversions without barriers. Get in touch Where trust powers identity. We turn trust into your greatest asset, delivering scalable security, adaptive compliance, and real-time fraud prevention through AI-driven, SaaS-based identity solutions, enabling you to operate seamlessly in a complex digital world. IDnow at a glance. 115M+ Identities verified per year 3700+ Documents supported globally 215+ International issuing authorities 600+ Sector-leading customers around the world IDnow at a glance. 115M+ Identities verified per year 3700+ Documents supported globally 215+ International issuing authorities 600+ Sector-leading customers around the world Creating a new standard of trust. Trust In today's rapidly evolving digital world it's no longer enough to establish trust at the point of entry; businesses must continuously enrich and scale trust to meet the dynamic demands of the digital economy. Trust is more than a requirement — it's a competitive advantage. Explore our success stories AI-powered solutions to detect and stay ahead of evolving threats like deepfakes and social engineering and money mules. Explore our success stories Ensure seamless compliance with EU's new Anti-Money Laundering Regulation (AMLR), ETSI 119.461, eIDAS 2.0 and PSD3 — while providing the most comprehensive identity verification solutions on the market, including video and document verification, manual reviews, NFC-enabled authentication, liveness detection and digital wallet integration. Explore our success stories IDnow provides an adaptable, future-proof verification ecosystem that enables businesses to increase conversions, improve customer engagement, reduce fraud costs and stay ahead of regulatory pressures by embedding trust in every interaction. Explore our success stories Creating a new standard of trust. In today's rapidly evolving digital world it's no longer enough to establish trust at the point of entry; businesses must continuously enrich and scale trust to meet the dynamic demands of the digital economy. Trust is more than a requirement — it's a competitive advantage. AI-powered solutions to detect and stay ahead of evolving threats like deepfakes and social engineering and money mules. Ensure seamless compliance with EU's new Anti-Money Laundering Regulation (AMLR), ETSI 119.461, eIDAS 2.0 and PSD3 — while providing the most comprehensive identity verification solutions on the market, including video and document verification, manual reviews, NFC-enabled authentication, liveness detection and digital wallet integration. IDnow provides an adaptable, future-proof verification ecosystem that enables businesses to increase conversions, improve customer engagement, reduce fraud costs and stay ahead of regulatory pressures by embedding trust in every interaction. AI-powered. Scalable. Secure. Automated identity verification. Empower your business with seamless, AI-driven identity verification that works 24/7. Our solution ensures effortless scalability while maintaining the highest standards of security and data privacy, so you can grow with confidence. Discover more Empower your business with seamless, AI-driven identity verification that works 24/7. Our solution ensures effortless scalability while maintaining the highest standards of security and data privacy, so you can grow with confidence. 12 seconds Fast, efficient decisions. 30+ Languages available. 75M+ Documents verified per year. Inclusive. Accessible. Compliant. Expert-led identity verification. Face-to-face video verification with expert assistance for seamless and secure identity verification. From flexible configurations to deep anti-fraud expertise, our solution ensures optimal KYC customization while maintaining a balance between security and accessibility. Discover more Face-to-face video verification with expert assistance for seamless and secure identity verification. From flexible configurations to deep anti-fraud expertise, our solution ensures optimal KYC customization while maintaining a balance between security and accessibility. Easy. Fast. Secure. Trust Services. Sign documents easier, faster and more securely without the hassle or cost of paper-heavy processes with IDnow Trust Services AB. Discover more Sign documents easier, faster and more securely without the hassle or cost of paper-heavy processes with IDnow Trust Services AB. It starts with trust. In an increasingly fragmented digital identity landscape, businesses that prioritize trust gain an edge — fostering long-term relationships and building resilience against evolving threats. With IDnow, organizations can simplify complex identity risk management, combat fraud with precision and cut through regulatory complexity, all while delivering trusted, customer-centric experiences that are built to scale and evolve with the future of digital commerce. Explore the future of AML regulation in Europe. By 2027, how financial institutions verify identities will fundamentally change. With Anti-Money Laundering Regulation (AMLR) and eIDAS 2.0 on the horizon, traditional identification methods will no longer be sufficient. Explore our expert guide for a clear overview of current and upcoming EU regulations and access an interactive map with key authorities, official sources, document coverage, and supported IDnow products. Your essential resource for future-ready compliance. Anti-Money Laundering Regulation (AMLR) It starts with trust. In an increasingly fragmented digital identity landscape, businesses that prioritize trust gain an edge — fostering long-term relationships and building resilience against evolving threats. With IDnow, organizations can simplify complex identity risk management, combat fraud with precision and cut through regulatory complexity, all while delivering trusted, customer-centric experiences that are built to scale and evolve with the future of digital commerce. Explore the future of AML regulation in Europe. By 2027, how financial institutions verify identities will fundamentally change. With Anti-Money Laundering Regulation (AMLR) and eIDAS 2.0 on the horizon, traditional identification methods will no longer be sufficient. Explore our expert guide for a clear overview of current and upcoming EU regulations and access an interactive map with key authorities, official sources, document coverage, and supported IDnow products. Your essential resource for future-ready compliance. Anti-Money Laundering Regulation (AMLR) By 2027, how financial institutions verify identities will fundamentally change. With Anti-Money Laundering Regulation (AMLR) and eIDAS 2.0 on the horizon, traditional identification methods will no longer be sufficient. Explore our expert guide for a clear overview of current and upcoming EU regulations and access an interactive map with key authorities, official sources, document coverage, and supported IDnow products. Your essential resource for future-ready compliance. Anti-Money Laundering Regulation (AMLR) Julian Grotzbach Head of Credit Card Expansion | TF Bank Thanks to IDnow , we have become the market leader in the credit card segment. Our customers want to be able to use their credit card as quickly as possible, right after applying, and thanks to IDnow they can. Our secure identification and digital signature process enables customers to activate the card immediately and use it right away. Read the TF Bank Case Study Thibault De Valroger Senior Director Business Development | DocuSign We value our long-term partnership with IDnow, enabling our customers to cope with the most demanding regulations in several EU countries including Germany. We can always appreciate the ability of IDnow to lead the way in highly trusted identity services. Baptiste Delalbre Director of Operations | Staffmatch IDnow's solution allows our users to easily capture their identity documents and IBAN. This allows our admin teams to focus on other tasks, and retrieve authentic and reliable documents to create temporary workers' accounts. Michel Billon CEO | Hanseatic Bank Through our partnership with IDnow, our customers can now verify their identity independently from anywhere, without being restricted by service hours. This brings us another step closer to our goal of making all banking processes completely digital and as simple as possible. Severin Kranz Head of Business Development | 21X 21X operates at the cutting edge of capital markets and we need equally capable partners. Partnering with IDnow enables us to rapidly launch new offerings while ensuring our participants remain compliant. Recently, the exceptional team at IDnow went above and beyond to support us in delivering a new solution in weeks rather than months. We look forward to further strengthening our partnership and powering the future of capital markets together. Head of Credit Card Expansion | TF Bank Senior Director Business Development | DocuSign Director of Operations | Staffmatch CEO | Hanseatic Bank Head of Business Development | 21X Questions ? Let's talk",
    "Product ▼ IDnow AutoIdent IDnow VideoIdent IDnow eSign IDnow Platform Professional Services Use Cases ▼ Finance Insurance & Insurtech Automotive Telecommunications Digital Contract Management eCommerce Company ▼ News Management About us References Careers Press Legal ▼ Privacy Revocation Imprint Legal ▼ Privacy Revocation Imprint Resources ▼ Regulation & Security ▼ Compliance Identification & KYC eSigning Data Security Certification Policies Downloads FAQ ▼ FAQ IDnow AutoIdent FAQ IDnow VideoIdent FAQ IDnow eSign Regulation & Security ▼ Compliance Identification & KYC eSigning Data Security Certification Policies FAQ ▼ FAQ IDnow AutoIdent FAQ IDnow VideoIdent FAQ IDnow eSign The fastest way to verify your customer's identity. Try AutoIdent now Trusted by companies across the world Our Platform IDnow is the world's fastest, most flexible and most secure identity verification platform. Designed to your needs. Our platform offers complete flexibility across a wide range of KYC services, from fully automated to agent-assisted solutions. Global Reach. Using a combination of AI, facial recognition and machine learning, it delivers instant verification of the identity documents used by 7 billion people. Regulatory Compliance. With IDnow's unique combination of KYC regulatory compliance, future-proof patent-protected technology and comprehensive global identity document database, opens your business to more customers than ever before. Why successful companies are choosing us The comfort of absolute compliance combined with the freedom to create tailored identity verification solutions. We've been providing KYC services for the financial sector in some of the most tightly regulated markets in the world for a few years now. As one of the earliest companies to operate in this space, we're able to train our AI-powered platform with more real-world data than anyone, meaning our platform is faster and more reliable, giving our customers everything they need to onboard customers quickly and confidently. Better for your customers Great on-boarding experience Any device capability – desktop, tablet and mobile Safe, secure and fast ID verification Better for your business Provides huge conversion rate improvements Is fully compliant with all regulatory requirement Europe-wide Is easy to implement and technologically sound Meet AutoIdent The latest arrival to the IDnow product family AUTOMATIC 07. Aug 2019 The Financial Market Authority (FMA) in Liechtenstein approves Remote-Identification After the success of video-based identification methods in the financial sector, the Financial Market Authority Liechtenstein approved automatic identification solutions, such ... Read more IDNOW 01. Jul 2019 Fintech TV interview with Oliver Obitayo at Money20/20 Fintech TV spoke with Oliver Obitayo – Chief Sales Officer at IDnow about the background of IDnow, being at the Money20/20 event and what trends we are noticing in the ... Read more FUTURE 07. May 2019 Meet our new CEO and CFO IDnow welcomes Andreas Bodczek as new CEO and Joseph Lichtenberger as CFO. Together with Executive Chairman Felix Haas they are talking about their vision, IDnow's position in ... Read more LOVE 06. May 2019 Celebrating our 5-star-rating on Trustpilot We love our customers and they love us too. Impressive 5.000 ratings show how content people are with our products. We worked hard to improve our ... Read more FINTECH 05. May 2019 Meet us at Money20/20 IDnow is proud sponsor of Money20/20. The leading fintech conference takes place in Amsterdam from June 3rd – June 5th and gathers renowned speaker, the most relevant ... Read more 100% REMOTE 11. Apr 2019 DocuSign and IDnow France Launch Remote Qualified Electronic Signature Offering Partnership paves the way for efficient, secure and fully digital customer onboarding certified by ANSSI Paris, April 11, 2019 – IDnow, the online identification ... Read more LIBERLAND 12. Jul 2019 Liberland Limited – the third smallest sovereign state in the world is using AutoIdent The Free Republic of Liberland is located between Croatia and Serbia. The land referred to as \"Gornja Siga\" has a size of 7 square kilometers. The founder and elected ... Read more EVENTIM 10. Apr 2019 Eventim – Europe's market leader in ticketing and live entertainment using IDnow's eSign CTS EVENTIM AG & Co. KGaA operates in 25 countries. With over 100 million tickets sold per year, it is Europe's market leader in ticketing and live entertainment. The ... Read more COMPANY 01. Jul 2019 Stootie – The french platform for everyday tasks is now using IDnow's AutoIdent product The French company Stootie SAS was founded in 2011. Stootie provides references for everyday services, quickly finding over 110,000 professionals and qualified individuals. ... Read more COMPANY 05. Jul 2019 TrueProfile.io – The world's leading provider of specialised Primary Source Verification, background screening and immigration compliance solutions is using IDnow Governments, public institutions and private sector organisations worldwide all recognise that one of the biggest threats to security, service quality and stakeholder ... Read more AG 24. Jun 2019 Finexity – Real estate investment company powered and secured by IDnow's VideoIdent. Finexity AG operates in Hamburg. They offer flexible real estate investments starting at 500 euros. The company is known to make property investments accessible for everybody. ... Read more ACCOUNTS 03. Apr 2019 Bank of Scotland – IDnow powers Bank of Scotland Bank of Scotland is a retail and commercial bank that has a proud heritage. Based in Edinburgh, it is Scotland's oldest bank and has been a pillar of the Scottish business ... Read more News & Insights Join our mailing list and discover what's shaping the Now Economy and the latest updates from across our business. More Insights Succeeding in the Now Economy Our expectations of how we interact with companies have never been higher. In today's hyper-connected global society – the economy of right now, not in a moment – we won't wait for anything. From ordering our favourite food to applying for a loan, we want everything now. The challenge for businesses as they digitise their services is to quickly and confidently verify that their customers are who they say they are. Companies that fail to meet our right-now, any-device expectations, or introduce friction or unnecessary steps to on-boarding, will lose out. Those that provide a frictionless, intuitive user experience will see higher conversion rates and happier customers. The fastest way to verify your customer's identity. Try AutoIdent now Trusted by companies across the world Our Platform IDnow is the world's fastest, most flexible and most secure identity verification platform. Designed to your needs. Our platform offers complete flexibility across a wide range of KYC services, from fully automated to agent-assisted solutions. Global Reach. Using a combination of AI, facial recognition and machine learning, it delivers instant verification of the identity documents used by 7 billion people. Regulatory Compliance. With IDnow's unique combination of KYC regulatory compliance, future-proof patent-protected technology and comprehensive global identity document database, opens your business to more customers than ever before. Why successful companies are choosing us The comfort of absolute compliance combined with the freedom to create tailored identity verification solutions. We've been providing KYC services for the financial sector in some of the most tightly regulated markets in the world for a few years now. As one of the earliest companies to operate in this space, we're able to train our AI-powered platform with more real-world data than anyone, meaning our platform is faster and more reliable, giving our customers everything they need to onboard customers quickly and confidently. Better for your customers Great on-boarding experience Any device capability – desktop, tablet and mobile Safe, secure and fast ID verification Better for your business Provides huge conversion rate improvements Is fully compliant with all regulatory requirement Europe-wide Is easy to implement and technologically sound Meet AutoIdent The latest arrival to the IDnow product family AUTOMATIC 07. Aug 2019 The Financial Market Authority (FMA) in Liechtenstein approves Remote-Identification After the success of video-based identification methods in the financial sector, the Financial Market Authority Liechtenstein approved automatic identification solutions, such ... Read more IDNOW 01. Jul 2019 Fintech TV interview with Oliver Obitayo at Money20/20 Fintech TV spoke with Oliver Obitayo – Chief Sales Officer at IDnow about the background of IDnow, being at the Money20/20 event and what trends we are noticing in the ... Read more FUTURE 07. May 2019 Meet our new CEO and CFO IDnow welcomes Andreas Bodczek as new CEO and Joseph Lichtenberger as CFO. Together with Executive Chairman Felix Haas they are talking about their vision, IDnow's position in ... Read more LOVE 06. May 2019 Celebrating our 5-star-rating on Trustpilot We love our customers and they love us too. Impressive 5.000 ratings show how content people are with our products. We worked hard to improve our ... Read more FINTECH 05. May 2019 Meet us at Money20/20 IDnow is proud sponsor of Money20/20. The leading fintech conference takes place in Amsterdam from June 3rd – June 5th and gathers renowned speaker, the most relevant ... Read more 100% REMOTE 11. Apr 2019 DocuSign and IDnow France Launch Remote Qualified Electronic Signature Offering Partnership paves the way for efficient, secure and fully digital customer onboarding certified by ANSSI Paris, April 11, 2019 – IDnow, the online identification ... Read more LIBERLAND 12. Jul 2019 Liberland Limited – the third smallest sovereign state in the world is using AutoIdent The Free Republic of Liberland is located between Croatia and Serbia. The land referred to as \"Gornja Siga\" has a size of 7 square kilometers. The founder and elected ... Read more EVENTIM 10. Apr 2019 Eventim – Europe's market leader in ticketing and live entertainment using IDnow's eSign CTS EVENTIM AG & Co. KGaA operates in 25 countries. With over 100 million tickets sold per year, it is Europe's market leader in ticketing and live entertainment. The ... Read more COMPANY 01. Jul 2019 Stootie – The french platform for everyday tasks is now using IDnow's AutoIdent product The French company Stootie SAS was founded in 2011. Stootie provides references for everyday services, quickly finding over 110,000 professionals and qualified individuals. ... Read more COMPANY 05. Jul 2019 TrueProfile.io – The world's leading provider of specialised Primary Source Verification, background screening and immigration compliance solutions is using IDnow Governments, public institutions and private sector organisations worldwide all recognise that one of the biggest threats to security, service quality and stakeholder ... Read more AG 24. Jun 2019 Finexity – Real estate investment company powered and secured by IDnow's VideoIdent. Finexity AG operates in Hamburg. They offer flexible real estate investments starting at 500 euros. The company is known to make property investments accessible for everybody. ... Read more ACCOUNTS 03. Apr 2019 Bank of Scotland – IDnow powers Bank of Scotland Bank of Scotland is a retail and commercial bank that has a proud heritage. Based in Edinburgh, it is Scotland's oldest bank and has been a pillar of the Scottish business ... Read more News & Insights Join our mailing list and discover what's shaping the Now Economy and the latest updates from across our business. More Insights Succeeding in the Now Economy Our expectations of how we interact with companies have never been higher. In today's hyper-connected global society – the economy of right now, not in a moment – we won't wait for anything. From ordering our favourite food to applying for a loan, we want everything now. The challenge for businesses as they digitise their services is to quickly and confidently verify that their customers are who they say they are. Companies that fail to meet our right-now, any-device expectations, or introduce friction or unnecessary steps to on-boarding, will lose out. Those that provide a frictionless, intuitive user experience will see higher conversion rates and happier customers. The fastest way to verify your customer's identity. Try AutoIdent now Trusted by companies across the world Our Platform IDnow is the world's fastest, most flexible and most secure identity verification platform. Designed to your needs. Our platform offers complete flexibility across a wide range of KYC services, from fully automated to agent-assisted solutions. Global Reach. Using a combination of AI, facial recognition and machine learning, it delivers instant verification of the identity documents used by 7 billion people. Regulatory Compliance. With IDnow's unique combination of KYC regulatory compliance, future-proof patent-protected technology and comprehensive global identity document database, opens your business to more customers than ever before. Why successful companies are choosing us The comfort of absolute compliance combined with the freedom to create tailored identity verification solutions. We've been providing KYC services for the financial sector in some of the most tightly regulated markets in the world for a few years now. As one of the earliest companies to operate in this space, we're able to train our AI-powered platform with more real-world data than anyone, meaning our platform is faster and more reliable, giving our customers everything they need to onboard customers quickly and confidently. Better for your customers Great on-boarding experience Any device capability – desktop, tablet and mobile Safe, secure and fast ID verification Better for your business Provides huge conversion rate improvements Is fully compliant with all regulatory requirement Europe-wide Is easy to implement and technologically sound Meet AutoIdent The latest arrival to the IDnow product family AUTOMATIC 07. Aug 2019 The Financial Market Authority (FMA) in Liechtenstein approves Remote-Identification After the success of video-based identification methods in the financial sector, the Financial Market Authority Liechtenstein approved automatic identification solutions, such ... Read more IDNOW 01. Jul 2019 Fintech TV interview with Oliver Obitayo at Money20/20 Fintech TV spoke with Oliver Obitayo – Chief Sales Officer at IDnow about the background of IDnow, being at the Money20/20 event and what trends we are noticing in the ... Read more FUTURE 07. May 2019 Meet our new CEO and CFO IDnow welcomes Andreas Bodczek as new CEO and Joseph Lichtenberger as CFO. Together with Executive Chairman Felix Haas they are talking about their vision, IDnow's position in ... Read more LOVE 06. May 2019 Celebrating our 5-star-rating on Trustpilot We love our customers and they love us too. Impressive 5.000 ratings show how content people are with our products. We worked hard to improve our ... Read more FINTECH 05. May 2019 Meet us at Money20/20 IDnow is proud sponsor of Money20/20. The leading fintech conference takes place in Amsterdam from June 3rd – June 5th and gathers renowned speaker, the most relevant ... Read more 100% REMOTE 11. Apr 2019 DocuSign and IDnow France Launch Remote Qualified Electronic Signature Offering Partnership paves the way for efficient, secure and fully digital customer onboarding certified by ANSSI Paris, April 11, 2019 – IDnow, the online identification ... Read more LIBERLAND 12. Jul 2019 Liberland Limited – the third smallest sovereign state in the world is using AutoIdent The Free Republic of Liberland is located between Croatia and Serbia. The land referred to as \"Gornja Siga\" has a size of 7 square kilometers. The founder and elected ... Read more EVENTIM 10. Apr 2019 Eventim – Europe's market leader in ticketing and live entertainment using IDnow's eSign CTS EVENTIM AG & Co. KGaA operates in 25 countries. With over 100 million tickets sold per year, it is Europe's market leader in ticketing and live entertainment. The ... Read more COMPANY 01. Jul 2019 Stootie – The french platform for everyday tasks is now using IDnow's AutoIdent product The French company Stootie SAS was founded in 2011. Stootie provides references for everyday services, quickly finding over 110,000 professionals and qualified individuals. ... Read more COMPANY 05. Jul 2019 TrueProfile.io – The world's leading provider of specialised Primary Source Verification, background screening and immigration compliance solutions is using IDnow Governments, public institutions and private sector organisations worldwide all recognise that one of the biggest threats to security, service quality and stakeholder ... Read more AG 24. Jun 2019 Finexity – Real estate investment company powered and secured by IDnow's VideoIdent. Finexity AG operates in Hamburg. They offer flexible real estate investments starting at 500 euros. The company is known to make property investments accessible for everybody. ... Read more ACCOUNTS 03. Apr 2019 Bank of Scotland – IDnow powers Bank of Scotland Bank of Scotland is a retail and commercial bank that has a proud heritage. Based in Edinburgh, it is Scotland's oldest bank and has been a pillar of the Scottish business ... Read more News & Insights Join our mailing list and discover what's shaping the Now Economy and the latest updates from across our business. More Insights Succeeding in the Now Economy Our expectations of how we interact with companies have never been higher. In today's hyper-connected global society – the economy of right now, not in a moment – we won't wait for anything. From ordering our favourite food to applying for a loan, we want everything now. The challenge for businesses as they digitise their services is to quickly and confidently verify that their customers are who they say they are. Companies that fail to meet our right-now, any-device expectations, or introduce friction or unnecessary steps to on-boarding, will lose out. Those that provide a frictionless, intuitive user experience will see higher conversion rates and happier customers. The fastest way to verify your customer's identity. Trusted by companies across the world IDnow is the world's fastest, most flexible and most secure identity verification platform. Designed to your needs. Our platform offers complete flexibility across a wide range of KYC services, from fully automated to agent-assisted solutions. Using a combination of AI, facial recognition and machine learning, it delivers instant verification of the identity documents used by 7 billion people. With IDnow's unique combination of KYC regulatory compliance, future-proof patent-protected technology and comprehensive global identity document database, opens your business to more customers than ever before. Why successful companies are choosing us The comfort of absolute compliance combined with the freedom to create tailored identity verification solutions. We've been providing KYC services for the financial sector in some of the most tightly regulated markets in the world for a few years now. As one of the earliest companies to operate in this space, we're able to train our AI-powered platform with more real-world data than anyone, meaning our platform is faster and more reliable, giving our customers everything they need to onboard customers quickly and confidently. Better for your customers Any device capability – desktop, tablet and mobile Safe, secure and fast ID verification Better for your business Provides huge conversion rate improvements Is fully compliant with all regulatory requirement Europe-wide Is easy to implement and technologically sound The latest arrival to the IDnow product family The Financial Market Authority (FMA) in Liechtenstein approves Remote-Identification Fintech TV interview with Oliver Obitayo at Money20/20 Meet our new CEO and CFO Celebrating our 5-star-rating on Trustpilot Meet us at Money20/20 DocuSign and IDnow France Launch Remote Qualified Electronic Signature Offering Liberland Limited – the third smallest sovereign state in the world is using AutoIdent Eventim – Europe's market leader in ticketing and live entertainment using IDnow's eSign Stootie – The french platform for everyday tasks is now using IDnow's AutoIdent product TrueProfile.io – The world's leading provider of specialised Primary Source Verification, background screening and immigration compliance solutions is using IDnow Finexity – Real estate investment company powered and secured by IDnow's VideoIdent. Bank of Scotland – IDnow powers Bank of Scotland Join our mailing list and discover what's shaping the Now Economy and the latest updates from across our business. Succeeding in the Now Economy Our expectations of how we interact with companies have never been higher. In today's hyper-connected global society – the economy of right now, not in a moment – we won't wait for anything. From ordering our favourite food to applying for a loan, we want everything now. The challenge for businesses as they digitise their services is to quickly and confidently verify that their customers are who they say they are. Companies that fail to meet our right-now, any-device expectations, or introduce friction or unnecessary steps to on-boarding, will lose out. Those that provide a frictionless, intuitive user experience will see higher conversion rates and happier customers."
  ]
}