{
  "company": "www.ekin.com",
  "dominant_topics": [
    -1
  ],
  "topic_counts": {
    "-1": 2
  },
  "topic_descriptions": {},
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.2,
    "framing_market": 0.8,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "-1": 2
    }
  },
  "sample_docs": [
    "We are pleased to inform you that Ekin Patrol – Light Bar has got the ECE R65 certificate for the blue – blue light for Europe and has undergone SAE – J845 certification tests for the blue – red light for the US and the whole world. Ekin Bike Patrol was in the International Exhibition & Conference for Public Security in Berlin in March. Ekin Patrol and Ekin Bike Patrol was in Abu Dhabi for the IDEX Show! Ekin Patrol has been represented on the top of a test police car in Germany. The new Ekin Bike Patrol made its premier in the world's biggest technology show CES! Ekin Bike Patrol having the \"2019 Innovation Honoree Award\" in the \"Smart Cities\" category at CES Innovation Awards, had been seen by over 185 thousand visitors from more than 155 countries at Innovation Award Showcase! CES Innovation Award is given to innovative products that make a difference with its design and engineering. Police officers from different state divisions in Texas had the opportunity to experience Ekin Patrol G2 on-site at \"Ride and Drive Expo\" held by Texas DPS Administration Ekin Patrol G2 can't get enough of awards! We are pleased to announce that Ekin Patrol G2 has won \"Product Design\" award in European Product Design Awards 2018. We are proud to add one more achievement to our long list full of awards as the Leader in Safe City Technologies. We took part in \"Combating Crime in Future: Does more security lead the way to complete surveillance?\" documentary coordinated by ARD Alpha with our latest technologies Ekin Patrol G2 and Ekin Face. The first and only mobile smart patrol of the world performing number plate recognition, face recognition, speed and parking violation detection on the move The First and Only Entirely Modular Smart City Furniture Face Detection and Analysis System Recognizing Faces with High Accuracy \"Safe City Operating System\" communicating with all city surveillance systems in the city, generating alarms and alerting actions",
    "Ekin is a global leader in smart city technology We are developing innovative devices and software that keep people safe and improve quality of life. Innovating Safety, Enhancing Lives We are developing innovative devices and software that keep people safe and improve quality of life. All-in-One Safety & Efficiency Solutions From concept to deployment, Ekin delivers comprehensive, all-in-one solutions-combining advanced hardware, intelligent software, and seamless connectivity to enhance safety and efficiency. In-House Hardware & Software Innovation At Ekin, we design and manufacture our own hardware and develop cutting-edge software in-house, ensuring seamless integration, top-tier performance, and unmatched innovation Explore The results speak for: For over 25 years, Ekin's innovational excellence has been certified by international experts worldwide having received more than 40 prestigious awards for excellence in design, innovation, corporate prowess. In addition to its globally acknowledged awards, Ekin's game changing partner network positioned strategically across six continents ensures for continued growth while addressing the specific needs of the various market sectors. Explore Years + Patents + Awards + Smarter solutions For safer cities, communities, homes and businesses. Licence platereader (ALPR) red light camera Mobile Speed Enforcement You don't know what you're missing. Schedule a demo to see the all the captures you might be missing with no system or lowaccuracy systems in place. Book a Demo Let's make your community smarter and safer, together. Ekin partners with communities at all levels to achieve their goals. Law Enforcement Local Municipalities Neighborhoods and HOAs Business Education Private Security Officer Safety Harness the true power of AI with Ekin. Ekin smart city solutions have been using machine learning and artificial intelligence (AI) for more than 15 years. Our software isn't the result of the latest trend, we've built AI into the core since the beginning. Smarter products for safer cities Explore the full range of Ekin products that continue to lead the industry with innovation and accuracy. Spotter Smart City Module LPR, Speed and More Ekin Spotter is a compact AI-powered smart pole that enables real-time traffic monitoring, vehicle detection, and license plate recognition. Maestro OS All-in-one smart city management platform Ekin Maestro is the intelligent command and control platform that unifies all city safety and mobility operations into one seamless system. With real-time data integration, advanced analytics, and intuitive design, Maestro empowers authorities to manage urban life smarter, faster, and more efficiently. Bike Patrol Compact, Highly Mobile LPR, Parking and Surveillance The world's first mobile ALPR solution on a bike, delivering real-time hotlist alerts and parking enforcement — agile, smart, and built for city streets. Patrol G2 Intelligent LPR and Speed Light Bar Ekin Patrol G2 is a high-tech mobile enforcement device that detects speed and parking violations as well as number plate recognition. X Spotter Portable and Mobile LPR, Speed and More Ekin XSpotter is the next-generation smart enforcement system, combining ALPR, speed detection, and surveillance in a single compact, mobile unit — delivering real-time data and actionable insights anywhere, anytime. Box Spotter Portable and Mobile LPR, Speed and More Ekin BoxSpotter is a mobile enforcement solution that combines ALPR and real-time violation detection, providing efficient monitoring and management of restricted zones, parking areas, and more — all from a compact, mobile unit. Why Ekin Our clients know the power of our products better than anyone else. — Peter Iglesias Ex Coral Gables Florida City Manager \"We are proud to be a leading city in innovation and technology. This smart pole with safety cameras, public Wi-Fi, traffic and environmental sensors will assist emergency management in creating a safer community for residents, business owners, and visitors.\" Gerhard Schaub President of the Zurich Police Officer Association \"We had the opportunity to extensively test the Ekin technology in Switzerland. Ekin is the only supplier in the world who can provide the total package in one. We were surprised by the picture quality, the analytical performance, and the speed of the system.\" Resources for Smarter Cities Read our latest articles, download guides, and more. 2024 Neighborhood Watch Statistics 10 Steps to Safeguard Entrances Why Lighting Matters for Security Ekin is a global leader in smart city technology We are developing innovative devices and software that keep people safe and improve quality of life. Ekin is a global leader in smart city technology We are developing innovative devices and software that keep people safe and improve quality of life. Innovating Safety, Enhancing Lives We are developing innovative devices and software that keep people safe and improve quality of life. All-in-One Safety & Efficiency Solutions From concept to deployment, Ekin delivers comprehensive, all-in-one solutions-combining advanced hardware, intelligent software, and seamless connectivity to enhance safety and efficiency. In-House Hardware & Software Innovation At Ekin, we design and manufacture our own hardware and develop cutting-edge software in-house, ensuring seamless integration, top-tier performance, and unmatched innovation Explore Innovating Safety, Enhancing Lives We are developing innovative devices and software that keep people safe and improve quality of life. All-in-One Safety & Efficiency Solutions From concept to deployment, Ekin delivers comprehensive, all-in-one solutions-combining advanced hardware, intelligent software, and seamless connectivity to enhance safety and efficiency. In-House Hardware & Software Innovation At Ekin, we design and manufacture our own hardware and develop cutting-edge software in-house, ensuring seamless integration, top-tier performance, and unmatched innovation The results speak for: For over 25 years, Ekin's innovational excellence has been certified by international experts worldwide having received more than 40 prestigious awards for excellence in design, innovation, corporate prowess. In addition to its globally acknowledged awards, Ekin's game changing partner network positioned strategically across six continents ensures for continued growth while addressing the specific needs of the various market sectors. Explore Years + Patents + Awards + The results speak for: Smarter solutions For safer cities, communities, homes and businesses. Licence platereader (ALPR) red light camera Mobile Speed Enforcement You don't know what you're missing. Schedule a demo to see the all the captures you might be missing with no system or lowaccuracy systems in place. Book a Demo You don't know what you're missing. Let's make your community smarter and safer, together. Ekin partners with communities at all levels to achieve their goals. Law Enforcement Local Municipalities Neighborhoods and HOAs Business Education Private Security Officer Safety Let's make your community smarter and safer, together. Ekin partners with communities at all levels to achieve their goals. Harness the true power of AI with Ekin. Ekin smart city solutions have been using machine learning and artificial intelligence (AI) for more than 15 years. Our software isn't the result of the latest trend, we've built AI into the core since the beginning. Harness the true power of AI with Ekin. Ekin smart city solutions have been using machine learning and artificial intelligence (AI) for more than 15 years. Our software isn't the result of the latest trend, we've built AI into the core since the beginning. Smarter products for safer cities Explore the full range of Ekin products that continue to lead the industry with innovation and accuracy. Spotter Smart City Module LPR, Speed and More Ekin Spotter is a compact AI-powered smart pole that enables real-time traffic monitoring, vehicle detection, and license plate recognition. Maestro OS All-in-one smart city management platform Ekin Maestro is the intelligent command and control platform that unifies all city safety and mobility operations into one seamless system. With real-time data integration, advanced analytics, and intuitive design, Maestro empowers authorities to manage urban life smarter, faster, and more efficiently. Bike Patrol Compact, Highly Mobile LPR, Parking and Surveillance The world's first mobile ALPR solution on a bike, delivering real-time hotlist alerts and parking enforcement — agile, smart, and built for city streets. Patrol G2 Intelligent LPR and Speed Light Bar Ekin Patrol G2 is a high-tech mobile enforcement device that detects speed and parking violations as well as number plate recognition. X Spotter Portable and Mobile LPR, Speed and More Ekin XSpotter is the next-generation smart enforcement system, combining ALPR, speed detection, and surveillance in a single compact, mobile unit — delivering real-time data and actionable insights anywhere, anytime. Box Spotter Portable and Mobile LPR, Speed and More Ekin BoxSpotter is a mobile enforcement solution that combines ALPR and real-time violation detection, providing efficient monitoring and management of restricted zones, parking areas, and more — all from a compact, mobile unit. Smarter products for safer cities Explore the full range of Ekin products that continue to lead the industry with innovation and accuracy. Why Ekin Our clients know the power of our products better than anyone else. — Peter Iglesias Ex Coral Gables Florida City Manager \"We are proud to be a leading city in innovation and technology. This smart pole with safety cameras, public Wi-Fi, traffic and environmental sensors will assist emergency management in creating a safer community for residents, business owners, and visitors.\" Gerhard Schaub President of the Zurich Police Officer Association \"We had the opportunity to extensively test the Ekin technology in Switzerland. Ekin is the only supplier in the world who can provide the total package in one. We were surprised by the picture quality, the analytical performance, and the speed of the system.\" Our clients know the power of our products better than anyone else. Resources for Smarter Cities Read our latest articles, download guides, and more. 2024 Neighborhood Watch Statistics 10 Steps to Safeguard Entrances Why Lighting Matters for Security Resources for Smarter Cities Read our latest articles, download guides, and more. Smarter is Safer Smarter is Safer"
  ]
}