{
  "company": "www.dgworld.com",
  "dominant_topics": [
    28,
    7,
    2,
    -1,
    0
  ],
  "topic_counts": {
    "28": 15,
    "7": 11,
    "2": 3,
    "-1": 1,
    "0": 1
  },
  "topic_descriptions": {
    "28": "dgworld, autonomous, engineer, senior, robot",
    "7": "ramco, payroll, aviation, en, ramco systems",
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.0483870967741935,
    "framing_market": 0.9516129032258064,
    "num_docs": 31
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1,
      "2": 3,
      "7": 11,
      "28": 15
    }
  },
  "sample_docs": [
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO Application scenarios: guard, nurse, PA, hostess, cashier Industries: Transportation, government, education, hospitality, finance, retail. Governments & Communities 4.0 Application scenarios: guard, nurse, PA, hostess, cashier Industries: Transportation, government, education, hospitality, finance, retail. WISO Features: Safe and secure database Big Data analysis and management Centralized control system Multimodal interaction Flexible movement Speech engine Autonomous navigation (SLAM Technology) Automatic docking and recharging Temperature checking Facial recognition Mask reminder Service feedback system Attachable serving tray Payment system Greeting and guiding services Safe and secure database Big Data analysis and management Autonomous navigation (SLAM Technology) Automatic docking and recharging Greeting and guiding services Video Image Gallery Enquiry Sign-up for news updates and alerts",
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO Autonomous Logistic Robots LogiBOT is an omnidirectional, autonomous mobile platform that is perfectly suited to the automation processes of Industry 4.0 and advanced logistics in Warehouses of today. LogiBOTautonomously fetches the required components or returns them to the warehouse after processing. It can move about freely and without conventional guidance or navigation elements. This makes integration into any environment much easier and increases efficiency in logistics management. With payload capacities from2 kg up to 90 tons, LogiBOTsafely moves your products through the entire manufacturing process. It meets all necessary safety standards and is also extremely flexible. Integrated safety laser scanners enable autonomous navigation through your production shop and the electrical drive system makes it environmentally friendly and efficient. Our Fleet Management Software ensures that right LogiBot is available at the right place at the right time.Once your Warehouse is mapped, theLogiBot´s can navigate through it completely independently. All LogiBot´s can route itself and always travel the shortest distance from point A to point B on their own. In combination with our Fleet Management Software, your fleet of LogiBOT´sis ready to impress you with the performance of intelligent and smart transport of a robotic swarm. Offers highest efficiency and flexibility for any logistics application Perfect solution for factories, warehouses and logistic hubs. Integrated - Barcode Scanning Solution for seamless data transfer and tracking of goods (option) Fully scalable - fleet size that can be expanded at any time Navigation System without any installed markers or infrastructure offers integration anywhere Dynamic Re-routing – dynamically bypasses obstacles Unlimited Applications –LogiBOT carries out tasks by itself and supports humans in their daily processes User-Friendly and highly efficient design Automatic Recharging at charging stations and cable charging is available CE and Safety-certified for interaction with people LogiBot is available in 3 different versions, to suit your needs: LogiBOT – S (up to 100kg) – the allrounder which can fit for various applications (available in different versions) LogiBOT – M (up to 1500kg) – the perfect choice for all Industry 4.0 applications in production lines LogiBOT – L (up to 90 tons) – suitable for highest loads and heavy-load applications (different versions available) Governments & Communities 4.0 LogiBOT is an omnidirectional, autonomous mobile platform that is perfectly suited to the automation processes of Industry 4.0 and advanced logistics in Warehouses of today. LogiBOTautonomously fetches the required components or returns them to the warehouse after processing. It can move about freely and without conventional guidance or navigation elements. This makes integration into any environment much easier and increases efficiency in logistics management. With payload capacities from2 kg up to 90 tons, LogiBOTsafely moves your products through the entire manufacturing process. It meets all necessary safety standards and is also extremely flexible. Integrated safety laser scanners enable autonomous navigation through your production shop and the electrical drive system makes it environmentally friendly and efficient. Our Fleet Management Software ensures that right LogiBot is available at the right place at the right time.Once your Warehouse is mapped, theLogiBot´s can navigate through it completely independently. All LogiBot´s can route itself and always travel the shortest distance from point A to point B on their own. In combination with our Fleet Management Software, your fleet of LogiBOT´sis ready to impress you with the performance of intelligent and smart transport of a robotic swarm. Offers highest efficiency and flexibility for any logistics application Perfect solution for factories, warehouses and logistic hubs. Integrated - Barcode Scanning Solution for seamless data transfer and tracking of goods (option) Fully scalable - fleet size that can be expanded at any time Navigation System without any installed markers or infrastructure offers integration anywhere Dynamic Re-routing – dynamically bypasses obstacles Unlimited Applications –LogiBOT carries out tasks by itself and supports humans in their daily processes User-Friendly and highly efficient design Automatic Recharging at charging stations and cable charging is available CE and Safety-certified for interaction with people LogiBOT – S (up to 100kg) – the allrounder which can fit for various applications (available in different versions) LogiBOT – M (up to 1500kg) – the perfect choice for all Industry 4.0 applications in production lines LogiBOT – L (up to 90 tons) – suitable for highest loads and heavy-load applications (different versions available) Video Image Gallery Enquiry Sign-up for news updates and alerts",
    "Governments & Communities 4.0 BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO FireBOT ForkBOT FuelBOT GrassBOT SecurityBOT SecurityBOT B SimBOT SweeBOT TiGO TrashBOT TruGO WISO AmbuBOT Logistics 4.0 BagBOT BiGO DeliveryBOT DeliveryBOT B eBiGO eTiGO eTruGO ForkBOT FuelBOT SimBOT TiGO TrashBOT TruGO WISO Industry 4.0 3DPrintingBOT BlastBOT CutBOT ForkBOT LogiBOT MillingBOT PalletBOT PaintBOT WeldBOT Hospitality 4.0 ArtistBOT BagBOT BaristaBOT BasketBOT ChessBOT CocktailBOT DeliveryBOT DeliveryBOT B eBiGO FuelBOT SimBOT SnackBOT TrayBot TVBOT WISO E-BiGo - Green and futuristic Transport today Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. The cutting-edge design of e-BiGO combines functionality with a futuristic appearance. e-BiGO can be utilized in any controlled environment, but even advanced traffic situation can be handled with ease. We have developed new embedded safety modules to enhance the autonomous driving and open new horizons of applications. Experience latest AI Technology during a chilled ride with your family, friends or on your daily way to work. Advanced user interaction features, like speech Processing, custom Applications and connected Services let any passenger experience autonomous Transportation at a unique new level. Our autonomous driving Software is adapting to any environment and handles most challenges of modern traffic. By adding our Fleet Management Software and communication System, e-BiGo becomes part of a fully advanced transportation network, makes it possible to manage a whole fleet of smart busses and operate public transport from a centralized control center. e-BiGohas been designed to be the answer for challenges of public transport and introduces green autonomy for smart cities, airports or any other applications that requires to transport passengers in a more efficient, attractive, and environmentally friendly way. DGWorld BiGoautonomy conversion Kit includes: DGW Drive by Wire This System is controlling all relevant functions of the e-BiGoand makes it possible, to remotely control it as well. Additionally, it will monitor all relevant functions and parameters of the Bus. DGW Localization & Mapping Sensor System based on our3D SLAM and fused sensing Systems enabling to calculate the real position of the Bus without the need to integrate artificial markings and allows autonomous operation virtually anywhere DGW Perception & Safety System Allows real mixed traffic applications and ensures full interaction of the autonomous Busses with its environment following highest safety international standards DGWorld Autonomous Driving AI Engine (Software) Full Level 4 autonomy, ensuring to adapt the driving behavior of your e-BiGo fleet regardless their load and environmental challenges Governments & Communities 4.0 E-BiGo - Green and futuristic Transport today Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. The cutting-edge design of e-BiGO combines functionality with a futuristic appearance. e-BiGO can be utilized in any controlled environment, but even advanced traffic situation can be handled with ease. We have developed new embedded safety modules to enhance the autonomous driving and open new horizons of applications. Experience latest AI Technology during a chilled ride with your family, friends or on your daily way to work. Advanced user interaction features, like speech Processing, custom Applications and connected Services let any passenger experience autonomous Transportation at a unique new level. Our autonomous driving Software is adapting to any environment and handles most challenges of modern traffic. By adding our Fleet Management Software and communication System, e-BiGo becomes part of a fully advanced transportation network, makes it possible to manage a whole fleet of smart busses and operate public transport from a centralized control center. e-BiGohas been designed to be the answer for challenges of public transport and introduces green autonomy for smart cities, airports or any other applications that requires to transport passengers in a more efficient, attractive, and environmentally friendly way. DGWorld BiGoautonomy conversion Kit includes: This System is controlling all relevant functions of the e-BiGoand makes it possible, to remotely control it as well. Additionally, it will monitor all relevant functions and parameters of the Bus. based on our3D SLAM and fused sensing Systems enabling to calculate the real position of the Bus without the need to integrate artificial markings and allows autonomous operation virtually anywhere Allows real mixed traffic applications and ensures full interaction of the autonomous Busses with its environment following highest safety international standards Full Level 4 autonomy, ensuring to adapt the driving behavior of your e-BiGo fleet regardless their load and environmental challenges eBiGO Main Features: our integration and safety Solutions Autonomous operation in mixed traffic without infrastructural changes (SAE Level 4) Higher Safety and less accidents including passenger safety monitoring Highly efficient and adaptable driving behavior is reducing operational costs 100% electric and no carbon emissions Real time data from the vehicles (Position, Status Information and Diagnostics) will optimize your daily operations Applicable for all different types of vehicles Busses according to your demand Adjusting its speed in autonomous mode automatically for the best economic to safe resources and longest battery life (up to 8 hours) Operation at Day and Night 24/7 (indoor or outdoor) Operation by remote or fully autonomous mode Custom Interfaces like advertising and on-board entertainment by using latest AI Technology Advanced Safety features, like object detection (Cars, Pedestrians, …) and active collision avoidance Vehicle 2 Vehicle communication for quick information exchange between the autonomous Vehicles HD Mapping (to create reference Map) combined with advanced 3D Slam Algorithm Automatic update of mapping information and possibility to share these updates with other vehicles to avoid traffic and changes its routes dynamically Data collected by e-BiGo, can be used for security and surveillance Applications to enhance the safety of environments or cities and optimized crowd control Safe System architecture (PLC System, Brake System, Sensor Architecture) according to international safety standards (ISO 26262) and TÜV certified. Full Vehicle Status Monitoring allows central overview of all fleet parameters in real-time. Full operational flexibility thanks to our integration and safety Solutions: Our Remote-Control Desk (for exception Handling) will give remote operators a complete surround view of e-BiGo and ensure operations, even in critical situations. We offer fully automated recharging solutions for e-BiGo enabling hazzle free operation of your electric fleet Customized Passenger interaction allows unlimited on-board features, like entertainment, payment systems, advertising based on location and many more for a unique experience. our integration and safety Solutions Autonomous operation in mixed traffic without infrastructural changes (SAE Level 4) Higher Safety and less accidents including passenger safety monitoring Highly efficient and adaptable driving behavior is reducing operational costs 100% electric and no carbon emissions Real time data from the vehicles (Position, Status Information and Diagnostics) will optimize your daily operations Applicable for all different types of vehicles Busses according to your demand Adjusting its speed in autonomous mode automatically for the best economic to safe resources and longest battery life (up to 8 hours) Operation at Day and Night 24/7 (indoor or outdoor) Operation by remote or fully autonomous mode Custom Interfaces like advertising and on-board entertainment by using latest AI Technology Advanced Safety features, like object detection (Cars, Pedestrians, …) and active collision avoidance Vehicle 2 Vehicle communication for quick information exchange between the autonomous Vehicles HD Mapping (to create reference Map) combined with advanced 3D Slam Algorithm Automatic update of mapping information and possibility to share these updates with other vehicles to avoid traffic and changes its routes dynamically Data collected by e-BiGo, can be used for security and surveillance Applications to enhance the safety of environments or cities and optimized crowd control Safe System architecture (PLC System, Brake System, Sensor Architecture) according to international safety standards (ISO 26262) and TÜV certified. Full Vehicle Status Monitoring allows central overview of all fleet parameters in real-time. Our Remote-Control Desk (for exception Handling) will give remote operators a complete surround view of e-BiGo and ensure operations, even in critical situations. We offer fully automated recharging solutions for e-BiGo enabling hazzle free operation of your electric fleet Customized Passenger interaction allows unlimited on-board features, like entertainment, payment systems, advertising based on location and many more for a unique experience. Video Image Gallery Enquiry Sign-up for news updates and alerts",
    "New Autonomous Vehicles To Navigate Their Way Around Middle East's Largest Seaport Using Georeferencing Technology From Xsens MTi-Series GNSS/INS Motion Trackers from Xsens provide accurate 3D positioning in DG World's AI-based software solutions, integrated into a fleet of Autonomous Trucks at Jebel Ali port Enschede, The Netherlands – June 19, 2020 – A ground-breaking deployment of autonomous vehicle technology by DP World, the operator of the Jebel Ali container port in Dubai, is to demonstrate the performance and reliability of technology provided by Xsens, the manufacturer of motion-tracking sensors, supporting DGWorld, a manufacturer of artificial intelligence (AI)-based autonomous and robotic vehicle systems. Global ports operator DP World and DGWorld have announced a contractual agreement providing for the conversion of a fleet of Autonomous Internal Terminal Vehicles (AITVs) at Jebel Ali, the largest port in the Middle East, to fully autonomous operation. The AITVs will use vehicle control technology from DGWorld. The DGWorld system is utilizing a sensor fusion approach, based on LIDAR and Radar, for object detection and environment awareness, an MTi-Series (industrial Motion Tracker) sensor from Xsens to support their simultaneous localization and mapping (3D SLAM) function, and AI-based real-time decision-making software. The MTi-Series from Xsens combines a GNSS satellite receiver and an inertial navigation system (INS) in a robust, industrial-grade package. This enables DP World's AITVs to accurately track their position and navigate the AITVs, even when GNSS satellite signals cannot be received properly. This is an important capability when operating in a container port, since the AITVs will navigate through narrow corridors between tall stacks of containers which block the GNSS signals. The deployment of fully autonomous ITVs offers numerous benefits to DP World, such as: Safer operation – the autonomous ITVs' high-resolution LiDAR sensors and Radars reliably detect and avoid people and objects. Speed measurements from the MTi's GNSS receiver enable the software system to precisely control the ITV's speed and the integrated Xsens IMU optimizes continuously the vehicle driving performance. Higher efficiency – the autonomous ITVs can operate 24/7, and their routing and operation can be optimized through the application of DGWorld´s Fleet Management software. Matthias Krause, General Manager of DGWorld, said: 'The DGWorld autonomous control system is specially designed to match the driving dynamics of heavy industrial vehicles such as the container trucks to be converted for Jebel Ali port. The accuracy and output data rate of the Xsens MTi are perfect for this application. The sensor fusion capabilities of the Xsens motion tracker have also been helpful in the development of the DGWorld autonomous technology: whether performing georeferencing via satellite positioning or via INS, the MTi maintains a stable, consistent and high-frequency output.' \"Xsens is honoured to be selected by DGWorld to support this autonomous vehicle project and take it from concept to reality. This shows the advantages of using the Xsens MTi-series GNSS/INS, with reliable sensor fusion algorithms developed in 20 years of Xsens existence, for real-time operation of industrial AGVs/UGVs in difficult circumstances\", Meindert Zeeuw, Xsens Sales Director ISM EMEA, added. Source: www.xsens.com/press-releases/new-autonomous-vehicles-to-navigate-their-way-around-middle-easts-largest-seaport-using-georeferencing-technology-from-xsens New Autonomous Vehicles To Navigate Their Way Around Middle East's Largest Seaport Using Georeferencing Technology From Xsens MTi-Series GNSS/INS Motion Trackers from Xsens provide accurate 3D positioning in DG World's AI-based software solutions, integrated into a fleet of Autonomous Trucks at Jebel Ali port Enschede, The Netherlands – June 19, 2020 – A ground-breaking deployment of autonomous vehicle technology by DP World, the operator of the Jebel Ali container port in Dubai, is to demonstrate the performance and reliability of technology provided by Xsens, the manufacturer of motion-tracking sensors, supporting DGWorld, a manufacturer of artificial intelligence (AI)-based autonomous and robotic vehicle systems. Global ports operator DP World and DGWorld have announced a contractual agreement providing for the conversion of a fleet of Autonomous Internal Terminal Vehicles (AITVs) at Jebel Ali, the largest port in the Middle East, to fully autonomous operation. The AITVs will use vehicle control technology from DGWorld. The DGWorld system is utilizing a sensor fusion approach, based on LIDAR and Radar, for object detection and environment awareness, an MTi-Series (industrial Motion Tracker) sensor from Xsens to support their simultaneous localization and mapping (3D SLAM) function, and AI-based real-time decision-making software. The MTi-Series from Xsens combines a GNSS satellite receiver and an inertial navigation system (INS) in a robust, industrial-grade package. This enables DP World's AITVs to accurately track their position and navigate the AITVs, even when GNSS satellite signals cannot be received properly. This is an important capability when operating in a container port, since the AITVs will navigate through narrow corridors between tall stacks of containers which block the GNSS signals. The deployment of fully autonomous ITVs offers numerous benefits to DP World, such as: Safer operation – the autonomous ITVs' high-resolution LiDAR sensors and Radars reliably detect and avoid people and objects. Speed measurements from the MTi's GNSS receiver enable the software system to precisely control the ITV's speed and the integrated Xsens IMU optimizes continuously the vehicle driving performance. Higher efficiency – the autonomous ITVs can operate 24/7, and their routing and operation can be optimized through the application of DGWorld´s Fleet Management software. Matthias Krause, General Manager of DGWorld, said: 'The DGWorld autonomous control system is specially designed to match the driving dynamics of heavy industrial vehicles such as the container trucks to be converted for Jebel Ali port. The accuracy and output data rate of the Xsens MTi are perfect for this application. The sensor fusion capabilities of the Xsens motion tracker have also been helpful in the development of the DGWorld autonomous technology: whether performing georeferencing via satellite positioning or via INS, the MTi maintains a stable, consistent and high-frequency output.' \"Xsens is honoured to be selected by DGWorld to support this autonomous vehicle project and take it from concept to reality. This shows the advantages of using the Xsens MTi-series GNSS/INS, with reliable sensor fusion algorithms developed in 20 years of Xsens existence, for real-time operation of industrial AGVs/UGVs in difficult circumstances\", Meindert Zeeuw, Xsens Sales Director ISM EMEA, added. Sign-up for news updates and alerts",
    "BiGO Let us help you move Autonomous Intelligent Bus BiGo is our answer to the challenges of public Transportation! Read more DeliveryBOT Autonomous Delivery Vehicle DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Read more DeliveyBOT B Read more eBiGO Open the door for a new direction Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. Read more eTiGO Make the right move. TiGOand e-TiGois our autonomous car conversion kit that enables autonomous transport of up to 9 passengers. Read more eTruGO Autonomous Intelligent Truck Our TruGo and e-TruGo autonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Read more FireBOT Go smoothly with safety An innovative autonomous firefighting solution that offers higher performance, faster response time and reduces risks and hazards to human health, environment and loss of property. Read more ForkBOT Further. Faster. Safer ForkBOTis our autonomous solution to be seamless integrated in your fleet of existing Forklifts to enable intelligent driverless operation for your current warehouse and logistic applications to offer you highest efficiency and full process automation without infrastructural changes. Read more FuelBOT Fueling your operations FuelBOTis an automated system that refuels gas in cars, trucks, motorbikes, ships, and airplanes. Read more GrassBOT Better solution. Better possibilities. Anautonomous grass cutting robot that is eco-friendly, and has an intelligent memory system and navigation system. Read more SecurityBOT Autonomous Security Vehicle SecurityBOT is a mobilesecurity platform, tailored to keep streets, communities and industrial areas safe. Read more SecurityBOT B Read more SimBOT Let us put you in the place you want SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. Read more SweeBOT Autonomous Floor Sweeper SweeBOT is our solution for autonomous indoor or outdoor floor cleaning. It is designed to sweep, collect the dust and mop the floor, making all decisionsitself. Read more TiGO Autonomous Intelligent Car SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. Read more TrashBOT Making tasks easier. An autonomous trash and garbage collecting robot that is designed to navigate through urban areas avoiding static and dynamic obstacles. Read more TruGO Autonomous Intelligent Truck Our TruGo and e-TruGoautonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Read more WISO Going further than following simple orders Application scenarios: guard, nurse, PA, hostess, cashier Read more AmbuBOT DGWorld's Electrical AmbuBOT is a Green Energy Ambulance. Taking care of the Environment by reducing harmful fumes. The Ambulance can carry 1 person and is particularly used in Factories, Companies premises, Sports Events, Special Events, Communities... Read more Let us help you move Autonomous Intelligent Bus BiGo is our answer to the challenges of public Transportation! Autonomous Delivery Vehicle DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Read more DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Open the door for a new direction Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. Make the right move. TiGOand e-TiGois our autonomous car conversion kit that enables autonomous transport of up to 9 passengers. Our TruGo and e-TruGo autonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Go smoothly with safety An innovative autonomous firefighting solution that offers higher performance, faster response time and reduces risks and hazards to human health, environment and loss of property. ForkBOTis our autonomous solution to be seamless integrated in your fleet of existing Forklifts to enable intelligent driverless operation for your current warehouse and logistic applications to offer you highest efficiency and full process automation without infrastructural changes. FuelBOTis an automated system that refuels gas in cars, trucks, motorbikes, ships, and airplanes. Better solution. Better possibilities. Anautonomous grass cutting robot that is eco-friendly, and has an intelligent memory system and navigation system. SecurityBOT is a mobilesecurity platform, tailored to keep streets, communities and industrial areas safe. Let us put you in the place you want SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. SweeBOT is our solution for autonomous indoor or outdoor floor cleaning. It is designed to sweep, collect the dust and mop the floor, making all decisionsitself. SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. An autonomous trash and garbage collecting robot that is designed to navigate through urban areas avoiding static and dynamic obstacles. Our TruGo and e-TruGoautonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Going further than following simple orders Application scenarios: guard, nurse, PA, hostess, cashier DGWorld's Electrical AmbuBOT is a Green Energy Ambulance. Taking care of the Environment by reducing harmful fumes. The Ambulance can carry 1 person and is particularly used in Factories, Companies premises, Sports Events, Special Events, Communities... BiGO Let us help you move Autonomous Intelligent Bus BiGo is our answer to the challenges of public Transportation! Read more DeliveryBOT Autonomous Delivery Vehicle DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Read more DeliveyBOT B Read more eBiGO Open the door for a new direction Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. Read more eTiGO Make the right move. TiGOand e-TiGois our autonomous car conversion kit that enables autonomous transport of up to 9 passengers. Read more eTruGO Autonomous Intelligent Truck Our TruGo and e-TruGo autonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Read more FireBOT Go smoothly with safety An innovative autonomous firefighting solution that offers higher performance, faster response time and reduces risks and hazards to human health, environment and loss of property. Read more ForkBOT Further. Faster. Safer ForkBOTis our autonomous solution to be seamless integrated in your fleet of existing Forklifts to enable intelligent driverless operation for your current warehouse and logistic applications to offer you highest efficiency and full process automation without infrastructural changes. Read more FuelBOT Fueling your operations FuelBOTis an automated system that refuels gas in cars, trucks, motorbikes, ships, and airplanes. Read more GrassBOT Better solution. Better possibilities. Anautonomous grass cutting robot that is eco-friendly, and has an intelligent memory system and navigation system. Read more SecurityBOT Autonomous Security Vehicle SecurityBOT is a mobilesecurity platform, tailored to keep streets, communities and industrial areas safe. Read more SecurityBOT B Read more SimBOT Let us put you in the place you want SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. Read more SweeBOT Autonomous Floor Sweeper SweeBOT is our solution for autonomous indoor or outdoor floor cleaning. It is designed to sweep, collect the dust and mop the floor, making all decisionsitself. Read more TiGO Autonomous Intelligent Car SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. Read more TrashBOT Making tasks easier. An autonomous trash and garbage collecting robot that is designed to navigate through urban areas avoiding static and dynamic obstacles. Read more TruGO Autonomous Intelligent Truck Our TruGo and e-TruGoautonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Read more WISO Going further than following simple orders Application scenarios: guard, nurse, PA, hostess, cashier Read more AmbuBOT DGWorld's Electrical AmbuBOT is a Green Energy Ambulance. Taking care of the Environment by reducing harmful fumes. The Ambulance can carry 1 person and is particularly used in Factories, Companies premises, Sports Events, Special Events, Communities... Read more Let us help you move Autonomous Intelligent Bus BiGo is our answer to the challenges of public Transportation! Autonomous Delivery Vehicle DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Read more DeliveryBOTis our answer to the rising demand of intelligent and fast delivery of goods and food. Open the door for a new direction Carrying up to 10 passengers, furnished with a very luxurious interior and enabled by our field proven autonomous driving System, e-BiGO is designed to provide a unique experience of transportation, fully electric. Make the right move. TiGOand e-TiGois our autonomous car conversion kit that enables autonomous transport of up to 9 passengers. Our TruGo and e-TruGo autonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Go smoothly with safety An innovative autonomous firefighting solution that offers higher performance, faster response time and reduces risks and hazards to human health, environment and loss of property. ForkBOTis our autonomous solution to be seamless integrated in your fleet of existing Forklifts to enable intelligent driverless operation for your current warehouse and logistic applications to offer you highest efficiency and full process automation without infrastructural changes. FuelBOTis an automated system that refuels gas in cars, trucks, motorbikes, ships, and airplanes. Better solution. Better possibilities. Anautonomous grass cutting robot that is eco-friendly, and has an intelligent memory system and navigation system. SecurityBOT is a mobilesecurity platform, tailored to keep streets, communities and industrial areas safe. Let us put you in the place you want SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. SweeBOT is our solution for autonomous indoor or outdoor floor cleaning. It is designed to sweep, collect the dust and mop the floor, making all decisionsitself. SimBOT is an interactive motion simulator for flights, sailing or driving used for training programs. An autonomous trash and garbage collecting robot that is designed to navigate through urban areas avoiding static and dynamic obstacles. Our TruGo and e-TruGoautonomy Conversion Kit is designed, to fit your existing Trucks enabling 100% autonomy and offers the most flexible integrationavailable in the market. Going further than following simple orders Application scenarios: guard, nurse, PA, hostess, cashier DGWorld's Electrical AmbuBOT is a Green Energy Ambulance. Taking care of the Environment by reducing harmful fumes. The Ambulance can carry 1 person and is particularly used in Factories, Companies premises, Sports Events, Special Events, Communities... Sign-up for news updates and alerts"
  ]
}