{
  "company": "www.x-infotech.com",
  "dominant_topics": [
    1,
    0,
    -1
  ],
  "topic_counts": {
    "1": 16,
    "0": 7,
    "-1": 4
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.2481203007518796,
    "framing_surveillance": 0.3458646616541353,
    "framing_market": 0.4060150375939849,
    "num_docs": 27
  },
  "topic_timeline": {
    "20": {
      "-1": 4,
      "0": 7,
      "1": 16
    }
  },
  "sample_docs": [
    "Based on our expertise and valuable partners X InfoTech Ltd. provides solutions in following areas: Security is a process, not an event. It is critical part of how you do business. Data security and information privacy challenges confront all enterprises. Organizations of all types must balance regulatory requirements with the challenge to integrate data security into systems, procedures and cultures. Security is a process, not an event. It is critical part of how you do business. Data security and information privacy challenges confront all enterprises. Organizations of all types must balance regulatory requirements with the challenge to integrate data security into systems, procedures and cultures.",
    "Based on our expertise and valuable partners X InfoTech Ltd. provides solutions in following areas: With our partner support we provide: innovative solutions for the access to buildings, rooms and premises - from the basic access control supported by staff supervision to single-file access to high security areas. World-wide equipment is successfully in operation in government buildings, airports, banks, power plants, stadiums and many other companies. innovative solutions for the access to buildings, premises - from the basic access control supported by staff supervision to single-file access to high security areas.",
    "Markets We Work for Electronic Identity Biometric verification eDriver's Licences (eDL) Financial Services Social Services Border Control Digital tachograph Our Markets Government Solutions Citizen Identity Enrolment Identity Management AFIS/ABIS Biometric Verification Document Personalization ICAO Data Preparation Key Management System Chip Encoding Secure PIN Manager Production Management Stock Management Instant Issuing Process Management Case Management Document Lifecycle Management Quality Assurance eDocument Verification Document Issuance PKI (Public Key Infrastructure) Country Signing Certification Authority (CSCA) Document Signer (DS) Country Verifying Certification Authority (CVCA) Document Verifier (DV) Terminal Control Centre (TCC) Single Point of Contact (SPOC) National Public Key Directory (nPKD) All Government Solutions Banking Solutions Customer Identity Enrolment Identity Management AFIS/ABIS Biometric Verification Card Personalization EMV Data Preparation Key Management System Chip Encoding Secure PIN Manager EMV Certificate Authority Production Management Instant Issuing Stock Management Process Management Integration Services Document Lifecycle Management Mobile Solutions Payment Gateway Mobile Gateway SMS Centre All Banking Solutions X Infotech X Infotech is a global provider of software solutions for issuance and verification of electronic identity documents and payment cards. X Infotech is a part of Silverlake Axis Ltd Group of companies. Silverlake Axis With over 25 years of experience and a breadth of expertise across industries, Silverlake Axis creates technologies to empower businesses in the Digital Economy, transforming industries like banking, insurance, retail and healthcare. Discover our capabilities Explore our solutions Case Studies PKI Solution for Electronic Passport for Peru View Case Show All Case Studies Kenya's Huduma Card is powered by X Infotech software solutions View Case Show All Case Studies X Infotech succeeds in deployment of the Passport Card solution in Ireland View Case Show All Case Studies X Infotech deployed a secure and versatile personalization solution for European Union laissez-passer travel documents. View Case Show All Case Studies Upgrade to SAC standards for Liechtenstein's passport View Case Show All 7 June Secure Identification 2019: Summary and Highlights 27 March \"Digital Rise 2019†conference in Kenya brought together leaders of East African FinTech market 29 January Silverlake Axis Completes Acquisition of SIA X Infotech Group 14 December We are looking forward to seeing you at Secure Identification 2019 All News Markets We Work for Citizen Identity Enrolment Identity Management AFIS/ABIS Biometric Verification Document Personalization ICAO Data Preparation Key Management System Chip Encoding Secure PIN Manager Production Management Stock Management Instant Issuing Process Management Case Management Document Lifecycle Management Quality Assurance eDocument Verification Document Issuance PKI (Public Key Infrastructure) Country Signing Certification Authority (CSCA) Document Signer (DS) Country Verifying Certification Authority (CVCA) Document Verifier (DV) Terminal Control Centre (TCC) Single Point of Contact (SPOC) National Public Key Directory (nPKD) Country Signing Certification Authority (CSCA) Country Verifying Certification Authority (CVCA) Terminal Control Centre (TCC) Single Point of Contact (SPOC) National Public Key Directory (nPKD) Customer Identity Enrolment Identity Management AFIS/ABIS Biometric Verification Card Personalization EMV Data Preparation Key Management System Chip Encoding Secure PIN Manager EMV Certificate Authority Production Management Instant Issuing Stock Management Process Management Integration Services Document Lifecycle Management Mobile Solutions Payment Gateway Mobile Gateway SMS Centre X Infotech is a global provider of software solutions for issuance and verification of electronic identity documents and payment cards. X Infotech is a part of Silverlake Axis Ltd Group of companies. With over 25 years of experience and a breadth of expertise across industries, Silverlake Axis creates technologies to empower businesses in the Digital Economy, transforming industries like banking, insurance, retail and healthcare. Case Studies PKI Solution for Electronic Passport for Peru View Case Show All Case Studies Kenya's Huduma Card is powered by X Infotech software solutions View Case Show All Case Studies X Infotech succeeds in deployment of the Passport Card solution in Ireland View Case Show All Case Studies X Infotech deployed a secure and versatile personalization solution for European Union laissez-passer travel documents. View Case Show All Case Studies Upgrade to SAC standards for Liechtenstein's passport View Case Show All Case Studies PKI Solution for Electronic Passport for Peru View Case Show All Case Studies Kenya's Huduma Card is powered by X Infotech software solutions View Case Show All Case Studies X Infotech succeeds in deployment of the Passport Card solution in Ireland View Case Show All Case Studies X Infotech deployed a secure and versatile personalization solution for European Union laissez-passer travel documents. View Case Show All Case Studies Upgrade to SAC standards for Liechtenstein's passport View Case Show All 7 June Secure Identification 2019: Summary and Highlights 27 March \"Digital Rise 2019†conference in Kenya brought together leaders of East African FinTech market 29 January Silverlake Axis Completes Acquisition of SIA X Infotech Group 14 December We are looking forward to seeing you at Secure Identification 2019 All News 27 March \"Digital Rise 2019†conference in Kenya brought together leaders of East African FinTech market 29 January Silverlake Axis Completes Acquisition of SIA X Infotech Group 14 December We are looking forward to seeing you at Secure Identification 2019",
    "X Infotech is proud to announce that a project for Estonian Ministry of Interior IT and Development Centre is successfully completed. The project involved development of a mobile application which is an integral part of a wider Entry Exit System implementation in Estonia. Delivered mobile solution enables real-time image validation, supports face enrolment with quality conformant to Entry-Exit System quality requirements and real-time quality assessment. The application allows to capture images compliant with ICAO guidelines for travel document photographs. With its secure data exchange and server-side configuration management, this application is a convenient tool for law enforcement officers in the field. \"We are proud of being trusted to participate in border control process modernization in Estonia,†said Einars Leps, X Infotech Regional Sales Executive. \"Our mobile application provides a seamless solution for capturing face images and ensuring their quality and compliance with ICAO standards.†X Infotech is committed to delivering innovative IT solutions that meet the needs of its customers and contribute to the overall improvement of systems and processes they serve. The mobile application for border crossing and migration control institutions is a testimony to this commitment, and X Infotech looks forward to continue supporting Estonian Ministry of Interior IT and Development Centre in its efforts to modernize and improve border control. EU-wide Entry-Exit System implementation is an important step in strengthening and protecting external Schengen area borders and increasing the security of its citizens. By modernizing and improving border control quality and efficiency, the Entry-Exit System will provide significant benefits for both law enforcement officers and Schengen area citizens. February 14, 2023 X Infotech is proud to announce that a project for Estonian Ministry of Interior IT and Development Centre is successfully completed. The project involved development of a mobile application which is an integral part of a wider Entry Exit System implementation in Estonia. Delivered mobile solution enables real-time image validation, supports face enrolment with quality conformant to Entry-Exit System quality requirements and real-time quality assessment. The application allows to capture images compliant with ICAO guidelines for travel document photographs. With its secure data exchange and server-side configuration management, this application is a convenient tool for law enforcement officers in the field. \"We are proud of being trusted to participate in border control process modernization in Estonia,†said Einars Leps, X Infotech Regional Sales Executive. \"Our mobile application provides a seamless solution for capturing face images and ensuring their quality and compliance with ICAO standards.†X Infotech is committed to delivering innovative IT solutions that meet the needs of its customers and contribute to the overall improvement of systems and processes they serve. The mobile application for border crossing and migration control institutions is a testimony to this commitment, and X Infotech looks forward to continue supporting Estonian Ministry of Interior IT and Development Centre in its efforts to modernize and improve border control. EU-wide Entry-Exit System implementation is an important step in strengthening and protecting external Schengen area borders and increasing the security of its citizens. By modernizing and improving border control quality and efficiency, the Entry-Exit System will provide significant benefits for both law enforcement officers and Schengen area citizens. February 14, 2023 X Infotech is proud to announce that a project for Estonian Ministry of Interior IT and Development Centre is successfully completed. The project involved development of a mobile application which is an integral part of a wider Entry Exit System implementation in Estonia. Delivered mobile solution enables real-time image validation, supports face enrolment with quality conformant to Entry-Exit System quality requirements and real-time quality assessment. The application allows to capture images compliant with ICAO guidelines for travel document photographs. With its secure data exchange and server-side configuration management, this application is a convenient tool for law enforcement officers in the field. \"We are proud of being trusted to participate in border control process modernization in Estonia,†said Einars Leps, X Infotech Regional Sales Executive. \"Our mobile application provides a seamless solution for capturing face images and ensuring their quality and compliance with ICAO standards.†X Infotech is committed to delivering innovative IT solutions that meet the needs of its customers and contribute to the overall improvement of systems and processes they serve. The mobile application for border crossing and migration control institutions is a testimony to this commitment, and X Infotech looks forward to continue supporting Estonian Ministry of Interior IT and Development Centre in its efforts to modernize and improve border control. EU-wide Entry-Exit System implementation is an important step in strengthening and protecting external Schengen area borders and increasing the security of its citizens. By modernizing and improving border control quality and efficiency, the Entry-Exit System will provide significant benefits for both law enforcement officers and Schengen area citizens.",
    "X Infotech delivers a turnkey solution for eID and Ecowas cards in Sierra Leone in collaboration with CONSTRAT SYSTEMS LTD and NCRA. X Infotech has successfully implemented a turnkey solution for national and non-national eID and Ecowas card issuance in Sierra Leone. The project was implemented, meeting the latest security requirements and industry standards. The delivered solution consists of a range of modules and components, including X Infotech personalization system, document registry, a complete Public Key Infrastructure solutions suite, various supporting systems, and hardware. All the parts of the system have been fully integrated to ensure seamless and efficient operation. Within this project, several important objectives have been achieved which will significantly improve the process efficiency of Sierra Leone document issuance. Moreover, the delivered solution lays a solid foundation for the future development of the whole country. Implementation of this solution demonstrates X Infotech's commitment to delivering high-quality and innovative digital solutions to the people of Sierra Leone. It will help to streamline government processes, improve citizens' personal data accuracy and security, providing the population with a more efficient and secure way of accessing services. \"We are proud to be part of this project and work with professional partners such as CONSTRAT SYSTEMS LTD in delivering the national and non-national eID and Ecowas cards in Sierra Leone,\" said Sergey Yeliseyev, Business Development Director for Government eID of X Infotech. \"We look forward to continue our work in Sierra Leone with CONSTRAT SYSTEMS LTD and NCRA and will fully support the digitalization efforts of the government.\" July 27, 2023 X Infotech delivers a turnkey solution for eID and Ecowas cards in Sierra Leone in collaboration with CONSTRAT SYSTEMS LTD and NCRA. X Infotech has successfully implemented a turnkey solution for national and non-national eID and Ecowas card issuance in Sierra Leone. The project was implemented, meeting the latest security requirements and industry standards. The delivered solution consists of a range of modules and components, including X Infotech personalization system, document registry, a complete Public Key Infrastructure solutions suite, various supporting systems, and hardware. All the parts of the system have been fully integrated to ensure seamless and efficient operation. Within this project, several important objectives have been achieved which will significantly improve the process efficiency of Sierra Leone document issuance. Moreover, the delivered solution lays a solid foundation for the future development of the whole country. Implementation of this solution demonstrates X Infotech's commitment to delivering high-quality and innovative digital solutions to the people of Sierra Leone. It will help to streamline government processes, improve citizens' personal data accuracy and security, providing the population with a more efficient and secure way of accessing services. \"We are proud to be part of this project and work with professional partners such as CONSTRAT SYSTEMS LTD in delivering the national and non-national eID and Ecowas cards in Sierra Leone,\" said Sergey Yeliseyev, Business Development Director for Government eID of X Infotech. \"We look forward to continue our work in Sierra Leone with CONSTRAT SYSTEMS LTD and NCRA and will fully support the digitalization efforts of the government.\" July 27, 2023 X Infotech delivers a turnkey solution for eID and Ecowas cards in Sierra Leone in collaboration with CONSTRAT SYSTEMS LTD and NCRA. X Infotech has successfully implemented a turnkey solution for national and non-national eID and Ecowas card issuance in Sierra Leone. The project was implemented, meeting the latest security requirements and industry standards. The delivered solution consists of a range of modules and components, including X Infotech personalization system, document registry, a complete Public Key Infrastructure solutions suite, various supporting systems, and hardware. All the parts of the system have been fully integrated to ensure seamless and efficient operation. Within this project, several important objectives have been achieved which will significantly improve the process efficiency of Sierra Leone document issuance. Moreover, the delivered solution lays a solid foundation for the future development of the whole country. Implementation of this solution demonstrates X Infotech's commitment to delivering high-quality and innovative digital solutions to the people of Sierra Leone. It will help to streamline government processes, improve citizens' personal data accuracy and security, providing the population with a more efficient and secure way of accessing services. \"We are proud to be part of this project and work with professional partners such as CONSTRAT SYSTEMS LTD in delivering the national and non-national eID and Ecowas cards in Sierra Leone,\" said Sergey Yeliseyev, Business Development Director for Government eID of X Infotech. \"We look forward to continue our work in Sierra Leone with CONSTRAT SYSTEMS LTD and NCRA and will fully support the digitalization efforts of the government.\""
  ]
}