{
  "company": "www.facehawk.co.uk",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.7272727272727273,
    "framing_market": 0.2727272727272727,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "COMPANY OVERVIEW FACEHAWK LIMITED (FACEHAWK) is an Artificial Intelligence (AI) start-up company registered in England and Wales under the Companies Act 2006. It offers an Artificial Intelligence (AI) based Facial Recognition System (FRS) software primarily developed for the public safety. FACEHAWK LIMITED (FACEHAWK) is an Artificial Intelligence (AI) start-up company registered in England and Wales under the Companies Act 2006. It offers an Artificial Intelligence (AI) based Facial Recognition System (FRS) software primarily developed for the public safety. \"To become a leader in the field of artificial intelligence and big data analytics. To become an equal, diversified and inclusive (EDI) organization in our innovation area, we shall practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We shall also encourage employee feedback and believe in continuous development by assessing our corporate policies\". THE FOUNDERS Muhammad Sajjad Haider (Chairman & Founder) Rabia Usman (CEO & Founder) MESSAGE FROM CEO \"As you are going through our website, I hope that you about our pathway, which leads to our company's success in the field of artificial intelligence-based face recognition system, its related software technology services and a wonderful place to start & build your career. Our team comprises of subject matter experts (SMEs) who possesses extensive experience in the public safety & security, were remained part of the public safety policy making working groups. Innovation and technology seldom benefit women and men equally. This gender gap limits efforts to achieve gender equality, women's empowerment, and prevents women from becoming developers of technology. For this very reason, women have 50% representation in FACEHAWK and my long-term plan is to make it an equal, diversified, and inclusive organization. Since I always have a great interest in IT advancement as such, I always look forward to getting familiar with the latest technological innovations. To ensure equality, diversity and inclusion (EDI) in our innovation area, we practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We also encourage employee feedback and believe in continuous development by assessing our policies\". \"To become a leader in the field of artificial intelligence and big data analytics. To become an equal, diversified and inclusive (EDI) organization in our innovation area, we shall practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We shall also encourage employee feedback and believe in continuous development by assessing our corporate policies\". THE FOUNDERS \"To become a leader in the field of artificial intelligence and big data analytics. To become an equal, diversified and inclusive (EDI) organization in our innovation area, we shall practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We shall also encourage employee feedback and believe in continuous development by assessing our corporate policies\". Muhammad Sajjad Haider (Chairman & Founder) Rabia Usman (CEO & Founder) Muhammad Sajjad Haider (Chairman & Founder) Rabia Usman (CEO & Founder) MESSAGE FROM CEO \"As you are going through our website, I hope that you about our pathway, which leads to our company's success in the field of artificial intelligence-based face recognition system, its related software technology services and a wonderful place to start & build your career. Our team comprises of subject matter experts (SMEs) who possesses extensive experience in the public safety & security, were remained part of the public safety policy making working groups. Innovation and technology seldom benefit women and men equally. This gender gap limits efforts to achieve gender equality, women's empowerment, and prevents women from becoming developers of technology. For this very reason, women have 50% representation in FACEHAWK and my long-term plan is to make it an equal, diversified, and inclusive organization. Since I always have a great interest in IT advancement as such, I always look forward to getting familiar with the latest technological innovations. To ensure equality, diversity and inclusion (EDI) in our innovation area, we practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We also encourage employee feedback and believe in continuous development by assessing our policies\". \"As you are going through our website, I hope that you about our pathway, which leads to our company's success in the field of artificial intelligence-based face recognition system, its related software technology services and a wonderful place to start & build your career. Our team comprises of subject matter experts (SMEs) who possesses extensive experience in the public safety & security, were remained part of the public safety policy making working groups. Innovation and technology seldom benefit women and men equally. This gender gap limits efforts to achieve gender equality, women's empowerment, and prevents women from becoming developers of technology. For this very reason, women have 50% representation in FACEHAWK and my long-term plan is to make it an equal, diversified, and inclusive organization. Since I always have a great interest in IT advancement as such, I always look forward to getting familiar with the latest technological innovations. To ensure equality, diversity and inclusion (EDI) in our innovation area, we practice paying equality, on-the-job employee training, diversity and inclusiveness at the workplace. We also encourage employee feedback and believe in continuous development by assessing our policies\".",
    "TECHNOLOGY FACEHAWK processing engine is deep/ machine learning (DL/ ML) based, which does face finding (capture faces), face assessment (assess the quality of an image) and face encoding & matching through the neural network. The FACEHAWK is designed in a way, which is compatible with both centralized and distributed deployment environment. By ensuring information security aspect, FACEHAWK has a CIA Triad layer (Confidentiality, Integrity and Availability). It is well equipped with internal features to kill malicious thread and generate timely alerts. A cybersecurity layer can scan all traffic packet by packet and scrutinize any ill will of the sender and receiver. The design architecture of FACEHAWK based on micro-service architecture (MSA), which is state-of-the-art, offers a variety of features. It guesses moods and gestures along with the trend, which will help the end-user to know the gesture estimates to develop preventive actions. Trends will make end-user capable of decision making. A live monitoring and alert system will support the end-user to handle any immediate incidental situation. Distinguishing the effectiveness of FACEHAWK, it is imperative to state that it is a highly scalable application to convert its dimension according to business strategic need. It offers a highly economical deployment solution to support customer economics. MAIN FUNCTIONS AND FEATURES How does it work? CAPTURE Obtains fascial images from video streams [CCTV surveillance cameras, mobile video cameras or archived video footage), still images storage (mobile cameras,smart devices and digital databases) and third party integrated system ASSESS Assess individual frames of video and still images, detects faces and analyzes each face to determine its unique facial signature to create a small template for each unique face MONITOR Compares each template image against an enrolled image database until a match is found while maintaining a history of matches REACT Allows configuration of real-time alerts or messages to be sent to users or external integrated systems if there is a positive match against a database image along with offering a suite of post-event image comparison tools Once the camera detects/ capture a face, a face recognition system determines the head's position, size, pose, and unique characteristics. Every face has numerous, distinguishable landmarks — the different peaks and valleys that make up facial features. These landmarks are called nodal points. Each human face has approximately 80 nodal points. Some of the nodal points measured by the nodal points. Some of the nodal points measured by the o Distance between the eyes; o Width of the nose; o Depth of the eye sockets; o The shape of the cheekbones; o The length of the jaw lines. The system translates nodal-point measurements into a numerical code or set of numbers, called a faceprint, representing the features on a subject's face that can be compared to faces in the database. A match is then verified from the faceprint. FEATURES USER MANAGEMENT DETECTION DECISION SUPPORT ANALYTICS NOTIFICATIONS REPORTING PERFORMANCE INDICATORS The matching speed of FACEHAWK is 150 milliseconds with a 98% recognition rate. It constantly performs its function on 25fps with an error rate of 0.2%. It has a user-friendly Graphic User Interface (GUI), which empowers its user to use the software efficiently. It also empowers its users in decision making and to take preventive actions based on the in-built business intelligence reports generated through live events. It is highly secure as well as cost-effective. PARTNER STRATEGY AND DELIVERY MODEL DELIVERY MODEL Manufacturer FACEHAWK act as a manufacturer of the software with all the intellectual property rights of FACEHAWK. Enabling Partners/ Distributors Platinum Partners - Complimentary capability, Scale for operational size or geographical coverage and vertical integration along the industry value chain. Moreover, we call them distributor reseller and system integration. Delivery Partners/ Implementation Partners It comprises of two types of partners i.e., GOLD and Silver. They are responsible for the awareness and credibility building, prospective/ lead generation, Sales, and Delivery/ Implementation. THE INTEGRATORS Cameras Computer Switching Storage TECHNOLOGY FACEHAWK processing engine is deep/ machine learning (DL/ ML) based, which does face finding (capture faces), face assessment (assess the quality of an image) and face encoding & matching through the neural network. The FACEHAWK is designed in a way, which is compatible with both centralized and distributed deployment environment. By ensuring information security aspect, FACEHAWK has a CIA Triad layer (Confidentiality, Integrity and Availability). It is well equipped with internal features to kill malicious thread and generate timely alerts. A cybersecurity layer can scan all traffic packet by packet and scrutinize any ill will of the sender and receiver. The design architecture of FACEHAWK based on micro-service architecture (MSA), which is state-of-the-art, offers a variety of features. It guesses moods and gestures along with the trend, which will help the end-user to know the gesture estimates to develop preventive actions. Trends will make end-user capable of decision making. A live monitoring and alert system will support the end-user to handle any immediate incidental situation. Distinguishing the effectiveness of FACEHAWK, it is imperative to state that it is a highly scalable application to convert its dimension according to business strategic need. It offers a highly economical deployment solution to support customer economics. FACEHAWK processing engine is deep/ machine learning (DL/ ML) based, which does face finding (capture faces), face assessment (assess the quality of an image) and face encoding & matching through the neural network. The FACEHAWK is designed in a way, which is compatible with both centralized and distributed deployment environment. By ensuring information security aspect, FACEHAWK has a CIA Triad layer (Confidentiality, Integrity and Availability). It is well equipped with internal features to kill malicious thread and generate timely alerts. A cybersecurity layer can scan all traffic packet by packet and scrutinize any ill will of the sender and receiver. The design architecture of FACEHAWK based on micro-service architecture (MSA), which is state-of-the-art, offers a variety of features. It guesses moods and gestures along with the trend, which will help the end-user to know the gesture estimates to develop preventive actions. Trends will make end-user capable of decision making. A live monitoring and alert system will support the end-user to handle any immediate incidental situation. Distinguishing the effectiveness of FACEHAWK, it is imperative to state that it is a highly scalable application to convert its dimension according to business strategic need. It offers a highly economical deployment solution to support customer economics. MAIN FUNCTIONS AND FEATURES How does it work? CAPTURE Obtains fascial images from video streams [CCTV surveillance cameras, mobile video cameras or archived video footage), still images storage (mobile cameras,smart devices and digital databases) and third party integrated system ASSESS Assess individual frames of video and still images, detects faces and analyzes each face to determine its unique facial signature to create a small template for each unique face MONITOR Compares each template image against an enrolled image database until a match is found while maintaining a history of matches REACT Allows configuration of real-time alerts or messages to be sent to users or external integrated systems if there is a positive match against a database image along with offering a suite of post-event image comparison tools Obtains fascial images from video streams [CCTV surveillance cameras, mobile video cameras or archived video footage), still images storage (mobile cameras,smart devices and digital databases) and third party integrated system Assess individual frames of video and still images, detects faces and analyzes each face to determine its unique facial signature to create a small template for each unique face Compares each template image against an enrolled image database until a match is found while maintaining a history of matches Allows configuration of real-time alerts or messages to be sent to users or external integrated systems if there is a positive match against a database image along with offering a suite of post-event image comparison tools Once the camera detects/ capture a face, a face recognition system determines the head's position, size, pose, and unique characteristics. Every face has numerous, distinguishable landmarks — the different peaks and valleys that make up facial features. These landmarks are called nodal points. Each human face has approximately 80 nodal points. Some of the nodal points measured by the nodal points. Some of the nodal points measured by the o Distance between the eyes; o Width of the nose; o Depth of the eye sockets; o The shape of the cheekbones; o The length of the jaw lines. The system translates nodal-point measurements into a numerical code or set of numbers, called a faceprint, representing the features on a subject's face that can be compared to faces in the database. A match is then verified from the faceprint. Once the camera detects/ capture a face, a face recognition system determines the head's position, size, pose, and unique characteristics. Every face has numerous, distinguishable landmarks — the different peaks and valleys that make up facial features. These landmarks are called nodal points. Each human face has approximately 80 nodal points. Some of the nodal points measured by the nodal points. Some of the nodal points measured by the The system translates nodal-point measurements into a numerical code or set of numbers, called a faceprint, representing the features on a subject's face that can be compared to faces in the database. A match is then verified from the faceprint. FEATURES USER MANAGEMENT DETECTION DECISION SUPPORT ANALYTICS NOTIFICATIONS REPORTING PERFORMANCE INDICATORS The matching speed of FACEHAWK is 150 milliseconds with a 98% recognition rate. It constantly performs its function on 25fps with an error rate of 0.2%. It has a user-friendly Graphic User Interface (GUI), which empowers its user to use the software efficiently. It also empowers its users in decision making and to take preventive actions based on the in-built business intelligence reports generated through live events. It is highly secure as well as cost-effective. The matching speed of FACEHAWK is 150 milliseconds with a 98% recognition rate. It constantly performs its function on 25fps with an error rate of 0.2%. It has a user-friendly Graphic User Interface (GUI), which empowers its user to use the software efficiently. It also empowers its users in decision making and to take preventive actions based on the in-built business intelligence reports generated through live events. It is highly secure as well as cost-effective. PARTNER STRATEGY AND DELIVERY MODEL DELIVERY MODEL Manufacturer FACEHAWK act as a manufacturer of the software with all the intellectual property rights of FACEHAWK. Enabling Partners/ Distributors Platinum Partners - Complimentary capability, Scale for operational size or geographical coverage and vertical integration along the industry value chain. Moreover, we call them distributor reseller and system integration. Delivery Partners/ Implementation Partners It comprises of two types of partners i.e., GOLD and Silver. They are responsible for the awareness and credibility building, prospective/ lead generation, Sales, and Delivery/ Implementation. FACEHAWK act as a manufacturer of the software with all the intellectual property rights of FACEHAWK. Platinum Partners - Complimentary capability, Scale for operational size or geographical coverage and vertical integration along the industry value chain. Moreover, we call them distributor reseller and system integration. It comprises of two types of partners i.e., GOLD and Silver. They are responsible for the awareness and credibility building, prospective/ lead generation, Sales, and Delivery/ Implementation."
  ]
}