{
  "company": "www.miteksystems.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 174,
    "-1": 59
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 59,
      "0": 174
    }
  },
  "sample_docs": [
    "Home > Mitek NET[X] Letter from the President and CEO Welcome to MITEK NET[X], the next generation of Image Analytics and Pattern Recognition capabilities. MITEK NET[X] is a company wide initiative aimed at providing you, our Customers and Partners, with the broadest web-based recognition capabilities in the industry. The name MITEK NET[X] encapsulates the theme - using the internet, web services and .NET to help you meet new market opportunities and achieve superior results. This initiative, announced February 6, 2007, comprises multiple phases that will be rolled out over several quarters. Ultimately the framework (as described in the schematic below) will be the universal interface to all the technology available from Mitek. New developments and capabilities will augment the overall platform. The Benefits of MITEK NET[x] By delivering a Single API we shorten the learning curve to integrate our capabilities into your application, and we extend the breadth of technology. The framework will use the most recent Microsoft .NET protocol to ensure fast deployment and complete web services and internet compatibility. This API will be released in multiple phases as more and more features are incorporated in to the framework. Client / Server architectures are a thing of the past. With a web-based platform you can achieve the same rich interfaces, and reliable high performance processing. Add to this the reach and accessibility the web provides, and you truly have the ability to produce solutions with faster time to market and lower cost of ownership. Accuracy means labor and cost savings. Mitek has been a leader in pattern recognition for 15 years. Our read rate and accuracy are unsurpassed in the industry. New advances in voting technology, and optimization, ensure that we maintain the highest levels possible. Our Team of Scientists continues to advance the technology with innovation and refined models. Reach and Scalability Through Web Services Today's internet world makes providing access to image analytics and pattern recognition such as signature authentication, hand and machine print character recognition, object location and much more, all very straight forward. Mitek's objective with an ASP initiative is to provide our partners and customers who don't want, or need to have, an in-house technology implementation to be able to reap the same benefits as those who do. Flexibility of Implementation and licensing We know the marketplace has changed and continues to evolve. Rather than offer our suite of technology in a single licensing model; the value proposition of MITEK NET[X] is to provide licensing options that match your integration and architecture preferences. These aspects of technology delivery are aimed at capitalizing on market opportunities that were previously unreachable. Thank you and look for more to come from Mitek NET[X]!",
    "Home > News/Events > Mitek News Elders Target of Check Fraud Crises - 03/07/06 Validify Solution Receives Innovation Award - 11/18/05 Harland Helps Protect Consumers From Identity Theft With New Check Fraud Prevention Technology - 11/09/05 Technology permits check verification even in a virtual world Independent Banker- 02/01/05 U.S. Banks Face Potential Customer Exodus Over Identity Theft Transaction News - 12/1/04 N.D. Bank Pleased with Fraud Software American Banker - 11/23/04 Columbia House Automates Processing More Than 250,000 Forms Daily Today - 10/1/04 Harland To Pilot Check Fraud Solution Credit Union Journal - 10/15/04 Technologies Will Help Banks Analyze Xheck Images for Usability and Protect Against Fraud eWeek - 10/14/04 Building the Authentication Into the Check American Banker- 10/12/04 ImageScore Improves Accuracy in Check 21 Process The Greensheet - 10/11/04 Image Checker From Mitek American Banker - 10/1/04 New Check Fraud Ravaging Accounts MarketWatch - 10/3/05 The Authentic Image Newsletter Volume 3, March 2006 Volume 2, December 2005 Volume 1, October 2005",
    "Partners Program Mitek Partners Mitek offers the most advanced and comprehensive tools for application developers to capture and process data from an image. Our Partner Program provides system integrators, value-added resellers, independent software vendors and applications developers software toolkits that are proven, labor-saving solutions for today's information management challenges. Mitek has a range of enterprise licensing programs to fit the needs of developers at every level. Financial Applications and Toolkits Signature verification and forgery detection for check processing, data and document processing. Document capture and forms processing solutions including quality assessment and clean-up. Mitek serves as the single point vendor for Check 21, CAR/LAR and fraud detection. Document & Data Capture and Forms Processing Image recognition and image pre-processing tools for building document capture and leads processing solutions. Signature Verification and Forgery detection for healthcare, insurance, credit cards, publishing and more Contact Us Add value with Mitek's products and services. For more information on becoming a partner please email us at: info@miteksystems.com To , visit them online at: www.afsimage.com To , visit them online at: www.alogent.com To , visit them online at: www.banctec.com To , visit them online at: www.dmpinc.com To , visit them online at: www.fairfaximaging.com To , visit them online at: www.harlandfinancialsolutions.com To , visit them online at: www.IBM.com To , visit them online at: www.jbsoftware.com OPT2VOTE is a premier election service provider in the UK, providing outstanding expertise and knowledge across all areas of election management. OPT2VOTE specializes in providing choices to improve participation in the democratic system by delivering a range of high quality, innovative and effective solutions to address all election requirements. To visit them at: www.opt2vote.com To , visit them online at: www.rdmcorp.com To , visit them online at: www.scanoptics.com To , visit them online at: www.signplus.com To , visit them online at: www.unisys.com",
    "Home > Mitek Systems has created this privacy statement in order to demonstrate our firm commitment to privacy. The following discloses our information gathering and dissemination practices for this website: http://www.miteksystems.com. We use your IP address to help diagnose problems with our server, and to administer our Web site. Your IP address is used to help identify you and to gather broad demographic information. We use cookies to deliver content specific to your interests. Our site's forms require users to give us contact information (like name and email address) and demographic information (like zip code). We use customer contact information from our forms to send the user information about our company. The customer's contact information is also used to contact the visitor when necessary. Users may opt-out of receiving future mailings; see the choice/opt-out section below. Demographic and profile data is also collected at our site. We use this data to tailor the visitor's experience at our site, showing them content that we think they might be interested in, and displaying the content according to their preferences. This site contains links to other sites. Miteksystems.com is not responsible for the privacy practices or the content of such Web sites. This site has security measures in place to protect the loss, misuse and alteration of the information under our control. Our site provides users the opportunity to opt-out of receiving communications from us, and our partners at the point where we request information about the visitor. This site gives users the following options for removing their information from our database to not receive future communications or to no longer receive our service. You can send e-mail to webmaster@miteksys.com You can call the following telephone number: 858.513.4600 x331 This site gives users the following options for changing and modifying information previously provided. E-mail webmaster@miteksys.com or call the following telephone number: 858.513.4600 x331 Contacting us about the Web Site If you have any questions about this privacy statement, the practices of this site, or your dealings with this Web site, you can contact Mitek Systems by writing to: 14145 Danielson St. Suite B Poway, CA 92064 Copyright Information Copyright 2002-2005 by Mitek Systems, Inc. . Mitek, Mitek Systems, QuickStrokes, Doctus, Quick FX Pro and CheckQuest are registered trademarks of Mitek Systems, Inc. DynaFind, TrueSign, Proof Express and iStatements are trademarks of Mitek Systems, Inc. CheckScript is a trademark of Parascript LLC. All other product or company names may be trademarks or registered trademarks of their respective holders. PLEASE READ THE FOLLOWING OF USE CAREFULLY. BY ACCESSING THIS WEBSITE AND ANY PAGES THEREOF, YOU AGREE TO BE BOUND BY THE OF USE BELOW. IF YOU DO NOT AGREE TO THE FOLLOWING OF USE, DO NOT ACCESS THIS WEBSITE, OR ANY PAGES THEREOF. YOU SHOULD CHECK THIS SECTION FROM TIME TO TIME AS WE MAY REVISE THESE OF USE, AND YOU AGREE TO BE BOUND BY ANY SUCH REVISIONS. Copyrights and Other Intellectual Property Rights Unless otherwise expressly noted, Mitek Systems (\"Mitek\") owns the copyright in the pages and in the screens displaying the pages and in the information, names, images, pictures, recordings, logos, icons, products, programs, documents and materials (collectively \"Information\") therein and in their arrangement. Unless otherwise specifically provided on a web page, Mitek Systems authorizes you to copy, view, print and distribute Information published by Mitek Systems or its affiliates on this website subject to the following conditions: (1) you use such Information for informational and non-commercial purposes solely for use and distribution within your organization; (2) you may not charge a fee to distribute the Information; and (3) you must include on all such copies any and all legends, copyright, proprietary or other notices that appear herein or if no such legends or notices appear on such Information, then the following copyright notice must appear on all such copies: \"Copyright .\" Except as authorized in this paragraph, you are not being granted a license under any copyright, trademark, patent or other intellectual property right in the Information, and the Information may not otherwise be reproduced, displayed, downloaded, licensed, modified, re-posted, retransmitted, disseminated, sold, distributed, published, broadcast, circulated, used to create a derivative work or otherwise used for commercial purposes without the express written consent of Mitek Systems. The trademarks, logos, and service marks (collectively the \"Trademarks\") displayed on the Site are registered and common law Trademarks of Mitek Systems and others. Nothing contained on the site should be construed as granting, by implication, estoppel, or otherwise, any license or right to use any Trademark displayed on the site without the written permission of Mitek Systems or such third party that may own the Trademarks displayed on the Site. Your use of the Trademarks displayed on the Site, or any other content on the Site, is strictly prohibited. You are also advised that Mitek Systems will aggressively enforce its intellectual property rights to the fullest extent of the law, including the seeking of criminal prosecution. Web Content and Materials The Information contained in this website and the of the access to and use of such Information are subject to change without notice. Mitek Systems may also make improvements and/or changes in the Information at any time without notice. Any dated information is published as of its date only, and Mitek Systems does not undertake any obligation or responsibility to update or amend any such information. By offering Information, no solicitation is made by Mitek Systems to any person to use such Information in jurisdictions where the provision of such Information is prohibited by law. Your eligibility for particular products and services is subject to final Mitek Systems determination and acceptance. of Use for Downloadable Software Available on this Website Any software that is made available to download from this server (\"Software\") is the copyrighted work of Mitek Systems, Inc. and/or its suppliers. Use of the Software is governed by the of the end user license agreement, if any, which accompanies or is included with the Software (\"License Agreement\"). An end user will be unable to install any Software that is accompanied by or includes a License Agreement, unless he or she first agrees to the License Agreement . The Software is made available for downloading solely for use by end users according to the License Agreement. Any reproduction or redistribution of the Software not in accordance with the License Agreement is expressly prohibited by law, and may result in severe civil and criminal penalties. Violators will be prosecuted to the maximum extent possible. WITHOUT LIMITING THE FOREGOING, COPYING OR REPRODUCTION OF THE SOFTWARE TO ANY OTHER SERVER OR LOCATION FOR FURTHER REPRODUCTION OR REDISTRIBUTION IS EXPRESSLY PROHIBITED. THE SOFTWARE IS WARRANTED, IF AT ALL, ONLY ACCORDING TO THE OF THE LICENSE AGREEMENT. EXCEPT AS WARRANTED IN THE LICENSE AGREEMENT, MITEK SYSTEMS, INC. HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS WITH REGARD TO THE SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. RESTRICTED RIGHTS LEGEND. Any Software which is downloaded from this Server for or on behalf of the United States of America, its agencies and/or instrumentalities (\"U.S. Government\"), is provided with Restricted Rights. Use, duplication, or disclosure by the U.S. Government is subject to restrictions as set forth in subparagraph (c)(1)(ii) of the Rights in Technical Data and Computer Software clause at DFARS 252.227-7013 or subparagraphs (c)(1) and (2) of the Commercial Computer Software - Restricted Rights at 48 CFR 52.227-19, as applicable. Manufacturer is Mitek Systems, Inc., 14145 Danielson Street, Suite B, Poway, CA 92064. of Use for Documents Available on this Website Permission to use Documents (such as white papers, press releases, datasheets and FAQs) from this server (\"Server\") is granted, provided that (1) the below copyright notice appears in all copies and that both the copyright notice and this permission notice appear, (2) use of such Documents from this Server is for informational and non-commercial or personal use only and will not be copied or posted on any network computer or broadcast in any media, and (3) no modifications of any Documents are made. Use for any other purpose is expressly prohibited by law, and may result in severe civil and criminal penalties. Violators will be prosecuted to the maximum extent possible. Documents specified above do not include the design or layout of the miteksys.com website or any other Mitek Systems, Inc. owned, operated, licensed or controlled site. Elements of Mitek Systems websites are protected by trademark and other laws and may not be copied or imitated in whole or in part. No logo, graphic, sound or image from any Mitek Systems website may be copied or retransmitted unless expressly permitted by Mitek Systems. MITEK SYSTEMS AND/OR ITS RESPECTIVE SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY OF THE INFORMATION CONTAINED IN THE DOCUMENTS AND RELATED GRAPHICS PUBLISHED ON THIS SERVER FOR ANY PURPOSE. ALL SUCH DOCUMENTS AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND. MITEK SYSTEMS AND/OR ITS RESPECTIVE SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, INCLUDING ALL IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL MITEK SYSTEMS AND/OR ITS RESPECTIVE SUPPLIERS BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF INFORMATION AVAILABLE FROM THIS SERVER. THE DOCUMENTS AND RELATED GRAPHICS PUBLISHED ON THIS SERVER COULD INCLUDE TECHNICAL INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. MITEK SYSTEMS AND/OR ITS RESPECTIVE SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE PRODUCT(S) AND/OR THE PROGRAM(S) DESCRIBED HEREIN AT ANY TIME. NOTICES REGARDING SOFTWARE, DOCUMENTS AND SERVICES AVAILABLE ON THIS WEBSITE. IN NO EVENT SHALL MITEK SYSTEMS AND/OR ITS RESPECTIVE SUPPLIERS BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT , NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF INFORMATION AVAILABLE FROM THIS SERVER.",
    "Home > News/Events > Press Releases Mitek Announces Web-Based Check Fraud Detection System Utilizing Advance Image Analytics Fraud Protect™ Web– First Deployment of Mitek NET[X] Technology Platfor m SAN DIEGO, CA., Feb 20, 2007, Mitek Systems, Inc. (OTCBB: MITK; www.miteksystems.com ), a leading provider of Image Analytics and Pattern Recognition software, today announced the availability of FraudProtect™ Web, a next generation release of the company's popular FraudProtect™ System, a check fraud detection application that helps reduce a financial institution's losses related to all check alteration schemes including signature forgery, and modified payee, payor and layout on the item. The new FraudProtect™ Web boasts key advantages in the area of scalability, workflow and interoperability. The web-based platform provides the ability to distribute the analysis of suspicious checks, so payment decisions can be expedited – all through a web browser. Additionally, the system is designed to provide outsource Item Processing Service Providers the ability to securely manage hundreds of financial institutions concurrently. Item Processing trends indicate a continued move towards outsourcing, but until now these providers did not have the ability to provide their customers with an effective and secure suspect item review. \"This product and associated offering is the first evidence of the power and extendibility of MITEK NET[X]\" said James DeBello. \"We see far reaching potential for this application as a service offered for leading item processors.\" The application features an open architecture, making integration easy with existing transaction based check fraud systems, such as Carreker (being acquired by CheckFree Corporation), and Focus Technologies, which complement this Image Analytics based check fraud technology. \"Our customers have found that the FraudProtect™ System yields a return on investment in as little as 6 months, and it also helps with customer retention\" said Product Manager Orit Chanukov. \"This release will bring productivity improvements which we believe will revolutionize check fraud detection. Banks, and Processors will be able to present suspect checks to the branches for decisioning– instantaneously. That is a win-win for the bank and their customers.\" The new application remains compatible with the industry leading Item Processing applications from Fidelity National Information Systems (Bankware), Harland Financial Solutions, Jack Henry and Associates, Open Solutions, Metavante Image Solutions, Wausau and others. Existing FraudProtect™ System customers will be able to easily upgrade their current installations to the new FraudProtect™ Web. Beginning this March, Mitek plans to provide free access to a hosted installation of FraudProtect™ Web to enable interested financial institutions to evaluate the product and submit sample checks to test the accuracy and efficacy of the Image Analytics in detecting fraudulent items. About Mitek Systems, Inc. Mitek Systems (OTCBB: MITK; www.miteksystems.com ) is a global leader in Image Analytics and pattern recognition technologies used by financial institutions, life science companies, government agencies and system integrators. The Company develops and markets the most comprehensive suite of intelligent character recognition software used to test, clean, read and authenticate imaged documents and objects. Sold to partners and directly to end users, the Company's software is used in the processing of over 8 billion transactions per year. For more information about Mitek Systems, contact the company at 8911 Balboa Ave., Suite B, San Diego, CA 92123; 858-503-7810 or visit www.miteksystems.com . This news release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, and other expressions of management's belief or opinion that reflect its current understanding or belief with respect to such matters. Such statements include, without limitation, projections of revenue and operating expenses. These estimates and projections and the company's business prospects in general are subject to numerous risks and uncertainties, including the fact that the company has a history of losses, may not be able to achieve or maintain profitability. These and other risks are detailed from time-to-time in the Company's SEC reports, including our most recent Form 10-QSB and our Form 10-KSB for the fiscal year ended September 30, 2005. Actual results may differ materially from those projected. These forward-looking statements represent management's opinions and beliefs as of the date of this news release. The Company disclaims any intent or obligation to update these forward-looking statements to reflect events or circumstances that may arise after the date of this release. Emmanuel de Boucaud VP Sales & Marketing Mitek Systems, Inc. 8911 Balboa Ave., Suite B San Diego, CA 92123 edeboucaud@miteksystems.com 858-503-7810, ext 351"
  ]
}