{
  "company": "www.photko.com",
  "dominant_topics": [
    1,
    20,
    0,
    3,
    -1
  ],
  "topic_counts": {
    "1": 7,
    "20": 5,
    "0": 2,
    "3": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "20": "deck, attacked, zombie, turn, trap",
    "0": "access, information, security, data, piam",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.4838709677419355,
    "framing_surveillance": 0.0806451612903225,
    "framing_market": 0.4354838709677419,
    "num_docs": 16
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2,
      "1": 7,
      "3": 1,
      "20": 5
    }
  },
  "sample_docs": [
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It. Written by Emma Chapman Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. 12 years after the tragic death of their little girl, a dollmaker and his wife welcome a nun and several girls from a shuttered orphanage into their home, where they soon become the target of the dollmaker's possessed creation, Annabelle. Baby is a young and partially hearing impaired getaway driver who can make any wild move while in motion with the right track playing. It's a critical talent he needs to survive his indentured servitude to the crime boss, Doc, who values his role in his meticulously planned robberies. However, just when Baby thinks he is finally free and clear to have his own life with his new girlfriend, Deborah, Doc coerces him back for another job. Now saddled with a crew of thugs too violently unstable to keep to Doc's plans, Baby finds himself and everything he cares for in terrible danger. To survive and escape the coming maelstrom, it will take all of Baby's skill, wits and daring, but even on the best track, can he make it when life is forcing him to face the music? Written by Kenneth Chisholm ( [email protected] ) War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Though safely entombed in a crypt deep beneath the unforgiving desert, an ancient princess, whose destiny was unjustly taken from her, is awakened in our current day bringing with her malevolence grown over millennia, and terrors that defy human comprehension. Written by Universal Pictures Fast and Furious 8: The Fate of the Furious Fast and Furious 8: The Fate of the Furious Now that Dom and Letty are on their honeymoon and Brian and Mia have retired from the game-and the rest of the crew has been exonerated-the globetrotting team has found a semblance of a normal life. But when a mysterious woman seduces Dom into the world of crime he can't seem to escape and a betrayal of those closest to him, they will face trials that will test them as never before. From the shores of Cuba and the streets of New York City to the icy plains off the arctic Barents Sea, the elite force will crisscross the globe to stop an anarchist from unleashing chaos on the world's stage... and to bring home the man who made them a family. Written by harpreet phamber Evacuation of Allied soldiers from Belgium, the British Empire, and France, who were cut off and surrounded by the German army from the beaches and harbor of Dunkirk, France, between May 26- June 04, 1940, during Battle of France in World War II. Written by Harvey Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles a lot like the Earth, nevertheless, sooner or later, the unsuspecting members of the Covenant will have to cope with invincible and unconquerable biological foes beyond human comprehension. Ultimately, what was intended as an exploratory and peaceful mission, under those circumstances, it will soon turn into a desperate rescue operation deep into the cold infinite space. Written by Nick Riganas Two friends are exploring the deep blue sea until something goes wrong. As they submerge 47m they encounter a creature that only wants flesh and blood. As they fight their way back to the top, they shortly run out of oxygen. With only an hour left they're not only racing against time they are racing against life and death. Written by anthonybobb John Wick: Chapter 2 John Wick: Chapter 2 After returning to the criminal underworld to repay a debt, John Wick discovers that a large bounty has been put on his life. In the US, a child goes missing every 40 seconds. You never think it will happen to you. Until it does. Alone and scared, Karla Dyson (Halle Berry) is unwilling to leave the fate of her son's life in someone else's hands. When she catches a glimpse of the abductors speeding away, she decides to fight back. In a heart pounding race against time, Kate begins a high speed pursuit and will stop at nothing to save her son's life. Written by http://teaser-trailer.com Fifty Shades Of Grey Fifty Shades Of Grey When Anastasia Steele, a literature student, goes to interview the wealthy Christian Grey as a favor to her roommate Kate Kavanagh, she encounters a beautiful, brilliant and intimidating man. The innocent and naive Ana starts to realize she wants him. Despite his enigmatic reserve and advice, she finds herself desperate to get close to him. Not able to resist Ana's beauty and independent spirit, Christian Grey admits he wants her too, but on his own . Ana hesitates as she discovers the singular tastes of Christian Grey - despite the embellishments of success, his multinational businesses, his vast wealth, and his loving family, Grey is consumed by the need to control everything. Written by MischaLeCroix A pilot lands work for the CIA and as a drug runner in the south during the 1980s. In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. Now You See Me 2 Now You See Me 2 One year after outwitting the FBI and winning the public's adulation with their Robin Hood-style magic spectacles, The Four Horsemen resurface for a comeback performance in hopes of exposing the unethical practices of a tech magnate. The man behind their vanishing act is none other than Walter Mabry, a tech prodigy who threatens the Horsemen into pulling off their most impossible heist yet. Their only hope is to perform one last unprecedented stunt to clear their names and reveal the mastermind behind it all. Written by Production John Form has found the perfect gift for his expectant wife, Mia - a beautiful, rare vintage doll in a pure white wedding dress. But Mia's delight with Annabelle doesn't last long. On one horrific night, their home is invaded by members of a satanic cult, who violently attack the couple. Spilled blood and terror are not all they leave behind. The cultists have conjured an entity so malevolent that nothing they did will compare to the sinister conduit to the damned that is now... Annabelle. Written by johntyler249 When a mercenary warrior (Matt Damon) is imprisoned within the Great Wall, he discovers the mystery behind one of the greatest wonders of the world. As wave after wave of marauding beasts besiege the massive structure, his quest for fortune turns into a journey toward heroism as he joins a huge army of elite warriors to confront the unimaginable and seemingly unstoppable force. Written by Watch_Movies World War Z 2 World War Z 2 \"The Thinning\" takes place in a post-apocalyptic future where population control is dictated by a high-school aptitude test. When two students (Logan Paul and Peyton List) discover the test is smoke and mirrors hiding a larger conspiracy, they must fight the system to expose it and take it down. Written by Legendary Digital Media In 1977, paranormal investigators Ed and Lorraine Warren travel to London, England, where single mother Peggy Hodgson believes that something evil is in her home. When Peggy's youngest daughter starts showing signs of demonic possession, Ed and Lorraine attempt to help the besieged girl, only to find themselves targeted by the malicious spirits. Kingsman: The Secret Service Kingsman: The Secret Service A young man named Eggsy whose father died when he was a young boy, is dealing with living with the creep his mother is with now, who mistreats her and him. He goes out and does something to one of the creep's friends. He gets arrested and he calls a number a man gave him around the time his father died, to call if he needs help. A man named Harry approaches him and tells him he's the one who helped him. He tells him that he knew his father. When the man Eggsy slighted wants some payback, Harry takes care of him and his companions single handed. Harry then tells Eggsy that he's part of a secret organization called the Kingsman and his father was also part of it. He died trying to make the world safe. Harry offers Eggsy the opportunity to be a Kingsman and he takes it. He undergoes a grueling training course. Harry is looking into the demise of another Kingsman and the trail leads him to tech billionaire named Valentine aka V who is also curious about the group following him, the ... Written by [email protected] When three girls are kidnapped by a man with 23 different personalities, they have to work out which of those personalities will help them escape and which of those personalities will try to stop them. Written by jjmcmanusnbalshiite Belle, her little sister, and her comatose twin brother move into a new house with their single mother Joan in order to save money to help pay for her brother's expensive healthcare. But when strange phenomena begin to occur in the house including the miraculous recovery of her brother, Belle begins to suspect her Mother isn't telling her everything and soon realizes they just moved into the infamous Amityville house. Written by The Weinstein Company An ex-hitman comes out of retirement to track down the gangsters that took everything from him. In 1960, a group of social outcasts who are bullied by a gang of greasers led by Henry Bowers are also tormented by an evil demon who can shape-shift into a clown and feed on children's fears and kill them. After defeating the demonic clown as kids, it resurfaces 30 years later and they must finish it off as adults once again. Written by Blake The Book of Henry The Book of Henry Sometimes things are not always what they seem, especially in the small suburban town where the Carpenter family lives. Single suburban mother Susan Carpenter works as a waitress at a diner, alongside feisty family friend Sheila. Her younger son Peter is a playful 8-year-old. Taking care of everyone and everything in his own unique way is Susan's older son Henry, age 11. Protector to his adoring younger brother and tireless supporter of his often self-doubting mother - and, through investments, of the family as a whole - Henry blazes through the days like a comet. Susan discovers that the family next door, which includes Henry's kind classmate Christina, has a dangerous secret - and that Henry has devised a surprising plan to help. As his brainstormed rescue plan for Christina takes shape in thrilling ways, Susan finds herself at the center of it. Written by Focus Features Ghost in the Shell Ghost in the Shell In the near future, Major Motoko Kusanagi (Scarlett Johansson) is the first of her kind: A human saved from a terrible terrorist attack, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals. When terrorism reaches a new level that includes the ability to hack into people's minds and control them, Major Kusanagi is uniquely qualified to stop it. As she prepares to face a new enemy, Major Kusanagi discovers that she has been lied to: her life was not saved, it was stolen. She will stop at nothing to recover her past, find out who did this to her and stop them before they do it to others. Written by Paramount Pictures The crown jewel of Her Majesty's Secret Intelligence Service, Agent Lorraine Broughton (Theron) is equal parts spycraft, sensuality and savagery, willing to deploy any of her skills to stay alive on her impossible mission. Sent alone into Berlin to deliver a priceless dossier out of the destabilized city, she partners with embedded station chief David Percival (James McAvoy) to navigate her way through the deadliest game of spies. Written by Focus Features The Purge: Election Year The Purge: Election Year It's been seventeen years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state. A young street magician (Jacob Latimore) is left to care for his little sister after their parents passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is forced to use his magic and brilliant mind to save her. Written by Blumhouse Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened. Written by Benett Sullivan Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother-a brother who desperately wishes to follow in his twin's despicable footsteps-one former super-villain will rediscover just how good it feels to be bad. War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when a pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers and her true destiny. Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy. Together, Batman and Wonder Woman work quickly to find and recruit a team of metahumans to stand against this newly awakened threat. But despite the formation of this unprecedented league of heroes-Batman, Wonder Woman, Aquaman, Cyborg and The Flash-it may already be too late to save the planet from an assault of catastrophic proportions. Guardians of the Galaxy Vol. 2 Guardians of the Galaxy Vol. 2 After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy. Written by Blazer346 Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles a lot like the Earth, nevertheless, sooner or later, the unsuspecting members of the Covenant will have to cope with invincible and unconquerable biological foes beyond human comprehension. Ultimately, what was intended as an exploratory and peaceful mission, under those circumstances, it will soon turn into a desperate rescue operation deep into the cold infinite space. Written by Nick Riganas High school outcasts stumble upon an old alien ship, where they acquire superpowers and are dubbed the Power Rangers. Learning that an old enemy of the previous generation has returned to exact vegenance, the group must harness their powers and use them to work together and save the world. Written by cyberboy1127-249-955930 A washed up monster chaser convinces the U.S. Government to fund a trip to an unexplored island in the South Pacific. Under the guise of geological research, the team travels to \"Skull Island\". Upon arrival, the group discover that their mission may be complicated by the wildlife which inhabits the island. The beautiful vistas and deadly creatures create a visually stunning experience that is sure to keep your attention. Written by Jason Burns Valerian and the City of a Thousand Planets Valerian and the City of a Thousand Planets VALERIAN AND THE CITY OF A THOUSAND PLANETS is the new adventure film from Luc Besson, the director of The Professional, The Fifth Element and Lucy, based on the comic book series which inspired a generation of artists, writers and filmmakers. In the 28th century, Valerian (Dane DeHaan) and Laureline (Cara Delevingne) are a team of special operatives charged with maintaining order throughout the human territories. Under assignment from the Minister of Defense, the two embark on a mission to the astonishing city of Alpha-an ever-expanding metropolis where species from all over the universe have converged over centuries to share knowledge, intelligence and cultures with each other. There is a mystery at the center of Alpha, a dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe. The Emoji Movie unlocks the never-before-seen secret world inside your smartphone. Hidden within the messaging app is Textopolis, a bustling city where all your favorite emojis live, hoping to be selected by the phone's user. In this world, each emoji has only one facial expression - except for Gene, an exuberant emoji who was born without a filter and is bursting with multiple expressions. Determined to become \"normal\" like the other emojis, Gene enlists the help of his handy best friend Hi-5 and the notorious code breaker emoji Jailbreak. Together, they embark on an epic \"app-venture\" through the apps on the phone, each its own wild and fun world, to find the Code that will fix Gene. But when a greater danger threatens the phone, the fate of all emojis depends on these three unlikely friends who must save their world before it's deleted forever. Written by Sony Pictures Entertainment In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela. The last Gunslinger, Roland Deschain, has been locked in an eternal battle with Walter O'Dim, also known as the Man in Black, determined to prevent him from toppling the Dark Tower, which holds the universe together. With the fate of the worlds at stake, good and evil will collide in the ultimate battle as only Roland can defend the Tower from the Man in Black. This is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life. Written by 20th Century Fox It feels good to be bad...Assemble a team of the world's most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government's disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren't picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it's every man for himself? Written by Amitash Balekar World War Z 2 World War Z 2 Guardians of the Galaxy Guardians of the Galaxy After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth, is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the world. Written by James Hake Ghost in the Shell Ghost in the Shell In the near future, Major Motoko Kusanagi (Scarlett Johansson) is the first of her kind: A human saved from a terrible terrorist attack, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals. When terrorism reaches a new level that includes the ability to hack into people's minds and control them, Major Kusanagi is uniquely qualified to stop it. As she prepares to face a new enemy, Major Kusanagi discovers that she has been lied to: her life was not saved, it was stolen. She will stop at nothing to recover her past, find out who did this to her and stop them before they do it to others. Written by Paramount Pictures Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe. Written by Marvel The Purge: Election Year The Purge: Election Year It's been seventeen years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state. A young street magician (Jacob Latimore) is left to care for his little sister after their parents passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is forced to use his magic and brilliant mind to save her. Written by Blumhouse Maze Runner: The Scorch Trials Maze Runner: The Scorch Trials The second chapter of the epic \"Maze Runner\" saga. Thomas (Dylan O'Brien) and his fellow Gladers face their greatest challenge yet: searching for clues about the mysterious and powerful organization known as WCKD. Their journey takes them to the Scorch, a desolate landscape filled with unimaginable obstacles. Teaming up with resistance fighters, the Gladers take on WCKD's vastly superior forces and uncover its shocking plans for them all. Written by 20th Century Fox It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio. Written by LeiaSolo Chris Redfield enlists the help of Leon S. Kennedy and Rebecca Chambers to stop a death merchant, with a vengeance, from spreading a deadly virus in New York. Thor The Dark World Thor The Dark World Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to ... Written by [email protected] As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain. Captain America: Civil War Captain America: Civil War With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges. Written by RespectTheHyphen Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children. While Gru, the ex-supervillain is adjusting to family life and an attempted honest living in the jam business, a secret Arctic laboratory is stolen. The Anti-Villain League decides it needs an insider's help and recruits Gru in the investigation. Together with the eccentric AVL agent, Lucy Wilde, Gru concludes that his prime suspect is the presumed dead supervillain, El Macho, whose his teenage son is also making the moves on his eldest daughter, Margo. Seemingly blinded by his overprotectiveness of his children and his growing mutual attraction to Lucy, Gru seems on the wrong track even as his minions are being quietly kidnapped en masse for some malevolent purpose. Written by Kenneth Chisholm ( [email protected] ) Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War Valerian and the City of a Thousand Planets Valerian and the City of a Thousand Planets VALERIAN AND THE CITY OF A THOUSAND PLANETS is the new adventure film from Luc Besson, the director of The Professional, The Fifth Element and Lucy, based on the comic book series which inspired a generation of artists, writers and filmmakers. In the 28th century, Valerian (Dane DeHaan) and Laureline (Cara Delevingne) are a team of special operatives charged with maintaining order throughout the human territories. Under assignment from the Minister of Defense, the two embark on a mission to the astonishing city of Alpha-an ever-expanding metropolis where species from all over the universe have converged over centuries to share knowledge, intelligence and cultures with each other. There is a mystery at the center of Alpha, a dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe. The crown jewel of Her Majesty's Secret Intelligence Service, Agent Lorraine Broughton (Theron) is equal parts spycraft, sensuality and savagery, willing to deploy any of her skills to stay alive on her impossible mission. Sent alone into Berlin to deliver a priceless dossier out of the destabilized city, she partners with embedded station chief David Percival (James McAvoy) to navigate her way through the deadliest game of spies. Written by Focus Features Harry Potter and the Chamber of Secrets Harry Potter and the Chamber of Secrets Forced to spend his summer holidays with his muggle relations, Harry Potter gets a real shock when he gets a surprise visitor: Dobby the house-elf, who warns Harry Potter against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening: Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his/her guard - \"The Chamber Of Secrets Has Been Opened. Enemies Of The Heir, Beware\" . Written by Soumitra Captain America: Civil War Captain America: Civil War With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges. Written by RespectTheHyphen This is the inspiring captivating story of the legendary rapper Eminem. The troubled young aspiring rapper from a ghetto in Michigan must exert his last chances to become successful while dealing with his life in ruins. All is seemingly lost. He is now single, has only a few friends, an insane/alcoholic mother, and is dealt with poverty and living in a violent city on 8 mile. His only way out of the ghetto and torturous life he's living in is with his talent in rapping. Will B-Rabbit prevail and seize the shot he's given or will he let it slip? Written by ojmessier23 The Hunger Games: Mockingjay - Part 2 The Hunger Games: Mockingjay - Part 2 After young Katniss Everdeen agrees to be the symbol of rebellion, the Mockingjay, she tries to return Peeta to his normal state, tries to get to the Capitol, and tries to deal with the battles coming her way...but all for her main goal: assassinating President Snow and returning peace to the Districts of Panem. As her squad starts to get smaller and smaller, will she make it to the Capitol? Will she get revenge on Snow or will her target change? Will she be with her \"Star-Crossed Lover,\" Peeta, or her long-time friend, Gale? Deaths, bombs, bow and arrows, a love triangle, hope... What will happen? Written by baileyyybroooks Can strangers connect? Can casual sex become something else? In Santiago, Daniela and Bruno, both about 30, meet at a party, go to another and end up in a hotel. We join them there as passion becomes talk: do they know each other's name, have they been to hotels with others? There's some playfulness, more sex, a bath, pillow fights, condom problems, stories from their past, conflict. Each gets a phone call, each intrudes on the other's privacy. As the night wanes, will there be anything else? Written by [email protected] Kate and John Coleman are rebuilding their troubled marriage after the loss of their baby. The couple decide to adopt a child. When they meet the nine-year-old Estonian girl, Esther, at the St. Marina Orphanage, they immediately fall in love with the well-educated orphan. Their young son, Daniel, is hostile to his new sister; but their deaf mute daughter, Max, is enchanted with her - at first. Eventually, Kate begins to feel that Esther is manipulative and possibly even psychologically disturbed. John refuses to listen to his wife's misgivings. Kate calls Sister Abigail at the orphanage, and the nun informs her that Esther has a troubled and mysterious history. Kate delves further into Esther's past and discovers she is not what she claims to be. Written by [email protected] Kama Sutra - A Tale of Love Kama Sutra - A Tale of Love Tara and Maya are two inseparable friends in India. Their tastes, habits, and hobbies are the same. Years later, the two have matured, but have maintained their friendship. Tara gets married to the local prince, Raj Singh, who soon succeeds the throne as the sole heir. After the marriage, Raj gets bored of Tara and starts seeking another female to satisfy his sexual needs. He notices Maya and is instantly attracted to her. He has her included as one of his courtesans, and is intimate with her. Watch what happens when Tara finds out and the extent she will go to keep her marriage intact. Written by rAjOo ( [email protected] ) Resident Evil: The Final Chapter Resident Evil: The Final Chapter Picking up immediately after the events in Resident Evil: Retribution, Alice (Milla Jovovich) is the only survivor of what was meant to be humanity's final stand against the undead. Now, she must return to where the nightmare began - The Hive in Raccoon City, where the Umbrella Corporation is gathering its forces for a final strike against the only remaining survivors of the apocalypse. Written by Screen Gems / Constantin The Mortal Instruments: City Of Bones The Mortal Instruments: City Of Bones Set in contemporary New York City, a seemingly ordinary teenager, Clary Fray, discovers she is the descendant of a line of Shadowhunters, a secret cadre of young half-angel warriors locked in an ancient battle to protect our world from demons. After the disappearance of her mother, Clary must join forces with a group of Shadow Hunters, who introduce her to a dangerous alternate New York called the Shadow World, filled with demons, warlocks, vampires, werewolves and other deadly creatures. Written by Sony Pictures Entertainment The Fast and the Furious Tokyo Drift The Fast and the Furious Tokyo Drift An American teenager named Sean Boswell is a loner in school, however he challenges his rival for an illegal street racing, and he totals his car in the end of the race. To avoid time in prison he is sent to Tokyo to live with his father who is in the military. As soon as he arrives he discovers a new, fun but dangerous way of street racing in the underworld of the streets of Tokyo, Japan. Written by Emphinix Sex, Lies and Renaissance Sex, Lies and Renaissance Happily engaged to her handsome fiance, Charles, Fanny is soon hit with one misfortune after another until she is forced to become a prostitute to survive. This is the story, with many erotic asides, of her struggle to regain her pride in herself and find happiness in life once again. Written by Jean-Marc Rocher [email protected] Set on a colorful Greek island, the plot serves as a background for a wealth of ABBA songs. A young woman about to be married discovers that any one of three men could be her father. She invites all three to the wedding without telling her mother, Donna, who was once the lead singer of Donna and the Dynamos. In the meantime, Donna has invited her backup singers, Rosie and Tanya. Written by [email protected] A Cure for Wellness A Cure for Wellness An ambitious young executive is sent to retrieve his company's CEO from an idyllic but mysterious \"wellness center\" at a remote location in the Swiss Alps. He soon suspects that the spa's miraculous treatments are not what they seem. When he begins to unravel its terrifying secrets, his sanity is tested, as he finds himself diagnosed with the same curious illness that keeps all the guests here longing for the cure. Written by 20th Century Fox Rosie and Alex have been best friends since they were 5, so they couldn't possibly be right for one another... or could they? When it comes to love, life and making the right choices, these two are their own worst enemies. One awkward turn at 18, one missed opportunity... and life sends them hurling in different directions. But somehow, across time, space and different continents, the tie that binds them cannot be undone. Will they find their way back to one another, or will it be too late? Based on Cecelia Ahern's bestselling novel \"Where Rainbows End\", LOVE, ROSIE is a modern comedy-of-errors tale posing the ultimate question: Do we really only get one shot at true love? Written by anonymous Frank Martin returns as the Transporter with one very simple task - to deliver the package against all the odds. However, something that sounds so simple, is rarely so. Joined by two new team members, Caterina Boldieu, an ex- DGSE agent and later in the series, Jules Faroux, a computer and mechanical whizz, Frank is hired to deliver a diverse range of packages - from pop princesses to priceless paintings. Frank Martin takes the jobs no other transporter will touch or can achieve - simply because they are too challenging and the odds seemingly insurmountable. That is why he is considered the best transporter in the world. Frank's jobs take him to many beautiful locations around the world, but they also draw him into danger and mystery. And more often than not, solving that mystery will lead Frank to successfully completing his mission. However Frank's jobs aren't solely about the packages he must deliver but also about the people he meets. While his emphasis is always on completing the... Written by Atlantique Production Anne of Green Gables Anne of Green Gables At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne...if Anne can keep out of trouble, only Anne has a positive genius for it. As Anne falls into a series of scrapes (and off a roof), makes a bosom friend, searches (and finds) several kindred spirits, Matthew and Marilla discover that their lives have become a great deal richer, now that Anne is at Green Gables. Written by Kathy Li Mia used to read about the land of Centopia in an ancient book of myths. Now, thanks to a high-tech portal designed by her father, she finds herself hurled into this wondrous world of elves, unicorns and pans. But the once idyllic kingdom is embroiled in conflict. The evil Queen Panthea seeks to capture the unicorns and harness their power to keep herself young. The valiant elves, led by noble Prince Mo and daring warrior Yuko, fight to stop her. And thanks to her unique ability to communicate with unicorns, Mia must personally safeguard the golden-horned Onchao. As she bounces between trying to fit in at her new school and her life as an elf, Mia must uncover skills she didn't know she had, in her struggle to prevent this incredible world from being consumed by Panthea's evil power. Written by Doug Sinclair Ned's Declassified School Survival Guide Ned's Declassified School Survival Guide Nickelodeon's Ned's Declassified School Survival Guide chronicles the wacky adventures of Ned Bigby and his best pals Moze and Cookie at James K. Polk Middle School, as every-kid Ned shatters the fourth wall to share tips and tricks on navigating middle school or junior high hurdles. Ned's not super cool, and he has no superpowers. He is, however, witty, well-groomed, upbeat and self-aware. Moreover, with more than a little help from his two best friends, he's equipped to conquer middle school minefields. From crushing bullies to crushes, from off- the-wall, mean and cool teachers to pop quizzes, elections and detentions, Ned knows that nothing, including the seventh grade, is as bad as it seems, and friendship matters most. Written by Seth Weinstein ( [email protected] ) Ciro disregards tradition in his attempt to become the next boss of his crime syndicate. The internal power struggle puts him and his entire family's life at risk. Remember is the contemporary story of Zev, who discovers that the Nazi guard who murdered his family some 70 years ago is living in America under an assumed identity. Despite the obvious challenges, Zev sets out on a mission to deliver long-delayed justice with his own trembling hand. What follows is a remarkable cross-continent road-trip with surprising consequences. Written by 72nd Venice International Film Festival Existential detective Kurt Wallander must battle his own demons as he works to solve a series of bizarre crimes in southern Sweden. This series is made up of four distinct films, each one a mysterious journey into murder, deception, and baffling crimes. Follow Inspector Kurt Wallander - a disillusioned everyman - as he struggles against a rising tide of violence in the seemingly sleepy backwaters in and around Ystad in beautiful southern Sweden. Brilliantly acted and visually dazzling, Wallander is based on the bestselling Swedish crime novels by Henning Mankell. Written by cmwinn1227 The Pillars of the Earth The Pillars of the Earth The Pillars of the Earth is set against a backdrop of war, religious strife and power struggles which tears lives and families apart. In that time, there rises a magnificent Cathedral in Kingsbridge. Against the backdrop, love-stories entwine: Tom, the master builder, Aliena, the noblewoman, the sadistic Lord William, Philip, the prior of Kingsbridge, Jack, the artist in stone work and Ellen, the woman from the forest who casts a curse. At once, this is a sensuous and enduring love story and an epic that shines with the fierce spirit of a passionate age. Follett masterfully weaves these stories through political turmoil of 12th century England, creating a relevant and viable world for today's audience and for generations to come. Written by Anonymous Sydney Fox is a professor but primarily a globe-trotting relic hunter, looking for ancient artifacts to return to museums and/or the ancestors of the original owner. She's aided by her linguistic assistant Nigel, and occasionally by her somewhat air-headed secretary Claudia. She often ends up battling rival hunters seeking out artifacts for the money. Written by [email protected] The English town of Kingsbridge works to survive as the King leads the nation into the Hundred Years' War with France while Europe deals with the outbreak of the Black Death. Focuses on life and the environment in both the Arctic and Antarctic. A group of desperate fugitives from an interplanetary tyranny find themselves in control of a massively powerful starship. During a snowy Christmas season in Sweden, psychologist and profiler Inger Johanne Vik finds not only herself but also her autistic daughter drawn into the investigation of a number of disturbing deaths, through which she meets detective Ingvar Nyman of Rikskrim, a Swedish national police force. Nyman is dispatched to Uppsala to investigate the shocking Christmas Eve murder of bishop Elisabeth Lindgren. In Stockholm, the bodies keep turning up - though the causes of death vary. But before long, Inger Johanne starts noticing a pattern. MODUS is a thrilling story that raises questions about religion, human rights, and the very nature of love itself. It goes beyond conventional crime and peppers the story with red-hot political issues and criticizing intolerance. Written by Miso Film A special crime unit investigates serialized crimes that cross over European borders, to hunt down criminals and bring them to justice. Season 2 begins 13 months after the events of the first season. A coastal tanker leaves the Öresund waterway and is headed straight for the Øresund Bridge. When the Coast Guard board the ship they discover there is no crew, and three Swedish and two Danish youths are chained below deck. Saga Norén, County Police, Malmö, is put in charge of the case and contacts Martin Rohde, who is still haunted by the death of his son. Soon it turns out the chained youths were just the beginning... Someone wants to direct our attention to the changing climate and the use of our planet's resources, and will stop at nothing to do it. It all turns into a race against the clock to prevent a disaster where many lives are at stake... Written by Nimbus Film Mr. Morgan's Last Love Mr. Morgan's Last Love Matthew Morgan is a retired American professor in his 80s, a widower. He lives in Paris and speaks no French. Since his wife's death, he's marking time. His curiosity is piqued when he meets Pauline Laubie, half his age, a dance instructor. She's also a solitary person but wants the connection of family. She believes she's found that in Matthew, and she attends to him during a hospitalization. When his two adult children arrive from the U.S. to check on their father, they are certain Pauline is a gold digger, and she's confounded by the distance between father and children. The daughter heads home, the son remains. Is there any way that Pauline fits in? Written by [email protected] Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It. Written by Emma Chapman In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea. Written by Sam Gray In sun-kissed Emerald Bay, the vigorous Lieutenant Mitch Buchannon and Baywatch, his elite team of hand-picked and perfectly tanned lifeguards, protect the bay, keeping both sunbathers and beach lovers safe. However, this summer, two new eager trainees will join the demanding life-saving program, as well as an insubordinate former Olympic swimmer, who are all called to prove their worth on the lifeguard towers just on time when a new synthetic street drug begins to infest the Emerald Bay: the flakka. Without a doubt, this calls for some serious undercover teamwork action, as the badgeless heroes in spandex comb the beach for shady newcomers and nefarious entrepreneurs with hidden agendas of their own. Can Mitch's band save the bay? Written by Nick Riganas War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Christian and Ana decide to rekindle their relationship, except this time there are no more rules or punishments. As they begin to get used to their newfound relationship, Christian's past begins to haunt Ana as Christian struggles with his innermost thoughts. All Eyez On Me All Eyez On Me Tells the true and untold story of prolific rapper, actor, poet and activist Tupac Shakur. The film follows Shakur from his early days in New York City to his evolution into being one of the world's most recognized and influential voices before his untimely death at the age of 25. Against all odds, Shakur's raw talent, powerful lyrics and revolutionary mind-set propelled him into becoming a cultural icon whose legacy continues to grow long after his passing. ALL EYEZ ON ME stars Kat Graham, Lauren Cohan, Hill Harper, Jamal Woolard, Danai Gurira and Demetrius Shipp Jr. as Tupac Shakur. Evacuation of Allied soldiers from Belgium, the British Empire, and France, who were cut off and surrounded by the German army from the beaches and harbor of Dunkirk, France, between May 26- June 04, 1940, during Battle of France in World War II. Written by Harvey In Toronto, the nymphomaniac Leila spends the nights dancing and having sex with men to satisfy her sex drive. Leila learns that her parents are divorcing and she is affected by their decision. When Leila meets David, she has a torrid affair with him. David is an artist that lives with his father, who is very dependent on David. Leila and David have a complicated relationship since he is a possessive man that demands commitment but Leila does not know how to love a man and has the need of different partners in her sex life. Written by Claudio Carvalho, Rio de Janeiro, Brazil Two friends are exploring the deep blue sea until something goes wrong. As they submerge 47m they encounter a creature that only wants flesh and blood. As they fight their way back to the top, they shortly run out of oxygen. With only an hour left they're not only racing against time they are racing against life and death. Written by anthonybobb Power tells the story of James Ghost St. Patrick, a wealthy New York City nightclub owner who caters to the city's elite. He wants to build an empire, turn the club into a Fortune 500 business, but there's just one problem: Ghost is living a double life. When he is not in the club, he is the kingpin of the most lucrative drug network in New York for a very high-level clientele. His marriage, family and business all become unknowingly threatened as he is tempted to leave his criminal life behind and become the rags-to-riches businessman he wants to be most of all. Written by Jiilo_Kim Fifty Shades Of Grey Fifty Shades Of Grey When Anastasia Steele, a literature student, goes to interview the wealthy Christian Grey as a favor to her roommate Kate Kavanagh, she encounters a beautiful, brilliant and intimidating man. The innocent and naive Ana starts to realize she wants him. Despite his enigmatic reserve and advice, she finds herself desperate to get close to him. Not able to resist Ana's beauty and independent spirit, Christian Grey admits he wants her too, but on his own . Ana hesitates as she discovers the singular tastes of Christian Grey - despite the embellishments of success, his multinational businesses, his vast wealth, and his loving family, Grey is consumed by the need to control everything. Written by MischaLeCroix King Arthur: Legend of the Sword King Arthur: Legend of the Sword Robbed of his birthright, Arthur comes up the hard way in the back alleys of the city. But once he pulls the sword from the stone, he is forced to acknowledge his true legacy - whether he likes it or not. BELOW HER MOUTH is a bold, uninhibited drama that begins with a passionate weekend affair between two women. Dallas, a roofer and Jasmine, a fashion editor, share a powerful and immediate connection that inevitably derails both of their lives. A pilot lands work for the CIA and as a drug runner in the south during the 1980s. In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. A 17 year old girl named Madeline Whittier has a rare disease that causes her to have to stay indoors 24/7 with her filtered air. Her whole life is basically books, her mom, and Carla(her nurse). One day, a moving truck pulls in next door. There she sees Olly. Olly Bright is Maddy's new neighbor. They get to know each other through emails. The more they get to know each other, the more they fall in love. Olly starts to make Maddy realize that she isn't really living. This starts the adventures of Maddy's new life. Written by Elle3 Murphy is an American living in Paris who enters a highly sexually and emotionally charged relationship with the unstable Electra. Unaware of the effect it will have on their relationship, they invite their pretty neighbor into their bed. Scott McCall was just another kid in high school. Until, one night his best friend Stiles brings him to the woods, to look for a dead body, and Scott is bitten by a werewolf. Being a werewolf came with its perks- stronger, faster, new star in the lacrosse team, popularity- but also made it hard to control his anger. Scott has also fallen for the new girl in town, Allison, whose dad is trying to hunt and kill Scott. Scott now has to try and balance his out of control life, figure out how to control his new powers, try not to be killed by the alpha that bit him, and protect Allison- and keep her from finding out his big secret. While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as ... Written by USA Network Thirteen Reasons Why, based on the best-selling books by Jay Asher, follows teenager Clay Jensen (Dylan Minnette) as he returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers a group of cassette tapes recorded by Hannah Baker (Katherine Langford) -his classmate and crush-who tragically committed suicide two weeks earlier. On tape, Hannah unfolds an emotional audio diary, detailing the thirteen reasons why she decided to end her life. Through Hannah and Clay's dual narratives, Thirteen Reasons Why weaves an intricate and heartrending story of confusion and desperation that will deeply affect viewers. Written by Studio Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda. Written by Kenneth Chisholm ( [email protected] ) Set in the fictional town of Rosewood, Pennsylvania, the series follows the lives of four girls, Aria Montgomery, Hanna Marin, Emily Fields, and Spencer Hastings, whose clique falls apart after the disappearance of their leader, Alison DiLaurentis. One year later, the estranged friends are reunited as they begin receiving messages from a mysterious figure named A, who threatens to expose their deepest secrets, including ones they thought only Alison knew. At first, they think it's Alison herself, but after her body is found, the girls realize that someone else is planning on ruining their perfect lives. Sheriff Deputy Rick Grimes gets shot and falls into a coma. When awoken he finds himself in a Zombie Apocalypse. Not knowing what to do he sets out to find his family, after he's done that he gets connected to a group to become the leader. He takes charge and tries to help this group of people survive, find a place to live, and get them food. This show is all about survival, the risks, and the things you'll have to do to survive. Written by jzirkle1 In 1960, a group of social outcasts who are bullied by a gang of greasers led by Henry Bowers are also tormented by an evil demon who can shape-shift into a clown and feed on children's fears and kill them. After defeating the demonic clown as kids, it resurfaces 30 years later and they must finish it off as adults once again. Written by Blake Both physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, and the employees and guests at a struggling hotel in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, addiction, and exploitation. The vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading normal lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon, who promised to Stefan an eternity of misery. Stefan falls in love with schoolgirl Elena, who has an uncanny resemblance to the Salvatore brothers old love, Katherine; and whose best friend Bonnie is a witch. Written by KGF Vissers Keeping Up with the Kardashians Keeping Up with the Kardashians A peek inside the exploits and privileged private lives of the blended Kardashian-Jenner family, including sisters Kim, Kourtney and Khloé. Set 400 years in the future, the show follows the adventures of the Orville, a not-so-top-of-the-line exploratory ship in Earth's interstellar Fleet. Facing cosmic challenges from without and within, this motley crew of space explorers will boldly go where no comedic drama has gone before. After the death of one of the rich and popular Blossom twins on the 4th of July, the small town of Riverdale investigates the murder. The series starts in September, the beginning of a new school year, that brings with it new students, relationships, and reveals the mysteries of the past 4th of July. A Medical-Based drama centered around Meredith Grey, an aspiring surgeon and daughter of one of the best surgeons, Dr. Ellis Grey. Throughout the series, Meredith goes through professional and personal challenges along with fellow surgeons at Seattle Grace Hospital. A spin-off from The Vampire Diaries and set in New Orleans, The Originals centers on the Mikaelson siblings, otherwise known as the world's original vampires: Klaus (Joseph Morgan), Elijah (Daniel Gillies), and Rebekah (Claire Holt). Now Klaus must take down his protégé, Marcel (Charles Michael Davis), who is now in charge of New Orleans, in order to re-take his city, as he originally built New Orleans. Klaus departed from the city after being chased down by his father Mikael, while it was being constructed and Marcel took charge. As Klaus has returned after many years, his ego has provoked him to become the king of the city. Every King needs an heir says Klaus, accepting the unborn child. The child is a first to be born to a hybrid (part vampire, part werewolf) and a werewolf (Hayley). Written by Anaya Miller Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies",
    "Genre Action Adventure Animation Biography Comedy Crime Documentary Drama Family Fantasy History Horror Musical Mystery Romance Sci-Fi Sport Thriller War Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened. Written by Benett Sullivan Transformers: The Last Knight Transformers: The Last Knight Optimus Prime finds his dead home planet, Cybertron, in which he comes to find he was responsible for its destruction. He finds a way to bring Cybertron back to life, but in order to do so, Optimus needs to find an artifact that is on Earth. After he is fired from the Anti-Villain League for failing to take down the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother-a brother who desperately wishes to follow in his twin's despicable footsteps-one former super-villain will rediscover just how good it feels to be bad. War for the Planet of the Apes War for the Planet of the Apes Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet. Written by Twentieth Century Fox Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when a pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers and her true destiny. Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his newfound ally, Diana Prince, to face an even greater enemy. Together, Batman and Wonder Woman work quickly to find and recruit a team of metahumans to stand against this newly awakened threat. But despite the formation of this unprecedented league of heroes-Batman, Wonder Woman, Aquaman, Cyborg and The Flash-it may already be too late to save the planet from an assault of catastrophic proportions. Guardians of the Galaxy Vol. 2 Guardians of the Galaxy Vol. 2 After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy. Written by Blazer346 Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles a lot like the Earth, nevertheless, sooner or later, the unsuspecting members of the Covenant will have to cope with invincible and unconquerable biological foes beyond human comprehension. Ultimately, what was intended as an exploratory and peaceful mission, under those circumstances, it will soon turn into a desperate rescue operation deep into the cold infinite space. Written by Nick Riganas High school outcasts stumble upon an old alien ship, where they acquire superpowers and are dubbed the Power Rangers. Learning that an old enemy of the previous generation has returned to exact vegenance, the group must harness their powers and use them to work together and save the world. Written by cyberboy1127-249-955930 A washed up monster chaser convinces the U.S. Government to fund a trip to an unexplored island in the South Pacific. Under the guise of geological research, the team travels to \"Skull Island\". Upon arrival, the group discover that their mission may be complicated by the wildlife which inhabits the island. The beautiful vistas and deadly creatures create a visually stunning experience that is sure to keep your attention. Written by Jason Burns Valerian and the City of a Thousand Planets Valerian and the City of a Thousand Planets VALERIAN AND THE CITY OF A THOUSAND PLANETS is the new adventure film from Luc Besson, the director of The Professional, The Fifth Element and Lucy, based on the comic book series which inspired a generation of artists, writers and filmmakers. In the 28th century, Valerian (Dane DeHaan) and Laureline (Cara Delevingne) are a team of special operatives charged with maintaining order throughout the human territories. Under assignment from the Minister of Defense, the two embark on a mission to the astonishing city of Alpha-an ever-expanding metropolis where species from all over the universe have converged over centuries to share knowledge, intelligence and cultures with each other. There is a mystery at the center of Alpha, a dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe. The Emoji Movie unlocks the never-before-seen secret world inside your smartphone. Hidden within the messaging app is Textopolis, a bustling city where all your favorite emojis live, hoping to be selected by the phone's user. In this world, each emoji has only one facial expression - except for Gene, an exuberant emoji who was born without a filter and is bursting with multiple expressions. Determined to become \"normal\" like the other emojis, Gene enlists the help of his handy best friend Hi-5 and the notorious code breaker emoji Jailbreak. Together, they embark on an epic \"app-venture\" through the apps on the phone, each its own wild and fun world, to find the Code that will fix Gene. But when a greater danger threatens the phone, the fate of all emojis depends on these three unlikely friends who must save their world before it's deleted forever. Written by Sony Pictures Entertainment An animated series on adult-swim about the infinite adventures of Rick, a genius alcoholic and careless scientist, with his grandson Morty, a 14 year-old anxious boy who is not so smart, but always tries to lead his grandfather with his own morale compass. Together, they explore the infinite universes; causing mayhem and running into trouble. Written by Ruben Galaviz In 2029 the mutant population has shrunken significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are aging, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his ... When Mae is hired to work for the world's largest and most powerful tech and social media company, she sees it as an opportunity of a lifetime. As she rises through the ranks, she is encouraged by the company's founder, Eamon Bailey, to engage in a groundbreaking experiment that pushes the boundaries of privacy, ethics and ultimately her personal freedom. Her participation in the experiment, and every decision she makes, begin to affect the lives and future of her friends, family and that of humanity. Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela. The last Gunslinger, Roland Deschain, has been locked in an eternal battle with Walter O'Dim, also known as the Man in Black, determined to prevent him from toppling the Dark Tower, which holds the universe together. With the fate of the worlds at stake, good and evil will collide in the ultimate battle as only Roland can defend the Tower from the Man in Black. Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda. Written by Kenneth Chisholm ( [email protected] ) Set 400 years in the future, the show follows the adventures of the Orville, a not-so-top-of-the-line exploratory ship in Earth's interstellar Fleet. Facing cosmic challenges from without and within, this motley crew of space explorers will boldly go where no comedic drama has gone before. Oliver Queen and his father are lost at sea when their luxury yacht sinks, apparently in a storm. His father dies, but Oliver survives for five years on an uncharted island and eventually returns home. But he wasn't alone on the island where he learned not only how to fight and survive but also of his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city. Written by Anonymous The series is set 97 years after a devastating nuclear war wiped out almost all life on Earth. The only known survivors are the residents of twelve space stations in Earth's orbit prior to the war. The space stations banded together to form a single massive station named The Ark, wenis galore about 2,400 people live. Resources are scarce and all crimes no matter their nature or severity are punishable by death (floating) unless the perpetrator is under 18 years of age. After the Ark's life support systems are found to be critically failing, one hundred juvenile prisoners are declared expendable and sent to the surface in a last ditch attempt to determine if Earth is habitable again. The teens arrive on a beautiful planet they've only seen from space. Confronting the dangers of this rugged new world, they struggle to form a tentative community. However they discover that not all humanity was wiped out. There are people on Earth who survived the war, called grounders by the 100.... Written by Thomas O'Darren Fear the Walking Dead Fear the Walking Dead Spin off series of The Walking Dead that portrays the beginning events of the zombie apocalypse in the West coast during the same time frame when the city of Atlanta was falling under attack, while Rick was in a coma at the local hospital. It shows how the strain was already in full effect in the south while it's just starting in California. In a small town where everyone knows everyone, a peculiar incident starts a chain of events that leads to the disappearance of a child - which begins to tear at the fabric of an otherwise peaceful community. Dark government agencies and seemingly malevolent supernatural forces converge on the town while a few locals begin to understand that there's more going on than meets the eye. Written by Charles J. Years ago, Krypton was about to explode and Kal-El was sent to Earth to escape that fate. However, his older cousin, Kara, was also intended to accompany the infant as his protector. Unfortunately, Kara was accidentally diverted into the timeless Phantom Zone for years before finally arriving on Earth decades later and found by her cousin who had grown into Superman. Years later, Kara Danvers is a young professional adrift in a thankless job until a fateful crisis ignites a sense of purpose using Kryptonian powers she had long hidden. Inspired, Kara decides to emulate her cousin's superheroic ways, only to find her foster sister introducing her to the secret Department of Extra-Normal Operations, dedicated to fighting alien menaces including those Kara inadvertently led to Earth. Now with such help, the Maid of Might takes her place as Earth's newest champion with new friends and enemies challenging her world. Written by Kenneth Chisholm ( [email protected] ) In crime ridden Gotham City, Thomas and Martha Wayne are murdered before young Bruce Wayne's eyes. Although the idealistic Gotham City Police Dept. detective James Gordon, and his cynical partner, Harvey Bullock, seem to solve the case quickly, things are not so simple. Inspired by Bruce's traumatized desire for justice, Gordon vows to find it amid Gotham's corruption. Thus begins Gordon's lonely quest that would set him against his own comrades and the underworld with their own deadly rivalries and mysteries. In the coming wars, innocence will be lost and compromises will be made as some criminals will fall as casualties while others will rise as supervillains. All the while, young Bruce observes this war with a growing obsession that would one day drive him to seek his own revenge as The Batman. Written by Kenneth Chisholm ( [email protected] ) The numerous miraculous rescues by the local wonder boy Clark have aroused suspicions amongst colonials of Smallville. Interestingly, the boy has managed to downplay his acts of various heroic egresses in the past. They say he's either too fast or has a penchant for finding trouble. He was found by Martha and Jonathan Kent on the day of the Meteor Shower, and subsequently adopted. Clark's friend Lex Luthor, the only heir of Luthorcorp, has been secretly investigating grounds for Clark's outlandish valor. However, on the face of it, Clark just seems a normal boy who's slightly more secretive than usual. Written by Abhinav Madaan Dragon Ball Super: Doragon bôru cho Dragon Ball Super: Doragon bôru cho With Majin Boo defeated half-a-year prior, peace returns to Earth, where Son Goku (now a radish farmer) and his friends now live peaceful lives. However, a new threat appears in the form of Beerus, the God of Destruction. Considered the most terrifying being in the entire universe, Beerus is eager to fight the legendary warrior seen in a prophecy foretold decades ago known as the Super Saiyan God. The series retells the events from the two Dragon Ball Z films, Battle of Gods and Resurrection 'F' before proceeding to an original story about the exploration of alternate universes. Written by ForLand HuCy Marvel's The Defenders follows Daredevil, Jessica Jones, Luke Cage and Iron Fist. A quartet of singular heroes with one common goal - to save New York City. This is the story of four solitary figures, burdened with their own personal challenges, who realize they just might be stronger when teamed together. The Doctor, from a race called the Time Lords whose home planet is Gallifrey, travels through time and space in his ship the TARDIS (an acronym for Time and Relative Dimensions In Space) with numerous companions. From time to time he regenerates into a new form (which is how the show has been running since 1963). In the version that is shown on YTV in Canada, the story begins mid-way through the Dragon Ball Z series. Raditz, Goku's brother has traveled to Earth to find out why Goku has not yet destroyed the planet as he was supposed to do. But while as a baby, Goku was dropped (down a huge cliff) and forgot his real mission. Kakarot, Goku's real name battles his brother Raditzs along with former enemy Piccolo and friend Krillin. Meanwhile, Gohan; Goku's son reveals his hidden powers against Raditz and nearly kills Raditz. However Goku is killed in the end, but Raditz is eventually defeated by Piccolo. Before he dies, he tells them that two evil Saiyans even more powerful then he is, are on route to Earth. The remaining fighters, Krillin, Yamcha, Tien, and Chiaotzu begin their training to battle the evil Saiyans, while Piccolo takes off with Gohan to train him in using his new found power. Meanwhile, Goku has to make his way back on Snake Way to King Kai's where he trains himself in the secret ... Written by dreamian Follows the story of Claire Randall, a married combat nurse from 1945 who is mysteriously swept back in time to 1743, where she is immediately thrown into an unknown world where her life is threatened. When she is forced to marry Jamie Fraser, a chivalrous and romantic young Scottish warrior, a passionate relationship is ignited that tears Claire's heart between two vastly different men in two irreconcilable lives. Written by Starz Naval Destroyer Nathan James is sent on what they're told is a research mission in the Arctic. Accompanying them is scientist, Rachel Scott. After a few months in the Arctic while Scott is on the ice doing research, some men attack them. They get back to the ship and the Commander, Tom Chandler asks the doctor what's going on. She says that a deadly disease broke out a few months ago. At first, they thought it was contained but they had no cure. They felt that the cure was in the Arctic which why she's here. But she has since received word that it has now spread to most of the globe. Chandler tries to call the President but learns the President and Vice President are dead and the US government might not have long to survive. The current President tells him that the Nathan James was not in the hot zone so he and his crew are OK. But now it's up to them to safeguard Scott because she holds the key to the planet's survival. But there are those who want the cure too and they will do ... Written by [email protected] Fmovies – Free Movies WatchFree.to – Watch Free Sockshare – Putlocker Cinema Movies Subscribe to 123Movies (AKA GoMovies ) mailing list to receive updates on movies, tv-series and news Copyright © 123Movies. to TVStreamCMS & GoMovies"
  ]
}