{
  "company": "www.smilart.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 21
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5555555555555556,
    "framing_surveillance": 0.1111111111111111,
    "framing_market": 0.3333333333333333,
    "num_docs": 21
  },
  "topic_timeline": {
    "20": {
      "0": 21
    }
  },
  "sample_docs": [
    "About us Smilart at a glance Becoming the world's premier facial recognition platform vendor is a culmination of our history and its creators Company Contact Us Smilart at a glance Solutions Smilart for any industry From security to workforce management and from services to data, endless applications at the flip of a switch creators Overview Detection Identification Verification How it works Smilart for any industry Partners Smilart grows through an ecosystem An essential key to our success is trust and collaboration with leading innovators from around the world Become a partner Technology partners Channel partners Smilart grows through an ecosystem Want to work with us? Become a part of Smilart and let's grow together Contact us and talk with a Smilart specialist who will answer your questions WANT TO KNOW MORE? Download and read our brochure to about our solutions",
    "About us Smilart at a glance Becoming the world's premier facial recognition platform vendor is a culmination of our history and its creators Company Contact Us Smilart at a glance Solutions Smilart for any industry From security to workforce management and from services to data, endless applications at the flip of a switch creators Overview Detection Identification Verification How it works Smilart for any industry Partners Smilart grows through an ecosystem An essential key to our success is trust and collaboration with leading innovators from around the world Become a partner Technology partners Channel partners Smilart grows through an ecosystem Hospitalstraße 35 Stuttgart, Germany 70174 Want to work with us? Become a part of Smilart and let's grow together Contact us and talk with a Smilart specialist who will answer your questions WANT TO KNOW MORE? Download and read our brochure to about our solutions",
    "About us Smilart at a glance Becoming the world's premier facial recognition platform vendor is a culmination of our history and its creators Company Contact Us Smilart at a glance Solutions Smilart for any industry From security to workforce management and from services to data, endless applications at the flip of a switch creators Overview Detection Identification Verification How it works Smilart for any industry Partners Smilart grows through an ecosystem An essential key to our success is trust and collaboration with leading innovators from around the world Become a partner Technology partners Channel partners Smilart grows through an ecosystem (College Of Communications No. 54) (Moscow State University of Railway Engineering) \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system instead of RFID badges. When we interviewed them, they provided the following reasons: It works faster than the badges, you cannot forget your face at home, and it's easier to look into the camera than it is to go looking for the badge in your bag.†SMILART IS TRUSTED BY CUSTOMERS WHO DEMAND EXCELLENCE With terror alert levels at an all-time high as well as other ongoing security threats, one of the world's largest international airports needed a high-tech update to its means for screening passengers. The major obstacle for them was a limited budget against a federal mandate coupled with an obligation to its passengers. The challenge posed to Smilart was how to help the customer save money and also move them to a much higher level of confidence and security. The answer was simple. Once our solution was installed and working optimally in real-time, the congestion through the screening line virtually disappeared, even during their traditionally busiest peak travel times. Operating at optimal effectiveness, we are proud to say that the customer reported an unparalleled record of success in suspect detection, but our technology also meant that passengers were screened faster and foot traffic flowed without incident. Not only did our solution immediately help Sheremetyevo achieve one of the highest rankings in safety and security for airport screening, it also had a major positive impact on the airport's bottom line. Since our solution did the job of several and did so with far greater efficacy, there was no longer a need to have as many on duty security personnel. Accordingly, we have been told that the Smilart system works beautifully and continues to perform without incident. By trusting Smilart the customer accomplished more with less and ended up saving money in the process. \"We have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements. Overall, we have been able to cut costs significantly. The results have been outstanding! We recommend Smilart's software to any airport looking to advance their security infrastructure.†WE WORK WITH ANY INDUSTRY Here are just a few more examples of valued customers that trust Smilart: Smilart's identification surveillance systems operate in 5 busy central railway stations: Central Station, Tver, Russia Central Station, Samara, Russia Central Station, Vologda, Russia Smilart ensures safety by monitoring access into and out of maximum security facilities: State penitentiary in Ivanovo, Russia Mozhaysk Correctional in Mozhaysk, Russia 3 prisons in Krasnoyarsk, Russia Right at this moment Smilart's solutions are keeping a close eye out for wanted persons in 8 metro subway platforms across Moscow HOW CAN WE BE OF SERVICE? Whether you are the end-user, security systems integrator, reseller, OEM, or just about anyone at all, below is a sample of who Smilart can help become more successful. Integrators, resellers and OEMs, please contact us to discuss volume business and partnerships. And so many more... Let Smilart be your go-to provider of tommorow's technology, attainable today! Want to work with us? Become a part of Smilart and let's grow together Contact us and talk with a Smilart specialist who will answer your questions WANT TO KNOW MORE? Download and read our brochure to about our solutions",
    "About us Smilart at a glance Becoming the world's premier facial recognition platform vendor is a culmination of our history and its creators Company Contact Us Smilart at a glance Solutions Smilart for any industry From security to workforce management and from services to data, endless applications at the flip of a switch creators Overview Detection Identification Verification How it works Smilart for any industry Partners Smilart grows through an ecosystem An essential key to our success is trust and collaboration with leading innovators from around the world Become a partner Technology partners Channel partners Smilart grows through an ecosystem LET'S FACE IT In an ever changing world where security and technology go hand-in-hand and costs have to be cut, businesses are faced with tough propositions in order to change with it. Say hello to Smilart Facial Recognition. In an ever changing world where security and technology go hand-in-hand and costs have to be cut, businesses are faced with tough propositions in order to change with it. Say hello to Smilart Facial Recognition. TAKE OFF Airport security is just one of countless applications for Smilart Identification. Safe travels! \"Since we installed Smilart's facial recognition software… we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.†Airport security is just one of countless applications for Smilart Identification. Safe travels! \"Since we installed Smilart's facial recognition software… we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.†CLASS IS IN SESSION With Smilart, students and faculty are always accounted for in real time. \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system.†CLASS IS IN SESSION With Smilart, students and faculty are always accounted for in real time. \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system.†SAY CHEESE And save some cheddar! \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" And save some cheddar! \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" CUSTOMIZED SOLUTIONS One size does not fit all. Smilart facial recognition is made to achieve YOUR goals One size does not fit all. Smilart facial recognition is made to achieve YOUR goals How can facial recognition help your business? Prevent theft and fraud No more lost, stolen, or handed off keycards Compile, monitor & control customer information, visitors or workforce We are facial recognition systems Our customers deal with a multitude of issues and face extremely complicated tasks each and every day, especially when it comes to the safety and security of their employees, customers and facilities. These environments leave no room for error and require utmost efficacy, razor sharp precision, and not to mention, consistency. With the flip of a switch, we provide all that and more. Simlart gives everyone the tools they need and the trust they expect to know that everything simply works as it is supposed to. We do this by linking everything back to detection, identification and verification of faces and objects through biometric facial recognition technology, which provides certainty that the information being received is indicative of the actions being performed in front of the camera. Our technology helps our customers manage and monitor the activities of the persons they are responsible for and ensures that every single one is safe and secure, while the organization stays informed and in control at all times. Detection, identification, and verification solutions that secure, measure, certify, manage, report, perform, and just do what they're supposed to do, while making good financial and technological sense doing it. These are just some of the things Smilart is offering customers across a wide range of industries. Overview Detection Identification Verification How it works We love our customers and are very proud to work with a broad range of some of the world's most unique and amazing organizations in helping them achieve their goals and modernize not only their technological efficiency, but their entire operational effectiveness by helping them work safer, faster and lowering their spending to get there, regardless of their sector and focus. \"Since we installed Smilart's facial recognition software we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.\" Director of Customs Enforcement & Security (JSC Sheremetyevo International Airport) \"Since we installed Smilart's facial recognition software we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.\" \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system\" College Director (Moscow College of Communications No. 54) \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system\" \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" CEO (Mamba.ru) \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" Want to work with us? Become a part of Smilart and let's grow together Contact us and talk with a Smilart specialist who will answer your questions WANT TO KNOW MORE? Download and read our brochure to about our solutions",
    "About us Smilart at a glance Becoming the world's premier facial recognition platform vendor is a culmination of our history and its creators Company Leadership team Contact Us Smilart at a glance Solutions Smilart for any industry From security to workforce management and from services to data, endless applications at the flip of a switch creators Overview Detection Identification Verification How it works Smilart for any industry Partners Smilart grows through an ecosystem An essential key to our success is trust and collaboration with leading innovators from around the world Become a partner Technology partners Channel partners Smilart grows through an ecosystem Events & Press See what we're up to Smilart is frequently asked to provide thought leadership and our team can be found around the world. We'd love to meet you! Events In the press See what we're up to LET'S FACE IT In an ever changing world where security and technology go hand-in-hand and costs have to be cut, businesses are faced with tough propositions in order to change with it. Say hello to Smilart Facial Recognition. In an ever changing world where security and technology go hand-in-hand and costs have to be cut, businesses are faced with tough propositions in order to change with it. Say hello to Smilart Facial Recognition. TAKE OFF Airport security is just one of countless applications for Smilart Identification. Safe travels! \"Since we installed Smilart's facial recognition software… we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.†Airport security is just one of countless applications for Smilart Identification. Safe travels! \"Since we installed Smilart's facial recognition software… we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.†CLASS IS IN SESSION With Smilart, students and faculty are always accounted for in real time. \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system.†CLASS IS IN SESSION With Smilart, students and faculty are always accounted for in real time. \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system.†SAY CHEESE And save some cheddar! \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" And save some cheddar! \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" CUSTOMIZED SOLUTIONS One size does not fit all. Smilart facial recognition is made to achieve YOUR goals One size does not fit all. Smilart facial recognition is made to achieve YOUR goals How can facial recognition help your business? Prevent theft and fraud No more lost, stolen, or handed off keycards Compile, monitor & control customer information, visitors or workforce We are facial recognition systems Our customers deal with a multitude of issues and face extremely complicated tasks each and every day, especially when it comes to the safety and security of their employees, customers and facilities. These environments leave no room for error and require utmost efficacy, razor sharp precision, and not to mention, consistency. With the flip of a switch, we provide all that and more. Simlart gives everyone the tools they need and the trust they expect to know that everything simply works as it is supposed to. We do this by linking everything back to detection, identification and verification of faces and objects through biometric facial recognition technology, which provides certainty that the information being received is indicative of the actions being performed in front of the camera. Our technology helps our customers manage and monitor the activities of the persons they are responsible for and ensures that every single one is safe and secure, while the organization stays informed and in control at all times. Detection, identification, and verification solutions that secure, measure, certify, manage, report, perform, and just do what they're supposed to do, while making good financial and technological sense doing it. These are just some of the things Smilart is offering customers across a wide range of industries. Overview Detection Identification Verification How it works We love our customers and are very proud to work with a broad range of some of the world's most unique and amazing organizations in helping them achieve their goals and modernize not only their technological efficiency, but their entire operational effectiveness by helping them work safer, faster and lowering their spending to get there, regardless of their sector and focus. \"Since we installed Smilart's facial recognition software we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.\" Director of Customs Enforcement & Security (JSC Sheremetyevo International Airport) \"Since we installed Smilart's facial recognition software we have been able to identify and catch smugglers at a much higher rate than before and with far greater effectiveness, and all with less on-duty staff requirements.\" \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system\" College Director (Moscow College of Communications No. 54) \"91% of our enrolled students, teaching staff and other employees, after having been given the option, preferred to use the Smilart face recognition system\" \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" CEO (Mamba.ru) \"We use Smilart's detection software to determine if our subscribers are providing real images of themselves. It works flawlessly!\" Want to work with us? Become a part of Smilart and let's grow together Contact us and talk with a Smilart specialist who will answer your questions WANT TO KNOW MORE? Download and read our brochure to about our solutions"
  ]
}