{
  "company": "www.mapillary.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 5,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 1.0,
    "framing_surveillance": 0.0,
    "framing_market": 0.0,
    "num_docs": 6
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 5
    }
  },
  "sample_docs": [
    "Map data at scale from street-level imagery Images from all over the world processed with computer vision. Mapillary helps create better maps for smarter cities, geospatial services, and automotive. Make up-to-date maps faster and more efficiently Create your own street-level imagery Extract map data automatically with computer vision Collaborate with others to capture imagery and generate map data Access fresh data from a global contributor network Integrate imagery into any app, tool, or web page Accelerate your workflows with automatically extracted map data Start sharing images and accessing map data",
    "Mapillary is powered by world-class computer vision 3D reconstruction and semantic segmentation connect images and extract map data at scale for smart cities, geospatial services, and autonomous vehicles. What we do with computer vision We'd be happy to tell you more about our technology and how it works in our products.",
    "Mapillary Driver for iOS v 1.0.4 Fixed some parts of the UI that didn't look correct in iOS 13 dark mode. Fixed bug where task overlay was drawn over the line. Fixed bug where non-marketplace projects would show payment information. Fixed bug where tapping \"Cancel\" in the project selector after initial sign-in would crash the app. The app now takes a photo every 15 degrees when turning (was 30 degrees before). Sequences are not split at task boundary anymore, creating a visually more appealing line. Get the app on App Store. Mapillary for iOS v 4.16.1 Fixed camera view not being usable in iOS 13. Fixed general UI bugs visible in iOS 13 dark mode. Get the app on App Store. Mapillary for iOS 4.15 Beta release of achievements. See release blog post for further details. Fix for lagging map in camera view. Get the app on App Store. Mapillary JOSM plugin 1.5.20 Support for importing panorama image, with metadata XML attribute ProjectionType = equirectangular Fix that hides a traffic sign when its icon is unknown (avoiding many unusable green question mark icons) Fix for pagination issue resulting in incomplete traffic signs display Mapillary now added as a source for the OSM changeset when clicking on \"Obtain from current layers\" Learn how to use the Mapillary plugin on JOSM. Mapillary for Drivers for Android 0.9.5 Added a fix to display payment information only for paid projects Added a fix for when camera errors prevented the app from capturing and capture traces were missing Get the app on Google Play. Mapillary for iOS 4.15 Fixed bug where the image would not be displayed when a sequence wasn't fully processed (Structure from Motion not done) Fixed bug where certain panoramas were not displayed correctly Fixed bug where screen lock was not properly enabled after upload Fixed bug where where \"Open in app\" would not launch the app correctly Get the app on App Store. Mapillary JOSM plugin 1.5.19 Added Japanese as a language option (contributed by a community member) Added a fix to make changing image location possible again Learn how to use the Mapillary plugin on JOSM. Mapillary for iOS 4.15 Fixed bug where the image would not be displayed when a sequence wasn't fully processed Fixed bug where certain panoramas were not displayed correctly Fixed bug where screen lock was not properly enabled after upload Fixed bug where where \"Open in app\" would not launch the app correctly Mapillary JOSM plugin v1.5.19 Fix: changing an image location is possible again Mapillary Platform: Verification Projects 2.0 Major update to verification projects, including: Introducing a new task type: \"spotting missed objects\" (determining true vs false negatives) Updated admin interface, including project progress bars More details in our release blog post . Mapillary for iOS 4.14 New, simpler camera screen to make it easier to get started Advanced screen for experienced users, providing capture session stats and options New notifications for Marketplace listings near you Get the app on App Store. Mapillary REST API documentation updates Updated and improved API documentation . Added organization-related docs, for example how to filter images by organizations. Added tile URL parameter to spatial data resources. When tile={z}/{x}/{y} is supplied, the spatial data will be returned as vector tiles. Added requisites to access map features/object detections. Added links to our help center which contains additional information and context. Fixed the wrong description of last_seen_at and first_seen_at in /v3/map_features. Added a simple description of the relation between resources, for example: one image has one user; one sequence has many images, and so on. Removed deprecated APIs and properties. Fixed the wrong description of last_seen_at and first_seen_at in /v3/map_features. Added a simple description of the relation between resources, for example: one image has one user; one sequence has many images, and so on. Removed deprecated APIs and properties. Fix videos captured with BlackVue firmware on a different language than English Upgrade embedded Mapillary tools to the latest version Web app: image options menu More visibility to links for opening iD editor or JOSM to use the current image for editing OpenStreetMap Links now open with the Mapillary layer active in the editor Mapillary for iOS 4.13.3 Fixes for compass bug Fixed bug where \"mapillary://\" links would not open if app was running Fixed bug where transferred images from external cameras could end up in existing sequences instead of creating new ones Fixed crash that could happen in the map view when trying to center on user location before it was available Get the app on App Store. Mapillary for Drivers for iOS 1.0.3 More fixes for compass angle issues Get the app on App Store. Mapillary Web and Mobile Apps Consolidated upload notifications: we reduced the amount of notifications of type \"Your Mapillary images are now published\" by sending one message per day at most. Mapillary for Android 3.155 Crash fixes for explore screen and upload stability fixes Mapillary for Android 3.154 Crash fixes for explore screen Get the app on Google Play Mapillary for iOS 4.13.2 Fixes for compass angle (will only affect new sequences) Improved messaging when uploaded, it now shows how many were successfully uploaded Fixed crash when selecting an image from the map in the thumbnail view Get the app on App Store. Mapillary for Drivers for iOS 1.0.2 Fix for compass angle issues Get the app on App Store. Mapillary for Drivers for Android 0.9.3 Added support for capture outside of task areas (controlled in the web app for capture projects) Rig mode is now controlled in the web app for capture projects Eligible base maps are now controlled in the web app for capture projects Get the app on Google Play. Mapillary for Drivers for iOS 1.0.1 Fixed issue where the decline button was not visible when accepting/declining a task Get the app on App Store. Web app: Updated Capture Projects; and Mapillary for Drivers on iOS 1.0 An update for Capture Projects comes with changes and new features both in the Web App and in the accompanying Mapillary for Drivers on iOS. In particular this release lets the administrator of the capture project configure project behavior, which is then reflected in the mobile app. This means fewer settings can or need to be controlled by the driver. Added support for capture outside of task areas (defined by project-wide setting in web app). Multi-camera rig mode can now be configured from the web app for the project. Eligible base maps accessible in the mobile app for drivers can now be configured from the web app for the project. Drivers now have the option to cancel when changing projects in the dribvers mobile app. UI updates and refinements across the app. The compass is no longer used for bearing calculations because of the metal carcass of the car is affecting the compass values. Fixed bug where you would be locked out when changing projects without Internet access. Fixed task log sorting. Mapillary for iOS 4.13.1 fixed OSM login bug Get the app on App Store. Mapillary for Android 3.153 min OS supported version Android version is Android 6. Users running Android 4 and 5 can continue using 3.152. Get the app on Google Play Mapillary for Android 3.152 Bugfixes for Marketplace/Explore tab that were crashing the app if location permission was not granted. Bugfix for crash when feed item notification was deep linked into the app. Get the app on Google Play Mapillary for iOS 4.13 fixed bug where \"fast mode\" was incorrectly detected at 1 m/s, it's now using the correct value of 5 m/s fixed bug where the compass angle would be 90 degrees wrong Get the app on App Store. Mapillary for Android 3.151 Mapillary marketplace is now available in our Android app - browse capture and verification projects right on your phone. Updated structure and navigation: feed items were moved into profile and added explore as main tab. Get the app on Google Play Mapillary for iOS 4.12 Fixed bug where compass override was not working properly. When you are moving fast, for instance when capturing in a car, we don't use the compass and use the GPS locations instead to calculate the bearing. We do this because the metal encasing of the car etc mess with the compass. Fixed bug where compass angle in image review was 90 degrees wrong Fixed bug where manual camera offset override was not properly stored in the sequence Fixed bug where the Mapillary sequences viewer (MJS) could crash due to low memory and thus just show a black screen Get the app on App Store. Mapillary for iOS 4.11 updated street scene viewer to latest version with Blackvue camera support fixed bug where no/old coverage notifications were sent too often fixed bug where capture would not resume if app was put to the background and then back to the foreground fixed bug where some views would be cut off at the top in the external camera views fixed bug where send button was not visible when writing comments on big screen devices fixed crash when trying to open a mapillary:// link when the app was not running fixed bug where map would not center correctly in Marketplace fixed bug where error message was not shown when creating an account with email/username that already existed Get the app on App Store. Verification projects now have a \"unsure\" button, instead of a \"skip\" button. This means the voting options are now: yes,no,unsure. Mapillary for iOS 4.10 Mapillary marketplace is now available in iOS - browse capture and verification projects right on your phone. Added support for Ricoh Theta V and OSC v 2.1 Fixed bug with Mapillary links not opening correctly in the app Fixed bug with where opening push notifications could crash the app Fixed \"missing coverage\" notifications: you will now get again notifications of old or missing coverage in your area (if you opted in). Get the app on App Store. Mapillary for Drivers for Android 0.9.1 Added payment info for drivers that work on Marketplace projects Bug fix for Android 7 users that were not able to capture Bug fix for sparse capture Get the app on Google Play. Mapillary BlackVue dashcam and Desktop Uploader 1.2 Blackvue DR900s Mapillary Edition with custom firmware for mapping Desktop Uploader 1.2 which supports direct upload of Blackvue dashcam videos Read more on our blog. Mapillary web app: Mapillary Marketplace The Mapillary Marketplace connects supply and demand for image capture and data verification. Read more on our blog. Mapillary for iOS 4.9.5 Fixes bug where capturing with time-based capture would result in many \"long sequence\" warnings and cut the sequence Get the app on App Store. Mapillary for Drivers for iOS 0.9.5 Added support for irregularly shaped tasks Added support for the Marketplace and payments Fixed bug where task activity would sometimes not load correctly Get the app on App Store. OSM iD editor Mapillary integration The latest update of the OpenStreetMap iD editor comes with some improvements for the Mapillary integration: Users can now filter for Mapillary 360° images only iD #5433 Changesets now include source=mapillary iD #6279 Move photo overlay controls to their own section within the Map Data pane iD #5913 Mapillary for Drivers for Android The Mapillary for Drivers app is now also available on Android , meaning that drivers for Capture Projects can use Android devices for tracking progress and capturing imagery. Mapillary web app: Verification Projects 1.1 Keyboard shortcuts for verifications on desktop browsers Class name is shown in addition to icons also for traffic signs URL allows to refer to specific detection for debugging and sharing Click on detection opens full image to allow seeing detection in scene context Restructured project sidebar and additional UI improvements Mapillary for iOS 4.9.4 Fixed bug where credentials sometimes were not saved correctly after signing in Get the app on App Store. Mapillary for iOS 4.9.3 Fixed bug where when stopping upload in thumbnail view, the view was not reloaded properly and had gaps where the images have been uploaded Fixed bug where capture time setting would show as 0 instead of 0.5 Fixed bug where sequences in profile view could end up in the wrong month Get the app on App Store. Mapillary for iOS 4.9.2 Added support for faster capture rates (max 3 images/s) Fixed bug where a long gap between captures would result in a 1-image sequence Fixed bug where capture button would be displaced on big-screen devices Fixed bug where username was not displayed in profile view Get the app on App Store. Mapillary for Drivers for iOS 0.9.4 Added setting for disabling voice announcements Updates to external camera capture Fixed bug where captures would occur in pairs of two Get the app on App Store. Mapillary for iOS 4.9.1 Fixed crash in profile view that could occur if you were using 12h clock Fixed crash that could occur when reviewing images Fixed double capture that would occur if turning fast Fixed crash that occurred if you tried to contact support via email but didn't have email configured on your device Fixed so that \"Pending images\" in the feed isn't clickable Fixed crash that could occur when tapping on a location in thumbnail view Fixed crash that would occur when resetting password Fixed bug where long strings in Settings view could \"push out\" the toggle button outside of the view Optimized data loading when navigating between the thumbnail view and the review view Get the app on App Store. Mapillary web app: combined panning and updated compass indicator We enhanced the Mapillary viewer with the Combined Panning feature that lets you pan between overlapping regular images just like you would do with a full panorama, simply by dragging with your mouse. This release also brings an updated compass indicator. Read more on our blog. New features and improvements Improved compass indicator including the possible field of view Automatic scaling of zoom and compass elements Viewer handles zero-sized element correctly Mapillary for iOS 4.9 Now uses the Mapillary open-source SDK for the core capture functionality Much faster image processing (adding the EXIF before uploading) Faster uploading of images (using the AWS SDK) Better positioning of images captured with external cameras (you can now synchronize images and positions manually before you upload) Manually set exposure point is now displayed in the camera UI Added the ability to skip to next/prev image when reviewing; just tap on the right/left side of the image instead of swiping Altitude information is now added to image_detections Fixed bugs related to transferring images from external cameras Fixed bug where the power saving feature could lower the screen brightness even if the setting was disabled Fixed bug where magnetic and true north in EXIF were using the same value Get the app on App Store. Mapillary Command Line Tools 0.5.0 Added command to upload Blackvue DR900S videos directly to Mapillary Added download of images selected by image key Allow GPX files without altitude data More robust support of irregular time formats in EXIF Add argument to skip subfolders to all commands More robust support for filenames including irregular characters on different platforms Improve error information display Fixed bug where orientation was ignored if it was 0 With Verification Projects, map makers and GIS experts can review machine-extracted map data by adding human validation to the workflow. Comprising a project dashboard and a simple game-based tool for verifying object detections, Verification Projects enable quality assurance of the data available in any area, as well as help to improve Mapillary's machine learning algorithms with human feedback. Read more on our blog. Mapillary for Drivers iOS App 0.9.3 Added native iPad support Updated the Mapillary base map Inverted the 2D/3D button icon Fixed bug where the map could get stuck in 3D if the capture was started and stopped right away UI fixes for big screen devices (iPhone X etc) Get the app on App Store. Mapillary iOS App 4.8.21 Removed the \"Featured\" feed Improved the form when flagging images due to violations Fixed a bug in the Turkish translation that would cause the app to crash Fixed a bug where IS was not possible to disable on iPhones running a newer iOS version Fixed a bug where the edit image menu was partly hidden on devices with tall screens Get the app on App Store. Mapillary Desktop Uploader 1.1 for macOS and Windows Uploading thousands of images got even easier with the latest release of the Mapillary Desktop Uploader, which adds functionality for previewing images and managing your upload history. Spend less time handling your uploads and more time improving maps. Download the Desktop Uploader. Added combined panning for perspective and fisheye images where applicable. Combined panning lets you pan between overlapping regular images just like you would do with a full panorama, simply by dragging with your mouse. Mapillary for Drivers iOS 0.9.2 Fixed a problem where the GPS position could snap incorrectly to roads on some occasions Fixed bug where timestamp in EXIF was saved in local timezone instead of UTC Get the app on App Store. Mapillary for Drivers iOS 0.9.1 Fixed crash that could happen when stopping upload when processing hasn't finished Fixed UI issue for large screen devices in activity view Fixed the issue where an alert could block another alert in these cases: user is removed from the project, accept/decline/submit failed Fixed bug where it would say \"0/9\" for a short while when starting upload Get the app on App Store. With the help of Capture Projects, organizations can manage a team of drivers to capture street-level imagery in an area. Capture Projects consists of a project dashboard on the Mapillary web app and a new mobile app, called Mapillary for Drivers. Read the announcement. Mapillary for Android v3.147 Regex API checks for username and password at signup Fixes the internet connection issues that the users have noticed on Android 9 Map displays as it should on Android 4, 5, and 6. Get the app on Google Play. Mapillary web app: improved icon set for point features on the map Update to our iconography for Point Features , improving 24 icons out of 36 in total. This release brings support for fisheye projection. Mapillary web app: new map styles, more image settings New map styles: it's now possible to use the basemap styles \"Mapbox Light\" and \"Mapillary Streets\" (our internal style that is currently in beta). Improved image details with camera make and model as well as image resolution Signup and login forms and validation now better optimized for mobile screens Added a \"3D display settings\" option where you can turn on and off navigation transitions. Update to map features with 42 object classes added 42 new types of map features are now extracted from street-level imagery and automatically positioned onto the map, ranging from utility poles and streetlights to mailboxes and manholes. Read the announcement. Tag fill for outline detection polygons shown in panoramas: this means that we can render computer vision segmentations with fill and have the same hover functionality as in regular images also for panoramas. Mapillary Command Line Tools 0.4.0 Improved processing of Blackvue videos with embedded GPS data Added features for process_csv command More options for storing local image file path Improved and added features for post_process command Argument --video_import_path can be single video or a directory of videos Duplicate flagging is now done automatically with the default duplicate thresholds. To keep duplicates, argument --keep_duplicates must be passed. Store username in case authenticating manually Mapillary web app: improved manual blurring process and interface We have refreshed our manual privacy blur interface. about how to access and use it. Mapillary Desktop Uploader v1.0 for macOS and Windows The Desktop Uploader is a new application that lets you upload thousands of geotagged images with little time and effort. Read the announcement.",
    "To better serve the Mapillary community, promote transparency, and minimize disputes, we have prepared these of Use. We wish to clearly set out our rights and your rights, in furtherance of building a strong Mapillary community. We would like to assure the community that nothing in these requires transfer of your ownership of photos taken with the Mapillary App, and that photos contributed to and by the Mapillary community are made publicly available by us in accordance with these . Your acceptance of these is required in order for you to access and use the Mapillary Solution. By registering with Mapillary, or by using the Mapillary Solution in whole or in part, you are entering into a legally binding agreement with us. Please read these carefully. If you do not agree to these , you cannot use the Mapillary Solution. We reserve the right at our discretion to propose modifications to these periodically. We will notify you of such changes via an email sent to the email address we have on file for you or via other notification mechanisms. Your continued use of and access to the Mapillary Solution after notice of such modifications indicates your acceptance of and agreement to the modified . If you violate any of these , your permission to use the Mapillary Solution automatically terminates, unless such violation is waived by us in writing in our sole discretion. You acknowledge that use of the Mapillary Solution requires connection to, and data transfers over, the network and therefore may impact your data usage charges imposed by your wireless operator or other service provider. It is your responsibility to obtain at your cost all equipment, software and internet access necessary to use the Mapillary Solution. \"App\": the Mapillary smartphone application available for download on third party application stores such as iTunes and Google Play. \"Capture Projects\": the Services described in Section 1.5 when you capture Content on behalf of an Organization. \"Commercial Use\": any commercial or data enhancement activity, including: (a) charging for access to the Service or Content or for the Service's functionality or data directly or indirectly; (b) utilizing the Service in any commercial website or application or in support of any commercial for-profit activity, or in support of the operations of any for-profit business; (c) using Content to improve any product, service, website, application, software, dataset, solution, or technology, (d) utilizing the Service as a private repository; or (e) emulating or framing the Service and passing it off as your own. \"Content\": images, maps, photos, video, audio, documents, edits, variations, layers, messages, polls, queries, posts, comments, signals, votes, ratings, rankings, and any other text, content, information or data, including Metadata, created, derived from or accessible via use of the Mapillary Solution, or otherwise made available by and to Mapillary Users, including any of the foregoing provided by a Mapillary User or by us. \"Mapillary\": Mapillary AB, a corporation organized under the laws of Sweden. In these , Mapillary is referred to by \"us\", \"we\" or \"our\", as applicable. \"Mapillary Solution\": the App, the Site and the Services. \"Mapillary User\": you and any other user of the Mapillary Solution. \"Metadata\": data and information associated with or related to Content, including numerical latitude or longitude or similar coordinates, imagery, data derived from within images (such as without limitation street signs, landmarks, building names, etc.), and data generated by the capture of images (such as without limitation geolocation, time and date, network and system information, etc.). \"Non-Commercial Use\": any activity that is not Commercial Use, including personal, individualized use by a single person, and the use of a reasonable number of widgets in websites displaying Mapillary Content as an ancillary, and not as a primary, feature in accordance with our Developer Usage Policy . You may ask us whether a certain use is Non-Commercial Use via email sent to hello@mapillary.com. \"Organization\": any entity or individual who has registered as an Organization when using the Mapillary Solution. \"Services\": the services, features, application programming interfaces (APIs), and functionality accessible via use of the Site and the App, including functionality for the provision, modification, display, and management of Content. \"Site\": Mapillary.com and any web pages that are a part of Mapillary.com. \" \": these of Use, the Developer Usage Policy, and the Mapillary , as may be modified from time to time. \"You\" or \"your\": the individual using the Mapillary Solution, or clicking \"accept\" or \"agree\" where indicated, and thereby becoming bound by these , and the company or other legal entity represented by such individual, or for whom such individual uses the Mapillary Solution, and all affiliates thereto. 1.0 ACCESS AND LICENSED RIGHTS 1.1 Mapillary Solution Access. Subject to your compliance with these , we hereby grant to you, solely for your own Non-Commercial Use: (a) access to the Mapillary Solution and (b) rights to Content displayed by us under license that we specify from time-to-time (the current outbound license are set forth in the Site's Legal Page ) (\"Outbound \"). Access and rights to the App are as set forth in the end user license made available on the App distribution site or service or that are contained with the of use/service applicable to such distribution sites or services. Breach of such license or the Outbound will result in automatic termination of your access to the Mapillary Solution and Content, unless waived by us in writing in our sole discretion. 1.2 Commercial Use. You may not use the Mapillary Solution for any Commercial Use except as separately agreed between us in a signed writing. Other than for your Non-Commercial Use, or as otherwise permitted by the Outbound , you may not use, sublicense, transfer, distribute, make derivative works of, or make available, the Service or Content. Such activity is not licensed or authorized under these and if undertaken may result in pursuit of all available remedies for intellectual property rights (including copyright infringement), the availability of which you hereby acknowledge. 1.3 Mapillary User Licenses to Us. You and each Mapillary User hereby grant to us the perpetual, irrevocable, worldwide, royalty-free, fully paid-up, sub-licensable, non-exclusive right and license to use, reproduce, modify, create derivative works of, perform, display and distribute without restriction (including via any medium) Content, in whole or in part, for commercial and non-commercial purposes, including (a) for purposes of providing, developing, improving, making available (including via public search engines), promoting and marketing the Mapillary Solution and (b) making available Mapillary User Content under the Outbound . Further, you agree that we are free to use and implement in perpetuity without compensation, attribution or obligation to you any feedback, benchmarks, requirements, suggestions, criticisms, improvements, recommendations, ideas, and error corrections provided by you to us relating to the Mapillary Solution. 1.4 Reservation of Rights. No other right or license to the Mapillary Solution or Content is provided, and no other license will be implied, by course of conduct or otherwise. We grant no right or license with respect to our patents. Each Mapillary User retains all right, title and interest in and to such Mapillary User's Content, and all associated intellectual property rights, subject to these . Subject to these , we retain all right, title and interest in and to the Mapillary Solution and our Content, and all associated intellectual property rights. Except as expressly authorized by these and the Outbound , you will not use, reproduce, or distribute Content not authored by you. The user interface, user experience, icons, presentation layer and elements, terminology, gamification, reports, layouts, and screen displays of or generated by the Mapillary Solution are our copyrightable content, our trade dress and our trademarks and service marks, and will not be reproduced, distributed, or displayed except for your internal use and not for external use or exploitation. 1.5 Capturing on behalf of Organization. If you capture Content on behalf of an Organization, both you and the Organization grant Mapillary a license in accordance with Section 1.3 above. We assume that there are agreements in place between you and the Organization that regulates the ownership of the Content and that you have the right to contribute the Content to Mapillary under these . 2.0 APPLICABLE TO CONTENT 2.1 Specific Prohibited Uses. You will not (a) use the Mapillary Solution in a manner that gives you or any other person access to mass downloads or bulk feeds of any Content, including Metadata; (b) delete, obscure, or in any manner alter any message, warning or link that appears in the Mapillary Solution or the Content; (c) use the Mapillary Solution or Content in whole or in part with any products, systems, or applications for or in connection with (i) real-time navigation or route guidance, including but not limited to turn-by-turn route guidance that is synchronized to the position of a user's sensor-enabled device; or (ii) any systems or functions for automatic or autonomous control of vehicle or device behavior; or (d) use the Mapillary Solution or Content to create a database of places or other local listings information, except as expressly permitted by us as described on the Site. 2.2 Handling of Your Content. The App temporarily stores your Content in a manner such that deletion or malfunction of the App or malfunction of the Device on which the App is installed may result in the permanent deletion of your Content. Content is not uploaded and stored on our servers until the Content is uploaded via the upload mechanism in the App. Once your Content is uploaded, all Content locally stored on your device is deleted permanently. We may at any time filter, alter, modify, crop, or delete such Content in whole or in part before making it available on the Site and via the Service in our sole discretion, including in order to render the Content suitable for use on the Mapillary Solution. We are under no obligation to publicly display Content that is posted to private repositories, or that is hidden by election of the contributing Mapillary User. You hereby waive any moral, neighboring or other rights you may have (including rights in the nature of attribution, integrity, privacy, paternity, and rights to object to derogatory treatment) in your Content that would otherwise preclude us from filtering, altering, deleting, or using, copying or distributing, in accordance with these , your Content. You acknowledge and agree that we may continue to store, display and otherwise exercise the rights set forth in section 1.3 above with respect to your Content even after termination, deactivation, or archiving of your account. 2.3 Propriety of Content. All Content, whether publicly posted on or privately transmitted within private groups, is the sole responsibility of the Mapillary User from which such Content originated. No Mapillary User will transmit Content or otherwise conduct or participate in any activities on or via the Mapillary Solution which, in our sole judgment, is likely to be prohibited by law, or is violative or in breach of third party rights in any applicable jurisdiction, including without limitation laws governing libel and defamation, encryption of software, the export of technology, the transmission of obscenity or the permissible uses of intellectual property. You represent and warrant that all Content you submit is accurate and not misleading to the best of your knowledge, is not confidential or privileged, and is not in violation of third party rights. We may, in our sole discretion, terminate the Services as to any Content that we believe in our sole judgment is not in compliance with these . We may preserve and disclose Content if required to do so by law or judicial or governmental mandate or as reasonably determined useful by us to protect the rights, property or safety of Mapillary, Mapillary Users and/or the public. 2.4 Prohibited Content. You agree not to upload, download, display, perform, transmit, or otherwise distribute any Content, or otherwise engage in any activity in connection with the Mapillary Solution, that: (a) is hateful, offensive, libelous, defamatory, obscene, abusive, pornographic, lewd, erroneous, stalking, or threatening; (b) depicts injured or severely sick people, or acts of violence; (c) advocates or encourages conduct that could constitute a criminal offense, give rise to civil liability, or otherwise violate any applicable local, state, national, or foreign law or regulation; (d) constitutes infringement of the intellectual property rights of any party, including rights to the use of name and likeness, or violation of a right of privacy; (e) creates an impression that is incorrect, misleading, or deceptive, including without limitation by impersonating others or by otherwise misrepresenting identity or affiliation with a person or entity; or (f) divulges other people's private or personally identifiable information without their express authorization and permission (for example pictures of people in private settings, such as in their homes). 2.5 Use of Content. Each Mapillary User, by using the Mapillary Solution, may be exposed to Content that is offensive, indecent, objectionable, illegal, infringing, false or erroneous. Each Mapillary User must evaluate, and will bear all risks associated with, the use of any Content, including any reliance on the quality, integrity, accuracy, completeness, or usefulness of such Content. We may refuse or delete any Content, including Content of which we become aware that fails to fulfill the purpose of the Services, is in breach of these , is otherwise contrary to law, or is otherwise inappropriate in our discretion. We do not guarantee the accuracy, integrity or quality of any Content. Under no circumstances will we be liable in any way for any Content, including, but not limited to, liability for any errors, inaccuracies, or omissions in any Content, or for any loss or damage of any kind incurred as a result of the use of any Content. We will have no obligation or liability to you or any Mapillary User to maintain, store, or license Content, protect and maintain Content owners' intellectual property rights, or to enforce these . You hereby waive and release any claims you may have against us arising or resulting from use or misuse of Content or your inability to effectively use Content, your failure to comply with these , or for any act, omission, or conduct of any Mapillary User. If you as a user of the Mapillary Solution, sees Content that you consider inappropriate in any way, please inform us and identify how the Content in question fails to comply with these by sending an e-mail to support@mapillary.com and we will look in to the issue and delete any Content found in our discretion to be in conflict with these . 2.6 Third Party Sites. The Mapillary Solution, Mapillary Users, or a third party may provide links to other websites or login access via such links. Such links will not be construed as an endorsement, sponsorship, or affiliation by us. We exercise no control over such other websites and web-based resources and are not responsible or liable for the availability thereof or the content, advertising, products or other materials thereon. We will not be responsible or liable, directly or indirectly, for any damage or loss incurred or suffered by any user in connection such other sites and resources. 3.1 Sign-On Credentials. When creating an account, you will receive or will be permitted to create or use existing online user name and password information (\"Sign-On Credentials\"), and are wholly responsible for maintaining the confidentiality thereof and wholly liable for all activities occurring under such Sign-On Credentials. You will not transfer to any party your Sign-On Credentials, or use the Sign-On Credentials of another, without our prior written consent. You will immediately notify us at hello@mapillary.com of any unauthorized use of Sign-On Credentials or any other breach of security. We will not be liable for any loss or damage arising from a Mapillary User's failure to comply with this section or from unauthorized use of the Sign-On Credentials. 3.2 Change of Username. We may require you, as a condition of membership, to change your username if we believe appropriate (such as when a trademark owner complains about a username that does not closely relate to a user's actual name). 4.1 Prohibited Uses. You will not use the Mapillary Solution in any manner that could damage, disable, overburden, or impair any Mapillary-controlled server, or the network(s) connected to any such server, or interfere with any other party's use and enjoyment of the Mapillary Solution, including without limitation falsifying or altering Content posted by others except via normal and intended operation of the Services. You may not attempt to gain unauthorized access to other accounts, computer systems or networks connected to any of our servers or to any of the Services, including through hacking, password mining or any other means, or exploit bugs or vulnerabilities in the Mapillary Solution. You are prohibited from violating or attempting to violate any security features of the Mapillary Solution, including, without limitation, (a) accessing Content not intended for you, or logging onto a server or account that you are not authorized to access; (b) attempting to probe, scan, or test the vulnerability of the Mapillary Solution, or any associated system or network, or to breach security or authentication measures without proper authorization; (c) interfering or attempting to interfere with Services to any Mapillary User, user, host, or network, including, without limitation, by means of submitting a virus to the Site or Service, overloading, \"flooding,\" \"spamming,\" \"mail bombing,\" or \"crashing\"; (d) using the Site or Service to send unsolicited email or messages, including, without limitation, promotions, or advertisements for products or services; (e) publishing or linking to malicious Content intended to damage or disrupt another Mapillary User's browser or computer or to compromise a Mapillary User's privacy or anonymity; (f) forging any TCP/IP packet header or any part of the header information in any email or in any posting; (g) accessing or tampering with non-public areas of the Site or Service, our computer systems, or the technical delivery systems of our providers; (h) accessing or searching or attempting to access or search the Mapillary Solution by any means (automated or otherwise) other than through the currently available, published interfaces that are provided by us (and only pursuant to these ), unless you have been specifically allowed to do so in a separate agreement with us; (i) deep-linking to the Site for any purpose (ie, posting a link to a Site web page other than the home page) except as otherwise expressly permitted by us on the Site; or (j) removing or obscuring any form of advertising or displayed via the Mapillary Solution. 4.2 No Harvesting or Crawling. You will not engage in harvesting or other collection of information about other Mapillary Users, including email addresses, without our prior and each such Mapillary User's prior written consent. You agree not to \"crawl\" the Mapillary Solution or use or launch any automated system, including without limitation, \"robots\", \"spiders\", etc. that accesses the Mapillary Solution or pulls Content therefrom (other than those used by public search engine providers for the sole purpose of creating publicly available searchable indices. You also acknowledge that the breach or circumvention of any technical obstacle implemented by us to prevent actions as set out above in itself is not allowed. 4.3 No Framing. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available through the Services on the Site. The Site and Services are for your Non-Commercial Use only, except as may otherwise be agreed by us in a separate signed writing. Without limiting the generality of the foregoing, you will not publish, distribute or transmit to the general public via any medium, whether via print, online, or otherwise, the Content (other than your own) or Services, except through the Site or as otherwise authorized by these or by us, you will not engage in \"framing,\" \"mirroring,\" or otherwise simulating the appearance or function of the Mapillary Solution, and you will not send messages purporting to be from us. You will not remove or attempt to obscure any copyright, trademark or other proprietary rights notices contained in or on the Site or associated with the Services, including ours and our licensors. 4.4 Account Data. While we will endeavor to back up Site and Service data and make such data available in the event of loss or deletion, we have no responsibility or liability for the deletion or failure to store any Content. You acknowledge and agree that your Content shall not be retrievable or accessible except via your authorized use of the Services and that we are under no obligation to compile and return to you your Content, including if Services terminate for any reason or if you elect to deactivate your account. We reserve the right to mark as \"inactive\" and archive accounts and/or streams, queries, projects, forums, discussions or similar interactions that are inactive for an extended period of time. Further, you acknowledge that we may monitor and collect information (including but not limited to technical and diagnostic information) about your usage of the Mapillary Solution in order to improve the Mapillary Solution and to verify compliance with these . 4.5 Notifications to Us. If you believe that you are entitled or obligated to act contrary to these under any mandatory or applicable law, you agree to provide us with detailed and substantiated explanation of your reasons in writing at least thirty days before you so act, to allow us to assess whether we may, at our sole discretion, provide an alternative remedy for the situation, though we are under no obligation to do so. 4.6 Notifications to You. For purposes of service messages and notices about the Services to you, we may place a banner notice across Site pages to alert you to certain changes such as modifications to these . Alternatively, notice may consist of an email from us to an email address associated with your account, even if we have other contact information. You also agree that we may communicate with you in relation to your account and otherwise in relation to these through your account or through other contact information you have provided to us, including email, mobile number, telephone, or delivery services including the postal service. You acknowledge and agree that we will have no liability associated with or arising from your failure to maintain accurate contact or other information, including, but not limited to, your failure to receive critical information about the Services. You agree that all agreements, notices, disclosures and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing. 4.7 Network Security Risks. Because no online system is perfectly secure or reliable, the internet is an inherently insecure medium, and the reliability of hosting services, internet intermediaries, your internet service provider, and other service providers cannot be assured, you accept security risks associated with or arising from your use of the Mapillary Solution, and the responsibility for choosing to use a technology that does not provide perfect security or reliability. 5.0 DISCLAIMER OF WARRANTIES, LIMITATION OF LIABILITY AND INDEMNIFICATION 5.1 Disclaimer. EACH MAPILLARY USER'S USE OF THE MAPILLARY SOLUTION AND CONTENT IS AT HIS OR HER SOLE RISK. THE MAPILLARY SOLUTION AND CONTENT IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS AND WE ASSUME NO RESPONSIBILITY FOR THE ACCURACY, CURRENCY, TIMELINESS, DELETION, MIS-DELIVERY OR FAILURE TO STORE OR DISPLAY ANY CONTENT, MAPILLARY USER COMMUNICATIONS, PERSONALIZATION SETTINGS, OR OTHER INFORMATION OR DATA. EACH MAPILLARY USER IS SOLELY RESPONSIBLE FOR ANY DAMAGE TO HIS OR HER COMPUTER SYSTEM AND WE WILL HAVE NO LIABILITY FOR ANY LOSS OF PROFIT, OPPORTUNITY, REVENUE, ADVANTAGE, INFORMATION OR DATA THAT RESULTS FROM USE OF THE MAPILLARY SOLUTION OR CONTENT. TO THE MAXIMUM EXTENT POSSIBLE UNDER APPLICABLE LAW, WE EXPRESSLY DISCLAIM ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT . Specifically, we make no warranty that (a) the Mapillary Solution or Content will meet your requirements, goals or needs, (b) Mapillary Solution or Content access will be uninterrupted, timely, secure or error-free, or (c) any errors or deficiencies in the Mapillary Solution or Content will be corrected. Further, scheduled and preventive maintenance, required and emergency maintenance work, or disruption of services from internet service and hosting providers, may interrupt the functioning of or access to the Mapillary Solution. 5.2 Liability Limitation. EXCLUDING ONLY DAMAGES ARISING OUT OF OUR LIABILITY FOR OUR FRAUD, DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE, OR ANY OTHER LOSS FOR WHICH WE CANNOT LAWFULLY EXCLUDE LIABILITY, WE WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR EXEMPLARY DAMAGES, INCLUDING BUT NOT LIMITED TO DAMAGES FOR LOSS OF REVENUE, PROFITS, GOODWILL, USE, DATA OR OTHER INTANGIBLE LOSSES (EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES), RESULTING FROM THE USE OF OR INABILITY TO USE THE MAPILLARY SOLUTION AND ANY CONTENT; THE COST OF PROCUREMENT OF SUBSTITUTE SERVICES; UNAUTHORIZED DISPLAY, ACCESS TO OR DELETION OR ALTERATION OF CONTENT, INFORMATION OR DATA; STATEMENTS OR CONDUCT OF ANY THIRD PARTY; OR ANY OTHER MATTER RELATING TO US, THE CONTENT OR THE MAPILLARY SOLUTION. EXCLUDING ONLY OUR LIABILITY FOR OUR FRAUD, DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE, OR ANY OTHER LOSS FOR WHICH WE CANNOT LAWFULLY LIMIT LIABILITY, ANY LIABILITY TO YOU OR ANY THIRD PARTY IN ANY CIRCUMSTANCE IS LIMITED IN THE AGGREGATE TO THE GREATER OF $10 OR ALL AMOUNTS PAID BY YOU TO US DURING THE TWELVE-MONTH PERIOD PRECEDING THE OCCURRENCE OF THE CLAIM OR INCIDENT. The foregoing limitations and exclusions apply to the maximum extent permitted by applicable law. 5.3 Indemnification. You agree to defend, indemnify, release and hold harmless us, our suppliers, and all officers, directors, employees, consultants, agents, and representatives of any of the foregoing (collectively \"Protected Parties\") in full from and against any and all claims (including third party claims), losses, liability, damages, and/or costs of every kind and nature, known and unknown, suspected and unsuspected, disclosed and undisclosed, arising out of or in any way connected with: (a) your unauthorized access to or use of, the Mapillary Solution or Content, (b) your breach of these , (c) your use of Content or conduct engendered thereby, and any activities you conduct on or through the Mapillary Solution, or (d) your infringement, or infringement by any other user of your account, of any intellectual property rights or other rights of any person or entity. Further, in the event you have a dispute with one or more Mapillary Users, you hereby release the Protected Parties from claims, demands and damages (actual, direct and consequential) of every kind and nature, known and unknown, suspected and unsuspected, disclosed and undisclosed, foreseeable and unforeseeable, arising out of or in any way connected with such disputes. FOR CALIFORNIA, USA RESIDENTS: You further agree that these waive and release any claims that would otherwise be preserved by operation of section 1542 of the California Civil Code, which provides: \"A general release does not extend to claims which the creditor does not know or suspect to exist in his or her favor at the time of executing the release, which if known by him or her must have materially affected his or her settlement with the debtor.\" You understand that you are releasing us from all claims, whether known or unknown to you, and whether or not you suspect that those claims may exist at this time. 6.0 PERSONAL DATA AND JOINT DATA CONTROLLER ARRANGEMENT 6.1 Joint Controllers . Within the scope of the Mapillary Marketplace and Capture Projects, Mapillary and the Requester/Organization have a joint interest and purpose with the capturing and uploading of the Content. Since Mapillary and the Requester/Organization have a joint interest and purpose, the parties are considered joint controllers in regard to that personal data processing operation. Individuals acting in their private capacity as Requester do not have a data controller responsibility according to the GDPR and is thus not considered a joint controller with Mapillary. Joint controllers are, according to Article 26 in the GDPR, to determine their respective responsibilities for compliance with the obligations under the GDPR by means of an arrangement (the \"Arrangement\"). By accepting these , the Requester/Organization enters into an Arrangement in order for Mapillary and the Requester/Organization to comply with Article 26 of the GDPR. 6.2 When the Arrangement applies . This Arrangement only applies to the processing of personal data within the scope of Mapillary Marketplace and Capture Projects. All other processing activities of the parties fall within the sole controllership of the respective party. 6.3 Legal basis . It is the responsibility of Mapillary and the Requester/Organization respectively to ensure that a legal basis applies to the processing of personal data within the scope of the Mapillary Marketplace and Capture Projects. If any of the processing is based on the consent of the data subject, it is each party's responsibility to ensure that the consent is given in accordance with Article 7 in the GDPR, and any other applicable provisions of the GDPR. 6.4 Provision of information . It is the responsibility of Mapillary to provide affected users with information on Mapillary's processing of their personal data within the scope of the Mapillary Marketplace and Capture Projects, as is required according to Articles 13-14 of the GDPR. Mapillary fulfils this obligation through the information provided in its . Mapillary's can be found here . Requester/Organization is responsible for providing information on its processing of such data in accordance with the GDPR, including information on purpose, legal basis and retention period. 6.5 Rights of the data subjects . Mapillary shall act as the contact point in relation to users when they wish to exercise their rights under the GDPR. Mapillary is responsible for providing the users with the requested information, except for such information that only the Requester/Organization has knowledge of. In such cases, Mapillary shall without undue delay forward the question and/or request to the Requester/Organization. A user may contact Mapillary at support@mapillary.com, should it wish to exercise their rights under the GDPR. 7.1 Driving . When capturing Content we ask you to drive in a careful and responsible way, and to always follow any applicable traffic laws. 7.2 Force Majeure . Except for obligations to pay money hereunder, no delay, failure or omission by either party to carry out or observe any of its obligations hereunder will give rise to any claim against such party or be deemed to be a breach of this Agreement if and for as long as such failure or omission arises from any cause beyond the reasonable control of that party. 7.3 Service Discontinuance/Modification. We may from time to time modify or discontinue access to, temporarily or permanently, the Site or any Service thereon (or any part, feature, or functionality thereof, as well as internal rules of operation, eligibility, pricing, gamification, visibility to or accessibility of the public, and other aspects). We will not be liable for any such modification, suspension or discontinuance, even if certain features or functions, your settings, and/or any Content you have contributed or have come to rely on, are permanently lost. 7.4 Account Termination. We may terminate your or any other Mapillary User's account for cause, including without limitation for: (a) violation of these ; (b) abuse of Mapillary resources or any attempt to gain unauthorized entry to the Mapillary Solution; (c) use of the Site or any Service in a manner inconsistent with the purpose of the Services; (d) such Mapillary User's request for such termination; or (e) requirements of or for failure to comply with applicable law, regulation, court or governing agency order, or ethical requirements. We may in addition terminate the availability of the Mapillary Solution for our own business reasons, including if we elect to cease being in the business of providing it. Our termination of any Mapillary User's access to the Mapillary Solution may be without notice and, on such termination, we may immediately deactivate or delete any Mapillary User's account and Content, and/or bar any further access to the Site and Services. We will not be liable for any termination of Mapillary User's access to the Site or Services. After account termination, you will not attempt to register a new account without our permission. 7.5 Account Deactivation. You may deactivate your account any time. Deactivation is your sole means of terminating your account. We will in our own discretion keep Nonpersonal Data and explicitly the photos submitted and the associated geolocation data which is required, if any, to maintain the uninterrupted and intended Mapillary Solution functionality. 7.6 US Government Restricted Rights. Services are provided with \"RESTRICTED RIGHTS.\" Use, duplication, or disclosure by the U.S. Government is subject to restrictions as set forth in applicable laws and regulations. Use of the Services and related materials by the U.S. Government constitutes acknowledgment of our proprietary rights. 7.7 Trademarks. You are granted no right, title or license to any third party trademarks by these , or to any of our trademarks or servicemarks. We reserve all right, title and interest in and to our trademarks, servicemarks, trade names, trade dress, domain names, and similar identifiers, including without limitation MapillaryTM. 7.8 US DMCA. If you believe that your work has been copied and is accessible via the Mapillary Solution in a way that constitutes copyright infringement in the United States, you may notify us by providing our copyright agent with the following in writing: (a) identification of the copyrighted work that you claim has been infringed; (b) identification of the material that is claimed to be infringing and information reasonably sufficient to permit us to locate the material; (c) your name, address, telephone number, and email address; (d) a statement by you that you have a good faith belief that the disputed use is not authorized by the copyright owner, its agent, or the law; and (e) a statement, made under penalty of perjury, that the above information in your notice is accurate and that you are the copyright owner or are authorized to act on the copyright owner's behalf. The above writing must be electronically or physically signed by you. If we receive such a claim, we may refuse or delete Content, or terminate a Mapillary User's account in accordance with these . Our designated agent to receive notification of claimed infringement under the Digital Millennium Copyright Act of 1998 (Mapillary DMCA Agent, Anckargripsgatan 3, 21119 Malmö, Sweden) can be contacted via hello@mapillary.com. In addition to forwarding your notice to the person who provided the allegedly illegal Content, we may send a copy of your notice (with your personal information removed) to Chilling Effects ( www.chillingeffects.org ) for publication and/or annotation. A link to your published notice will be displayed in place of the removed Content. We reserve the right to remove Content alleged to be infringing or otherwise illegal without prior notice and at our sole discretion. In appropriate circumstances, we will also terminate a Mapillary User's account if the Mapillary User is determined to be a repeat infringer. 7.9 Governing Law. These , the Mapillary Solution, Content, and any disputes related to or concerning any of the foregoing (including tort as well as contract claims, and whether pre-contractual or extra-contractual), will be governed by and settled in accordance with the laws of Sweden, notwithstanding the choice of laws rules of any jurisdiction to the contrary. You agree that regardless of any statute or law to the contrary, any claim or cause of action arising out of or related to these , the Mapillary Solution, or Content, must be filed within one year after such claim or cause of action arose, or be forever barred. 7.10 Dispute Resolution. Any disputes between or claims brought by you or us arising out of or related to these , the Mapillary Solution, or Content (including tort as well as contract claims, and whether pre-contractual or extra-contractual, as well as the arbitrability of any disputes) will be referred to and finally settled by binding arbitration before the International Court of Arbitration in accordance with the Rules of Arbitration of the International Chamber of Commerce (\"ICC\") in effect at the time of arbitration except as inconsistent with this section. The arbitration will be conducted by telephone, on-line and/or based solely upon written submissions where no in-person appearance is required. If in-person appearance is required, such hearings will be held in Copenhagen, Denmark unless another location is mutually agreed upon by the parties. In all such cases, the arbitration will be administered by the ICC in accordance with their applicable rules. The arbitrator will apply the law specified in section 6.8 above. If you are an individual, the cost of the work of the arbitrator shall be paid by us, unless you, according to the arbitration board's assessment, has instituted arbitration proceedings without reasonable ground. All awards may if necessary be enforced by any court having jurisdiction. The existence of any dispute, the existence or details of the arbitration proceeding, and all related documents, materials, evidence, judgments and awards therein, will be kept confidential. Except as required by law, no party will make any public announcements with respect to the proceeding or the award, except as required to enforce same. The parties hereby waive the right to a trial by jury and agree to only bring claims in an individual capacity and not as a plaintiff or class member in any purported class or representative proceeding. Notwithstanding the foregoing, nothing in this section will preclude the right and ability to file and maintain at any time an action for recovery of injunctive or provisional relief in any court of competent jurisdiction under the laws applicable thereto. All claims (excluding requests for injunctive or equitable relief) between the parties must be resolved using arbitration in accordance with this section. Should either party file an action contrary to this section, the other party may recover lawyers' fees and costs, provided that the party seeking the award has notified the other party in writing of the improperly filed claim, and the other party has failed to withdraw the claim. 7.11 Assignment. These will not be assigned, delegated, or transferred by you, in whole or in part, whether voluntary, involuntary, by merger, consolidation, dissolution, sale of assets, or otherwise, without our prior written consent. Any such purported assignment, delegation or transfer without such written consent will be void. We may at any time assign these without prior consent or notice. These will be binding on, and inure to the benefit of, the parties and their respective and permitted successors and assigns. 7.12 Injunctive Relief. You acknowledge and agree that breach of these , or any unauthorized use, disclosure or distribution of the Mapillary Solution or Content, may cause irreparable harm to us, the extent of which would be difficult to ascertain, and that we will be entitled to seek immediate injunctive relief (in addition to any other available remedies), in any court of competent jurisdiction under the applicable laws thereto. 7.13 Sweden-Based Site. The Mapillary Solution is controlled by Mapillary from its offices in Sweden. We make no representation that the Mapillary Solution is appropriate for use in other jurisdictions. Your use of or access to the Site will not be construed as our purposefully availing ourselves of the benefits or privileges of doing business in any other country, state or jurisdiction other than Sweden. 7.14 General. The constitute the entire agreement between us and govern each Mapillary User's use of the Mapillary Solution, superseding any prior agreements. Each Mapillary User may be subject to additional that may apply when that Mapillary User uses affiliate services, third party content or third party software. If any provision of the is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision, and the other provisions of the remain in full force and effect. No waiver of any provision of these will be deemed a further waiver or continuing waiver or such provision or any other provision, and our failure to assert any right or provision under these will not constitute a waiver of such right or provision. Nothing herein will be deemed to create an agency, partnership, joint venture, employee-employer or franchisor-franchisee relationship of any kind between us and any user or other person or entity, nor do these extend rights to any third party. The parties hereto confirm that they have requested that these and all attachments and related documents, if any, be drafted in English. (Effective Date: 24 April, 2019)",
    "Learn how organizations like yours are using street-level images combined with powerful tools and computer vision to automate manual workflows, engage users and citizens, and make better maps. Android, mounted on car windscreen The World Bank Transportation and ICT group works with local contractors in Southwestern China to capture imagery for a rural accessibility project. The contractors are required to use the Mapillary app as they drive the road network, so the World Bank team in Washington DC can evaluate the environment and road conditions remotely. As development work progresses and more images are uploadd, The World Bank can use Mapillary's comparison feature to observe changes over time. Professional capture by ARRB (https://www.arrb.com.au/home.aspx) VicRoads, the transportation authority of the state of Victoria, Australia, surveys its 22,500 kilometer road network every two years. With a professional grade ARRB (https://www.arrb.com.au/home.aspx) rig, VicRoads is able to capture information about road quality, surfacing, reflectivity, and more. As part of an open data effort, Mapillary imported terabytes of VicRoads' imagery data, processed it and made it available through a web viewer for easy access and distribution. Iphone, taken on foot Westchester County GIS captured imagery of trails using mobile phones to create immersive, interactive hikes in major parks. The imagery was embedded into an ArcGIS story map so visitors can navigate and explore park trails online. IPhone, mounted on car windscreenGeo Los Angeles County Department of Public Works uses Mapillary to keep its database of traffic signs updated across 3,200 miles of road. Road inspectors drive out every month to check for broken or vandalized signs, but full inventory is only conducted once every one or two years. With Mapillary, inspectors capture road views as they drive out each month. Images are uploaded to Mapillary directly after each drive and traffic sign data is automatically extracted within hours. Giroptic, mounted on car roof The Tourism Board of Faroe Islands were looking to create Street View across the island as a promotional campaign. Mapillary image-mapped the island with simple equipment and a small crew, creating fresh and beautiful street-level imagery within a week. Property and Land Use Surveys Multiple Sony Action Cams Bruce Harris, a leading provider of GIS solutions an appraisal support, offers a Mapillary integration within its Paperless Reappraisal System. With the Mapillary add-on, the tax assessor's office can pull up street-level imagery directly in the assessment worklow. Brice Harris offers capture services to ensure that imagery used for appraisal or zoning remains fresh. LG360, mounted on a skimmer, captured by WSP-Parsons Brinckerhoff In preparation for Chicago River Day in May 2017, the Chicago Metropolitan Planning Council worked with WSP-Parsons Brinckerhoff to capture 360 imagery of the length of the Chicago River. The imagery will be used to a supplement a digital city model to bring people to and excite them about the river. Professional capture by WSP Sweden The City of Helsingborg has published over 1 millions images professional captured of the city streets as part of an open data campaign - OpenHelsingborg. The images are available on Mapillary.com for easy viewing and device, and can be downloaded by citizens, agencies, and other cities for any use. Garmin Virbs on city vehicles The City of Johns Creek uses Mapillary for traffic ventory. As a side benefit, the GIS team found that the collected imagery was useful for showcasing transportation projects that were up for votes. The GIS team created an ArcGIS Story Map to give citizens a way to navigate through the photos."
  ]
}