{
  "company": "www.adityagroup.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 4,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 4
    }
  },
  "sample_docs": [
    "Aditya @ IFSEC 2008 New Delhi Aditya Infotech Ltd. participated in IFSec 2008, India's largest security products Exhibition. Pro Audio Road Show Aditya Infotech Ltd is pleased to invite all of you for a Series of Audio Road Shows to be held at 5 major cities from 4th to 26th sep 2008 Aditya Infotech was again in limelight during PALM show 2008 demonstrating its strength & commitment to the Pro Audio Industry. M-Audio Best Distributor Award Aditya Infotech Ltd was awarded the most improved distributor award in the entire Asia Pacific RIM for their excellent performance during the year 07 Professional Audio Road Show Aditya exhibited Professional audio Products like m-audio and RODE in a Grand road show in Delhi. Corel Appoints New Distributor Corel Corporation, a leading developer of graphics, productivity and digital media software, today announced Aditya Infotech, as its distributor ... AIL & Hikvision Tie-up AIL has signed up with hikvision for security Products AIL & Zavio Inc. Tie-up AIL has signed up with Zavio Inc for Network Video Surveillance Products. AIL & Western Digital Tie-up Aditya Infotech Limited & Western Digital Tie-up for WD AV Series Hard Disk Aditya - Leadtek tie-up Aditya Infotech to Distribute Leadtek's Products. Leadtek Research, the exclusive partner of Nvidia in India and Asia Pacific for Nvidia Quadro GPUs,",
    "Certificate under Regulation 74(5) of the SEBI (Depositories and Participants) Regulations 2018 for the quarter ended September 30, 2025 Intimation of Closure of Trading Window – 29.09.2025 Disclosure Under Regulation 30: Incorporation of Wholly owned Subsidiary Disclosure under Regulation 30 - Earnings Call Transcript Disclosure under regulation 30 – Outcome of Earnings call for quarter ended June 30, 2025 Disclosure under Regulation 30 - Newspaper Publication-Financial Results for the quarter ended June 30 2025 Disclosure under Regulation 30 - Earning Release for quarter ended June 30, 2025 Disclosure under Regulation 30 - Investors Presentation for quarter ended June 30, 2025 Board Meeting Outcome - August 19, 2025 Intimation of earnings conference call Board Meeting intimation – Financial Results for the quarter ended June 30, 2025 Intimation of Closure of Trading Window Disclosure under Regulation 30(5) of the SEBI (LODR) 2015 Intimation of Code of Fair disclosure under Regulation 8(2) of SEBI (PIT) Regulations .",
    "Training & development Upskilling the Nation with Certified Training Program Upskilling the Nation with Certified Training Program Upskilling the Workforce CP PLUS, the global leader in the Security and Surveillance Industry, recognized that the workforce engaged in the installation and integration of CCTV cameras comes from a background of little to no technical knowledge. However, the surveillance industry has continued to grow at a steady CAGR of 20%, which is building a strengthening interest among the workforce to join the industry. As an Industry Leader and India's No. 1 CCTV Brand in the CCTV market, CP PLUS undertook the responsibility to Train and Upskill the Industrial workforce in March 2018 and aimed to enable them to find better business opportunities. The CP PLUS Corporate Training Division thus began the first of its Four kinds of training programs which entail Skilling, Upskilling, and enhancing Employability skills in the video surveillance industry. After 5 years of a successful run, the CP PLUS Corporate Training Division is still the only one of its kind in the entire security and surveillance industry which is engaged in the regular conduct of training programs to Skill and Upskill the CCTV Industry Workforce. Mission Tech Mission Tech is the flagship training program by CP PLUS, launched in September 2018 on a Pan-India basis. It is a 4-day Customer and System Integration (SI) oriented paid Certificate Training Program in due Collaboration with the Electronic Sector Skill Council of India (ESSCI) under the Skill India Mission. The CP PLUS Mission Tech Certificate Training Program is designed to train and skill/upskill Surveillance System Technicians and Installers on the Installation, Operation, and Maintenance of CP PLUS Products, designing Intelligent Security Solutions and providing lifetime sustenance for complete customer satisfaction. Thus far, CP PLUS has successfully trained and certified 2,500 installers and technicians under the Mission Tech initiative in affiliation with ESSCI. Online Training & Webinar Program These free of cost 2-3 hour long Webinars focus on imparting globally relevant surveillance solutions training to the System Integrators (SIs) and CP PLUS business partners; enhancing their skills for designing effective and efficient surveillance solutions; and enabling them to deliver customized and scalable Surveillance Solutions across verticals. Soon after its launch as the program gained hefty popularity and CP PLUS began conducting them regularly on a weekly basis not just in Hindi & English but in many regional languages across the country. Under the online training and webinar format, CP PLUS has efficiently upskilled and enhanced the technical threshold of more than 25000 (till Aug 2023) CCTV installers and technicians across the country hitherto. Hands-on Training Workshops To meet the aspirations of the young and novice CCTV Installers and Technicians and to further invest in the human capital that India enjoys to ensure that there is a competent and proficient workforce in the Security and Surveillance Industry, CP PLUS started conducting practical hands-on training workshops, free of cost, on a regular basis in all the 54 CP PLUS branches spread all over India. CP PLUS has successfully trained and certified over 5,000 CCTV Installers and Technicians under this program. In this program, the course is specially designed for the Indian environment so that system integrators and partners can deliver relevant solutions for the Indian market. Partners Meet & Training (PMT) Program To meet the increasing demand for physical interaction and hands-on tech experience in the post-Covid times, CP PLUS also commenced its Partners Meet & Training (PMT) Program, where a large number of (50-80) Installers and System Integrators are invited for a day's workshop to impart and share both the theoretical and practical knowledge. The PMT Program, being free of Cost as well, has proven to be the most sought-after training format and has trained and professionally enhanced more than 12,000 Installers and Technicians in just 8 months. Being the largest and the only Indian OEM holding a large share of the market, CP PLUS recognizes that outcome rules the day, and it must be measured in systematic and quantitative . The sheer number of people having been enabled to join the surveillance industry as trained and skilled professionals shows that in a span of just 5 years, the CP PLUS Training Programs and Workshops under the Corporate Training Division of CP PLUS have triumphantly enhanced the quality of the services provided by the professionals for the entire industry while also empowering people through effective training to find gainful employment in the field of Video Surveillance. On feedback from the participants and on the basis of a check of Sales Volumes, it has been noted that CP PLUS was able to assist its System Integrators and Resellers to enhance their business of CCTV products by up to 300% after attending CP PLUS Training Programs and over the past 5 years, the brand has successfully trained more than Approx. 50,000 individuals conclusively. To register for various CP PLUS Training Programs, please visit: https://www.cpplusworld.com/traininglist/1 CP PLUS, the global leader in the Security and Surveillance Industry, recognized that the workforce engaged in the installation and integration of CCTV cameras comes from a background of little to no technical knowledge. However, the surveillance industry has continued to grow at a steady CAGR of 20%, which is building a strengthening interest among the workforce to join the industry. As an Industry Leader and India's No. 1 CCTV Brand in the CCTV market, CP PLUS undertook the responsibility to Train and Upskill the Industrial workforce in March 2018 and aimed to enable them to find better business opportunities. The CP PLUS Corporate Training Division thus began the first of its Four kinds of training programs which entail Skilling, Upskilling, and enhancing Employability skills in the video surveillance industry. After 5 years of a successful run, the CP PLUS Corporate Training Division is still the only one of its kind in the entire security and surveillance industry which is engaged in the regular conduct of training programs to Skill and Upskill the CCTV Industry Workforce. Mission Tech is the flagship training program by CP PLUS, launched in September 2018 on a Pan-India basis. It is a 4-day Customer and System Integration (SI) oriented paid Certificate Training Program in due Collaboration with the Electronic Sector Skill Council of India (ESSCI) under the Skill India Mission. The CP PLUS Mission Tech Certificate Training Program is designed to train and skill/upskill Surveillance System Technicians and Installers on the Installation, Operation, and Maintenance of CP PLUS Products, designing Intelligent Security Solutions and providing lifetime sustenance for complete customer satisfaction. Thus far, CP PLUS has successfully trained and certified 2,500 installers and technicians under the Mission Tech initiative in affiliation with ESSCI. Online Training & Webinar Program These free of cost 2-3 hour long Webinars focus on imparting globally relevant surveillance solutions training to the System Integrators (SIs) and CP PLUS business partners; enhancing their skills for designing effective and efficient surveillance solutions; and enabling them to deliver customized and scalable Surveillance Solutions across verticals. Soon after its launch as the program gained hefty popularity and CP PLUS began conducting them regularly on a weekly basis not just in Hindi & English but in many regional languages across the country. Under the online training and webinar format, CP PLUS has efficiently upskilled and enhanced the technical threshold of more than 25000 (till Aug 2023) CCTV installers and technicians across the country hitherto. To meet the aspirations of the young and novice CCTV Installers and Technicians and to further invest in the human capital that India enjoys to ensure that there is a competent and proficient workforce in the Security and Surveillance Industry, CP PLUS started conducting practical hands-on training workshops, free of cost, on a regular basis in all the 54 CP PLUS branches spread all over India. CP PLUS has successfully trained and certified over 5,000 CCTV Installers and Technicians under this program. In this program, the course is specially designed for the Indian environment so that system integrators and partners can deliver relevant solutions for the Indian market. Partners Meet & Training (PMT) Program To meet the increasing demand for physical interaction and hands-on tech experience in the post-Covid times, CP PLUS also commenced its Partners Meet & Training (PMT) Program, where a large number of (50-80) Installers and System Integrators are invited for a day's workshop to impart and share both the theoretical and practical knowledge. The PMT Program, being free of Cost as well, has proven to be the most sought-after training format and has trained and professionally enhanced more than 12,000 Installers and Technicians in just 8 months. Being the largest and the only Indian OEM holding a large share of the market, CP PLUS recognizes that outcome rules the day, and it must be measured in systematic and quantitative . The sheer number of people having been enabled to join the surveillance industry as trained and skilled professionals shows that in a span of just 5 years, the CP PLUS Training Programs and Workshops under the Corporate Training Division of CP PLUS have triumphantly enhanced the quality of the services provided by the professionals for the entire industry while also empowering people through effective training to find gainful employment in the field of Video Surveillance. On feedback from the participants and on the basis of a check of Sales Volumes, it has been noted that CP PLUS was able to assist its System Integrators and Resellers to enhance their business of CCTV products by up to 300% after attending CP PLUS Training Programs and over the past 5 years, the brand has successfully trained more than Approx. 50,000 individuals conclusively. To register for various CP PLUS Training Programs, please visit: https://www.cpplusworld.com/traininglist/1 .",
    "Technology for the Future Technology for the Future DNA that encourages competence & competitiveness DNA that encourages competence & competitiveness DNA that encourages competence & competitiveness World-Class Manufacturing Facility of Surveillance Devices Shifting manufacturing to Kadapa, Andhra Pradesh, CP PLUS has tripled its production capacity to more than 2.5 Million units per month, making it India's Largest Manufacturing Unit for Surveillance Products. With the most advanced high-speed Fuji NXT III SMT lines, numerous HD as well as IP camera assembly lines, offline assembly lines, packaging lines, DVR FA lines, and an IC programming station, this production facility is the most advanced in the nation. Spread over 50,000 sq. ft., it also comprises of reliability test equipment, a dark room for the aging test, and many leak test machines. Having pursued delivering premium quality through conducting extensive research & development as the leading and only specialized Indian manufacturer of high-functioning surveillance devices, in 2022, CP PLUS became the first brand in the entire world anywhere outside of China to successfully produce the largest quantity of surveillance devices. Integrated Manufacturing System From Production To Processing The production of hi-tech surveillance solutions requires sophisticated knowledge and expertise at every stage of the manufacturing process from raw materials to packaging. To achieve this, we combine the experience we have acquired over the years. A Comprehensive Quality Control System For Every Process At our state-of-the-art manufacturing facilities, we use systematic and centralized management to conduct strict quality inspections for each stage of the production process. A comprehensive quality control system featuring regular stringent tests helps to ensure that our products meet our customers' expectations. Total Management System Support High Quality We have established a strict quality management system based on a wide range of Reliability Test equipment to ensure high-quality products are manufactured throughout. With the help of this, all our products have various certifications in Tenders and by Government agencies. A Pioneer in the CCTV Industry Supported by our state-of-the-art facilities that provide some of the world's largest-scale production capacity as well as the widest portfolio of the product range backed by the latest technological advancements, we have established our brand as the unparalleled leader in the surveillance industry. Diverse & Reliable Proposal-Development Capabilities From researching the perfect design to delivering more than expected, we execute every step with the uttermost dedication. Based on a flexible, customized approach that caters to the needs of each project and the extensive data we have accumulated from our more than 25 years of experience, we strive to resolve all security challenges and offer new proposals that accurately and rapidly incorporate your needs. Continuously Evolving Technical Capabilities As technology grows with time and new possibilities are discovered, we also have grown to anticipate not just future requirements but also future developments that need to be brought to India to meet the same. In addition to leveraging these capabilities to create new products and develop new applications, we will foster a new era by focusing on crafting solutions that enhance the whole smart living experience. World-Class Product Competitiveness We continue to expand from electronics and general industry into cutting-edge fields and to keep up this trend, we supply world-class products that leverage our know-how in areas such as designing and manufacturing hi-tech solutions, precision processing at the micro level, providing advanced functionality, and high-added value to suit different applications. Shifting manufacturing to Kadapa, Andhra Pradesh, CP PLUS has tripled its production capacity to more than 2.5 Million units per month, making it India's Largest Manufacturing Unit for Surveillance Products. With the most advanced high-speed Fuji NXT III SMT lines, numerous HD as well as IP camera assembly lines, offline assembly lines, packaging lines, DVR FA lines, and an IC programming station, this production facility is the most advanced in the nation. Spread over 50,000 sq. ft., it also comprises of reliability test equipment, a dark room for the aging test, and many leak test machines. Having pursued delivering premium quality through conducting extensive research & development as the leading and only specialized Indian manufacturer of high-functioning surveillance devices, in 2022, CP PLUS became the first brand in the entire world anywhere outside of China to successfully produce the largest quantity of surveillance devices. The production of hi-tech surveillance solutions requires sophisticated knowledge and expertise at every stage of the manufacturing process from raw materials to packaging. To achieve this, we combine the experience we have acquired over the years. At our state-of-the-art manufacturing facilities, we use systematic and centralized management to conduct strict quality inspections for each stage of the production process. A comprehensive quality control system featuring regular stringent tests helps to ensure that our products meet our customers' expectations. We have established a strict quality management system based on a wide range of Reliability Test equipment to ensure high-quality products are manufactured throughout. With the help of this, all our products have various certifications in Tenders and by Government agencies. Supported by our state-of-the-art facilities that provide some of the world's largest-scale production capacity as well as the widest portfolio of the product range backed by the latest technological advancements, we have established our brand as the unparalleled leader in the surveillance industry. From researching the perfect design to delivering more than expected, we execute every step with the uttermost dedication. Based on a flexible, customized approach that caters to the needs of each project and the extensive data we have accumulated from our more than 25 years of experience, we strive to resolve all security challenges and offer new proposals that accurately and rapidly incorporate your needs. As technology grows with time and new possibilities are discovered, we also have grown to anticipate not just future requirements but also future developments that need to be brought to India to meet the same. In addition to leveraging these capabilities to create new products and develop new applications, we will foster a new era by focusing on crafting solutions that enhance the whole smart living experience. We continue to expand from electronics and general industry into cutting-edge fields and to keep up this trend, we supply world-class products that leverage our know-how in areas such as designing and manufacturing hi-tech solutions, precision processing at the micro level, providing advanced functionality, and high-added value to suit different applications. .",
    "Think Security, Think Aditya With over 3 decades of versatile experience in dozens of sectors, we are a comprehensive surveillance and electronic security brand with the most extensive portfolio in the entire industry. Recognizing that investing in technology means investing in innovation, we aim to make security more and more accessible through our brand CP PLUS in order to enrich lives everywhere with an enhanced living experience. Technology for the Future Explore In-House R&D Capabilities Empowering Women Workforce Dedicated Service & Support Upskilling the Nation with Certification Training Program Think Security, Think Aditya With over 3 decades of versatile experience in dozens of sectors, we are a comprehensive surveillance and electronic security brand with the most extensive portfolio in the entire industry. Recognizing that investing in technology means investing in innovation, we aim to make security more and more accessible through our brand CP PLUS in order to enrich lives everywhere with an enhanced living experience. Technology for the Future Dedicated Service & Support Upskilling the Nation with Certification Training Program Empowering Communities, Creating Impact! Initiatives Empowering Communities, Creating Impact! India's Leading CCTV Surveillance Company 1000+ Employees (factory 3000+ more) 54 Offices 30000+ Partners across India 44 Service Centers India's Leading CCTV Surveillance Company 1000+ Employees (factory 3000+ more) 30000+ Partners across India Featured Press Release CP PLUS Takes Strong Legal Action Against Counterfeit CCTV Cable Operations in Delhi New Delhi, September 10, 2025 – Aditya Infotech Limited, India's leading video security and surveillance company and owner of the \"CP PLUS\" trademark and copyrights, has successfully acted against counterfeiters involved in the manufacture and sale of fake CCTV cables under the CP PLUS brand. CP PLUS recently received information that counterfeit CCTV cables bearing its name were being produced and sold by a factory owned by Mr. Ashish Jain at E-47/2, Okhla Industrial Area, Phase-2, New Delhi – 110020. After verifying the information, CP PLUS approached the Delhi Police and requested them to take legal action against the offenders. Following CP PLUS's complaint, Okhla Police conducted a raid on August 29, 2025. During the operation, the authorities found that the factory was manufacturing fake CCTV cables marked and packed as CP PLUS products. The police seized significant quantities of counterfeit materials, including: 24 small bundles and 6 large bundles of CCTV cables printed with the CP PLUS name 14 bundles of corrugated packing boxes with CP PLUS markings (each containing 25 sheets) 10 sheets of stickers (36 stickers per sheet) bearing the Aditya Infotech Limited name A CCTV cable manufacturing machine The counterfeiters were using CP PLUS packaging and branding to mislead consumers into purchasing fake products, thereby infringing Aditya Infotech Limited's intellectual property rights and engaging in misrepresentation, cheating, and fraud. A spokesperson for Aditya Infotech (CP PLUS) stated: \"The manufacturing and sale of counterfeit products under our trademark not only violates our intellectual property rights but also deceives innocent customers who trust the CP PLUS brand. We remain fully committed to protecting our customers and will continue to take strict legal action against such fraudulent activities.\" Aditya Infotech Limited has filed a formal First Information Report (FIR no. 751/25 dated August 29, 2025) under Section 63 of the Copyright Act for misrepresentation, cheating, forgery, and trademark infringement.The company reaffirmed its dedication to combating counterfeit activities and ensuring that customers receive only genuine, high-quality CP PLUS products. About Aditya Infotech Limited: Aditya Infotech Limited (BSE: 544466 | NSE: CPPLUS) offers a comprehensive range of advanced video security and surveillance products, technologies, and solutions for enterprise and consumer segments under our 'CP PLUS' brand, which has strong recall value. In addition, we offer solutions and services such as fully integrated security systems and Security-as-a-Service directly and through our distribution network that address the requirements of end-customers engaged in a broad range of sectors. Our manufacturing activities include the production and sale of our CP PLUS products and the provision of after-sales services in relation to the CP PLUS products sold by us. For more information, visit https://www.cpplusworld.com Explore CP PLUS Unveils the Largest Range of Government-Approved & Cyber-Secured Smart Home Wi-Fi Cameras CP PLUS, India's leading security and surveillance brand, proudly introduces the largest range of Government-Approved & Cyber-Secured Smart Home Wi-Fi Cameras , setting a new benchmark for trusted home security. With the ezyKam+ series , CP PLUS empowers households to embrace smarter living while ensuring unparalleled safety, privacy, and digital trust. Designed with cutting-edge features such as 360° view, Human Detection, Motion Tracking, 2-Way Talk, and Private Mode , these cameras deliver not just security but peace of mind for every Indian home. At the heart of this innovation lies CTC (CP PLUS Trusted Core) Technology , which ensures strong cryptography algorithms, secure boot, and robust data protection . These features make CP PLUS the go-to choice for families looking for intelligent, cyber-secured, and reliable surveillance solutions. \"Security at home is no longer limited to physical protection, it is equally about digital safety and privacy. With our government-approved and cyber-secured Wi-Fi cameras, CP PLUS is making advanced surveillance accessible, secure, and trustworthy for every household in Bharat,\" said Mr. Aditya Khemka, Managing Director, CP PLUS (Aditya Infotech Ltd.) . The ezyKam+ Smart Wi-Fi range is also equipped with cloud storage options , ensuring that critical footage is safely stored and easily accessible. Whether it's monitoring children, elderly family members, or keeping an eye on your home while away, CP PLUS offers a seamless blend of convenience and confidence. By introducing the largest range of Government-Approved & Cyber-Secured Smart Wi-Fi Cameras , CP PLUS once again reaffirms its position as a pioneer in security innovations - strengthening its promise of making Bharat not just smarter, but also safer. Explore CP PLUS Honored for Excellence in Strategic Electronics Manufacturing at ELCINA Defennovation Awards 2025 Bengaluru, September 2025: CP PLUS, under the aegis of Aditya Infotech Ltd., has once again reaffirmed its leadership in innovation and indigenization by being recognized with the prestigious Excellence in Strategic Electronics Manufacturing Award at the ELCINA Defennovation Awards 2025 in Bengaluru. This accolade celebrates CP PLUS's outstanding contributions to the large-scale manufacturing of Strategic Electronics - a sector vital to powering India's national security and strengthening the nation's resilience. By combining deep technological expertise with a vision rooted in self-reliance, CP PLUS has built an ecosystem that not only meets the highest global standards but also advances the government's Make in India and Atmanirbhar Bharat missions. Mr. Aditya Khemka, Managing Director, CP PLUS (Aditya Infotech Ltd.), said: \"At CP PLUS, innovation meets purpose. This award is a recognition of our long-standing commitment to developing advanced, indigenized technologies that safeguard our nation and create a resilient foundation for the future. We dedicate this honor to the spirit of Indian innovation and to the talented teams driving our mission forward.\" With a state-of-the-art manufacturing facility - India's largest for surveillance equipment - CP PLUS has been at the forefront of producing next-generation surveillance systems, electronic solutions, and mission-critical technologies that support both civilian safety and defense readiness. The company's foray into Strategic Electronics has further cemented its reputation as a pioneer in advancing India's technological sovereignty. The ELCINA Defennovation Awards are among the most respected recognitions in India's electronics and defense sector, celebrating organizations that demonstrate excellence, innovation, and impact in building technologies critical to national interest. As CP PLUS continues to scale its manufacturing and R&D capabilities, this recognition marks a milestone in its journey to empower India with world-class, indigenously developed Strategic Electronics that serve both present and future security needs. Explore View all CP PLUS Takes Strong Legal Action Against Counterfeit CCTV Cable Operations in Delhi New Delhi, September 10, 2025 – Aditya Infotech Limited, India's leading video security and surveillance company and owner of the \"CP PLUS\" trademark and copyrights, has successfully acted against counterfeiters involved in the manufacture and sale of fake CCTV cables under the CP PLUS brand. CP PLUS recently received information that counterfeit CCTV cables bearing its name were being produced and sold by a factory owned by Mr. Ashish Jain at E-47/2, Okhla Industrial Area, Phase-2, New Delhi – 110020. After verifying the information, CP PLUS approached the Delhi Police and requested them to take legal action against the offenders. Following CP PLUS's complaint, Okhla Police conducted a raid on August 29, 2025. During the operation, the authorities found that the factory was manufacturing fake CCTV cables marked and packed as CP PLUS products. The police seized significant quantities of counterfeit materials, including: 24 small bundles and 6 large bundles of CCTV cables printed with the CP PLUS name 14 bundles of corrugated packing boxes with CP PLUS markings (each containing 25 sheets) 10 sheets of stickers (36 stickers per sheet) bearing the Aditya Infotech Limited name A CCTV cable manufacturing machine The counterfeiters were using CP PLUS packaging and branding to mislead consumers into purchasing fake products, thereby infringing Aditya Infotech Limited's intellectual property rights and engaging in misrepresentation, cheating, and fraud. A spokesperson for Aditya Infotech (CP PLUS) stated: \"The manufacturing and sale of counterfeit products under our trademark not only violates our intellectual property rights but also deceives innocent customers who trust the CP PLUS brand. We remain fully committed to protecting our customers and will continue to take strict legal action against such fraudulent activities.\" Aditya Infotech Limited has filed a formal First Information Report (FIR no. 751/25 dated August 29, 2025) under Section 63 of the Copyright Act for misrepresentation, cheating, forgery, and trademark infringement.The company reaffirmed its dedication to combating counterfeit activities and ensuring that customers receive only genuine, high-quality CP PLUS products. About Aditya Infotech Limited: Aditya Infotech Limited (BSE: 544466 | NSE: CPPLUS) offers a comprehensive range of advanced video security and surveillance products, technologies, and solutions for enterprise and consumer segments under our 'CP PLUS' brand, which has strong recall value. In addition, we offer solutions and services such as fully integrated security systems and Security-as-a-Service directly and through our distribution network that address the requirements of end-customers engaged in a broad range of sectors. Our manufacturing activities include the production and sale of our CP PLUS products and the provision of after-sales services in relation to the CP PLUS products sold by us. For more information, visit https://www.cpplusworld.com CP PLUS Unveils the Largest Range of Government-Approved & Cyber-Secured Smart Home Wi-Fi Cameras CP PLUS, India's leading security and surveillance brand, proudly introduces the largest range of Government-Approved & Cyber-Secured Smart Home Wi-Fi Cameras , setting a new benchmark for trusted home security. With the ezyKam+ series , CP PLUS empowers households to embrace smarter living while ensuring unparalleled safety, privacy, and digital trust. Designed with cutting-edge features such as 360° view, Human Detection, Motion Tracking, 2-Way Talk, and Private Mode , these cameras deliver not just security but peace of mind for every Indian home. At the heart of this innovation lies CTC (CP PLUS Trusted Core) Technology , which ensures strong cryptography algorithms, secure boot, and robust data protection . These features make CP PLUS the go-to choice for families looking for intelligent, cyber-secured, and reliable surveillance solutions. \"Security at home is no longer limited to physical protection, it is equally about digital safety and privacy. With our government-approved and cyber-secured Wi-Fi cameras, CP PLUS is making advanced surveillance accessible, secure, and trustworthy for every household in Bharat,\" said Mr. Aditya Khemka, Managing Director, CP PLUS (Aditya Infotech Ltd.) . The ezyKam+ Smart Wi-Fi range is also equipped with cloud storage options , ensuring that critical footage is safely stored and easily accessible. Whether it's monitoring children, elderly family members, or keeping an eye on your home while away, CP PLUS offers a seamless blend of convenience and confidence. By introducing the largest range of Government-Approved & Cyber-Secured Smart Wi-Fi Cameras , CP PLUS once again reaffirms its position as a pioneer in security innovations - strengthening its promise of making Bharat not just smarter, but also safer. CP PLUS Honored for Excellence in Strategic Electronics Manufacturing at ELCINA Defennovation Awards 2025 Bengaluru, September 2025: CP PLUS, under the aegis of Aditya Infotech Ltd., has once again reaffirmed its leadership in innovation and indigenization by being recognized with the prestigious Excellence in Strategic Electronics Manufacturing Award at the ELCINA Defennovation Awards 2025 in Bengaluru. This accolade celebrates CP PLUS's outstanding contributions to the large-scale manufacturing of Strategic Electronics - a sector vital to powering India's national security and strengthening the nation's resilience. By combining deep technological expertise with a vision rooted in self-reliance, CP PLUS has built an ecosystem that not only meets the highest global standards but also advances the government's Make in India and Atmanirbhar Bharat missions. Mr. Aditya Khemka, Managing Director, CP PLUS (Aditya Infotech Ltd.), said: \"At CP PLUS, innovation meets purpose. This award is a recognition of our long-standing commitment to developing advanced, indigenized technologies that safeguard our nation and create a resilient foundation for the future. We dedicate this honor to the spirit of Indian innovation and to the talented teams driving our mission forward.\" With a state-of-the-art manufacturing facility - India's largest for surveillance equipment - CP PLUS has been at the forefront of producing next-generation surveillance systems, electronic solutions, and mission-critical technologies that support both civilian safety and defense readiness. The company's foray into Strategic Electronics has further cemented its reputation as a pioneer in advancing India's technological sovereignty. The ELCINA Defennovation Awards are among the most respected recognitions in India's electronics and defense sector, celebrating organizations that demonstrate excellence, innovation, and impact in building technologies critical to national interest. As CP PLUS continues to scale its manufacturing and R&D capabilities, this recognition marks a milestone in its journey to empower India with world-class, indigenously developed Strategic Electronics that serve both present and future security needs. Call For Technical support, you can reach us on Toll No. +91-8800952952 Email For Any type of Support, query you can email us on support@adityagroup.com Live Chat Need assistance regarding Aditya Group? We'll get you the help you need. For Technical support, you can reach us on Toll No. +91-8800952952 For Any type of Support, query you can email us on support@adityagroup.com Need assistance regarding Aditya Group? We'll get you the help you need. ."
  ]
}