{
  "company": "www.ismconnect.com",
  "dominant_topics": [
    3,
    -1,
    2,
    1,
    0
  ],
  "topic_counts": {
    "3": 6,
    "-1": 6,
    "2": 3,
    "1": 2,
    "0": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis",
    "2": "demand, cctv, camera, ca, verkada",
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.3478260869565217,
    "framing_surveillance": 0.1739130434782608,
    "framing_market": 0.4782608695652174,
    "num_docs": 18
  },
  "topic_timeline": {
    "20": {
      "-1": 6,
      "0": 1,
      "1": 2,
      "2": 3,
      "3": 6
    }
  },
  "sample_docs": [
    "We thrive at the intersection of tech and media Revolutionizing how people interact with screen technology ISM offers a full suite of machine-learning, computer-vision products including touch-less access control, audience measurement and custom software. Access Control User Generated Content Moderation Content Management System Demographics Metrics Media Inventory Management Real-time Media Insights Building the next generation of digital-out-of-home networks ISM powers 4,000+ screens in 400+ locations, offering a diverse and engaging network inclusive of digital screens and experiential offerings. Featuring a variety of unique and complementary verticals hitting a coveted audience, all with real-time metrics and analytics. Live MLB, NBA & NHL games across Connected TV Experiential and Signage in Professional, Collegiate and Minor League Sports Digital Screen Network at 34 Minor League Baseball Stadiums Digital Screen Network at 21 NASCAR race tracks Solar Powered Digital Screen Network located across the Sun Belt Case Studies Ready to get started? We want to hear from you. Connect With Us We thrive at the intersection of tech and media Revolutionizing how people interact with screen technology ISM offers a full suite of machine-learning, computer-vision products including touch-less access control, audience measurement and custom software. User Generated Content Moderation Building the next generation of digital-out-of-home networks ISM powers 4,000+ screens in 400+ locations, offering a diverse and engaging network inclusive of digital screens and experiential offerings. Featuring a variety of unique and complementary verticals hitting a coveted audience, all with real-time metrics and analytics. Live MLB, NBA & NHL games across Connected TV Experiential and Signage in Professional, Collegiate and Minor League Sports Digital Screen Network at 34 Minor League Baseball Stadiums Digital Screen Network at 21 NASCAR race tracks Solar Powered Digital Screen Network located across the Sun Belt Ready to get started? We want to hear from you.",
    "See what ISM has been up to and how we've helped to shape an industry. Product September 09, 2020 ISM Analytics: Data is King When I was a kid, the idea of what \"data\" was evoked a vague image of a computer (think Commodore 64). Later on in school I learned about relational databases (hint: it's a bunch of tables!). Now, further along in my career, with the rise of Big Data and accompanying technological advances, I'm fortunate to […] Read more When I was a kid, the idea of what \"data\" was evoked a vague image of a computer (think Commodore 64). Later on in school I learned about relational databases (hint: it's a bunch of tables!). Now, further along in my career, with the rise of Big Data and accompanying technological advances, I'm fortunate to […] Product August 28, 2020 Facial Authentication: Frictionless Transactions for Customers When maturity of browsers in the late 1990s was making websites more than digital posters, and getting us all into ecommerce, a constant refrain was that it was not advisable to put one's credit card details online—fraudsters might start using your credit card. Today, due to advancement in secure network connection between browsers and servers […] Read more When maturity of browsers in the late 1990s was making websites more than digital posters, and getting us all into ecommerce, a constant refrain was that it was not advisable to put one's credit card details online—fraudsters might start using your credit card. Today, due to advancement in secure network connection between browsers and servers […] 10 Minutes With August 20, 2020 Flexibility. Mobility. Agility. Flexibility. Mobility. Agility. These are qualities every company should desire in their partners. As a former professional baseball player, I used to associate these interconnected with optimizing my physical strength, running speed and power. As an early teenager, I adopted a diligent routine that consisted of functional movement patterns. This was more than a […] Read more Flexibility. Mobility. Agility. These are qualities every company should desire in their partners. As a former professional baseball player, I used to associate these interconnected with optimizing my physical strength, running speed and power. As an early teenager, I adopted a diligent routine that consisted of functional movement patterns. This was more than a […] 10 Minutes With August 03, 2020 How digital disruption is changing the face of live event advertising In our series, 10 Minutes With, we introduce some of our senior executives and get their take on how the media and technology landscape is changing. Michael Verlatti is a doer, seller, problem solver, entrepreneur, impassioned live experience creator, event junkie, operations expert, and preacher of the do/think balance. He brings twenty years of NASCAR […] Read more In our series, 10 Minutes With, we introduce some of our senior executives and get their take on how the media and technology landscape is changing. Michael Verlatti is a doer, seller, problem solver, entrepreneur, impassioned live experience creator, event junkie, operations expert, and preacher of the do/think balance. He brings twenty years of NASCAR […]",
    "See what ISM has been up to and how we've helped to shape an industry. Product September 09, 2020 ISM Analytics: Data is King When I was a kid, the idea of what \"data\" was evoked a vague image of a computer (think Commodore 64). Later on in school I learned about relational databases (hint: it's a bunch of tables!). Now, further along in my career, with the rise of Big Data and accompanying technological advances, I'm fortunate to […] Read more When I was a kid, the idea of what \"data\" was evoked a vague image of a computer (think Commodore 64). Later on in school I learned about relational databases (hint: it's a bunch of tables!). Now, further along in my career, with the rise of Big Data and accompanying technological advances, I'm fortunate to […] Product August 28, 2020 Facial Authentication: Frictionless Transactions for Customers When maturity of browsers in the late 1990s was making websites more than digital posters, and getting us all into ecommerce, a constant refrain was that it was not advisable to put one's credit card details online—fraudsters might start using your credit card. Today, due to advancement in secure network connection between browsers and servers […] Read more When maturity of browsers in the late 1990s was making websites more than digital posters, and getting us all into ecommerce, a constant refrain was that it was not advisable to put one's credit card details online—fraudsters might start using your credit card. Today, due to advancement in secure network connection between browsers and servers […] Product July 27, 2020 Computer Vision In The Time Of Covid-19 Even before Covid-19, limiting touch on public displays was a good hygiene practice. In digital signage, whenever \"interactivity\" is mentioned most think of touch interactivity, but few think of social media interactivity or other forms of interaction with the viewing public. While one-to-one touch interactivity, such as downloading a boarding pass or dispensing cash from […] Read more Even before Covid-19, limiting touch on public displays was a good hygiene practice. In digital signage, whenever \"interactivity\" is mentioned most think of touch interactivity, but few think of social media interactivity or other forms of interaction with the viewing public. While one-to-one touch interactivity, such as downloading a boarding pass or dispensing cash from […] Product July 27, 2020 Rethink The Takeout Experience THE CHALLENGE Restaurant takeout has been an afterthought for years. Starting the second you place an order with the hostess / manager / order taker juggling multiple responsibilities in a chaotic environment, the \"Experience\" associated with a restaurant begins. Once you finally connect with someone that tries to understand the intricacies of you order (add […] Read more THE CHALLENGE Restaurant takeout has been an afterthought for years. Starting the second you place an order with the hostess / manager / order taker juggling multiple responsibilities in a chaotic environment, the \"Experience\" associated with a restaurant begins. Once you finally connect with someone that tries to understand the intricacies of you order (add […]",
    "Sports July 27, 2020 Evolution of the ISM-MiLB Partnership Contributed by Glenn Borgmann Think back to the last time you attended a baseball game. Whether you were at Citi Field watching the Mets, or in Durham taking in a Bulls game you were likely treated to much more than a ballgame as you were hunkered down over your Sweet Potato Tots or Rendezvous BBQ Nachos. Technology commonly seen at today's venues enable teams to engage seated fans throughout the game, with elements such as LED video boards, ribbon boards, sound systems and in-game camera crews working in concert maximize the fan experience and brand visibility. But how have ballparks evolved for fans once they get up from their seat? Afterall, consumer behavior at ballgames has changed. Fans attend games today in large part to hang with their family and friends, and less for the on-field product. Anecdotal reports have the average baseball fan out of their seat for at least a few innings per game, and who can blame them? Stadium concourses resemble small carnivals, much different from the dark stadium runways of old. Menus are amazing, kids can often find bounce houses and mini-golf, and there are plenty of spots to grab an adult beverage and socialize. But as for the tech in stadium concourses, it is often limited to digital menu boards or TVs playing the in-game feed, and that is where ISM comes in. Beginning in the Summer of 2018, ISM partnered with Minor League Baseball (MiLB) to establish the largest connected digital network in sports. By Opening Night 2019, the Allegiant Airline Network was online in 25 MiLB parks, enabling a level of fan engagement we have come to expect while seated at MiLB parks, but perhaps something unexpected when we are taking in the sites around the park. The average ISM ballpark deployment in MiLB is 11 LCD screens, placed strategically in high-traffic and extended dwell time spaces such as social decks, concession areas and main concourses. These smart digital-out-of-home networks (DOOH) engage fans through compelling content, created in collaboration with each team, ensuring a fresh mix of baseball and team-related content (ever see players hitting laser beam pitches with light sabers, or a 6-foot tall Blue Bull riding a 4-wheeler across the outfield?), along with content from local and national brand partners. Programming is remotely managed by ISM using Publish , our proprietary CMS which enables a unique run-of-show for each screen within each stadium every night throughout our partners' 70-game home schedule. MiLB stadiums consistently rank at the most fan-friendly game to attend; the league's 160 teams saw 14 million unique and 41 million total visitors in 2019 and boasts the highest percentage of female fans in professional sports. While business is good, the league and its teams are always looking for ways to evolve their approach to fan engagement. ISM is also playing a key role here, providing each team and brand partner with data captured at each game with Audience , ISM's facial recognition software measuring fan engagement to each piece of content. As the ISM-MiLB partnership continues to grow, additional ballparks will come online (34 the next time a pitch is thrown), and our expertise on engaging sports fans through effective digital content will expand through Audience . How can ISM help your organization reach millions of baseball fans? Let us know. More on this topic Sports Then & Now: Navigating the In-Venue Advertising Landscape in Sports Understanding Sports Through an Advertising Lens As someone who grew up attending, watching and practically... Think back to the last time you attended a baseball game. Whether you were at Citi Field watching the Mets, or in Durham taking in a Bulls game you were likely treated to much more than a ballgame as you were hunkered down over your Sweet Potato Tots or Rendezvous BBQ Nachos. Technology commonly seen at today's venues enable teams to engage seated fans throughout the game, with elements such as LED video boards, ribbon boards, sound systems and in-game camera crews working in concert maximize the fan experience and brand visibility. But how have ballparks evolved for fans once they get up from their seat? Afterall, consumer behavior at ballgames has changed. Fans attend games today in large part to hang with their family and friends, and less for the on-field product. Anecdotal reports have the average baseball fan out of their seat for at least a few innings per game, and who can blame them? Stadium concourses resemble small carnivals, much different from the dark stadium runways of old. Menus are amazing, kids can often find bounce houses and mini-golf, and there are plenty of spots to grab an adult beverage and socialize. But as for the tech in stadium concourses, it is often limited to digital menu boards or TVs playing the in-game feed, and that is where ISM comes in. Beginning in the Summer of 2018, ISM partnered with Minor League Baseball (MiLB) to establish the largest connected digital network in sports. By Opening Night 2019, the Allegiant Airline Network was online in 25 MiLB parks, enabling a level of fan engagement we have come to expect while seated at MiLB parks, but perhaps something unexpected when we are taking in the sites around the park. The average ISM ballpark deployment in MiLB is 11 LCD screens, placed strategically in high-traffic and extended dwell time spaces such as social decks, concession areas and main concourses. These smart digital-out-of-home networks (DOOH) engage fans through compelling content, created in collaboration with each team, ensuring a fresh mix of baseball and team-related content (ever see players hitting laser beam pitches with light sabers, or a 6-foot tall Blue Bull riding a 4-wheeler across the outfield?), along with content from local and national brand partners. Programming is remotely managed by ISM using Publish , our proprietary CMS which enables a unique run-of-show for each screen within each stadium every night throughout our partners' 70-game home schedule. MiLB stadiums consistently rank at the most fan-friendly game to attend; the league's 160 teams saw 14 million unique and 41 million total visitors in 2019 and boasts the highest percentage of female fans in professional sports. While business is good, the league and its teams are always looking for ways to evolve their approach to fan engagement. ISM is also playing a key role here, providing each team and brand partner with data captured at each game with Audience , ISM's facial recognition software measuring fan engagement to each piece of content. As the ISM-MiLB partnership continues to grow, additional ballparks will come online (34 the next time a pitch is thrown), and our expertise on engaging sports fans through effective digital content will expand through Audience . How can ISM help your organization reach millions of baseball fans? Let us know. More on this topic Understanding Sports Through an Advertising Lens As someone who grew up attending, watching and practically...",
    "ISM & Conditions INTRODUCTION ISM Connect, LLC (\"ISM\" or \"we\" or \"us\") respects your privacy and is committed to taking reasonable steps towards protecting your privacy online and managing your information through our compliance with this policy. This policy describes the types of information we may collect from you or that you may provide when you (i) use ISM's mobile application, and/or (ii) use its associated website located at www.ismconnect.com (the \"Website\"), (collectively, the ISM mobile application and the Website shall be referred to as the \"Platform\") and our practices for collecting, using, maintaining, protecting and disclosing that information. The Platform is designed to help you connect with friends, play games, gain faster access in venues or areas within venues (\"Venues\") and receive information and promotions relating to certain live events (\"Events\") that partner with ISM. In order to work, the Platform needs to know your location and other identifying information, including facial likeness. This policy applies to (i) the Platform; (ii) any e-mail, text and other electronic messages concerning ISM's operations, products or services; and (iii) our marketing contacts with you, including your interactions with our advertising and applications on third-party websites (e.g., Facebook and Instagram). This policy does not apply to (a) information about you that may be processed, stored, or hosted by our customers using the Platform; (b) other websites to which we may link; or (c) other companies or persons who might be listed as third-party contacts, vendors or suppliers on the Platform, or to whom we may refer you if you call or write us. We may post links on the Platform as a way of helping you locate related information and products, however, when linking to another website, you must review that website's because other websites may not protect or process your information in the same manner as ISM. Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, do not use the Platform or provide ISM with any of your personal information. By accessing or using the Platform and/or by contacting ISM and providing any personal information, you consent to the collection and use of information by ISM in accordance with this . We may change this policy from time to time without prior notice. All changes to this policy will be posted at www.ismconnect.com/privacy-policy and your continued use of the Platform after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates. You can see the date on which the latest version of this was posted. CHILDREN UNDER THE AGE OF 16 Our Platform is not intended for anyone under 16 years of age. No one under age 16 is authorized to use, or provide any information to, the Platform. Further, in accordance with the Children's Online Privacy Protection Act (\"COPPA\"), we do not request, or knowingly collect, personal information from children under 16. If we learn of any mistaken or inadvertent collection or receipt of personal information from a child under 16 through their misuse of the Platform, we will delete that 170833.2 information from our records. We ask all parents and guardians to assist us in our efforts to comply with COPPA by prohibiting children under the age of 16 from providing ISM with any personal information or using the Platform without parental oversight and assistance. If you believe we might have any information from or about a child under 16, please contact us at legal@ismconnect.com. INFORMATION WE COLLECT ABOUT YOU AND HOW WE COLLECT IT We may collect several types of information from and about users of our Platform, including, but not limited to, information: by which you may be personally identified, such as name, postal address, e-mail address, telephone number, time and dates of visits to the Platform, comments or postings on the Platform, your social media account information, or any other identifier by which you may be contacted online or offline (\"personal information\"); that is about you but individually does not specifically identify you, such as the websites from which you link to our Platform, and aggregated, non-identifying information that is derived from your personal information (such as the number of users accessing our Platform from a particular geographic area); about your internet connection, the equipment you use to access our Platform and usage details; or concerning your location. We automatically receive your location whenever the Platform is running on your device through a variety of means that may provide us with information on nearby Wi-Fi- access points and cell towers. We may also rely on GPS information collected by your mobile device or other information you provide us. Please note that the Platform will share your location whenever it is running, including when running in the background. In order to cease the sharing of location information you must completely close out of the Platform. We collect this information: Directly from you when you provide it to us; Automatically as you navigate through the Platform. Information collected automatically may include usage details, IP addresses, mobile carrier, browser and information collected through cookies, web beacons and other geolocation information; and From third parties, for instance, if you receive an in-Platform promotion or other offer from a third-party vendor or customer, or if you choose to provide personal information to a third party vendor, customer, or advertiser, that third party may provide us with certain information about your interaction, including personal information. INFORMATION YOU PROVIDE TO US The information we collect on or through our Platform may include: Information that you provide by filling in forms on our Platform. This includes information provided at the time of registering with our Platform, posting material or requesting further services. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Platform. Records and copies of your correspondence (including e-mail addresses), if you contact us. 170833.2 Your responses to surveys that we might ask you to complete for research purposes. Details of transactions you carry out through our Platform and of the fulfilment of your orders. You may be required to provide financial information before placing an order through our Platform. Your search queries on the Platform. You also may provide information to be published or displayed (hereinafter, \"posted\") on public areas of the Platform, or transmitted to other users of the Platform or third parties (collectively, \"User Contributions\"). User Contributions may include your public profile and any reviews and/or ratings that you choose to post on the Platform. Your User Contributions may be available to the general public and are posted at your own risk. Please use discretion when posting User Contributions and avoid posting personal information. Additionally, we cannot control the actions of other users of the Platform or the general public with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons. Neither we, nor any of our third-party service providers, is or shall be responsible for any use by any unauthorized person of any personal information you disclose through the Platform. INFORMATION WE COLLECT THROUGH AUTOMATIC DATA COLLECTION TECHNOLOGIES As you navigate through or near and interact with our Platform, we may collect certain information about you and your equipment, browsing actions and patterns, via automated technologies such as cookies and web beacons, and outside sources, such as email lists from third parties that may be used for marketing purposes. Such information may include details of your visits to our Platform, including, without limitation, traffic data, location, data, logs and other communications data and the resources that you access and use on the Platform as well as information about your computer or mobile device and Internet connection including IP address, operating system, browser type and wireless carrier. We also may use these technologies to collect information about your online activities over time and across third-party websites or other online services (behavioral tracking). The information we collect automatically is statistical data and may include personal information. It helps us to improve our Platform and to deliver a better and more personalized service, including by enabling us to: Estimate viewing times and usage patterns. Store information about your preferences, allowing us to customize our Platform according to your individual interests. Speed up your searches. Recognize you when you return to our Platform The technologies we use for this automatic data collection may include: Cookies (or browser cookies). A cookie is a small amount of data placed on the hard drive of your computer or mobile device. You may refuse to accept browser cookies by activating the appropriate setting on your browser or device. However, if you select this setting you may be unable to access certain parts of our Platform. 170833.2 Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Platform. Server Logs. A web \"server log\" is a record of activity created by a computer that delivers certain web pages to your browser. Certain activities that you perform on our Platform may record information in server logs, such as if you enter a search term into a search box located on the Platform . The server log may record, for example, the search or information about your browser, such as your IP address and the cookies set on your browser. Widgets. A \"widget\" is generally an application that can be embedded in a webpage. Widgets can provide real-time information to the Platform. Widgets are often provided by third-parties; we may provide widgets on our Platform. Widgets may enable the third parties that provide them to collect data about users visiting the Platform. THIRD-PARTY USE OF COOKIES AND OTHER TRACKING TECHNOLOGIES. Some content on the Platform, including advertisements, is served by third-parties, including advertisers, ad networks and servers. These third parties may use cookies alone or in conjunction with web beacons or other tracking technologies to collect information about you when you use our Platform. The information they collect may be associated with your personal information or they may collect information, including personal information, about your online activities over time and across different websites and other online services. They may use this information to provide you with interest-based (behavioral) advertising or other targeted content. We do not control these third parties' tracking technologies or how they may be used. If you have any questions about an advertisement or other targeted content, you should contact the responsible provider directly. HOW WE USE YOUR INFORMATION We, and our authorized third party service providers, may use information that we collect about you or that you provide to us, including any personal information: (i) to present our Platform and its contents to you; (ii) to provide you with information or services that you request from us; (iii) analyze trends and conduct research about improving our products, services and Platform ; (iv) learn about our users' needs; (v) contact users for research, informational or marketing purposes; (vi) provide our advertisers and marketing partners with anonymized information about users of the Platform ; (vii) track traffic patterns and usage of the Platform; (viii) enable online registration; (ix) correlate information with other commercially available information to identify demographics and preferences to assist us or our partners and affiliates in marketing efforts; (x) address information security and/or privacy practices control, network functioning, engineering, and troubleshooting issues; (xi) investigate claims and/or legal actions, violations of law or agreements, and compliance with relevant applicable laws and legal process; (xii) based on our good-faith belief that it is necessary to conform or comply with the law, or otherwise to disclose information to prevent fraud and reduce credit risks, to cooperate with police and other governmental authorities, or to protect the rights, property or safety of visitors to the Platform or the public; (xiii) process or engage in a sale of all or part of our business, or if we go through a reorganization or merger; (xiv) to provide you with notices about your account; (xv) to carry out our obligations and enforce our rights arising from any contracts entered into between 170833.2 you and us, including providing you with information that you requested; (xvi) to notify you about changes to our Platform or any products or services we offer or provide though it; (xvii) to allow you to participate in interactive features on our Platform ; and (xviii) for any other purpose with your consent. We may also use your information to contact you about our own and third-parties' goods and services that may be of interest to you and to display advertisements to our advertisers' target audiences. DISCLOSURE OF YOUR INFORMATION We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this : To our subsidiaries and affiliates. To contractors, service providers and other third parties we use to support our business. To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of ISM's assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by ISM about our Platform users is among the assets transferred. To third parties to market their products or services to you or provide you with special incentives or discounts. To fulfill the purpose for which you provide it (e.g., contacting you via email). For any other purpose disclosed by us when you provide the information. We may also disclose your personal information: To comply with any court order, law or legal process, including responding to any government or regulatory request. To enforce or apply our of use (available at www.ismconnect.com/ ) and other agreements, including for any applicable billing and collection purposes. If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of ISM, our customers or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection. CHOICES ABOUT HOW WE USE AND DISCLOSE YOUR INFORMATION We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information: Tracking and Advertising. With respect to our Website, you can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. If you disable or refuse cookies, please note that some parts of the Website may then be inaccessible or not function properly. 170833.2 Geolocation. Because the Platform relies on your location to provide you with relevant information and promotions, disabling location services on your mobile device will render the Platform inoperable. Promotional Offers from ISM. If you do not wish to have your e- mail address/contact information used by ISM to promote our own or third parties' products or services, you can opt-out by sending us an e- mail stating your request and your exact name and address to unsubscribe@ismconnect.com. If we have sent you a promotional e-mail, you may click the relevant unsubscribe links in those emails. Third Party Advertising. We do not control third parties' advertising, including interest-based advertising. However, these third parties may provide you with ways to choose not to have your information collected or used in this way. ACCESSING AND CORRECTING YOUR INFORMATION You can update and change certain personal information that you provided us by contacting us at contact@ismconnect.com. YOUR CALIFORNIA PRIVACY RIGHTS California law permits users of our Platform that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to legal@ismconnect.com. DATA SECURITY We have implemented commercially reasonable physical and electronic measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration and disclosure. However, no security measures are perfect or impenetrable and no data can be guaranteed to be totally secure. The safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our Platform, you are responsible for keeping this password confidential. We ask you not to share your password with anyone. Unfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted to our Platform nor can we guarantee that such information will not become publicly available. Any transmission of personal information is at your own risk. We are not responsible for circumvention of any privacy settings or security measures contained on the Platform. You can reduce some of these risks by using common-sense security practices such as choosing a strong password, using different passwords for different services, and using up-to-date antivirus software on your electronic devices. USERS OUTSIDE OF THE UNITED STATES The Platform is not meant for users outside of the United States. If you are visiting the Website, or otherwise using the Platform from a location outside of the United States, your connection will be through and to servers located in the United States. All information you receive from the Platform may be created on servers located in the United States, and all information you provide may be maintained on web 170833.2 servers and systems located within the United States. The data protection laws in the United States and other countries might not be the same as those in your country. By using the Sites or submitting information to us, you specifically consent to the transfer of your information to the United States and to the facilities and servers we use, and to those with whom we may share your information. CHANGES TO OUR It is our policy to post any changes we make to our on this page. The date the was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Platform and this at www.ismconnect.com/privacy-policy to check for any changes. CONTACT INFORMATION To ask questions or comment about this and our privacy practices, contact us at: ISM Connect, LLC 100 S. Main Street, Doylestown, PA 18901 Email address: privacy@ismconnect.com ISM & Conditions INTRODUCTION ISM Connect, LLC (\"ISM\" or \"we\" or \"us\") respects your privacy and is committed to taking reasonable steps towards protecting your privacy online and managing your information through our compliance with this policy. This policy describes the types of information we may collect from you or that you may provide when you (i) use ISM's mobile application, and/or (ii) use its associated website located at www.ismconnect.com (the \"Website\"), (collectively, the ISM mobile application and the Website shall be referred to as the \"Platform\") and our practices for collecting, using, maintaining, protecting and disclosing that information. The Platform is designed to help you connect with friends, play games, gain faster access in venues or areas within venues (\"Venues\") and receive information and promotions relating to certain live events (\"Events\") that partner with ISM. In order to work, the Platform needs to know your location and other identifying information, including facial likeness. This policy applies to (i) the Platform; (ii) any e-mail, text and other electronic messages concerning ISM's operations, products or services; and (iii) our marketing contacts with you, including your interactions with our advertising and applications on third-party websites (e.g., Facebook and Instagram). This policy does not apply to (a) information about you that may be processed, stored, or hosted by our customers using the Platform; (b) other websites to which we may link; or (c) other companies or persons who might be listed as third-party contacts, vendors or suppliers on the Platform, or to whom we may refer you if you call or write us. We may post links on the Platform as a way of helping you locate related information and products, however, when linking to another website, you must review that website's because other websites may not protect or process your information in the same manner as ISM. Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, do not use the Platform or provide ISM with any of your personal information. By accessing or using the Platform and/or by contacting ISM and providing any personal information, you consent to the collection and use of information by ISM in accordance with this . We may change this policy from time to time without prior notice. All changes to this policy will be posted at www.ismconnect.com/privacy-policy and your continued use of the Platform after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates. You can see the date on which the latest version of this was posted. CHILDREN UNDER THE AGE OF 16 Our Platform is not intended for anyone under 16 years of age. No one under age 16 is authorized to use, or provide any information to, the Platform. Further, in accordance with the Children's Online Privacy Protection Act (\"COPPA\"), we do not request, or knowingly collect, personal information from children under 16. If we learn of any mistaken or inadvertent collection or receipt of personal information from a child under 16 through their misuse of the Platform, we will delete that 170833.2 information from our records. We ask all parents and guardians to assist us in our efforts to comply with COPPA by prohibiting children under the age of 16 from providing ISM with any personal information or using the Platform without parental oversight and assistance. If you believe we might have any information from or about a child under 16, please contact us at legal@ismconnect.com. INFORMATION WE COLLECT ABOUT YOU AND HOW WE COLLECT IT We may collect several types of information from and about users of our Platform, including, but not limited to, information: by which you may be personally identified, such as name, postal address, e-mail address, telephone number, time and dates of visits to the Platform, comments or postings on the Platform, your social media account information, or any other identifier by which you may be contacted online or offline (\"personal information\"); that is about you but individually does not specifically identify you, such as the websites from which you link to our Platform, and aggregated, non-identifying information that is derived from your personal information (such as the number of users accessing our Platform from a particular geographic area); about your internet connection, the equipment you use to access our Platform and usage details; or concerning your location. We automatically receive your location whenever the Platform is running on your device through a variety of means that may provide us with information on nearby Wi-Fi- access points and cell towers. We may also rely on GPS information collected by your mobile device or other information you provide us. Please note that the Platform will share your location whenever it is running, including when running in the background. In order to cease the sharing of location information you must completely close out of the Platform. We collect this information: Directly from you when you provide it to us; Automatically as you navigate through the Platform. Information collected automatically may include usage details, IP addresses, mobile carrier, browser and information collected through cookies, web beacons and other geolocation information; and From third parties, for instance, if you receive an in-Platform promotion or other offer from a third-party vendor or customer, or if you choose to provide personal information to a third party vendor, customer, or advertiser, that third party may provide us with certain information about your interaction, including personal information. INFORMATION YOU PROVIDE TO US The information we collect on or through our Platform may include: Information that you provide by filling in forms on our Platform. This includes information provided at the time of registering with our Platform, posting material or requesting further services. We may also ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with our Platform. Records and copies of your correspondence (including e-mail addresses), if you contact us. 170833.2 Your responses to surveys that we might ask you to complete for research purposes. Details of transactions you carry out through our Platform and of the fulfilment of your orders. You may be required to provide financial information before placing an order through our Platform. Your search queries on the Platform. You also may provide information to be published or displayed (hereinafter, \"posted\") on public areas of the Platform, or transmitted to other users of the Platform or third parties (collectively, \"User Contributions\"). User Contributions may include your public profile and any reviews and/or ratings that you choose to post on the Platform. Your User Contributions may be available to the general public and are posted at your own risk. Please use discretion when posting User Contributions and avoid posting personal information. Additionally, we cannot control the actions of other users of the Platform or the general public with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons. Neither we, nor any of our third-party service providers, is or shall be responsible for any use by any unauthorized person of any personal information you disclose through the Platform. INFORMATION WE COLLECT THROUGH AUTOMATIC DATA COLLECTION TECHNOLOGIES As you navigate through or near and interact with our Platform, we may collect certain information about you and your equipment, browsing actions and patterns, via automated technologies such as cookies and web beacons, and outside sources, such as email lists from third parties that may be used for marketing purposes. Such information may include details of your visits to our Platform, including, without limitation, traffic data, location, data, logs and other communications data and the resources that you access and use on the Platform as well as information about your computer or mobile device and Internet connection including IP address, operating system, browser type and wireless carrier. We also may use these technologies to collect information about your online activities over time and across third-party websites or other online services (behavioral tracking). The information we collect automatically is statistical data and may include personal information. It helps us to improve our Platform and to deliver a better and more personalized service, including by enabling us to: Estimate viewing times and usage patterns. Store information about your preferences, allowing us to customize our Platform according to your individual interests. Speed up your searches. Recognize you when you return to our Platform The technologies we use for this automatic data collection may include: Cookies (or browser cookies). A cookie is a small amount of data placed on the hard drive of your computer or mobile device. You may refuse to accept browser cookies by activating the appropriate setting on your browser or device. However, if you select this setting you may be unable to access certain parts of our Platform. 170833.2 Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Platform. Server Logs. A web \"server log\" is a record of activity created by a computer that delivers certain web pages to your browser. Certain activities that you perform on our Platform may record information in server logs, such as if you enter a search term into a search box located on the Platform . The server log may record, for example, the search or information about your browser, such as your IP address and the cookies set on your browser. Widgets. A \"widget\" is generally an application that can be embedded in a webpage. Widgets can provide real-time information to the Platform. Widgets are often provided by third-parties; we may provide widgets on our Platform. Widgets may enable the third parties that provide them to collect data about users visiting the Platform. THIRD-PARTY USE OF COOKIES AND OTHER TRACKING TECHNOLOGIES. Some content on the Platform, including advertisements, is served by third-parties, including advertisers, ad networks and servers. These third parties may use cookies alone or in conjunction with web beacons or other tracking technologies to collect information about you when you use our Platform. The information they collect may be associated with your personal information or they may collect information, including personal information, about your online activities over time and across different websites and other online services. They may use this information to provide you with interest-based (behavioral) advertising or other targeted content. We do not control these third parties' tracking technologies or how they may be used. If you have any questions about an advertisement or other targeted content, you should contact the responsible provider directly. HOW WE USE YOUR INFORMATION We, and our authorized third party service providers, may use information that we collect about you or that you provide to us, including any personal information: (i) to present our Platform and its contents to you; (ii) to provide you with information or services that you request from us; (iii) analyze trends and conduct research about improving our products, services and Platform ; (iv) learn about our users' needs; (v) contact users for research, informational or marketing purposes; (vi) provide our advertisers and marketing partners with anonymized information about users of the Platform ; (vii) track traffic patterns and usage of the Platform; (viii) enable online registration; (ix) correlate information with other commercially available information to identify demographics and preferences to assist us or our partners and affiliates in marketing efforts; (x) address information security and/or privacy practices control, network functioning, engineering, and troubleshooting issues; (xi) investigate claims and/or legal actions, violations of law or agreements, and compliance with relevant applicable laws and legal process; (xii) based on our good-faith belief that it is necessary to conform or comply with the law, or otherwise to disclose information to prevent fraud and reduce credit risks, to cooperate with police and other governmental authorities, or to protect the rights, property or safety of visitors to the Platform or the public; (xiii) process or engage in a sale of all or part of our business, or if we go through a reorganization or merger; (xiv) to provide you with notices about your account; (xv) to carry out our obligations and enforce our rights arising from any contracts entered into between 170833.2 you and us, including providing you with information that you requested; (xvi) to notify you about changes to our Platform or any products or services we offer or provide though it; (xvii) to allow you to participate in interactive features on our Platform ; and (xviii) for any other purpose with your consent. We may also use your information to contact you about our own and third-parties' goods and services that may be of interest to you and to display advertisements to our advertisers' target audiences. DISCLOSURE OF YOUR INFORMATION We may disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose personal information that we collect or you provide as described in this : To our subsidiaries and affiliates. To contractors, service providers and other third parties we use to support our business. To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of ISM's assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by ISM about our Platform users is among the assets transferred. To third parties to market their products or services to you or provide you with special incentives or discounts. To fulfill the purpose for which you provide it (e.g., contacting you via email). For any other purpose disclosed by us when you provide the information. We may also disclose your personal information: To comply with any court order, law or legal process, including responding to any government or regulatory request. To enforce or apply our of use (available at www.ismconnect.com/ ) and other agreements, including for any applicable billing and collection purposes. If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of ISM, our customers or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection. CHOICES ABOUT HOW WE USE AND DISCLOSE YOUR INFORMATION We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information: Tracking and Advertising. With respect to our Website, you can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. If you disable or refuse cookies, please note that some parts of the Website may then be inaccessible or not function properly. 170833.2 Geolocation. Because the Platform relies on your location to provide you with relevant information and promotions, disabling location services on your mobile device will render the Platform inoperable. Promotional Offers from ISM. If you do not wish to have your e- mail address/contact information used by ISM to promote our own or third parties' products or services, you can opt-out by sending us an e- mail stating your request and your exact name and address to unsubscribe@ismconnect.com. If we have sent you a promotional e-mail, you may click the relevant unsubscribe links in those emails. Third Party Advertising. We do not control third parties' advertising, including interest-based advertising. However, these third parties may provide you with ways to choose not to have your information collected or used in this way. ACCESSING AND CORRECTING YOUR INFORMATION You can update and change certain personal information that you provided us by contacting us at contact@ismconnect.com. YOUR CALIFORNIA PRIVACY RIGHTS California law permits users of our Platform that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to legal@ismconnect.com. DATA SECURITY We have implemented commercially reasonable physical and electronic measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration and disclosure. However, no security measures are perfect or impenetrable and no data can be guaranteed to be totally secure. The safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our Platform, you are responsible for keeping this password confidential. We ask you not to share your password with anyone. Unfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted to our Platform nor can we guarantee that such information will not become publicly available. Any transmission of personal information is at your own risk. We are not responsible for circumvention of any privacy settings or security measures contained on the Platform. You can reduce some of these risks by using common-sense security practices such as choosing a strong password, using different passwords for different services, and using up-to-date antivirus software on your electronic devices. USERS OUTSIDE OF THE UNITED STATES The Platform is not meant for users outside of the United States. If you are visiting the Website, or otherwise using the Platform from a location outside of the United States, your connection will be through and to servers located in the United States. All information you receive from the Platform may be created on servers located in the United States, and all information you provide may be maintained on web 170833.2 servers and systems located within the United States. The data protection laws in the United States and other countries might not be the same as those in your country. By using the Sites or submitting information to us, you specifically consent to the transfer of your information to the United States and to the facilities and servers we use, and to those with whom we may share your information. CHANGES TO OUR It is our policy to post any changes we make to our on this page. The date the was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Platform and this at www.ismconnect.com/privacy-policy to check for any changes. CONTACT INFORMATION To ask questions or comment about this and our privacy practices, contact us at: ISM Connect, LLC 100 S. Main Street, Doylestown, PA 18901 Email address: privacy@ismconnect.com"
  ]
}