{
  "company": "www.innefu.com",
  "dominant_topics": [
    0,
    4,
    3,
    -1
  ],
  "topic_counts": {
    "0": 31,
    "4": 1,
    "3": 1,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.0564516129032258,
    "framing_surveillance": 0.8870967741935484,
    "framing_market": 0.0564516129032258,
    "num_docs": 34
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 31,
      "3": 1,
      "4": 1
    }
  },
  "sample_docs": [
    "Products Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Big Data Analytical Platform Applications AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Industry Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Resources Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs About Us Who are We Mission Statement Board of Advisors Press Contact Us These days Retailers are becoming victims of data security attacks such as fraud, identify theft and hacking as indicated by many highly publicized incidents. In Retail, the storage process and transmission of cardholder info gift a growing potential exposure for the retail merchant. For all such threats, the 'Payment Card Industry' has worked to develop and implement a variety of security standards to guard consumer and cardholder information, such as credit card numbers. Those retail organizations that stores, processes or transmits cardholder data should embrace robust end-user access controls to be PCI DSS compliant or risk audits, fines or the loss of the right to process payments via credit or debit card. AuthShield helps retail organizations to meet PCI DSS Compliance Guidelines- The decree of The Payment Card Industry Data Security Standards (PCI DSS) is that organizations who 'hold, process or pass' cardholder information should meet a minimum level of security. Part of this security is to protect remote logins with strong authentication. According to section 8.3, organizations must implement two-factor authentication for remote access to the network by employees, administrators and third party associates. Prophecy Guardian – Predictive Intelligence for Law Enforcement Prophecy Avenger – Early Warning System for Financial Fraud Prophecy Innsight – Social Media Analytics Prophecy Vision – Facial Biometrics & Surveillance Prophecy InteleLinx – Call Data record analysis 783, 7th Floor, Aggarwal Cyber Plaza II, Netaji Subhash Place, Pitampura, Delhi-110034 Copyright - © INNEFU | Powered by ITPL",
    "Products Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Big Data Analytical Platform Applications AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Industry Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Resources Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs About Us Who are We Mission Statement Board of Advisors Press Contact Us Virtual Private Network (VPN) is one of the most preferred options when it comes to sharing of files, documents etc. between employees of an organization. It is generally used by business concerns and enterprises rather than individuals. It allows the remote users to transmit or exchange data over a public domain which is secured through encryption, thus, acting as a private network. VPN connects multiple users or servers over a single network creating point to point connections by creating an encrypted tunnel which is secure from eavesdropping and restricts the unauthorized access of the outsiders. Users are required to use username and password for logging onto the private network. But, if the account details get hacked, which isn't very difficult these days, then, the transmission of company's valuable data is at jeopardy. Thus, to utilize the benefits of VPN's technology more effectively, it is strongly recommended by security experts to use strong two-factor authentication to secure the access and transmission over VPN. AuthShield two-factor authentication solution can be easily integrated with multiple VPN variants as it is designed to work with RADIUS Protocol as well as LDAP and Active Directory Repositories. Integrating with AuthShield two-factor Authentication Solution will result in reduction of risk of Identity Fraud for the enterprises. AuthShield two-factor authentication can protect both SSL and IPSEC VPN variants. Most of the popular devices from following vendors in market support integration with AuthShield seamlessly: CheckPoint Cisco VPN F5 VPN Fortinet Juniper NetGear Nortel Sonicwall Watchguard Cyberoam Open / Microsoft VPN Barracuda Networks Citrix PaloAlto Networks Accelpro Microsoft Unified Access Gateway (UAG). Prophecy Guardian – Predictive Intelligence for Law Enforcement Prophecy Avenger – Early Warning System for Financial Fraud Prophecy Innsight – Social Media Analytics Prophecy Vision – Facial Biometrics & Surveillance Prophecy InteleLinx – Call Data record analysis 783, 7th Floor, Aggarwal Cyber Plaza II, Netaji Subhash Place, Pitampura, Delhi-110034 Copyright - © INNEFU | Powered by ITPL",
    "We are a Series A Funded New Age Information Security & Data Analytics Company and we take pride in the fact that we have been delivering value to our customers with our innovative offerings and helping them adopt a variety of our security solutions that are based on cutting edge technologies like Artificial Intelligence, Predictive Intelligence, Facial Biometrics and so on. We are among the top 5 Cyber excellence companies globally (Holger Schulze awards) and have won similar recognitions at National and International arenas. To our credit, more than 100 customers in India already trust us and the list is only growing. Exciting things are happening at Innefu and we are all game for a big leap forward. We are seeking an experienced WPF developer to join our dynamic team. As a WPF developer, you will be responsible for designing and developing innovative, user-friendly desktop applications using the Windows Presentation Foundation framework. You will collaborate with cross-functional teams to create visually appealing and highly functional software solutions Create and maintain desktop applications using WPF Implement user interfaces and interactive features based on design spec Collaborate with UX/UI designers to ensure a seamless and visually appealing user experience. Write clean, efficient, and maintainable code, Debug and resolve software defects and issues. Conduct code reviews to ensure code quality and adherence to coding standards, integrate applications with backend services and databases, collaborate with quality assurance teams to identify and fix software bugs Proven experience as a WPF developer, with a strong portfolio Proficient in C# and .NET framework. Experience with MVVM (Model-View-View Model) architectural pattern. Familiarity with design principles and UI/UX best practices Knowledge of XAML and data binding Experience with Agile/Scrum methodologies. VIEW MORE OPENINGS Java Developer / Sr. Java developer Education - B.Tech, MCA, Computer Engineering Location: Delhi Experience: 4-8 + Years apply now Python Developer Education - B.Tech, MCA, Computer Engineering Location: Delhi Experience: 4-5 years apply now Data Science Location: Delhi Experience: 4-6 Years apply now Sales Manager Location: Delhi Experience: 3-5 Years apply now Technical Product Manager - Python Location: Ahemdabad Experience: 3+ years apply now Front end Developer (Angular js) Location: Experience: 3+ years apply now PHP Developer for award winning AI Company Education - B.Tech, MCA, Computer Engineering Location: Experience: apply now Java Developer / Sr. Java developer Education - B.Tech, MCA, Computer Engineering Experience: 4-8 + Years Education - B.Tech, MCA, Computer Engineering Technical Product Manager - Python Front end Developer (Angular js) PHP Developer for award winning AI Company Education - B.Tech, MCA, Computer Engineering",
    "Network & Web Applications Vulnerability & Assessment AuthShield Two Factor Authentication Windows Logon with Active Directory Disk Level Encryption SSL VPN Web Applications Windows Logon Without Active Directory Core Banking Solutions Corporate Network Access Internet Banking Windows Logon with Active Directory Windows Logon Without Active Directory Penetration Testing for Web Applications & Internal Networks Customized Products and R&D Protecting web logins and transactions with two-factor authentication is the best way to protect against today's online threats. Innefus AuthShield allows you to efficiently and cost-effectively integrate two-factor authentication into your website, web application, mail servers, RDP etc. APIs are available to the authentication manager to ensure seamless integration. It only takes a few lines of code to add the login prompt to your application. AuthShield Two Factor Authentication | Internet Interception & Monitoring System | Tactical Internet Monitoring System | Cyber Cafè Surveillance | Link Analysis Internet Interception & Monitoring System | Tactical Internet Monitoring System | Cyber Cafè Surveillance | Link Analysis Tactical Internet Monitoring System | Cyber Cafè Surveillance | Link Analysis Cyber Cafè Surveillance | Link Analysis Network & Web Applications Vulnerability & Assessment | AuthShield Two Factor Authentication | Penetration Testing for Web Applications & Internal Networks | Managed Security Services | Customized Products and R&D AuthShield Two Factor Authentication | Penetration Testing for Web Applications & Internal Networks | Managed Security Services | Customized Products and R&D Penetration Testing for Web Applications & Internal Networks | Managed Security Services | Customized Products and R&D Managed Security Services | Customized Products and R&D Customized Products and R&D Banking & Financial Industry",
    "Products Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Cyber Security AuthShield Overview Why Multifactor Authentication Deep Auth Biometric Authentication OTP Tokens Security and Reliability Features and Benefits Data Analytics Prophecy Overview Big Data Analytical Platform Natural Language Processing Facial Biometrics Predictive Modelling Data Enrichment Features and Benefits Big Data Analytical Platform Applications AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis AuthShield Corporate Mail ERP Solutions Windows Login VPN Web Applications Remote Server Login Cloud infrastructure Others Prophecy Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Guardian –Intelligence for Law Enforcement Avenger – Financial Fraud Analytics Innsight – Social Media Analytics Vision – Facial Biometrics & Surveillance InteleLinx – Call Data record analysis Industry Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Cyber Security Law Enforcement Banking and Finance Government Enterprises SME's Healthcare Retail KPO Industry Enterprise Solutions Data Analytics Law Enforcement Banking and Finance Government Enterprises Enterprise Solutions Resources Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs Cyber Security Whitepapers Brochures Blogs Data Analytics Whitepapers Brochures Blogs About Us Who are We Mission Statement Board of Advisors Press Contact Us Protecting remote server logins with strong two-factor authentication is the easiest and most cost-effective way to secure your infrastructure against today's cyber threats. AuthShield two-factor authentication makes it easy to deploy two-factor authentication across your server infrastructure. Unix / SSH Secure Shell, or Secure Socket Shell (SSH) which it is commonly known as, is used to connect to remote computers or transmit data between remote computers securely over insecure channels by encryption. It is a command interface and a network protocol which is UNIX-based. In today's world, with increasing rate of cybercrimes and hacks, companies would like to do anything that allows its remote employees to connect securely. Using SSH, is one preferred option. This creates a secure connection between two ends which have SSH enabled at their end each. For data centers trying to meet compliance requirements, it has become imperative to ensure Two Factor Authentication protection for remote login. AuthShield implements 2FA on UNIX/SSH by integrating our custom PAM module on the server. This ensures that a user attempting to login into the server has to enter User Name, password as well as One Time Password to . Remote Windows Server Login AuthShield implements 2FA on Windows Server Login by integrating our custom windows credentials on the server. This ensures that a user attempting to login into the server has to enter User Name, password as well as One Time Password to . Prophecy Guardian – Predictive Intelligence for Law Enforcement Prophecy Avenger – Early Warning System for Financial Fraud Prophecy Innsight – Social Media Analytics Prophecy Vision – Facial Biometrics & Surveillance Prophecy InteleLinx – Call Data record analysis 783, 7th Floor, Aggarwal Cyber Plaza II, Netaji Subhash Place, Pitampura, Delhi-110034 Copyright - © INNEFU | Powered by ITPL"
  ]
}