{
  "company": "www.robotemi.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5,
    "framing_surveillance": 0.0,
    "framing_market": 0.5,
    "num_docs": 2
  },
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Specs Robox ROBOXâ\"¢ Navigation System Temi's human robot interaction and autonomous behavior 3D mapping Navigation User detection and tracking Obstacle avoidance Path planning Face recognition CPU ARM Hexa Core LINUX OS Sensors 360 degrees LIDAR 2 depth cameras 2 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Fully-autonomous navigation TEMI OS Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Voice interaction Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines User Interface Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction AI Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps SDK Available Built in Apps AI Assistant Be home Video calls News Personal DJ Developers Personal photographer Personal Caddy Home hub Entertainment Connectivity wifi MIMO Wi-Fi 802.11b/g/n/ac Bluetooth Bluetooth 4.0 Wireless short distance connectivity with devices and accessories Dimensions Size (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D Weight 26 lbs / 12 kg DISPLAY 10.1\" HD LCD screen Capacitive multi-touch for intuitive interface. (2560X1600) IPS LCD 16M colors Touch Capacity Display Pixel density: 300 (ppi) 400 cd/m2 max brightness (typical) Fingerprint-resistant coating Screen Tilt Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° Mics Microphone Array 4 Omni-directional digital mics Real-time localization Beam forming Acoustic echo cancellation Environment noise reduction Audio 20W Audio High fidelity equalizer One sub-woofer Two midrange speakers Two tweeters Passive radiators Acoustically transparent fabric CAMERAS 13 MP high resolution camera Autofocus 1080p@30FPS FOV 75 Degrees Digital zoom 5-Element lens Backside illumination sensor Hybrid IR filter Wide Camera 13MP wide camera for remote navigation FOV 110 Degrees, 1080p@30FPS Digital zoom TOF Depth Camera 30 FPS Up to 5 meters 70 FOV CPU CPU 1 ARM Quad core Operation System Human interaction computer based on Android architecture with proprietary launcher and User Interface CPU 2 ARM Hexa core LINUX OS Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption Power 8 Hours of operation per charge Autonomous charging- 220V/110V High performance docking station Lithium-Ion cells Mobility Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Maneuverability Zero turn radius Speed Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management Tray Wireless Charging The tray contains a standard wireless charger for your mobile phone Tray 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb In The Box 1 temi robot 1 Docking station+ Cable Instruction Manuals Robox ROBOXâ\"¢ Navigation System Temi's human robot interaction and autonomous behavior 3D mapping Navigation User detection and tracking Obstacle avoidance Path planning Face recognition CPU ARM Hexa Core LINUX OS Sensors 360 degrees LIDAR 2 depth cameras 2 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Fully-autonomous navigation TEMI OS Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Voice interaction Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines User Interface Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction AI Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps SDK Available Built in Apps AI Assistant Be home Video calls News Personal DJ Developers Personal photographer Personal Caddy Home hub Entertainment Connectivity wifi MIMO Wi-Fi 802.11b/g/n/ac Bluetooth Bluetooth 4.0 Wireless short distance connectivity with devices and accessories Dimensions Size (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D Weight 26 lbs / 12 kg DISPLAY 10.1\" HD LCD screen Capacitive multi-touch for intuitive interface. (2560X1600) IPS LCD 16M colors Touch Capacity Display Pixel density: 300 (ppi) 400 cd/m2 max brightness (typical) Fingerprint-resistant coating Screen Tilt Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° Mics Microphone Array 4 Omni-directional digital mics Real-time localization Beam forming Acoustic echo cancellation Environment noise reduction Audio 20W Audio High fidelity equalizer One sub-woofer Two midrange speakers Two tweeters Passive radiators Acoustically transparent fabric CAMERAS 13 MP high resolution camera Autofocus 1080p@30FPS FOV 75 Degrees Digital zoom 5-Element lens Backside illumination sensor Hybrid IR filter Wide Camera 13MP wide camera for remote navigation FOV 110 Degrees, 1080p@30FPS Digital zoom TOF Depth Camera 30 FPS Up to 5 meters 70 FOV CPU CPU 1 ARM Quad core Operation System Human interaction computer based on Android architecture with proprietary launcher and User Interface CPU 2 ARM Hexa core LINUX OS Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption Power 8 Hours of operation per charge Autonomous charging- 220V/110V High performance docking station Lithium-Ion cells Mobility Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Maneuverability Zero turn radius Speed Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management Tray Wireless Charging The tray contains a standard wireless charger for your mobile phone Tray 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb In The Box 1 temi robot 1 Docking station+ Cable Instruction Manuals Temi's human robot interaction and autonomous behavior User detection and tracking 360 degrees LIDAR 2 depth cameras 2 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps Bluetooth 4.0 Wireless short distance connectivity with devices and accessories (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D 26 lbs / 12 kg Capacitive multi-touch for intuitive interface. (2560X1600) IPS LCD 16M colors Touch Capacity Display Pixel density: 300 (ppi) 400 cd/m2 max brightness (typical) Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° 4 Omni-directional digital mics 13MP wide camera for remote navigation FOV 110 Degrees, 1080p@30FPS Up to 5 meters Human interaction computer based on Android architecture with proprietary launcher and User Interface Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption 8 Hours of operation per charge High performance docking station Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management The tray contains a standard wireless charger for your mobile phone 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb 1 Docking station+ Cable",
    "The Personal Robot Warranty We are confident that you will love your new temi ,however, if you are unsatisfied for any reason we are here to listen and take care of any problem you might have with the product. So, no worries ha? 12 month warranty Agents support Money back guarantee Free returns In the box 1 temi Your own personal robot ready to get going 1 Docking Station + 1 Cable Wall fitted with 24v USA cable User Manuals Simple step by step setup guide temi App Download the temi app for iOS or Android. Control your temi, call friends and view your activities. Popular Questions When will I get temi if I order today? The next batch of delivery will be shipped no later than June 2019. You can track you order in the client area once your order is processed. What are the payment options? Credit cards or PayPal payments. If you would like to pay with a different payment method, please contact us. What does temi do? temi lets you experience moving video calls, controls all of your smart home devices, lets you enjoy music and videos from any room in the house and is the ultimate AI assistant. temi is an open platform for apps that interact with you including interactive games, educational apps that make learning fun, medical apps and more. When away, temi enables you to connect from your smartphone and physically be inside your home – to spend time with your family and friends. How is temi controlled? temi is controlled by voice commands such as \"hey temi, go to the kitchen†and also by using the temi app (for IOS and Android) which enables the user to control temi from anywhere in the world. What is the temi app? The temi app enables you to connect to your temi from your smartphone. Using the app, you can virtually move through your home from anywhere in the world to roam around and spend time with your loved ones or to check and make sure that things are safe at home. Does temi update itself online? Yes. temi updates it's own software when needed over the air. Once an update is available you will be prompted to allow the update to download and install. What if I have an issue with my temi? temi comes with a full 1 year warranty (see below) and has a full service center ready to help with any issue. In case an issue cannot be resolved remotely, temi will be taken to the lab or replaced depending on the issue. Where can I experience temi? You can experience temi in many locations in the USA from NY to California. Checkout our \"Stores\" page to see the locations. What languages does temi speak? Currently temi speaks English. More languages are coming soon. How does the free shipping work? temi comes with free shipping within the USA. Order online and get your temi delivered to you at no additional cost. Is temi safe? Can it stumble and fall? Featuring state-of-the-art AI, a system of sensors, and multiple cameras, temi seamlessly enters any room. Using this array of technologies, temi has great mobility and stability over any surface including hard floors, rugs, and room transitions. When temi senses an obstacle it cannot avoid, such as a staircase, it simply stops. How do you ensure my personal info is safe? Your privacy is our top priority and we are doing everything we can to ensure its integrity. Temi follows top regulation and quality standards with smart technology components that protect devices from hacking threats. We fully encrypt your data when sent over the internet and while stored in our cloud storage platform. Can temi run over my child or pet? temi navigates autonomously around your home and uses revolutionary algorithms to avoid obstacles, with dynamic path-planning and an understanding of 360-degree depth. Temi can move around toys, pets, and even avoid staircases. When temi sees an obstacle that it cannot avoid, it simply stops. Is temi safe for kids? We take the safety of your children very seriously. temi is safe for all children and can be easily operated by children ages three and up. Will you send temi to my house? Yes, temi will be sent directly to your mailing address, inside its box you will find temi's Home Base and a user manual. Can temi move on carpets? temi can move smoothly on any indoor surface including carpets, hardwood, and tiles. Using it's adaptive motor control temi recognises different surfaces and adjusts its torque accordingly. How long is temi's battery life? temi's Lithium Ion battery lasts for eight hours. When temi needs to be recharged it will automatically return to its Home Base (charging dock). Do you have a service center? Yes. If our customer service isn't able to resolve an issue remotely, a courier will ship your temi to our service center for an in-person resolution. Specs Robox ROBOXâ\"¢ Navigation System Temi's human robot interaction and autonomous navigation 3D mapping Navigation User detection and tracking Obstacle avoidance Path planning Person recognition CPU ARM Hexa Core LINUX OS Sensors 360 degrees LIDAR 2 depth cameras 1 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Fully-autonomous navigation TEMI OS Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Voice interaction Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines User Interface Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction AI Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps SDK Available Built in Apps AI Assistant Be home Video calls News Personal DJ Developers Personal photographer Personal Caddy Home hub Entertainment Connectivity wifi MIMO Wi-Fi 802.11b/g/n/ac Bluetooth Bluetooth 4.0 Wireless short distance connectivity with devices and accessories Dimensions Size (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D Weight 26 lbs / 12 kg DISPLAY 10.1\" HD LCD screen Capacitive multi-touch for intuitive interface. (1920X1200) IPS LCD 16M colors Touch Capacity Display Pixel density: 224 (ppi) 340 cd/m2 max brightness (typical) Fingerprint-resistant coating Screen Tilt Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° Mics Microphone Array 4 Omni-directional digital mics Real-time localization Beam forming Acoustic echo cancellation Environment noise reduction Audio 20W Audio High fidelity equalizer One sub-woofer Two midrange speakers Two tweeters Passive radiators Acoustically transparent fabric CAMERAS 13 MP high resolution camera Autofocus 1080p@30FPS FOV 60 Degrees 5-Element lens Hybrid IR filter Wide Camera 13MP wide camera for remote navigation FOV 95 Degrees, 1080p@30FPS TOF Depth Camera 30 FPS Up to 5 meters 90° FOV CPU CPU 1 ARM Quad core Operation System Human interaction computer based on Android architecture with proprietary launcher and User Interface CPU 2 ARM Hexa core LINUX OS Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption Power 8 Hours of operation per charge Autonomous charging- 220V/110V High performance docking station Lithium-Ion cells Mobility Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Maneuverability Zero turn radius Speed Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management Tray Wireless Charging The tray contains a standard wireless charger for your mobile phone Tray 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb In The Box 1 temi robot 1 Docking station+ Cable Instruction Manuals Warranty We are confident that you will love your new temi ,however, if you are unsatisfied for any reason we are here to listen and take care of any problem you might have with the product. So, no worries ha? 12 month warranty Agents support Money back guarantee Free returns We are confident that you will love your new temi ,however, if you are unsatisfied for any reason we are here to listen and take care of any problem you might have with the product. So, no worries ha? In the box 1 temi Your own personal robot ready to get going 1 Docking Station + 1 Cable Wall fitted with 24v USA cable User Manuals Simple step by step setup guide Your own personal robot ready to get going 1 Docking Station + 1 Cable Wall fitted with 24v USA cable Simple step by step setup guide temi App Download the temi app for iOS or Android. Control your temi, call friends and view your activities. Download the temi app for iOS or Android. Control your temi, call friends and view your activities. Popular Questions When will I get temi if I order today? The next batch of delivery will be shipped no later than June 2019. You can track you order in the client area once your order is processed. What are the payment options? Credit cards or PayPal payments. If you would like to pay with a different payment method, please contact us. What does temi do? temi lets you experience moving video calls, controls all of your smart home devices, lets you enjoy music and videos from any room in the house and is the ultimate AI assistant. temi is an open platform for apps that interact with you including interactive games, educational apps that make learning fun, medical apps and more. When away, temi enables you to connect from your smartphone and physically be inside your home – to spend time with your family and friends. How is temi controlled? temi is controlled by voice commands such as \"hey temi, go to the kitchen†and also by using the temi app (for IOS and Android) which enables the user to control temi from anywhere in the world. What is the temi app? The temi app enables you to connect to your temi from your smartphone. Using the app, you can virtually move through your home from anywhere in the world to roam around and spend time with your loved ones or to check and make sure that things are safe at home. Does temi update itself online? Yes. temi updates it's own software when needed over the air. Once an update is available you will be prompted to allow the update to download and install. What if I have an issue with my temi? temi comes with a full 1 year warranty (see below) and has a full service center ready to help with any issue. In case an issue cannot be resolved remotely, temi will be taken to the lab or replaced depending on the issue. Where can I experience temi? You can experience temi in many locations in the USA from NY to California. Checkout our \"Stores\" page to see the locations. What languages does temi speak? Currently temi speaks English. More languages are coming soon. How does the free shipping work? temi comes with free shipping within the USA. Order online and get your temi delivered to you at no additional cost. Is temi safe? Can it stumble and fall? Featuring state-of-the-art AI, a system of sensors, and multiple cameras, temi seamlessly enters any room. Using this array of technologies, temi has great mobility and stability over any surface including hard floors, rugs, and room transitions. When temi senses an obstacle it cannot avoid, such as a staircase, it simply stops. How do you ensure my personal info is safe? Your privacy is our top priority and we are doing everything we can to ensure its integrity. Temi follows top regulation and quality standards with smart technology components that protect devices from hacking threats. We fully encrypt your data when sent over the internet and while stored in our cloud storage platform. Can temi run over my child or pet? temi navigates autonomously around your home and uses revolutionary algorithms to avoid obstacles, with dynamic path-planning and an understanding of 360-degree depth. Temi can move around toys, pets, and even avoid staircases. When temi sees an obstacle that it cannot avoid, it simply stops. Is temi safe for kids? We take the safety of your children very seriously. temi is safe for all children and can be easily operated by children ages three and up. Will you send temi to my house? Yes, temi will be sent directly to your mailing address, inside its box you will find temi's Home Base and a user manual. Can temi move on carpets? temi can move smoothly on any indoor surface including carpets, hardwood, and tiles. Using it's adaptive motor control temi recognises different surfaces and adjusts its torque accordingly. How long is temi's battery life? temi's Lithium Ion battery lasts for eight hours. When temi needs to be recharged it will automatically return to its Home Base (charging dock). Do you have a service center? Yes. If our customer service isn't able to resolve an issue remotely, a courier will ship your temi to our service center for an in-person resolution. When will I get temi if I order today? The next batch of delivery will be shipped no later than June 2019. You can track you order in the client area once your order is processed. What are the payment options? Credit cards or PayPal payments. If you would like to pay with a different payment method, please contact us. What does temi do? temi lets you experience moving video calls, controls all of your smart home devices, lets you enjoy music and videos from any room in the house and is the ultimate AI assistant. temi is an open platform for apps that interact with you including interactive games, educational apps that make learning fun, medical apps and more. When away, temi enables you to connect from your smartphone and physically be inside your home – to spend time with your family and friends. How is temi controlled? temi is controlled by voice commands such as \"hey temi, go to the kitchen†and also by using the temi app (for IOS and Android) which enables the user to control temi from anywhere in the world. What is the temi app? The temi app enables you to connect to your temi from your smartphone. Using the app, you can virtually move through your home from anywhere in the world to roam around and spend time with your loved ones or to check and make sure that things are safe at home. Does temi update itself online? Yes. temi updates it's own software when needed over the air. Once an update is available you will be prompted to allow the update to download and install. What if I have an issue with my temi? temi comes with a full 1 year warranty (see below) and has a full service center ready to help with any issue. In case an issue cannot be resolved remotely, temi will be taken to the lab or replaced depending on the issue. Where can I experience temi? You can experience temi in many locations in the USA from NY to California. Checkout our \"Stores\" page to see the locations. What languages does temi speak? Currently temi speaks English. More languages are coming soon. How does the free shipping work? temi comes with free shipping within the USA. Order online and get your temi delivered to you at no additional cost. Is temi safe? Can it stumble and fall? Featuring state-of-the-art AI, a system of sensors, and multiple cameras, temi seamlessly enters any room. Using this array of technologies, temi has great mobility and stability over any surface including hard floors, rugs, and room transitions. When temi senses an obstacle it cannot avoid, such as a staircase, it simply stops. How do you ensure my personal info is safe? Your privacy is our top priority and we are doing everything we can to ensure its integrity. Temi follows top regulation and quality standards with smart technology components that protect devices from hacking threats. We fully encrypt your data when sent over the internet and while stored in our cloud storage platform. Can temi run over my child or pet? temi navigates autonomously around your home and uses revolutionary algorithms to avoid obstacles, with dynamic path-planning and an understanding of 360-degree depth. Temi can move around toys, pets, and even avoid staircases. When temi sees an obstacle that it cannot avoid, it simply stops. Is temi safe for kids? We take the safety of your children very seriously. temi is safe for all children and can be easily operated by children ages three and up. Will you send temi to my house? Yes, temi will be sent directly to your mailing address, inside its box you will find temi's Home Base and a user manual. Can temi move on carpets? temi can move smoothly on any indoor surface including carpets, hardwood, and tiles. Using it's adaptive motor control temi recognises different surfaces and adjusts its torque accordingly. How long is temi's battery life? temi's Lithium Ion battery lasts for eight hours. When temi needs to be recharged it will automatically return to its Home Base (charging dock). Do you have a service center? Yes. If our customer service isn't able to resolve an issue remotely, a courier will ship your temi to our service center for an in-person resolution. Specs Robox ROBOXâ\"¢ Navigation System Temi's human robot interaction and autonomous navigation 3D mapping Navigation User detection and tracking Obstacle avoidance Path planning Person recognition CPU ARM Hexa Core LINUX OS Sensors 360 degrees LIDAR 2 depth cameras 1 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Fully-autonomous navigation TEMI OS Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Voice interaction Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines User Interface Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction AI Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps SDK Available Built in Apps AI Assistant Be home Video calls News Personal DJ Developers Personal photographer Personal Caddy Home hub Entertainment Connectivity wifi MIMO Wi-Fi 802.11b/g/n/ac Bluetooth Bluetooth 4.0 Wireless short distance connectivity with devices and accessories Dimensions Size (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D Weight 26 lbs / 12 kg DISPLAY 10.1\" HD LCD screen Capacitive multi-touch for intuitive interface. (1920X1200) IPS LCD 16M colors Touch Capacity Display Pixel density: 224 (ppi) 340 cd/m2 max brightness (typical) Fingerprint-resistant coating Screen Tilt Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° Mics Microphone Array 4 Omni-directional digital mics Real-time localization Beam forming Acoustic echo cancellation Environment noise reduction Audio 20W Audio High fidelity equalizer One sub-woofer Two midrange speakers Two tweeters Passive radiators Acoustically transparent fabric CAMERAS 13 MP high resolution camera Autofocus 1080p@30FPS FOV 60 Degrees 5-Element lens Hybrid IR filter Wide Camera 13MP wide camera for remote navigation FOV 95 Degrees, 1080p@30FPS TOF Depth Camera 30 FPS Up to 5 meters 90° FOV CPU CPU 1 ARM Quad core Operation System Human interaction computer based on Android architecture with proprietary launcher and User Interface CPU 2 ARM Hexa core LINUX OS Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption Power 8 Hours of operation per charge Autonomous charging- 220V/110V High performance docking station Lithium-Ion cells Mobility Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Maneuverability Zero turn radius Speed Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management Tray Wireless Charging The tray contains a standard wireless charger for your mobile phone Tray 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb In The Box 1 temi robot 1 Docking station+ Cable Instruction Manuals Robox ROBOXâ\"¢ Navigation System Temi's human robot interaction and autonomous navigation 3D mapping Navigation User detection and tracking Obstacle avoidance Path planning Person recognition CPU ARM Hexa Core LINUX OS Sensors 360 degrees LIDAR 2 depth cameras 1 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Fully-autonomous navigation TEMI OS Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Voice interaction Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines User Interface Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction AI Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps SDK Available Built in Apps AI Assistant Be home Video calls News Personal DJ Developers Personal photographer Personal Caddy Home hub Entertainment Connectivity wifi MIMO Wi-Fi 802.11b/g/n/ac Bluetooth Bluetooth 4.0 Wireless short distance connectivity with devices and accessories Dimensions Size (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D Weight 26 lbs / 12 kg DISPLAY 10.1\" HD LCD screen Capacitive multi-touch for intuitive interface. (1920X1200) IPS LCD 16M colors Touch Capacity Display Pixel density: 224 (ppi) 340 cd/m2 max brightness (typical) Fingerprint-resistant coating Screen Tilt Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° Mics Microphone Array 4 Omni-directional digital mics Real-time localization Beam forming Acoustic echo cancellation Environment noise reduction Audio 20W Audio High fidelity equalizer One sub-woofer Two midrange speakers Two tweeters Passive radiators Acoustically transparent fabric CAMERAS 13 MP high resolution camera Autofocus 1080p@30FPS FOV 60 Degrees 5-Element lens Hybrid IR filter Wide Camera 13MP wide camera for remote navigation FOV 95 Degrees, 1080p@30FPS TOF Depth Camera 30 FPS Up to 5 meters 90° FOV CPU CPU 1 ARM Quad core Operation System Human interaction computer based on Android architecture with proprietary launcher and User Interface CPU 2 ARM Hexa core LINUX OS Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption Power 8 Hours of operation per charge Autonomous charging- 220V/110V High performance docking station Lithium-Ion cells Mobility Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Maneuverability Zero turn radius Speed Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management Tray Wireless Charging The tray contains a standard wireless charger for your mobile phone Tray 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb In The Box 1 temi robot 1 Docking station+ Cable Instruction Manuals Temi's human robot interaction and autonomous navigation User detection and tracking 360 degrees LIDAR 2 depth cameras 1 RGB cameras 5 proximity sensors IMU sensor 6 Time of Flight linear sensors Real-time sensor fusion and data analysis ensures safe Super Intuitive operating system that comes, hears, speaks, sees and understands you, and is always learning how to serve you better Temi hears, identifies, understand and responds to the user's voice using Auto Speech Recognition (ASR) and far field voice technology, natural language processing (NLP), speech-to-text and text-to-speech (TTS) engines Temi's designed display enhances your experience with visuals and pictures that let you speak, hear and see what you want – for the ultimate human robot interaction Temi integrates the best AI engines together at real time and is always learning your preferences to serve you best. Face recognition, object recognition, voice fingerprint, emotion detection and more. Open to 3rd party apps Bluetooth 4.0 Wireless short distance connectivity with devices and accessories (ft.) 3.2H x 1.1W x 1.5D (cm.) 100H x 35W x 45D 26 lbs / 12 kg Capacitive multi-touch for intuitive interface. (1920X1200) IPS LCD 16M colors Touch Capacity Display Pixel density: 224 (ppi) 340 cd/m2 max brightness (typical) Autonomous face tracking screen tilt Brushless DC motor with planetary gear for high accuracy and quiet operation Motion range – 15°~+55° 4 Omni-directional digital mics 13MP wide camera for remote navigation FOV 95 Degrees, 1080p@30FPS Up to 5 meters Human interaction computer based on Android architecture with proprietary launcher and User Interface Main navigation computer based on ARM architecture, enabling high performance with minimal power consumption 8 Hours of operation per charge High performance docking station Two independent 50 W direct drive Brushless DC motors High resolution optical encoders that produce a smooth, accurate ride Up to 1 meter per second Custom tires for optimal grip, stability and vibrations management The tray contains a standard wireless charger for your mobile phone 30x25cm Holds up to 3Kg 1×0.8ft Holds up to 6.6Lb 1 Docking station+ Cable Chat now or call (833) 902-0202 Visit the FAQ page"
  ]
}