{
  "company": "www.elenium.com",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 2
    }
  },
  "sample_docs": [
    "Technology that moves you faster Enable your passengers to simply glide through an airport. Find out more Who we are Elenium is reshaping airport operations with seamless, lightning-fast kiosks and bag drops that cut queues and keep passengers moving. What sets Elenium apart is its ability to put airlines in control, enabling them to activate their services instantly at any airport, unlocking the full potential and value of common use self-service technology. Building a frictionless future At Elenium, we believe technology should make life simpler, safer, and more connected. That's why we're building innovative, high-speed self-service solutions that enhance the travel experience and give airlines the flexibility to operate seamlessly across airports. Our vision is a world without friction—where people to move effortlessly through their journey. If you're driven to make a real impact, and be part of the solution used by over 250 million passengers, discover how you can be part of our journey. Explore careers at Elenium. careers Globally trusted by over 35 airports and 45 airlines Latest news Auckland Airport to have new check-in and bag drop off technology installed Read more Sydney (SYD) Airport's massive T2 upgrade to begin in May Read more Leeds Bradford Airport chooses Elenium for check-in hall upgrade Read more Elenium Shortlisted for Aviation Awards Read more Elenium named 5 in Fast Company's Top 10 Most Innovative Travel Companies Read more Darwin International Airport selects Elenium to enhance passenger experience Read more Elenium Automation Recognised by Frost & Sullivan as a Global Technology Innovation Leader in Airport Self-service Innovation Read more Elenium Automation achieves AWS Travel and Hospitality Competency status Read more to Our Newsletter Stay up to date on the latest news Elenium respectfully acknowledges the Traditional Owners of the land, the Boon Wurrung and Woiwurrung (Wurundjeri) people of the Kulin Nation and pays respect to their Elders, past and present. Technology that moves you faster Enable your passengers to simply glide through an airport. Find out more Technology that moves you faster Enable your passengers to simply glide through an airport. Who we are Elenium is reshaping airport operations with seamless, lightning-fast kiosks and bag drops that cut queues and keep passengers moving. What sets Elenium apart is its ability to put airlines in control, enabling them to activate their services instantly at any airport, unlocking the full potential and value of common use self-service technology. Elenium is reshaping airport operations with seamless, lightning-fast kiosks and bag drops that cut queues and keep passengers moving. What sets Elenium apart is its ability to put airlines in control, enabling them to activate their services instantly at any airport, unlocking the full potential and value of common use self-service technology. Building a frictionless future At Elenium, we believe technology should make life simpler, safer, and more connected. That's why we're building innovative, high-speed self-service solutions that enhance the travel experience and give airlines the flexibility to operate seamlessly across airports. Our vision is a world without friction—where people to move effortlessly through their journey. If you're driven to make a real impact, and be part of the solution used by over 250 million passengers, discover how you can be part of our journey. Explore careers at Elenium. careers Building a frictionless future At Elenium, we believe technology should make life simpler, safer, and more connected. That's why we're building innovative, high-speed self-service solutions that enhance the travel experience and give airlines the flexibility to operate seamlessly across airports. Our vision is a world without friction—where people to move effortlessly through their journey. If you're driven to make a real impact, and be part of the solution used by over 250 million passengers, discover how you can be part of our journey. Explore careers at Elenium. Globally trusted by over 35 airports and 45 airlines Latest news Auckland Airport to have new check-in and bag drop off technology installed Read more Sydney (SYD) Airport's massive T2 upgrade to begin in May Read more Leeds Bradford Airport chooses Elenium for check-in hall upgrade Read more Elenium Shortlisted for Aviation Awards Read more Elenium named 5 in Fast Company's Top 10 Most Innovative Travel Companies Read more Darwin International Airport selects Elenium to enhance passenger experience Read more Elenium Automation Recognised by Frost & Sullivan as a Global Technology Innovation Leader in Airport Self-service Innovation Read more Elenium Automation achieves AWS Travel and Hospitality Competency status Read more to Our Newsletter Stay up to date on the latest news to Our Newsletter Stay up to date on the latest news Elenium respectfully acknowledges the Traditional Owners of the land, the Boon Wurrung and Woiwurrung (Wurundjeri) people of the Kulin Nation and pays respect to their Elders, past and present. Elenium respectfully acknowledges the Traditional Owners of the land, the Boon Wurrung and Woiwurrung (Wurundjeri) people of the Kulin Nation and pays respect to their Elders, past and present.",
    "Check in, bag drop and board in 60 seconds Passenger processing: check-in, bag drop, immigration and boarding. Discover our solutions that move you faster. Turnaround certainty, on time, every time Logistics: baggage handling and freight management. Discover our solutions that move air freight faster. Technology that moves you faster Our focus is on delivering a fast and seamless passenger experience. Our blended approach with self-service hardware, applications and services means our solutions are integrated, ensuring faster people flow, fewer queues and happier passengers. Under the wing operations are typically manual and legacy driven. Elenium applies its advanced automation technologies including machine learning, automated applications and Internet of things (IoT) solutions to optimise operations, ensure greater confidence and drive business benefits. Our greatest asset is our team. Our culture focuses on building unique, quality solutions and bringing them to market quickly. With capabilities in electronics, mechanical engineering, physics, machine learning and enterprise application development, Elenium is your partner to enable automation and realise positive change to your business. Voyager was developed by Elenium in partnership with Etihad and Amazon Web Services to truly make the airport experience seamless. Using biometrics, voice recognition, artificial intelligence and cloud technologies, Voyager eliminates the need to scan boarding passes, manual data entry and confusing user interfaces. Elenium provides self service and automation technologies for the airline and airport sector. Our products are designed to reduce queues by increasing speed and operational efficiency, whilst enhancing revenues and delivering a better customer experience. Elenium provides a range of services which leverage our expertise in aviation and automation systems. Our services portfolio is focused on delivery capabilities, real time monitoring, technical support and custom development. A state of increasing velocity December 19, 2019 0 As Normally the week before Christmas is a slow one, when the teams start to show a bit of smile and good cheer and indulge in the odd party. This year we have the party and the smiles and nothing seems to be slowing down as we race towards a new decade. A state of increasing velocity Hope for the merry best and prepare for disruption December 13, 2019 0 As we look forward to a holiday season of celebration, feasting and festivities we often have the contrasting emotions associated with travelling at peak times. Hear Elenium's Aaron Hornlimann speaking at ACI Airport Exchange in Abu Dhabi November 7, 2019 0 Aaron Hornlimann alongside Abe Dev from Etihad Airways will share their thoughts on stand-out passenger experience technologies at the ACI Digital Innovation stream on Tuesday 26th November at 11:30 - 12:45."
  ]
}