{
  "company": "www.facewaretech.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 24,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.4666666666666667,
    "framing_surveillance": 0.0,
    "framing_market": 0.5333333333333333,
    "num_docs": 25
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 24
    }
  },
  "sample_docs": [
    "Faceware Portal is our AI-powered cloud-based platform that generates animation and retargeting data automatically. Go from video capture to final animation faster and easier, increasing your team's efficiency and enabling you to create more content than ever. Faceware Studio is a high-quality, realtime animation software that tracks facial movement from live or recorded video. It uses state-of-the-art machine learning and deep learning techniques to track your face and create animation in realtime. Analyzer is our standalone facial tracking software. Analyzer converts video of facial performances into proprietary motion data that can be applied to any character via our Autodesk Retargeter Plug In. Retargeter is our animation and solving plug-in to common Autodesk animation products such as Maya, 3DS Max, and MotionBuilder. Retargeter takes the data from Analyzer and applies the motion to your characters through an intuitive and pose-based workflow. Reallusion's partnership with Faceware enables iClone to achieve real-time facial motion capture and recording. This will empower indies and studios of all levels, giving them access to facial motion capture tools that are fast, accurate and markerless—all from a PC webcam. Shepherd combines all the integral features a face capture operator needs in one innovative and thoughtful app. Sync your entire performance capture workflow with timecode support and additional functionality to lync your Vicon, Xsens or Optitrack system to trigger your facial systems. Request a Free Trial Click the button below to download one or all of our software products for a free trial. Explore our different licensing and product options to find the best solution for your facial motion capture needs. If you need a more tailored solution, talk to us about our Enterprise Program .",
    "General Quote is valid 90 days from the original sent date. All quotes are based on payment in full prior to services rendered, session scheduled, or delivery, unless otherwise stated in the quote itself and confirmed by Faceware. Delivery Method: Your purchase order, once executed, contains downloadable software. Software may be delivered via USB dongle(s) for an added fee. Duties and taxes will be billed separately. All services are provided under FTI's general business , unless a separate Master Service Agreement is in place between FTI and Customer. Software support and Camera Warranties are included for the first year and can be renewed or extended every 12 months. Any commercially released product or title that is known to have been produced with the aid of licensed software is subject to post-release promotion on FTI print and online materials, including cover art and publicly released still- frames and videos. Publicly announced and released materials associated with this agreement may be promoted on FTI website and marketing material. Due to supply chain shortages, FTI may include a refurbished, demo unit, or pre-owned digital video recorder. In the event such a recorder is included, a one time discount of $350 will be applied to the first year warranty renewal. FTI ships worldwide via FedEx, UPS and DHL. Use of any other carriers cannot be accommodated. Local pick up by freight forwarders may be permitted; there is a fee to prep for alternate shipper pickup. Quote is valid 90 days from the original sent date. All quotes are based on payment in full prior to services rendered, session scheduled, or delivery, unless otherwise stated in the quote itself and confirmed by Faceware. Delivery Method: Your purchase order, once executed, contains downloadable software. Software may be delivered via USB dongle(s) for an added fee. Duties and taxes will be billed separately. All services are provided under FTI's general business , unless a separate Master Service Agreement is in place between FTI and Customer. Software support and Camera Warranties are included for the first year and can be renewed or extended every 12 months. Any commercially released product or title that is known to have been produced with the aid of licensed software is subject to post-release promotion on FTI print and online materials, including cover art and publicly released still- frames and videos. Publicly announced and released materials associated with this agreement may be promoted on FTI website and marketing material. Due to supply chain shortages, FTI may include a refurbished, demo unit, or pre-owned digital video recorder. In the event such a recorder is included, a one time discount of $350 will be applied to the first year warranty renewal. FTI ships worldwide via FedEx, UPS and DHL. Use of any other carriers cannot be accommodated. Local pick up by freight forwarders may be permitted; there is a fee to prep for alternate shipper pickup. Disclaimer: Notice of frequency limitation. Bolt 6 radios are calibrated and tested to support operation in the U-NII-5 (5.925–6.425GHz) frequencies. Although theproduct and its internal radios support these additional frequencies vs. previous Bolt products, regulatory restrictions mean that U-NII-5 operation is allowed only in the regions where it has been cleared for use. Customer is responsible to make sure specific frequency use is in compliance with their country's regulatory laws. As different regions approve U-NII-5 for unlicensed operation, Teradek will release firmware updates to enable the additional frequencies. Disclaimer: Notice of frequency limitation. Bolt 6 radios are calibrated and tested to support operation in the U-NII-5 (5.925–6.425GHz) frequencies. Although theproduct and its internal radios support these additional frequencies vs. previous Bolt products, regulatory restrictions mean that U-NII-5 operation is allowed only in the regions where it has been cleared for use. Customer is responsible to make sure specific frequency use is in compliance with their country's regulatory laws. As different regions approve U-NII-5 for unlicensed operation, Teradek will release firmware updates to enable the additional frequencies. LIMITATION OF LIABILITY Except to the extent any liability, losses or damages are due to Faceware's gross negligence, willful misconduct or breach of this Agreement, in no event shall Faceware (or its affiliates, licensors or suppliers) have any liability, and Customer hereby releases Faceware (and its affiliates, licensors and suppliers) from and for any losses or damages, whether direct, indirect, special, incidental or consequential, arising from this Sale, any of Faceware's EULAs or the Agreement, whether arising in tort (including negligence), contract or otherwise, including, without limitation, damages resulting from loss of profits, data or business. Except to the extent any liability, losses or damages are due to Faceware's gross negligence, willful misconduct or breach of this Agreement, in no event shall Faceware (or its affiliates, licensors or suppliers) have any liability, and Customer hereby releases Faceware (and its affiliates, licensors and suppliers) from and for any losses or damages, whether direct, indirect, special, incidental or consequential, arising from this Sale, any of Faceware's EULAs or the Agreement, whether arising in tort (including negligence), contract or otherwise, including, without limitation, damages resulting from loss of profits, data or business. INDEMNIFICATION Customer will defend and hold harmless Faceware and its respective directors, officers, employees, contractors, affiliates and agents (collectively, \"Faceware Indemnitees\") from and against any and all actual or threatened suits, actions, proceedings (at law or in equity), and claims (groundless or otherwise) (\"Claims\"), and indemnify the Faceware Indemnitees for any and all damages, payments, deficiencies, fines, judgments, settlements, liabilities, losses, costs and expenses (including, but not limited to, reasonable attorneys' fees, expert witnesses' costs and fees, costs, penalties, interest and disbursements) arising from or relating to any Claim (including third-party claims) against any Faceware Indemnitees by users of Third Party Licenses. Customer will defend and hold harmless Faceware and its respective directors, officers, employees, contractors, affiliates and agents (collectively, \"Faceware Indemnitees\") from and against any and all actual or threatened suits, actions, proceedings (at law or in equity), and claims (groundless or otherwise) (\"Claims\"), and indemnify the Faceware Indemnitees for any and all damages, payments, deficiencies, fines, judgments, settlements, liabilities, losses, costs and expenses (including, but not limited to, reasonable attorneys' fees, expert witnesses' costs and fees, costs, penalties, interest and disbursements) arising from or relating to any Claim (including third-party claims) against any Faceware Indemnitees by users of Third Party Licenses. Supervision Services All labor rates including supervision and PA service are quoted and based on U.S. Labor laws and accepted practices of an 8-hour workday, 5-day week. Hours worked beyond 8 hours in a given 24 hour period will be billed as Overtime at $150/hr Hours worked beyond 12 hours in a given 24 hour period will be billed as Double Overtime at $300/hr Transportation days are billable for personnel and equipment. All labor rates including supervision and PA service are quoted and based on U.S. Labor laws and accepted practices of an 8-hour workday, 5-day week. Hours worked beyond 8 hours in a given 24 hour period will be billed as Overtime at $150/hr Hours worked beyond 12 hours in a given 24 hour period will be billed as Double Overtime at $300/hr Transportation days are billable for personnel and equipment. ​Equipment Rentals All rentals require a Certificate of Insurance naming Faceware Technologies, Inc. as \"loss payee\" and \"additional insured\" for equipment value of $100,000 USD and liability coverage of no less than $1,000,000 USD. If Certificate of Insurance cannot be provided then a personal guarantee and/or rental deposit covering all rental equipment may be required. Once equipment is returned, it is evaluated. Additional billing will occur for damage or missing components. All rentals require a Certificate of Insurance naming Faceware Technologies, Inc. as \"loss payee\" and \"additional insured\" for equipment value of $100,000 USD and liability coverage of no less than $1,000,000 USD. If Certificate of Insurance cannot be provided then a personal guarantee and/or rental deposit covering all rental equipment may be required. Once equipment is returned, it is evaluated. Additional billing will occur for damage or missing components. ​Cancellation Orders canceled after contract signature and payment are subject to an administrative / cancellation / restocking fee of 5% of the order. Please keep a PDF copy of this online quote. The quote may be downloaded after it is signed. Orders canceled after contract signature and payment are subject to an administrative / cancellation / restocking fee of 5% of the order. Please keep a PDF copy of this online quote. The quote may be downloaded after it is signed. ​General Payments FTI services and products are provided in US Dollars. Payment received by FTI must match the USD amount on the invoice. Faceware accepts electronic payments only. These include ACH, Wire transfer, Credit Card, Paypal, and Zelle. Cash and Check payments are not accepted. All payments made by credit card are subject to a 4.5% processing service charge which will be added to the invoice. A wire fee of $35 USD must be included for each wire payment. ACH payments have no additional fee. Any bank fees related to payment are payable by Customer. All items sold within the US are subject to State Sales Tax. FTI services and products are provided in US Dollars. Payment received by FTI must match the USD amount on the invoice. Faceware accepts electronic payments only. These include ACH, Wire transfer, Credit Card, Paypal, and Zelle. Cash and Check payments are not accepted. All payments made by credit card are subject to a 4.5% processing service charge which will be added to the invoice. A wire fee of $35 USD must be included for each wire payment. ACH payments have no additional fee. Any bank fees related to payment are payable by Customer. All items sold within the US are subject to State Sales Tax. Sales Tax Exemption This order may be subject to sales tax. A resale or tax-exempt certificate must be provided before a quote can be revised to remove sales tax. This must be done prior to Customer acceptance; otherwise, the Customer agrees to pay the legally required sales tax as indicated on the quotation. Once the Order Confirmation email and Pro-Forma Invoice are sent by Faceware, sales tax billed is remitted to the state and is due to Faceware by the Customer. Any refunds of sales tax must be requested by the Customer directly to the State. Faceware does not process changes or credits to sales tax once the quote is signed by the Customer. This order may be subject to sales tax. A resale or tax-exempt certificate must be provided before a quote can be revised to remove sales tax. This must be done prior to Customer acceptance; otherwise, the Customer agrees to pay the legally required sales tax as indicated on the quotation. Once the Order Confirmation email and Pro-Forma Invoice are sent by Faceware, sales tax billed is remitted to the state and is due to Faceware by the Customer. Any refunds of sales tax must be requested by the Customer directly to the State. Faceware does not process changes or credits to sales tax once the quote is signed by the Customer. Software Orders 100% of purchase order is due at the execution of contract and prior to license delivery. 100% of Custom Development is due upon execution of contract. 100% of purchase order is due at the execution of contract and prior to license delivery. 100% of Custom Development is due upon execution of contract. Hardware, Camera, and Rental Orders 50% of purchase order is due at the execution of the contract. Balance of purchase order is due prior to completion and shipment. For purchase orders less than $7,500 USD, 100% of purchase order is due upon receipt of invoice. 100% of Custom Development is due upon execution of contract Hardware, Camera, and Rental Orders 50% of purchase order is due at the execution of the contract. Balance of purchase order is due prior to completion and shipment. For purchase orders less than $7,500 USD, 100% of purchase order is due upon receipt of invoice. 100% of Custom Development is due upon execution of contract All Faceware software includes active FTI Support for the first 12 months of ownership. Support includes Access to current and past software builds online Compatibility updates with new releases of external programs utilized by Faceware software, such as Maya, MotionBuilder, 3DS Max, and Unity. Reissuance of permanent licenses in the event of workstation upgrade, changed server, or lost machine. Annual licenses only 1 reissuance per year. Permanent license transfer between two machines Access to qualified Faceware Support Team for any questions/help on character, pipeline, and software guidance -- support via online ticketing system. Free access to incremental version updates (e.g. Live 2.5, 2.6, etc.) Discounts on major upgrades - from Retargeter 5.0 to 6.0, etc. All Faceware software includes active FTI Support for the first 12 months of ownership. Access to current and past software builds online Compatibility updates with new releases of external programs utilized by Faceware software, such as Maya, MotionBuilder, 3DS Max, and Unity. Reissuance of permanent licenses in the event of workstation upgrade, changed server, or lost machine. Annual licenses only 1 reissuance per year. Permanent license transfer between two machines Access to qualified Faceware Support Team for any questions/help on character, pipeline, and software guidance -- support via online ticketing system. Free access to incremental version updates (e.g. Live 2.5, 2.6, etc.) Discounts on major upgrades - from Retargeter 5.0 to 6.0, etc. Faceware Perpetual Software Licenses may be renewed after the first 12 months to keep owned software current. Failure to renew software support will maintain software functionality, but result in loss of benefits including: Access to latest and previous software builds online Ability to upgrade to latest compatible version (Maya 2021, Unreal 4.25, etc) Ability to move, transfer or re-issue licenses for any reason Access to Faceware support ticketing system Support contracts should be maintained continuously. In the event that a support contract has lapsed, Renewal orders may cover any lapsed periods in coverage. Renewal of any lapsed contract is only available on currently supported products. In the event that the coverage lapse is longer than six (6) months, an additional reinstatement fee of 50% of the support contract annual amount must be paid in order to allow the support renewal, over and above the requirement to back-date to the prior expiration. Support that lapses beyond 6 months will renew under the most current pricing rates. Additionally, the term of the renewal contract must be 12 months from the reinstatement date, so an additional co- term amount will be added to the renewal. The reinstatement fee is a one-time, nonrefundable fee, and does not apply to the purchase of the support services contract. Service contract reinstatement fees depend on the specific products. Faceware Perpetual Software Licenses may be renewed after the first 12 months to keep owned software current. Failure to renew software support will maintain software functionality, but result in loss of benefits including: Access to latest and previous software builds online Ability to upgrade to latest compatible version (Maya 2021, Unreal 4.25, etc) Ability to move, transfer or re-issue licenses for any reason Access to Faceware support ticketing system Access to latest and previous software builds online Ability to upgrade to latest compatible version (Maya 2021, Unreal 4.25, etc) Ability to move, transfer or re-issue licenses for any reason Access to Faceware support ticketing system Support contracts should be maintained continuously. In the event that a support contract has lapsed, Renewal orders may cover any lapsed periods in coverage. Renewal of any lapsed contract is only available on currently supported products. In the event that the coverage lapse is longer than six (6) months, an additional reinstatement fee of 50% of the support contract annual amount must be paid in order to allow the support renewal, over and above the requirement to back-date to the prior expiration. Support that lapses beyond 6 months will renew under the most current pricing rates. Additionally, the term of the renewal contract must be 12 months from the reinstatement date, so an additional co- term amount will be added to the renewal. The reinstatement fee is a one-time, nonrefundable fee, and does not apply to the purchase of the support services contract. Service contract reinstatement fees depend on the specific products. Indie License Eligibility Please read the below to understand if you are eligible to purchase an Indie License. If you are not eligible, you must purchase a standard Professional License. To be eligible: Your annual gross revenues and/or funding cannot exceed $100,000 USD, regardless of whether or not you're working on commercial work or doing an evaluation/prototyping You are not providing work to a third party/project with revenues exceeding $100,000 USD You do not already own a Professional License of any Faceware Products You have read and acknowledged the End User License Agreement If your eligibility changes during the term of the license, you are obligated to contact us and upgrade your license. For a complete list of Frequently Asked Questions about Indie Pricing and the Indie License, please visit the Indie License FAQ on our Knowledge Base. Please read the below to understand if you are eligible to purchase an Indie License. If you are not eligible, you must purchase a standard Professional License. To be eligible: Your annual gross revenues and/or funding cannot exceed $100,000 USD, regardless of whether or not you're working on commercial work or doing an evaluation/prototyping You are not providing work to a third party/project with revenues exceeding $100,000 USD You do not already own a Professional License of any Faceware Products You have read and acknowledged the End User License Agreement If your eligibility changes during the term of the license, you are obligated to contact us and upgrade your license. For a complete list of Frequently Asked Questions about Indie Pricing and the Indie License, please visit the Indie License FAQ on our Knowledge Base. Limited Warranty & Repair Policy Faceware Technologies, Inc. warrants to the original consumer or other end user that these products, the Mark IV Wireless Headcam System and Indie GoPro Headcam System, are free from defects in materials and workmanship for a period of one year from the date of purchase. During the limited warranty period, and upon proof of purchase (in the form of product registration or packing slip / invoice), this product will be repaired or replaced at our option, without charge. This warranty shall be voided if the product is modified, tampered with, misused, or subjected to abnormal working conditions. This warranty does not apply when the malfunction results from the use of this product in conjunction with accessories, other products, or peripheral equipment. Repair or replacement as provided under this warranty is the exclusive remedy of the purchaser. THIS WARRANTY IS IN LIEU OF ALL OTHER WARRANTIES, EXPRESS OR IMPLIED, INCLUDING ANY IMPLIED WARRANTY OF FITNESS OR SUITABILITY FOR A PARTICULAR USE OR PURPOSE, AND FACEWARE TECHNOLOGIES, INC. SHALL IN NO EVENT BE LIABLE TO PURCHASER FOR INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND OR CHARACTER. Some states do not allow the exclusion or limitation or incidental or consequential damages or allow limitations on how long an implied warranty lasts, so the above limitations and exclusions may not apply to you. ANY USE OF THE FACEWARE SYSTEMS FOR PURPOSES OTHER THAN THOSE EXPRESSLY PROMOTED BY FACEWARE OR ANY DISASSEMBLY OR MODIFICATION OF THE FACEWARE HARDWARE OR SOFTWARE WILL VOID THIS AND ANY OTHER WARRANTY OR RETURN RIGHTS. Limited Warranty & Repair Policy Faceware Technologies, Inc. warrants to the original consumer or other end user that these products, the Mark IV Wireless Headcam System and Indie GoPro Headcam System, are free from defects in materials and workmanship for a period of one year from the date of purchase. During the limited warranty period, and upon proof of purchase (in the form of product registration or packing slip / invoice), this product will be repaired or replaced at our option, without charge. This warranty shall be voided if the product is modified, tampered with, misused, or subjected to abnormal working conditions. This warranty does not apply when the malfunction results from the use of this product in conjunction with accessories, other products, or peripheral equipment. Repair or replacement as provided under this warranty is the exclusive remedy of the purchaser. THIS WARRANTY IS IN LIEU OF ALL OTHER WARRANTIES, EXPRESS OR IMPLIED, INCLUDING ANY IMPLIED WARRANTY OF FITNESS OR SUITABILITY FOR A PARTICULAR USE OR PURPOSE, AND FACEWARE TECHNOLOGIES, INC. SHALL IN NO EVENT BE LIABLE TO PURCHASER FOR INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND OR CHARACTER. Some states do not allow the exclusion or limitation or incidental or consequential damages or allow limitations on how long an implied warranty lasts, so the above limitations and exclusions may not apply to you. ANY USE OF THE FACEWARE SYSTEMS FOR PURPOSES OTHER THAN THOSE EXPRESSLY PROMOTED BY FACEWARE OR ANY DISASSEMBLY OR MODIFICATION OF THE FACEWARE HARDWARE OR SOFTWARE WILL VOID THIS AND ANY OTHER WARRANTY OR RETURN RIGHTS. Repair Policy When Faceware receives the product, it will determine whether the product can be repaired or needs to be replaced. If the product is not covered by the warranty due to misuse, damage caused by the end user and/or is outside the warranty period, it can be subject to repair fees. When Faceware receives the product, it will determine whether the product can be repaired or needs to be replaced. If the product is not covered by the warranty due to misuse, damage caused by the end user and/or is outside the warranty period, it can be subject to repair fees. Extended Warranty For Mark IV Headcam Systems and Indie Headcam Systems, the Limited Warranty may be extended on an annual basis at the quoted rate on the original Purchase Order. Extended Warranties will contain all benefits listed above, including no cost repairs or replacements of all items. There is NO LIMIT on the number of years the Warranty may be extended. The first warranty renewal notice will be sent 60 days prior to expiration. For Mark IV Headcam Systems and Indie Headcam Systems, the Limited Warranty may be extended on an annual basis at the quoted rate on the original Purchase Order. Extended Warranties will contain all benefits listed above, including no cost repairs or replacements of all items. There is NO LIMIT on the number of years the Warranty may be extended. The first warranty renewal notice will be sent 60 days prior to expiration. Additional Warranty Benefit If Mark IV Headcam System Limited Warranty is extended on an annual basis via hardware support contract with Faceware, customer will receive a package of maintenance and upgrade components for each Mark IV system owned in order to maintain proper functionality and upkeep. Items included will be at Faceware team's discretion, and include, but will not be limited to, batteries, velcro straps, miscellaneous screws and bolts, lenses, etc. If Mark IV Headcam System Limited Warranty is extended on an annual basis via hardware support contract with Faceware, customer will receive a package of maintenance and upgrade components for each Mark IV system owned in order to maintain proper functionality and upkeep. Items included will be at Faceware team's discretion, and include, but will not be limited to, batteries, velcro straps, miscellaneous screws and bolts, lenses, etc. Request a Free Trial Click the button below to download one or all of our software products for a free trial. Explore our different licensing and product options to find the best solution for your facial motion capture needs. If you need a more tailored solution, talk to us about our Enterprise Program .",
    "Please read this Agreement carefully. This is a legal agreement between you and your employer (\"Licensee\") and Faceware Technologies, inc. (\"Licensor\") that defines your rights and obligations related to your use of Faceware Products (\"Product\"). By using the Products, you are agreeing to be bound by the of this Agreement. If you don't or can't agree, do not download or use the Product. By installing, downloading, accessing, or otherwise copying or using all or any portion of the Products, (i) you accept this EULA on behalf of the entity for which you are authorized to act (e.g., an employer) and acknowledge that such entity is legally bound by this EULA (and you agree to act in a manner consistent with this EULA) or, if there is no such entity for which you are authorized to act, you accept this EULA on behalf of yourself as an individual and acknowledge that you are legally bound by this EULA, and (ii) you represent and warrant that you have the right, power and authority to act on behalf of and bind such entity (if any) or yourself. You may not accept this EULA on behalf of another entity unless you are an employee or other agent of such other entity with the right, power and authority to act on behalf of such other entity. If Licensee is unwilling to accept this EULA, or you do not have the right, power and authority to act on behalf of and bind such entity or yourself as an individual (if there is no such entity), do not install, download, access, or otherwise copy or use all or any portion of the Product. 1. COMMERCIAL LICENSE AGREEMENT. 1.1 Use of Product. Licensor has entered into an agreement with Licensee (the \"Agreement\") under which Licensor has granted Licensee a limited license to use the Product. Licensee may use the Product on behalf of Licensee under the of this EULA, and Licensee hereby agrees to comply with the Agreement and this EULA. Licensee may not sublicense the Product or transfer the Product to a third party. In the event of a conflict between the Agreement and this EULA, the Agreement will take precedence. Installation and use of Product may be further limited based on License Type and/or License Model as described in Clause 2. 2. PRODUCT LICENSES. 2.1 License Types. For each Product purchased from Licensor, the Licensee will receive one of the following types of license, and subject to the following . Licensee shall not at any one time use more copies of the Product than the total number of valid licenses purchased or licensed by Licensee (as applicable). (a) \"Local License\" If Licensee purchases a Local (also commonly referred to as a Node-Locked License), Licensee will install and use only a single copy of the Software on only one computer at a time. (b) \"Server License\" If Licensee purchases a Server License (also commonly referred to as a Floating License), use of the Software may be installed on a Server/Network and accessed from any computer on that network. (c) \"Dongle License\" If Licensee purchases a Dongle License, the License is installed on a USB device and may be connected to only one computer at a time. (d) \"Cloud License\" If Licensee purchases a Cloud License, the License is accessed via the internet and can be used on any computer. 2.2 License Models. There are several distinct licensing models. Some models are made available at concessionary rates or free of charge (as applicable) and include specific . Violation of the license model will result in the immediate suspension of licenses and Licensee must stop using the Product immediately. (a) \"Professional License\". Usage of the Product in a commercial, for-profit setting requires a Professional License, unless superseded by another License Model or agreement between Licensee and Licensor. (b) \"Indie License\". If Licensee is eligible, the Indie License is made available at a concessionary rate, relative to the Professional License. Licensee's eligibility for an Indie License is determined by revenue and/or funding. To be eligible, Licensee and their affiliated organization must not have annual gross revenues or funding exceeding $100,000 USD during the prior or current calendar year. In the case of Licensee sharing Product files or results from the usage of the Product with a third party that will use those results in connection with a commercial activity, such third party and its affiliates are subject to the same revenue requirements and their projects and/or organization cannot have revenues or funding exceeding $100,000 USD in the prior or current calendar year. In the event that Licensee's eligibility changes during the term of the License and revenues or funding exceed $100,000 USD, Licensee is responsible for contacting Licensor and upgrading to a Professional License within 30 days. If the Licensee is taking advantage of the pricing applicable to the Indie License, the Licensee represents and warrants that they satisfy these criteria. (c) \"Academic License\". If Licensee has purchased the Product on the discounted of Licensor academic program, Licensee warrants and represents to Licensor as a condition of the Academic License that: (i) (if Licensee is a natural person) he or she is a part-time or full-time student at the time of purchase and will not use the Product for any commercial, professional or for-profit purposes; and (ii) (if the Licensee is not a natural person) it is an organization that will use the Product only for the purpose of training and instruction, and for no other purpose. (d) \"Personal Learning Edition License (PLE)\". If the Product is a Personal Learning Edition (\"PLE\"), Licensee may use it only for the purpose of personal or internal training and instruction, and for no other purpose. PLE versions of the Product may not be used for commercial, professional or for-profit purposes including, for the avoidance of doubt, the purpose of providing training or instruction to third parties. Licensee shall use the Product on only one computer at a time. (e) \"Not for Resale License (NFR)\". An NFR license is a special type of limited user evaluation license that is provided exclusively to resellers and partners for demonstrating the Product or for use on non-commercial, special projects otherwise agreed upon in an Agreement superseding these . (f) \"Trial License\". Licensee may register for a \"Trial License\" of the Product in order to test and evaluate the Product. A Trial License lasts a limited specified period after which the Product will automatically cease to function. Licensee will use the Product on only one computer at a time and will not use the Product for any commercial or for-profit purposes during the Trial License period. 3. OWNERSHIP. 3.1 The Product is owned by Licensor. The Product is protected by United States copyright laws and international treaty provisions. The Product may not be modified, reverse engineered, reverse compiled, or disassembled by Licensee. Any copyright, proprietary or confidential notices placed on the Product or any documentation that may be provided by Licensor may not be removed, altered or destroyed by Licensee. The Product or any documentation may not be copied by Licensee. 4. LICENSE RESTRICTIONS. 4.1 Unless otherwise provided herein, you shall not (A) in the aggregate, install or use more than one copy of the Product, (B) download the Product under more than one username or e-mail address, (C) alter the contents of a hard drive or computer system to enable the use of the Product for an aggregate period in excess of the license term for one license, (D) use the Trial License or Not-for-Resale (NFR) License for any application deployment or ultimate commercial use, (E) use the Trial License of the Product for a purpose other than the sole purpose of determining whether to purchase a license of the Product; provided, however, notwithstanding the foregoing, you are strictly prohibited from installing or using the Trial License of the Product for any commercial training purpose, or (F) use the Product for the purpose of building or enhancing any database or training or testing any artificial intelligence, machine learning, deep learning, neural network or similar technology. 5. NO WARRANTY. 5.1 The Software is provided \"AS IS\", without representation or warranty of any kind, and Licensor disclaims any warranty or liability, either express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose and non-infringement. The entire risk as to the quality and performance of the Product is with Licensee. 6. LIMITATION OF LIABILITY. 6.1 In no event shall Licensor (or its affiliates, licensors or suppliers) have any liability, and Licensee hereby releases Licensor (and its affiliates, licensors and suppliers) from and for any losses or damages, whether direct, indirect, special, incidental or consequential, arising from this EULA or the Agreement, whether arising in tort (including negligence), contract or otherwise, including, without limitation, damages resulting from loss of profits, data or business. 7. TERMINATION. The term of the license granted to Licensee is set forth in the Agreement. Licensor may immediately terminate Licensee's use of the Product if Licensee fails to comply with any material term or condition of the Agreement or this EULA. Upon such termination Licensee must immediately cease using the Product and must follow Licensor's instructions regarding return or destruction of the Product. ALL DISCLAIMERS HEREIN SHALL SURVIVE TERMINATION. 8. MISCELLANEOUS. The Agreement and this EULA constitute the entire agreement between Licensee and Licensor regarding the subject matter hereof, and supersede any prior agreement, whether written or oral, relating to the subject matter of this Agreement. The Agreement and this EULA are governed by the laws of the State of California, U.S.A., without regard to conflict of law principles, to the extent such principles would require or result in the application of different law. The United Nations Convention on the International Sale of Goods shall not apply to the interpretation or enforcement of the Agreement or this EULA. A breach of any of the promises or agreement contained in the Agreement or this EULA may result in irreparable and continuing damage to Licensor for which there may be no adequate remedy at law, and Licensor is therefore entitled to seek injunctive relief as well as such other and further relief as may be appropriate. If any part of the Agreement or this EULA shall be adjudged by any court of competent jurisdiction to be invalid, illegal or unenforceable, the validity, legality and enforceability of the remaining provisions shall not be affected or impaired thereby and shall be enforced to the maximum extent permitted by applicable law. If any remedy set forth in the Agreement or this EULA is determined to have failed of its essential purpose, then all other provisions of the Agreement or this EULA, including the limitations of liability and exclusion of damages, shall remain in full force and effect. Licensee may not assign, delegate, or otherwise transfer all or any part of its rights or obligations under this EULA without the express written consent of Licensor. This EULA will be binding on and insure to the benefit of the parties and their heirs, successors and assigns. No waiver of any provision of the Agreement or this EULA, or of any rights or obligations of any party hereunder, will be effective unless in writing and signed by the party waiving compliance. 9. NOTICE ON DATA COLLECTION. The Product does not collect any user or personal data as it is defined in Article 4 of REGULATION (EU) 2016/679 OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 27 April 2016, commonly referred to as General Data Protection Regulation or \"GDPR\". EULA Version: v.20211110 Please read this Agreement carefully. This is a legal agreement between you and your employer (\"Licensee\") and Faceware Technologies, inc. (\"Licensor\") that defines your rights and obligations related to your use of Faceware Products (\"Product\"). By using the Products, you are agreeing to be bound by the of this Agreement. If you don't or can't agree, do not download or use the Product. By installing, downloading, accessing, or otherwise copying or using all or any portion of the Products, (i) you accept this EULA on behalf of the entity for which you are authorized to act (e.g., an employer) and acknowledge that such entity is legally bound by this EULA (and you agree to act in a manner consistent with this EULA) or, if there is no such entity for which you are authorized to act, you accept this EULA on behalf of yourself as an individual and acknowledge that you are legally bound by this EULA, and (ii) you represent and warrant that you have the right, power and authority to act on behalf of and bind such entity (if any) or yourself. You may not accept this EULA on behalf of another entity unless you are an employee or other agent of such other entity with the right, power and authority to act on behalf of such other entity. If Licensee is unwilling to accept this EULA, or you do not have the right, power and authority to act on behalf of and bind such entity or yourself as an individual (if there is no such entity), do not install, download, access, or otherwise copy or use all or any portion of the Product. 1. COMMERCIAL LICENSE AGREEMENT. 1.1 Use of Product. Licensor has entered into an agreement with Licensee (the \"Agreement\") under which Licensor has granted Licensee a limited license to use the Product. Licensee may use the Product on behalf of Licensee under the of this EULA, and Licensee hereby agrees to comply with the Agreement and this EULA. Licensee may not sublicense the Product or transfer the Product to a third party. In the event of a conflict between the Agreement and this EULA, the Agreement will take precedence. Installation and use of Product may be further limited based on License Type and/or License Model as described in Clause 2. 2.1 License Types. For each Product purchased from Licensor, the Licensee will receive one of the following types of license, and subject to the following . Licensee shall not at any one time use more copies of the Product than the total number of valid licenses purchased or licensed by Licensee (as applicable). (a) \"Local License\" If Licensee purchases a Local (also commonly referred to as a Node-Locked License), Licensee will install and use only a single copy of the Software on only one computer at a time. (b) \"Server License\" If Licensee purchases a Server License (also commonly referred to as a Floating License), use of the Software may be installed on a Server/Network and accessed from any computer on that network. (c) \"Dongle License\" If Licensee purchases a Dongle License, the License is installed on a USB device and may be connected to only one computer at a time. (d) \"Cloud License\" If Licensee purchases a Cloud License, the License is accessed via the internet and can be used on any computer. 2.2 License Models. There are several distinct licensing models. Some models are made available at concessionary rates or free of charge (as applicable) and include specific . Violation of the license model will result in the immediate suspension of licenses and Licensee must stop using the Product immediately. (a) \"Professional License\". Usage of the Product in a commercial, for-profit setting requires a Professional License, unless superseded by another License Model or agreement between Licensee and Licensor. (b) \"Indie License\". If Licensee is eligible, the Indie License is made available at a concessionary rate, relative to the Professional License. Licensee's eligibility for an Indie License is determined by revenue and/or funding. To be eligible, Licensee and their affiliated organization must not have annual gross revenues or funding exceeding $100,000 USD during the prior or current calendar year. In the case of Licensee sharing Product files or results from the usage of the Product with a third party that will use those results in connection with a commercial activity, such third party and its affiliates are subject to the same revenue requirements and their projects and/or organization cannot have revenues or funding exceeding $100,000 USD in the prior or current calendar year. In the event that Licensee's eligibility changes during the term of the License and revenues or funding exceed $100,000 USD, Licensee is responsible for contacting Licensor and upgrading to a Professional License within 30 days. If the Licensee is taking advantage of the pricing applicable to the Indie License, the Licensee represents and warrants that they satisfy these criteria. (c) \"Academic License\". If Licensee has purchased the Product on the discounted of Licensor academic program, Licensee warrants and represents to Licensor as a condition of the Academic License that: (i) (if Licensee is a natural person) he or she is a part-time or full-time student at the time of purchase and will not use the Product for any commercial, professional or for-profit purposes; and (ii) (if the Licensee is not a natural person) it is an organization that will use the Product only for the purpose of training and instruction, and for no other purpose. (d) \"Personal Learning Edition License (PLE)\". If the Product is a Personal Learning Edition (\"PLE\"), Licensee may use it only for the purpose of personal or internal training and instruction, and for no other purpose. PLE versions of the Product may not be used for commercial, professional or for-profit purposes including, for the avoidance of doubt, the purpose of providing training or instruction to third parties. Licensee shall use the Product on only one computer at a time. (e) \"Not for Resale License (NFR)\". An NFR license is a special type of limited user evaluation license that is provided exclusively to resellers and partners for demonstrating the Product or for use on non-commercial, special projects otherwise agreed upon in an Agreement superseding these . (f) \"Trial License\". Licensee may register for a \"Trial License\" of the Product in order to test and evaluate the Product. A Trial License lasts a limited specified period after which the Product will automatically cease to function. Licensee will use the Product on only one computer at a time and will not use the Product for any commercial or for-profit purposes during the Trial License period. 3.1 The Product is owned by Licensor. The Product is protected by United States copyright laws and international treaty provisions. The Product may not be modified, reverse engineered, reverse compiled, or disassembled by Licensee. Any copyright, proprietary or confidential notices placed on the Product or any documentation that may be provided by Licensor may not be removed, altered or destroyed by Licensee. The Product or any documentation may not be copied by Licensee. 4.1 Unless otherwise provided herein, you shall not (A) in the aggregate, install or use more than one copy of the Product, (B) download the Product under more than one username or e-mail address, (C) alter the contents of a hard drive or computer system to enable the use of the Product for an aggregate period in excess of the license term for one license, (D) use the Trial License or Not-for-Resale (NFR) License for any application deployment or ultimate commercial use, (E) use the Trial License of the Product for a purpose other than the sole purpose of determining whether to purchase a license of the Product; provided, however, notwithstanding the foregoing, you are strictly prohibited from installing or using the Trial License of the Product for any commercial training purpose, or (F) use the Product for the purpose of building or enhancing any database or training or testing any artificial intelligence, machine learning, deep learning, neural network or similar technology. 5.1 The Software is provided \"AS IS\", without representation or warranty of any kind, and Licensor disclaims any warranty or liability, either express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose and non-infringement. The entire risk as to the quality and performance of the Product is with Licensee. 6. LIMITATION OF LIABILITY. 6.1 In no event shall Licensor (or its affiliates, licensors or suppliers) have any liability, and Licensee hereby releases Licensor (and its affiliates, licensors and suppliers) from and for any losses or damages, whether direct, indirect, special, incidental or consequential, arising from this EULA or the Agreement, whether arising in tort (including negligence), contract or otherwise, including, without limitation, damages resulting from loss of profits, data or business. The term of the license granted to Licensee is set forth in the Agreement. Licensor may immediately terminate Licensee's use of the Product if Licensee fails to comply with any material term or condition of the Agreement or this EULA. Upon such termination Licensee must immediately cease using the Product and must follow Licensor's instructions regarding return or destruction of the Product. ALL DISCLAIMERS HEREIN SHALL SURVIVE TERMINATION. The Agreement and this EULA constitute the entire agreement between Licensee and Licensor regarding the subject matter hereof, and supersede any prior agreement, whether written or oral, relating to the subject matter of this Agreement. The Agreement and this EULA are governed by the laws of the State of California, U.S.A., without regard to conflict of law principles, to the extent such principles would require or result in the application of different law. The United Nations Convention on the International Sale of Goods shall not apply to the interpretation or enforcement of the Agreement or this EULA. A breach of any of the promises or agreement contained in the Agreement or this EULA may result in irreparable and continuing damage to Licensor for which there may be no adequate remedy at law, and Licensor is therefore entitled to seek injunctive relief as well as such other and further relief as may be appropriate. If any part of the Agreement or this EULA shall be adjudged by any court of competent jurisdiction to be invalid, illegal or unenforceable, the validity, legality and enforceability of the remaining provisions shall not be affected or impaired thereby and shall be enforced to the maximum extent permitted by applicable law. If any remedy set forth in the Agreement or this EULA is determined to have failed of its essential purpose, then all other provisions of the Agreement or this EULA, including the limitations of liability and exclusion of damages, shall remain in full force and effect. Licensee may not assign, delegate, or otherwise transfer all or any part of its rights or obligations under this EULA without the express written consent of Licensor. This EULA will be binding on and insure to the benefit of the parties and their heirs, successors and assigns. No waiver of any provision of the Agreement or this EULA, or of any rights or obligations of any party hereunder, will be effective unless in writing and signed by the party waiving compliance. 9. NOTICE ON DATA COLLECTION. The Product does not collect any user or personal data as it is defined in Article 4 of REGULATION (EU) 2016/679 OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 27 April 2016, commonly referred to as General Data Protection Regulation or \"GDPR\". Request a Free Trial Click the button below to download one or all of our software products for a free trial. Explore our different licensing and product options to find the best solution for your facial motion capture needs. If you need a more tailored solution, talk to us about our Enterprise Program .",
    "Use any PC Camera to create animation in iClone Easily edit-and-polish your data after capture Compatible with industry standard characters Features of Realtime for iClone Fast, Accurate, Markerless Facial Tracking With Realtime for iClone and the iClone Motion LIVE Plug-in for Faceware, you can now create, record, and edit facial animation in iClone extremely easily. Capture your facial expressions using a web cam, GoPro, Mark IV Headcam, or any standard PC camera. Alternatively, you can use an image sequence for finer control over the performance. Easily Adjust Camera Settings For Optimal Performance Realtime for iClone gives you access to any camera connected to your PC. Once a camera is selected, you can easily adjust settings such as video resolution and FPS to get the optimal performance from both your camera and the software. We recommend capturing your face at a minimum of 30 FPS (frames per second) though 60 FPS is ideal! You'll get higher fidelity lip sync animation at a higher FPS. We also recommend keeping the resolution at or below 720p for optimal use. Many people will find that the 640×480 resolution is more than enough. Fast and Simple Calibration Calibrating the technology to your face is an important part of how Realtime for iClone works. Calibration establishes a baseline by 'teaching' the technology what your face looks like in a neutral pose. Unlike other tracking software, calibration in Realtime for iClone is fast and simple, allowing you to train the technology in a single button press and adjust on-the-fly for optimal results. In the video tutorials created by Reallusion, you can see how Calibrating in slightly different poses might give you enhanced results in iClone. Compatible with Industry Standard 3D Characters iClone Characters made by Character Creator has updated with 60 face morphs, fully optimized for Faceware tracking data. For Daz Genesis, characters generation 1, 2, 3, and 8, auto-conversion tools and 60 face morph DUF profiles are provided. Distinguishing Features of Realtime for iClone Instant, dynamic feedback. These meters let you view your animation data in real time. Observe the relationship between your facial performance and the real-time data stream and adjust the result. Define your own expression style with facial muscle sliders and save it as a Custom Capture Profile. Default 60-morph capture profiles are optimized for StaticCam and HeadCam tracking models. You can further take advantage of the Search function to quickly access sliders! Globally or separately control the signal input strength for brows, eyelids, eyeballs, mouth, jaw, cheek, and head rotation. Easily capture stylized characters with proper strength settings for toning down or exaggerating features. Save settings for characters. Edit face capture performances in post with the iClone facial timeline. Access the motion clip track to edit & offset with face keys. Expression Intensity control through slider bars. \"The Faceware Realtime iClone 7 System is a huge win for me as a Faceware user. It is by far the best integration of Faceware I have seen in any package. Combined with the new face keying, you have a powerful combination to deliver truly professional results. The fact that Reallusion has pulled all this off in a single release is truly amazing and I am super excited for the future of iClone.\" —Jeff Jasper, Oscar/BAFTA winning team, FX Supervisor \"Interstellar\", New Deal Studios Getting started with Realtime for iClone Explore free resources and purchase options for Realtime for iClone.",
    "The ideal headcam for the performer and the operator Engineered on set for the realities of performance capture Compatible with all major motion capture technologies For use in Realtime and recorded facial capture workflows The Mark IV is the premier headcam system for facial motion capture. Performance capture, voice-over, and realtime, this system handles it all. The Mark IV is our most adaptable, stable, and dependable headcam yet. Our headcams are used daily by the biggest game developers, VFX houses, and animation studios in the world. Projects that need multiple cameras or have rigorous multi-week shoots have relied on Faceware headcams for over a decade. Our engineering is fueled by our clients' feedback and our own hands-on experiences. Our features don't just sound good in the shop, they are solutions on set. We offer the best support in the industry. Speak with real engineers when you have questions, watch helpful videos, and find full technical documentation on our support page. Every Mark IV comes with free, no-hassle repairs or replacement parts for one year. Extended warranties are also available. Every component of the Mark IV is engineered to ensure the highest quality, the most reliability, and the greatest comfort. When capturing the face of your talent, the Mark IV is the tool you need to get the best performance possible. 1 Rugged, Fiberglass Molded Helmet Maximum comfort, stability and consistency, the Mark IV helmet is best-in-class for performance capture. Rugged, Fiberglass Molded Helmet Maximum comfort, stability and consistency, the Mark IV helmet is best-in-class for performance capture. 2 Lateral Stabilization Maintain stability and comfort with \"sideburn\" stability bars and integrated chin strap mounting points. Maintain stability and comfort with \"sideburn\" stability bars and integrated chin strap mounting points. 3 Low Profile Camera Mount Slim camera and rugged low swept bar sits below the actor's eyeline while capturing and illuminating your talent. Low Profile Camera Mount Slim camera and rugged low swept bar sits below the actor's eyeline while capturing and illuminating your talent. 4 Easy Adjustment Thumb Screws Make fast, easy adjustments to the fit and framing of the Mark IV with large, comfortable thumb screws. Easy Adjustment Thumb Screws Make fast, easy adjustments to the fit and framing of the Mark IV with large, comfortable thumb screws. The Freedom to Perform With a 750ft (230 meter) range, zero delay and flawless HD video stream, your performance is streamed instantly, dependably. Untether your actor and unleash their full potential. The Mark IV Dual Band edition uses the Teradek Bolt 6 series system to wirelessly stream video from the headcam to the recording and monitoring devices. The Bolt 6 series supports both 5GHz and 6Ghz bands* to reduce interference and enable more performers to be captured simultaneously. *The Bolt 6's 6Ghz band is currently only certified for use in USA and Canada. Certification for other regions is expected to be approved soon. 750ft Range (230 meters) 99% of the World's Heads. A data-driven approach to headcam engineering. The Mark IV helmet was co-developed with one of the world's leading performance capture helmet manufacturers. We studied anthropomorphic head studies of thousands of subjects to create helmets that fit 99% of the world's heads, comfortably. 5 hours wireless per battery 15 hours wired 1 hour charge time We've created a substantial power system that uses an Anton/Bauer® Gold Mount Plate and a Bebob ® A45 Micro Battery that locks securely into place. Now you can shoot longer, with more reliability and less down time on set. Want to capture with audio? Our system is completely silent. Special low noise cable wrapping, magnetic shielding on the power cables, no fans, no heavy PC wearables, just silent wireless video capture that is streamed or recorded in realtime. Our custom-built breakout box and streamlined cabling feature premium, robust cable connections to stand up to the rigors of being on-set. Full Performance Capture with Shepherd Full face and body performance capture is streamlined when you use Faceware Shepherd with your Mark IV headcam. Shepherd automates headcam recording functions and integrates with body motion capture systems, like Vicon and Optitrack, to synchronise facial and body mocap recordings on PCs and Windows tablets. Commonly asked questions about the Mark IV How long does it take to set up an actor? As a new user, it may take 10 to 15 minutes to properly fit an actor's helmet, build the headcam, and frame and focus the actor's face. Once you've mastered this process, it'll get much faster. It takes roughly 5 to 7 minutes per actor for Headcam operators to do this process. Once the actor has a helmet and camera fit and framed, things go even faster. For example, coming back from a break or lunch takes about a minute to get the Mark IV back on them. How long does it take to calibrate the system? No calibration process is necessary for our Mark IV Headcam to be used for recording. If you plan to use Live Studio (Faceware's realtime software), have the actor hold a neutral face, and Live Studio has a 1 button, 1-second calibration process. What is the battery life of the system? If the Mark IV System is running in wireless mode, then a single battery will last approximately 5 hours. If the Mark IV System is wired, then a single battery will last at least 12 hours. Do you recommend applying facial markers to the performer's face? This is entirely up to the person who will track the footage in Analyzer, our technology does not require markers, although about 1/2 our user-base prefers to apply marks on the face. Markers drawn on the actor's faces can help with consistent landmark placement but does not directly impact how the software ingests the data. Small, clean dots, placed consistently day to day work best. Your bar seems long. Why is that? We use a near-zero distortion 4.3mm lens. That lens mm means we need to push the camera out a little further than other cameras with fisheye lenses. This produces excellent footage for animator reference that looks like a properly proportioned face. What frame rate and resolution do you recommend? This is dependant on the project itself. We usually recommend shooting at the highest evenly divisible framerate of your animation timeline's fps. For example, you are working on a game and are animating in Maya at 30fps, we would recommend 60fps capture. If you are animating in Motion Builder at 29.97 for television delivery, we would recommend 59.94fps. We sell cameras that run at either 24/25/30/50/60 fps or 23.976/29.97/59.94 fps. Here is the full list supported by our cameras: If you are unsure, we recommend 720p 60 or 59.94 fps as our general best practice. It is a great balance between file size and detail. Are the cameras infrared? They are not. For better animator reference and to better work with our tracking algorithms, we use color video in our cameras. What is actually being recorded? The Mark IV records color HD video recorded with Prores or DNxHD compression in a .MOV file. Does the Mark IV system record audio? How do I integrate my audio? Our Mark IV headcams do not come with a built-in microphone, but audio can be embedded in the face video by connecting an audio feed to the audio inputs on the back of the AJA Ki Pro Rack. The Ki Pro decks have Line or Mic level XLR ana puts or AES digital audio inputs. In PCAP scenarios, most audio engineers prefer to attach microphones to the helmet itself or on the boom arm that holds our camera and then run the cable in our cable wrap and then down to the belt, where they can clip the transmitter. Then the receiver can be then fed into the mixer and then fed to the Ki Pro, or even directly plugged into the Ki Pro. In a VO booth scenario, all that's needed is to take the feed from your audio engineers board and send a signal to the Ki Pro. Does the Mark IV work with timecode? Yes, it does. We combine the video with the TC and audio at the AJA Ki Pro Rack when it is recorded. The Ki Pro Rack has an LTC input (and loop-through output) that any external timecode source (a timecode generator or Sync HD Pro Tools box) can plug into. The timecode data is recorded into the metadata of the MOV as a timecode track. How many actors can I capture simultaneously? You can capture up to 5 actors wirelessly. For wired setups, there's no limit unless you are limited by the number of digital video recorders that you own. Any number of Ki Pro recording decks can be controlled from a single interface. Timecode and audio can be daisy-chained from deck to deck to assure all the components stay in sync and identical. What is the range of your wireless system? We use the Teradek Bolt 500 system for wireless video. The working range for each unit is 500 feet (150 meters) between the transmitter and receiver. Are you compatible with Vicon, Xsens, Optitrack, Perception Neuron, Motion Analysis, Rokoko, or Qualysis mocap systems? Yes, all of them. Integrating the systems is simply a matter of attaching markers or sensors to an actor's helmet and positioning the performance capture belt in a place it doesn't occlude or interfere with the body data. For deeper integration, our Shepherd software package can take file name and start/stop triggers from Vicon, Optitrack, and Xsens systems to automatically and accurately control the recording functionality of the Mark IV system. Can you attach markers to the helmet? Yes, markers can be placed anywhere on the helmet. We include some Velcro loop medallions in the kit to place markers anywhere you need on the helmet. Does your system include a warranty? Yes, our system includes a one-year end-to-end warranty that covers every single part and component. The warranty ensures that any part or component will replace or be repaired at no additional cost, including roundtrip shipping from our Austin repair facility. How long does it take to receive my order? Depending on our order queue most systems ship within 7-10 business days. If needed sooner, please contact us. As soon as your order is placed, our operations manager will be in touch with shipping timelines. What is the 6GHz band supported by the Bolt 6 that comes with Mark IV Dual Band edition? Many devices, such as wifi routers and cell phones, use the 5Ghz frequency to communicate wirelessly, making it a very crowded space where interference can occur. This can lead to video drop outs for 5Ghz wireless video systems. The Bolt 6 uses the newly opened 6Ghz wireless frequency which is a significantly quieter wireless environment. It can also use the 5Ghz bands for backwards compatibility. In 6GHz Mode, Bolt 6 users will access faster connections and less interference for a better wireless experience. 6GHz frequency is now available in the US and Canada under UNII-5 government specifications. More countries will open the 6GHz frequency in 2023. Check here for the latest updates on which regions allow 6Ghz operation. What happens if I buy a Mark IV Dual Band system and 6Ghz is not supported in my region? In keeping with international laws and regulations, any Mark IV Dual Band system that is intended to be used in a region where the Bolt 6 is not certified to use 6GHz bands will have the firmware on the Bolt 6 set to operate in 5Ghz bands only. When regulations change and the Bolt 6 becomes certified to use 6Ghz bands, you can easily update the firmware on the Bolt 6 to enable 6Ghz bands. You can reach out to our support team for any assistance you may require. Request a Free Trial Click the button below to download one or all of our software products for a free trial. Explore our different licensing and product options to find the best solution for your facial motion capture needs. If you need a more tailored solution, talk to us about our Enterprise Program ."
  ]
}