{
  "company": "www.yuan.com.tw",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 14,
    "-1": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 14
    }
  },
  "sample_docs": [
    "Press YUAN Demonstration Multipurpose Capture Devices on Computex 2017 Taipei, Taiwan - June 23, 2017 - At computex 2017, YUAN High-Tech Development had demonstrated portable streaming server, analog high definition series, including education, surveillance and medical field and latest artificial intelligence demonstration. SC6C0N1 M 4G - Portable Streaming Server Portable signal streaming box SC6C0N1 M 4G, which provides HDMI/3G-SDI video input interface up to 1080P60 and 4G-LTE/Wifi/Ethernet streaming feature, it also contains internal battery and USB interface for local recording, with its internal battery, SC6C0N1 M 4G can provide up to 3 hours video transfer without AC adapter. We also design many streaming server, which covers from tiny streaming server SC6C0N1 Mini, this also provides HDMI / 3G-SDI streaming and Wifi / Ethernet streaming feature; for those who using legacy equipments user, we also designs SC6C0N1 AIO (4G), which provides additional DVI-I / YP b P r / CVBS interfaces. 4K Capture Card With YUAN's 4K ultra high definition product lines, users can support HDMI2.0/HDMI1.4b/6G-SDI/Quad-Link 3G SDI interfaces. For modern UHD usage scenario, in commercial side YUAN had provided HDMI2.0 and HDMI1.4b for user to capture 4Kp60 or 4Kp30 video. In professional field, here are two kinds of 4K interfaces available in our product line. 6G-SDI interface can afford 4Kp30 video transfer in a single link SDI cable and Quad-Link 3G-SDI is suitable for older 4K equipments and provided 60fp/s video capture. For SFF or mini PC, we also provide SC560N1 M2 HDMI for customers to capture 4Kp30 video in M2-2280 interface/Size. Education and Surveillance We also provide various interface of capture card target to special purpose, especially for education and medical. In education, we have SD and HD capture card up to 8 channels with well integrated SDK, this makes our customers can customize their application and integrated our capture card into original system more easily. Medical In medical field, we had provide several MiniCard/M.2/PCIe 104 interface capture cards for user to integrated into tablet PC or SFF(Small form factor) PC; with our compact capture board, OEM customers can have more tolerance to arrange their layout and design a more small platform. About YUAN YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw Press YUAN Demonstration Multipurpose Capture Devices on Computex 2017 Taipei, Taiwan - June 23, 2017 - At computex 2017, YUAN High-Tech Development had demonstrated portable streaming server, analog high definition series, including education, surveillance and medical field and latest artificial intelligence demonstration. At computex 2017, YUAN High-Tech Development had demonstrated portable streaming server, analog high definition series, including education, surveillance and medical field and latest artificial intelligence demonstration. SC6C0N1 M 4G - Portable Streaming Server Portable signal streaming box SC6C0N1 M 4G, which provides HDMI/3G-SDI video input interface up to 1080P60 and 4G-LTE/Wifi/Ethernet streaming feature, it also contains internal battery and USB interface for local recording, with its internal battery, SC6C0N1 M 4G can provide up to 3 hours video transfer without AC adapter. With YUAN's 4K ultra high definition product lines, users can support HDMI2.0/HDMI1.4b/6G-SDI/Quad-Link 3G SDI interfaces. With YUAN's 4K ultra high definition product lines, users can support HDMI2.0/HDMI1.4b/6G-SDI/Quad-Link 3G SDI interfaces. For modern UHD usage scenario, in commercial side YUAN had provided HDMI2.0 and HDMI1.4b for user to capture 4Kp60 or 4Kp30 video. For modern UHD usage scenario, in commercial side YUAN had provided HDMI2.0 and HDMI1.4b for user to capture 4Kp60 or 4Kp30 video. In professional field, here are two kinds of 4K interfaces available in our product line. 6G-SDI interface can afford 4Kp30 video transfer in a single link SDI cable and Quad-Link 3G-SDI is suitable for older 4K equipments and provided 60fp/s video capture. In professional field, here are two kinds of 4K interfaces available in our product line. 6G-SDI interface can afford 4Kp30 video transfer in a single link SDI cable and Quad-Link 3G-SDI is suitable for older 4K equipments and provided 60fp/s video capture. For SFF or mini PC, we also provide SC560N1 M2 HDMI for customers to capture 4Kp30 video in M2-2280 interface/Size. For SFF or mini PC, we also provide SC560N1 M2 HDMI for customers to capture 4Kp30 video in M2-2280 interface/Size. We also provide various interface of capture card target to special purpose, especially for education and medical. We also provide various interface of capture card target to special purpose, especially for education and medical. In education, we have SD and HD capture card up to 8 channels with well integrated SDK, this makes our customers can customize their application and integrated our capture card into original system more easily. In education, we have SD and HD capture card up to 8 channels with well integrated SDK, this makes our customers can customize their application and integrated our capture card into original system more easily. In medical field, we had provide several MiniCard/M.2/PCIe 104 interface capture cards for user to integrated into tablet PC or SFF(Small form factor) PC; with our compact capture board, OEM customers can have more tolerance to arrange their layout and design a more small platform. In medical field, we had provide several MiniCard/M.2/PCIe 104 interface capture cards for user to integrated into tablet PC or SFF(Small form factor) PC; with our compact capture board, OEM customers can have more tolerance to arrange their layout and design a more small platform. YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw",
    "Market Application Surveillance • Background Recorded video clips and snapshots from legacy analog CCTV camera and DVR is limited image detail and resolution. Further, there could be distortion and attenuation caused during transmission which could bring damaged images. It will bring difficulties to companies and organizations for their security. • Solution With 3G/HD-SDI technology, high quality, uncompressed video can be transmitted in real-time without any delay. Crystal-clear video quality, high frame rate, and wide view angle brings detail-rich image and more image data for better result of high-end analysis. YUAN High-Tech brings full range of 3G/HD-SDI solutions for surveillance market. These high-quality devices are widely adopted by many system integrators and organization worldwide. In the front-end, SDI repeater and SDI could be deployed for signal repeat and split to multiple security sites. On each site, SDI2VGA-S and SDI2HD-S, benefit from its built-in video scaler engine, can be used to view real-time image on traditional and modern monitors. In the security servers, SC542 family can be used for high-end video analysis and SC5C0 family can be used for high-quality video recording and streaming for remote monitoring. Full range of 3G/HD-SDI solutions brings best convenience for system integration and application. Recommended Products SC542 SC5C0 SDI to HDMI-S SDI repeater SDI MUX Market Application Surveillance • Background Recorded video clips and snapshots from legacy analog CCTV camera and DVR is limited image detail and resolution. Further, there could be distortion and attenuation caused during transmission which could bring damaged images. It will bring difficulties to companies and organizations for their security. Recorded video clips and snapshots from legacy analog CCTV camera and DVR is limited image detail and resolution. Further, there could be distortion and attenuation caused during transmission which could bring damaged images. It will bring difficulties to companies and organizations for their security. • Solution With 3G/HD-SDI technology, high quality, uncompressed video can be transmitted in real-time without any delay. Crystal-clear video quality, high frame rate, and wide view angle brings detail-rich image and more image data for better result of high-end analysis. YUAN High-Tech brings full range of 3G/HD-SDI solutions for surveillance market. These high-quality devices are widely adopted by many system integrators and organization worldwide. In the front-end, SDI repeater and SDI could be deployed for signal repeat and split to multiple security sites. On each site, SDI2VGA-S and SDI2HD-S, benefit from its built-in video scaler engine, can be used to view real-time image on traditional and modern monitors. In the security servers, SC542 family can be used for high-end video analysis and SC5C0 family can be used for high-quality video recording and streaming for remote monitoring. Full range of 3G/HD-SDI solutions brings best convenience for system integration and application. With 3G/HD-SDI technology, high quality, uncompressed video can be transmitted in real-time without any delay. Crystal-clear video quality, high frame rate, and wide view angle brings detail-rich image and more image data for better result of high-end analysis. YUAN High-Tech brings full range of 3G/HD-SDI solutions for surveillance market. These high-quality devices are widely adopted by many system integrators and organization worldwide. In the front-end, SDI repeater and SDI could be deployed for signal repeat and split to multiple security sites. On each site, SDI2VGA-S and SDI2HD-S, benefit from its built-in video scaler engine, can be used to view real-time image on traditional and modern monitors. In the security servers, SC542 family can be used for high-end video analysis and SC5C0 family can be used for high-quality video recording and streaming for remote monitoring. Full range of 3G/HD-SDI solutions brings best convenience for system integration and application. SDI to HDMI-S SDI repeater SDI MUX",
    "Press Streaming Solutions Taipei, Taiwan - Jan. 30, 2018 - YUAN High-Tech, the renowned solution provider of professional video in embedded system, industrial and commercial capture card markets, today introduces SC6D0 series, the latest standalone streaming solution. SC6D0 series is an embedded Linux based platform, capable of H.264/AVC encoding and decoding up to 4 channels FHD 1080p60 video content. Once finish the configuration of Ethernet connection, SC6D0 device delivers live video project across internet via RTMP, RTSP, HLS, TS. The interface of SC6D0 is easy, instinct and user-friendly to understand and operate. At the front panel sits multiple physical control buttons, with LED indication, for users to activate functions including streaming, recording, switching and snapshot. SC6D0 comes with two outputs for local real-time preview, a loop-through port and a PGM (programmed video) port, allowing project creators to monitor their live feeds. It provides users with a dedicated USB 3.0 port for instant recording of live video feeds to USB 3.0 or SATA hard disks. SC6D0 provides direct control interfaces, keyboard and mouse, via two USB 2.0 ports, others including Web UI, RS232, essentially users operate SC6D0 device connecting to loop-through monitor, keyboard and mouse as a set of complete OS environment. Software UI of SC6D0 is open for users to customize upon demand. Yuan has developed a full set of SDK for users to add in various functions themselves. Streaming Scenario SC6D0 series adapts to a variety of application scenarios and users is up to tailor make its control interface catering to their demands. All 4 (Signal Source) +1 (PGM channel) channels are able to configured to function independently, users can stream different protocols, bitrates and different tasks for each channel. Capturing Capacity SC6D0 series provide 4 channels FHD 1080P60 video preview and capture. Input sources can be streamed to other SC6D0 devices to decode, PC terminals, or save locally as an iso recorder to SATA or USB3.0 hard disks.. PGM Seamless Switcher PGM (programmed video) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software/system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm ISE Exhibition Yuan will demonstrate SC560N4 6G-SDI at ISE 2018, booth 8-M170, please follow official ISE website for booth location and more information. http://www.easy-guide.mobi/100023/ About YUAN YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw Press Streaming Solutions Taipei, Taiwan - Jan. 30, 2018 - YUAN High-Tech, the renowned solution provider of professional video in embedded system, industrial and commercial capture card markets, today introduces SC6D0 series, the latest standalone streaming solution. SC6D0 series is an embedded Linux based platform, capable of H.264/AVC encoding and decoding up to 4 channels FHD 1080p60 video content. Once finish the configuration of Ethernet connection, SC6D0 device delivers live video project across internet via RTMP, RTSP, HLS, TS. The interface of SC6D0 is easy, instinct and user-friendly to understand and operate. At the front panel sits multiple physical control buttons, with LED indication, for users to activate functions including streaming, recording, switching and snapshot. SC6D0 comes with two outputs for local real-time preview, a loop-through port and a PGM (programmed video) port, allowing project creators to monitor their live feeds. It provides users with a dedicated USB 3.0 port for instant recording of live video feeds to USB 3.0 or SATA hard disks. SC6D0 provides direct control interfaces, keyboard and mouse, via two USB 2.0 ports, others including Web UI, RS232, essentially users operate SC6D0 device connecting to loop-through monitor, keyboard and mouse as a set of complete OS environment. Software UI of SC6D0 is open for users to customize upon demand. Yuan has developed a full set of SDK for users to add in various functions themselves. YUAN High-Tech, the renowned solution provider of professional video in embedded system, industrial and commercial capture card markets, today introduces SC6D0 series, the latest standalone streaming solution. SC6D0 series is an embedded Linux based platform, capable of H.264/AVC encoding and decoding up to 4 channels FHD 1080p60 video content. Once finish the configuration of Ethernet connection, SC6D0 device delivers live video project across internet via RTMP, RTSP, HLS, TS. The interface of SC6D0 is easy, instinct and user-friendly to understand and operate. At the front panel sits multiple physical control buttons, with LED indication, for users to activate functions including streaming, recording, switching and snapshot. SC6D0 comes with two outputs for local real-time preview, a loop-through port and a PGM (programmed video) port, allowing project creators to monitor their live feeds. It provides users with a dedicated USB 3.0 port for instant recording of live video feeds to USB 3.0 or SATA hard disks. SC6D0 provides direct control interfaces, keyboard and mouse, via two USB 2.0 ports, others including Web UI, RS232, essentially users operate SC6D0 device connecting to loop-through monitor, keyboard and mouse as a set of complete OS environment. Software UI of SC6D0 is open for users to customize upon demand. Yuan has developed a full set of SDK for users to add in various functions themselves. SC6D0 series adapts to a variety of application scenarios and users is up to tailor make its control interface catering to their demands. All 4 (Signal Source) +1 (PGM channel) channels are able to configured to function independently, users can stream different protocols, bitrates and different tasks for each channel. All 4 (Signal Source) +1 (PGM channel) channels are able to configured to function independently, users can stream different protocols, bitrates and different tasks for each channel. Capturing Capacity SC6D0 series provide 4 channels FHD 1080P60 video preview and capture. Input sources can be streamed to other SC6D0 devices to decode, PC terminals, or save locally as an iso recorder to SATA or USB3.0 hard disks.. PGM Seamless Switcher PGM (programmed video) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. PGM (programmed video) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software/system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software/system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm Yuan will demonstrate SC560N4 6G-SDI at ISE 2018, booth 8-M170, please follow official ISE website for booth location and more information. http://www.easy-guide.mobi/100023/ YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw",
    "Press 4K Streaming Server Taipei, Taiwan - May. 28, 2018 - SC6D0N4 SDI and SC6D0N4 HDMI streaming encoders have been highly praised by many of Yuan's customers from different markets after the official release to the market. The positive feedbacks have incentivized Yuan to further develop and refine embedded products ( to assist our customers ). Today, we are proud to introduce our two latest embedded products, SC6D0N8 and SC6D0N1 HDMI2. Same as other members of SC6D0 family, SC6D0N8 and SC6D0N1 HDMI2 come in 1080P300fps encoding and decoding power, support RTMP, RTSP, HLS, and TS streaming protocols, and reserve for own customization on software interface. SC6D0N1 HDMI2 shares the same UI with SC6D0N4 series, the operating interface is user-friendly, easy to understand and made of instinct. At the front panel sits multiple physical control buttons, with LED indication, for users to activate functions including streaming, recording, switching and snapshot. SC6D0N1 HDMI2 comes with one outputs for local real-time preview, a loop-through port and a PGM (programmed video) port, allowing project creators to monitor their live feeds. It provides users with a dedicated USB 3.0 port for instant recording of live video feeds to USB 3.0 hard disks. SC6D0N8 SC6D0N8 is a standard 1U size unit with six channels of SDI and two channels of AIO ( HDMI / DVI-I / VGA / S-Video / YP b P r / CVBS ) input interface, each channel provides up to 1080p30 capturing and encoding. At its hardware, SC6D0N8 is equipped with USB2.0, RS232 and RS485 control interfaces, as well as USB3.0 and two SATA interfaces for storage of video footages. Streaming Scenario SC6D0 series adapts to a variety of application scenarios and users is up to tailor make its control interface catering to their demands. All channels of SC6D0 devices allow independent setting and tasks configurations and perform perfectly. Users are able to stream different protocols, bitrates and assign different tasks for each channel. Capturing Capacity SC6D0 series provide 4×1080P60 or 8×1080P30 or 1×4K ( P60 input / P30 recording and output ) video support. Input sources can be streamed to other SC6D0 devices to decode, PC terminals, or save locally as an iso recorder to SATA or USB3.0 hard disks. PGM Seamless Switcher PGM ( programmed video ) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software / system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm About YUAN YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw Press 4K Streaming Server Taipei, Taiwan - May. 28, 2018 - SC6D0N4 SDI and SC6D0N4 HDMI streaming encoders have been highly praised by many of Yuan's customers from different markets after the official release to the market. The positive feedbacks have incentivized Yuan to further develop and refine embedded products ( to assist our customers ). Today, we are proud to introduce our two latest embedded products, SC6D0N8 and SC6D0N1 HDMI2. SC6D0N4 SDI and SC6D0N4 HDMI streaming encoders have been highly praised by many of Yuan's customers from different markets after the official release to the market. The positive feedbacks have incentivized Yuan to further develop and refine embedded products ( to assist our customers ). Today, we are proud to introduce our two latest embedded products, SC6D0N8 and SC6D0N1 HDMI2. Same as other members of SC6D0 family, SC6D0N8 and SC6D0N1 HDMI2 come in 1080P300fps encoding and decoding power, support RTMP, RTSP, HLS, and TS streaming protocols, and reserve for own customization on software interface. SC6D0N1 HDMI2 shares the same UI with SC6D0N4 series, the operating interface is user-friendly, easy to understand and made of instinct. At the front panel sits multiple physical control buttons, with LED indication, for users to activate functions including streaming, recording, switching and snapshot. SC6D0N1 HDMI2 comes with one outputs for local real-time preview, a loop-through port and a PGM (programmed video) port, allowing project creators to monitor their live feeds. It provides users with a dedicated USB 3.0 port for instant recording of live video feeds to USB 3.0 hard disks. SC6D0N8 is a standard 1U size unit with six channels of SDI and two channels of AIO ( HDMI / DVI-I / VGA / S-Video / YP b P r / CVBS ) input interface, each channel provides up to 1080p30 capturing and encoding. At its hardware, SC6D0N8 is equipped with USB2.0, RS232 and RS485 control interfaces, as well as USB3.0 and two SATA interfaces for storage of video footages. SC6D0 series adapts to a variety of application scenarios and users is up to tailor make its control interface catering to their demands. All channels of SC6D0 devices allow independent setting and tasks configurations and perform perfectly. Users are able to stream different protocols, bitrates and assign different tasks for each channel. All channels of SC6D0 devices allow independent setting and tasks configurations and perform perfectly. Users are able to stream different protocols, bitrates and assign different tasks for each channel. Capturing Capacity SC6D0 series provide 4×1080P60 or 8×1080P30 or 1×4K ( P60 input / P30 recording and output ) video support. Input sources can be streamed to other SC6D0 devices to decode, PC terminals, or save locally as an iso recorder to SATA or USB3.0 hard disks. SC6D0 series provide 4×1080P60 or 8×1080P30 or 1×4K ( P60 input / P30 recording and output ) video support. Input sources can be streamed to other SC6D0 devices to decode, PC terminals, or save locally as an iso recorder to SATA or USB3.0 hard disks. PGM Seamless Switcher PGM ( programmed video ) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. PGM ( programmed video ) mode output provide various display layouts including quadview, PIP and PBP, etc. Yuan also provide customization service for users to design their own display mode. All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software / system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm All SC6D0 products are compatible with Yuan full-function SDK and demonstration applications. Our SDK encompasses over 100 powerful function modules including streaming, video editing or 3D recording to ensure less Research & Development efforts and time-to market solutions. All sample codes are available to our customers to freely design and develop software / system upon integrating with Yuan capture products. These diverse functions are made possible by Yuan SDK, supporting RTSP, RTMP, MMS, HLS, TS, and ONVIF2.0 protocols for users to broadcast their captured video online. For SC6D0 series, please check our website for the latest information http://www.yuan.com.tw/sc6d0.htm YUAN, headquartered in Taipei, Taiwan, is a leading force in digital home entertainment, broadcasting, and surveillance markets, delivering an extensive range of high-quality solutions for system integrator and ODM customers. As one of the major providers in these markets, YUAN's solutions can be found in products of worldwide leading ODM manufacturers and distributors. For more information about YUAN and its latest products, please visit : www.yuan.com.tw",
    "Press M.2 Capture Solution Release Taipei, Taiwan - May 31, 2018 - Yuan today unveils SC550N4 M2 SDI and SC550N4 M2 HDMI, latest four-channel 1080p60 NGFF ( Next Generation Form Factor ) video capture models, to the market after the successful release of the smallest M.2 FHD video capture card SC550N1 M2 HDMI ( AE Type, 22×30mm ). Committing to OEM / ODM designing services, Yuan has received various requests from different fields, including automation, broadcasting, medical or video conference etc., we have delivered comprehensive solutions and committed to the development on M.2 interfaces and its application. SC550N1 M2 HDMI( 2230AE ) SC550N4 M2 SDI SC550N4 M2 HDMI Following the launch of two-channel SDI and HDMI M.2 interface video capture models, Yuan releases a new model, SC550N2 M2 Hybrid, offering simultaneous SDI and DVI-I capturing, further catering to demands from different market applications. SC550N2 M2 Hybrid SC550N2 M2 SDI SC550N2 M2 HDMI * For more information about H.264 hardware compression and software compression M.2 interface capture cards, please visit our website at : M.2 Capture Solution * 2017 M.2 Press release : 2017 M.2 Press Release Press M.2 Capture Solution Release Taipei, Taiwan - May 31, 2018 - Yuan today unveils SC550N4 M2 SDI and SC550N4 M2 HDMI, latest four-channel 1080p60 NGFF ( Next Generation Form Factor ) video capture models, to the market after the successful release of the smallest M.2 FHD video capture card SC550N1 M2 HDMI ( AE Type, 22×30mm ). Committing to OEM / ODM designing services, Yuan has received various requests from different fields, including automation, broadcasting, medical or video conference etc., we have delivered comprehensive solutions and committed to the development on M.2 interfaces and its application. Yuan today unveils SC550N4 M2 SDI and SC550N4 M2 HDMI, latest four-channel 1080p60 NGFF ( Next Generation Form Factor ) video capture models, to the market after the successful release of the smallest M.2 FHD video capture card SC550N1 M2 HDMI ( AE Type, 22×30mm ). Committing to OEM / ODM designing services, Yuan has received various requests from different fields, including automation, broadcasting, medical or video conference etc., we have delivered comprehensive solutions and committed to the development on M.2 interfaces and its application. SC550N1 M2 HDMI( 2230AE ) Following the launch of two-channel SDI and HDMI M.2 interface video capture models, Yuan releases a new model, SC550N2 M2 Hybrid, offering simultaneous SDI and DVI-I capturing, further catering to demands from different market applications. * For more information about H.264 hardware compression and software compression M.2 interface capture cards, please visit our website at : M.2 Capture Solution * 2017 M.2 Press release : 2017 M.2 Press Release"
  ]
}