{
  "company": "www.johnsoncontrols.com",
  "dominant_topics": [
    34,
    2,
    19
  ],
  "topic_counts": {
    "34": 2,
    "2": 1,
    "19": 1
  },
  "topic_descriptions": {
    "34": "dragon, nuance, pdf, english, contact center",
    "2": "demand, cctv, camera, ca, verkada",
    "19": "energy, software, water, management, grid"
  },
  "framing_scores": {
    "framing_ethical": 0.4,
    "framing_surveillance": 0.0,
    "framing_market": 0.6,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "2": 1,
      "19": 1,
      "34": 2
    }
  },
  "sample_docs": [
    "Home | Media | Careers | Investors | Locations | Contact Us About Us | Products & Solutions | Technology People spend more time in their vehicles than ever before. Johnson Controls' Automotive Experience has a unique insight into how People spend more time in their vehicles than ever before. Johnson Controls' Automotive Experience has a unique insight into how consumers interact with vehicle interiors. This is why we can provide the automakers with the right combination of style, comfort and convenience for their vehicle interiors. It is not only about manufacturing - we design, engineer, integrate and deliver them globally. Innovative automotive interiors help make driving more comfortable, safe and enjoyable. Our automotive product portfolio includes seating systems, instrument panels, door panels, overhead systems, floor consoles and interior electronics. Groundbreaking research from Johnson Controls called human-machine-interaction (HMI) drives automotive... Read more As today's vehicles have become more and more sophisticated, the demand for electricity to power their myriad electronics has As today's vehicles have become more and more sophisticated, the demand for electricity to power their myriad electronics has grown exponentially. Johnson Controls has used ingenuity and innovation to become the world's largest producer of lead-acid automotive batteries and continues to break new ground by developing advanced battery chemistries for hybrids. For us, something that just works isn't good enough if it can work better. Johnson Controls is a global leader in the production of batteries for hybrid electric vehicles. It's a global effort ... Read more When energy efficiency in a home or building increases, it's not only the utility bill that goes down. So do the greenhouse gas When energy efficiency in a home or building increases, it's not only the utility bill that goes down. So do the greenhouse gas emissions associated with the burning of fossil fuels. The smart environments we create for customers are efficient, safe and sustainable. That makes the occupants more productive and more comfortable. And that's good for business ... and for life. Johnson Controls' Battery Testing Center is expanding to fit the entire hybrid battery team under one roof, which ... Read more Site map | Privacy | of use | Copyright",
    "Awards One of America's best company cultures Inaugural ranking from Forbes and Statista Products & Innovation Introducing Metasys 15.0 Smarter tools, faster workflows and deeper insights See the latest Metasys Products & Innovation AI is hot. We make it cool. Scalable cooling solutions for evolving data center needs Previous Next Transform buildings from static entities into smart, strategic assets Get connected to optimize chiller performance Combine easy-to-use data from our connected chiller dashboard with regular review by our chiller experts to cut energy costs, minimize downtime and enhance sustainability. Explore the dashboard Get real-time data visibility OpenBlue Enterprise Manager provides real-time data visibility across assets, people, and processes, empowering you to drive intelligent and proactive operations. The next generation of smart and connected A global portfolio of proven solutions. HVAC Equipment The largest portfolio of HVAC equipment and controls in the world. Security From access control, intrusion detection, from video surveillance to weapons detection and emerging technologies. Building Automation and Controls The intelligence you need to create safer, smarter building environments. Fire Detection From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. Building Insights We've been innovating since 1885. Here is a selection of our thinking and perspectives. See more Building Insights Feature Story Katie McGinty named to Global Commission on Healthy Indoor Air Feature Story Smart Buildings Bringing comfort to rock stars at Capitol Records headquarters Feature Story OpenBlue Can the world's tallest skyscraper also be smart? Ernest Flagg said yes In The News Smart Buildings Turning smart buildings into a lever for growth, resilience, and competitive advantage Feature Story Digital Solutions Buildings Beyond FedRAMP: How OpenBlue meets the unique workplace needs of government agencies Case Study OpenBlue Education How Definity Insurance optimized their hybrid workspace with OpenBlue Our Latest News OCT 08, 2025 Johnson Controls Announces Investment in Data Centre Liquid Cooling Company Accelsius OCT 08, 2025 Johnson Controls announces fourth quarter 2025 earnings conference call webcast SEP 30, 2025 Johnson Controls redefines the future of building safety at GSX 2025 SEP 25, 2025 Johnson Controls deepens commitment to workforce development with additional $3M investment to community college partners Awards One of America's best company cultures Inaugural ranking from Forbes and Statista Products & Innovation Introducing Metasys 15.0 Smarter tools, faster workflows and deeper insights See the latest Metasys Products & Innovation AI is hot. We make it cool. Scalable cooling solutions for evolving data center needs Previous Next One of America's best company cultures Inaugural ranking from Forbes and Statista Smarter tools, faster workflows and deeper insights AI is hot. We make it cool. Scalable cooling solutions for evolving data center needs Transform buildings from static entities into smart, strategic assets Transform buildings from static entities into smart, strategic assets Get connected to optimize chiller performance Combine easy-to-use data from our connected chiller dashboard with regular review by our chiller experts to cut energy costs, minimize downtime and enhance sustainability. Explore the dashboard Get real-time data visibility OpenBlue Enterprise Manager provides real-time data visibility across assets, people, and processes, empowering you to drive intelligent and proactive operations. Get connected to optimize chiller performance Combine easy-to-use data from our connected chiller dashboard with regular review by our chiller experts to cut energy costs, minimize downtime and enhance sustainability. Get real-time data visibility OpenBlue Enterprise Manager provides real-time data visibility across assets, people, and processes, empowering you to drive intelligent and proactive operations. The next generation of smart and connected A global portfolio of proven solutions. HVAC Equipment The largest portfolio of HVAC equipment and controls in the world. Security From access control, intrusion detection, from video surveillance to weapons detection and emerging technologies. Building Automation and Controls The intelligence you need to create safer, smarter building environments. Fire Detection From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. The next generation of smart and connected A global portfolio of proven solutions. The largest portfolio of HVAC equipment and controls in the world. The largest portfolio of HVAC equipment and controls in the world. From access control, intrusion detection, from video surveillance to weapons detection and emerging technologies. From access control, intrusion detection, from video surveillance to weapons detection and emerging technologies. Building Automation and Controls The intelligence you need to create safer, smarter building environments. The intelligence you need to create safer, smarter building environments. From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. Building Insights We've been innovating since 1885. Here is a selection of our thinking and perspectives. See more Building Insights Feature Story Katie McGinty named to Global Commission on Healthy Indoor Air Feature Story Smart Buildings Bringing comfort to rock stars at Capitol Records headquarters Feature Story OpenBlue Can the world's tallest skyscraper also be smart? Ernest Flagg said yes In The News Smart Buildings Turning smart buildings into a lever for growth, resilience, and competitive advantage Feature Story Digital Solutions Buildings Beyond FedRAMP: How OpenBlue meets the unique workplace needs of government agencies Case Study OpenBlue Education How Definity Insurance optimized their hybrid workspace with OpenBlue We've been innovating since 1885. Here is a selection of our thinking and perspectives. Our Latest News OCT 08, 2025 Johnson Controls Announces Investment in Data Centre Liquid Cooling Company Accelsius OCT 08, 2025 Johnson Controls announces fourth quarter 2025 earnings conference call webcast SEP 30, 2025 Johnson Controls redefines the future of building safety at GSX 2025 SEP 25, 2025 Johnson Controls deepens commitment to workforce development with additional $3M investment to community college partners",
    "HVAC Equipment Security Industrial Refrigeration Fire Suppression Retail Solutions Building Automation & Controls Fire Detection 全球目录 South Africa - English Australia - English China - 简体中文 Hong Kong, China - English India - English Indonesia - English Japan - 日本語 Korea – 한국어 Malaysia - English New Zealand - English Singapore - English Thailand - English Thailand - ภาษาไทย Vietnam - English Anguilla - English Antigua & Barbuda - English Aruba - English Bahamas - English Barbados - English British Virgin Islands - English Cayman - Islands - English Curacao - English Dominica - English Dominican Republic - Español Grenada - English Guadeloupe - English Haiti - English Jamaica - English Martinique - English Puerto Rico - English Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Anguilla - English Antigua & Barbuda Aruba-English Bahamas - English Barbados - English British Virgin Islands Cayman - Islands Curacao Dominica - English Dominican Republic - Español Grenada Guadeloupe - English Haiti - English Jamaica - English Martinique Puerto Rico Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Belize - English Costa Rica - Español El Salvador - Español Guatemala - Español Honduras - Español Nicaragua - Español Panama - Español Austria - Deutsch Belgium - Français* Belgium - Nederlands* Bosnia & Herzegovina - English* Bulgaria - English* Croatia - English Czech Republic - Čeština Denmark - Dansk Finland - Suomeksi France - Français Germany - Deutsch Italy - Italiano Netherlands - Dutch Norway - Norge Poland - Polski Portugal - Português Russia - Русский Slovakia - Slovenčina Spain - Español* Switzerland - Deutsch Switzerland - Français United Kingdom - English Bahrain - English Egypt - English Kuwait - English Oman - English Qatar - English Saudi Arabia - English Turkey - Türkçe UAE - English United States - English Canada - English Canada - French Mexico - Spanish Argentina - Español Bolivia - Español Brazil - Português Chile - Español Colombia - Español Ecuador - Español Peru - Español Uruguay - Español Venezuela - Español South Africa - English Hong Kong, China - English New Zealand - English Antigua & Barbuda - English British Virgin Islands - English Cayman - Islands - English Dominican Republic - Español Puerto Rico - English Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Dominican Republic - Español Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Costa Rica - Español El Salvador - Español Bosnia & Herzegovina - English* Czech Republic - Čeština United Kingdom - English Saudi Arabia - English United States - English 利用數據 我們會根據所有安全資產創建一份清單, 並對其進行\"映射\", 從而以虛擬形式呈現您的設施、系统和資產之後。我們合自動並持續地對您的數據進行遠程監控,並使用我們全面的工具集對這些數據進行分析,以在極短的時間內發現問題而通常情況下,這些同題可能多數後才,會顯現或可以檢測出來。我們可帶助您最大限度地利用您的安全資產。 保障服務 保障服務涵蓋一系列功能,可以為安全團隊提供事件影像信息和自動化處置能力,同時還可以提供您所需的多種工具,幫助您在整個生命周期內對資產進行管理,從而確保此類資產的使用合法合規。 資產標準與流程:對整個企業的數據模式進行標準化,以提高一致性 數據完整性:自動梳理常見故障/便從而至於識別和解決這類故障 監控:使用您首選的客戶關系管理(CRM)系統自動創建工作服務單 資產生命周期:在資產的整個生命周期內抓取相關指標, 以分析總體擁有成本(TCO)、製造商表現、集成商服務表現、服務等级協議(SLA)和保修追蹤 安全資產監控 物聯網設備在樓宇系统中的普遍應用帯來了日益嚴重的安全威脅。江森自控保障服務通過對安全資產進行築中管理和遠程監控 來 幫助解決這一問題。這使您能夠迅速發現並解決問題。 尋找讓設施變得更智能、更安全的機會。 白皮书 Is Your Security Network Ready for GDPR? 视频 How Data Analytics Drive Future Innovation for Security 白皮书 Is Your Security Network Ready for GDPR? 视频 How Data Analytics Drive Future Innovation for Security 聯繫我們 查找位置 樓宇自控系統 暖通空調系統 安防產品 火警檢測 消防滅火產品 工業冷凍 數位化解決方案 零售解决方案 智慧建築 樓宇自控系統 暖通空調系統 安防產品 火警檢測 消防滅火產品 工業冷凍 數位化解決方案 零售解决方案 零組件服務 日常服務及保養 專家檢測與效能檢查 節能改造與系統優化 綠色建築節能認證服務 資料下載 服務 零組件服務 日常服務及保養 專家檢測與效能檢查 節能改造與系統優化 綠色建築節能認證服務 資料下載 我們的公司 職業發展 投資者 (U.S. Site) 供應商 (U.S. Site) 網路解決方案 (U.S. Site) 銷售夥伴 (U.S. Site) 可持續性 (U.S. Site) 地點 聯繫我們 關於我們 我們的公司 職業發展 投資者 (U.S. Site) 供應商 (U.S. Site) 網路解決方案 (U.S. Site) 銷售夥伴 (U.S. Site) 可持續性 (U.S. Site) 地點 聯繫我們 江森自控保留所有權利。 法律 隱私設置",
    "HVAC Equipment Security Digital Solutions Industrial Refrigeration Fire Suppression Retail Solutions Residential and Smart Home Building Automation & Controls Fire Detection Distributed Energy Storage Global Directory South Africa - English Australia - English China - 简体中文 Hong Kong, China - English India - English Indonesia - English Japan - 日本語 Korea – 한국어 Malaysia - English New Zealand - English Singapore - English Thailand - English Thailand - ภาษาไทย * Anguilla - English Antigua & Barbuda Aruba-English Bahamas - English Barbados - English British Virgin Islands Cayman - Islands Curacao Dominica - English Dominican Republic - Español Grenada Guadeloupe - English Haiti - English Jamaica - English Martinique Puerto Rico Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Belize - English Costa Rica - Español El Salvador - Español Guatemala - Español Honduras - Español Nicaragua - Español Panama - Español Austria - Deutsch Belgium - Français* Belgium - Nederlands* Bosnia & Herzegovina - English* Bulgaria - English* Croatia - English* Czech Republic - Čeština Denmark - Dansk Finland - Suomeksi France - Français Germany - Deutsch Italy - Italiano Netherlands - Nederlands Norway - Norge Poland - Polski Portugal - Português* Russia - Русский Slovakia - Slovenčina Spain - Español* Switzerland - Deutsch* Switzerland - Français* United Kingdom - English Bahrain - English Egypt - English Kuwait - English Oman - English Qatar - English Saudi Arabia - English Turkey - Türkçe UAE - English United States - English Canada - English Mexico - Spanish Argentina - Español Bolivia - Español Brazil - Português Chile - Español Colombia - Español Ecuador - Español Peru - Español Uruguay - Español Venezuela - Español South Africa - English Hong Kong, China - English New Zealand - English Thailand - ภาษาไทย * Dominican Republic - Español Puerto Rico - Español Saint Barthélemy - English Saint Kitts and Nevis - English Saint Lucia - English Saint Martin - English Saint Vincent & The Grenadines - English Trinidad & Tobago - English Virgin Islands - English Costa Rica - Español El Salvador - Español Bosnia & Herzegovina - English* Czech Republic - Čeština United Kingdom - English Saudi Arabia - English United States - English We Help You Protect People and Assets in Every Conceivable Setting A key part of your mission is to build and operate facilities that are safe and secure, whether your space is designed for people, for products, or for both. Addressing this challenge is at the very core of what we do at Johnson Controls. We offer the broadest array of products, connected and controlled by the most advanced systems and technologies, combined and configured to deliver a solution that's right for your facility and right for your bottom line. Working with our customers and partners around the world, we are creating a smart future for all kinds of facilities. We make buildings better for occupants, better for the environment, and better for your bottom line. Johnson Controls: The power behind your mission . Real Facilities; Real Solutions Read about how our customers are using Johnson Controls solutions to change the way their buildings and facilities work. Innovative technologies With a clear focus on Data Center Solutions, we are influencing the way owners and consultants think about building sustainable and secure, smart solutions in their data centers. Read the Press Release Office of the Future Middle East's sustainability pioneer, Bee'ah, selects Johnson Controls and Microsoft to provide a sweeping array of artificial intelligence (AI) and smart building solutions for its new headquarters. Read the News Release Real Facilities; Real Solutions Read about how our customers are using Johnson Controls solutions to change the way their buildings and facilities work. Innovative technologies With a clear focus on Data Center Solutions, we are influencing the way owners and consultants think about building sustainable and secure, smart solutions in their data centers. Read the Press Release Office of the Future Middle East's sustainability pioneer, Bee'ah, selects Johnson Controls and Microsoft to provide a sweeping array of artificial intelligence (AI) and smart building solutions for its new headquarters. Read the News Release The Next Generation of Smart and Connected A global portfolio of proven solutions. HVAC Equipment The largest portfolio of HVAC equipment and controls in the world. Security From access controls to intruder prevention, from video surveillance to cybersecurity. Building Automation & Controls The intelligence you need to create safer, smarter building environments. Fire Detection From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. The Next Generation of Smart and Connected A global portfolio of proven solutions. The largest portfolio of HVAC equipment and controls in the world. The largest portfolio of HVAC equipment and controls in the world. From access controls to intruder prevention, from video surveillance to cybersecurity. From access controls to intruder prevention, from video surveillance to cybersecurity. Building Automation & Controls The intelligence you need to create safer, smarter building environments. The intelligence you need to create safer, smarter building environments. From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. From components—sensors, initiating devices, annunciators, and control panels—to integrated systems. Insights We've been innovating since 1885. Here is a selection of our thinking and perspectives. See More Insights Case Study Building Automation and Controls Healthcare Improving care environments and the bottom line at a Texas hospital Press Release Sensormatic Solutions predicts condensed holiday season will drive high shopper traffic on Super Saturday In the News Government Johnson Controls' CEO Oliver talks Milwaukee growth plans, DNC involvement Johnson Controls releases targeted hardware platforms for superior video management Feature Story Fire Detection Construction Johnson Controls and Lincoln Tech complete the launch of 10 vocational classrooms through workforce development partnership Case Study Digital Solutions Data Centers Cloud provider improves operating costs and drives down construction time We've been innovating since 1885. Here is a selection of our thinking and perspectives. Building Automation and Controls The Latest News Read more from Johnson Controls and its subsidiary companies around the world. Dec 16, 2019 Sensormatic Solutions predicts condensed holiday season will drive high shopper traffic on Super Saturday Dec 12, 2019 Johnson Controls releases targeted hardware platforms for superior video management Dec 11, 2019 Johnson Controls announces Tyco Software House C•CURE Visit Verified Identity using civic for fast and secure identity verification Read more from Johnson Controls and its subsidiary companies around the world. Sensormatic Solutions predicts condensed holiday season will drive high shopper traffic on Super Saturday Johnson Controls releases targeted hardware platforms for superior video management Johnson Controls announces Tyco Software House C•CURE Visit Verified Identity using civic for fast and secure identity verification Connect With Us Find a location HVAC Equipment Fire Detection Fire Suppression Distributed Energy Storage Digital Solutions Industrial Refrigeration Building Automation and Controls Residential and Smart Home Security Retail Solutions Products and Solutions HVAC Equipment Fire Detection Fire Suppression Distributed Energy Storage Digital Solutions Industrial Refrigeration Building Automation and Controls Residential and Smart Home Security Retail Solutions Operations Maintenance and Repair Services Training Services Product Documentation Product Selection Tools Energy and Efficiency Solutions Design and Construction Solutions Optimization and Retrofit Solutions Systems Integration Managed Services Fire Maintenance and Support Security Maintenance and Support Replacement Parts and Supplies Services and Support Operations Maintenance and Repair Services Training Services Product Documentation Product Selection Tools Energy and Efficiency Solutions Design and Construction Solutions Optimization and Retrofit Solutions Systems Integration Managed Services Fire Maintenance and Support Security Maintenance and Support Replacement Parts and Supplies Industries Industries Industries Our Company Careers Media Investors Suppliers Cyber Solutions Sales Partners Sustainability Contact Us Locations Login About Us Our Company Careers Media Investors Suppliers Cyber Solutions Sales Partners Sustainability Contact Us Locations Login Insights Insights Insights Trade Shows Webinars Podcasts Events Trade Shows Webinars Podcasts . Legal Privacy Building Automation and Controls Residential and Smart Home Building Automation and Controls Residential and Smart Home Operations Maintenance and Repair Services Energy and Efficiency Solutions Design and Construction Solutions Optimization and Retrofit Solutions Fire Maintenance and Support Security Maintenance and Support Replacement Parts and Supplies Operations Maintenance and Repair Services Energy and Efficiency Solutions Design and Construction Solutions Optimization and Retrofit Solutions Fire Maintenance and Support Security Maintenance and Support Replacement Parts and Supplies"
  ]
}