{
  "company": "www.fourthline.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 56,
    "-1": 15
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.2962843295638126,
    "framing_surveillance": 0.0316639741518578,
    "framing_market": 0.6720516962843296,
    "num_docs": 71
  },
  "topic_timeline": {
    "20": {
      "-1": 15,
      "0": 56
    }
  },
  "sample_docs": [
    "Why regulated enterprises trust Fourthline Learn how Fourthline's digital identity solutions ensure compliance at industry-leading conversion rates, accuracy levels and processing times. Setting a new standard in KYC 60% greater fraud detection 210+ data point checks 40% higher conversion 3500+ ID documents supported Drive growth and stay in control Choosing between effective fraud detection and a seamless onboarding experience is no longer necessary. Thanks to Fourthline's proprietary AI technology and user-centric onboarding flow, you can deliver a fast and secure customer journey—with basic ID verification in a few seconds or end-to-end, bank-grade KYC in under 90 seconds. Make measurable improvements to your conversion rate with next-generation NFC and OCR data capture, native SDKs, and intelligent false positive mitigation. Customize a solution to fit your needs One-size-fits-all KYC solutions are as costly as they are cumbersome. Fourthline's modular product architecture enables you to choose the precise components to meet your requirements—whether it's document verification, liveness checks, proof-of-address, daily PEP/sanctions/watchlist screenings, or a completely outsourced bank-grade KYC solution. From risk configuration and local compliance frameworks to customized escalation protocols, reporting, and branding, you can craft your ideal solution. Comply with the strictest regulations, effortlessly You need a digital identity partner you can rely on. Licensed as a payment institution by the Dutch Central Bank and the UK Financial Conduct Authority, Fourthline adheres to the same high standards as its clients. Fourthline's solutions and infrastructure pass the scrutiny of both regulators and the world's most trusted financial institutions for data privacy, IT security, business continuity, and local AML compliance. Strengthen your compliance with all data processed in the EU, local legal opinions from reputable firms, and experience navigating local regulatory regimes. Minimize risk with the highest levels of fraud detection Fraud techniques today are advanced and ever-evolving. Fourthline's fraud prevention technologies monitor fraud patterns across borders and partners, and adapt in real-time. We continuously recalibrate our in-house built and trained AI models to eliminate bias, incorporate new learnings, and perform more data checks than any other provider, detecting 60% more fraud than competitors—at 99.98% accuracy. Safeguard your enterprise by preventing an additional 20 to 30% of fraudulent activity through enhanced post-signup monitoring that reveals hidden geolocation anomalies, criminal activity patterns, data inconsistencies and more. Want to ? Get in touch with our fraud and compliance experts today Why regulated enterprises trust Fourthline Learn how Fourthline's digital identity solutions ensure compliance at industry-leading conversion rates, accuracy levels and processing times. Setting a new standard in KYC 60% greater fraud detection 210+ data point checks 40% higher conversion 3500+ ID documents supported Setting a new standard in KYC Drive growth and stay in control Choosing between effective fraud detection and a seamless onboarding experience is no longer necessary. Thanks to Fourthline's proprietary AI technology and user-centric onboarding flow, you can deliver a fast and secure customer journey—with basic ID verification in a few seconds or end-to-end, bank-grade KYC in under 90 seconds. Make measurable improvements to your conversion rate with next-generation NFC and OCR data capture, native SDKs, and intelligent false positive mitigation. Drive growth and stay in control Choosing between effective fraud detection and a seamless onboarding experience is no longer necessary. Thanks to Fourthline's proprietary AI technology and user-centric onboarding flow, you can deliver a fast and secure customer journey—with basic ID verification in a few seconds or end-to-end, bank-grade KYC in under 90 seconds. Make measurable improvements to your conversion rate with next-generation NFC and OCR data capture, native SDKs, and intelligent false positive mitigation. Customize a solution to fit your needs One-size-fits-all KYC solutions are as costly as they are cumbersome. Fourthline's modular product architecture enables you to choose the precise components to meet your requirements—whether it's document verification, liveness checks, proof-of-address, daily PEP/sanctions/watchlist screenings, or a completely outsourced bank-grade KYC solution. From risk configuration and local compliance frameworks to customized escalation protocols, reporting, and branding, you can craft your ideal solution. Customize a solution to fit your needs One-size-fits-all KYC solutions are as costly as they are cumbersome. Fourthline's modular product architecture enables you to choose the precise components to meet your requirements—whether it's document verification, liveness checks, proof-of-address, daily PEP/sanctions/watchlist screenings, or a completely outsourced bank-grade KYC solution. From risk configuration and local compliance frameworks to customized escalation protocols, reporting, and branding, you can craft your ideal solution. Comply with the strictest regulations, effortlessly You need a digital identity partner you can rely on. Licensed as a payment institution by the Dutch Central Bank and the UK Financial Conduct Authority, Fourthline adheres to the same high standards as its clients. Fourthline's solutions and infrastructure pass the scrutiny of both regulators and the world's most trusted financial institutions for data privacy, IT security, business continuity, and local AML compliance. Strengthen your compliance with all data processed in the EU, local legal opinions from reputable firms, and experience navigating local regulatory regimes. Comply with the strictest regulations, effortlessly You need a digital identity partner you can rely on. Licensed as a payment institution by the Dutch Central Bank and the UK Financial Conduct Authority, Fourthline adheres to the same high standards as its clients. Fourthline's solutions and infrastructure pass the scrutiny of both regulators and the world's most trusted financial institutions for data privacy, IT security, business continuity, and local AML compliance. Strengthen your compliance with all data processed in the EU, local legal opinions from reputable firms, and experience navigating local regulatory regimes. Minimize risk with the highest levels of fraud detection Fraud techniques today are advanced and ever-evolving. Fourthline's fraud prevention technologies monitor fraud patterns across borders and partners, and adapt in real-time. We continuously recalibrate our in-house built and trained AI models to eliminate bias, incorporate new learnings, and perform more data checks than any other provider, detecting 60% more fraud than competitors—at 99.98% accuracy. Safeguard your enterprise by preventing an additional 20 to 30% of fraudulent activity through enhanced post-signup monitoring that reveals hidden geolocation anomalies, criminal activity patterns, data inconsistencies and more. Minimize risk with the highest levels of fraud detection Fraud techniques today are advanced and ever-evolving. Fourthline's fraud prevention technologies monitor fraud patterns across borders and partners, and adapt in real-time. We continuously recalibrate our in-house built and trained AI models to eliminate bias, incorporate new learnings, and perform more data checks than any other provider, detecting 60% more fraud than competitors—at 99.98% accuracy. Safeguard your enterprise by preventing an additional 20 to 30% of fraudulent activity through enhanced post-signup monitoring that reveals hidden geolocation anomalies, criminal activity patterns, data inconsistencies and more. Want to ? Get in touch with our fraud and compliance experts today",
    "SHARE While businesses across industries faced unprecedented challenges in 2020, data shows that fraud rates reached all-time highs, with identity fraud attempts surging by 15% compared to 2019. Covid-19 has not only ravaged public health and the global economy, but has also opened new windows of opportunity for fraudsters to strike. In April, as countries around the world implemented lockdown measures, Fourthline observed a 37% year-over-year increase in fraudulent account creation attempts, followed by a 42% increase in May—accounting for the top two months for fraud in 2020. Regulated institutions experienced what Javelin Strategy & Research identifies as a shift in the tactics of cybercriminals, who increasingly prioritized fraudulent account openings and takeovers over credit card fraud. Krista Tedder, Head of Fraud at Javelin, confirms: \"The full weight of identity fraud lies not only in counterfeit credit cards and magnetic stripes but in full account takeover and new account fraud.\" In order to address the rising focus on targeting new and existing accounts, regulated institutions must adopt modern protective practices that detect and deter fraudsters before they've found a way into the system. Fourthline saw counterfeit documentation emerge as the most popular form of identity fraud in 2020, which begs the question: what is the most effective way for regulated institutions to prevent against these attacks in an ever-changing landscape? Outsourcing Know Your Customer (KYC) processes to the right partner is potentially the safest approach to bolstering fraud prevention. With deeper data checks, smarter technology, and broader coverage of official documents, databases, fraudulent behavior patterns and the like, implementing advanced KYC technology is most efficient and effective way to protect against fraud. Learn how Fourthline's KYC offering can help you meet compliance requirements and protect your business in 2021. SHARE Want to ? Talk to our experts Get in touch with Robert-Jan van Vugt, who brings years of trading and financial industry expertise to his role as Global Head of Customer Success Contact Robert-Jan Up next 09.07.2020 Interview Chased by a lion: Insights on fraud, risk and KYC from N26s Ro Paddock 24.09.2020 Insight Fourthline featured in Finch Capital's 2020 Fintech Report 04.12.2020 News Europol prevents €30m+ in losses through annual money mule crackdown Explore all articles SHARE While businesses across industries faced unprecedented challenges in 2020, data shows that fraud rates reached all-time highs, with identity fraud attempts surging by 15% compared to 2019. Covid-19 has not only ravaged public health and the global economy, but has also opened new windows of opportunity for fraudsters to strike. In April, as countries around the world implemented lockdown measures, Fourthline observed a 37% year-over-year increase in fraudulent account creation attempts, followed by a 42% increase in May—accounting for the top two months for fraud in 2020. Regulated institutions experienced what Javelin Strategy & Research identifies as a shift in the tactics of cybercriminals, who increasingly prioritized fraudulent account openings and takeovers over credit card fraud. Krista Tedder, Head of Fraud at Javelin, confirms: \"The full weight of identity fraud lies not only in counterfeit credit cards and magnetic stripes but in full account takeover and new account fraud.\" In order to address the rising focus on targeting new and existing accounts, regulated institutions must adopt modern protective practices that detect and deter fraudsters before they've found a way into the system. Fourthline saw counterfeit documentation emerge as the most popular form of identity fraud in 2020, which begs the question: what is the most effective way for regulated institutions to prevent against these attacks in an ever-changing landscape? Outsourcing Know Your Customer (KYC) processes to the right partner is potentially the safest approach to bolstering fraud prevention. With deeper data checks, smarter technology, and broader coverage of official documents, databases, fraudulent behavior patterns and the like, implementing advanced KYC technology is most efficient and effective way to protect against fraud. Learn how Fourthline's KYC offering can help you meet compliance requirements and protect your business in 2021. SHARE While businesses across industries faced unprecedented challenges in 2020, data shows that fraud rates reached all-time highs, with identity fraud attempts surging by 15% compared to 2019. Covid-19 has not only ravaged public health and the global economy, but has also opened new windows of opportunity for fraudsters to strike. In April, as countries around the world implemented lockdown measures, Fourthline observed a 37% year-over-year increase in fraudulent account creation attempts, followed by a 42% increase in May—accounting for the top two months for fraud in 2020. Regulated institutions experienced what Javelin Strategy & Research identifies as a shift in the tactics of cybercriminals, who increasingly prioritized fraudulent account openings and takeovers over credit card fraud. Krista Tedder, Head of Fraud at Javelin, confirms: \"The full weight of identity fraud lies not only in counterfeit credit cards and magnetic stripes but in full account takeover and new account fraud.\" In order to address the rising focus on targeting new and existing accounts, regulated institutions must adopt modern protective practices that detect and deter fraudsters before they've found a way into the system. Fourthline saw counterfeit documentation emerge as the most popular form of identity fraud in 2020, which begs the question: what is the most effective way for regulated institutions to prevent against these attacks in an ever-changing landscape? Outsourcing Know Your Customer (KYC) processes to the right partner is potentially the safest approach to bolstering fraud prevention. With deeper data checks, smarter technology, and broader coverage of official documents, databases, fraudulent behavior patterns and the like, implementing advanced KYC technology is most efficient and effective way to protect against fraud. Learn how Fourthline's KYC offering can help you meet compliance requirements and protect your business in 2021. While businesses across industries faced unprecedented challenges in 2020, data shows that fraud rates reached all-time highs, with identity fraud attempts surging by 15% compared to 2019. Covid-19 has not only ravaged public health and the global economy, but has also opened new windows of opportunity for fraudsters to strike. In April, as countries around the world implemented lockdown measures, Fourthline observed a 37% year-over-year increase in fraudulent account creation attempts, followed by a 42% increase in May—accounting for the top two months for fraud in 2020. Regulated institutions experienced what Javelin Strategy & Research identifies as a shift in the tactics of cybercriminals, who increasingly prioritized fraudulent account openings and takeovers over credit card fraud. Krista Tedder, Head of Fraud at Javelin, confirms: \"The full weight of identity fraud lies not only in counterfeit credit cards and magnetic stripes but in full account takeover and new account fraud.\" In order to address the rising focus on targeting new and existing accounts, regulated institutions must adopt modern protective practices that detect and deter fraudsters before they've found a way into the system. Fourthline saw counterfeit documentation emerge as the most popular form of identity fraud in 2020, which begs the question: what is the most effective way for regulated institutions to prevent against these attacks in an ever-changing landscape? Outsourcing Know Your Customer (KYC) processes to the right partner is potentially the safest approach to bolstering fraud prevention. With deeper data checks, smarter technology, and broader coverage of official documents, databases, fraudulent behavior patterns and the like, implementing advanced KYC technology is most efficient and effective way to protect against fraud. Learn how Fourthline's KYC offering can help you meet compliance requirements and protect your business in 2021. Want to ? Talk to our experts Get in touch with Robert-Jan van Vugt, who brings years of trading and financial industry expertise to his role as Global Head of Customer Success Contact Robert-Jan Get in touch with Robert-Jan van Vugt, who brings years of trading and financial industry expertise to his role as Global Head of Customer Success Up next 09.07.2020 Interview Chased by a lion: Insights on fraud, risk and KYC from N26s Ro Paddock 24.09.2020 Insight Fourthline featured in Finch Capital's 2020 Fintech Report 04.12.2020 News Europol prevents €30m+ in losses through annual money mule crackdown Explore all articles",
    "Watchlist check We check global PEP watchlists, sanctions watchlists & adverse media articles across all entries in the database. Fraud check We check if the client appears in our own comprehensive & evidenced Fourthline Fraud Database. Sensitivity check We check your own custom list of clients you don't want to do business with. Four eyes review An additional review of potential & confirmed hits by a Fourthline agent. Risk score Our AI runs the data through our proprietary risk assessment & generates a score for every potential hit based on multiple data points. Conclusive outcome We share the outcome with a webhook via our API. We include the screening status & any hits in a detailed client due diligence (CDD) report. Watchlist check We check global PEP watchlists, sanctions watchlists & adverse media articles across all entries in the database. Fraud check We check if the client appears in our own comprehensive & evidenced Fourthline Fraud Database. Sensitivity check We check your own custom list of clients you don't want to do business with. Four eyes review An additional review of potential & confirmed hits by a Fourthline agent. Risk score Our AI runs the data through our proprietary risk assessment & generates a score for every potential hit based on multiple data points. Conclusive outcome We share the outcome with a webhook via our API. We include the screening status & any hits in a detailed client due diligence (CDD) report. We check global PEP watchlists, sanctions watchlists & adverse media articles across all entries in the database. We check if the client appears in our own comprehensive & evidenced Fourthline Fraud Database. We check your own custom list of clients you don't want to do business with. An additional review of potential & confirmed hits by a Fourthline agent. Our AI runs the data through our proprietary risk assessment & generates a score for every potential hit based on multiple data points. We share the outcome with a webhook via our API. We include the screening status & any hits in a detailed client due diligence (CDD) report.",
    "Make compliance a competitive advantage 99.98% Fraud detection accuracy 40% Higher conversion rates 50% More cost-efficient compliance A solution suite built for the best in finance and fintech Choose the solutions that meet your goals & regulatory obligations. Doc & Biometric Verification Onboard customers with a hyper-accurate verification flow that's built for conversion, with basic ID&V in seconds and bank-grade KYC in under a minute. Doc & Biometric Verification Proof of Address Confirm your customer's address in seconds, with highly accurate device and geolocation intelligence that eliminates the need for traditional PoA documents. Proof of Address Qualified Electronic Signature A secure electronic signature that can be issued standalone or alongside Fourthline's bank-grade KYC onboarding. Qualified electronic signature Account Authentication Ensure that account creators and account users are one and the same by monitoring device data and connecting users to their device in real-time, with results in <30 seconds. Account Authentication Screening & Monitoring Check your customers—once or daily—against real-time watchlists, PEP and sanction lists, country-specific databases, CIFAS, and Fourthline's proprietary fraud database. Screening & Monitoring Re-KYC & Remediation Automatically review, update and enhance customer data to accurately assess risk and consistently meet all regulatory standards. Re-KYC & Remediation Investigations & Reporting Increase operational efficiency by letting Fourthline take care of manual and resource-intensive investigations and CDD reporting. Act on conclusive reporting with no grey areas. Investigations & Reporting Anti-Financial Crime Tap into the highest possible fraud accuracy through augmented analytics and a team of dedicated anti-financial crime experts. Anti-Financial Crime \"Fourthline came out on top based on conversion rates, fraud detection accuracy, & UX.\" Alexander Emeshev | Co-founder - Vivid Money Read case study Compliance solutions for the whole lifecycle Onboarding flow The Fourthline KYC onboarding begins with a fully customizable onboarding flow that collects over 210 data points needed to confirm your customers' identities. Customers are guided through a fast and thorough data submission process built with UX top of mind to deliver industry-leading conversion rates without sacrificing fraud detection accuracy. Verification and analysis An automated and proprietary three-tier verification process is initiated. After determining whether an ID is genuine or fraudulent, we conduct biometric analysis to match the ID photo to the person who submitted it. We then run a set of 5AML- and GDPR-compliant checks to uncover anomalies and inconsistencies. Applying years of financial crime data to these checks delivers the most comprehensive set of information to substantiate whether you can—and want to—accept a customer. Investigations and conclusive results Fourthline designs customized decision-making and reporting protocols tailored to your risk appetite. Using proprietary machine learning algorithms combined with expert teams, we conduct in-depth investigations complete with a full audit trail. We always deliver conclusive results, so you're never stuck with grey areas. Continuous KYC Fourthline's KYC approach goes beyond initial customer sign-up and verification. Through continuous KYC solutions, Fourthline catches an additional 20 to 30% of fraud attempts. Fourthline continues the fight against fraud throughout the customer lifecycle with daily screening against PEP/sanctions lists and Fourthline's own proprietary fraud databases. You're in good company Regulated enterprises around the world trust Fourthline to authenticate customer identities and drive business growth. Want to ? Discover how we can help you increase business efficiency, improve fraud prevention, and boost conversions. Get in touch with our experts Make compliance a competitive advantage 99.98% Fraud detection accuracy 40% Higher conversion rates 50% More cost-efficient compliance Make compliance a competitive advantage A solution suite built for the best in finance and fintech Choose the solutions that meet your goals & regulatory obligations. Doc & Biometric Verification Onboard customers with a hyper-accurate verification flow that's built for conversion, with basic ID&V in seconds and bank-grade KYC in under a minute. Doc & Biometric Verification Proof of Address Confirm your customer's address in seconds, with highly accurate device and geolocation intelligence that eliminates the need for traditional PoA documents. Proof of Address Qualified Electronic Signature A secure electronic signature that can be issued standalone or alongside Fourthline's bank-grade KYC onboarding. Qualified electronic signature Account Authentication Ensure that account creators and account users are one and the same by monitoring device data and connecting users to their device in real-time, with results in <30 seconds. Account Authentication Screening & Monitoring Check your customers—once or daily—against real-time watchlists, PEP and sanction lists, country-specific databases, CIFAS, and Fourthline's proprietary fraud database. Screening & Monitoring Re-KYC & Remediation Automatically review, update and enhance customer data to accurately assess risk and consistently meet all regulatory standards. Re-KYC & Remediation Investigations & Reporting Increase operational efficiency by letting Fourthline take care of manual and resource-intensive investigations and CDD reporting. Act on conclusive reporting with no grey areas. Investigations & Reporting Anti-Financial Crime Tap into the highest possible fraud accuracy through augmented analytics and a team of dedicated anti-financial crime experts. Anti-Financial Crime A solution suite built for the best in finance and fintech Choose the solutions that meet your goals & regulatory obligations. Doc & Biometric Verification Onboard customers with a hyper-accurate verification flow that's built for conversion, with basic ID&V in seconds and bank-grade KYC in under a minute. Confirm your customer's address in seconds, with highly accurate device and geolocation intelligence that eliminates the need for traditional PoA documents. A secure electronic signature that can be issued standalone or alongside Fourthline's bank-grade KYC onboarding. Ensure that account creators and account users are one and the same by monitoring device data and connecting users to their device in real-time, with results in <30 seconds. Check your customers—once or daily—against real-time watchlists, PEP and sanction lists, country-specific databases, CIFAS, and Fourthline's proprietary fraud database. Automatically review, update and enhance customer data to accurately assess risk and consistently meet all regulatory standards. Increase operational efficiency by letting Fourthline take care of manual and resource-intensive investigations and CDD reporting. Act on conclusive reporting with no grey areas. Tap into the highest possible fraud accuracy through augmented analytics and a team of dedicated anti-financial crime experts. \"Fourthline came out on top based on conversion rates, fraud detection accuracy, & UX.\" Alexander Emeshev | Co-founder - Vivid Money Read case study \"Fourthline came out on top based on conversion rates, fraud detection accuracy, & UX.\" Compliance solutions for the whole lifecycle Onboarding flow The Fourthline KYC onboarding begins with a fully customizable onboarding flow that collects over 210 data points needed to confirm your customers' identities. Customers are guided through a fast and thorough data submission process built with UX top of mind to deliver industry-leading conversion rates without sacrificing fraud detection accuracy. Compliance solutions for the whole lifecycle The Fourthline KYC onboarding begins with a fully customizable onboarding flow that collects over 210 data points needed to confirm your customers' identities. Customers are guided through a fast and thorough data submission process built with UX top of mind to deliver industry-leading conversion rates without sacrificing fraud detection accuracy. Verification and analysis An automated and proprietary three-tier verification process is initiated. After determining whether an ID is genuine or fraudulent, we conduct biometric analysis to match the ID photo to the person who submitted it. We then run a set of 5AML- and GDPR-compliant checks to uncover anomalies and inconsistencies. Applying years of financial crime data to these checks delivers the most comprehensive set of information to substantiate whether you can—and want to—accept a customer. An automated and proprietary three-tier verification process is initiated. After determining whether an ID is genuine or fraudulent, we conduct biometric analysis to match the ID photo to the person who submitted it. We then run a set of 5AML- and GDPR-compliant checks to uncover anomalies and inconsistencies. Applying years of financial crime data to these checks delivers the most comprehensive set of information to substantiate whether you can—and want to—accept a customer. Investigations and conclusive results Fourthline designs customized decision-making and reporting protocols tailored to your risk appetite. Using proprietary machine learning algorithms combined with expert teams, we conduct in-depth investigations complete with a full audit trail. We always deliver conclusive results, so you're never stuck with grey areas. Fourthline designs customized decision-making and reporting protocols tailored to your risk appetite. Using proprietary machine learning algorithms combined with expert teams, we conduct in-depth investigations complete with a full audit trail. We always deliver conclusive results, so you're never stuck with grey areas. Continuous KYC Fourthline's KYC approach goes beyond initial customer sign-up and verification. Through continuous KYC solutions, Fourthline catches an additional 20 to 30% of fraud attempts. Fourthline continues the fight against fraud throughout the customer lifecycle with daily screening against PEP/sanctions lists and Fourthline's own proprietary fraud databases. Fourthline's KYC approach goes beyond initial customer sign-up and verification. Through continuous KYC solutions, Fourthline catches an additional 20 to 30% of fraud attempts. Fourthline continues the fight against fraud throughout the customer lifecycle with daily screening against PEP/sanctions lists and Fourthline's own proprietary fraud databases. You're in good company Regulated enterprises around the world trust Fourthline to authenticate customer identities and drive business growth. Want to ? Discover how we can help you increase business efficiency, improve fraud prevention, and boost conversions. Get in touch with our experts Want to ? Discover how we can help you increase business efficiency, improve fraud prevention, and boost conversions.",
    "SHARE Amsterdam, 30 March 2022 – The Dutch fintech company Fourthline, a specialist in top-level end-to-end Know Your Customer (KYC) solutions, announces a partnership with leading online broker LYNX. The KYC expert will provide identity verification for new customers during the onboarding process. The Dutch fintechs will collaborate in eight of the European markets in which LYNX is active. In doing so, Fourthline will not only help the Dutch online broker with fraud prevention, but also contribute to its international growth ambitions and further optimize the customer experience. With the addition of LYNX to its customer portfolio, Fourthline's growth is set to continue. The fintech from Amsterdam recently signed contracts with players such as Nationale Nederlanden, Wish and Vivid Money. The growing popularity of investing has resulted in a record number of investing households in the Netherlands: 1.96 million in 2021.* Financial transactions are also increasingly taking place online, which creates a greater than ever need for advanced technology to detect online fraud and money laundering attempts. Fourthline helps globally regulated financial institutions protect the financial sector by detecting fraud with a 99.98% accuracy rate. Its smart technology also walks the end user through the onboarding and ID verification process quickly and easily. All the more reason for LYNX to join forces with Fourthline. The Dutch online broker is already helping over 60,000 experienced investors throughout Europe to succeed on the stock market. The explosive growth of the online investment market in recent years means that it is more often the target of fraud attempts and money laundering. This also means that KYC checks are becoming increasingly important. Outsourcing this now allows LYNX to focus on scaling up faster and growing internationally. Along with ensuring online security, customer service remains a top priority. Fourthline has therefore added five new languages to its product portfolio especially for LYNX, so all its customers can go through the onboarding process in their own language. Ellen van Ginkel, Managing Director of LYNX: \"A growing number of active investors are choosing LYNX, and we are experiencing strong and satisfying customer growth as a company. We think it's important that investors experience our high standard of service from the very first time they contact us. Applying for an investment account should not only be safe, but also easy and efficient. The new partnership with Fourthline will help us achieve that goal.\" Krik Gunning, co-founder and CEO of Fourthline: \"As an online broker for experienced investors, LYNX knows better than anyone how important it is that both the customer experience and the quality of identity checks are top-notch. We are proud to work with LYNX and contribute to the international growth of this successful Dutch investment platform.\" *Source: Kantar, November 2021. SHARE Want to ? Talk to our experts Get in touch with Koen de Lange, who brings years of investment banking and econometrics expertise to his role as Regional Sales Director. Contact Koen Up next Explore all articles 03.02.2022 Update Fourthline: new look, same mission 10.03.2022 Press release NN Group secures its Identity Verification process with Fourthline 25.01.2022 Insight Year in review: Fourthline closes 2021 with 170% YoY growth SHARE Amsterdam, 30 March 2022 – The Dutch fintech company Fourthline, a specialist in top-level end-to-end Know Your Customer (KYC) solutions, announces a partnership with leading online broker LYNX. The KYC expert will provide identity verification for new customers during the onboarding process. The Dutch fintechs will collaborate in eight of the European markets in which LYNX is active. In doing so, Fourthline will not only help the Dutch online broker with fraud prevention, but also contribute to its international growth ambitions and further optimize the customer experience. With the addition of LYNX to its customer portfolio, Fourthline's growth is set to continue. The fintech from Amsterdam recently signed contracts with players such as Nationale Nederlanden, Wish and Vivid Money. The growing popularity of investing has resulted in a record number of investing households in the Netherlands: 1.96 million in 2021.* Financial transactions are also increasingly taking place online, which creates a greater than ever need for advanced technology to detect online fraud and money laundering attempts. Fourthline helps globally regulated financial institutions protect the financial sector by detecting fraud with a 99.98% accuracy rate. Its smart technology also walks the end user through the onboarding and ID verification process quickly and easily. All the more reason for LYNX to join forces with Fourthline. The Dutch online broker is already helping over 60,000 experienced investors throughout Europe to succeed on the stock market. The explosive growth of the online investment market in recent years means that it is more often the target of fraud attempts and money laundering. This also means that KYC checks are becoming increasingly important. Outsourcing this now allows LYNX to focus on scaling up faster and growing internationally. Along with ensuring online security, customer service remains a top priority. Fourthline has therefore added five new languages to its product portfolio especially for LYNX, so all its customers can go through the onboarding process in their own language. Ellen van Ginkel, Managing Director of LYNX: \"A growing number of active investors are choosing LYNX, and we are experiencing strong and satisfying customer growth as a company. We think it's important that investors experience our high standard of service from the very first time they contact us. Applying for an investment account should not only be safe, but also easy and efficient. The new partnership with Fourthline will help us achieve that goal.\" Krik Gunning, co-founder and CEO of Fourthline: \"As an online broker for experienced investors, LYNX knows better than anyone how important it is that both the customer experience and the quality of identity checks are top-notch. We are proud to work with LYNX and contribute to the international growth of this successful Dutch investment platform.\" *Source: Kantar, November 2021. SHARE Amsterdam, 30 March 2022 – The Dutch fintech company Fourthline, a specialist in top-level end-to-end Know Your Customer (KYC) solutions, announces a partnership with leading online broker LYNX. The KYC expert will provide identity verification for new customers during the onboarding process. The Dutch fintechs will collaborate in eight of the European markets in which LYNX is active. In doing so, Fourthline will not only help the Dutch online broker with fraud prevention, but also contribute to its international growth ambitions and further optimize the customer experience. With the addition of LYNX to its customer portfolio, Fourthline's growth is set to continue. The fintech from Amsterdam recently signed contracts with players such as Nationale Nederlanden, Wish and Vivid Money. The growing popularity of investing has resulted in a record number of investing households in the Netherlands: 1.96 million in 2021.* Financial transactions are also increasingly taking place online, which creates a greater than ever need for advanced technology to detect online fraud and money laundering attempts. Fourthline helps globally regulated financial institutions protect the financial sector by detecting fraud with a 99.98% accuracy rate. Its smart technology also walks the end user through the onboarding and ID verification process quickly and easily. All the more reason for LYNX to join forces with Fourthline. The Dutch online broker is already helping over 60,000 experienced investors throughout Europe to succeed on the stock market. The explosive growth of the online investment market in recent years means that it is more often the target of fraud attempts and money laundering. This also means that KYC checks are becoming increasingly important. Outsourcing this now allows LYNX to focus on scaling up faster and growing internationally. Along with ensuring online security, customer service remains a top priority. Fourthline has therefore added five new languages to its product portfolio especially for LYNX, so all its customers can go through the onboarding process in their own language. Ellen van Ginkel, Managing Director of LYNX: \"A growing number of active investors are choosing LYNX, and we are experiencing strong and satisfying customer growth as a company. We think it's important that investors experience our high standard of service from the very first time they contact us. Applying for an investment account should not only be safe, but also easy and efficient. The new partnership with Fourthline will help us achieve that goal.\" Krik Gunning, co-founder and CEO of Fourthline: \"As an online broker for experienced investors, LYNX knows better than anyone how important it is that both the customer experience and the quality of identity checks are top-notch. We are proud to work with LYNX and contribute to the international growth of this successful Dutch investment platform.\" *Source: Kantar, November 2021. Amsterdam, 30 March 2022 – The Dutch fintech company Fourthline, a specialist in top-level end-to-end Know Your Customer (KYC) solutions, announces a partnership with leading online broker LYNX. The KYC expert will provide identity verification for new customers during the onboarding process. The Dutch fintechs will collaborate in eight of the European markets in which LYNX is active. In doing so, Fourthline will not only help the Dutch online broker with fraud prevention, but also contribute to its international growth ambitions and further optimize the customer experience. With the addition of LYNX to its customer portfolio, Fourthline's growth is set to continue. The fintech from Amsterdam recently signed contracts with players such as Nationale Nederlanden, Wish and Vivid Money. The growing popularity of investing has resulted in a record number of investing households in the Netherlands: 1.96 million in 2021.* Financial transactions are also increasingly taking place online, which creates a greater than ever need for advanced technology to detect online fraud and money laundering attempts. Fourthline helps globally regulated financial institutions protect the financial sector by detecting fraud with a 99.98% accuracy rate. Its smart technology also walks the end user through the onboarding and ID verification process quickly and easily. All the more reason for LYNX to join forces with Fourthline. The Dutch online broker is already helping over 60,000 experienced investors throughout Europe to succeed on the stock market. The explosive growth of the online investment market in recent years means that it is more often the target of fraud attempts and money laundering. This also means that KYC checks are becoming increasingly important. Outsourcing this now allows LYNX to focus on scaling up faster and growing internationally. Along with ensuring online security, customer service remains a top priority. Fourthline has therefore added five new languages to its product portfolio especially for LYNX, so all its customers can go through the onboarding process in their own language. Ellen van Ginkel, Managing Director of LYNX: \"A growing number of active investors are choosing LYNX, and we are experiencing strong and satisfying customer growth as a company. We think it's important that investors experience our high standard of service from the very first time they contact us. Applying for an investment account should not only be safe, but also easy and efficient. The new partnership with Fourthline will help us achieve that goal.\" Krik Gunning, co-founder and CEO of Fourthline: \"As an online broker for experienced investors, LYNX knows better than anyone how important it is that both the customer experience and the quality of identity checks are top-notch. We are proud to work with LYNX and contribute to the international growth of this successful Dutch investment platform.\" *Source: Kantar, November 2021. Want to ? Talk to our experts Get in touch with Koen de Lange, who brings years of investment banking and econometrics expertise to his role as Regional Sales Director. Contact Koen Get in touch with Koen de Lange, who brings years of investment banking and econometrics expertise to his role as Regional Sales Director. Up next Explore all articles 03.02.2022 Update Fourthline: new look, same mission 10.03.2022 Press release NN Group secures its Identity Verification process with Fourthline 25.01.2022 Insight Year in review: Fourthline closes 2021 with 170% YoY growth"
  ]
}