{
  "company": "www.utstar.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 52,
    "-1": 14
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.1538461538461538,
    "framing_surveillance": 0.0,
    "framing_market": 0.8461538461538461,
    "num_docs": 66
  },
  "topic_timeline": {
    "20": {
      "-1": 14,
      "0": 52
    }
  },
  "sample_docs": [
    "Total Control 1000 3G version 4.0: Installation & Configuration 5 Days - Instructor Led In the Wireless Total Control 1000 3G version 4.x Installation & Configuration course, students practice how to Remove and Replace components, configure, and support the UTStarcom 3G version 4.x system used to provide 3G wireless users with simple IP and mobile IP data services. The course encompasses, service, installation, operations, administration and basic troubleshooting of the entire UTStarcom access system. Target Audience This course is intended for field and system engineers, network administrators, and other technical professionals responsible for installing, configuring and managing the Total Control 1000 Multiservice Access platform. Prerequisites Before attending this course, students should be familiar with LAN and WAN networking concepts, basic IP addressing, and carrier line facilities such as circuit switched networks. Some previous experience with 3Com and other related products is required. Key Topics CDMA 2000 3G version 4.x system overview UTStarcom CDMA 2000 3G system component installation Simple IP (SIP) Mobile IP (MIP) RP interface Packet Data Serving Node (PDSN) Home Agent (HA) Home Agent Control Node (HACN) Management software RADIUS Client functionality Foreign Agent Control Node (FACN) TCP/IP CDMA 2000 3G version 4.x system overview UTStarcom CDMA 2000 3G system component installation Packet Data Serving Node (PDSN) Home Agent Control Node (HACN) Foreign Agent Control Node (FACN) Upon completion of this course, students will be able to: Identify the purpose of the CDMA 2000 3G system Identify the proper placement of the CDMA 2000 3G system components in a network Associate the UTStarcom CDMA 2000 3G components with their functions within the system Perform a physical configuration and installation of the CDMA 2000 3G system UTStarcom Total Control1000 components Perform appropriate cabling of the UTStarcom CDMA 2000 3G system components and explain it's impact on network troubleshooting Identify and fix common installation problems Perform a software upgrade of the UTStarcom Total Control1000 components Perform the parameter configuration of the UTStarcom Total Control 1000 components Identify the packet communication processes used to support the RP interface, PPP, SIP and MIP and troubleshoot related problems Identify the improvement of network processes gained through implementation of a HACN Configure the PDSN and HA for Mobile Node IP address assignment Match an IP address assignment methodology with specific IP network design constraints Identify the purpose of the CDMA 2000 3G system Identify the proper placement of the CDMA 2000 3G system components in a network Associate the UTStarcom CDMA 2000 3G components with their functions within the system Perform a physical configuration and installation of the CDMA 2000 3G system UTStarcom Total Control1000 components Perform appropriate cabling of the UTStarcom CDMA 2000 3G system components and explain it's impact on network troubleshooting Identify and fix common installation problems Perform a software upgrade of the UTStarcom Total Control1000 components Perform the parameter configuration of the UTStarcom Total Control 1000 components Identify the packet communication processes used to support the RP interface, PPP, SIP and MIP and troubleshoot related problems Identify the improvement of network processes gained through implementation of a HACN Configure the PDSN and HA for Mobile Node IP address assignment Match an IP address assignment methodology with specific IP network design constraints Solutions | Professional Services | Training | Company | Support | Contact News | Careers | Investors | Glossary | Document Library | Events | Sitemap . Legal | Privacy",
    "UTSTARCOM TRAINING COURSES - EMEA Please contact your local office or representative for schedules and pricing. Title & Description (click on course titles for full description) Wireless Total Control 1000 3G: Installation & Configuration Instructor-Led Class Course Number: 3CS- TRPUB -3G1 View Schedule Please contact your local office or representative for schedules and pricing. Title & Description (click on course titles for full description) Wireless Total Control 1000 3G: Installation & Configuration Instructor-Led Class Course Number: 3CS- TRPUB -3G1 View Schedule Solutions | Professional Services | Training | Company | Support | Contact News | Careers | Investors | Glossary | Document Library | Events | Sitemap . Legal | Privacy",
    "HiPer TRAX Total Control 1000: Installation & Management Course Number: 3CS-TRPUB-TRAX Instructor-led class Course Length: 3 days Course Price: Contact representative Course Overview In the HiPer TRAX Total Control 1000 Installation & Management course, students Identify HiperTRAX system features, applications, components and compatible WAN Services. Target Audience This course is intended for field and system engineers, network administrators, and other technical professionals responsible for installing, configuring and managing the HiPerTRAX Total Control 1000 platforms. Prerequisites Before attending this course, students should be familiar with UNIX , IP and X.25. Key Topics HiPer TRAX/X.25 system features Compatible WAN Services NMC, HiPer DSP, HiPer TRAX/X.25 NAC and Dual V.35 Ethernet NIC card sets DIP switch and jumper settings HiPer TRAX/X.25 general parameters Transaction processing batched transaction processing and synchronous transaction processing. Incoming DNI and call routing based on DNI HiPer TRAX/X.25 system features NMC, HiPer DSP, HiPer TRAX/X.25 NAC and Dual V.35 Ethernet NIC card sets DIP switch and jumper settings HiPer TRAX/X.25 general parameters Transaction processing batched transaction processing and synchronous transaction processing. Incoming DNI and call routing based on DNI Course Objectives Upon completion of this course, students will be able to: Identify major HiPer ARC features and applications. Install HiPer ARC NAC and PCI Dual 10/100BASE-T Ethernet NIC. Use the HiPer ARC quick setup program. Configure HiPer ARC application specific parameters. Configure a Steel-Belted RADIUS server. Identify major HiPer ARC features and applications. Install HiPer ARC NAC and PCI Dual 10/100BASE-T Ethernet NIC. Use the HiPer ARC quick setup program. Configure HiPer ARC application specific parameters. Configure a Steel-Belted RADIUS server. Solutions | Professional Services | Training | Company | Support | Contact News | Careers | Investors | Glossary | Document Library | Events | Sitemap . Legal | Privacy",
    "Wireless Total Control 1000 IWF HDG 1.1 System Support Installation & Configuration Course Number: 3CS-TRDPUB-2G2 Instructor-led class Course Length: 3 days Course Overview In the Wireless Total Control 1000 IWF HDG 1.1 System Support course, students configure, manage, and support the Total Control 1000 Interworking Function (IWF) chassis equipped with high-density gateway (HDG 1.1) cards. Learn in detail how the IWF HDG chassis works with a Lucent or Nortel cellular switch to route calls from a mobile client device to land or other mobile destination over a circuit switched data (CSD) network, or over an IP packet switched network via a quick net connection (QNC). Practice installing hardware/software, and use chassis management tools to configure, monitor, and maintain operation. Target Audience This course is intended for managers, engineers and technicians who are responsible for installing, configuring, operating, and/or maintaining the IWF HDG 1.1 chassis. Prerequisites Before attending this course, students should be familiar with wireless terminology and concepts of cellular systems, IP packet networks and data protocols. Key Topics System/Chassis Description and Installation Total Control Manager (TCM) Navigation and Use Detailed Operation Chassis Configuration RADIUS Client functionality System/Chassis Description and Installation Total Control Manager (TCM) Navigation and Use Chassis Configuration RADIUS Client functionality Course Objectives Upon completion of this course, students will be able to: Identify major features, components and functions of CDMA system and IWF HDG 1.1 chassis. Install chassis hardware/software. Initially configure chassis components and verify functionality. Identify how the IWF chassis interacts with a Lucent and/or Nortel switch to route CSD and calls. Configure the IWF chassis to connect data/fax calls to a land-based computer or fax machine, and QNC SS (single stack) data calls directly to the Internet. Configure the IWF chassis to work with a local RADIUS security/accounting server, and a remote tunnel server to provide a secured QNC DS (double stack) connection to an Intranet/corporate LAN. Create a backup chassis image, restore chassis operation from a backup image or defaults, enable optional features, upgrade software/firmware, set traps/alarms and generate logs. -Interpret logs of good and failed calls. Identify major features, components and functions of CDMA system and IWF HDG 1.1 chassis. Install chassis hardware/software. Initially configure chassis components and verify functionality. Identify how the IWF chassis interacts with a Lucent and/or Nortel switch to route CSD and calls. Configure the IWF chassis to connect data/fax calls to a land-based computer or fax machine, and QNC SS (single stack) data calls directly to the Internet. Configure the IWF chassis to work with a local RADIUS security/accounting server, and a remote tunnel server to provide a secured QNC DS (double stack) connection to an Intranet/corporate LAN. Create a backup chassis image, restore chassis operation from a backup image or defaults, enable optional features, upgrade software/firmware, set traps/alarms and generate logs. -Interpret logs of good and failed calls. Solutions | Professional Services | Training | Company | Support | Contact News | Careers | Investors | Glossary | Document Library | Events | Sitemap . Legal | Privacy",
    "Total Control 1000 3G Installation and Configuration Course Number: 3CS-074 Instructor-led class Course Overview In the Wireless Total Control 1000 3G Installation & Configuration course, students practice how to Remove and Replace components, configure, and support the UTStarcom 3G system used to provide 3G wireless users with data services. The course encompasses the troubleshooting, service, installation, operations, and administration of the entire UTStarcom access system. Target Audience This course is intended for field and system engineers, network administrators, and other technical professionals responsible for installing, configuring and managing the Total Control 1000 Multiservice Access platform. Prerequisites Before attending this course, students should be familiarity with LAN and WAN networking concepts, IP addressing, and carrier line facilities such as T1/E1, PRI. Previous experience with 3Com and other related products is required CDMA 2000 3G system overview UTStarcom CDMA 2000 3G system component installation Packet Data Serving Node (PDSN) Home Agent Control Node (HACN) Course Objectives Upon completion of this course, students will be able to: Identify the purpose of the CDMA 2000 3G system. Identify the proper network placement of the CDMA 2000 3G system components. Associate the UTStarcom CDMA 2000 3G system components with their functions within the system. Perform a physical configuration and installation of the CDMA 2000 3G system UTStarcom TC1000 components. Perform appropriate cabling of the UTStarcom CDMA 2000 3G system components and it's impact on network troubleshooting. Identify and fix common installation problems. Perform a software upgrade of the UTStarcom TC1000 components. Perform the parameter configuration of the UTStarcom TC1000 components. Identify the packet communication processes used to support the RP interface, PPP, SIP and MIP and troubleshoot related problems. Identify the improvement of network processes gained through implementation of a HACN. Configure the PDSN and HA for Mobile Node IP address assignment. Match an IP address assignment methodology with specific IP network design constraints. Troubleshoot IP address assignment problems. Test proper component function. Identify the packet communication processes used to support RADIUS AAA functions. Solutions | Professional Services | Training | Company | Support | Contact News | Careers | Investors | Glossary | Document Library | Events | Sitemap . Legal | Privacy"
  ]
}