{
  "company": "www.technobravo.com",
  "dominant_topics": [
    1,
    4,
    6,
    3
  ],
  "topic_counts": {
    "1": 8,
    "4": 1,
    "6": 1,
    "3": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "4": "fingerprint, android, bluetooth, biometric fingerprint, reader",
    "6": "stripe, payments, think, really, payment",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.1142857142857142,
    "framing_surveillance": 0.6,
    "framing_market": 0.2857142857142857,
    "num_docs": 11
  },
  "topic_timeline": {
    "20": {
      "1": 8,
      "3": 1,
      "4": 1,
      "6": 1
    }
  },
  "sample_docs": [
    "DUAL FINGERPRINT SCANNER FUTRONIC FS50 The Futronic FS50 scanner is capable of capturing single, dual and roll finger images. The FS50 is compliant with the PIV/FIPS Image Quality specification for single fingerprint readers. Each device has a unique serial number ensuring every FS50 is traceable making it ideal for government identity management projects. The device uses advanced CMOS sensor technology and a precise optical system to meet the rigorous requirements for fingerprint image quality. The unit is ideal for border control, identity cards, drivers licences, and election applications. Available in OEM model. Please reload The Futronic FS50 scanner is capable of capturing single, dual and roll finger images. The FS50 is compliant with the PIV/FIPS Image Quality specification for single fingerprint readers. Each device has a unique serial number ensuring every FS50 is traceable making it ideal for government identity management projects. The device uses advanced CMOS sensor technology and a precise optical system to meet the rigorous requirements for fingerprint image quality. The unit is ideal for border control, identity cards, drivers licences, and election applications. Available in OEM model.",
    "CARDS & CARD READERS ACS ACR31 ACR31 Swipe Card Reader combines card reader functionality and mobility, enabling you to access secure applications anytime, anywhere. Compact and stylish, this card reader supports demanding applications that use magnetic stripe cards. It provides the perfect balance between reliable functionality and design aesthetics to meet your security needs. ACR31 Swipe is a reliable Mobile Card Reader that uses AES-128 encryption algorithm and DUKPT Key Management System for secure transactions, which makes it ideal for a broad range of solutions, such as e-Banking and e-Payment. The ultra-compact ACR31 Swipe is specifically designed to be brought and used anytime, anywhere. A CR2016 battery (to stabilize the power supply) and a standard 3.5mm audio jack interface further allow the ACR31 Swipe to be integrated seamlessly into any smartphone or tablet in the market. Built with a modern design, ACR31 Swipe is a portable and lightweight swipe card reader that is perfect for transacting securely while on the go. ACS ACR32 ACR32 MobileMate Card Reader is the ideal tool that you can use with your mobile device. Combining two card technologies into one, it provides its user the flexibility to use magnetic stripe cards and smart cards without the additional cost. Additionally, ACR32 MobileMate uses a rechargeable Lithium-ion battery as its power supply and a standard 3.5mm audio jack interface, thus allowing it to be integrated impeccably into any mobile device in the market. ACR32 MobileMate is a reliable mobile card reader that uses AES-128 encryption algorithm and DUKPT Key Management System for secure transactions. It seamlessly unites card reader functionality with mobility, which allows you to access secure applications anytime, anywhere ACS ACR35 ACR35 NFC MobileMate Card Reader is the perfect tool that you can use with your mobile device. Combining two card technologies into one, it provides its user the flexibility to use magnetic stripe cards and smart cards without the additional cost. With a rechargeable Lithium-ion battery and standard 3.5 mm audio jack interface, the ACR35 NFC MobileMate can seamlessly extend the usefulness of any mobile device. It delivers NFC reader functionality and mobility, which allows you to use NFC and contactless applications, even for mobile readers without built-in NFC functionality. ACR35 NFC MobileMate uses AES-128 encryption algorithm and DUKPT Key Management system to secure your data. Portable. Modern. Versatile. Compact. ACR35 NFC MobileaMate Card Reader is a handy and lightweight card reader that is perfect for users who wish to transact securely while on the go ACS ACR38 The ACR38 Smart Card Reader Series combines sophisticated technology and modern design (various options) to meet stringent requirements in smart card-based applications, such as payment systems and electronic identification, where a high level of security has increasingly been deemed essential. Now compliant with the CCID specification, the ACR38 Smart Card Reader offers a plug-and-play solution that eliminates the need for driver installation and driver-system compatibility assessment. Its USB interface facilitates communication between a computer and a smart card very easily, allowing for a seamless implementation of smart-card based applications in a PC environment. The ACR38 is compliant with ISO-7816 and EMV Level 1 specifications. It supports ISO-7816 Class A, B and C (5V, 3V and 1.8V) cards, including all microprocessor cards with T=0, T=1, protocols, as well as most of the popular memory cards in the market. Optional SAM slot. ACS ACR38T SIM CARD READER The ACR38T Plug-in (SIM-Sized) Card Reader is a stylish plug-in (SIM-sized) smart card reader/writer. Albeit its size, it contains full functionalities of the standard-sized ACR38 Smart Card Reader, and supports smart cards compliant to the GSM 11.11 specification. It is an extremely light and compact full speed USB device, with a weight of only 10 grams, and has a release button for plug-in smart cards. Now compliant with the CCID specification, ACR38T offers a plug-and-play solution that eliminates the need for driver installation. ACR39U The ACR39U Smart Card Reader ushers in new and modern technology to the world of smart card readers. This compact smart card reader brings together sophisticated technology and modern design to meet the rigorous requirements of smart card–based applications. It also features a USB Full Speed interface and a smart card read/write speed of up to 600 Kbps. Highly durable, the ACR39U can last for 100,000 card insertion cycles. It also has various certifications, such as EMV 2000 Level 1 and PBOC, making it the ideal smart card reader for e-Banking and e-Payment application needs. It is fully compliant with PC/SC and CCID specifications, and supports various operating systems such as Windows, Linux and Mac. Additionally, ACR39U may be used on mobile devices running on the Androidâ\"¢ platform versions 3.1 and above. With its sleek, stylish design and powerful core, the ACR39U is the ideal peripheral for your smart card applications. ACS ACR1281U-C2 ACR1281U-C2 Card UID Reader is a contactless card reader that automatically and efficiently gets the Unique Identifier number (UID) of any ISO 14443 Parts 1-4 Type A and B-compliant contactless card. When presented with a contactless card (such as a MIFARE card), the ACR1281U-C2 retrieves the card's UID and automatically returns it to the PC. The reader enables output of the UID directly to any editor, e.g. Notepad, MS Excel, MS Word, etc. With the UID, cardholders can be identified correctly in different applications, such as identity verification, time & attendance, and access control. ACR1281U-C2 also has an anti-collision feature that ensures only one card is accessed when multiple cards are presented simultaneously. Because ACR1281U-C2 Card UID Reader is compliant with the Human Interface Device (HID) standard, it reduces driver installation issues during integration into PC environments. It can support most operating systems, including Microsoft® Windows, Linux and other embedded systems ACS ACR38DT DUALKEY SMART CARD READERS - DUAL INTERFACE The ACR38DT DualKey Smart Card Reader offers solutions for both logical and physical access controls based on the SIM-sized combi smart card technology that combines the functionalities of contact and contactless cards. ACR38DT Contactless/Contact DualKey is an extension of the ACR38T SIMTracker II. It has full ACR38T functionalities with contactless features as added value. Serves as either a SIM size card reader or contactless card. ACS ACR1281U- C1 ACR1281U-C1 DualBoost II is the second generation of ACS's ACR128 DualBoost Reader. It is a dual interface reader that can access any contact and contactless smart cards following the ISO 7816 and ISO 14443 standards. ACR1281U-C1 DualBoost II enables one to integrate conventionally separate and independent applications for contact and contactless technologies into one device and one card. It can be used for online transactions to settle payments securely using credit cards, and it can also be used for topping up contactless cards in automated fare collection systems. It provides the perfect complement to the all-in-one card concept that combines many kinds of smart card applications in just a single card. The DualBoost Series has PC/SC compliance for both contact and contactless interfaces. It makes use of high-speed communication for contactless cards at a maximum of 848 kbps, which makes it suitable for highly demanding applications. It also provides intelligent support for hybrid and combi cards, such that it detects a contactless card even that has been incorrectly placed in the contact card slot. Lastly, the DualBoost has a built-in SAM slot for added security in both contact and contactless applications. With additional features such as USB firmware upgradability, contact memory card support and extended APDU support, ACR1281U-C1 DualBoost II is a highly cost-effective, powerful all-in-one device that offers convenience and flexibility to many smart card applications. USB or serial. ACS SMART CARDS TechnoBravo offers a range of cards including Java, Mifare, Contact and Contacless and ACS ACOS cards. SOFTWARE TechnoBravo offers the full range of ACS software and SDK solutions to assist with all card based applications. Please reload CARDS & CARD READERS ACR31 Swipe Card Reader combines card reader functionality and mobility, enabling you to access secure applications anytime, anywhere. Compact and stylish, this card reader supports demanding applications that use magnetic stripe cards. It provides the perfect balance between reliable functionality and design aesthetics to meet your security needs. ACR31 Swipe is a reliable Mobile Card Reader that uses AES-128 encryption algorithm and DUKPT Key Management System for secure transactions, which makes it ideal for a broad range of solutions, such as e-Banking and e-Payment. The ultra-compact ACR31 Swipe is specifically designed to be brought and used anytime, anywhere. A CR2016 battery (to stabilize the power supply) and a standard 3.5mm audio jack interface further allow the ACR31 Swipe to be integrated seamlessly into any smartphone or tablet in the market. Built with a modern design, ACR31 Swipe is a portable and lightweight swipe card reader that is perfect for transacting securely while on the go. ACR32 MobileMate Card Reader is the ideal tool that you can use with your mobile device. Combining two card technologies into one, it provides its user the flexibility to use magnetic stripe cards and smart cards without the additional cost. Additionally, ACR32 MobileMate uses a rechargeable Lithium-ion battery as its power supply and a standard 3.5mm audio jack interface, thus allowing it to be integrated impeccably into any mobile device in the market. ACR32 MobileMate is a reliable mobile card reader that uses AES-128 encryption algorithm and DUKPT Key Management System for secure transactions. It seamlessly unites card reader functionality with mobility, which allows you to access secure applications anytime, anywhere ACR35 NFC MobileMate Card Reader is the perfect tool that you can use with your mobile device. Combining two card technologies into one, it provides its user the flexibility to use magnetic stripe cards and smart cards without the additional cost. With a rechargeable Lithium-ion battery and standard 3.5 mm audio jack interface, the ACR35 NFC MobileMate can seamlessly extend the usefulness of any mobile device. It delivers NFC reader functionality and mobility, which allows you to use NFC and contactless applications, even for mobile readers without built-in NFC functionality. ACR35 NFC MobileMate uses AES-128 encryption algorithm and DUKPT Key Management system to secure your data. Portable. Modern. Versatile. Compact. ACR35 NFC MobileaMate Card Reader is a handy and lightweight card reader that is perfect for users who wish to transact securely while on the go The ACR38 Smart Card Reader Series combines sophisticated technology and modern design (various options) to meet stringent requirements in smart card-based applications, such as payment systems and electronic identification, where a high level of security has increasingly been deemed essential. Now compliant with the CCID specification, the ACR38 Smart Card Reader offers a plug-and-play solution that eliminates the need for driver installation and driver-system compatibility assessment. Its USB interface facilitates communication between a computer and a smart card very easily, allowing for a seamless implementation of smart-card based applications in a PC environment. The ACR38 is compliant with ISO-7816 and EMV Level 1 specifications. It supports ISO-7816 Class A, B and C (5V, 3V and 1.8V) cards, including all microprocessor cards with T=0, T=1, protocols, as well as most of the popular memory cards in the market. Optional SAM slot. ACS ACR38T SIM CARD READER The ACR38T Plug-in (SIM-Sized) Card Reader is a stylish plug-in (SIM-sized) smart card reader/writer. Albeit its size, it contains full functionalities of the standard-sized ACR38 Smart Card Reader, and supports smart cards compliant to the GSM 11.11 specification. It is an extremely light and compact full speed USB device, with a weight of only 10 grams, and has a release button for plug-in smart cards. Now compliant with the CCID specification, ACR38T offers a plug-and-play solution that eliminates the need for driver installation. The ACR39U Smart Card Reader ushers in new and modern technology to the world of smart card readers. This compact smart card reader brings together sophisticated technology and modern design to meet the rigorous requirements of smart card–based applications. It also features a USB Full Speed interface and a smart card read/write speed of up to 600 Kbps. Highly durable, the ACR39U can last for 100,000 card insertion cycles. It also has various certifications, such as EMV 2000 Level 1 and PBOC, making it the ideal smart card reader for e-Banking and e-Payment application needs. It is fully compliant with PC/SC and CCID specifications, and supports various operating systems such as Windows, Linux and Mac. Additionally, ACR39U may be used on mobile devices running on the Androidâ\"¢ platform versions 3.1 and above. With its sleek, stylish design and powerful core, the ACR39U is the ideal peripheral for your smart card applications. ACR1281U-C2 Card UID Reader is a contactless card reader that automatically and efficiently gets the Unique Identifier number (UID) of any ISO 14443 Parts 1-4 Type A and B-compliant contactless card. When presented with a contactless card (such as a MIFARE card), the ACR1281U-C2 retrieves the card's UID and automatically returns it to the PC. The reader enables output of the UID directly to any editor, e.g. Notepad, MS Excel, MS Word, etc. With the UID, cardholders can be identified correctly in different applications, such as identity verification, time & attendance, and access control. ACR1281U-C2 also has an anti-collision feature that ensures only one card is accessed when multiple cards are presented simultaneously. Because ACR1281U-C2 Card UID Reader is compliant with the Human Interface Device (HID) standard, it reduces driver installation issues during integration into PC environments. It can support most operating systems, including Microsoft® Windows, Linux and other embedded systems ACS ACR38DT DUALKEY SMART CARD READERS - DUAL INTERFACE The ACR38DT DualKey Smart Card Reader offers solutions for both logical and physical access controls based on the SIM-sized combi smart card technology that combines the functionalities of contact and contactless cards. ACR38DT Contactless/Contact DualKey is an extension of the ACR38T SIMTracker II. It has full ACR38T functionalities with contactless features as added value. Serves as either a SIM size card reader or contactless card. ACR1281U-C1 DualBoost II is the second generation of ACS's ACR128 DualBoost Reader. It is a dual interface reader that can access any contact and contactless smart cards following the ISO 7816 and ISO 14443 standards. ACR1281U-C1 DualBoost II enables one to integrate conventionally separate and independent applications for contact and contactless technologies into one device and one card. It can be used for online transactions to settle payments securely using credit cards, and it can also be used for topping up contactless cards in automated fare collection systems. It provides the perfect complement to the all-in-one card concept that combines many kinds of smart card applications in just a single card. The DualBoost Series has PC/SC compliance for both contact and contactless interfaces. It makes use of high-speed communication for contactless cards at a maximum of 848 kbps, which makes it suitable for highly demanding applications. It also provides intelligent support for hybrid and combi cards, such that it detects a contactless card even that has been incorrectly placed in the contact card slot. Lastly, the DualBoost has a built-in SAM slot for added security in both contact and contactless applications. With additional features such as USB firmware upgradability, contact memory card support and extended APDU support, ACR1281U-C1 DualBoost II is a highly cost-effective, powerful all-in-one device that offers convenience and flexibility to many smart card applications. USB or serial. TechnoBravo offers a range of cards including Java, Mifare, Contact and Contacless and ACS ACOS cards. TechnoBravo offers the full range of ACS software and SDK solutions to assist with all card based applications.",
    "Introducing BioSan Novel UVC Biometric Sanitizer Model B442G Kills up to 99.9% of harmful viruses and bacteria Enables the safe use of fingerprint devices Designed to fit most 4-4-2 fingerprint devices TM Patent Pending No: 29/758 401 IDENTITY MANAGEMENT SECURING PROTECTING VALIDATING SERVICES With over 25 years of experience in Biometric Identification, TechnoBravo is able to offer biometric solutions that enable your business security requirements. TechnoBravo specialises in the following Biometric fields: AFIS Automated Fingerprint Identification System ID Card Systems Mobile Identification PC Finger Logon Smart Border Control ​ More Info PRODUCTS TechnoBravo offers biometric and identity management products, all sourced from leading manufacturers and distributors. Fingerprint readers Scanning solutions Document authentication readers Citizen Documents Cards and Card readers Access Control Devices Election Systems Custom Developed Software & Integration More Info PARTNERS We work with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields. More Info ABOUT US STRATEGIC INTENT TechnoBravo seeks to add value to our clients' business by providing secure innovative identity management solutions utilizing the latest technology. ​ OVERVIEW What we do is simple – it's the technology that is advanced! TechnoBravo specializes in the identity management business, physical and logical. PHYSICAL IDENTITY MANAGEMENT Physical Identity Management relies on the authentication and verification of physical characteristics, be it a fingerprint, facial recognition, or an identity document to allow a person access to a restricted area or to cross borders. LOGICAL IDENTITY MANAGEMENT Logical identity Management takes physical security a step further by securing the infrastructure and networks of organizations through the use of smart cards or biometrics linked to a physical attribute of the employee or citizen. We partner with \"Best of Breed\" solutions providers and we bring the latest advances in identity management to the USA. We also develop solutions for the local market, combining global technology with contextual experience. Our extensive product range includes desktop fingerprint readers, the revolutionary Multi-spectral imaging technology, biometric access control devices, and secure identity documents. Our solutions include electronic voter registration, eVoting, electronic signature pads and identity document readers. ​ ​ Read More CONTACT US TechnoBravo Timberline Ln Oakland New Jersey 07436 ​ ​ Email: info@technobravo.com Introducing BioSan Novel UVC Biometric Sanitizer Model B442G Kills up to 99.9% of harmful viruses and bacteria Enables the safe use of fingerprint devices Designed to fit most 4-4-2 fingerprint devices TM Patent Pending No: 29/758 401 Novel UVC Biometric Sanitizer Model B442G Kills up to 99.9% of harmful viruses and bacteria Kills up to 99.9% of harmful viruses and bacteria Enables the safe use of fingerprint devices Enables the safe use of fingerprint devices Designed to fit most 4-4-2 fingerprint devices Designed to fit most 4-4-2 fingerprint devices IDENTITY MANAGEMENT SECURING PROTECTING VALIDATING SERVICES With over 25 years of experience in Biometric Identification, TechnoBravo is able to offer biometric solutions that enable your business security requirements. TechnoBravo specialises in the following Biometric fields: AFIS Automated Fingerprint Identification System ID Card Systems Mobile Identification PC Finger Logon Smart Border Control ​ More Info PRODUCTS TechnoBravo offers biometric and identity management products, all sourced from leading manufacturers and distributors. Fingerprint readers Scanning solutions Document authentication readers Citizen Documents Cards and Card readers Access Control Devices Election Systems Custom Developed Software & Integration More Info PARTNERS We work with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields. More Info SERVICES With over 25 years of experience in Biometric Identification, TechnoBravo is able to offer biometric solutions that enable your business security requirements. TechnoBravo specialises in the following Biometric fields: AFIS Automated Fingerprint Identification System ID Card Systems Mobile Identification PC Finger Logon Smart Border Control ​ More Info PRODUCTS TechnoBravo offers biometric and identity management products, all sourced from leading manufacturers and distributors. Fingerprint readers Scanning solutions Document authentication readers Citizen Documents Cards and Card readers Access Control Devices Election Systems Custom Developed Software & Integration More Info PARTNERS We work with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields. More Info With over 25 years of experience in Biometric Identification, TechnoBravo is able to offer biometric solutions that enable your business security requirements. TechnoBravo specialises in the following Biometric fields: AFIS Automated Fingerprint Identification System AFIS Automated Fingerprint Identification System TechnoBravo offers biometric and identity management products, all sourced from leading manufacturers and distributors. Cards and Card readers Cards and Card readers Custom Developed Software & Integration Custom Developed Software & Integration We work with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields. ABOUT US STRATEGIC INTENT TechnoBravo seeks to add value to our clients' business by providing secure innovative identity management solutions utilizing the latest technology. ​ OVERVIEW What we do is simple – it's the technology that is advanced! TechnoBravo specializes in the identity management business, physical and logical. PHYSICAL IDENTITY MANAGEMENT Physical Identity Management relies on the authentication and verification of physical characteristics, be it a fingerprint, facial recognition, or an identity document to allow a person access to a restricted area or to cross borders. LOGICAL IDENTITY MANAGEMENT Logical identity Management takes physical security a step further by securing the infrastructure and networks of organizations through the use of smart cards or biometrics linked to a physical attribute of the employee or citizen. We partner with \"Best of Breed\" solutions providers and we bring the latest advances in identity management to the USA. We also develop solutions for the local market, combining global technology with contextual experience. Our extensive product range includes desktop fingerprint readers, the revolutionary Multi-spectral imaging technology, biometric access control devices, and secure identity documents. Our solutions include electronic voter registration, eVoting, electronic signature pads and identity document readers. ​ ​ Read More TechnoBravo seeks to add value to our clients' business by providing secure innovative identity management solutions utilizing the latest technology. What we do is simple – it's the technology that is advanced! TechnoBravo specializes in the identity management business, physical and logical. Physical Identity Management relies on the authentication and verification of physical characteristics, be it a fingerprint, facial recognition, or an identity document to allow a person access to a restricted area or to cross borders. Logical identity Management takes physical security a step further by securing the infrastructure and networks of organizations through the use of smart cards or biometrics linked to a physical attribute of the employee or citizen. We partner with \"Best of Breed\" solutions providers and we bring the latest advances in identity management to the USA. We also develop solutions for the local market, combining global technology with contextual experience. Our extensive product range includes desktop fingerprint readers, the revolutionary Multi-spectral imaging technology, biometric access control devices, and secure identity documents. Our solutions include electronic voter registration, eVoting, electronic signature pads and identity document readers. CONTACT US TechnoBravo Timberline Ln Oakland New Jersey 07436 ​ ​ Email: info@technobravo.com",
    "PARTNERS TechnoBravo works with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields. TechnoBravo works with Best of Breed Partners in the Identity Management field and in many cases we are product agnostic allowing us to select the best product for the required application. Our partners are all leaders in their respective fields.",
    "ABOUT STRATEGIC INTENT TechnoBravo seeks to add value to our clients' business by providing secure innovative identity management solutions utilising the latest technology. ​ OVERVIEW ​ What we do is simple – it's the technology that is advanced! TechnoBravo specialises in the identity management business, physical and logical. Physical identity management relies on the authentication and verification of physical characteristics, be it a fingerprint, facial recognition, or an identity document to allow a person access to a restricted area or to cross borders. Logical identity management takes physical security a step further by securing the infrastructure and networks of organisations through the use of smart cards or biometrics linked to a physical attribute of the employee or citizen. We partner with Best of Breed solutions providers internationally to bring the latest advances in identity management to our clients. We also develop solutions for the local market, combining global technology with contextual experience. Our extensive product range includes desktop fingerprint readers, the revolutionary Multispectral imaging technology, biometric access control devices, and secure identity documents. Our solutions include electronic voter registration, eVoting, electronic signature pads and identity document readers. TechnoBravo seeks to add value to our clients' business by providing secure innovative identity management solutions utilising the latest technology. What we do is simple – it's the technology that is advanced! TechnoBravo specialises in the identity management business, physical and logical. Physical identity management relies on the authentication and verification of physical characteristics, be it a fingerprint, facial recognition, or an identity document to allow a person access to a restricted area or to cross borders. Logical identity management takes physical security a step further by securing the infrastructure and networks of organisations through the use of smart cards or biometrics linked to a physical attribute of the employee or citizen. We partner with Best of Breed solutions providers internationally to bring the latest advances in identity management to our clients. We also develop solutions for the local market, combining global technology with contextual experience. Our extensive product range includes desktop fingerprint readers, the revolutionary Multispectral imaging technology, biometric access control devices, and secure identity documents. Our solutions include electronic voter registration, eVoting, electronic signature pads and identity document readers."
  ]
}