{
  "company": "www.crucialtrak.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 39,
    "-1": 27
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 27,
      "0": 39
    }
  },
  "sample_docs": [
    "BACS™ Duo-S 100% Touchless 2-in-1 Biometric Reader with Compact and Economic Solution · Simultaneous 2-factor authentication process · 100% touchless bio-authentication · Fast and seamless verification quality · Intuitive and user friendly UX · Internal RFID Reader (Optional) Features Application Specifications Download FAQ Key Features · 2 Biometric Authentication Supports: Face, Palm Vein (RFID optional) · Clear Image Scoring Algorithm · Smart LCD Leader Status Indicator · Tamper Protection Alarm Key Technologies · AES 256 Data Encryption · 4GB Memory Option · Ethernet, Wiegand out(26,34,35), USB3.0 Communication · 100,000 Events Log Capacity · RFID Card Operation Optional · Sound and Visual Verification Support · Built-in Web Server Remote Control · Wall & Speedgate Mounting Biometric Technologies Face CrucialTrak's unique facial recognition technology presents the fastest, most advanced and convenient experience for every users. Facial Images are captured in most accurate 3D patterns from widest angles of access paths. - Automated face tracking module captures face with wide range of heights (heights range from 120cm to 220cm/3'11\" to 7'2\") - Precisely captures only targeted image (Automatically eliminates other background face images) - Real-time facial identification under 0.001 second - Low light level counter-light support Palm Vein CrucialTrak's Full Touchless palm vein recognition, simultaneously interlocked with fingerprint recognition, provides the fastest learning, most accurate, and highly comfortable identification experience, with the design built by Bio-Mechanism UX analysis. - Advanced matching algorithms ensure high level of accuracy - Contactless user interface eliminates hygiene concerns - Less than 0.00001% false acceptance rate Application ∙ Ideal for the transition from conventional card systems to biometrics ∙ High Level of Security with Small & Medium Size Offices Commercial Buildings Educational Institutions Soho Offices Key Specification Model Name BACS™ Duo-S CPU 2 GHz Octa Core ARM CPU Memory / Storage 2 GB / 8 GB Built in Display 2.23\" OLED display Color Metal Black or Dark Gray Operation Mode Face, Palm Vein, Optional built-in RFID (single or multi-mode) Biometric Recognitions Face Palm Vein Recognition Distance Up to 1 m / Up to 3.3 ft 35 – 76 mm / 1.4 – 3 in FAR / FRR of Algorithm 0.001 / 0.1 0.00001/0.01 Image Log Capacity 500 500 Encryption AES 256 Safety UL60950-1, EN60950-1 Built-in RFID reader 13.56 MHz, ISO 14443 A/B, ISO 15693, NFC Speak out Sound effect Dimensions (W x D x H) 140 mm x 65 mm x 150 mm / 5.5 in x 2.5 in x 5.9 in Weight 0.5 kg / 1.1 lb Communications Gigabit Ethernet, RS-485, Wiegand in/out, Relay Event Log Capacity 100,000 Proximity Sensor Built-in Remote Control Built-in web server Tamper Protection SPIP (Smart Personal Information Protection) feature (optional) Power 12 V DC / 3 A Face Image Enhancement WDR (Wide Dynamic Range) function Languages English (customizing available) Operating Temperature -10 – 60 °C / -14 – 140 °F Operating Humidity Max 80 % (RH) Storage Temperature -20 – 70 °C / -14 – 158 °F Certifications CE, NRTL, TUV, FCC, KC Housing Materials Flame retardant ABS, Polycarbonate, Polypropylene Management SW CruAMS (CrucialTrak Access Management System) Connections 2p power connector, 16p connector, Ethernet connector, USB 2.0 connector (debug) Mounting Default wall mounting bracket Available Models • BDS-A001: All biometric reader • BDS-R001: Biometric with RFID card reader Download CrucialTrak BACS™ Brochure File size: 2,835KB | PDF Duo S Data Sheet File size: 289KB | PDF BACS™ Products BACS™ Quattro Access Solution BACS™ Duo Access Solution BACS™ Duo-S Access Solution BACS™ Solo Palm Access Solution BACS™ Fleet Glance Automotive Solution BACS™ Tube Industry Solution Enrollstation e4 Access Solution 100% Touchless 2-in-1 Biometric Reader with Compact and Economic Solution · Simultaneous 2-factor authentication process · 100% touchless bio-authentication · Fast and seamless verification quality · Intuitive and user friendly UX · Internal RFID Reader (Optional) · 2 Biometric Authentication Supports: Face, Palm Vein (RFID optional) · Clear Image Scoring Algorithm · Smart LCD Leader Status Indicator · Tamper Protection Alarm · AES 256 Data Encryption · 4GB Memory Option · Ethernet, Wiegand out(26,34,35), USB3.0 Communication · 100,000 Events Log Capacity · RFID Card Operation Optional · Sound and Visual Verification Support · Built-in Web Server Remote Control · Wall & Speedgate Mounting - Automated face tracking module captures face with wide range of heights (heights range from 120cm to 220cm/3'11\" to 7'2\") - Precisely captures only targeted image (Automatically eliminates other background face images) - Real-time facial identification under 0.001 second - Low light level counter-light support - Advanced matching algorithms ensure high level of accuracy - Contactless user interface eliminates hygiene concerns - Less than 0.00001% false acceptance rate ∙ Ideal for the transition from conventional card systems to biometrics ∙ High Level of Security with Small & Medium Size Offices • BDS-A001: All biometric reader • BDS-R001: Biometric with RFID card reader File size: 2,835KB | PDF Duo S Data Sheet File size: 289KB | PDF",
    "Building environment, automotive industry, industrial environment or any other environment – we've got it covered with a 100% touchless solution Unlike the use of other forms of authentication such as passwords or tokens, biometric recognition provides a distinct association between an individual and a claimed identity. CrucialTrak utilizes multi-biometrics in most of its products, taking advantage of the capabilities of each biometric technology while overcoming the limitations of a single technology. Browse by Industry Access Solutions BACS ™ access control solution increases building security while providing flexible employee and visitor access management. The 100% touchless access control solution helps you avoid hygiene issues that can occur when there are large numbers of users. Our access solutions cover biometric readers, speed gates, smart doors, enroll stations, and visitor management software. BACS™ Quattro BACS™ Duo BACS™ Duo-S BACS™ Solo Palm BACS™ Suite SpeedTrak™ RoboArm SpeedTrak™ Slim Swing Enrollstation e4 Industrial Automation Solutions BACS ™ Tube is an innovative industrial solution to protect assets using biometric facial and iris recognition. It reduces time and effort required in the existing card or password logon process while maintaining quality control through an efficient access control process. BACS™ Tube Automotive Solutions BACS ™ automotive solutions offer technologies for vehicle access as well as easy monitoring of employed drivers. BACS™ Fleet Glance allows a reliable driver recognition using biometric information so that companies can easily monitor the time, attendance and location of employed drivers. The dual biometric BACS™ Fleet Grip also enables easy keyless access to a vehicle for authorized drivers. Fleet Glance Fleet Grip Consumer Commodities Our newest product in the line-up is Temon, a non-contact thermometer accessory for smartphones. Temon offers a convenient solution for checking temperatures quickly anywhere, anytime and tracking your measurements conveniently with a smartphone app. Temon Smart Thermometer Download CrucialTrak BACS™ Brochure File size: 2,835KB | PDF Building environment, automotive industry, industrial environment or any other environment – we've got it covered with a 100% touchless solution Unlike the use of other forms of authentication such as passwords or tokens, biometric recognition provides a distinct association between an individual and a claimed identity. CrucialTrak utilizes multi-biometrics in most of its products, taking advantage of the capabilities of each biometric technology while overcoming the limitations of a single technology. BACS ™ access control solution increases building security while providing flexible employee and visitor access management. The 100% touchless access control solution helps you avoid hygiene issues that can occur when there are large numbers of users. Our access solutions cover biometric readers, speed gates, smart doors, enroll stations, and visitor management software. BACS ™ Tube is an innovative industrial solution to protect assets using biometric facial and iris recognition. It reduces time and effort required in the existing card or password logon process while maintaining quality control through an efficient access control process. BACS ™ automotive solutions offer technologies for vehicle access as well as easy monitoring of employed drivers. BACS™ Fleet Glance allows a reliable driver recognition using biometric information so that companies can easily monitor the time, attendance and location of employed drivers. The dual biometric BACS™ Fleet Grip also enables easy keyless access to a vehicle for authorized drivers. Our newest product in the line-up is Temon, a non-contact thermometer accessory for smartphones. Temon offers a convenient solution for checking temperatures quickly anywhere, anytime and tracking your measurements conveniently with a smartphone app. File size: 2,835KB | PDF",
    "BACS™ Duo 100% Touchless 2-in-1 Biometric Reader · Simultaneous 2-factor authentication process · 100% touchless bio-authentication · Fast and seamless verification quality · Intuitive and user friendly UX · Flexible APIs · External RFID Reader(Optional) Features Application Specifications User Guide Download FAQ Key Features · 2 Biometric Authentication Supports: Face, Palm Vein (RFID optional) · Walkthrough High-Speed Authentication · Clear Image Scoring Algorithm · Smart LCD Leader Status Indicator · Tamper Protection Alarm Product View Key Technologies · AES 256 Data Encryption · 64GB to 256GB Memory Option · Ethernet, Wiegand out(26,34,35), USB3.0 Communication · 1,000,000 Events Log Capacity · RFID Card Operation Optional · Sound and Visual Verification Support · Built-in Web Server Remote Control · Wall & Speedgate Mounting Biometric Technologies Face CrucialTrak's unique facial recognition technology presents the fastest, most advanced and convenient experience for every users. Facial Images are captured in most accurate 3D patterns from widest angles of access paths. - Automated face tracking module captures face with wide range of heights (heights range from 120cm to 220cm/3'11\" to 7'2\") - Precisely captures only targeted image (Automatically eliminates other background face images) - Real-time facial identification under 0.001 second - Low light level counter-light support Palm Vein CrucialTrak's Full Touchless palm vein recognition, simultaneously interlocked with fingerprint recognition, provides the fastest learning, most accurate, and highly comfortable identification experience, with the design built by Bio-Mechanism UX analysis. - Advanced matching algorithms ensure high level of accuracy - Contactless user interface eliminates hygiene concerns - Less than 0.00001% false acceptance rate Application ∙ Ideal for implementing a 1:1 matching solution in conjunction with a card-based system ∙ High Level of Security Solution Commercial Properties Government Agencies Educational Institutions Medical Facilities Key Specification Model Name BACS™ Duo CPU Intel Core i3 Memory / Storage 8 GB / 64 GB, 128 GB optional Built in Display 3.5\" LCD display / Round LED indicators Optional Display HDMI monitor (FHD must be supported, mini DP socket) Color Midnight Black Operation Mode Face, Palm Vein, Optional built-in RFID (single or multi-mode) Biometric Recognitions Face Palm Vein Recognition Distance Up to 2.5 m / 8 ft 35 – 76 mm / 1.4 – 3 in FAR / FRR of Algorithm 0.001 / 0.1 0.00001/0.01 Image Log Capacity 50,000 5,000 Encryption AES 256 Safety UL60950-1, EN60950-1 Speak Out Sound effect Dimensions (W x D x H) 180 mm x 70 mm x 180 mm / 7.1 in x 2.7 in x 7.1 in Weight 1 kg / 2.2 lb Communications 10/100 Mbit Ethernet, Wiegand out, Relay Face Image Enhancement WDR (Wide Dynamic Range) function Event Log Capacity 1,000,000 Remote Control Built-in web server Power 12 V DC / 3 A Tamper Protection SPIP (Smart Personal Information Protection) feature (optional) Proximity Sensor Optional Languages English (customizing available) Operating Temperature -20 – 70 °C / -4 – 158 °F Operating Humidity Max 80 % (RH) Storage Temperature -30 – 80 °C / -22 – 176 °F Certifications CE, NRTL, TUV, FCC, KC, CB, NOM Housing Materials Flame retardant ABS, Polycarbonate, Polypropylene Management SW CruAMS (CrucialTrak Access Management System) Connections 12p connector, Ethernet connector, USB 3.0 connector (debug), HDMI connector (debug) Mounting Default wall mounting bracket Options Lighting Panel Dimensions Certification Duo is on of few products on the market that is tested by a Nationally Recognized Testing Laboratory (NRTL). Duo is also conforming CE, FCC and KC standards. Available Models • BD-A001: All biometric reader • BD-R001: Biometric with RFID card reader User Guide Facial Recognition Stand at a distance of 50–60 cm (19.6-23.6 in) from the product, and look at the face camera. Adjust your face so it is parallel to the camera. The face camera will recognize your face and the face mode icon will blink blue. Palm Vein Recognition Spread your fingers and place your hand perpendicularly to the palm vein sensor. Align the center of your palm with the center of the sensor. Then move your hand slowly and place it 3.5-7 cm (1.3-2.7 in) from the product. The palm vein sensor will scan your palm and the mode icon will blink blue. Remain still while your palm vein is being scanned. Download CrucialTrak BACS™ Brochure File size: 2,835KB | PDF Duo Quick User Guide File size: 1,519KB | PDF BACS™ Products BACS™ Quattro Access Solution BACS™ Duo Access Solution BACS™ Duo-S Access Solution BACS™ Solo Palm Access Solution BACS™ Fleet Glance Automotive Solution BACS™ Tube Industry Solution Enrollstation e4 Access Solution 100% Touchless 2-in-1 Biometric Reader · Simultaneous 2-factor authentication process · 100% touchless bio-authentication · Fast and seamless verification quality · Intuitive and user friendly UX · Flexible APIs · External RFID Reader(Optional) · 2 Biometric Authentication Supports: Face, Palm Vein (RFID optional) · Walkthrough High-Speed Authentication · Clear Image Scoring Algorithm · Smart LCD Leader Status Indicator · Tamper Protection Alarm · AES 256 Data Encryption · 64GB to 256GB Memory Option · Ethernet, Wiegand out(26,34,35), USB3.0 Communication · 1,000,000 Events Log Capacity · RFID Card Operation Optional · Sound and Visual Verification Support · Built-in Web Server Remote Control · Wall & Speedgate Mounting - Automated face tracking module captures face with wide range of heights (heights range from 120cm to 220cm/3'11\" to 7'2\") - Precisely captures only targeted image (Automatically eliminates other background face images) - Real-time facial identification under 0.001 second - Low light level counter-light support - Advanced matching algorithms ensure high level of accuracy - Contactless user interface eliminates hygiene concerns - Less than 0.00001% false acceptance rate ∙ Ideal for implementing a 1:1 matching solution in conjunction with a card-based system ∙ High Level of Security Solution • BD-A001: All biometric reader • BD-R001: Biometric with RFID card reader File size: 2,835KB | PDF Duo Quick User Guide File size: 1,519KB | PDF",
    "Biometric Access Systems CrucialTrak is a designer and manufacturer of the world's first all touchless, 4-in-1 multi-biometric access control system. Home Products Biometric Access Systems Biometric Access Systems Unlike the use of other forms of authentication such as passwords or tokens, biometric recognition provides a distinct association between an individual and a claimed identity. CrucialTrak has developed and improved upon traditional constraints of biometric recognition technology by combining different biometric technologies into one solution. Our Multi-Biometrics terminal is an all-in-one integration of four separate biometric technologies, used in the identification and verification process: fingerprint, facial features, iris patterns and vein patterns. The use of Multi-Biometrics takes advantage of the capabilities of each biometric technology while overcoming the limitations of a single technology. Most analysts and companies involved in the biometrics market see a great potential that Multi-Biometrics products will become more prevalent in the near future. CrucialTrak Product Review Biometric Access Systems Products BACS™ Readers World's first 4-in-1 all touchless multi Biometric Access Control System Read More Enroll System Make enrollment verification process efficient and pleasurable with user friendly design Read More Integration with BACS™ BACS™ can be implemented into most existing systems Read More Unlike the use of other forms of authentication such as passwords or tokens, biometric recognition provides a distinct association between an individual and a claimed identity. CrucialTrak has developed and improved upon traditional constraints of biometric recognition technology by combining different biometric technologies into one solution. Our Multi-Biometrics terminal is an all-in-one integration of four separate biometric technologies, used in the identification and verification process: fingerprint, facial features, iris patterns and vein patterns. The use of Multi-Biometrics takes advantage of the capabilities of each biometric technology while overcoming the limitations of a single technology. Most analysts and companies involved in the biometrics market see a great potential that Multi-Biometrics products will become more prevalent in the near future. Biometric Access Systems Products World's first 4-in-1 all touchless multi Biometric Access Control System Make enrollment verification process efficient and pleasurable with user friendly design BACS™ can be implemented into most existing systems",
    "RFID Readers Home Products RFID Readers RFID Readers CrucialTrak RFID readers will back up even the most unexpected conditions and promote seamless transition to biometrics CrucialTrak RFID readers will back up even the most unexpected conditions and promote seamless transition to biometrics"
  ]
}