{
  "company": "www.isityou-online.com",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 9,
    "0": 3
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.5384615384615384,
    "framing_surveillance": 0.0,
    "framing_market": 0.4615384615384615,
    "num_docs": 12
  },
  "topic_timeline": {
    "20": {
      "-1": 9,
      "0": 3
    }
  },
  "sample_docs": [
    "MULTI-LAYERED BEWARE uses literally dozens of tests to determine whether a subject is truly a human or not. These tests, or \"filters,\" each work orthogonally to render a score. These scores are then analyzed to come up with a straight-forward answer. Having dozens of tests means that there is no single point of failure. No single filter that, if fooled, would render a false-positive determination. CONVENIENT Convenience drives usage. To build a truly secure system it must be usable, and all things being equal, a more convenient security measure will be used more, and with higher policy-compliance than one that is cumbersome. ​ BEWARE was built with this principle in mind. It examines a user's log-in attempt in the background, with none or almost no participation from the user. It requires no effort to comply, so people naturally use it more, and better. ENGINE AGNOSTIC You may already have an authentication engine for mobile that uses face or eye biometrics. If so, we will be happy to add BEWARE'S unique capabilities to your solution and upgrade its resilience in short order. If however, you do not already have a biometric solution, we will be happy to include IsItYou's own face recognition for you to use. Our Technology MULTI-LAYERED BEWARE uses literally dozens of tests to determine whether a subject is truly a human or not. These tests, or \"filters,\" each work orthogonally to render a score. These scores are then analyzed to come up with a straight-forward answer. Having dozens of tests means that there is no single point of failure. No single filter that, if fooled, would render a false-positive determination. CONVENIENT Convenience drives usage. To build a truly secure system it must be usable, and all things being equal, a more convenient security measure will be used more, and with higher policy-compliance than one that is cumbersome. ​ BEWARE was built with this principle in mind. It examines a user's log-in attempt in the background, with none or almost no participation from the user. It requires no effort to comply, so people naturally use it more, and better. ENGINE AGNOSTIC You may already have an authentication engine for mobile that uses face or eye biometrics. If so, we will be happy to add BEWARE'S unique capabilities to your solution and upgrade its resilience in short order. If however, you do not already have a biometric solution, we will be happy to include IsItYou's own face recognition for you to use. BEWARE uses literally dozens of tests to determine whether a subject is truly a human or not. These tests, or \"filters,\" each work orthogonally to render a score. These scores are then analyzed to come up with a straight-forward answer. Having dozens of tests means that there is no single point of failure. No single filter that, if fooled, would render a false-positive determination. Convenience drives usage. To build a truly secure system it must be usable, and all things being equal, a more convenient security measure will be used more, and with higher policy-compliance than one that is cumbersome. BEWARE was built with this principle in mind. It examines a user's log-in attempt in the background, with none or almost no participation from the user. It requires no effort to comply, so people naturally use it more, and better. You may already have an authentication engine for mobile that uses face or eye biometrics. If so, we will be happy to add BEWARE'S unique capabilities to your solution and upgrade its resilience in short order. If however, you do not already have a biometric solution, we will be happy to include IsItYou's own face recognition for you to use.",
    "Videos and Demos LOGOS & ICONS Your Success is Our Success Channel 10 - Israel: Start-up Nation IsItYou @ Coca-Cola TechCrunch Disrupt: San Francisco Identity: BEWARE - Fraud Prevention Videos and Demos LOGOS & ICONS Your Success is Our Success Channel 10 - Israel: Start-up Nation IsItYou @ Coca-Cola TechCrunch Disrupt: San Francisco Identity: BEWARE - Fraud Prevention Your Success is Our Success",
    "How to Prevent Bio-Identity Fraud Frequently Asked Questions I already have a face recognition solution, what can BEWARE add to it? Simply put: we can layer our impostor detector solution to whatever you've already deployed. We can easily integrate with all major face recognition vendors to provide you and your users with an authentication solution you can truly trust. Really, it will work with other biometric engines? Yes. You can deploy IsItYou's BEWARE as an overlay to your current face recognition technology and for every recognized user it will give you an answer to the question: Are. They. Human? It sounds great, but what does the technology actually do? BEWARE integrates into your existing authentication solution and works with it to provide you with the ultimate in secure biometric authentication. BEWARE goes to work AFTER your biometric system has given the \"go ahead.\" BEWAREgoes to work after your user has been successfully authenticated (it would be silly to scrutinize someone that was not even recognized by the system). Multiple layers and multiple factors are brought into the mix to determine whether the user that was just \"recognized\" is in fact the right human being. I've heard about \"liveness detection.\" Is this it? Yes it is, in more ways than one. In today's jargon, \"liveness\" detection is really motion detection. Put simply, it looks for things like blinking (movement of the eyelids), smiling, or a shake of the head. It assumes that all fraud attempts will be come in the form of a static photograph. IsItYou is different. We layer a number of methodologies that provide orthogonal responses to an authentication event. IsItYou uses an intelligent agent that adapts itself to the circumstance and helps the legitimate user reach a successful authentication. How to Prevent Bio-Identity Fraud Frequently Asked Questions I already have a face recognition solution, what can BEWARE add to it? Simply put: we can layer our impostor detector solution to whatever you've already deployed. We can easily integrate with all major face recognition vendors to provide you and your users with an authentication solution you can truly trust. Really, it will work with other biometric engines? Yes. You can deploy IsItYou's BEWARE as an overlay to your current face recognition technology and for every recognized user it will give you an answer to the question: Are. They. Human? It sounds great, but what does the technology actually do? BEWARE integrates into your existing authentication solution and works with it to provide you with the ultimate in secure biometric authentication. BEWARE goes to work AFTER your biometric system has given the \"go ahead.\" BEWAREgoes to work after your user has been successfully authenticated (it would be silly to scrutinize someone that was not even recognized by the system). Multiple layers and multiple factors are brought into the mix to determine whether the user that was just \"recognized\" is in fact the right human being. I've heard about \"liveness detection.\" Is this it? Yes it is, in more ways than one. In today's jargon, \"liveness\" detection is really motion detection. Put simply, it looks for things like blinking (movement of the eyelids), smiling, or a shake of the head. It assumes that all fraud attempts will be come in the form of a static photograph. IsItYou is different. We layer a number of methodologies that provide orthogonal responses to an authentication event. IsItYou uses an intelligent agent that adapts itself to the circumstance and helps the legitimate user reach a successful authentication. How to Prevent Bio-Identity Fraud Frequently Asked Questions How to Prevent Bio-Identity Fraud I already have a face recognition solution, what can BEWARE add to it? Simply put: we can layer our impostor detector solution to whatever you've already deployed. We can easily integrate with all major face recognition vendors to provide you and your users with an authentication solution you can truly trust. Really, it will work with other biometric engines? Yes. You can deploy IsItYou's BEWARE as an overlay to your current face recognition technology and for every recognized user it will give you an answer to the question: It sounds great, but what does the technology actually do? BEWARE integrates into your existing authentication solution and works with it to provide you with the ultimate in secure biometric authentication. BEWARE goes to work AFTER your biometric system has given the \"go ahead.\" BEWAREgoes to work after your user has been successfully authenticated (it would be silly to scrutinize someone that was not even recognized by the system). Multiple layers and multiple factors are brought into the mix to determine whether the user that was just \"recognized\" is in fact the right human being. I've heard about \"liveness detection.\" Is this it? Yes it is, in more ways than one. In today's jargon, \"liveness\" detection is really motion detection. Put simply, it looks for things like blinking (movement of the eyelids), smiling, or a shake of the head. It assumes that all fraud attempts will be come in the form of a static photograph. IsItYou is different. We layer a number of methodologies that provide orthogonal responses to an authentication event. IsItYou uses an intelligent agent that adapts itself to the circumstance and helps the legitimate user reach a successful authentication.",
    "CONVENIENT IsItYou makes your biometric system secure by using multiple methodologies to achieve a single result: answer the question: Are you real? Works on all face recognition engines ENGINE AGNOSTIC Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage. Humans are complex, so solutions for humans should be MULTI-LAYERED Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage. CONVENIENT IsItYou makes your biometric system secure by using multiple methodologies to achieve a single result: answer the question: Are you real? IsItYou makes your biometric system secure by using multiple methodologies to achieve a single result: answer the question: Are you real? Works on all face recognition engines ENGINE AGNOSTIC Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage. Works on all face recognition engines Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage. Humans are complex, so solutions for humans should be MULTI-LAYERED Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage. Humans are complex, so solutions for humans should be Humans are complex. In many cases this complexity makes for challenges in recognizing and authenticating them. But what can be a challenge can also be an advantage.",
    "Follow Us RedZone Licenses IsItYou's Technology May 23, 2017 Helios & Matheson signs licensing agreement with IsItYou. Read More ISITYOU FEATURED IN THE MARKER March 6, 2017 Earlier during MWC, IsItYou announced that Major General Danny Yatom, former chief of Israel's world-renowned Mossad intelligence agency, would be joining the company as chairman. We are proud to share that The Marker, one of Israel's most influential business publicat... Read More Former Mossad Chief Joins IsItYou as Chairman February 28, 2017 For immediate release DANNY YATOM, FORMER MOSSAD CHIEF, JOINS ISITYOU AS CHAIRMAN Retired leader of Israel's world-renowned intelligence agency brings security and strategy expertise to pioneering facial biometrics company. Limited appointments for in-person meetings with... Read More MWC vs IsItYou's Face Recognition February 27, 2017 As you read this blog post, IsItYou is proud to be presenting at the Mobile World Congress in Barcelona, alongside some of the most exciting and innovative tech companies in the world. Every year, MWC draws a huge crowd of entrepreneurs and scientists, members of the pr... Read More THE CASE FOR (AND AGAINST) THE FACE February 24, 2017 | Benjamin Levy Using your face as your password is a compelling way to keep your data, documents, and mobile devices secure. But in order to work, the security app that authenticates that your face is actually your face needs to be powerful - and not easily duped. In an art... Read More Ethan Hunt's Mission:Impossible February 16, 2017 MISSION IMPOSSIBLE Facial recognition technology has been around since the 1960s so you might be forgiven for asking: What's new? IsItYou is proud to introduce its proprietary anti-spoofing technology - a tool can stand on its own or couple with any existing facial r... Read More Please reload Archive May 2017 (1) March 2017 (1) February 2017 (4) Please reload RedZone Licenses IsItYou's Technology Helios & Matheson signs licensing agreement with IsItYou. ISITYOU FEATURED IN THE MARKER Earlier during MWC, IsItYou announced that Major General Danny Yatom, former chief of Israel's world-renowned Mossad intelligence agency, would be joining the company as chairman. We are proud to share that The Marker, one of Israel's most influential business publicat... Former Mossad Chief Joins IsItYou as Chairman DANNY YATOM, FORMER MOSSAD CHIEF, JOINS ISITYOU AS CHAIRMAN Retired leader of Israel's world-renowned intelligence agency brings security and strategy expertise to pioneering facial biometrics company. Limited appointments for in-person meetings with... MWC vs IsItYou's Face Recognition As you read this blog post, IsItYou is proud to be presenting at the Mobile World Congress in Barcelona, alongside some of the most exciting and innovative tech companies in the world. Every year, MWC draws a huge crowd of entrepreneurs and scientists, members of the pr... THE CASE FOR (AND AGAINST) THE FACE Using your face as your password is a compelling way to keep your data, documents, and mobile devices secure. But in order to work, the security app that authenticates that your face is actually your face needs to be powerful - and not easily duped. Facial recognition technology has been around since the 1960s so you might be forgiven for asking: What's new? IsItYou is proud to introduce its proprietary anti-spoofing technology - a tool can stand on its own or couple with any existing facial r..."
  ]
}