{
  "company": "www.optoprecision.de",
  "dominant_topics": [
    -1,
    0
  ],
  "topic_counts": {
    "-1": 9,
    "0": 2
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "-1": 9,
      "0": 2
    }
  },
  "sample_docs": [
    "Security Systems INFORMATION advantage through superior technology Daylight-independent Camera and Video Monitoring Systems Multi-sensor Systems NIR- and SWIR-Laser Lighting Systems LED Light Sources All Security System Products Security Systems OptoPrecision MODAR Innovative Multi-sensor systems for optimum visibility in all weather conditions on land and at sea More about MODAR Security Systems OptoPrecision LaserFlash Discrete, eye-safe IR laser lighting for covert investigation All LaserFlash Products Security Systems INFORMATION advantage through superior technology Daylight-independent Camera and Video Monitoring Systems Multi-sensor Systems NIR- and SWIR-Laser Lighting Systems LED Light Sources All Security System Products INFORMATION advantage through superior technology Daylight-independent Camera and Video Monitoring Systems NIR- and SWIR-Laser Lighting Systems All Security System Products Security Systems OptoPrecision MODAR Innovative Multi-sensor systems for optimum visibility in all weather conditions on land and at sea More about MODAR Innovative Multi-sensor systems for optimum visibility in all weather conditions on land and at sea Security Systems OptoPrecision LaserFlash Discrete, eye-safe IR laser lighting for covert investigation All LaserFlash Products Discrete, eye-safe IR laser lighting for covert investigation Discrete Surveillance, Security and IR-laser Technology Our SECURITY SYSTEMS division is specialized in innovative security and surveillance technologies for police, security, military forces and other organizations or companies requiring high security standards. Our SECURITY SYSTEMS product portfolio ranges from various laser and LED light sources to customer-specific tailored systems for complex naval and land-based monitoring and surveillance tasks. As system provider we maintain tight partnerships with innovative and creative manufacturers of monitoring and security technology worldwide and are a competent partner for our customers during the acquisition process of further system components and system integration. Our special fields: Daylight-independent camera and video surveillance Actionable, high-resolution images Infrared laser illumination systems SWIR and thermal imaging Optics Image analysis, image transmission and recording Encrypted web-based transmission of information (satellite and mobile support) Security Systems Products Image analysis and evaluation Multi-sensor Systems MODAR MODAR-BC MODAR-HDR REMOS PERIS - PERSON IDENTIFICATION SYSTEM Driver-Front-Photo System (FFS) LaserFlash LED searchlight UV LED light source Heartbeat Handheld Detector Applications Sea and coastal observation Object and drone tracking Search and Rescue (SAR) Border protection Traffic monitoring Driver identification Suppressing extraneous light Police surveillance Undercover video surveillance Undercover investigation Night vision Documents and banknote inspection Discrete Surveillance, Security and IR-laser Technology Our SECURITY SYSTEMS division is specialized in innovative security and surveillance technologies for police, security, military forces and other organizations or companies requiring high security standards. Our SECURITY SYSTEMS product portfolio ranges from various laser and LED light sources to customer-specific tailored systems for complex naval and land-based monitoring and surveillance tasks. As system provider we maintain tight partnerships with innovative and creative manufacturers of monitoring and security technology worldwide and are a competent partner for our customers during the acquisition process of further system components and system integration. Daylight-independent camera and video surveillance Infrared laser illumination systems SWIR and thermal imaging Image analysis, image transmission and recording Encrypted web-based transmission of information (satellite and mobile support) Image analysis and evaluation PERIS - PERSON IDENTIFICATION SYSTEM UV LED light source Sea and coastal observation Object and drone tracking Search and Rescue (SAR) Documents and banknote inspection",
    "Supression of interference light Supression of interference light Supression of interference light Supression of interference light Security Systems > Applications > Suppressing extraneous light Suppressing extraneous light In the area of video surveillance, there are often situations, where the light coming from sources in the image, impairs the video and interferes with the identification of persons or situations, or makes it impossible. Particularly in the dark, video cameras are very sensitive to disruptive highlights and changing light conditions (e.g. car headlights), which often leads to \"outshone†representation of objects. In these cases, the \"extraneous lights\" can be suppressed by using laser lighting systems, combined with suitable video technology, so that they no longer interfere with the video recording. Products for suppression of interference light MODAR Multi-sensor system for optimum visibility developed for use on ships or integrated in vehicles Driver-Front-Photo System (FFS) Mobile Driver-Front-Photo System for the taking of legally admissible, daylight-independent photographs for the identification of persons in vehicles LaserFlash Eye-safe IR laser illumination for undercover investigations In the area of video surveillance, there are often situations, where the light coming from sources in the image, impairs the video and interferes with the identification of persons or situations, or makes it impossible. Particularly in the dark, video cameras are very sensitive to disruptive highlights and changing light conditions (e.g. car headlights), which often leads to \"outshone†representation of objects. In these cases, the \"extraneous lights\" can be suppressed by using laser lighting systems, combined with suitable video technology, so that they no longer interfere with the video recording. Products for suppression of interference light Multi-sensor system for optimum visibility developed for use on ships or integrated in vehicles Mobile Driver-Front-Photo System for the taking of legally admissible, daylight-independent photographs for the identification of persons in vehicles Eye-safe IR laser illumination for undercover investigations",
    "Security Systems > Applications > Undercover video surveillance Undercover investigation Investigating police authorities can use video surveillance systems for various purposes and under a variety of conditions. Undercover investigation During undercover investigations, it is sometimes important for the officers to illuminate at a distance of several hundred meters, in poor visibility or at night, to get a meaningful image, without being exposed. Our infrared laser illumination systems are developed especially for professional use by investigating authorities. The invisible, eye-safe laser light allows the task forces completely safe operation in public spaces. Laser safety Used for many years, they consistently fulfil the high standards of official users in of reliability, light output and user friendliness. The laser safety was confirmed by the employers' liability insurance association. The devices also help the officers with difficult tasks, such as reading number plates at night, looking through windowpanes, looking behind strong stray light or night observation. LaserFlash Eye-safe IR laser illumination for undercover investigations Driver-Front-Photo System (FFS) Mobile Driver-Front-Photo System for the taking of legally admissible, daylight-independent photographs for the identification of persons in vehicles Investigating police authorities can use video surveillance systems for various purposes and under a variety of conditions. During undercover investigations, it is sometimes important for the officers to illuminate at a distance of several hundred meters, in poor visibility or at night, to get a meaningful image, without being exposed. Our infrared laser illumination systems are developed especially for professional use by investigating authorities. The invisible, eye-safe laser light allows the task forces completely safe operation in public spaces. Used for many years, they consistently fulfil the high standards of official users in of reliability, light output and user friendliness. The laser safety was confirmed by the employers' liability insurance association. The devices also help the officers with difficult tasks, such as reading number plates at night, looking through windowpanes, looking behind strong stray light or night observation. Eye-safe IR laser illumination for undercover investigations Mobile Driver-Front-Photo System for the taking of legally admissible, daylight-independent photographs for the identification of persons in vehicles",
    "Security Systems > Applications Applications Security Systems The demand for effective reliable security concepts and technologies has increased dramatically in recent years. Our security products are mainly focused towards government institutions but they also apply to private companies that are involved in personal protection and the securing of property assets. Our customer base comprises of special police forces and mobile special response units, customs, the military and other security services, as well as private security companies. Sea and coastal observation Search and Rescue (SAR) Border protection Traffic monitoring & driver identification Undercover video surveillance Observation at night or bad visibility Suppression of interference light Document and bank notes verification The demand for effective reliable security concepts and technologies has increased dramatically in recent years. Our security products are mainly focused towards government institutions but they also apply to private companies that are involved in personal protection and the securing of property assets. Our customer base comprises of special police forces and mobile special response units, customs, the military and other security services, as well as private security companies. Sea and coastal observation Search and Rescue (SAR) Traffic monitoring & driver identification Observation at night or bad visibility Suppression of interference light Document and bank notes verification",
    "Security Systems > Products > MODAR-HDR Product description The MODAR-HDR multi-sensor system allows the monitoring and identification of people as well as the acquisition of high-definition pictures of faces, day and night. The assistance of NIR laser technology and the use of special interference filters allow the MODAR-HDR to recognise drivers in a range of up to 400 m in practically all lighting and weather conditions. The high-definition images are recorded, optimised and analysed by our software in real time. The simultaneous depiction of overview and detailed images make it possible to keep an overview of a crowd of people or a scene, while identifying individual people. The successful suppression of interfering light sources (headlamps, street lamps or sunlight for example) developed through our technology and the minimisation of atmospheric interferences are essential in many situations to obtain evidence-worthy images. For the public space and for short-range requirements, exclusively eye-safe lasers of the laser class 1 are used. For particular tasks or for long-range setups, lasers of the laser class 4 (not eye-safe) can also be used, as they allow a longer monitoring range of up to 2-3 km. MODAR-HDR Face recognition: acquisition from approx. 20 m distance Acquisition from approx. 400 m distance Telescopic mast Telescopic mast (up to 4 m above the ground) The MODAR-HDR is optimally equipped for use in vehicles (Mercedes Sprinter, VW Crafter, etc.) through the pan-tilt system with line of sight stabilisation and the solid and robust casing (protection class IP67). With its telescopic mast, the MODAR-HDR can also be extended to a height of up to 4 meters above the ground. Depending on the vehicle type and customer requirements, the MODAR-HDR can disappear completely into the emergency vehicle or return to a case on top of the vehicle roof. The construction of the vehicle, the equipment of the PC work stations in the vehicle as well as the system integration of the MODAR-HDR are conducted by OptoPrecision. Contact If you would like further information, please do not hesitate to contact us by telephone or in writing. Contact details The MODAR-HDR multi-sensor system allows the monitoring and identification of people as well as the acquisition of high-definition pictures of faces, day and night. The assistance of NIR laser technology and the use of special interference filters allow the MODAR-HDR to recognise drivers in a range of up to 400 m in practically all lighting and weather conditions. The high-definition images are recorded, optimised and analysed by our software in real time. The simultaneous depiction of overview and detailed images make it possible to keep an overview of a crowd of people or a scene, while identifying individual people. The successful suppression of interfering light sources (headlamps, street lamps or sunlight for example) developed through our technology and the minimisation of atmospheric interferences are essential in many situations to obtain evidence-worthy images. For the public space and for short-range requirements, exclusively eye-safe lasers of the laser class 1 are used. For particular tasks or for long-range setups, lasers of the laser class 4 (not eye-safe) can also be used, as they allow a longer monitoring range of up to 2-3 km. Face recognition: acquisition from approx. 20 m distance Acquisition from approx. 400 m distance Telescopic mast (up to 4 m above the ground) The MODAR-HDR is optimally equipped for use in vehicles (Mercedes Sprinter, VW Crafter, etc.) through the pan-tilt system with line of sight stabilisation and the solid and robust casing (protection class IP67). With its telescopic mast, the MODAR-HDR can also be extended to a height of up to 4 meters above the ground. Depending on the vehicle type and customer requirements, the MODAR-HDR can disappear completely into the emergency vehicle or return to a case on top of the vehicle roof. The construction of the vehicle, the equipment of the PC work stations in the vehicle as well as the system integration of the MODAR-HDR are conducted by OptoPrecision. If you would like further information, please do not hesitate to contact us by telephone or in writing. Contact details"
  ]
}