{
  "company": "www.alluvial.net.au",
  "dominant_topics": [
    0
  ],
  "topic_counts": {
    "0": 1
  },
  "topic_descriptions": {
    "0": "access, security, data, time, use"
  },
  "framing_scores": null,
  "topic_timeline": {
    "20": {
      "0": 1
    }
  },
  "sample_docs": [
    "Alluvial has extensive experience with large scale complex facial recognition systems and can design solution for your specific requirements. ​We provide genuine independent guidance and solutions using the best possible technologies to meet your needs and budget. We understand the complexities and issues that come with implementing facial recognition systems and have the experience to provide you with expert advice and solutions to meet your requirements. Alluvial prides itself on its industry knowledge and expertise in facial recognition. We actively participate in international biom etric standard committees and are active members of organisations like the Biometrics Institute Alluvial has extensive experience with large scale complex facial recognition systems and can design solution for your specific requirements. ​We provide genuine independent guidance and solutions using the best possible technologies to meet your needs and budget. We understand the complexities and issues that come with implementing facial recognition systems and have the experience to provide you with expert advice and solutions to meet your requirements. Alluvial prides itself on its industry knowledge and expertise in facial recognition. We actively participate in international biom etric standard committees and are active members of organisations like the Biometrics Institute Alluvial has extensive experience with large scale complex facial recognition systems and can design solution for your specific requirements. ​We provide genuine independent guidance and solutions using the best possible technologies to meet your needs and budget. We understand the complexities and issues that come with implementing facial recognition systems and have the experience to provide you with expert advice and solutions to meet your requirements. Alluvial prides itself on its industry knowledge and expertise in facial recognition. We actively participate in international biom etric standard committees and are active members of organisations like the Biometrics Institute"
  ]
}