{
  "company": "www.fastenterprises.com",
  "dominant_topics": [
    0,
    28,
    23
  ],
  "topic_counts": {
    "0": 3,
    "28": 1,
    "23": 1
  },
  "topic_descriptions": {
    "0": "access, information, security, data, piam",
    "28": "dgworld, autonomous, engineer, senior, robot",
    "23": "gentex, glass, dimmable, dimmable glass, mirror"
  },
  "framing_scores": {
    "framing_ethical": 0.5111111111111111,
    "framing_surveillance": 0.0,
    "framing_market": 0.4888888888888889,
    "num_docs": 5
  },
  "topic_timeline": {
    "20": {
      "0": 3,
      "23": 1,
      "28": 1
    }
  },
  "sample_docs": [
    "Career Opportunities in Boise, Idaho Fast Enterprises is looking for additional team members interested in a challenging career in product development and multiphase implementation, with an initial assignment in our Boise, Idaho office. Our client in Idaho is the Idaho State Tax Commission (ISTC), who acquired a license to purchase GenTax in January 2000. Fast Enterprises worked with the ISTC over a two-and-a-half year period on their Convert All Tax Systems (CATS) Integrated Tax Project , to successfully implement GenTax for the administration of the States major tax types. Positions for software developers are available for individuals interested in working in a team environment on the successful implementation of our GenTax revenue system. Recent computer science, computer engineering or IT graduates and junior software developers, with two or less years of experience, are encouraged to apply. Facts about Boise, the City of Trees Boise, Idaho is the state capital and also Idahos largest city (approximately 400,000 people live in the greater Boise area). In May 2000, Forbes Magazine ranked Boise fifth among 200 U.S. metropolitan markets in of salary and job growth. The area enjoys a pleasant four-season climate that includes warm, sunny summers and generally mild winters. Boise lies in the heart of the Treasure Valley, the wooded greenbelt that cradles the Boise River. Residents can ski, run whitewater rivers, mountain bike, and hunt and fish within easy driving distance of the city, in an area long known for its natural beauty and proximity to outdoor recreation activities. The Boise metro area is also justifiably proud of its rich cultural life, which includes a professional philharmonic orchestra, dance and opera companies, numerous museums and galleries, gardens, nature centers and a zoo. Major employers in Boise include Hewlett-Packard and Micron Technology (and 300 smaller high-tech firms), the food and drug retailer Albertsons, as well as Boise Cascade, J.R. Simplot Co., Morrison-Knudsen, PixTech, and PowerBar. Fasts client in Boise Idaho State Tax Commission Information about the city City of Boise homepage Boise Visitor Information Centers Insiders Guide - Boise & Sun Valley (recommended) Boise.org 4Boise About Boise Destination Northwest - Boise Local media Boise SkyCam Idaho Statesman (local newspaper includes classifieds) KTVB (Boise, Idaho news station) Cultural attractions Boise Art Museum Boise.org Attractions Boise Basque Museum and Cultural Center Discovery Center of Idaho (Boises hands-on museum) Idaho Black History Museum Idaho Historical Museum Idaho Shakespeare Festival Zoo Boise Reference Boise City Airport The weather in Boise Idaho Idaho Travel and Tourism Guide Send mail to gnichol@gentax.com with questions or comments about this website. Copyright 1999-2003 Fast Enterprises LLC Last modified: June 04, 2003",
    "FastUI-PL FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. Customer Engagement Customers can conveniently access services, accounts, and messages on our 24/7, mobile-friendly self-service portal. Workflow & Process Automation Endless automation capabilities reduce manual work, freeing up staff time to focus on higher-value activities and customer service. Fraud Mitigation & Identity Verification Cloud-based solutions safeguard data and funds, increase public confidence and trust, and reduce workload. Financials & Accounting Automate common financial transactions, including contribution and wage reports, for more accurate, centralized accounting. Core Business Intelligence Gain real-time insights and analytics for enhanced productivity, data-driven decision-making, and risk mitigation. Reporting Create, manage, and execute pre-programmed reports that adhere to an agency's formatting standards and USDOL requirements. Appeals Administer all appeals activity in our 360° module for customers and staff, including file management, fact-finding, and appointment scheduling. Centralized Interfaces Consolidate all business interfaces via the FAST Gateway, a built-in integration layer that enables staff to efficiently work in one browser. Previous Next 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. Fast Strategic Services Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. FastUI-PL: Powered by FastCore Lead the way in customer engagement — with FastUI - PL. Built on the flexible FastCore platform, FastUI-PL is the only all-in-one solution for streamlined unemployment insurance (UI) and paid leave (PL) tax, benefit, and appeals administration. Agencies of all sizes use our production-proven software to keep pace with customers' needs, enhance equity and accessibility, and protect program integrity. Customers can conveniently access services, accounts, and messages on our 24/7, mobile-friendly self-service portal. Workflow & Process Automation Endless automation capabilities reduce manual work, freeing up staff time to focus on higher-value activities and customer service. Fraud Mitigation & Identity Verification Cloud-based solutions safeguard data and funds, increase public confidence and trust, and reduce workload. Automate common financial transactions, including contribution and wage reports, for more accurate, centralized accounting. Gain real-time insights and analytics for enhanced productivity, data-driven decision-making, and risk mitigation. Create, manage, and execute pre-programmed reports that adhere to an agency's formatting standards and USDOL requirements. Administer all appeals activity in our 360° module for customers and staff, including file management, fact-finding, and appointment scheduling. Consolidate all business interfaces via the FAST Gateway, a built-in integration layer that enables staff to efficiently work in one browser. 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide 100 % Projects delivered on time and on budget 25 + Years of transforming government 100 + Active clients using FastCore software worldwide Projects delivered on time and on budget Years of transforming government Active clients using FastCore software worldwide A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. A New Claimant Experience A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. A New Claimant Experience Engage and empower customers on our user-friendly portal, designed to exceed U.S. Department of Labor (USDOL) guidelines. Handle claim registration, validation, and eligibility for all claim types, as well as weekly benefit requests and certifications, in one place. Advanced tools help resolve and detect issues sooner, saving time and ensuring fair, efficient claim eligibility decisions. Distribute timely, accurate benefits, manage high-dollar payments, reissue lost or returned payments, and support 1099 processing. Enhance transparency and support compliance with self-service options and tools to track overpayment aging, apply interest penalties, accept repayments, arrange payment plans, and manage enforcement. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. Enhanced Employer Compliance FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Streamlined employer registration makes it easier for your agency to process status and liability determinations. Instantly perform rating calculations of all complexities, including reserve ratio, benefit ratio, specialized rating methods, and more. Collect and manage quarterly, monthly, or annual wage details with automated filing reminders and follow-ups for delinquent and non-filers. Automate, stage, assign, track, and manage employer collection actions via our robust collections and enforcement module, which prioritizes self-service and compliance. Our customizable sample selection, assignment, review, scoring, and result submission tools support participation in the TPS Audit program. FastUl-PL takes the headache out of registering and filing quarterly reports and contributions via a simple, intuitive portal for employers, third-party administrators, and medical providers. Fast Strategic Services Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. Fast Strategic Services Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. Fast Identity Verification Services FIVS provides packaged identity security to reduce fraud and give you peace of mind. Fast Collection Services FCS uses real-time data to customize and automate your collections processes like never before. Fast Audit Services FAS expands your data lake far beyond what you thought was possible. Whether part of a full or standalone implementation, Fast Strategic Services bring even more security and value to your project. FIVS provides packaged identity security to reduce fraud and give you peace of mind. FCS uses real-time data to customize and automate your collections processes like never before. FAS expands your data lake far beyond what you thought was possible.",
    "FastDS-VS ® FastDS-VS FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. Notable Features Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Live/In Production Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Why FastDS-VS ? The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Customer The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Driver Services Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle Services Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. Financials The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. Workflow The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. Information The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. Management Studio The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. Optional Subsystems International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats. FastDS-VS FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. FastDS-VS is an integrated software solution to administer driver and vehicle services to motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. Notable Features Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Live/In Production Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Provides an integrated view of the customer for both driver and vehicle services Flexibly configured to meet the unique business and technical requirements of motor vehicle agencies, with minimal need for custom programming Built using Microsoft tools and technology to run on industry-standard server platforms and modern web browser clients Highly scalable to accommodate agencies' long-term performance and growth requirements Consistently implemented on time and on budget for every client agency since its release in 2011 View the FastDS-VS functional architecture brochure . View an overview brochure of FAST's solutions for driver and vehicle services. Arkansas Department of Revenue (Driver and Vehicle Services) February 2014 MOVE article Colorado Department of Revenue (Driver and Vehicle Services) Georgia Department of Revenue and Georgia Department of Driver Services (Driver and Vehicle Services) Massachusetts Department of Transportation (Driver and Vehicle Services) Michigan Department of State (Driver and Vehicle Services) Minnesota Department of Safety (Driver and Vehicle Services) Mississippi Department of Revenue (Vehicle Services) Nebraska Department of Motor Vehicles (Vehicle Services) New Mexico Taxation and Revenue Department (Driver and Vehicle Services) February 2014 press release North Dakota Department of Transportation (Vehicle Services) Oklahoma Tax Commission (Vehicle Services) Oregon Department of Transportation (Driver and Vehicle Services) Tennessee Department of Safety and Homeland Security (Driver Services) March 2015 press release March 2015 press release Utah State Tax Commission (Vehicle Services) June 2014 press release June 2014 press release Washington State Department of Licensing (Driver and Vehicle Services) Why FastDS-VS ? The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. The FastDS-VS solution is configured from these modules to meet the specific business and technical objectives of motor vehicle agencies. Customized extensions to the core solution can also be implemented to meet unique program needs. Functional Architecture Customer The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Driver Services Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle Services Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. Financials The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. Workflow The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. Information The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. Management Studio The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. The Customer module is comprised of subsystems that maintain customer demographics and registration details, as well as communications, online customer self-service features, and the administration of professional and business licensing. Integrated correspondence management handles outgoing communications. The underlying data structure links vehicles and customers for a fully integrated view across the entire FastDS-VS solution. Subsystems in the Driver Services module provide functions for the issuance and maintenance of driver licenses and other identification credentials. The module also supports fraud detection and investigation, hearings scheduling and management, financial responsibility, and the administration and reporting of driver restrictions, convictions, and other information related to driver improvement and control. Vehicle titling and registration is managed by subsystems in the Vehicle Services module. The subsystems provide tools and functions used for title applications and examinations, vehicle and fleet registrations and renewals, maintenance of impound records and reports, dealer licensing and regulation, and inventory management of plates, decals, and temporary and single-use permits. The subsystems of the Financials module provide robust integrated financial functions. FastDS-VS supports full revenue accounting for all financial transactions, including distribution of revenue. In addition, it provides integrated cashiering capabilities for multiple payment methods, tracking and billing of customer liabilities, compliance and audit functions, and automated refund and collection activities. The Workflow module maintains work assignments and cases that involve multi-stage business activities. The Work Management subsystem allows managers to define task priority and assign work individually or in bulk. Case Management maintains multi-stage cases—such as title examinations, fraud investigations, and hearings—and triggers work items when stages or actions require user intervention. The Information module contains subsystems that provide real-time reporting and data exchange, storage, comparison, and analysis. Much of the information contained in traditional reports is available instantaneously through online lists, searches, and dashboards that can be viewed, exported, and printed. Reports, ad hoc queries, and data metrics can be saved, modified, and shared, and users can display data in dynamic chart formats, including pie, line, bar, and stacked-bar charts. Data warehouse functionality provides for the storage and integrated use of external data from third parties. The subsystems in the Management Studio module are used to implement, modify, secure, operate, and maintain FastDS-VS. Agency staff have access to multiple tools and functions that are native to the application, including the integrated business rules engine, online help, project scheduling, batch processing, security administration, performance monitoring, and interface management. Optional Subsystems International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats. International Registration Plan (IRP) IRP offers comprehensive capabilities for streamlined credentialing of interstate commercial motor carriers. It processes, tracks, and reports carrier information and fee and payment details for compliant IRP administration, funds netting, and violator sanctioning. FastDS-VS automates the exchange of vehicle and fee information across multiple entities and the IRP Clearinghouse. The system automates apportioning of credits and fees as well as the creation of the IRP Clearinghouse Recap file, and includes full support for the peer-review process. International Fuel Tax Agreement (IFTA) IFTA provides licensing, reporting, filing, auditing, and transmittal functions for IFTA administration. Additional functions include interfacing with the IFTA Clearinghouse and with state, federal, and third-party systems. Note: IFTA Fuel Tax Rates can now be obtained by going to the IFTA website . Navigate to the Tax Rates page, select the desired quarter, and download the file as an XML file. You can then use the IFTA rate loader tool in the system to generate the scripts by loading the XML file that was downloaded from the IFTA website. Imaging manages digital document images that are captured individually online by users or in batch by agencies' third-party scanning subsystems. Images are indexed to associate them with the correct customer records. FastDS-VS supports images in industry-standard formats.",
    "Home The Mississippi Automated Revenue System (MARS) project has transformed the way the Department of Revenue carries out its work every day . - Jennifer Wentworth, MS DOR Associate Commissioner FAST solutions Integrated Tax Solutions GenTax ® is a complete, integrated tax processing software package designed to support an agency implementing multiple taxes. It adapts to diverse revenue agency requirements through configuration, not customization. GenTax has the power to increase your efficiency and save costs. Driver and Motor Vehicle Solutions FastDS-VS ® is an integrated software solution for administering driver and vehicle services for motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. FastDS-VS is helping motor vehicle agencies streamline operations and better serve their customers. Unemployment Insurance Solutions FastUI ® is an integrated unemployment insurance tax and benefit solution designed to support the administrative systems of state unemployment insurance agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in state laws and practices through configuration, not the creation or modification of program code. who are FAST ies? FAST-ie \\ 'fæste \\ noun 1. an energetic, intelligent, enthusiastic person who works at Fast Enterprises. 2. a person dedicated to modernizing government technology to better serve the general public. 3. someone who is open to adventure and wants to experience new places around the world. 4. someone who enjoys collaboration with clients and camaraderie with teammates while solving business and technology problems. Apply Now I'm a FASTie too! Our spouses, significant others, children, and pets are FASTies, too! Their inspiration and support are essential to our success. We are a software company, but more importantly, we are the FAST family! the clients We work with governments to implement systems used to administer a wide variety of programs. We offer commercial off-the-shelf software that helps agencies reduce costs, improve service, maximize revenues, and improve the efficiency of internal operations. the direction FAST has over 1,000 employees. We continue to grow at a steady rate and our product is continuously evolving to be the best in the industry... always on time and on budget. the culture Our FAST family keeps growing, but we still maintain a fun, close-knit culture inside and outside of the office. the travel When you join the FAST family, you will be immersed in the local culture of one of our project sites throughout the US, Canada, or at one of our worldwide locations. world explorers Work where you live; live where you work! Relocation is something that sets FAST apart. We work side-by-side with our clients, learning from each other daily. Relocation provides the opportunity to explore new communities and cultures. \"I love the aspect of being able to travel while doing work that I love .\" – Dominique British Columbia Idaho Manitoba New Mexico Louisiana Georgia Montana Alabama North Dakota West Virginia Wisconsin Trinidad & Tobago Illinois Utah Ontario Arlington, Virginia Colorado Arkansas Minnesota California Mississippi Oklahoma Michigan Kansas City, Missouri New York City, New York Malaysia Poland Laos Alaska Tennessee Oregon Massachusetts Vermont South Carolina Jamaica Finland Washington, DC Puerto Rico New Zealand Washington Hawaii Pennsylvania Maryland Louisville, Kentucky Nebraska Indiana New Hampshire Connecticut The Mississippi Automated Revenue System (MARS) project has transformed the way the Department of Revenue carries out its work every day . - Jennifer Wentworth, MS DOR Associate Commissioner The Mississippi Automated Revenue System (MARS) project has transformed the way the Department of Revenue carries out its work every day . - Jennifer Wentworth, MS DOR Associate Commissioner FAST solutions Integrated Tax Solutions GenTax ® is a complete, integrated tax processing software package designed to support an agency implementing multiple taxes. It adapts to diverse revenue agency requirements through configuration, not customization. GenTax has the power to increase your efficiency and save costs. Driver and Motor Vehicle Solutions FastDS-VS ® is an integrated software solution for administering driver and vehicle services for motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. FastDS-VS is helping motor vehicle agencies streamline operations and better serve their customers. Unemployment Insurance Solutions FastUI ® is an integrated unemployment insurance tax and benefit solution designed to support the administrative systems of state unemployment insurance agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in state laws and practices through configuration, not the creation or modification of program code. GenTax ® is a complete, integrated tax processing software package designed to support an agency implementing multiple taxes. It adapts to diverse revenue agency requirements through configuration, not customization. GenTax has the power to increase your efficiency and save costs. FastDS-VS ® is an integrated software solution for administering driver and vehicle services for motor vehicle agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in jurisdiction laws and practices through configuration, not the creation or modification of program code. FastDS-VS is helping motor vehicle agencies streamline operations and better serve their customers. FastUI ® is an integrated unemployment insurance tax and benefit solution designed to support the administrative systems of state unemployment insurance agencies. It is commercial off-the-shelf (COTS) software that accommodates most differences in state laws and practices through configuration, not the creation or modification of program code. who are FAST ies? FAST-ie \\ 'fæste \\ noun 1. an energetic, intelligent, enthusiastic person who works at Fast Enterprises. 2. a person dedicated to modernizing government technology to better serve the general public. 3. someone who is open to adventure and wants to experience new places around the world. 4. someone who enjoys collaboration with clients and camaraderie with teammates while solving business and technology problems. Apply Now who are FAST ies? FAST-ie \\ 'fæste \\ noun 1. an energetic, intelligent, enthusiastic person who works at Fast Enterprises. 2. a person dedicated to modernizing government technology to better serve the general public. 3. someone who is open to adventure and wants to experience new places around the world. 4. someone who enjoys collaboration with clients and camaraderie with teammates while solving business and technology problems. I'm a FASTie too! Our spouses, significant others, children, and pets are FASTies, too! Their inspiration and support are essential to our success. We are a software company, but more importantly, we are the FAST family! I'm a FASTie too! Our spouses, significant others, children, and pets are FASTies, too! Their inspiration and support are essential to our success. We are a software company, but more importantly, we are the FAST family! the clients We work with governments to implement systems used to administer a wide variety of programs. We offer commercial off-the-shelf software that helps agencies reduce costs, improve service, maximize revenues, and improve the efficiency of internal operations. the direction FAST has over 1,000 employees. We continue to grow at a steady rate and our product is continuously evolving to be the best in the industry... always on time and on budget. the culture Our FAST family keeps growing, but we still maintain a fun, close-knit culture inside and outside of the office. the travel When you join the FAST family, you will be immersed in the local culture of one of our project sites throughout the US, Canada, or at one of our worldwide locations. world explorers Work where you live; live where you work! Relocation is something that sets FAST apart. We work side-by-side with our clients, learning from each other daily. Relocation provides the opportunity to explore new communities and cultures. \"I love the aspect of being able to travel while doing work that I love .\" – Dominique British Columbia Idaho Manitoba New Mexico Louisiana Georgia Montana Alabama North Dakota West Virginia Wisconsin Trinidad & Tobago Illinois Utah Ontario Arlington, Virginia Colorado Arkansas Minnesota California Mississippi Oklahoma Michigan Kansas City, Missouri New York City, New York Malaysia Poland Laos Alaska Tennessee Oregon Massachusetts Vermont South Carolina Jamaica Finland Washington, DC Puerto Rico New Zealand Washington Hawaii Pennsylvania Maryland Louisville, Kentucky Nebraska Indiana New Hampshire Connecticut Work where you live; live where you work! Relocation is something that sets FAST apart. We work side-by-side with our clients, learning from each other daily. Relocation provides the opportunity to explore new communities and cultures. \"I love the aspect of being able to travel while doing work that I love .\" – Dominique New York City, New York",
    "FAST Showcase Project Awards FAST projects have been recognized for making a difference in communities around the world. FAST projects have been recognized for making a difference in communities around the world. Massachusetts New Hampshire Maryland Finland Georgia Nebraska 2022: Manuel Carballo Governor's Award for Excellence in Public Service: Massachusetts Department of Revenue, Executive Office of Administration and Finance, IT Support Team 2022: Federation of Tax Administrators Award 2022: AAMVA Customer Convenience 2022: AAMVA Regional Award for Innovative Use of Technology 2021: International Project Management Association (IPMA) Global Project Excellence Awards | Silver Medal 2020: Program of the Year Award 2019: Blue Arrow Awards | Best Digital Service of the Year 2019: Blue Arrow Awards | Customer Experience – A Digital Service That Customers Love 2020: Technology Innovation Showcase 2020: AAMVA Regional Award for Excellence in Government Partnership for Region III 2020: AAMVA Regional and International Award for Excellence in Government Partnership for Region III Minnesota Pennsylvania Washington Wisconsin Tennessee Illinois 2020: Fairness Star Award for the Electronic Certificate of Rent Paid 2012: Governor's Continuous Improvement Award 2019: Pennsylvania Excellence in Technology Award 2019: Best of Washington IT Award 2019: Certificate of Project Excellence from the Office of the Chief Information Officer (OCIO) 2019: FTA Award for Wisconsin's Re-Engineering Collection Work Flow 2012: Federation of Tax Administrators Award for Taxpayer Service and Education 2008: Outstanding Service Award for Innovation 2019: NASCIO Digital Government: Government to Business 2019: AAMVA Award for Customer Convenience Service Award for the Motor Voter Initiative Region II 2019: NASCIO Data Management, Analytics, and Visualization 2018: NASCIO Digital Government | Government to Business Oregon Colorado New York Montana New Mexico Utah 2018: Oregon State CIO Gold Award 2018: State Scoop 50 Awards | State IT Innovation of the Year 2016: Best Application Serving an Agency's Business Needs 2016: State of Montana IT Recognition Award | IT Excellence Award for GenTax® V10 Upgrade 2008: Best of the Web Digital Government Achievement Award | Government-to-Business Category 2015: Roadrunner Award 2014: Governor's Award for Excellence for Innovation and Efficiency California Arlington County Ontario West Virginia Louisiana British Columbia 2012: Government Achievement Award 2011: Award for Excellence from the Government Finance Officers Association of the United States and Canada 2010: Stella Award 2009: Public Sector Merit Award | Government Modernization 2008: Public Sector Gold Award | Best-in-Class Performance 2008: Public Sector Merit Award 2010: Federation of Tax Administrators Award | Award for Outstanding Management and Organizational Initiative 2005: Federation of Tax Administrators Award | Technology Applications in State Tax Administration 2001: Public Sector Technology Award Previous Next Massachusetts New Hampshire Maryland Finland Georgia Nebraska 2022: Manuel Carballo Governor's Award for Excellence in Public Service: Massachusetts Department of Revenue, Executive Office of Administration and Finance, IT Support Team 2022: Federation of Tax Administrators Award 2022: AAMVA Customer Convenience 2022: AAMVA Regional Award for Innovative Use of Technology 2021: International Project Management Association (IPMA) Global Project Excellence Awards | Silver Medal 2020: Program of the Year Award 2019: Blue Arrow Awards | Best Digital Service of the Year 2019: Blue Arrow Awards | Customer Experience – A Digital Service That Customers Love 2020: Technology Innovation Showcase 2020: AAMVA Regional Award for Excellence in Government Partnership for Region III 2020: AAMVA Regional and International Award for Excellence in Government Partnership for Region III 2022: Manuel Carballo Governor's Award for Excellence in Public Service: Massachusetts Department of Revenue, Executive Office of Administration and Finance, IT Support Team 2022: Federation of Tax Administrators Award 2022: AAMVA Customer Convenience 2022: AAMVA Regional Award for Innovative Use of Technology 2021: International Project Management Association (IPMA) Global Project Excellence Awards | Silver Medal 2020: Program of the Year Award 2019: Blue Arrow Awards | Best Digital Service of the Year 2019: Blue Arrow Awards | Customer Experience – A Digital Service That Customers Love 2020: Technology Innovation Showcase 2020: AAMVA Regional Award for Excellence in Government Partnership for Region III 2020: AAMVA Regional and International Award for Excellence in Government Partnership for Region III Minnesota Pennsylvania Washington Wisconsin Tennessee Illinois 2020: Fairness Star Award for the Electronic Certificate of Rent Paid 2012: Governor's Continuous Improvement Award 2019: Pennsylvania Excellence in Technology Award 2019: Best of Washington IT Award 2019: Certificate of Project Excellence from the Office of the Chief Information Officer (OCIO) 2019: FTA Award for Wisconsin's Re-Engineering Collection Work Flow 2012: Federation of Tax Administrators Award for Taxpayer Service and Education 2008: Outstanding Service Award for Innovation 2019: NASCIO Digital Government: Government to Business 2019: AAMVA Award for Customer Convenience Service Award for the Motor Voter Initiative Region II 2019: NASCIO Data Management, Analytics, and Visualization 2018: NASCIO Digital Government | Government to Business 2020: Fairness Star Award for the Electronic Certificate of Rent Paid 2012: Governor's Continuous Improvement Award 2019: Pennsylvania Excellence in Technology Award 2019: Best of Washington IT Award 2019: Certificate of Project Excellence from the Office of the Chief Information Officer (OCIO) 2019: FTA Award for Wisconsin's Re-Engineering Collection Work Flow 2012: Federation of Tax Administrators Award for Taxpayer Service and Education 2008: Outstanding Service Award for Innovation 2019: NASCIO Digital Government: Government to Business 2019: AAMVA Award for Customer Convenience Service Award for the Motor Voter Initiative Region II 2019: NASCIO Data Management, Analytics, and Visualization 2018: NASCIO Digital Government | Government to Business Oregon Colorado New York Montana New Mexico Utah 2018: Oregon State CIO Gold Award 2018: State Scoop 50 Awards | State IT Innovation of the Year 2016: Best Application Serving an Agency's Business Needs 2016: State of Montana IT Recognition Award | IT Excellence Award for GenTax® V10 Upgrade 2008: Best of the Web Digital Government Achievement Award | Government-to-Business Category 2015: Roadrunner Award 2014: Governor's Award for Excellence for Innovation and Efficiency 2018: Oregon State CIO Gold Award 2018: State Scoop 50 Awards | State IT Innovation of the Year 2016: Best Application Serving an Agency's Business Needs 2016: State of Montana IT Recognition Award | IT Excellence Award for GenTax® V10 Upgrade 2008: Best of the Web Digital Government Achievement Award | Government-to-Business Category 2014: Governor's Award for Excellence for Innovation and Efficiency California Arlington County Ontario West Virginia Louisiana British Columbia 2012: Government Achievement Award 2011: Award for Excellence from the Government Finance Officers Association of the United States and Canada 2010: Stella Award 2009: Public Sector Merit Award | Government Modernization 2008: Public Sector Gold Award | Best-in-Class Performance 2008: Public Sector Merit Award 2010: Federation of Tax Administrators Award | Award for Outstanding Management and Organizational Initiative 2005: Federation of Tax Administrators Award | Technology Applications in State Tax Administration 2001: Public Sector Technology Award 2012: Government Achievement Award 2011: Award for Excellence from the Government Finance Officers Association of the United States and Canada 2009: Public Sector Merit Award | Government Modernization 2008: Public Sector Gold Award | Best-in-Class Performance 2008: Public Sector Merit Award 2010: Federation of Tax Administrators Award | Award for Outstanding Management and Organizational Initiative 2005: Federation of Tax Administrators Award | Technology Applications in State Tax Administration 2001: Public Sector Technology Award Project Highlights Project Highlights Project highlights celebrate the success that results from the collaboration of a dedicated team of both clients and FASTies working together toward a common goal. VicToRy for Nebraska June 2021 View Michigan Streamlines Processes with New System October 2020 View South Carolina Blasts to the Future September 2019 View View More Weaving a TAPESTRY of Change August 2019 View Two Agencies Unite for a Better Illinois October 2018 View Tennessee: An A-LIST System August 2018 View View More Jamaica: A Vision of Progress June 2018 View Michigan's Unemployment Insurance Solution October 2014 View A California Success Story August 2012 View View More Montana Department of Revenue Case Study April 2010 View How Louisiana's Department of Revenue Stays Cool, Calm, and Collecting Winter 2005 View New Mexico Taxation & Revenue Department Case Study May 2005 View Idaho State Tax Commission Case Study June 2003 View Hide All Project Highlights Project highlights celebrate the success that results from the collaboration of a dedicated team of both clients and FASTies working together toward a common goal. VicToRy for Nebraska June 2021 View Michigan Streamlines Processes with New System October 2020 View South Carolina Blasts to the Future September 2019 View View More Weaving a TAPESTRY of Change August 2019 View Two Agencies Unite for a Better Illinois October 2018 View Tennessee: An A-LIST System August 2018 View View More Jamaica: A Vision of Progress June 2018 View Michigan's Unemployment Insurance Solution October 2014 View A California Success Story August 2012 View View More Montana Department of Revenue Case Study April 2010 View How Louisiana's Department of Revenue Stays Cool, Calm, and Collecting Winter 2005 View New Mexico Taxation & Revenue Department Case Study May 2005 View Idaho State Tax Commission Case Study June 2003 View Hide All Project highlights celebrate the success that results from the collaboration of a dedicated team of both clients and FASTies working together toward a common goal. Michigan Streamlines Processes with New System South Carolina Blasts to the Future Weaving a TAPESTRY of Change Two Agencies Unite for a Better Illinois Tennessee: An A-LIST System Jamaica: A Vision of Progress Michigan's Unemployment Insurance Solution A California Success Story Montana Department of Revenue Case Study How Louisiana's Department of Revenue Stays Cool, Calm, and Collecting New Mexico Taxation & Revenue Department Case Study Idaho State Tax Commission Case Study"
  ]
}