{
  "company": "www.pingidentity.com",
  "dominant_topics": [
    0,
    -1
  ],
  "topic_counts": {
    "0": 92,
    "-1": 2
  },
  "topic_descriptions": {
    "0": "access, data, security, time, information"
  },
  "framing_scores": {
    "framing_ethical": 0.0222717149220489,
    "framing_surveillance": 0.0,
    "framing_market": 0.977728285077951,
    "num_docs": 94
  },
  "topic_timeline": {
    "20": {
      "-1": 2,
      "0": 92
    }
  },
  "sample_docs": [
    "The Ping Intelligent Identity™ Platform We provide intelligent access for customers, employees and partners so they can securely connect to cloud, mobile, SaaS and on-premises applications and APIs. Our cloud identity , private cloud identity and on-premises software solutions help you prevent security breaches, manage sensitive data and improve user engagement by optimizing both security and convenience. our platform platform integrations Single Sign-on Use adaptive authentication and SSO for one-click access to all your apps Multi-factor Authentication Optimize security and convenience with additional authentication factors Access Security Enable dynamic, real-time access security for apps and APIs Intelligent API Security Detect and block API cyberattacks using artificial intelligence Data Governance Manage customer privacy and consent, and meet regulatory compliance Directory Securely manage identity and profile data at scale Five Steps You Can Take to Achieve Zero Trust Access read now Security Leader's Guide to Multi-factor Authentication get the guide IDaaS for Application Developers get the white paper Get AI-powered Protection with PingIntelligence for APIs Watch the video The Ping Intelligent Identity™ Platform We provide intelligent access for customers, employees and partners so they can securely connect to cloud, mobile, SaaS and on-premises applications and APIs. Our cloud identity , private cloud identity and on-premises software solutions help you prevent security breaches, manage sensitive data and improve user engagement by optimizing both security and convenience. Single Sign-on Use adaptive authentication and SSO for one-click access to all your apps Use adaptive authentication and SSO for one-click access to all your apps Multi-factor Authentication Optimize security and convenience with additional authentication factors Optimize security and convenience with additional authentication factors Access Security Enable dynamic, real-time access security for apps and APIs Enable dynamic, real-time access security for apps and APIs Intelligent API Security Detect and block API cyberattacks using artificial intelligence Detect and block API cyberattacks using artificial intelligence Data Governance Manage customer privacy and consent, and meet regulatory compliance Manage customer privacy and consent, and meet regulatory compliance Directory Securely manage identity and profile data at scale Securely manage identity and profile data at scale Five Steps You Can Take to Achieve Zero Trust Access read now Five Steps You Can Take to Achieve Zero Trust Access Security Leader's Guide to Multi-factor Authentication get the guide Security Leader's Guide to Multi-factor Authentication IDaaS for Application Developers get the white paper IDaaS for Application Developers Get AI-powered Protection with PingIntelligence for APIs Watch the video Get AI-powered Protection with PingIntelligence for APIs what we do next-generation security through intelligent identity Identity drives security and agility in the modern enterprise. With the dissolving enterprise perimeter and the mandate for single-identity customer experiences, intelligent identity is the foundation for increasing the value of digital business initiatives. Our intelligent identity platform provides users with secure, seamless access to all their applications and resources from anywhere. Proven in scale and performance with over 2 billion identities under management, it's a comprehensive standards-based platform architected to span all deployment models and all primary use cases for wherever enterprise IT goes . about ping next-generation security through intelligent identity next-generation security through intelligent identity Identity drives security and agility in the modern enterprise. With the dissolving enterprise perimeter and the mandate for single-identity customer experiences, intelligent identity is the foundation for increasing the value of digital business initiatives. Our intelligent identity platform provides users with secure, seamless access to all their applications and resources from anywhere. Proven in scale and performance with over 2 billion identities under management, it's a comprehensive standards-based platform architected to span all deployment models and all primary use cases for wherever enterprise IT goes . industry analysts recognize our leadership KuppingerCole Leadership Compass for IDaaS SSO get the report 2019 Magic Quadrant for Access Management get the report KuppingerCole Leadership Compass for CIAM get the report industry analysts recognize our leadership KuppingerCole Leadership Compass for IDaaS SSO get the report KuppingerCole Leadership Compass for IDaaS SSO 2019 Magic Quadrant for Access Management get the report 2019 Magic Quadrant for Access Management KuppingerCole Leadership Compass for CIAM get the report KuppingerCole Leadership Compass for CIAM how we do it we solve ENTERPRISE IDENTITY CHALLENGES Our mission is to secure the digital world through Intelligent Identity. customer iam for secure, seamless digital experiences Zero Trust to reduce risk and ensure compliance identity for hybrid IT to solve for on-premises, cloud or both modernize legacy iam to lower costs and improve productivity we solve ENTERPRISE IDENTITY CHALLENGES Our mission is to secure the digital world through Intelligent Identity. customer iam for secure, seamless digital experiences for secure, seamless digital experiences Zero Trust to reduce risk and ensure compliance to reduce risk and ensure compliance identity for hybrid IT to solve for on-premises, cloud or both to solve for on-premises, cloud or both modernize legacy iam to lower costs and improve productivity to lower costs and improve productivity CUSTOMER STORIES MEDIA & ENTERTAINMENT NETFLIX Netflix provides employees and partners a rich and seamless, UI-driven sign-in. Technology HP HP reduced complexity, optimized spend and enabled new business. Manufacturing Scotts Miracle-Gro Scotts centralized identity services and increased their security posture with SSO. more stories events & webinars Feb. 19 Modernizing Legacy IAM Join us and our partner Arctic Group to discuss identity and access management. contact us Feb. 24-28 RSA Conference Be part of a conversation that has the power to change the world. more events NEWSROOM press release December 17, 2019 Ping Identity Builds and Matures Zero Trust Security Infrastructures Read now press release December 11, 2019 Ping Identity Solutions Accelerate Enterprise Multi-cloud Adoption Read now press release November 25, 2019 Ping Identity Highlights the Addition of Board Members Read now more news CUSTOMER STORIES MEDIA & ENTERTAINMENT NETFLIX Netflix provides employees and partners a rich and seamless, UI-driven sign-in. Technology HP HP reduced complexity, optimized spend and enabled new business. Manufacturing Scotts Miracle-Gro Scotts centralized identity services and increased their security posture with SSO. more stories MEDIA & ENTERTAINMENT NETFLIX Netflix provides employees and partners a rich and seamless, UI-driven sign-in. Netflix provides employees and partners a rich and seamless, UI-driven sign-in. Netflix provides employees and partners a rich and seamless, UI-driven sign-in. Technology HP HP reduced complexity, optimized spend and enabled new business. HP reduced complexity, optimized spend and enabled new business. HP reduced complexity, optimized spend and enabled new business. Manufacturing Scotts Miracle-Gro Scotts centralized identity services and increased their security posture with SSO. Scotts centralized identity services and increased their security posture with SSO. Scotts centralized identity services and increased their security posture with SSO. events & webinars Feb. 19 Modernizing Legacy IAM Join us and our partner Arctic Group to discuss identity and access management. contact us Feb. 24-28 RSA Conference Be part of a conversation that has the power to change the world. more events Feb. 19 Modernizing Legacy IAM Join us and our partner Arctic Group to discuss identity and access management. contact us Join us and our partner Arctic Group to discuss identity and access management. Join us and our partner Arctic Group to discuss identity and access management. Feb. 24-28 RSA Conference Be part of a conversation that has the power to change the world. Be part of a conversation that has the power to change the world. Be part of a conversation that has the power to change the world. NEWSROOM press release December 17, 2019 Ping Identity Builds and Matures Zero Trust Security Infrastructures Read now press release December 11, 2019 Ping Identity Solutions Accelerate Enterprise Multi-cloud Adoption Read now press release November 25, 2019 Ping Identity Highlights the Addition of Board Members Read now more news press release December 17, 2019 Ping Identity Builds and Matures Zero Trust Security Infrastructures Read now Ping Identity Builds and Matures Zero Trust Security Infrastructures Ping Identity Builds and Matures Zero Trust Security Infrastructures press release December 11, 2019 Ping Identity Solutions Accelerate Enterprise Multi-cloud Adoption Read now Ping Identity Solutions Accelerate Enterprise Multi-cloud Adoption Ping Identity Solutions Accelerate Enterprise Multi-cloud Adoption press release November 25, 2019 Ping Identity Highlights the Addition of Board Members Read now Ping Identity Highlights the Addition of Board Members Ping Identity Highlights the Addition of Board Members",
    "Ping Identity ® — The Cloud Identity Security Leader Language English (USA) Français (France) Deutsch (Germany) Solutions PING IDENTITY PRODUCTS: PingFederate PingConnect PingFederate Express PingEnable Services Cloud Identity Connectors Ping Identity CloudDesktop OUR SOLUTIONS FOR: Cloud Apps HR Applications Secure Mobile Access ArcSight Google Apps Salesforce Microsoft Environments Cisco WebEx Symantec VIP RSA SecurID PING IDENTITY PRODUCTS: PingFederate PingConnect PingFederate Express PingEnable Services Cloud Identity Connectors Ping Identity CloudDesktop OUR SOLUTIONS FOR: Cloud Apps HR Applications Secure Mobile Access ArcSight Google Apps Salesforce Microsoft Environments Cisco WebEx Symantec VIP RSA SecurID Resource Center MOST POPULAR TOPICS: The 4 A's of Cloud Identity Cloud SSO & Federated Identity SAML OpenID OAuth MOST POPULAR TOPICS: The 4 A's of Cloud Identity Cloud SSO & Federated Identity SAML OpenID OAuth Customers Customer List Case Studies Customer List Case Studies Partners SaaS Providers SIs and Resellers Partner Directory Partner Portal SaaS Providers SIs and Resellers Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center Ask A Question Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center Ask A Question Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Management Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Management Community Service Careers Contact Us Call toll free: 1.877.898.2905 Secure and Lovable Mobile Apps? Think OAuth Secure and Lovable Mobile Apps? Think OAuth for a free trial Solutions PING IDENTITY PRODUCTS: PingFederate PingConnect PingFederate Express PingEnable Services Cloud Identity Connectors Ping Identity CloudDesktop OUR SOLUTIONS FOR: Cloud Apps HR Applications Secure Mobile Access ArcSight Google Apps Salesforce Microsoft Environments Cisco WebEx Symantec VIP RSA SecurID PING IDENTITY PRODUCTS: PingFederate PingConnect PingFederate Express PingEnable Services Cloud Identity Connectors Ping Identity CloudDesktop OUR SOLUTIONS FOR: Cloud Apps HR Applications Secure Mobile Access ArcSight Google Apps Salesforce Microsoft Environments Cisco WebEx Symantec VIP RSA SecurID Resource Center MOST POPULAR TOPICS: The 4 A's of Cloud Identity Cloud SSO & Federated Identity SAML OpenID OAuth MOST POPULAR TOPICS: The 4 A's of Cloud Identity Cloud SSO & Federated Identity SAML OpenID OAuth Customers Customer List Case Studies Customer List Case Studies Partners SaaS Providers SIs and Resellers Partner Directory Partner Portal SaaS Providers SIs and Resellers Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center Ask A Question Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center Ask A Question Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Management Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Management Community Service Careers Contact Us -2012 Ping Identity Corporation",
    "Ping Identity ® — The Identity Security Company Products Next Gen Identity PingOne PingFederate PingAccess Next Gen Identity PingOne PingFederate PingAccess Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Partners PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us You've called a page that isn't on our site. Please use our site search or navigation to find what you're looking for. Products Next Gen Identity PingOne PingFederate PingAccess Next Gen Identity PingOne PingFederate PingAccess Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Partners PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us -2014 Ping Identity Corporation",
    "Ping Identity ® — The Identity Security Company Products Next Gen Identity PingOne PingFederate PingAccess Next Gen Identity PingOne PingFederate PingAccess Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Partners PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us Before you may access the requested area of our site, you must first sign on to your account. with your existing Ping account Products Next Gen Identity PingOne PingFederate PingAccess Next Gen Identity PingOne PingFederate PingAccess Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Partners PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal PingPartner Network SaaS Solution Providers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars COMPANY INFORMATION: Leadership Community Service Careers Contact Us -2014 Ping Identity Corporation",
    "Ping Identity ® — The Identity Security Company Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Resource Center MOST POPULAR TOPICS: The 4 A's of Cloud Identity SAML OpenID Connect OpenID OAuth SCIM MOST POPULAR TOPICS: The 4 A's of Cloud Identity SAML OpenID Connect OpenID OAuth SCIM Partners SaaS SIs and Resellers Technology Partner Directory Partner Portal SaaS SIs and Resellers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Leadership Community Service Careers Contact Us Web Access Management Systems By sharing credentials across multiple web applications and services, Web Access Management systems provide fine grain access control to web resources and serve as the backbone of traditional enterprise Single Sign-on solutions. Because WAM products typically manage users they become an authoritative identity source when managing identity across applications, including those in the cloud. The PingFederate ® WAM Integration, Connection Kits, and Connection Services make it easy to integrate with Web Access Management Systems, such as Oracle Access Manager, CA Siteminder, and IBM Tivoli Access Manager. WAM Integration Kit – A prebuilt adapter that allows customers or third party service providers to easily extend PingFederate to Web Access Management systems. Oracle Access Manager Connection Kit - A free, prebuilt integration included with the WAM Integration Kit to accelerate deployment of Ping Identity in Oracle environments. CA Siteminder Connection Services - A fixed price integration service delivered by qualified CA third-party service providers sold and supported by Ping Identity to accelerate deployment in CA environments IBM Tivoli Access Manager Connection Services – A fixed price PingEnable integration service from Ping Identity to accelerate deployment in IBM environments. Current on premise WAM solutions have limited capabilities to meet the emerging identity requirements. Leverage your existing investment while meeting the needs of the business in hours, not days. For more information, download the \" \" resources in the right column. < Previous : Custom Java, .NET & PHP Applications | Next: IWA. Active Directory, X.509 & LDAP > for a free trial Solutions SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS SSO for Employees SSO for Customers & Partners IDENTITY MANAGEMENT SOLUTIONS: Cloud SSO & Federated Identity API Security Secure Mobile Access Social Identity Integration Microsoft Environments Cisco Environments INDUSTRY SOLUTIONS: Financial Services Healthcare Public Sector SaaS Resource Center MOST POPULAR TOPICS: The 4 A's of Cloud Identity SAML OpenID Connect OpenID OAuth SCIM MOST POPULAR TOPICS: The 4 A's of Cloud Identity SAML OpenID Connect OpenID OAuth SCIM Partners SaaS SIs and Resellers Technology Partner Directory Partner Portal SaaS SIs and Resellers Technology Partner Directory Partner Portal Support Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Knowledge Base Solutions Product Documentation Training Center PingEnable Join a Discussion Submit An Idea Engage Your User Group Customer Portal Downloads Products Request a License Key Products Request a License Key About Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Leadership Community Service Careers Contact Us NEWS & EVENTS: Press Room Events & Webinars Ping eNews COMPANY INFORMATION: Leadership Community Service Careers Contact Us -2013 Ping Identity Corporation"
  ]
}