{
  "company": "www.sukshi.com",
  "dominant_topics": [
    3,
    -1,
    2,
    0
  ],
  "topic_counts": {
    "3": 1,
    "-1": 1,
    "2": 1,
    "0": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis",
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0851063829787234,
    "framing_surveillance": 0.0851063829787234,
    "framing_market": 0.8297872340425532,
    "num_docs": 4
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1,
      "2": 1,
      "3": 1
    }
  },
  "sample_docs": [
    "Humans are born with emotional intelligence (EI) comprising of two skills: emotional awareness and management, thinking and problem-solving. Emotional intelligence is sometimes referred to as emotional quotient (EQ). Sukshi believes in embedding machines with EQ to develop Emotional Artificial intelligence and help to provide considerable value in different applications such as e-commerce, customer services, health, education, etc. Our main focus is to research and create new algorithms that go beyond deep learning which perform cognitive tasks similar to a human brain. OUR VISION Induce an emotional connection into every human-machine interaction. Humans are born with emotional intelligence (EI) comprising of two skills: emotional awareness and management, thinking and problem-solving. Emotional intelligence is sometimes referred to as emotional quotient (EQ). Sukshi believes in embedding machines with EQ to develop Emotional Artificial intelligence and help to provide considerable value in different applications such as e-commerce, customer services, health, education, etc. Our main focus is to research and create new algorithms that go beyond deep learning which perform cognitive tasks similar to a human brain. Induce an emotional connection into every human-machine interaction. Create a platform that understands and responds to a user, According to their personality and psychology profile using text, audio and video. OUR MISSION Create a platform that understands and responds to a user, According to their personality and psychology profile using text, audio and video. LIFE AT SUKSHI We believe that the solutions to all the puzzles can be found within us and we enjoy the journey to solve real-world problems. We constantly strive to become a better version of ourselves both professionally and personally. We like to build stuff right from scratch. We are hungry to learn, explore, grow and help others grow along with us. Our hunger helps us to take on impossible challenges. Organizations trust us because of our accurate AI solutions for large scale applications. We work hard and we are serious about what we do. We have casual dress code & family-like work culture. We love to meet and interact with new people who chase their passion wholeheartedly. We intend to make a positive contribution to the world by providing opportunities to the right people. We believe that the solutions to all the puzzles can be found within us and we enjoy the journey to solve real-world problems. We constantly strive to become a better version of ourselves both professionally and personally. We like to build stuff right from scratch. We are hungry to learn, explore, grow and help others grow along with us. Our hunger helps us to take on impossible challenges. Organizations trust us because of our accurate AI solutions for large scale applications. We work hard and we are serious about what we do. We have casual dress code & family-like work culture. We love to meet and interact with new people who chase their passion wholeheartedly. We intend to make a positive contribution to the world by providing opportunities to the right people. ARE YOU THE ONE WE ARE LOOKING FOR? We invite everyone who wants an opportunity to explore in and out with open arms. We are looking for people who are honest, ambitious and have strong work ethics. Get ready to explore, learn and work in one of the successful AI-based startups. Apply Now ARE YOU THE ONE WE ARE LOOKING FOR? We invite everyone who wants an opportunity to explore in and out with open arms. We are looking for people who are honest, ambitious and have strong work ethics. Get ready to explore, learn and work in one of the successful AI-based startups. SUKSHIANS MEET OUR TEAM Meet our team of great warriors, ready to harness the force for good. Every one of us shares the same vision and values as the company. The solutions are not outside of us. Get to know who you really are, because as you search for the hero within, you inevitably become one. SRIDHAR TIRUMALA SHIVANI PULIMAMIDI Meet our team of great warriors, ready to harness the force for good. Every one of us shares the same vision and values as the company. The solutions are not outside of us. Get to know who you really are, because as you search for the hero within, you inevitably become one. Ribhu Ranjan Saha Reenath Thummala Bhargav Velemala Purushotham Rao Eravalli Hareesh Babu Sathu Manoj Vardhan Reddy Shashank Pashikanti Noah Naveen Rahul Muthyam Avanthi Naga Vamshi Krishna Debashish Mohanty Santhosh Kumar Madupu Nikhil Chanda Dinesh Gannapuram Load More",
    "Your browser does not support the video tag. Our core product line Our Innovative Products Vision Containers Out-of-the-box vision containers with simplified customizations for the diverse needs of our customers. Highly customizable for various vision applications and adaptable across various cloud services including Google Cloud Platform, Microsoft Azure, Oracle Cloud and AWS. Vision Models State of Art Machine Learning & Vision AI models built on top of Deep Neural Networks to solve several problems for business and end-users to transforming their living. Bunch of these vision models supply towards building innovative vision technologies at Sukshi. Turing Machine Human-Machine synchronized ecosystem for continuous improvement of Vision Models. Turing Machine, One of our core products in delivering the vision AI as a service, plays an important role in the post process of data that goes through our platform. Data Curation Services A Human-Machine cycle of bucketing, labeling & monitoring the production data using Turing Machine, Provides Data Curation as a service. This ecosystem indulges in the curation of real-time data to enhance vision AI models running in production. Our core product line Out-of-the-box vision containers with simplified customizations for the diverse needs of our customers. Highly customizable for various vision applications and adaptable across various cloud services including Google Cloud Platform, Microsoft Azure, Oracle Cloud and AWS. State of Art Machine Learning & Vision AI models built on top of Deep Neural Networks to solve several problems for business and end-users to transforming their living. Bunch of these vision models supply towards building innovative vision technologies at Sukshi. Human-Machine synchronized ecosystem for continuous improvement of Vision Models. Turing Machine, One of our core products in delivering the vision AI as a service, plays an important role in the post process of data that goes through our platform. A Human-Machine cycle of bucketing, labeling & monitoring the production data using Turing Machine, Provides Data Curation as a service. This ecosystem indulges in the curation of real-time data to enhance vision AI models running in production. Our Core product Vision Containers Highly customizable for various vision applications. On-demand scalability with quick bring-up time. Adaptable across various cloud services such as Google Cloud Platform, Microsoft Azure, Oracle Cloud, and AWS. Massively Scalable, Customizable & Cloud Agnostic Vision Containers Digital KYC Embeds technologies like Fraud, Spoof Detection, OCR, Face Recognition and Liveness Detection (Image & Video could be source) to make KYC process more secure & feasible for onboarding customers. Mark Your Attendance Comprises of Facial Recognition and Face Liveness technologies in performing Facial Biometric based attendance for corporate employees. Edge Intelligence Provides customized Facial Recognition & Liveness Detection on the edge with low cost & high performance for applications related to Site Reliability Engineering. Deduplication Identification of duplicate customers while on-boarding new customers using Facial Biometrics. Video KYC Provides services such as Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection in the video conference between the agent and remote customer during the KYC process of customer on-boarding. Virtual Technician Assistant Object Detection technology applied to assist on-field technicians to extract online information efficiently. Health Care Pose Estimation technology is embedded in delivering smart approaches for authorised Government agents who are funded to treat tuberculosis patients. Pose Estimation, Facial Recognition & Liveness Detection are used to check the authenticity of the patients taking medication. EAI Comprises of technologies like Emotion & Personality Detection for transforming AI into EAI (Emotion induced AI). Highly customizable for various vision applications. On-demand scalability with quick bring-up time. Adaptable across various cloud services such as Google Cloud Platform, Microsoft Azure, Oracle Cloud, and AWS. Massively Scalable, Customizable & Cloud Agnostic Vision Containers Embeds technologies like Fraud, Spoof Detection, OCR, Face Recognition and Liveness Detection (Image & Video could be source) to make KYC process more secure & feasible for onboarding customers. Comprises of Facial Recognition and Face Liveness technologies in performing Facial Biometric based attendance for corporate employees. Provides customized Facial Recognition & Liveness Detection on the edge with low cost & high performance for applications related to Site Reliability Engineering. Identification of duplicate customers while on-boarding new customers using Facial Biometrics. Provides services such as Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection in the video conference between the agent and remote customer during the KYC process of customer on-boarding. Object Detection technology applied to assist on-field technicians to extract online information efficiently. Pose Estimation technology is embedded in delivering smart approaches for authorised Government agents who are funded to treat tuberculosis patients. Pose Estimation, Facial Recognition & Liveness Detection are used to check the authenticity of the patients taking medication. Comprises of technologies like Emotion & Personality Detection for transforming AI into EAI (Emotion induced AI). OUR CORE PRODUCT TURING MACHINE Human-Machine synchronized ecosystem for continuous improvement of Vision Models. Turing Machine, One of the core products in delivering the vision AI as a service, plays an important role in the post process of data that goes through our platform where the curation of real-time data transactions happen concerning all the vision AI models, followed by setting up the curated data for retraining the model for building highly accurate vision AI models. Human-Machine synchronized ecosystem for continuous improvement of Vision Models. Turing Machine, One of the core products in delivering the vision AI as a service, plays an important role in the post process of data that goes through our platform where the curation of real-time data transactions happen concerning all the vision AI models, followed by setting up the curated data for retraining the model for building highly accurate vision AI models. OUR CORE PRODUCT DATA CURATION SERVICES Human-Machine cycle of bucketing, labeling & monitoring the production data using Turing Machine. The services are provided by women with our intent to empower them. The purpose is to transform potential women into professional data, application engineers & associates to have an unbiased humans/data engineers who help to create an accurate and quality data for training the base & accurate vision AI models. This ecosystem indulges in the curation of real-time data intending to enhance the vision AI models running in production. Human-Machine cycle of bucketing, labeling & monitoring the production data using Turing Machine. The services are provided by women with our intent to empower them. The purpose is to transform potential women into professional data, application engineers & associates to have an unbiased humans/data engineers who help to create an accurate and quality data for training the base & accurate vision AI models. This ecosystem indulges in the curation of real-time data intending to enhance the vision AI models running in production. MAN-MACHINE SYNCHRONIZED Ecosystem Built on top of Core Products Ecosystem Built on top of Core Products Our innovative Technologies Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant learning to research, develop, design, test & evaluate, followed by reprocessing to adapt and evolve. View projects Facial Recognition Facial recognition technology uses an application to create a template by analyzing images of human face in order to identify and to verify a person's identity. Know More Face Liveness Face Liveness is one of our robust vision technologies built to detect fake presence of a person as an application to authorize a person's identity. Know More Emotion Detection Detecting emotions of a human being can be achieved using facial image, voice, body shape etc. Know More Personality Detection Personality detection models are very useful in various domains like e-learning, Know More Document Identifiable Intelligence One of core technologies built for powering robust solutions for Digital KYC use cases in the current market. Know More Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant learning to research, develop, design, test & evaluate, followed by reprocessing to adapt and evolve. Facial recognition technology uses an application to create a template by analyzing images of human face in order to identify and to verify a person's identity. Face Liveness is one of our robust vision technologies built to detect fake presence of a person as an application to authorize a person's identity. Detecting emotions of a human being can be achieved using facial image, voice, body shape etc. Personality detection models are very useful in various domains like e-learning, One of core technologies built for powering robust solutions for Digital KYC use cases in the current market. Performance Metrics Our solutions are highly scalable and robust in serving different solutions such as Digital KYC, Attendance Managements, Access Control Solutions, Health Care & so forth, to millions of end-users all over India. Almost 25% of the data that has flowed through the entire ecosystem is securely stored and is curated for delivering progressive, robust & high accurate vision AI Models. Know more Customer Onboarding 50000000 USERS Marking Attendance 35000000 USERS API Calls 60000 HITS Turing Transactions 35000000 CASES Our solutions are highly scalable and robust in serving different solutions such as Digital KYC, Attendance Managements, Access Control Solutions, Health Care & so forth, to millions of end-users all over India. Almost 25% of the data that has flowed through the entire ecosystem is securely stored and is curated for delivering progressive, robust & high accurate vision AI Models. Our Client Use Cases At Jio Reliance Jio, Our first customer is consuming our massively scalable, customizable containers serving 50 million customers, counting 3 Million API calls per day across PAN INDIA Retail POS Digital KYC container to onboard retail customers. MAttendance Mark Your Attendance container to provide Facial Recognition based attendance solutions for Reliance Corporates. Enterprise POS Digital KYC container to onboard enterprise customers. Jio Payments Bank Digital KYC container to onboard banking customers. Access Control Systems Edge Intelligence container for low cost & high performance check-in/check-outs of corporate employees. Jio Beat Planner Mark Your Attendance container to validate check-in/check-outs of sales executives of retail & wholesale businesses. Jio Smart ID Digital KYC container to create a Jio ID for a customer to use Jio ID services. Jio Learning Management System Virtual Technical Assistant container for upskill corporates to suggest learning courses related to detected/suggested objects for on-field employees. Tuberculosis Healthcare container to provide smart solution for checking authenticity of patients taking medication from authorized Government centers who are funded for a cause to treat tuberculosis patients. Use Cases At Jio Reliance Jio, Our first customer is consuming our massively scalable, customizable containers serving 50 million customers, counting 3 Million API calls per day across PAN INDIA Digital KYC container to onboard retail customers. Mark Your Attendance container to provide Facial Recognition based attendance solutions for Reliance Corporates. Digital KYC container to onboard enterprise customers. Digital KYC container to onboard banking customers. Edge Intelligence container for low cost & high performance check-in/check-outs of corporate employees. Mark Your Attendance container to validate check-in/check-outs of sales executives of retail & wholesale businesses. Digital KYC container to create a Jio ID for a customer to use Jio ID services. Jio Learning Management System Virtual Technical Assistant container for upskill corporates to suggest learning courses related to detected/suggested objects for on-field employees. Healthcare container to provide smart solution for checking authenticity of patients taking medication from authorized Government centers who are funded for a cause to treat tuberculosis patients. BUSINESS COLLABORATION CONTACT US Are you willing to bring AI into your existing solutions? If so, please drop your requirements below and we will reach you out. Are you willing to bring AI into your existing solutions? If so, please drop your requirements below and we will reach you out. Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant processes of learning and unlearning to research, develop, design, test & evaluate, followed by reprocess to adaptable and evolve.",
    "Your browser does not support the video tag. Delivering Progressive, Scalable Vision AI know More About US Our Core product Vision Containers Highly customizable for various vision applications. On-demand scalability with quick bring-up time. Adaptable across various cloud services such as Google Cloud Platform, Microsoft Azure, Oracle Cloud, and AWS. know More Massively Scalable, Customizable & Cloud Agnostic Vision Containers Digital KYC Embeds technologies like Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection (Image & Video could be source) to make KYC process more secure & feasible for onboarding customers. Mark Your Attendance Comprises of Facial Recognition and Face Liveness technologies in performing Facial Biometric based attendance for corporate employees. Edge Intelligence Provides customized Facial Recognition & Liveness Detection on the edge with low cost & high performance for applications related to Site Reliability Engineering. Deduplication Identification of duplicate customers while on-boarding new customers using Facial Biometrics. Video KYC Provides services such as Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection in the video conference between the agent and remote customer during the KYC process of customer on-boarding. Virtual Technician Assistant Object Detection technology applied to assist on-field technicians to extract online information efficiently. Health Care Pose Estimation technology is embedded in delivering smart approaches for authorised Government agents who are funded to treat tuberculosis patients. Pose Estimation, Facial Recognition & Liveness Detection are used to check the authenticity of the patients taking medication. EAI Comprises of technologies like Emotion & Personality Detection for transforming AI into EAI (Emotion induced AI). Highly customizable for various vision applications. On-demand scalability with quick bring-up time. Adaptable across various cloud services such as Google Cloud Platform, Microsoft Azure, Oracle Cloud, and AWS. Massively Scalable, Customizable & Cloud Agnostic Vision Containers Embeds technologies like Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection (Image & Video could be source) to make KYC process more secure & feasible for onboarding customers. Comprises of Facial Recognition and Face Liveness technologies in performing Facial Biometric based attendance for corporate employees. Provides customized Facial Recognition & Liveness Detection on the edge with low cost & high performance for applications related to Site Reliability Engineering. Identification of duplicate customers while on-boarding new customers using Facial Biometrics. Provides services such as Fraud , Spoof Detection, OCR, Face Recognition and Liveness Detection in the video conference between the agent and remote customer during the KYC process of customer on-boarding. Object Detection technology applied to assist on-field technicians to extract online information efficiently. Pose Estimation technology is embedded in delivering smart approaches for authorised Government agents who are funded to treat tuberculosis patients. Pose Estimation, Facial Recognition & Liveness Detection are used to check the authenticity of the patients taking medication. Comprises of technologies like Emotion & Personality Detection for transforming AI into EAI (Emotion induced AI). Our innovative Technologies Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant learning to research, develop, design, test & evaluate, followed by reprocessing to adapt and evolve. View projects Facial Recognition Facial recognition technology uses an application to create a template by analyzing images of human face in order to identify and to verify a person's identity. Know More Face Liveness Face Liveness is one of our robust vision technologies built to detect fake presence of a person as an application to authorize a person's identity. Know More Emotion Detection Detecting emotions of a human being can be achieved using facial image, voice, body shape etc. Know More Personality Detection Personality detection models are very useful in various domains like e-learning, Know More Document Identifiable Intelligence One of core technologies built for powering robust solutions for Digital KYC use cases in the current market. Know More Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant learning to research, develop, design, test & evaluate, followed by reprocessing to adapt and evolve. Facial recognition technology uses an application to create a template by analyzing images of human face in order to identify and to verify a person's identity. Face Liveness is one of our robust vision technologies built to detect fake presence of a person as an application to authorize a person's identity. Detecting emotions of a human being can be achieved using facial image, voice, body shape etc. Personality detection models are very useful in various domains like e-learning, One of core technologies built for powering robust solutions for Digital KYC use cases in the current market. Performance Metrics Our solutions are highly scalable and robust in serving different solutions such as Digital KYC, Attendance Managements, Access Control Solutions, Health Care & so forth, to millions of end-users all over India. Almost 25% of the data that has flowed through the entire ecosystem is securely stored and is curated for delivering progressive, robust & high accurate vision AI Models. Know more Customer Onboarding 50000000 USERS Marking Attendance 35000000 USERS API Calls 60000 HITS Turing Transactions 35000000 CASES Our solutions are highly scalable and robust in serving different solutions such as Digital KYC, Attendance Managements, Access Control Solutions, Health Care & so forth, to millions of end-users all over India. Almost 25% of the data that has flowed through the entire ecosystem is securely stored and is curated for delivering progressive, robust & high accurate vision AI Models. sukshi.org Institute of sukshi An intensive course created with a collaborative effort of seasoned professionals from various dimensions of life to provide a platform that enables the pursuit of excellence through inner-transformation to yield the creation of innovative technologies. Know more MYKUSHI.COM DATA CURATION CENTER An AI-driven data curation technology platform that is powered by women with an intent of inner transformation which enables them to lead a well balanced and economically self-sufficient lives. Know more An intensive course created with a collaborative effort of seasoned professionals from various dimensions of life to provide a platform that enables the pursuit of excellence through inner-transformation to yield the creation of innovative technologies. An AI-driven data curation technology platform that is powered by women with an intent of inner transformation which enables them to lead a well balanced and economically self-sufficient lives. Careers Current Openings As an innovation-driven technology company we look forward to meeting people who are willing to expose themselves to our multidimensional ecosystem with a sense of resilience, perseverance and versatility. For us, qualification is just another template. So, we wish to meet the real you who wish to sail in the boat of Sukshi. Know more As an innovation-driven technology company we look forward to meeting people who are willing to expose themselves to our multidimensional ecosystem with a sense of resilience, perseverance and versatility. For us, qualification is just another template. So, we wish to meet the real you who wish to sail in the boat of Sukshi. Innovation is our driving force and we at Sukshi have introduced it in our DNA with constant learning to research, develop, design, test & evaluate, followed by reprocessing to adapt and evolve.",
    "DATA SECURITY POLICY Introduction This document is an electronic record in of the Information Technology Act, 2000 and rules there under as applicable and the provisions pertaining to electronic records in various statutes as amended by the Information Technology Act, 2000. This electronic record is generated by a computer system and does not require any physical or digital signatures to make the of this policy binding. SUKSHI TECHNOLOGY INNOVATION PRIVATE LIMITED, a private limited company incorporated under the provisions of the Companies Act, 2013, having its registered office at H. No. 2-1-57/A/6/NR, Third Floor, Surya Nagar Colony, Uppal Hyderabad TG 500039 IN, represented by its authorized signatory Mr./Ms. [______], (\"Sukshi†or \"Company†where such expression shall, unless repugnant to the context thereof, be deemed to include its respective legal heirs, representatives, administrators, permitted successors, and assigns). The creation of this ensures our steady commitment to Your privacy with regard to the protection of Your invaluable information. Sukshi values the trust You place in the Company. The Company insists upon the highest standards for secure services and customer information privacy. Please read the following statement to learn about Website/App information gathering and dissemination practices. This protects the information collected through the Website with domain name www.Sukshi.com and __________ (name of the App if applicable) referred to as \"Website/App†or \"Siteâ€. The Company shall herein be referred to as \"Weâ€, \"Ourâ€, \"Us†and you, the person accessing the Website/App shall herein be referred to as \"Youâ€, \"Yourâ€, \"Yourselfâ€, \"Userâ€. In order to provide with Our uninterrupted use of services We may collect and, in some circumstances, disclose information about You. To ensure better protection of Your privacy, we provide this notice explaining Our information collection and disclosure policies, and the choices, You make about the way Your information is collected and used. We understand clearly that Your personal information is one of the most important assets. The Website/App stores and processes Your information including any sensitive information collected (as defined under the Information Technology Act, 2000), if any, on computers that may be protected by physical as well as reasonable technological security measures and procedures in accordance with Information Technology Act 2000 and Rules there under. If You object to your information being transferred or used in this way, please do not use the Website/App. By mere use of the Website/App, You expressly consent to Website/App use and disclosure of Your personal information in accordance with this . This is incorporated into and subject to the & conditions. \"Personal Information†shall mean and refer to any personally identifiable information that We may collect from You. \"Third Parties†in regard to this refer to any website/application, company or individual apart from the User and the creator of the Website/Application. This (Private Policy\") describes how we may use and disclose personally identifiable information that we may collect about You through the Website (\"Personal Informationâ€). We insist upon the highest standards for secure transactions and customer information privacy. Please read the following statement to learn about our information gathering and dissemination practices. This Website is hosted on our Website servers in Mumbai, India. Personal Information will be stored through an electronic system of Sukshi that is located at the Hyderabad Servers. If you are located in a territory outside India, please note that you will be transferring your Personal Information to India and other jurisdictions. Our is subject to change at any time without notice. To make sure you are aware of any changes, please review this policy periodically. By using our Services or visiting this Website, You agree to be bound by the of this . If You do not agree please do not use, install or access our Website COLLECTIONS AND USES OF PERSONAL INFORMATION When You use or register with the Website, we may collect certain Personal Information about You which is essential to drive our business and deliver the services. The categories of Personal Information we may request include but are not limited to Your name, Your job title, Your company's name and industry sector, Your company's location (country, state, and zip code) and Your contact information (email and phone number). Depending on the nature of your inquiry or activities on the Site, we may also obtain information about Your professional interests through white papers or newsletters you request, as well as professional interests that You specifically describe to us. Providing Personal Information is necessary for the performance of the services and functionalities offered by the Site. If you decline to provide the requisite Personal Information, we may not be able to process Your Inquiry or other requests. USER DATA Sukshi will maintain certain data that you transmit to the Site to facilitate your smooth and uninterrupted use of the Website/App. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Website/App. You agree that we shall have no liability to You for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data. COOKIES The Site also utilizes cookies to track your online activities, including your registration, submissions, and information requests, in accordance with applicable law. Cookies are files placed on your computer by a website server. Cookies on this Site do not collect Personal Information, but we do track your online activities and may link that information with the Personal Information you have provided us through online registration. Your web browser may be set to accept cookies automatically but can be changed to decline them. The Help section of the toolbar on most browsers will tell you how to set your browser to prevent accepting new cookies, how to have the browser notify you when you receive a new cookie or how to disable cookies altogether. Please note that if you decline to accept cookies, then when and if you choose to download materials from the Site, You may be required to register each time you download materials from the Site. ADVERTISEMENTS/MARKETING We use Personal Information and other data collected through the Site to register you with the Site and to otherwise provide you with requested information or services. We may also from time to time use your Personal Information to send you automated email messages or marketing materials regarding our services. These email messages may contain web beacons and other features that help us make sure that you received and were able to open the message. You may opt-out of receiving such marketing email messages at any time by sending a message with \"unsubscribe†in the subject line to info@sukshi.com, or by following the instructions in any marketing communication. DISCLOSURES OF PERSONAL INFORMATION As described in the of use, We may disclose Personal Information to third parties. The disclosure to third parties would occur in the following circumstances: We may disclose Personal Information to our affiliates in your local jurisdiction or other locations as necessary or appropriate to provide the product or service you requested, to contact you in connection with product or service offerings, or for other legitimate business purposes. The names and addresses of our affiliates are provided at the end of this Policy. We may disclose information to companies and individuals we employ to perform business functions and services on our behalf. Such functions may include hosting our Web servers, analyzing data, providing legal, accounting, and marketing services, and providing other support services. All such parties will be under obligation to maintain the security and confidentiality of the Personal Information and to process the data in accordance with our instructions. We may disclose Personal Information to the extent necessary or appropriate to government agencies, advisors, and other third parties in order to comply with applicable laws, or if such action is necessary to protect the rights or property of Sukshi or its affiliated companies. PERSONAL DATA SECURITY AND CONFIDENTIALITY We maintain adequate technical and organizational security measures to protect Personal Information from loss, misuse, and unauthorized access, disclosure, alteration, or destruction PERSONAL DATA ACCESS AND CORRECTION We will provide access to, update and amend, and/or delete the Personal Information in accordance with applicable laws. You can request access to, and have the opportunity to update and amend your Personal Information, and, you can exercise the other rights acknowledged by applicable data protection legislation, including, for example, objection to and blocking of the processing of your Personal Information, by contacting us at info@sukshi.com or by sending a letter to Attn: ____________. For security reasons, We reserve the right to take steps to authenticate the identity of the requesting party before providing access to Personal Information in accordance with this section of the . INFORMATION COLLECTED Account Data: We collect all the information provided during the registration/signup on the Website /App for use of the services provided by the Company through the Website/App. The information collected for the registration/signup shall be your name, address, telephone number, fax number, email and etc. This is to enforce the agreement between You and the Company, to ensure that You are reachable by potential trade partners, or to troubleshoot problems with Your account. Hidden Data: In addition to Your account data, We also collect information recorded when You browse and visit our Website/App, including but not limited to, cookies, IP address, etc. This information is not used to identify You, but for the necessary purpose to avoid being attacked by hackers, and for the purpose of making customized content services to Users. Additionally, through processing comprehensive statistical analysis, we are endeavoring to provide You with more and more efficient functionalities to facilitate Our service. To visit www.Sukshi.com, Your browser has to be configured to accept cookies. EXTERNAL LINKS ON THE WEBSITE/APP The Website/App may include hyperlinks to other websites, content or resources. We have no control over such external links present in the Website/App, which are provided by persons or companies other than Sukshi. You acknowledge and agree that, We are not responsible for any collection or disclosure of Your Personal Information by any external sites, Websites/App, companies or persons, nor do We endorse any advertising, products or other material on or available from such external Websites/App, websites or resources You further acknowledge and agree that We are not liable for any loss or damage which may be incurred by You as a result of the collection and/or disclosure of Your personal information by external Websites/App, sites or resources, or as a result of any reliance placed by You on the completeness, accuracy or existence of any advertising, products or other materials on, or available from such Websites/App. This external Website/App, websites and resource providers may have their own Privacy Policies governing the collection, storage, retention and disclosure of Your Personal Information that You may be subject to. We recommend that You enter the external Website/App or website and review their . OUR USE OF YOUR INFORMATION Our primary goal in collecting user information is to understand your project or business needs and to enhance Your experience on Our Website/App. Providing personal information is necessary for the performance of the services and functionalities offered by the Website/App. We achieve this goal by, among other things, providing interactive communications such as our newsletters to the e-mail address that You provide to Us. Sukshi may also disclose information about Our Users when We believe, in good faith, that the disclosure is required by law. Please be aware that Sukshi may sponsor advertisers or websites that have links on Our web/other publications. The information practices of those parties and Web sites linked to Sukshi are not covered by this privacy statement. DISCLOSURE OF YOUR INFORMATION TO THIRD PARTIES Due to the existing regulatory environment, We cannot ensure that all of Your Personal Information shall never be disclosed in ways other than those described in this . Although We use industry-standard practices to protect your privacy, We do not promise, and You should not expect, that Your personally identifiable information or private communications would always remain private. External Service Providers: There may be a number of services offered by external service providers that help You use our Website/App. If You choose to use these optional services, and in the course of doing so, disclose information to the external service providers, and/or grant them permission to collect information about You, then their use of Your information is governed by their . Other Corporate Entities: We share much of Our data, including Your Personal Information, with Our parent and/or subsidiaries that are committed to serving Your needs through use of Our Website/App and related services, throughout the world. Such data shall be shared for the sole purpose of enhancing Your experience of using the Website/App. To the extent that these entities have access to Your information, they shall treat it at least as protectively as they treat information they obtain from their other members. It is possible that We and/or its subsidiaries, or any combination of such, could merge with or be acquired by another business entity. In any such combination, we may share some or all of your information in order to continue to provide the service. You shall receive notice of such event (to the extent it occurs). Law and Order: We cooperate with law enforcement inquiries, as well as other third parties to enforce laws, such as: intellectual property rights, fraud and other rights. We can, and You so authorize Us, disclose Your Personal Information to law enforcement and other government officials as We, in Our sole discretion, believe necessary or appropriate, in connection with an investigation of fraud, intellectual property infringements, or other activity that is illegal or may expose Us or You to any legal liability. Any information that You make publicly available on the site may be potentially viewed by any party, and by posting such material it is deemed that You consent to share such information with such parties. CHILDREN'S PRIVACY Our Site is not meant to be used by children, and we do not knowingly solicit or collect personal information from persons under the age of 18 (eighteen). If we find out that a child has given us personal information, we will take steps to delete that information and terminate the relevant user account. AMENDMENT Sukshi may update this from time to time in order to reflect, for example, changes to Sukshi Private Limited services or for other operational, legal or regulatory reasons. If the User would like to access, correct, amend, remove or limit the use or disclosure of any Personal Information that has been collected and stored by Website/App, the User shall notify Sukshi at the provided contact address listed in this policy for Sukshi to consider and respond to the Users request in accordance with applicable law. For any such query of modification raised, Sukshi will respond to Users request within 48 hours. The User can always opt not to disclose information. However, if the User elects to do so, Sukshi maybe, not be able to provide the services through the Website/App. DATA INTEGRITY The Website/App will only process personal information in a way that is compatible with and relevant to the services rendered for the purpose for which it is collected or authorized to be collected by User. To the extent necessary for those purposes, Sukshi may take reasonable steps to ensure that Personal Information is accurate, complete, current and reliable for its intended use. CONSENT By using the Website/App or by providing information, the User consents to the collection and use of the information in accordance with this , including but not limited to the User's consent for sharing the information as per this . If Sukshi decides to change the , it may post those changes on the App page so that Users are always aware of what information Sukshi collects, how is it used, and under what circumstances it is disclosed. CONTACT US For more information about our privacy practices, if Users has questions, queries, concerns or feedbacks, if the User would like to make a complaint, please contact us by e-mail at info@sukshi.com. REVISIONS TO THE POLICY If we change this Policy, we will post any updates here for your review. If we change material in this Policy, we will provide notice of the revised policy for 30 days on the home page at www.Sukshi.com with a link back to this page. We will also take other steps as necessary depending on the nature of the changes, including obtaining your consent where required by local data protection laws, or providing you with the opportunity to delete your Personal Information. This document is an electronic record in of the Information Technology Act, 2000 and rules there under as applicable and the provisions pertaining to electronic records in various statutes as amended by the Information Technology Act, 2000. This electronic record is generated by a computer system and does not require any physical or digital signatures to make the of this policy binding. SUKSHI TECHNOLOGY INNOVATION PRIVATE LIMITED, a private limited company incorporated under the provisions of the Companies Act, 2013, having its registered office at H. No. 2-1-57/A/6/NR, Third Floor, Surya Nagar Colony, Uppal Hyderabad TG 500039 IN, represented by its authorized signatory Mr./Ms. [______], (\"Sukshi†or \"Company†where such expression shall, unless repugnant to the context thereof, be deemed to include its respective legal heirs, representatives, administrators, permitted successors, and assigns). The creation of this ensures our steady commitment to Your privacy with regard to the protection of Your invaluable information. Sukshi values the trust You place in the Company. The Company insists upon the highest standards for secure services and customer information privacy. Please read the following statement to learn about Website/App information gathering and dissemination practices. This protects the information collected through the Website with domain name www.Sukshi.com and __________ (name of the App if applicable) referred to as \"Website/App†or \"Siteâ€. The Company shall herein be referred to as \"Weâ€, \"Ourâ€, \"Us†and you, the person accessing the Website/App shall herein be referred to as \"Youâ€, \"Yourâ€, \"Yourselfâ€, \"Userâ€. In order to provide with Our uninterrupted use of services We may collect and, in some circumstances, disclose information about You. To ensure better protection of Your privacy, we provide this notice explaining Our information collection and disclosure policies, and the choices, You make about the way Your information is collected and used. We understand clearly that Your personal information is one of the most important assets. The Website/App stores and processes Your information including any sensitive information collected (as defined under the Information Technology Act, 2000), if any, on computers that may be protected by physical as well as reasonable technological security measures and procedures in accordance with Information Technology Act 2000 and Rules there under. If You object to your information being transferred or used in this way, please do not use the Website/App. By mere use of the Website/App, You expressly consent to Website/App use and disclosure of Your personal information in accordance with this . This is incorporated into and subject to the & conditions. \"Personal Information†shall mean and refer to any personally identifiable information that We may collect from You. \"Third Parties†in regard to this refer to any website/application, company or individual apart from the User and the creator of the Website/Application. This (Private Policy\") describes how we may use and disclose personally identifiable information that we may collect about You through the Website (\"Personal Informationâ€). We insist upon the highest standards for secure transactions and customer information privacy. Please read the following statement to learn about our information gathering and dissemination practices. This Website is hosted on our Website servers in Mumbai, India. Personal Information will be stored through an electronic system of Sukshi that is located at the Hyderabad Servers. If you are located in a territory outside India, please note that you will be transferring your Personal Information to India and other jurisdictions. Our is subject to change at any time without notice. To make sure you are aware of any changes, please review this policy periodically. By using our Services or visiting this Website, You agree to be bound by the of this . If You do not agree please do not use, install or access our Website COLLECTIONS AND USES OF PERSONAL INFORMATION When You use or register with the Website, we may collect certain Personal Information about You which is essential to drive our business and deliver the services. The categories of Personal Information we may request include but are not limited to Your name, Your job title, Your company's name and industry sector, Your company's location (country, state, and zip code) and Your contact information (email and phone number). Depending on the nature of your inquiry or activities on the Site, we may also obtain information about Your professional interests through white papers or newsletters you request, as well as professional interests that You specifically describe to us. Providing Personal Information is necessary for the performance of the services and functionalities offered by the Site. If you decline to provide the requisite Personal Information, we may not be able to process Your Inquiry or other requests. Sukshi will maintain certain data that you transmit to the Site to facilitate your smooth and uninterrupted use of the Website/App. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Website/App. You agree that we shall have no liability to You for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data. The Site also utilizes cookies to track your online activities, including your registration, submissions, and information requests, in accordance with applicable law. Cookies are files placed on your computer by a website server. Cookies on this Site do not collect Personal Information, but we do track your online activities and may link that information with the Personal Information you have provided us through online registration. Your web browser may be set to accept cookies automatically but can be changed to decline them. The Help section of the toolbar on most browsers will tell you how to set your browser to prevent accepting new cookies, how to have the browser notify you when you receive a new cookie or how to disable cookies altogether. Please note that if you decline to accept cookies, then when and if you choose to download materials from the Site, You may be required to register each time you download materials from the Site. We use Personal Information and other data collected through the Site to register you with the Site and to otherwise provide you with requested information or services. We may also from time to time use your Personal Information to send you automated email messages or marketing materials regarding our services. These email messages may contain web beacons and other features that help us make sure that you received and were able to open the message. You may opt-out of receiving such marketing email messages at any time by sending a message with \"unsubscribe†in the subject line to info@sukshi.com, or by following the instructions in any marketing communication. DISCLOSURES OF PERSONAL INFORMATION As described in the of use, We may disclose Personal Information to third parties. The disclosure to third parties would occur in the following circumstances: We may disclose Personal Information to our affiliates in your local jurisdiction or other locations as necessary or appropriate to provide the product or service you requested, to contact you in connection with product or service offerings, or for other legitimate business purposes. The names and addresses of our affiliates are provided at the end of this Policy. We may disclose information to companies and individuals we employ to perform business functions and services on our behalf. Such functions may include hosting our Web servers, analyzing data, providing legal, accounting, and marketing services, and providing other support services. All such parties will be under obligation to maintain the security and confidentiality of the Personal Information and to process the data in accordance with our instructions. We may disclose Personal Information to the extent necessary or appropriate to government agencies, advisors, and other third parties in order to comply with applicable laws, or if such action is necessary to protect the rights or property of Sukshi or its affiliated companies. PERSONAL DATA SECURITY AND CONFIDENTIALITY We maintain adequate technical and organizational security measures to protect Personal Information from loss, misuse, and unauthorized access, disclosure, alteration, or destruction PERSONAL DATA ACCESS AND CORRECTION We will provide access to, update and amend, and/or delete the Personal Information in accordance with applicable laws. You can request access to, and have the opportunity to update and amend your Personal Information, and, you can exercise the other rights acknowledged by applicable data protection legislation, including, for example, objection to and blocking of the processing of your Personal Information, by contacting us at info@sukshi.com or by sending a letter to Attn: ____________. For security reasons, We reserve the right to take steps to authenticate the identity of the requesting party before providing access to Personal Information in accordance with this section of the . Account Data: We collect all the information provided during the registration/signup on the Website /App for use of the services provided by the Company through the Website/App. The information collected for the registration/signup shall be your name, address, telephone number, fax number, email and etc. This is to enforce the agreement between You and the Company, to ensure that You are reachable by potential trade partners, or to troubleshoot problems with Your account. Hidden Data: In addition to Your account data, We also collect information recorded when You browse and visit our Website/App, including but not limited to, cookies, IP address, etc. This information is not used to identify You, but for the necessary purpose to avoid being attacked by hackers, and for the purpose of making customized content services to Users. Additionally, through processing comprehensive statistical analysis, we are endeavoring to provide You with more and more efficient functionalities to facilitate Our service. To visit www.Sukshi.com, Your browser has to be configured to accept cookies. EXTERNAL LINKS ON THE WEBSITE/APP The Website/App may include hyperlinks to other websites, content or resources. We have no control over such external links present in the Website/App, which are provided by persons or companies other than Sukshi. You acknowledge and agree that, We are not responsible for any collection or disclosure of Your Personal Information by any external sites, Websites/App, companies or persons, nor do We endorse any advertising, products or other material on or available from such external Websites/App, websites or resources You further acknowledge and agree that We are not liable for any loss or damage which may be incurred by You as a result of the collection and/or disclosure of Your personal information by external Websites/App, sites or resources, or as a result of any reliance placed by You on the completeness, accuracy or existence of any advertising, products or other materials on, or available from such Websites/App. This external Website/App, websites and resource providers may have their own Privacy Policies governing the collection, storage, retention and disclosure of Your Personal Information that You may be subject to. We recommend that You enter the external Website/App or website and review their . OUR USE OF YOUR INFORMATION Our primary goal in collecting user information is to understand your project or business needs and to enhance Your experience on Our Website/App. Providing personal information is necessary for the performance of the services and functionalities offered by the Website/App. We achieve this goal by, among other things, providing interactive communications such as our newsletters to the e-mail address that You provide to Us. Sukshi may also disclose information about Our Users when We believe, in good faith, that the disclosure is required by law. Please be aware that Sukshi may sponsor advertisers or websites that have links on Our web/other publications. The information practices of those parties and Web sites linked to Sukshi are not covered by this privacy statement. DISCLOSURE OF YOUR INFORMATION TO THIRD PARTIES Due to the existing regulatory environment, We cannot ensure that all of Your Personal Information shall never be disclosed in ways other than those described in this . Although We use industry-standard practices to protect your privacy, We do not promise, and You should not expect, that Your personally identifiable information or private communications would always remain private. External Service Providers: There may be a number of services offered by external service providers that help You use our Website/App. If You choose to use these optional services, and in the course of doing so, disclose information to the external service providers, and/or grant them permission to collect information about You, then their use of Your information is governed by their . Other Corporate Entities: We share much of Our data, including Your Personal Information, with Our parent and/or subsidiaries that are committed to serving Your needs through use of Our Website/App and related services, throughout the world. Such data shall be shared for the sole purpose of enhancing Your experience of using the Website/App. To the extent that these entities have access to Your information, they shall treat it at least as protectively as they treat information they obtain from their other members. It is possible that We and/or its subsidiaries, or any combination of such, could merge with or be acquired by another business entity. In any such combination, we may share some or all of your information in order to continue to provide the service. You shall receive notice of such event (to the extent it occurs). Law and Order: We cooperate with law enforcement inquiries, as well as other third parties to enforce laws, such as: intellectual property rights, fraud and other rights. We can, and You so authorize Us, disclose Your Personal Information to law enforcement and other government officials as We, in Our sole discretion, believe necessary or appropriate, in connection with an investigation of fraud, intellectual property infringements, or other activity that is illegal or may expose Us or You to any legal liability. Any information that You make publicly available on the site may be potentially viewed by any party, and by posting such material it is deemed that You consent to share such information with such parties. Our Site is not meant to be used by children, and we do not knowingly solicit or collect personal information from persons under the age of 18 (eighteen). If we find out that a child has given us personal information, we will take steps to delete that information and terminate the relevant user account. Sukshi may update this from time to time in order to reflect, for example, changes to Sukshi Private Limited services or for other operational, legal or regulatory reasons. If the User would like to access, correct, amend, remove or limit the use or disclosure of any Personal Information that has been collected and stored by Website/App, the User shall notify Sukshi at the provided contact address listed in this policy for Sukshi to consider and respond to the Users request in accordance with applicable law. For any such query of modification raised, Sukshi will respond to Users request within 48 hours. The User can always opt not to disclose information. However, if the User elects to do so, Sukshi maybe, not be able to provide the services through the Website/App. The Website/App will only process personal information in a way that is compatible with and relevant to the services rendered for the purpose for which it is collected or authorized to be collected by User. To the extent necessary for those purposes, Sukshi may take reasonable steps to ensure that Personal Information is accurate, complete, current and reliable for its intended use. By using the Website/App or by providing information, the User consents to the collection and use of the information in accordance with this , including but not limited to the User's consent for sharing the information as per this . If Sukshi decides to change the , it may post those changes on the App page so that Users are always aware of what information Sukshi collects, how is it used, and under what circumstances it is disclosed. For more information about our privacy practices, if Users has questions, queries, concerns or feedbacks, if the User would like to make a complaint, please contact us by e-mail at info@sukshi.com. REVISIONS TO THE POLICY If we change this Policy, we will post any updates here for your review. If we change material in this Policy, we will provide notice of the revised policy for 30 days on the home page at www.Sukshi.com with a link back to this page. We will also take other steps as necessary depending on the nature of the changes, including obtaining your consent where required by local data protection laws, or providing you with the opportunity to delete your Personal Information."
  ]
}