{
  "company": "www.tensormark.com",
  "dominant_topics": [
    2,
    -1,
    0
  ],
  "topic_counts": {
    "2": 8,
    "-1": 8,
    "0": 2
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.6379310344827587,
    "framing_surveillance": 0.2586206896551724,
    "framing_market": 0.1034482758620689,
    "num_docs": 18
  },
  "topic_timeline": {
    "20": {
      "-1": 8,
      "0": 2,
      "2": 8
    }
  },
  "sample_docs": [
    "What We Do TensorMark implements AI and computer vision to compile analytics and make data actionable for businesses to enhance their security, efficiency, and bottom line all while using their existing infrastructure. Industry specific - prebuilt toolsets for easier adoption that collect massive amounts of data that exports into simple easy-to-read reports Cutting edge technology – University Hospitals announce a strategic COVID-19 initiative / VUZIX partnership to innovate computer vision solutions with augmented reality glasses Saves time & money – virtually no hardware to switch out for quicker and easier implementations as well as cost containment Plug & play – sits on top of current infrastructure TensorMark implements AI and computer vision to compile analytics and make data actionable for businesses to enhance their security, efficiency, and bottom line all while using their existing infrastructure. Industry specific - prebuilt toolsets for easier adoption that collect massive amounts of data that exports into simple easy-to-read reports Cutting edge technology – University Hospitals announce a strategic COVID-19 initiative / VUZIX partnership to innovate computer vision solutions with augmented reality glasses Saves time & money – virtually no hardware to switch out for quicker and easier implementations as well as cost containment Plug & play – sits on top of current infrastructure \"The best way to enhance security is through facial recognition — it's going to be the standard very soon.†- Kesha Williams, Software Engineering Manager of Chick-fil-A \"The best way to enhance security is through facial recognition — it's going to be the standard very soon.†Meet Our Team The TensorMark Team John Weston CEO Andrew Jacobson President Ali Manav COO Lonnie Hanlon CMO Mark Plaskow CTO Chris Osufsen VP Technology Connor Brady VP Technology",
    "Heartbeat by TensorMark There will be 1 billion surveillance cameras watching around the world by 2021. By processing our client's surveillance images and combining it with our solutions we can provide proactive data analytics and security measures to our clients. Effectivity monitoring the \"Heartbeat†of the organization. There will be 1 billion surveillance cameras watching around the world by 2021. By processing our client's surveillance images and combining it with our solutions we can provide proactive data analytics and security measures to our clients. Effectivity monitoring the \"Heartbeat†of the organization. With any Camera TensorMark implements AI and computer vision to compile analytics and make data actionable for businesses to enhance their security, efficiency, and bottom line all while utilizing their existing infrastructure. Public Spaces Government Buildings Public Transportation Airports Border Control Access Control Mask Detection Smart Glass TensorMark implements AI and computer vision to compile analytics and make data actionable for businesses to enhance their security, efficiency, and bottom line all while utilizing their existing infrastructure.",
    "Banking & Finance A picture is worth a thousand words and a picture of a face can save your institution thousands of dollars. ATM users are verified by TensorMark's facial recognition platform in addition to their PIN. This effectively reduces fraud risk and security threats without adding more time or inconvenience to the user experience. User-friendly : Control employee access from anywhere without having to worry about pesky ID cards or Fob's which can easily be replicated with the right technology. Quick : Unlock doors as you approach. Secure : Take your current access control system to the next level with facial recognition. Insights : Collect valuable data on employee tracking and traffic flow counting. Economical : Easily integrate within you existing IP camera system and protect each access point. A picture is worth a thousand words and a picture of a face can save your institution thousands of dollars. ATM users are verified by TensorMark's facial recognition platform in addition to their PIN. This effectively reduces fraud risk and security threats without adding more time or inconvenience to the user experience. User-friendly : Control employee access from anywhere without having to worry about pesky ID cards or Fob's which can easily be replicated with the right technology. Quick : Unlock doors as you approach. Secure : Take your current access control system to the next level with facial recognition. Insights : Collect valuable data on employee tracking and traffic flow counting. Economical : Easily integrate within you existing IP camera system and protect each access point.",
    "Learn about TensorMark solutions. Vuzix partnered with TensorMark in February 2020 to develop cloud-based facial and object recognition services... U.S. healthcare network integrates TensorMark's AI, facial recognition to make returning to work safer... In Cleveland, University Hospitals is working with TensorMark, a cloud-based AI and computer vision... Vuzix, TensorMark Team Up on Biometric COVID-19 Credential Screening Solution... Select your TensorMark platform, or enroll in an API Account today! Dashboard Login Use your provided credentials to login to your organization best value API Login Already have an account, here! No account? Scroll down to enroll today! Facial Recognition API $ 0.001 /image Status: Live Pay for what you use with the TensorMark Facial Recognition API Enroll Object Recognition API $ 0.001 /image Coming Soon! Pay for what you use with the TensorMark Object Recognition API Enroll OCR API $ 0.001 /image Coming Soon! Pay for what you use with the TensorMark OCR API Enroll",
    "Education Be alerted to safety threats on campus. TensorMark brings security to schools of all sizes by analyzing all faces of a crowd at each entrance, ensuring that potential threats are flagged and accounted for. User-friendly : Control access of everyone from anywhere. No worries about pesky ID cards or FOBs. Quick : Unlock doors as you approach. Secure : Take your current access control system to the next level with facial recognition. Insights : Collect valuable data on employee tracking and traffic flow counting. Economical : Integrate with your existing camera system and protect each door. Be alerted to safety threats on campus. TensorMark brings security to schools of all sizes by analyzing all faces of a crowd at each entrance, ensuring that potential threats are flagged and accounted for. User-friendly : Control access of everyone from anywhere. No worries about pesky ID cards or FOBs. Quick : Unlock doors as you approach. Secure : Take your current access control system to the next level with facial recognition. Insights : Collect valuable data on employee tracking and traffic flow counting. Economical : Integrate with your existing camera system and protect each door. Enter a building by simply scanning your face Make sure you know who is picking up your child Monitor anxiety or emotional distress in children to help predict bullying or violent acts of behavior such as school shootings Monitor student location and prevent unauthorized access Identify known sexual offenders or others who pose particular risk to children Truancy detection, know when students leave campus Enter a building by simply scanning your face Make sure you know who is picking up your child Monitor anxiety or emotional distress in children to help predict bullying or violent acts of behavior such as school shootings Monitor student location and prevent unauthorized access Identify known sexual offenders or others who pose particular risk to children Truancy detection, know when students leave campus"
  ]
}