{
  "company": "www.trueid.co.za",
  "dominant_topics": [
    1,
    0
  ],
  "topic_counts": {
    "1": 2,
    "0": 1
  },
  "topic_descriptions": {
    "1": "face, recognition, biometric, attendance, fingerprint",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.75,
    "framing_surveillance": 0.25,
    "framing_market": 0.0,
    "num_docs": 3
  },
  "topic_timeline": {
    "20": {
      "0": 1,
      "1": 2
    }
  },
  "sample_docs": [
    "T rue I . D . A South A frican I dentity V erification S olution. T rue I D A pp A M obile Ap plication How to download and Install True ID W hy Identity Verification and Management? T he upsurge of Identity theft and fraudulent identity documents being able to be purchased for as little as R3000.00 on the black market in South Africa has created the real need for numerous industries and businesses to ensure that a consumer/Individual is in fact who they say they are, from banks to retailers frankly even to cellphone companies and medical aids. The list of companies that require the T rue I.D. smartphone solution is endless. W hat is True I.D. T rue I.D. is a mobile application that can be used on demand in the field and in the office by V-Report clients to Identify an Individual using fingerprint biometric technology. True ID also has its own True AFIS fingerprint database which will enroll and match fingerprints/templates on 1:1 basis. Results received in real time from the South African Department of Home Affairs against the HANIS database will be a fingerprint match or no match, biographical information and the ID photograph on file. W ho can use True I.D. T rue I.D. can be used by risk division clients of V-Report. All clients will need to be vetted and approved for the use of this application. V-Report believes that this application will have tremendous benefit in of its use and functionality for many Industries, banking, Insurance, healthcare and cellular in of fraud protection and prevention. W hat doesTrue I.D. do. T rue I.D. is an on demand in the field application to confirm the Identity of an Individual. No boundaries and no time delays. Results on your phone and in your inbox in less than 90 seconds. By making use of the Individuals personal Information with consent,a photograph and fingerprint/s are taken using a smartphone, T rue I.D. is then able to in real time obtain fingerprint, biographical and ID photograph information as well as the Issue date of the Individual from the department of home affairs. T rue I.D will then will be taking a photograph of the of the Individuals ID Document for reference purposes. ​ T rue I . D . A South A frican I dentity V erification S olution. T rue I D A pp A M obile Ap plication How to download and Install True ID W hy Identity Verification and Management? W hat is True I.D. W ho can use True I.D. W hat doesTrue I.D. do.",
    "T rue I .D . A South A frican I dentity V erification S olution. A M obile Ap plication P RIVACY P OLICY T rue I D Last updated: October 09, 2015 Company Identirisk South Africa t/a V-Report (\"us\", \"we\", or \"our\") operates the www.trueid.co.za mobile application True ID (the \"Service\"). This page informs you of our policies regarding the collection, use and disclosure of Personal Information when you use our Service. We will not use or share your information with anyone except as described in this . We use your Personal Information for providing and improving the Service. By using the Service, you agree to the collection and use of information in accordance with this policy. Information Collection and Use While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you. Personally identifiable information may include, but is not limited to, your name, surname, ID number, home address, cell phone / landline number, photograph, fingerprint/s and or any other information that may be added to the True ID application in future (\"Personal Information\"). Service Providers (Data Suppliers) We make use of third party companies (Data Suppliers) to facilitate our Service or to perform Service-related services. These third parties have access to your Personal Information only to perform these associated tasks on our behalf and are obligated under law not to disclose or use it for any other purpose. Compliance with South African Laws We will disclose your Personal Information where required to do so by law or subpoena or if we believe that such action is necessary to comply with the law and the reasonable requests of law enforcement or to protect the security or integrity of our Service. POPI Act Accountability = assigning ownership of POPI in the business; Processing Limitation = processing information for lawful reasons and in a manner that does not infringe privacy; Purpose Specification = only obtaining and holding personal information for a specific purpose; Further Processing Limitation = further processing of personal information must be compatible with the purpose for which it was collected; Information Quality = ensuring that information is complete and accurate; Openness = informing individuals that their information has been obtained and the purpose thereof; Security safeguards = the integrity of personal information must be secured using reasonable technical and organisational measures; Data Subject Participation = an individual has the right to request whether an organisation holds their personal information. An individual may request the information is deleted or corrected if it is incorrectly Business Transaction (Sale of Business / Application) If Identirisk South Africa t/a V-Report is involved in a merger, acquisition or asset sale, your Personal Information may be transferred. We will provide notice before your Personal Information is transferred and becomes subject to a different . Security The security of your Personal Information is important to us and as such we have taken precautions to secure the V-Report website and its databases where the data will be stored against any form of attack and/or hacking attempt, all data is encrypted using 256 bit encryption and all fingerprints are stored in encoded form, however please remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Information, we cannot guarantee its absolute security. V-Report also runs a web application firewall which prevents against all the above-mentioned potential incidents. International/ Cross Border Transfer Your information, including Personal Information, may be transferred to — and maintained on — computers located outside of your province, country or other governmental jurisdiction where the data protection laws may differ than those from your jurisdiction. If you are located outside South Africa and choose to provide information to us, please note that we transfer the information, including Personal Information, to South Africa and process it there. Your consent to this followed by your submission of such information represents your agreement to that transfer. Consent. Consent and the reason for the verification will be captured when processing a verification using the True ID application an order will also be created on the V-Report platform and will be able to be reviewed anytime in the future. Children's Privacy Our Service does not address anyone under the age of 18 (\"Children\"). Changes to This We may update our from time to time. We will notify you of any changes by posting the new on this page. You are advised to review this periodically for any changes. Changes to this are effective as and when they are posted on this page. Contact Us If you have any questions about this , please contact us in writing at info@trueid.co.za T rue I .D . A South A frican I dentity V erification S olution. A M obile Ap plication P RIVACY P OLICY",
    "T rue I . D . A South A frican I dentity V erification S olution. T rue I D A pp A M obile Ap plication How to download and Install True ID W hy Identity Verification and Management? T he upsurge of Identity theft and fraudulent identity documents being able to be purchased for as little as R3000.00 on the black market in South Africa has created the real need for numerous industries and businesses to ensure that a consumer/Individual is in fact who they say they are, from banks to retailers frankly even to cellphone companies and medical aids. The list of companies that require the T rue I.D. smartphone solution is endless. W hat is True I.D. T rue I.D. is a mobile application that can be used on demand in the field and in the office by V-Report clients to Identify an Individual using fingerprint biometric technology. True ID also has its own True AFIS fingerprint database which will enroll and match fingerprints/templates on 1:1 basis. Results received in real time from the South African Department of Home Affairs against the HANIS database will be a fingerprint match or no match, biographical information and the ID photograph on file. W ho can use True I.D. T rue I.D. can be used by risk division clients of V-Report. All clients will need to be vetted and approved for the use of this application. V-Report believes that this application will have tremendous benefit in of its use and functionality for many Industries, banking, Insurance, healthcare and cellular in of fraud protection and prevention. W hat doesTrue I.D. do. T rue I.D. is an on demand in the field application to confirm the Identity of an Individual. No boundaries and no time delays. Results on your phone and in your inbox in less than 90 seconds. By making use of the Individuals personal Information with consent,a photograph and fingerprint/s are taken using a smartphone, T rue I.D. is then able to in real time obtain fingerprint, biographical and ID photograph information as well as the Issue date of the Individual from the department of home affairs. T rue I.D will then will be taking a photograph of the of the Individuals ID Document for reference purposes. ​ T rue I . D . A South A frican I dentity V erification S olution. T rue I D A pp A M obile Ap plication How to download and Install True ID W hy Identity Verification and Management? W hat is True I.D. W ho can use True I.D. W hat doesTrue I.D. do."
  ]
}