{
  "company": "xjeralabs.com",
  "dominant_topics": [
    2,
    -1,
    3,
    7,
    0
  ],
  "topic_counts": {
    "2": 8,
    "-1": 5,
    "3": 1,
    "7": 1,
    "0": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "3": "vantage, development, document, ai, prioxis",
    "7": "ramco, payroll, aviation, en, ramco systems",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0,
    "framing_surveillance": 0.4285714285714285,
    "framing_market": 0.5714285714285714,
    "num_docs": 16
  },
  "topic_timeline": {
    "20": {
      "-1": 5,
      "0": 1,
      "2": 8,
      "3": 1,
      "7": 1
    }
  },
  "sample_docs": [
    "XJERA LABS Pte Ltd is a company focused on revolutionary smart video content analytics (VCA) by implementing learning-based VCA for various commercial applications. For instance, XJERA is providing video analysis services for a theme park and a chain of sushi restaurants in Singapore. It has recently been awarded the i.JAM Funding Scheme by MDA to develop VCA for the mobile platforms (e.g. Android). XJERA was also awarded a Proof-of-Concept project by the Institute of Mental Health to carry out a 6-month trial for monitoring the behaviour of its patients and provide alerts to its nurses when detecting an event (e.g. fall). XJERA is currently collaborating with Nvidia and IDA to use GPU for deploying Deep Learning techniques to enhance the accuracy and performance of video analytics. XJERA also provides customized video analytics to its customers who have very specific and high performance requirements that off-the-shelf products are not able to meet.",
    "* People Counting * Vehicle Counting/Classification * Multi-Cam Tracking *Abandoned object Detection *Loitering Detection *Perimeter Instursion Detection * Traffic Congestion Detection * Vehicle Converse Detection * Vehicle Trailing Detection * Illegally Parked Vehicles Surveillance * Face Recognition * Face Retrieval * Items Recognition * Items Counting",
    "XJERA LABS partners with NVIDIA to leverage NVIDIA GPU solutions and platforms to deliver video analytics solution for surveillance with performance and accuracy that are not found on typical off-the-shelf products. We also adopt NVIDIA Tesla P4's acceleration capabilities to enable powerful actions such as automatically extracting different types of attributes and actions from a live video feed within 70 milliseconds for >15 High Definition Cameras concurrently and with an amazing accuracy of approximately ~90%. Video Analytics Performance XJERA's video analytics algorithms are able to deliver an excellent > 95% accuracy for people detection, intrusion, and line crossing, and a > 85% accuracy for attribute detection. Assuming a fixed target for accuracy, basic video analytics such as detection, intrusion, and line crossing, GPU-accelerated analytics delivers a significant 31X higher performance compared to the same algorithm run only on the CPU. This gap widens even further to a massive 111X when complex video analytics such as attribute detection is executed on the same video stream. XJERA LABS partners with NVIDIA to leverage NVIDIA GPU solutions and platforms to deliver video analytics solution for surveillance with performance and accuracy that are not found on typical off-the-shelf products. We also adopt NVIDIA Tesla P4's acceleration capabilities to enable powerful actions such as automatically extracting different types of attributes and actions from a live video feed within 70 milliseconds for >15 High Definition Cameras concurrently and with an amazing accuracy of approximately ~90%. XJERA's video analytics algorithms are able to deliver an excellent > 95% accuracy for people detection, intrusion, and line crossing, and a > 85% accuracy for attribute detection. Assuming a fixed target for accuracy, basic video analytics such as detection, intrusion, and line crossing, GPU-accelerated analytics delivers a significant 31X higher performance compared to the same algorithm run only on the CPU. This gap widens even further to a massive 111X when complex video analytics such as attribute detection is executed on the same video stream. 31 x higher performance on detection only scenarios 111 x higher performance on people attributes detection 31 x higher performance on intrusion detection 31 x higher performance on line crossing detection Find out who has been talking about us Xjera Labs uses NVIDIA's Tesla P4 in its surveillance solutions The ease of scalability and reconfigurability of the Tesla P4, with the added benefit of NVIDIA's GPU support of a multitude of Deep Learning frameworks, gives Xjera Labs the flexibility that we need to not only differentiate ourself from the competition, but also the flexibility and possibility to do more with our Intelligent Video Analytic A.I. Delivering accelerated video analytics at the edge for AI Cities Video analytics is the perfect demonstration of the value of edge computing, as processing video near the camera eliminates the need to transfer large amounts of video data into the data center or cloud, reduces bandwidth costs, greatly accelerates reaction time, and lowers risk of corruption or espionage. Xjera Labs signs MoU with Huawei in the area of video cloud Huawei has signed individual MoUs with five enterprises, committing the parties to joint development of public safety solutions at Huawei's Singapore OpenLab. In the area of video cloud, Huawei has established new partnerships with Agent Video Intelligence (Agent Vi), IPSOTEK, and Xjera Labs. Behind the world's most sophisticated facial recognition system that tracks absolutely anything \"If the police want to find someone, then they want a very fast response. With our system, we are constantly doing facial indexing in real-time on CCTV camera footage. The footage is uploaded to the cloud by our customers and we process the data,\" Xjera Labs' founder and CTO Ethan Chu told IBTimesUK at the Innovfest Unbound 2017 event in Singapore.",
    "Project Description XJERA LABS provides video analytics services for Sushi Express restaurants in Singapore. By recognizing and counting various sushi on the turntable, our system can remind the operator which type of sushi need to be added. XJERA LABS provides video analytics services for Sushi Express restaurants in Singapore. By recognizing and counting various sushi on the turntable, our system can remind the operator which type of sushi need to be added.",
    "ABOUT Incorporated in 2013, XJERA LABS is a provider of artificial intelligence solutions based in Singapore. Our solution have been implemented across various industry sectors with renown and reputable clients. Incorporated in 2013, XJERA LABS is a provider of artificial intelligence solutions based in Singapore. Our solution have been implemented across various industry sectors with renown and reputable clients. Aviation Facade Manufacturing Security Transportation We have obtained Singapore Government Supply Head S9 for EPU/CMP/10 – Computer Related Hardware, Software, and Services, EPU/SER/33 – Service (Survey), and EPU/SER/34 – Service (Consultant), which means that we have proven our ability to provide our products and services for bigger deployment. Our solutions provide real-time, accurate and actionable insights for round-the-clock operation allowing our clients to optimize operation and achieve improve production yield. We have obtained Singapore Government Supply Head S9 for EPU/CMP/10 – Computer Related Hardware, Software, and Services, EPU/SER/33 – Service (Survey), and EPU/SER/34 – Service (Consultant), which means that we have proven our ability to provide our products and services for bigger deployment. Our solutions provide real-time, accurate and actionable insights for round-the-clock operation allowing our clients to optimize operation and achieve improve production yield. CLIENTS MEMBERS OF a ACHIEVEMENTS 2015 Winner of the Infocomm Development Authority Inaugural Video Analytics Challenge 2017 Winner of the Singapore Airport AI Challenge 2019 Winner of Emerging Enterprise Award jointly organized by The Business Times and OCBC 2022 Winner of ASTAR Advanced Manufacturing Visual AI Challenge 2022 2023 Industry Member of Advance Remanufacturing and Technology Centre (ARTC) OUR CLIENTS 2015 Winner of the Infocomm Development Authority Inaugural Video Analytics Challenge Winner of the Infocomm Development Authority Inaugural Video Analytics Challenge 2017 Winner of the Singapore Airport AI Challenge Winner of the Singapore Airport AI Challenge 2019 Winner of Emerging Enterprise Award jointly organized by The Business Times and OCBC Winner of Emerging Enterprise Award jointly organized by The Business Times and OCBC 2022 Winner of ASTAR Advanced Manufacturing Visual AI Challenge 2022 Winner of ASTAR Advanced Manufacturing Visual AI Challenge 2022 2023 Industry Member of Advance Remanufacturing and Technology Centre (ARTC) Industry Member of Advance Remanufacturing and Technology Centre (ARTC) Live Occurrence Camera Xjera Labs Solutions Quality Data and Timely Alerts Quality Data and Timely Alerts"
  ]
}