{
  "company": "xydus.com",
  "dominant_topics": [
    30,
    0,
    -1,
    3
  ],
  "topic_counts": {
    "30": 17,
    "0": 1,
    "-1": 1,
    "3": 1
  },
  "topic_descriptions": {
    "30": "xydus, create identity, today tomorrow, needs today, evolves",
    "0": "access, information, security, data, piam",
    "3": "vantage, development, document, ai, prioxis"
  },
  "framing_scores": {
    "framing_ethical": 0.8646616541353384,
    "framing_surveillance": 0.0225563909774436,
    "framing_market": 0.112781954887218,
    "num_docs": 20
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 1,
      "3": 1,
      "30": 17
    }
  },
  "sample_docs": [
    "This site uses cookies that need consent. Identity tech leader Xydus races ahead on Deloitte's fast 50 22nd November 2022 - 3 min Paycasso is now Xydus Xydus grows 600% in 12 months Five changes UK businesses must know about the new Right to Work regulations Create identity management continuity that evolves with your needs - today, tomorrow and beyond. Contact sales Create identity management continuity that evolves with your needs - today, tomorrow and beyond.",
    "This site uses cookies that need consent. Digital ID: What businesses need to know 11th November 2022 - 4 min Paycasso is now Xydus Xydus grows 600% in 12 months Five changes UK businesses must know about the new Right to Work regulations Create identity management continuity that evolves with your needs - today, tomorrow and beyond. Contact sales Create identity management continuity that evolves with your needs - today, tomorrow and beyond.",
    "This site uses cookies that need consent. Five changes UK businesses must know about the new Right to Work regulations 1st August 2022 - 2 min Paycasso is now Xydus Xydus grows 600% in 12 months Xydus certified for UK Trust Framework Create identity management continuity that evolves with your needs - today, tomorrow and beyond. Contact sales Create identity management continuity that evolves with your needs - today, tomorrow and beyond.",
    "This site uses cookies that need consent. Xydus named in the Financial Times' FT 1000 list of Europe's fastest-growing companies 7th March 2023 - 2 min Paycasso is now Xydus Xydus grows 600% in 12 months Five changes UK businesses must know about the new Right to Work regulations Create identity management continuity that evolves with your needs - today, tomorrow and beyond. Contact sales Create identity management continuity that evolves with your needs - today, tomorrow and beyond.",
    "This site uses cookies that need consent. This sets out how Xydus uses and protects any information that you provide when you use this website. Introduction This is the for Xydus.com. We are committed to maintaining the privacy and confidentiality of any personal information we collect. We may use your personal information: to provide, personalize, maintain the security of, and improve our Services; to maintain our business operations; and to exercise, defend or establish our rights. Should we ask you to provide certain information by which you can be identified when using our website, any use of your information will be in accordance with this policy. Changes to the If we decide to change our we will post the changes here. If the changes are significant, we may also choose to email all our registered users with the new details. If required by law, we will get your permission or give you the opportunity to opt out of any new uses of your data. Changes were made in May, 2018 reflecting changes in the law known as General Data Protection Regulation (also known as the GDPR) and the UK Data Protection Act, 2018. Changes in November, 2018 reflect updates to our use and notification of cookies. About this This explains how we collect, use, share or transfer your personal information when you use this website. Types of personal information: your name, job title, contact information including email address; information about the type of device you are using including IP address and the device's identifiers, your browser type and language; information relating to how you use our site including referring and exit pages. Who we are and how to contact us The data controller for this website is Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF. This means that we are responsible for deciding how and why we hold and use your personal data. If you wish to contact us, you can email us at privacyofficer@Xydus.com . What personal data we collect and how we use it Registration and use information – When you register to use our Services, we will collect Personal Data as necessary to offer and fulfil the Services you request. Depending on the Services you choose, we may require you to provide us with your name, postal address, telephone number, email address and identification information. We may require you to provide us with additional Personal Data as you use our Services. Information that you choose to provide us to obtain additional Services or specific online Services – If you request or participate in an optional Site feature, or request enhanced Services or other elective functionality, we may collect additional information from you. We will provide you with a separate notice at the time of collection, if the use of that information differs from the uses disclosed in this . Information about you from third-party sources – We may obtain information from third-party sources, where permitted by law. Other information we collect related to your use of our Sites or Services – We may collect additional information from or about you when you communicate with us, contact our customer support teams or respond to a survey. What we do with the information we gather We require this information to understand your needs, facilitate our services, and for the following reasons: We may process data about your use of our website and services. The usage data may include your IP address, geographical location, browser type and version, operating system, referral source, length of visit, page views and website navigation paths, as well as information about the timing, frequency and pattern of your service use. The source of the usage data is our analytics tracking system. This usage data may be processed for the purposes of analysing the use of the website and services. The legal basis for this processing is mainly monitoring and improving our website and services We may process your account data. The account data may include your name and email address. The account data may be processed for the purposes of operating our website, providing our services, ensuring the security of our website and services, maintaining back-ups of our databases and communicating with you. The legal basis for this processing is the proper administration of our website and business. We may process information contained in any enquiry you submit to us. The enquiry data may be processed to improve our services to you. We may process information that you provide to us for the purpose of subscribing to our email notifications or newsletters. Please do not supply any other person's personal data to us. International transfers of your personal data We have offices and facilities that are overseas. The European Commission has made an adequacy decision with respect to the data protection laws of each of these countries. Transfers to each of these countries will be protected by appropriate safeguards, namely the use of data protection standards that are approved by the European Commission. Retaining and deleting personal data Personal data that we process for any reason shall not be kept for longer than is necessary for the purpose. In some cases, it is not possible for us to specify in advance the periods for which your personal data will be retained. In such cases, we will determine the period of retention based on the specific task. we may retain your personal data where such retention is necessary for compliance with a legal obligation to which we are subject, or in order to protect your vital interests or the vital interests of another natural person. Your rights Your principal rights under data protection law are: the right to access; the right to rectification; the right to erasure; the right to restrict processing; the right to object to processing; the right to data portability; the right to complain to a supervisory authority; and the right to withdraw consent. Internal record keeping We may use the information to improve our products and services. We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, we may use the information to customise the website according to your interests. Sharing personal information with third parties Xydus will not pass your information to third parties other than as described in this paragraph. Xydus may, subject to its obligations to comply with applicable data protection legislation, share your information with third parties including: Our server providers which host and store the Data, such as Apple, Google, Dropbox, AWS, Microsoft and Azure. Security We are committed to ensuring that your information is secure. We have implemented reasonable and appropriate security measures to help protect your information both online and offline and to ensure that your data is treated in accordance with this . In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. How we use cookies What are Cookies A cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences. When you visit our Sites, use our Services, we may use cookies and other tracking technologies to recognize you as a User and to customize your online experiences, the Services you use, and other online content and advertising; measure the effectiveness of promotions and perform analytics; and to mitigate risk, prevent potential fraud, and promote trust and safety across our Sites and Services. Certain aspects and features of our Services and Sites are only available through the use of Cookies, so if you choose to disable or decline Cookies, your use of the Sites and Services may be limited or not possible. We use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system. Overall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us. You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website. More information: To find out more about how cookies work, how to manage and delete them and to see which ones have been set please visit www.aboutcookies.org or www.allaboutcookies.org . Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or email us at: privacyofficer@Xydus.com . We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. You may request details of personal information which we hold about you under the General Data Protection Regulation (EU) 2016/679) and the UK Data Protection Act, 2018. If you would like a copy of the information held on you please write to Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF or email us at: privacyofficer@Xydus.com . If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect This sets out how Xydus uses and protects any information that you provide when you use this website. Introduction This is the for Xydus.com. We are committed to maintaining the privacy and confidentiality of any personal information we collect. We may use your personal information: to provide, personalize, maintain the security of, and improve our Services; to maintain our business operations; and to exercise, defend or establish our rights. Should we ask you to provide certain information by which you can be identified when using our website, any use of your information will be in accordance with this policy. Changes to the If we decide to change our we will post the changes here. If the changes are significant, we may also choose to email all our registered users with the new details. If required by law, we will get your permission or give you the opportunity to opt out of any new uses of your data. Changes were made in May, 2018 reflecting changes in the law known as General Data Protection Regulation (also known as the GDPR) and the UK Data Protection Act, 2018. Changes in November, 2018 reflect updates to our use and notification of cookies. About this This explains how we collect, use, share or transfer your personal information when you use this website. Types of personal information: your name, job title, contact information including email address; information about the type of device you are using including IP address and the device's identifiers, your browser type and language; information relating to how you use our site including referring and exit pages. Who we are and how to contact us The data controller for this website is Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF. This means that we are responsible for deciding how and why we hold and use your personal data. If you wish to contact us, you can email us at privacyofficer@Xydus.com . What personal data we collect and how we use it Registration and use information – When you register to use our Services, we will collect Personal Data as necessary to offer and fulfil the Services you request. Depending on the Services you choose, we may require you to provide us with your name, postal address, telephone number, email address and identification information. We may require you to provide us with additional Personal Data as you use our Services. Information that you choose to provide us to obtain additional Services or specific online Services – If you request or participate in an optional Site feature, or request enhanced Services or other elective functionality, we may collect additional information from you. We will provide you with a separate notice at the time of collection, if the use of that information differs from the uses disclosed in this . Information about you from third-party sources – We may obtain information from third-party sources, where permitted by law. Other information we collect related to your use of our Sites or Services – We may collect additional information from or about you when you communicate with us, contact our customer support teams or respond to a survey. What we do with the information we gather We require this information to understand your needs, facilitate our services, and for the following reasons: We may process data about your use of our website and services. The usage data may include your IP address, geographical location, browser type and version, operating system, referral source, length of visit, page views and website navigation paths, as well as information about the timing, frequency and pattern of your service use. The source of the usage data is our analytics tracking system. This usage data may be processed for the purposes of analysing the use of the website and services. The legal basis for this processing is mainly monitoring and improving our website and services We may process your account data. The account data may include your name and email address. The account data may be processed for the purposes of operating our website, providing our services, ensuring the security of our website and services, maintaining back-ups of our databases and communicating with you. The legal basis for this processing is the proper administration of our website and business. We may process information contained in any enquiry you submit to us. The enquiry data may be processed to improve our services to you. We may process information that you provide to us for the purpose of subscribing to our email notifications or newsletters. Please do not supply any other person's personal data to us. International transfers of your personal data We have offices and facilities that are overseas. The European Commission has made an adequacy decision with respect to the data protection laws of each of these countries. Transfers to each of these countries will be protected by appropriate safeguards, namely the use of data protection standards that are approved by the European Commission. Retaining and deleting personal data Personal data that we process for any reason shall not be kept for longer than is necessary for the purpose. In some cases, it is not possible for us to specify in advance the periods for which your personal data will be retained. In such cases, we will determine the period of retention based on the specific task. we may retain your personal data where such retention is necessary for compliance with a legal obligation to which we are subject, or in order to protect your vital interests or the vital interests of another natural person. Your rights Your principal rights under data protection law are: the right to access; the right to rectification; the right to erasure; the right to restrict processing; the right to object to processing; the right to data portability; the right to complain to a supervisory authority; and the right to withdraw consent. Internal record keeping We may use the information to improve our products and services. We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, we may use the information to customise the website according to your interests. Sharing personal information with third parties Xydus will not pass your information to third parties other than as described in this paragraph. Xydus may, subject to its obligations to comply with applicable data protection legislation, share your information with third parties including: Our server providers which host and store the Data, such as Apple, Google, Dropbox, AWS, Microsoft and Azure. Security We are committed to ensuring that your information is secure. We have implemented reasonable and appropriate security measures to help protect your information both online and offline and to ensure that your data is treated in accordance with this . In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. How we use cookies What are Cookies A cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences. When you visit our Sites, use our Services, we may use cookies and other tracking technologies to recognize you as a User and to customize your online experiences, the Services you use, and other online content and advertising; measure the effectiveness of promotions and perform analytics; and to mitigate risk, prevent potential fraud, and promote trust and safety across our Sites and Services. Certain aspects and features of our Services and Sites are only available through the use of Cookies, so if you choose to disable or decline Cookies, your use of the Sites and Services may be limited or not possible. We use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system. Overall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us. You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website. More information: To find out more about how cookies work, how to manage and delete them and to see which ones have been set please visit www.aboutcookies.org or www.allaboutcookies.org . Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or email us at: privacyofficer@Xydus.com . We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. You may request details of personal information which we hold about you under the General Data Protection Regulation (EU) 2016/679) and the UK Data Protection Act, 2018. If you would like a copy of the information held on you please write to Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF or email us at: privacyofficer@Xydus.com . If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect This sets out how Xydus uses and protects any information that you provide when you use this website. Introduction This is the for Xydus.com. We are committed to maintaining the privacy and confidentiality of any personal information we collect. We may use your personal information: to provide, personalize, maintain the security of, and improve our Services; to maintain our business operations; and to exercise, defend or establish our rights. Should we ask you to provide certain information by which you can be identified when using our website, any use of your information will be in accordance with this policy. Changes to the If we decide to change our we will post the changes here. If the changes are significant, we may also choose to email all our registered users with the new details. If required by law, we will get your permission or give you the opportunity to opt out of any new uses of your data. Changes were made in May, 2018 reflecting changes in the law known as General Data Protection Regulation (also known as the GDPR) and the UK Data Protection Act, 2018. Changes in November, 2018 reflect updates to our use and notification of cookies. About this This explains how we collect, use, share or transfer your personal information when you use this website. Types of personal information: your name, job title, contact information including email address; information about the type of device you are using including IP address and the device's identifiers, your browser type and language; information relating to how you use our site including referring and exit pages. Who we are and how to contact us The data controller for this website is Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF. This means that we are responsible for deciding how and why we hold and use your personal data. If you wish to contact us, you can email us at privacyofficer@Xydus.com . What personal data we collect and how we use it Registration and use information – When you register to use our Services, we will collect Personal Data as necessary to offer and fulfil the Services you request. Depending on the Services you choose, we may require you to provide us with your name, postal address, telephone number, email address and identification information. We may require you to provide us with additional Personal Data as you use our Services. Information that you choose to provide us to obtain additional Services or specific online Services – If you request or participate in an optional Site feature, or request enhanced Services or other elective functionality, we may collect additional information from you. We will provide you with a separate notice at the time of collection, if the use of that information differs from the uses disclosed in this . Information about you from third-party sources – We may obtain information from third-party sources, where permitted by law. Other information we collect related to your use of our Sites or Services – We may collect additional information from or about you when you communicate with us, contact our customer support teams or respond to a survey. What we do with the information we gather We require this information to understand your needs, facilitate our services, and for the following reasons: We may process data about your use of our website and services. The usage data may include your IP address, geographical location, browser type and version, operating system, referral source, length of visit, page views and website navigation paths, as well as information about the timing, frequency and pattern of your service use. The source of the usage data is our analytics tracking system. This usage data may be processed for the purposes of analysing the use of the website and services. The legal basis for this processing is mainly monitoring and improving our website and services We may process your account data. The account data may include your name and email address. The account data may be processed for the purposes of operating our website, providing our services, ensuring the security of our website and services, maintaining back-ups of our databases and communicating with you. The legal basis for this processing is the proper administration of our website and business. We may process information contained in any enquiry you submit to us. The enquiry data may be processed to improve our services to you. We may process information that you provide to us for the purpose of subscribing to our email notifications or newsletters. Please do not supply any other person's personal data to us. International transfers of your personal data We have offices and facilities that are overseas. The European Commission has made an adequacy decision with respect to the data protection laws of each of these countries. Transfers to each of these countries will be protected by appropriate safeguards, namely the use of data protection standards that are approved by the European Commission. Retaining and deleting personal data Personal data that we process for any reason shall not be kept for longer than is necessary for the purpose. In some cases, it is not possible for us to specify in advance the periods for which your personal data will be retained. In such cases, we will determine the period of retention based on the specific task. we may retain your personal data where such retention is necessary for compliance with a legal obligation to which we are subject, or in order to protect your vital interests or the vital interests of another natural person. Your rights Your principal rights under data protection law are: the right to access; the right to rectification; the right to erasure; the right to restrict processing; the right to object to processing; the right to data portability; the right to complain to a supervisory authority; and the right to withdraw consent. Internal record keeping We may use the information to improve our products and services. We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, we may use the information to customise the website according to your interests. Sharing personal information with third parties Xydus will not pass your information to third parties other than as described in this paragraph. Xydus may, subject to its obligations to comply with applicable data protection legislation, share your information with third parties including: Our server providers which host and store the Data, such as Apple, Google, Dropbox, AWS, Microsoft and Azure. Security We are committed to ensuring that your information is secure. We have implemented reasonable and appropriate security measures to help protect your information both online and offline and to ensure that your data is treated in accordance with this . In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. How we use cookies What are Cookies A cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences. When you visit our Sites, use our Services, we may use cookies and other tracking technologies to recognize you as a User and to customize your online experiences, the Services you use, and other online content and advertising; measure the effectiveness of promotions and perform analytics; and to mitigate risk, prevent potential fraud, and promote trust and safety across our Sites and Services. Certain aspects and features of our Services and Sites are only available through the use of Cookies, so if you choose to disable or decline Cookies, your use of the Sites and Services may be limited or not possible. We use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system. Overall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us. You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website. More information: To find out more about how cookies work, how to manage and delete them and to see which ones have been set please visit www.aboutcookies.org or www.allaboutcookies.org . Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or email us at: privacyofficer@Xydus.com . We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. You may request details of personal information which we hold about you under the General Data Protection Regulation (EU) 2016/679) and the UK Data Protection Act, 2018. If you would like a copy of the information held on you please write to Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF or email us at: privacyofficer@Xydus.com . If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect This sets out how Xydus uses and protects any information that you provide when you use this website. This is the for Xydus.com. We are committed to maintaining the privacy and confidentiality of any personal information we collect. We may use your personal information: to provide, personalize, maintain the security of, and improve our Services; to maintain our business operations; and to exercise, defend or establish our rights. Should we ask you to provide certain information by which you can be identified when using our website, any use of your information will be in accordance with this policy. Changes to the If we decide to change our we will post the changes here. If the changes are significant, we may also choose to email all our registered users with the new details. If required by law, we will get your permission or give you the opportunity to opt out of any new uses of your data. Changes were made in May, 2018 reflecting changes in the law known as General Data Protection Regulation (also known as the GDPR) and the UK Data Protection Act, 2018. Changes in November, 2018 reflect updates to our use and notification of cookies. About this This explains how we collect, use, share or transfer your personal information when you use this website. Types of personal information: your name, job title, contact information including email address; your name, job title, contact information including email address; information about the type of device you are using including IP address and the device's identifiers, your browser type and language; information about the type of device you are using including IP address and the device's identifiers, your browser type and language; information relating to how you use our site including referring and exit pages. information relating to how you use our site including referring and exit pages. Who we are and how to contact us The data controller for this website is Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF. This means that we are responsible for deciding how and why we hold and use your personal data. If you wish to contact us, you can email us at privacyofficer@Xydus.com . What personal data we collect and how we use it Registration and use information – When you register to use our Services, we will collect Personal Data as necessary to offer and fulfil the Services you request. Depending on the Services you choose, we may require you to provide us with your name, postal address, telephone number, email address and identification information. We may require you to provide us with additional Personal Data as you use our Services. Information that you choose to provide us to obtain additional Services or specific online Services – If you request or participate in an optional Site feature, or request enhanced Services or other elective functionality, we may collect additional information from you. We will provide you with a separate notice at the time of collection, if the use of that information differs from the uses disclosed in this . Information that you choose to provide us to obtain additional Services or specific online Services – If you request or participate in an optional Site feature, or request enhanced Services or other elective functionality, we may collect additional information from you. We will provide you with a separate notice at the time of collection, if the use of that information differs from the uses disclosed in this . Information about you from third-party sources – We may obtain information from third-party sources, where permitted by law. Information about you from third-party sources – We may obtain information from third-party sources, where permitted by law. Other information we collect related to your use of our Sites or Services – We may collect additional information from or about you when you communicate with us, contact our customer support teams or respond to a survey. Other information we collect related to your use of our Sites or Services – We may collect additional information from or about you when you communicate with us, contact our customer support teams or respond to a survey. What we do with the information we gather We require this information to understand your needs, facilitate our services, and for the following reasons: We may process data about your use of our website and services. The usage data may include your IP address, geographical location, browser type and version, operating system, referral source, length of visit, page views and website navigation paths, as well as information about the timing, frequency and pattern of your service use. The source of the usage data is our analytics tracking system. This usage data may be processed for the purposes of analysing the use of the website and services. The legal basis for this processing is mainly monitoring and improving our website and services We may process your account data. The account data may include your name and email address. The account data may be processed for the purposes of operating our website, providing our services, ensuring the security of our website and services, maintaining back-ups of our databases and communicating with you. The legal basis for this processing is the proper administration of our website and business. We may process information contained in any enquiry you submit to us. The enquiry data may be processed to improve our services to you. We may process information that you provide to us for the purpose of subscribing to our email notifications or newsletters. Please do not supply any other person's personal data to us. International transfers of your personal data We have offices and facilities that are overseas. The European Commission has made an adequacy decision with respect to the data protection laws of each of these countries. Transfers to each of these countries will be protected by appropriate safeguards, namely the use of data protection standards that are approved by the European Commission. Retaining and deleting personal data Personal data that we process for any reason shall not be kept for longer than is necessary for the purpose. In some cases, it is not possible for us to specify in advance the periods for which your personal data will be retained. In such cases, we will determine the period of retention based on the specific task. we may retain your personal data where such retention is necessary for compliance with a legal obligation to which we are subject, or in order to protect your vital interests or the vital interests of another natural person. Your principal rights under data protection law are: the right to access; the right to access; the right to rectification; the right to rectification; the right to erasure; the right to erasure; the right to restrict processing; the right to restrict processing; the right to object to processing; the right to object to processing; the right to data portability; the right to data portability; the right to complain to a supervisory authority; and the right to complain to a supervisory authority; and the right to withdraw consent. the right to withdraw consent. We may use the information to improve our products and services. We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, we may use the information to customise the website according to your interests. Sharing personal information with third parties Xydus will not pass your information to third parties other than as described in this paragraph. Xydus may, subject to its obligations to comply with applicable data protection legislation, share your information with third parties including: Our server providers which host and store the Data, such as Apple, Google, Dropbox, AWS, Microsoft and Azure. We are committed to ensuring that your information is secure. We have implemented reasonable and appropriate security measures to help protect your information both online and offline and to ensure that your data is treated in accordance with this . In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. How we use cookies A cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences. When you visit our Sites, use our Services, we may use cookies and other tracking technologies to recognize you as a User and to customize your online experiences, the Services you use, and other online content and advertising; measure the effectiveness of promotions and perform analytics; and to mitigate risk, prevent potential fraud, and promote trust and safety across our Sites and Services. Certain aspects and features of our Services and Sites are only available through the use of Cookies, so if you choose to disable or decline Cookies, your use of the Sites and Services may be limited or not possible. We use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system. Overall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us. You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website. More information: To find out more about how cookies work, how to manage and delete them and to see which ones have been set please visit www.aboutcookies.org or www.allaboutcookies.org . Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or email us at: privacyofficer@Xydus.com . if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or email us at: privacyofficer@Xydus.com . We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. You may request details of personal information which we hold about you under the General Data Protection Regulation (EU) 2016/679) and the UK Data Protection Act, 2018. If you would like a copy of the information held on you please write to Xydus Limited, 180 Piccadilly, St. James's, London W1J 9HF or email us at: privacyofficer@Xydus.com . If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect"
  ]
}