{
  "company": "zeroeyes.com",
  "dominant_topics": [
    2,
    0,
    -1
  ],
  "topic_counts": {
    "2": 26,
    "0": 2,
    "-1": 1
  },
  "topic_descriptions": {
    "2": "demand, cctv, camera, ca, verkada",
    "0": "access, information, security, data, piam"
  },
  "framing_scores": {
    "framing_ethical": 0.0422535211267605,
    "framing_surveillance": 0.9248826291079812,
    "framing_market": 0.0328638497652582,
    "num_docs": 29
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2,
      "2": 26
    }
  },
  "sample_docs": [
    "ZeroEyes Announces Charter Membership in the Data Ethics Consortium for Security (DECS) Organization PHILADELPHIA, Dec. 16, 2021 /PRNewswire/ — ZeroEyes , Inc., today announced its charter membership in the Data Ethics Consortium for Security ( DECS ) organization. Established earlier this year by a group of five artificial intelligence companies working in the security space, DECS serves to educate policymakers and integrators on ethical issues pertaining to artificial intelligence, machine learning, computer vision, and other emerging technologies. \"ZeroEyes has been a key participant in the initial heavy lifts to incorporate DECS as a non-profit, and a huge contributing member during our first summer of research,\" said Amina Al Sherif, President of DECS. \"The company has shown a clear prioritization of ethics in everything that it creates through proactive technical research for DECS, as well as assisting in outreach when it comes to involving policy makers in the conversation.\" ZeroEyes' Chief of Staff, Kieran Carroll, added, \"ZeroEyes is excited to participate in DECS as we feel that their mission aligns closely with the values of privacy rights, anti-bias, and ethical AI implementation that our company practices every day. Educating lawmakers, policymakers, and operators on topics like inherent bias, data integrity, and compromised methodologies is extremely important to both the company and the industry at large.\" ZeroEyes is the industry's leading AI-based weapons detection solution. Our software integrates into existing security camera systems and sends out a series of alerts when a verified gun is detected via our best-in-class weapons detection algorithms. The ZeroEyes platform is the most proactive and actionable early-warning system on the market, allowing users to \"Stop threats at first sight, not first shot.\" Founded by a team of Navy SEALs and military veterans with over 50 years military experience with deep special operations and intelligence community expertise, ZeroEyes is the trusted weapons detection provider of numerous clients, including the US Department of Defense, leading public K-12 school districts, commercial property groups, Fortune 1000 corporate campuses, shopping malls, and big-box retail. The company is headquartered in the Philadelphia area and has additional locations in Washington DC and Hawaii. School Swatting: A Growing Problem with Serious Consequences Oct 9, 2023 Within the past year, there have been approximately five times more school shooting hoaxes called in to police than actual school shootings reported in 2023. According to The Washington Post, more than 500 schools nationwide were \"swatted†over the past year. In just... read more School Swatting: A Growing Problem with Serious Consequences Within the past year, there have been approximately five times more school shooting hoaxes called in to police than actual school shootings reported in 2023. According to The Washington Post, more than 500 schools nationwide were \"swatted†over the past year. In just... The Impact of Gun Violence in Education Sep 15, 2023 Gun Violence at Our Schools—Complex and Catastrophic During a recent webinar, David Riedman, industry leading gun violence expert and Director of Research Content for ZeroEyes, and Erin Acheson, VP of Marketing and gun violence survivor, sat down to discuss the impact... read more The Impact of Gun Violence in Education Gun Violence at Our Schools—Complex and Catastrophic During a recent webinar, David Riedman, industry leading gun violence expert and Director of Research Content for ZeroEyes, and Erin Acheson, VP of Marketing and gun violence survivor, sat down to discuss the impact... Detection Is Protection: Research Report Recap Jul 28, 2023 What does the state of gun violence in America look like today? Our Research Report, Detection Is Protection, provides deep dives into the state of gun violence across multiple industries in the form of data, incident reviews, and more. After hundreds of hours of... read more Detection Is Protection: Research Report Recap What does the state of gun violence in America look like today? Our Research Report, Detection Is Protection, provides deep dives into the state of gun violence across multiple industries in the form of data, incident reviews, and more. After hundreds of hours of...",
    "ZE Government Solutions Announces Phase II SBIR Award from the Air Force to Develop Object Detection on Thermal Camera Platforms PHILADELPHIA, June 6, 2023 /PRNewswire/ — ZE Government Solutions (ZEGS), a wholly owned subsidiary of A.I.-based gun detection leader ZeroEyes , today announced it has been selected by AFWERX for a SBIR Phase II contract in the amount of $1.25M focused on ZeroEyes Thermal Threat Detection (ZTTD) to investigate its potential to fill capability gaps in the Department of the Air Force (DAF). The integrated solution, ZeroEyes Thermal Threat Detection (ZTTD), combines ZEGS' A.I.-based object detection video analytics with a commercially available thermal sensor UAS platform to proactively identify, track, and respond in real-time to imminent threats that are not visible to the human eye. This will provide situational awareness in environments where traditional intelligence, surveillance and reconnaissance (ISR) may be unavailable, such as a heavily camouflaged combative environment or an aerial threat flying within the walls of a base installation. The Air Force Research Laboratory and AFWERX have partnered to streamline the Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) process by accelerating the small business experience through a faster proposal to award timelines, changing the pool of potential applicants by expanding opportunities to small business and losing bureaucratic overhead by continually implementing process improvement changes in contract execution. The DAF began offering 'The Open Topic' SBIR/STTR program in 2018 which expanded the range of innovations the DAF funded and now in June 2023, ZEGS will start its journey to create and provide innovative capabilities that will strengthen the national defense of the United States of America. \"During my years of military service, I became very familiar with the risks posed by fog, dust, foliage, night and other elements that make ISR difficult,\" said Mike Lahiff, CEO and co-founder of ZeroEyes, parent company of ZEGS. \"The combination of our proactive A.I.-based gun detection solution, UAS technology, and advanced imagery detection creates a triple crown of security that will immediately alert airmen when a gun-related threat is present, any time of year, in any weather.\" About ZE Government Solutions Launching in Q2 2023, ZE Government Solutions (ZEGS) will be a wholly owned subsidiary of ZeroEyes, an industry leader in proactive gun detection and situational awareness. ZEGS will focus on developing and delivering unique and proactive artificial intelligence solutions to the U.S. federal government for national security purposes. The company's software layers over existing digital cameras to help secure military installations at home and abroad while freeing manpower to perform other mission critical tasks. ZEGS will be equipped to develop a wide range of solutions, including unmanned aerial drones and robotic dogs furnished with AI gun detection, portable digital video security systems, and advanced imagers that can detect threats in environments where traditional intelligence, surveillance and reconnaissance (ISR) actions are impossible. The company will employ a robust federal government affairs effort, and is dedicated to providing situational awareness and actionable intelligence, reducing response times, and delivering clarity among chaos for the U.S. government and its military service members. about ZE Government Solutions at ZeroEyes.com. The Air Force Research Laboratory (AFRL) is the primary scientific research and development center for the Department of the Air Force. AFRL plays an integral role in leading the discovery, development, and integration of affordable warfighting technologies for our air, space, and cyberspace force. With a workforce of more than 11,000 across nine technology areas and 40 other operations across the globe, AFRL provides a diverse portfolio of science and technology ranging from fundamental to advanced research and technology development. For more information, visit: www.afresearchlab.com . AFWERX, a program office at the Air Force Research Laboratory (AFRL), connects innovators across government, industry, and academia. Through innovation and collaboration with our nation's top subject-matter experts and harnessing the power of ingenuity of internal talent, by expanding technology, talent, and transition partnerships for rapid and affordable commercial and military capability. Additional information is available at: https://www.afwerx.com/ . AFVentures invests in emerging technologies to scale Department of the Air Force capabilities, strengthening the US industrial base that empowers Airmen and Guardians by incentivizing private, for-profit investment in national security interests. Our success is achieved by connecting novel commercial solutions with defense problem sets, de-risking Airmen and Guardian initiatives to fill capability gaps and transition technologies. at https://afwerx.com/afventures-overview/ . What Should You Expect From Our Gun Detection Technology? May 9, 2024 From day one, ZeroEyes built our gun detection platform based on common-sense standards... Not because it would have given us a distinct sales advantage—but because it's the right thing to do to gain the trust of taxpayers, school administrators, businesses, and first... read more What Should You Expect From Our Gun Detection Technology? From day one, ZeroEyes built our gun detection platform based on common-sense standards... Not because it would have given us a distinct sales advantage—but because it's the right thing to do to gain the trust of taxpayers, school administrators, businesses, and first... What Should You Expect From Our Gun Detection Technology? May 9, 2024 From day one, ZeroEyes built our gun detection platform based on common-sense standards… Not because it would have given us a distinct sales advantage—but because it's the right thing to do to gain the trust of taxpayers, school administrators, businesses, and first responders. Here's how we do it… read more What Should You Expect From Our Gun Detection Technology? From day one, ZeroEyes built our gun detection platform based on common-sense standards… Not because it would have given us a distinct sales advantage—but because it's the right thing to do to gain the trust of taxpayers, school administrators, businesses, and first responders. Here's how we do it… School Swatting: A Growing Problem with Serious Consequences Oct 9, 2023 Within the past year, there have been approximately five times more school shooting hoaxes called in to police than actual school shootings reported in 2023. According to The Washington Post, more than 500 schools nationwide were \"swatted†over the past year. In just... read more School Swatting: A Growing Problem with Serious Consequences Within the past year, there have been approximately five times more school shooting hoaxes called in to police than actual school shootings reported in 2023. According to The Washington Post, more than 500 schools nationwide were \"swatted†over the past year. In just...",
    "ZeroEyes and Vassar Public Schools Host June 20 \"Lunch & Learn\" Showcasing Proactive Security Measures for Active Shooter Scenarios Speakers to Discuss the School Shooting Landscape and Demonstrate Proactive AI Gun Detection and Situational Awareness Solution That Significantly Reduces Response Times VASSAR, Mich., June 14, 2023 /PRNewswire/ — WHO: ZeroEyes, Inc. , creators of the only AI-based video analytics platform that holds the US Department of Homeland Security SAFETY Act Designation Vassar Public Schools of Vassar, Michigan WHAT: Dorothy Blackwell, superintendent of Vassar Public Schools, will speak about how and why she recommended that the school board approve and implement ZeroEyes' proactive AI gun detection and situational awareness technology. Rob Carter, customer success manager of ZeroEyes, will discuss the history and current state of school shooting threats in the US, as well as a live demonstration of the company's software. He will also outline how it integrates with existing school security cameras to provide real-time threat intelligence and reduce response times (while protecting privacy) in the event of an active shooter. WHERE: Vassar Middle & High School 220 Athletic Street Vassar, MI 48768 WHEN: 11:00am-12:30pm Tuesday, June 20th, 2023 WHY: In 2022, the K-12 School Shooting Database recorded 304 gun-related incidents on US campuses, the most in recorded history. There have already been more than 170 school shootings in 2023, and parents, faculty and students are increasingly concerned about their safety. When it comes to saving lives, police response time is crucial and can have a significant impact. Implementing proactive security measures such as ZeroEyes' AI gun detection and situational awareness solution can help mitigate gun-related violence by reducing response times, providing actionable intelligence on the shooter's location, weapon and appearances, and delivering clarity among chaos. ZeroEyes delivers a proactive, human-verified A.I. gun detection software solution that integrates into existing security cameras and mitigates mass shootings and gun-related violence by reducing response times, providing actionable intelligence with images and delivering clarity among chaos – ultimately saving lives. ZeroEyes' patented solution has been recognized by the U.S. Department of Homeland Security (DHS) as a promising anti-terrorism technology and is the first video analytics technology to receive SAFETY Act DT&E Designation. Founded by Navy SEALs and Special Operations military veterans, ZeroEyes delivers accurate and real-time actionable intelligence about the brandishing of a gun near or in an occupied area or building, to local staff and law enforcement with an image of the shooter(s) and location of the threat, within 3 to 5 seconds from the moment the gun is detected. The ZeroEyes team also provides tech consulting, installation assistance and practice drills for active shooter events to enhance safety at schools, corporate and government facilities. Headquartered in the Greater Philadelphia area, the company's affordable and effective gun detection solution has been adopted by the US Department of Defense, leading public K-12 school districts, colleges and universities, commercial property groups, manufacturing plants, Fortune 500 corporate campuses, shopping malls, big-box retail stores and more. about ZeroEyes at zeroeyes.com . How to Build a Custom Security Plan for Gun Violence in K-12 Schools Aug 1, 2024 Ensuring the safety of your students, staff, and visitors requires a tailored approach addressing each school's unique needs and circumstances. Here, we guide you through the essential steps in building a custom security plan to mitigate the risk of gun violence in K-12 schools. read more How to Build a Custom Security Plan for Gun Violence in K-12 Schools Ensuring the safety of your students, staff, and visitors requires a tailored approach addressing each school's unique needs and circumstances. Here, we guide you through the essential steps in building a custom security plan to mitigate the risk of gun violence in K-12 schools. The 6 Phases of Active Shooter Attacks in Commercial Spaces Jul 27, 2024 [SPECIAL REPORT] U.S. businesses are the #1 location of public mass shootings. Places like office buildings, retail stores and gas stations are among those hardest hit. Here, we examine the six critical phases of active shooter incidents in commercial environments. Knowing what's happening and what actions to take can potentially save lives. read more The 6 Phases of Active Shooter Attacks in Commercial Spaces [SPECIAL REPORT] U.S. businesses are the #1 location of public mass shootings. Places like office buildings, retail stores and gas stations are among those hardest hit. Here, we examine the six critical phases of active shooter incidents in commercial environments. Knowing what's happening and what actions to take can potentially save lives. What It's Like to Survive an Active School Shooter Attack Jul 25, 2024 [Content Advisory: This article discusses school shootings, which may be upsetting to some readers.] Devastating active shooter incidents across America have reached crisis levels and they're impacting more schools every year. From the first moments to the aftermath, here's at look at what happens when the unthinkable strikes at school. read more What It's Like to Survive an Active School Shooter Attack [Content Advisory: This article discusses school shootings, which may be upsetting to some readers.] Devastating active shooter incidents across America have reached crisis levels and they're impacting more schools every year. From the first moments to the aftermath, here's at look at what happens when the unthinkable strikes at school.",
    "Latest News ZeroEyes in the News ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… Read More... School Security Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… Read More... AI Detection Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… Read More... AI Detection Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… Read More... School Security Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… Read More... ZeroEyes in the News What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… Read More... ZeroEyes in the News One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… Read More... ZeroEyes in the News WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… Read More... ZeroEyes in the News Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to… Read More... Latest News ZeroEyes in the News ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… Read More... School Security Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… Read More... AI Detection Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… Read More... AI Detection Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… Read More... School Security Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… Read More... ZeroEyes in the News What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… Read More... ZeroEyes in the News One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… Read More... ZeroEyes in the News WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… Read More... ZeroEyes in the News Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to… Read More... Latest News ZeroEyes in the News ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… Read More... School Security Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… Read More... AI Detection Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… Read More... AI Detection Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… Read More... School Security Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… Read More... ZeroEyes in the News What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… Read More... ZeroEyes in the News One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… Read More... ZeroEyes in the News WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… Read More... ZeroEyes in the News Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to… Read More... Latest News ZeroEyes in the News ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… Read More... School Security Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… Read More... AI Detection Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… Read More... AI Detection Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… Read More... School Security Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… Read More... ZeroEyes in the News What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… Read More... ZeroEyes in the News One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… Read More... ZeroEyes in the News WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… Read More... ZeroEyes in the News Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to… Read More... ZeroEyes in the News ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… Read More... ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West [vc_row][vc_column][vc_column_text] ZeroEyes Recognized for Video Analytics in the 2019 SIA New Product Showcase at ISC West ZeroEyes was awarded Honorable Mention in the Video Analytics category at the flagship annual… School Security Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… Read More... Empathy vs. Sympathy Comparison What's The Difference Between Empathy & Sympathy Really? While empathy is the understanding and feeling of somebody's position, sympathy has a few common definitions or general uses which differentiate it… AI Detection Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… Read More... Your Security Cameras Can Be Even More Useful Turning Existing Security Cameras Into Security Guards Many security cameras installed today are high resolution enough to be utilized with ZeroEyes technology. This capacity to retrofit makes the product much… AI Detection Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… Read More... Weapon Recognition Technology Education Technology Education For School Superintendents The ZeroEyes solution requires a dedicated server box to run efficiently. 911 emergency responders can utilize the user interface to access critical information. Also, school… School Security Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… Read More... Defining Empathy For School Safety & Security How Can We Be More Empathetic? Google dictionary defines empathy as \"the ability to understand and share the feelings of another.†While this may sound obvious to some, there are… ZeroEyes in the News What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… Read More... What Is Weapon Recognition Technology? Weapon Recognition Technology Provides Real-Time Response In the wake of school shooting incidents over the past 10 years, people are anxious about creating safe environments. The ability to detect weapons… ZeroEyes in the News One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… Read More... One Year After Parkland, What's Changed? Education Week Retrospective On February 14, 2018, a former student entered a Parkland, Fla., high school with an AR-15 rifle, killing 17 people and wounding 17 others. A year later,… ZeroEyes in the News WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… Read More... WeWork Helps Bunker Labs Companies At the 19th-floor co-working space in Philly, ZeroEyes is raising money and aiming to partner with the Philadelphia School District. Started by a group of former SEALs, Zero Eyes is… ZeroEyes in the News Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to… Read More... Interview with ZeroEyes CEO Mike Lahiff Bunker Labs: Tell us a little about your background. Mike Lahiff: I grew up in the Philly area, graduated from Bishop McDevitt High School in '99, then I went to…",
    "ZeroEyes Announces Phase I SBIR Award from the Department of Defense to Develop Drone-Enabled Active Shooter Deterrence Capabilities PHILADELPHIA, April 15, 2021 /PRNewswire/ — ZeroEyes, Inc. is pleased to announce an AFWERX Phase 1 Small Business Innovation Research (SBIR) award that will allow the company to develop and integrate an active shooter deterrence capability for the US Department of Defense that will leverage both the company's proprietary artificial intelligence (AI) based weapons detection solution and small hand-held drones. AFWERX is the Air Force's team of innovators who encourage and facilitate connections across industry, academia and the military to create transformative opportunities and foster innovation. Dustin Kisling, the company's Vice President of Business Development and head of the Federal team, noted \"This opportunity to work with the Department of Defense will allow ZeroEyes to provide an innovative active shooter response capability that marries our cutting edge analytics with advanced tactical drones, resulting in a much-needed deterrence solution.\" \"In today's fast-paced and ever-changing security landscape it is critical for the DoD and our military to have the most advanced technology available to protect our people and interests globally and domestically\" said, Mike Lahiff, CEO ZeroEyes, \"this type of financial support helps companies such as ZeroEyes continue to innovate and bring solutions to the military and market at large.\" ZeroEyes is the industry's leading AI-based weapons detection solution. Our software integrates into existing security and surveillance camera systems and sends out a series of alerts when a verified gun is detected via our best-in-class weapons detection algorithms. The ZeroEyes platform is the most proactive and actionable early-warning system on the market, allowing users to \"Stop threats at first sight, not first shot.\" Founded by a team of Navy SEALs and military veterans with over 50 years military experience with deep special operations and intelligence community expertise, ZeroEyes is the trusted weapons detection provider of numerous clients, to include the US Department of Defense, leading public K-12 school districts, commercial property groups, Fortune 1000 corporate campuses, shopping malls, and big box retail. The company is headquartered in the Philadelphia area and has additional locations in Washington DC, Hawaii, and Kansas. For more information on ZeroEyes and associated capabilities, please visit www.zeroeyes.com . Acoustic Gunshot Detection vs. Visual Gun Detection Feb 1, 2022 As the old adage goes, don't put all of your eggs in one basket. This is true in many cases, especially when it comes to security planning. Consider security in earlier times - it was incredibly elementary and focused primarily on physical security (usually only one... read more Acoustic Gunshot Detection vs. Visual Gun Detection As the old adage goes, don't put all of your eggs in one basket. This is true in many cases, especially when it comes to security planning. Consider security in earlier times - it was incredibly elementary and focused primarily on physical security (usually only one... The Human Side of Our AI Gun Detection Dec 21, 2021 Machines have been building other machines for quite some time now ⎯⎯ think about robots buildings cars on assembly lines, which began approximately 50 years ago. Though they perform tasks autonomously, they aren't totally self-aware; this isn't The Terminator's... read more The Human Side of Our AI Gun Detection Machines have been building other machines for quite some time now ⎯⎯ think about robots buildings cars on assembly lines, which began approximately 50 years ago. Though they perform tasks autonomously, they aren't totally self-aware; this isn't The Terminator's... Avoiding Deep Learning AI Bias Part 2 Dec 10, 2021 In Part 1 of this series, we discussed sample bias, measurement bias, and prejudice bias in Artificial Intelligence. From the beginning, ZeroEyes has set out to eliminate AI bias from our gun detection platform by focusing on object detection (in this case, weapons of... read more Avoiding Deep Learning AI Bias Part 2 In Part 1 of this series, we discussed sample bias, measurement bias, and prejudice bias in Artificial Intelligence. From the beginning, ZeroEyes has set out to eliminate AI bias from our gun detection platform by focusing on object detection (in this case, weapons of..."
  ]
}