{
  "company": "zorroa.com",
  "dominant_topics": [
    3,
    0,
    -1,
    18
  ],
  "topic_counts": {
    "3": 5,
    "0": 2,
    "-1": 1,
    "18": 1
  },
  "topic_descriptions": {
    "3": "vantage, development, document, ai, prioxis",
    "0": "access, information, security, data, piam",
    "18": "evidence, digital evidence, data, case, attorneys"
  },
  "framing_scores": {
    "framing_ethical": 0.7307692307692307,
    "framing_surveillance": 0.0384615384615384,
    "framing_market": 0.2307692307692307,
    "num_docs": 9
  },
  "topic_timeline": {
    "20": {
      "-1": 1,
      "0": 2,
      "3": 5,
      "18": 1
    }
  },
  "sample_docs": [
    "The smarter way to automate content management with ML APIs. Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. Request a Demo The challenge with applied ML. Machine learning is hard, even when using pre-trained models. 87% of data science projects fail because AI/ML projects are unpredictable by nature and they don't support experimentation and testing in the way of software engineering. The Zorroa solution. Run ML APIs from GCP, AWS, and Azure on your data to start automating media asset tagging, auditing, and classification tasks in minutes. Then experiment, iterate, and evaluate—without code or data science expertise. A no-code path to ML-driven content management. You can manage everything from data ingest to ML analysis, job queue management and metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. The power of Zorroa's multi-provider ML integration. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Types of ML Models We Support Label Detection Face Detection Logo Detection Content Moderation Web Detection Image Description Speech-to-Text Speech Transcription Optical Character Recognition Providers We Use Get richer metadata faster, with less development. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Vendor Orchestration Abstract away account setup, API documentation, billing, and integration requirements. Data Prep & Ingestion at Scale Transcode raw images, videos, and PDF docs to vendor-ready formats and batch upload. Multi-Vendor API Access Layer in features from the latest computer vision APIs from multiple providers, compare results. Data Visualization & Faceted Search View the results, run conditional searches, or filter based on model confidence. Custom Label Support Custom train a model to detect labels that are not supported by the pre-trained APIs. Flexible Development Integrate ML-powered metadata into any app with Python and REST APIs. Interested in seeing sample use cases? Contact Us Kick off machine learning experimentation in under an hour—without code. Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Access top ML APIs from multiple vendors without lock-in. ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required Scale ML projects without the development hours. ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development Contact Us The smarter way to automate content management with ML APIs. Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. Request a Demo Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. The challenge with applied ML. Machine learning is hard, even when using pre-trained models. 87% of data science projects fail because AI/ML projects are unpredictable by nature and they don't support experimentation and testing in the way of software engineering. The Zorroa solution. Run ML APIs from GCP, AWS, and Azure on your data to start automating media asset tagging, auditing, and classification tasks in minutes. Then experiment, iterate, and evaluate—without code or data science expertise. A no-code path to ML-driven content management. You can manage everything from data ingest to ML analysis, job queue management and metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. You can manage everything from data ingest to ML analysis, job queue management and metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. The power of Zorroa's multi-provider ML integration. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Types of ML Models We Support Label Detection Face Detection Logo Detection Content Moderation Web Detection Image Description Speech-to-Text Speech Transcription Optical Character Recognition Get richer metadata faster, with less development. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Vendor Orchestration Abstract away account setup, API documentation, billing, and integration requirements. Data Prep & Ingestion at Scale Transcode raw images, videos, and PDF docs to vendor-ready formats and batch upload. Multi-Vendor API Access Layer in features from the latest computer vision APIs from multiple providers, compare results. Abstract away account setup, API documentation, billing, and integration requirements. Transcode raw images, videos, and PDF docs to vendor-ready formats and batch upload. Layer in features from the latest computer vision APIs from multiple providers, compare results. Data Visualization & Faceted Search View the results, run conditional searches, or filter based on model confidence. Custom Label Support Custom train a model to detect labels that are not supported by the pre-trained APIs. Flexible Development Integrate ML-powered metadata into any app with Python and REST APIs. View the results, run conditional searches, or filter based on model confidence. Custom train a model to detect labels that are not supported by the pre-trained APIs. Integrate ML-powered metadata into any app with Python and REST APIs. Interested in seeing sample use cases? Contact Us Kick off machine learning experimentation in under an hour—without code. Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Access top ML APIs from multiple vendors without lock-in. ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required Scale ML projects without the development hours. ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development",
    "We make machine learning accessible in under an hour with a no-code workflow. ​ Request a Trial Start automating media enrichment tasks like image labeling, classifications, and content moderation using GCP, AWS, and Azure machine learning (ML) APIs in under an hour. No data prep, vendor commitments, or domain expertise required. From unstructured media to metadata-rich, searchable assets in minutes. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your app using Python and REST APIs. Metadata Tagging Automation Face & Logo Detection Video Speech Detection Content Moderation Media Archive Classification Intelligent Keyword Search And just like that—we can eliminate up to 12 months of development work. Kick off ML experiments in under an hour—without code. Point and click workflow supports data source and ML API selection, job queue management, and results viewing all in Zorroa's GUI. D Access best-in-class APIs from multiple vendors. Always be a few clicks away from the most advanced ML from GCP, AWS, Azure and more. No vendor setup, integrations, or lock-ins. D Scale ML projects without the development hours. Break down the barrier to ML adoption. Automate manual tasks with a smarter alternative to in-house ML projects. D See how it works Zorroa Platform Overview How does Zorroa break down the ML adoption barrier? No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs Security is Paramount for Zorroa We leverage state of the art frameworks, infrastructure, and best practices to create a highly secure and hardened environment. To verify we've done our job correctly we partnered with ISE to have their team of analysts and developers conduct independent third-party security evaluations on a regular basis. Review the ISE Partnership We make machine learning accessible in under an hour with a no-code workflow. ​ Request a Trial We make machine learning accessible in under an hour with a no-code workflow. Start automating media enrichment tasks like image labeling, classifications, and content moderation using GCP, AWS, and Azure machine learning (ML) APIs in under an hour. No data prep, vendor commitments, or domain expertise required. From unstructured media to metadata-rich, searchable assets in minutes. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your app using Python and REST APIs. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your app using Python and REST APIs. Metadata Tagging Automation Face & Logo Detection Video Speech Detection Content Moderation Media Archive Classification Intelligent Keyword Search Face & Logo Detection And just like that—we can eliminate up to 12 months of development work. Kick off ML experiments in under an hour—without code. Point and click workflow supports data source and ML API selection, job queue management, and results viewing all in Zorroa's GUI. D Access best-in-class APIs from multiple vendors. Always be a few clicks away from the most advanced ML from GCP, AWS, Azure and more. No vendor setup, integrations, or lock-ins. D Scale ML projects without the development hours. Break down the barrier to ML adoption. Automate manual tasks with a smarter alternative to in-house ML projects. D See how it works Zorroa Platform Overview How does Zorroa break down the ML adoption barrier? No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs Security is Paramount for Zorroa We leverage state of the art frameworks, infrastructure, and best practices to create a highly secure and hardened environment. To verify we've done our job correctly we partnered with ISE to have their team of analysts and developers conduct independent third-party security evaluations on a regular basis. Review the ISE Partnership",
    "The smarter way to automate content management with ML APIs. Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. The challenge with applied ML. Machine learning is hard, even when using pre-trained models. 87% of data science projects fail because AI/ML projects are unpredictable by nature and they don't support experimentation and testing in the way of software engineering. The Zorroa solution. Run ML APIs from GCP, AWS, and Azure on your data to start automating media asset tagging, auditing, and classification tasks in minutes. Then experiment, iterate, and evaluate—without code or data science expertise. A no-code path to ML-driven content management. You can manage everything from data ingest to ML analysis, job queue management to metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. The power of Zorroa's multi-provider ML integration. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Types of ML Models We Support Label Detection Face Detection Logo Detection Content Moderation Video Object Detection Image Description Speech-to-text Optical Character Recognition Video Text Detection Providers We Use Rich metadata faster, with less development. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Vendor Orchestration Abstract away account setup, API documentation, billing, and integration requirements. Data Prep & Ingestion at Scale Search OCR, speech-to-text, and content moderation analyses. Multi-Vendor API Access Layer in features from the latest computer vision APIs from multiple providers, compare results. Data Visualization & Faceted Search View the results, run conditional searches, or filter based on model confidence. Custom Label Support Quickly train a model to detect faces or image classes not already supported by the pre-trained APIs. Flexible Development Integrate ML-powered metadata into any app with Python and REST APs. Interested in seeing sample use cases? Contact Us Kick off ML experimentation in under an hour, without code. Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Access top ML APIs from multiple vendors without lock-in. ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required Scale ML projects without the development hours. ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development The smarter way to automate content management with ML APIs. Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. Zorroa simplifies machine learning (ML) API integration through a GUI-based workflow, so that you can save your coding chops for building real-world applications. The challenge with applied ML. Machine learning is hard, even when using pre-trained models. 87% of data science projects fail because AI/ML projects are unpredictable by nature and they don't support experimentation and testing in the way of software engineering. The Zorroa solution. Run ML APIs from GCP, AWS, and Azure on your data to start automating media asset tagging, auditing, and classification tasks in minutes. Then experiment, iterate, and evaluate—without code or data science expertise. A no-code path to ML-driven content management. You can manage everything from data ingest to ML analysis, job queue management to metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. You can manage everything from data ingest to ML analysis, job queue management to metadata review in our fully designed GUI.Then integrate the resulting metadata into your app using industry standard APIs. The power of Zorroa's multi-provider ML integration. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Our platform is as extensive as the ML API ecosystem. Access ML models built and trained by the best-in-class data scientists. Experiment with and layer in features from an unlimited number of models with just a few clicks. Types of ML Models We Support Label Detection Face Detection Logo Detection Content Moderation Video Object Detection Image Description Speech-to-text Optical Character Recognition Video Text Detection Rich metadata faster, with less development. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Choose your data source, run the APIs, then view the ML-generated image labels in our UI without code. You also get goodies like model confidence, pretty human-readable results, and even an open-sourced search app you can use to power your results search. Vendor Orchestration Abstract away account setup, API documentation, billing, and integration requirements. Data Prep & Ingestion at Scale Search OCR, speech-to-text, and content moderation analyses. Multi-Vendor API Access Layer in features from the latest computer vision APIs from multiple providers, compare results. Abstract away account setup, API documentation, billing, and integration requirements. Search OCR, speech-to-text, and content moderation analyses. Layer in features from the latest computer vision APIs from multiple providers, compare results. Data Visualization & Faceted Search View the results, run conditional searches, or filter based on model confidence. Custom Label Support Quickly train a model to detect faces or image classes not already supported by the pre-trained APIs. Flexible Development Integrate ML-powered metadata into any app with Python and REST APs. View the results, run conditional searches, or filter based on model confidence. Quickly train a model to detect faces or image classes not already supported by the pre-trained APIs. Integrate ML-powered metadata into any app with Python and REST APs. Interested in seeing sample use cases? Contact Us Kick off ML experimentation in under an hour, without code. Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Point and click workflow to run ML No data prep required Accelerate time to proof-of-concept Access top ML APIs from multiple vendors without lock-in. ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required ML features from a broad suite of APIs Ability to compare vendor ML No vendor setup, API documentations, or account management required Scale ML projects without the development hours. ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development ML at a fraction of the cost of DIY integration Agility to keep up with the latest ML Easy integration into software development",
    "We make machine learning accessible in under an hour with a no-code workflow. ​ Start automating content management tasks like image classification and content moderation with machine learning (ML) APIs from GCP, AWS, and Azure. No data prep, vendor lock-ins, or ML expertise needed. Request a Trial From unstructured media to metadata-rich, searchable content in minutes. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your asset management apps using Python and REST APIs. Metadata Tagging Automation Face & Logo Detection Video Speech Detection Content Moderation Media Archive Classification Intelligent Keyword Search And just like that—we can eliminate up to 12 months of development work. Kick off ML experiments in under an hour—without code. Point and click workflows support data ingestion, ML API selection, job queueing, and results analysis all in Zorroa's GUI. D Access best-in-class APIs from multiple vendors. Always be a few clicks away from the most advanced ML from GCP, AWS, Azure and more. No vendor setup, integrations, or lock-ins. D Scale ML projects without the development hours. Break down the barrier to ML adoption. Automate manual tasks with a smarter alternative to in-house ML projects. D See how it works Zorroa Platform Overview How does Zorroa break down the ML adoption barrier? No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs Security is Paramount for Zorroa We leverage state of the art frameworks, infrastructure, and best practices to create a highly secure and hardened environment. To verify we've done our job correctly we partner with ISE to have their team of analysts and developers conduct independent third-party security evaluations on a regular basis. Review the ISE Partnership Contact Us We make machine learning accessible in under an hour with a no-code workflow. ​ Start automating content management tasks like image classification and content moderation with machine learning (ML) APIs from GCP, AWS, and Azure. No data prep, vendor lock-ins, or ML expertise needed. Request a Trial We make machine learning accessible in under an hour with a no-code workflow. From unstructured media to metadata-rich, searchable content in minutes. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your asset management apps using Python and REST APIs. Run pre-trained computer vision models on your images, videos, or PDF docs, then evaluate the output with just a few clicks in our GUI. The resulting metadata can be integrated into your asset management apps using Python and REST APIs. Metadata Tagging Automation Face & Logo Detection Video Speech Detection Content Moderation Media Archive Classification Intelligent Keyword Search Face & Logo Detection And just like that—we can eliminate up to 12 months of development work. Kick off ML experiments in under an hour—without code. Point and click workflows support data ingestion, ML API selection, job queueing, and results analysis all in Zorroa's GUI. D Access best-in-class APIs from multiple vendors. Always be a few clicks away from the most advanced ML from GCP, AWS, Azure and more. No vendor setup, integrations, or lock-ins. D Scale ML projects without the development hours. Break down the barrier to ML adoption. Automate manual tasks with a smarter alternative to in-house ML projects. D See how it works Zorroa Platform Overview How does Zorroa break down the ML adoption barrier? No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs No code needed to run ML experiments Mix and match ML features from multiple providers with a few clicks Automatically transcode data at scale and batch upload Analyze labels and metadata output in Zorroa's GUI out of the box Run faceted search based on model confidence Add custom labels with custom-trained models Eliminate the need to normalize output data from various vendors Integrate resulting metadata into your apps with industry-standard APIs Security is Paramount for Zorroa We leverage state of the art frameworks, infrastructure, and best practices to create a highly secure and hardened environment. To verify we've done our job correctly we partner with ISE to have their team of analysts and developers conduct independent third-party security evaluations on a regular basis. Review the ISE Partnership",
    "Visual Search Company Zorroa Receives $7M in Funding Organize massive collections of images, videos, and documents by David Higham - 24 Jul 2018 No comments Media Mention previous story Visual Search Innovator Zorroa Receives $7M Funding From Gradient Ventures And Strategic Enterprise Partners next story The Funded: 14 Bay Area startups raise over $700M in new funding Visual Search Company Zorroa Receives $7M in Funding Organize massive collections of images, videos, and documents Zorroa Corp., a Berkeley, CA-based search and analysis platform able to automatically extract intelligence from visual assets and apply insights to data-driven business processes, closed a $7M funding round . The round was led by Gradient Ventures, Google's AI-focused, early-stage venture fund, with participation from a number of strategic partners. The company intends to use the funds to expand its Zorroa Visual Intelligence (ZVI) platform, accelerate ongoing feature and usability enhancements, and invest further in employee growth. Led by Dan Wexler, CEO, Zorroa provides a platform that automatically analyzes and organizes a company's large collection of visual assets — digital documents, images, and video — extracting insights and metadata contained in these assets and providing actionable business intelligence. Launched in April of last year, Zorroa Visual Intelligence includes an intuitive user interface and a visual-processing pipeline that automatically organizes massive collections of images, videos, and documents using advanced machine learning and vision algorithms. ZVI adapts to the specific needs of enterprise clients and their different asset-analysis requirements, such as automatic document categorization, facial recognition, natural language processing, and other solutions required in different market verticals. The company's solutions are used by Oil & Gas, Media & Entertainment, and Mortgage & Finance. SHARE THIS Facebook Twitter Linkedin email company funding zorroa platform Zorroa Corp., a Berkeley, CA-based search and analysis platform able to automatically extract intelligence from visual assets and apply insights to data-driven business processes, closed a $7M funding round . The round was led by Gradient Ventures, Google's AI-focused, early-stage venture fund, with participation from a number of strategic partners. The company intends to use the funds to expand its Zorroa Visual Intelligence (ZVI) platform, accelerate ongoing feature and usability enhancements, and invest further in employee growth. Led by Dan Wexler, CEO, Zorroa provides a platform that automatically analyzes and organizes a company's large collection of visual assets — digital documents, images, and video — extracting insights and metadata contained in these assets and providing actionable business intelligence. Launched in April of last year, Zorroa Visual Intelligence includes an intuitive user interface and a visual-processing pipeline that automatically organizes massive collections of images, videos, and documents using advanced machine learning and vision algorithms. ZVI adapts to the specific needs of enterprise clients and their different asset-analysis requirements, such as automatic document categorization, facial recognition, natural language processing, and other solutions required in different market verticals. The company's solutions are used by Oil & Gas, Media & Entertainment, and Mortgage & Finance. Previous post Next post"
  ]
}